     A*%%TS  SD  20020131  130113  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03(03)
     A                                      CF05(05)
     A          R DSP01
     A*%%TS  SD  20020131  130113  TEST        REL-V4R4M0  5769-PW1
     A                                  1  2'AAFC91'
     A                                  1 24'** PARTS LIST BY LOCATION **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  5 22'# OF COPIES:'
     A                                      DSPATR(HI)
     A            COPY           2Y 0B  5 35EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                 23  3'F3:END'
     A                                 23 15'F5:PRINT'
     A                                  7 22'SORT ORDER :' DSPATR(HI)
     A            SORT           1   B  7 35DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A                                  7 39'(1:LOCATION  2:CUSTOMER/PART#)'
