     A*%%TS  SD  20240814  152404  I0777       REL-V7R4M0  5770-WDS
     A** AAHPW01 *********************************
     A*UPDATE OF  PART WITHDRAWAL KANBAN M/F   *
     A*             H.ITO        86.10.04        *
     A*
     A* TCHK1 04/29/11 ADD SAFETY INVENTORY
     A*----------+-----+----------+-----------------------------------*
     A*2021.03.23|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     A*          |     |          |          EXPANSION OF THE "KANBAN"*
     A****************************************************** AAHPW01 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*---------------------------*
     A* ... SCREEN-1 || *.
     A*---------------------------*
     A          R AAHPW011
     A                                      TEXT('THE FIRST SCREEN')
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'* PART WITHDRAWAL KANBAN M/F UPDAT-
     A                                      E *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AAHPW011'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 30'1'
     A                                      DSPATR(RI)
     A                                  5 34'DAILY HANDLING'
     A                                  8 30'2'
     A                                      DSPATR(RI)
     A                                  8 34'HANDLING BY LOCATION CODE KEY DESI-
     A                                      GNATED'
     A                                 11 34'--> INPUT NO'
     A            NO             1A  B 11 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*---------------------------*
     A* ... SCREEN-2 || *.
     A*---------------------------*
     A          R AAHPW012
     A*%%TS  SD  20240814  152404  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE SECOND SCREEN')
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01
     A                                      CF02
     A                                      CF07
     A                                      BLINK
     A                                      ROLLUP(91)
     A                                      ROLLDOWN(92)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'* PART WITHDRAWAL KANBAN M/F UPDAT-
     A                                      E *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AAHPW012'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4  2'NO'
     A                                      DSPATR(RI)
     A                                  4 17'PRESENT PROCESS'
     A                                      DSPATR(RI)
     A                                  5 20'RTV P/N'
     A                                      DSPATR(RI)
     A                                  4 34'PRESENT PROCESS'
     A                                      DSPATR(RI)
     A                                  5 35'LOCATION CODE'
     A                                      DSPATR(RI)
     A                                  4 51'PRESENT'
     A                                      DSPATR(RI)
     A                                  5 51'PROCESS'
     A                                      DSPATR(RI)
     A                                  4 60'EFFECTIVE'
     A                                      DSPATR(RI)
     A                                  5 60'DATE BIN'
     A                                      DSPATR(RI)
     A                                  4 72'LAPSE'
     A                                      DSPATR(RI)
     A                                  5 71'DATE BIN'
     A                                      DSPATR(RI)
     A            NO1            4Y 0O  6  2EDTCDE(4)
     A                                      OVRDTA
     A            NO2            4Y 0O  8  2EDTCDE(4)
     A                                      OVRDTA
     A            NO3            4Y 0O 10  2EDTCDE(4)
     A                                      OVRDTA
     A            NO4            4Y 0O 12  2EDTCDE(4)
     A                                      OVRDTA
     A            NO5            4Y 0O 14  2EDTCDE(4)
     A                                      OVRDTA
     A            NO6            4Y 0O 16  2EDTCDE(4)
     A                                      OVRDTA
     A            NO7            4Y 0O 18  2EDTCDE(4)
     A                                      OVRDTA
     A            CM1            8A  O  6  7OVRDTA
     A            CM2            8A  O  8  7OVRDTA
     A            CM3            8A  O 10  7OVRDTA
     A            CM4            8A  O 12  7OVRDTA
     A            CM5            8A  O 14  7OVRDTA
     A            CM6            8A  O 16  7OVRDTA
     A            CM7            8A  O 18  7OVRDTA
     A            DI1           14A  O  6 17OVRDTA
     A            DI2           14A  O  8 17OVRDTA
     A            DI3           14A  O 10 17OVRDTA
     A            DI4           14A  O 12 17OVRDTA
     A            DI5           14A  O 14 17OVRDTA
     A            DI6           14A  O 16 17OVRDTA
     A            DI7           14A  O 18 17OVRDTA
     A            PL1            9A  O  6 36OVRDTA
     A            PL2            9A  O  8 36OVRDTA
     A            PL3            9A  O 10 36OVRDTA
     A            PL4            9A  O 12 36OVRDTA
     A            PL5            9A  O 14 36OVRDTA
     A            PL6            9A  O 16 36OVRDTA
     A            PL7            9A  O 18 36OVRDTA
     A            KT1            8A  O  6 50OVRDTA
     A            KT2            8A  O  8 50OVRDTA
     A            KT3            8A  O 10 50OVRDTA
     A            KT4            8A  O 12 50OVRDTA
     A            KT5            8A  O 14 50OVRDTA
     A            KT6            8A  O 16 50OVRDTA
     A            KT7            8A  O 18 50OVRDTA
     A            FR1            9A  O  6 60OVRDTA
     A            FR2            9A  O  8 60OVRDTA
     A            FR3            9A  O 10 60OVRDTA
     A            FR4            9A  O 12 60OVRDTA
     A            FR5            9A  O 14 60OVRDTA
     A            FR6            9A  O 16 60OVRDTA
     A            FR7            9A  O 18 60OVRDTA
     A            TO1            9A  O  6 71OVRDTA
     A            TO2            9A  O  8 71OVRDTA
     A            TO3            9A  O 10 71OVRDTA
     A            TO4            9A  O 12 71OVRDTA
     A            TO5            9A  O 14 71OVRDTA
     A            TO6            9A  O 16 71OVRDTA
     A            TO7            9A  O 18 71OVRDTA
     A                                 20  9'UPDATE NO.'
     A                                      DSPATR(UL)
     A            BANGO          4Y 0B 20 24DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 21 43' LOCATION M/F UPDATE '
     A                                 21 72'CMD-7'
     A                                      DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 39'BACKWARD'
     A                                 24 48'ROLL-DWN'
     A                                      DSPATR(RI)
     A                                 24 59'FORWARD'
     A                                 19  3'|'
     A                                 20  3'+'
     A                                 20  5'-->'
     A                                 24 67'ENTER.ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 18'PRV.SCREEN'
     A                                 24 30'CMD-2'
     A                                      DSPATR(RI)
     A*
     A*---------------------------*
     A* ... SCREEN-3 || *.
     A*---------------------------*
     A          R AAHPW013
     A                                      TEXT('THE THIRD SCREEN')
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01
     A                                      CF02
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'* PART WITHDRAWAL KANBAN M/F UPDAT-
     A                                      E *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AAHPW013'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 34'LOCATION CODE'
     A                                      DSPATR(RI)
     A            L6ATK1         1A  B  8 33DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  8 35'-'
     A            L6ATK2         2A  B  8 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  8 40'-'
     A            L6ATK3         2A  B  8 42DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  8 45'-'
     A            L6ATK4         1A  B  8 47DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 22'PREVIOUS SCREEN'
     A                                 24 39'CMD-2'
     A                                      DSPATR(RI)
     A*---------------------------*
     A* ... SCREEN-4 || *.
     A*---------------------------*
     A          R AAHPW014
     A                                      TEXT('THE FOURTH SCREEN')
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF02
     A                                      CF03
     A                                      CF05
     A                                      CF04
     A                                      CF06
     A                                      BLINK
     A                                  1 21'* PART WITHDRAWAL KANBAN M/F UPDAT-
     A                                      E *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AAHPW014'
     A                                  2 68'DATE'
     A                                  2 73DATE
     A                                      EDTCDE(Y)
     A                                  3 68'TIME'
     A                                  3 73TIME
     A                                  2  2'UPDATE'
     A            KOSN           8A  O  2 15OVRDTA
     A                                  3  2'PART NUMBER'
     A            SHIN          14A  O  3 15OVRDTA
     A                                  5  2'KANBAN ADJUSTMENT'
     A                                      DSPATR(RI)
     A                                  5 20'HAND-'
     A                                  6  2'  ALL   MIN   MAX  LING'
     A                                      DSPATR(UL)
     A                                  5 27'KANBAN'
     A                                      DSPATR(UL)
     A                                  6 27'SHEETS'
     A                                      DSPATR(UL)
     A                                  5 35'REASON'
     A                                      DSPATR(UL)
     A                                  6 35'CODE  '
     A                                      DSPATR(UL)
     A                                  5 42'CALCULATION'
     A                                      DSPATR(UL)
     A                                  6 42'NBR PER DAY'
     A                                      DSPATR(UL)
     A                                  5 54'FIXED'
     A                                      DSPATR(UL)
     A                                  6 54'NBR PER DAY'
     A                                      DSPATR(UL)
     A                                  5 66'ACCOMMODATED'
     A                                      DSPATR(UL)
     A                                  6 66'QPC-UNIT COLOR'
     A                                      DSPATR(UL)
     A            L6KALL         5Y 0O  7  2EDTCDE(3)
     A                                      OVRDTA
     A            L6KMIN         5Y 0O  7  8EDTCDE(3)
     A                                      OVRDTA
     A            L6KMAX         5Y 0O  7 14EDTCDE(3)
     A                                      OVRDTA
     A            L6SRMS         5Y 0O  7 20EDTCDE(3)
     A                                      OVRDTA
     A            WKMAX          5Y 0O  7 28EDTCDE(3)
     A                                      OVRDTA
     A            KSKBN          1Y 0O  7 37OVRDTA
     A            L6KSSU         9Y 0O  7 42EDTCDE(1)
     A                                      OVRDTA
     A            L6KTSU         9Y 0B  7 54DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            L6SYOS         5Y 0B  7 66DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            L6SYOT         1A  B  7 73DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            L6HSYU         1A  B  7 77DSPATR(CS)
     A                                      OVRDTA
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            L6HSNM        12A  O  8 68OVRDTA
     A******                                COLOR(WHT)
     A                                  9  2'SETTING CODE'
     A                                      DSPATR(UL)
     A            WSTI1          2A  B 10  2DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            WSET           2A  O 11  2OVRDTA
     A            SETNM         16A  O 10  5OVRDTA
     A                                  9 23'MAX'
     A                                      DSPATR(UL)
     A            L6MAXH         3Y 0B 10 22DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Q)
     A                                      OVRDTA
     A                                  9 28'LOT'
     A                                      DSPATR(UL)
     A            L6LOTO         2Y 0B 10 28DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  9 33'L.T'
     A                                      DSPATR(UL)
     A            L6LTIM         3Y 1B 10 33DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  9 40'COEFFICIENT'
     A                                      DSPATR(UL)
     A            L6KEIS         3Y 2B 10 42DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  9 54'KANBAN KIND'
     A                                      DSPATR(UL)
     A            L6KCD1         1A  O 10 54OVRDTA
     A                                 10 56'-'
     A            L6KCD2         1A  O 10 58OVRDTA
     A            KCDNM         20A  O 10 60OVRDTA
     A                                 13  2'PAPER'
     A                                      DSPATR(UL)
     A            WYOSI          4A  B 14  2DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 12  8'DRAWING'
     A                                      DSPATR(UL)
     A                                 13  9'INST.'
     A                                      DSPATR(UL)
     A            L6ZMEN         1A  B 14 11DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 12 20'INST.'
     A                                      DSPATR(UL)
     A                                 13 16'WHICH SORTS IT'
     A                                      DSPATR(UL)
     A            ZMEN           1A  O 15 11OVRDTA
     A            L6SHIY         2Y 0O 14 20EDTCDE(Z)
     A                                      OVRDTA
     A                                 12 32'PICK-UP CONDITION'
     A                                      DSPATR(UL)
     A                                 13 32'1-1'
     A            L6JOK1         2A  B 13 36DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            JNM1          16A  O 13 39OVRDTA
     A                                 14 32'1-2'
     A            L6JOK2         2A  B 14 36DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            JNM2          16A  O 14 39OVRDTA
     A                                 15 32'1-3'
     A            L6JOK3         2A  B 15 36DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            JNM3          16A  O 15 39OVRDTA
     A                                 12 56'ASSEMBLED FORM CONDITION'
     A                                      DSPATR(UL)
     A                                 13 56'1-1'
     A            L6JOK4         2A  B 13 60DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            JNM4          16A  O 13 64OVRDTA
     A                                 14 56'2-1'
     A            L6JOK5         2A  B 14 60DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            JNM5          16A  O 14 64OVRDTA
     A                                 15 56'2-2'
     A            L6JOK6         2A  B 15 60DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            JNM6          16A  O 15 64OVRDTA
     A                                 16 56'2-3'
     A            L6JOK7         2A  B 16 60DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            JNM7          16A  O 16 64OVRDTA
     A                                 16  2'REMARKS COLUMN'
     A                                      DSPATR(UL)
     A            L6BIKO        20A  B 16 18DSPATR(CS)
     A                                      OVRDTA
     A                                 17  2'PRECEDING'
     A                                      DSPATR(UL)
     A                                 18  2'PROCESS    TYPE BD'
     A                                      DSPATR(UL)
     A                                 17 25'PRESENT'
     A                                      DSPATR(UL)
     A                                 18 25'PROCESS    TYPE BD'
     A                                      DSPATR(UL)
     A                                 17 47'EFFECTIVE DATE'
     A                                      DSPATR(UL)
     A                                 18 51'-BIN'
     A                                      DSPATR(UL)
     A                                 17 65'LAPSE DATE'
     A                                      DSPATR(UL)
     A                                 18 67'-BIN'
     A                                      DSPATR(UL)
     A            ATOK2          8A  O 19 25OVRDTA
     A            L6ATYP         1A  B 19 36DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            WATOH          1Y 0O 19 41OVRDTA
     A            NMA           18A  O 20 25OVRDTA
     A            ATKR           9A  O 21 35OVRDTA
     A            MAEK2          8A  O 19  2OVRDTA
     A            L6MTYP         1A  B 19 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            WMAEH          2Y 0O 19 18OVRDTA
     A            NMB           18A  O 20  2OVRDTA
     A            MTKR           9A  O 21 12OVRDTA
     A            L6UKHZ         8Y 0O 19 49OVRDTA
     A            L6UBIN         2Y 0O 20 52EDTCDE(4)
     A                                      OVRDTA
     A            L6STHZ         8Y 0O 19 66OVRDTA
     A            L6SBIN         2Y 0O 20 68EDTCDE(4)
     A                                      OVRDTA
     A                                 21  2'LOCATION'
     A                                      DSPATR(RI)
     A                                 21 25'LOCATION'
     A                                      DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  2'KEY INPUT'
     A                                   + 1'F3'
     A                                      DSPATR(RI)
     A                                   + 2'UPDATE OK'
     A                                   + 1'F5'
     A                                      DSPATR(RI)
     A                                   + 2'PICK-UP LOT'
     A                                   + 1'F2'
     A                                      DSPATR(RI)
     A                                   + 2'SAFETY'
     A                                   + 1'F4'
     A                                      DSPATR(RI)
     A                                   + 2'BOX COLOR'
     A                                   + 1'F6' DSPATR(RI)
