     A*******************************************
     A*UPDATE OF SERVICE ROUTE M/F           *
     A*                      M S K 87.04.03 *
     A*******************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AAKPW211
     A*%%TS  SD  19960925  153236  HIRO        REL-V3R0M5  5763-PW1
     A                                      CA01
     A                                      BLINK
     A                                  1 25'** SERVICE ROUTE M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AAKPW211'
     A                                  9 32'UPDATE'
     A                                      DSPATR(UL)
     A                                  9 41'ROUTE CODE'
     A                                      DSPATR(UL)
     A            @KUBUN         1A  B 11 34DSPATR(CS)
     A  11
     AO 10                                  DSPATR(RI)
     A  11
     AO 10                                  DSPATR(PC)
     A            @KEIRO         3A  B 11 45DSPATR(CS)
     A  11                                  DSPATR(RI)
     A                                 11 18'+--------->'
     A                                 12 18'|'
     A                                 13 11'+-----------------+'
     A                                 14 11'| 0= CANCEL       |'
     A                                 15 11'| 1= CHANGE       |'
     A                                 16 11'| 2= ADD          |'
     A                                 17 11'+-----------------+'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(RI)
     A                                 24  5'EXIT'
     A                                 24 11'CMD-1'
     A                                      DSPATR(RI)
     A          R AAKPW212
     A*%%TS  SD  19960925  153236  HIRO        REL-V3R0M5  5763-PW1
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                  1 25'** SERVICE ROUTE M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AAKPW212'
     A                                  4 10'ROUTE CODE'
     A            @KCORD         3A  O  4 21
     A                                  8  4'THE FIRST'
     A                                  8 20'THE FIRST'
     A                                  8 36'THE SECOND'
     A                                  8 52'THE SECOND'
     A                                  8 68'THE THIRD'
     A                                  9  2'BIN KIND CODE BROADCAST SECTION BI-
     A                                      N KIND CODE BROADCAST SECTION BIN K-
     A                                      IND CODE'
     A                                      DSPATR(UL)
     A            @BIN1          4A  B 11  6DSPATR(CS)
     A  12
     AO 13                                  DSPATR(RI)
     A  12
     AO 13                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A            @BMN1          4Y 0B 11 22DSPATR(CS)
     A                                      EDTCDE(Z)
     A  17
     AO 13                                  DSPATR(RI)
     A  17
     AO 13                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A            @BIN2          4A  B 11 38DSPATR(CS)
     A  14
     AO 15                                  DSPATR(RI)
     A  14
     AO 15                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A            @BMN2          4Y 0B 11 54DSPATR(CS)
     A                                      EDTCDE(Z)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A            @BIN3          4A  B 11 70DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  30                                  DSPATR(PR)
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(RI)
     A                                 24  3'PREVIOUS SCREEN'
     A                                 24 20'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 27'INPUT OK'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
