     A** AAMPW80 ***********************************
     A*かんばん回転日数データ作成              *
     A*     MSK.    2011.01.06                     *
     A**********************************************
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R AAMPW801
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26' **かんばん回転日数+
     A                                      データ作成** '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AAMPW80'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                  6 22'部門' DSPATR(RI)
     A            D1BMON         4   B  6 31DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                  6 36'（ブランク＝すべて）'
      *
     A                                 10 18'出力条件' DSPATR(RI)
     A            D1OUT          1   B 10 31DSPATR(CS)
     A  37                                  DSPATR(RI PC)
     A                                 10 34'--->'
     A                                 10 39'１：部門・自工程・所番地順'
     A                                 11 39'２：部門・自工程・品番順'
     A                                 12 39'３：部門・自工程・合計のみ'
      *
     A                                 23  2' d[ｰ '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            @ERR          60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'終了'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'データ作成'
