     A*%%TS  SD  20250220  093923  I0777       REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03(03)
     A          R DSP01
     A*%%TS  SD  20250220  093923  I0777       REL-V7R4M0  5770-WDS
     A                                  1  3'AAMC27'
     A                                  1 16'** PUBLICATION  INTRA-PROCESS KANB-
     A                                      AN **'
     A                                      DSPATR(RI)
     A                                  1 59DATE
     A                                      EDTCDE(Y)
     A                                  1 68TIME
     A            LIN1          78A  O  2  2DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  4 16'1.RENEWAL OF PARTS INFORMATION MAS-
     A                                      TER'
     A                                  6 16'2.RENEWAL OF PRODUCTION KANBAN'
     A                                  8 16'3.ISSUING OF PRODUCTION KANBAN'
     A                                 10 16'4.RE-ISSUING OF PRODUCTION KANBAN'
     A                                 13 18'SELECT ->'
     A                                      DSPATR(HI)
     A            SLCT           1A  B 13 29DSPATR(CS)
     A            LIN2          78A  O 22  2DSPATR(UL)
     A                                      COLOR(BLU)
     A                                 23  4'F3:END'
