     A** AANPW10 *************************************
     A* PUBLICATION OF HALF FINISHED KANBAN(DAILY) *
     A* CODING:K.OKACHI    2002.05.27                *
     A************************************* AANPW10 **
      *
     A          R AANPW101
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      KEEP
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
      *
     A                                  1 20'  PUBLICATION OF HALF-FINISHED -
     A                                      GOODS KANBAN'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
      *
     A                                  1 69'FMT AANPW10'
      *
     A                                 23 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 23 18'NO DATA'
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'CANCEL'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'MAKING OK'
     A                                 24 35'CMD-5'
     A                                      DSPATR(RI)
