     A** AARPW01 ***************************
     A*DELETE  OF PLATING ACCOUNT RECEIVABLE UNIT PRICE M/F
     A* A.IDOTA 1995.07.03 *
     A*************************** AARPW01 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A************
     A* SCREEN 1*
     A************
     A          R AARPW011
     A*%%TS  SD  19961107  110803  AO          REL-V3R0M5  5763-PW1
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 19'* PLATING ACCOUNT RECEIVABLE UNIT -
     A                                      PRICE M/F DELETE *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2 68'FMT AARPW011'
     A                                  7 10'PLATING ACCOUNT RECEIVABLE UNIT PR-
     A                                      ICE M/F'
     A                                  9 10'THAT HAD BE TOTAL ABOLISHED PART N-
     A                                      UMBER OF PART M/F LAST MONTH DELETE-
     A                                      .'
     A                                 11 10'IF IT IS OK, PUSH CMD-5.'
     A                                 24  5'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 25'UPDATE'
     A                                 24 35'CMD-5'
     A                                      DSPATR(RI)
