     A** AAXPW01 *********************************
     A* .. LIMITATION KANBAN DISKETTE PUBLICATION || *
     A* .. Y. DAILY HANDLIN G
     A* .. N. REISSUE
     A*        I-HASADA            87.10.13      *
     A********************************* AAXPW01 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A*----- ------- ------- ------*
     A* ...SCRE EN 1... *
     A*----- ------- ------- ------*
     A          R AAXPW011
     A*%%TS  SD  19960925  155723  HIRO        REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('LIMITATION KANBAN DISKETT PUB-
     A                                      LICATION 1')
     A                                      CF01(01)
     A                                  1 20'* PUBLICATION OF LIMITATION -
     A                                      KANBAN DISKETT *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 65'FMT AAXPW01 1'
     A                                  8 16'INPUT LIMITATION KANBAN DISKETT -
     A                                      PUBLICATION CONDITION!!'
     A                                 11 31'+-------------------------+'
     A                                 12 31'|'
     A                                 13 31'|'
     A                                 13 36'Y: DAILY HANDLING   '
     A            RKUBN          1A  B 14 21DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 14 24'<----- |'
     A                                 15 34'  N: REISSUE   '
     A                                 16 31'|'
     A                                 17 31'+-------------------------+'
     A                                 12 57'|'
     A                                 13 57'|'
     A                                 14 57'|'
     A                                 15 31'|'
     A                                 15 57'|'
     A                                 16 57'|'
     A  99                             22  8'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A  99        MSG           60A  O 22 16
     A                                 24 11'CANCEL'
     A                                 24 19'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*-------------------------*
     A* ...SCREEN 2... *
     A*-------------------------*
     A          R AAXPW012
     A*%%TS  SD  19960925  155723  HIRO        REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('LIMITATION KANBAN DISKETT PUB-
     A                                      LICATION 2')
     A                                      CF01(01)
     A                                      CF02(02)
     A                                  1 20'* PUBLICATION OF LIMITATION -
     A                                      KANBAN DISKETT *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AAXPW012'
     A                                  6 21'WHICH DISKETT WILL YOU REISSUE?'
     A                                  8 21'INPUT DATE AND TIME OF LIMITED -
     A                                      INSTRUCTIONS BOOK !!'
     A                                 11 21'DATE'
     A                                      DSPATR(RI)
     A                                 11 37'TIME'
     A                                      DSPATR(RI)
     A            RHIZK          8A  B 13 21DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            RTIME          4A  B 13 37DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A  99                             22  8'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 16
     A                                 24 11'CANCEL'
     A                                 24 19'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 40'PREVIOUS SCREEN'
     A                                 24 57'CMD-2'
     A                                      DSPATR(RI)
