     A*%%TS  SD  20230713  144024  I0777       REL-V7R3M0  5770-WDS
     A**************************************************************************
     A*          CREATE LABEL DATA OF FORD                                     *
     A* TCH 02.02.2000                                                         *
     A* TCH 03.24.2000 ADD DELIVERY & NAME CUSTOMER
     A* TCH 06.15.2000 ADD BIN
     A* TCH22 1/28/05   INCREASE THE SIZE OF BIN
     A* TCHK1 04/25/12 ADD GROUP CONTROL
     A**************************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01(01 'EXIT')
     A                                      CF05(05 'CREATE')
     A                                      CF12
     A                                      CF10
     A          R FMT00
     A*%%TS  SD  20221107  152111  I0777       REL-V7R3M0  5770-WDS
     A                                      CF09
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'** CREATE FORD LABEL DATA **'
     A                                      DSPATR(RI)
     A                                  1 72'AB#PWRF1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  8 25'BARCODE:'
     A            D@BARC         9A  B  8 34CHECK(ER)
     A                                      DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            XMSG          60A  O 20 13DSPATR(HI)
     A                                 23  4'F1: END      F9: MANUAL ENTRY'
     A                                 23 39'F10:RECREATE MASTER LABEL DATA'
     A          R FMT01
     A*%%TS  SD  20221107  152111  I0777       REL-V7R3M0  5770-WDS
     A                                      CF08
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'CREATE LABEL DATA OF FORD'
     A                                      DSPATR(RI)
     A                                  1 66'FMT'
     A                                  1 73'AB#RF1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 21'DELIVERY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  4 33'DOCK'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #DELY          4A  B  5 21DSPATR(UL)
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A            #DOCK          4A  B  5 33DSPATR(UL)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  5 41'SHIPPING DATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  5 58'BIN'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6 19'OR'
     A                                  7 21'GROUP#'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #GRP           1A  B  7 28DSPATR(UL)
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A            #SHDTY         4A  B  7 41DSPATR(UL)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A            #SHDTM         2A  B  7 47DSPATR(UL)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A            #SHDTD         2A  B  7 51DSPATR(UL)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
TCH22A*           INOTM          1A  B  7 59DSPATR(UL)
     A            INOTM          2A  B  7 58DSPATR(UL)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                  9  2'KANSAS:5150'
     A                                  9 19'ARGEN :5100'
     A                                  9 41'RELEASE DATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 10  2'LORAIN:5151'
     A                                 10 19'AUSTR :5111'
     A                                 11  2'ONTAR :5154'
     A                                 11 19'BRAZL :5115'
     A            #DELIY         4A  B 11 41DSPATR(UL)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A            #DELIM         2A  B 11 47DSPATR(UL)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A            #DELID         2A  B 11 51DSPATR(UL)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 12  2'NRFLK :5156'
     A                                 12 19'VENEZ :5118'
     A                                 13  2'KTYTRK:5153'
     A                                 13 19'HOFU  :5120'
     A                                 14  2'LSVLL :5157'
     A                                 14 19'9999  :ALL'
     A                                 15  2'EDISON:5158'
     A                                 16  2'ST LS :5159'
     A                                 17  2'TW CY :5160'
     A                                 18  2'CHIHU :5162'
     A                                 19  2'CUATIT:5163'
     A            XMSG          60A  O 22 14DSPATR(HI)
     A                                 23  4'F1: END'
     A                                 23 16'F5: CREATE'
     A                                 23 31'F8: REISSUE ALL'
     A                                 23 52'F12: BACK'
     A          R FMT02
     A*%%TS  SD  20230713  144024  I0777       REL-V7R3M0  5770-WDS
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'CREATE LABEL DATA OF FORD'
     A                                      DSPATR(RI)
     A                                  1 66'FMT'
     A                                  1 73'AB#RF1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 14'SHIP TO:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  4 25EDTCDE(4)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                  5 14'DOCK:'
     A                                      DSPATR(HI)
     A            D@NUKE         4A  B  5 25
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  6 14'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@SHDT         8Y 0B  6 25EDTCDE(4)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  6 36'(YYYYMMDD)'
     A                                  7 14'BIN:'
     A                                      DSPATR(HI)
     A            D@BIN          2Y 0B  7 25EDTCDE(4)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                  8 14'RELEASE DATE:'
     A                                      DSPATR(HI)
     A            D@RLDT         8Y 0B  8 28EDTCDE(4)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                  8 37'(YYYYMMDD)'
     A                                 10 12'PALLET#:'
     A                                      DSPATR(HI)
     A            D@PL01         2Y 0B 10 21EDTCDE(4)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            D@PL02         2Y 0B 10 24EDTCDE(4)
     A            D@PL03         2Y 0B 10 27EDTCDE(4)
     A            D@PL04         2Y 0B 10 30EDTCDE(4)
     A            D@PL05         2Y 0B 10 33EDTCDE(4)
     A            D@PL06         2Y 0B 10 36EDTCDE(4)
     A            D@PL07         2Y 0B 10 39EDTCDE(4)
     A            D@PL08         2Y 0B 10 42EDTCDE(4)
     A            D@PL09         2Y 0B 10 45EDTCDE(4)
     A            D@PL10         2Y 0B 10 48EDTCDE(4)
     A            XMSG          60A  O 21 13DSPATR(HI)
     A                                 23  5'F5: CREATE'
     A                                      DSPATR(RI)
     A                                  2 26'--- MASTER LABEL DATA ---'
     A                                 23 21'F12: BACK'
     A                                      DSPATR(RI)
