     A*%%TS  SD  20220126  145258  I0777       REL-V7R3M0  5770-WDS
     A* SHIP/SCHEDULE BOXES INQ BY MACHINE
     A* J.WATANABE    2021.03.04
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF07
     A                                      CF08
     A                                      CF12
     A*
     A          R SFL01                     SFL
     A*%%TS  SD  20220126  145258  I0777       REL-V7R3M0  5770-WDS
     A            #IN41          1A  H
     A*
     A            S1SIZ         11A  O  5  2
     A  41                                  COLOR(WHT)
     A            S1BX1          7Y 0O  5 15EDTCDE(2)
     A  41                                  COLOR(WHT)
     A            S1BX2          7Y 0O  5 26EDTCDE(2)
     A  41                                  COLOR(WHT)
     A            S1BX3          7Y 0O  5 37EDTCDE(2)
     A  41                                  COLOR(WHT)
     A            S1BX4          7Y 0O  5 48EDTCDE(2)
     A  41                                  COLOR(WHT)
     A            S1BX5          7Y 0O  5 59EDTCDE(2)
     A  41                                  COLOR(WHT)
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20220126  145258  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0018)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A                                      OVERLAY
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A            #PGM           8A  O  1  2
     A                                  1 16'** FORD EDI ORDER HISTORY INQ BY P-
     A                                      ART **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4  2'SIZE'
     A                                      DSPATR(UL)
     A                                  4 10'MCN'
     A                                      DSPATR(UL)
     A            D1DT1         10A  O  4 14DSPATR(RI)
     A            D1DT2         10A  O  4 25DSPATR(RI)
     A            D1DT3         10A  O  4 36DSPATR(RI)
     A            D1DT4         10A  O  4 47DSPATR(RI)
     A            D1DT5         10A  O  4 58DSPATR(RI)
     A*
     A          R DSP99
     A*%%TS  SD  20220126  145117  I0777       REL-V7R3M0  5770-WDS
     A            XMSG          70A  O 23  2DSPATR(HI)
     A            XCMD          70A  O 24  2COLOR(BLU)
