     A*%%TS  SD  20021122  103334  TEST        REL-V4R4M0  5769-PW1
     A** AB#PW38 ******************************************************
     A*  ..EDI(810) INVOICE DATA & CANADA CUSTOM SHEET REISSURANCE    *
     A*       I-HASADA                               97.06.26         *
     A*       N-HYOTO  ADD CUSTOMER                  99.11.19         *
     A*       N-HYOTO  ADD CUSTOMER                  99.11.23         *
     A****************************************************** AB#PW38 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      CF01
     A                                      CF09
     A                                      CF05
     A                                      CF12
     A*
     A          R SFL01                     SFL
     A            S@BARC         9A  O 10  2
     A            H@NONY         4  0H
     A            H@NKOJ         1   H
     A            H@NOHZ         8  0H
     A            H@NOBN         2  0H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020515  125657  TEST        REL-V4R4M0  5769-PW1
     A  *DS3                                SFLLIN(0002)
     A                                      SFLSIZ(0085)
     A                                      SFLPAG(0084)
     A                                      KEEP
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 24' CREATE ASN/INVOICE DATA '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'AB#PW3W'
     A                                  8  7' BARCODE '
     A                                      DSPATR(RI)
     A                                  4  7' CONTAINER WEIGHT '
     A                                      DSPATR(RI)
     A            PWEIG          5Y 2B  6 12DSPATR(CS)
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  4 45' RECREATE EDI DATA'
     A                                      DSPATR(RI)
     A            PRISU          1A  B  6 48DSPATR(CS)
     A                                  6 51'(1=RECREATE)'
     A            D@BAR          9A  B  8 17DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      CHECK(ER)
     A  02                                  DSPATR(RI)
     A                                  4 29'SHIP TIME'
     A                                      DSPATR(RI)
     A            STM            4A  B  6 31DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  7 31'HHMM'
     A          R DSP99
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 23 18
     A            D@CMD         78     24  2
     A          R WINDSP
     A*%%TS  SD  20020506  145341  TEST        REL-V4R4M0  5769-PW1
     A                                      WINDOW(5 15 10 50)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '...:::.:'))
     A                                      CF07
     A                                  2 17'TRUCK NUMBER ENTRY'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  4  6'TRUCK#:'
     A            PTRCK         10A  B  4 14DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  9  3'F1:END    F5:UPDATE   F12:GO BACK'
     A                                  9 39'F7:NEXT'
     A          R WIN02
     A*%%TS  SD  20020916  111714  TEST        REL-V4R4M0  5769-PW1
     A                                      CF07
     A                                      WINDOW(3 15 15 50)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '...:::.:'))
     A                                  2 10'TRUCK NUMBER & SCAC CODE ENTRY'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  4  6'TRUCK#:' DSPATR(HI)
     A            PTRCK         10A  B  4 14DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                 14  3'F1:END    F5:UPDATE   F12:GO BACK'
     A                                 14 39'F7:NEXT'
     A                                  5  6'SCAC CODE:' DSPATR(HI)
     A            PSCAC          4A  B  5 18DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  6  6'TRANSPORTATION TYPE:'
     A                                      DSPATR(HI)
     A            PTRAN          1   B  6 28DSPATR(CS)
     A  63                                  DSPATR(RI PC)
     A                                  7 10'1.CONTRACT CARRIER/SUPPLIER EXPENS-
     A                                      E'
     A                                  8 10'2.EXPEDITED TRUCK/SUPPLIER EXPENSE'
     A                                  9 10'3.CUSTOMER PICKUP/CUSTOMER EXPENSE'
     A                                 10 10'4.MOTOR'
     A                                 11 10'5.SUPPLIER TRUCK'
     A          R SFL02                     SFL
     A*%%TS  SD  20021122  103334  TEST        REL-V4R4M0  5769-PW1
     A            S@MANI        16A  O  6 22
     A            S@ADN          4Y 0O  6 41EDTWRD('  /  ')
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20021122  102527  TEST        REL-V4R4M0  5769-PW1
     A                                      CF07
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 32'** WARNING **'
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 69TIME
     A                                  3 12'Some manifests are not scanned!!'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  5 22'Manifest#'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  5 40'ASN date'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
