     A*%%TS  SD  20040927  103216  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R W01
     A*%%TS  SD  20040927  103216  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A                                      WINDOW(5 15 10 40)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI))
     A                                  3  1'ASN Data has been created successf-
     A                                      ully.'
     A                                      DSPATR(HI)
     A                                  5  1'Press ENTER key to continue.'
     A                                      DSPATR(HI)
