     A*%%TS  SD  20250423  155700  I0777       REL-V7R4M0  5770-WDS
     A* TCHK1 01/14/09 CREATE
     A* TCHK2 04/24/10 ADD IAF PART# INQUIRY
     A* TCHK3 05/06/11 ADD ALL INQUIRY
     A* TCHK4 07/02/13 ADD EACH PROCESS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01(01)
     A          R DSP01
     A*%%TS  SD  20250423  155700  I0777       REL-V7R4M0  5770-WDS
     A            #PGM           8A  O  1  2
     A                                  1 21'** DAILY ORDER CONTAINER INQ **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  3 14'1. TOYOTA'
     A                                      DSPATR(HI)
     A                                  5 14'2. HONDA '
     A                                      DSPATR(HI)
     A                                  7 14'3. FORD  '
     A                                      DSPATR(HI)
     A                                  9 14'4. TIER1 '
     A                                      DSPATR(HI)
     A                                 11 14'5. IAF PART#'
     A                                      DSPATR(HI)
     A                                 13 14'6. PROCESS  '
     A                                      DSPATR(HI)
     A                                 19 13'99. ALL SHIP'
     A                                      DSPATR(HI)
     A                                 22 13'SELECTION -->'
     A                                      DSPATR(HI)
     A            D@SLCT         2Y 0B 22 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(BL)
     A  41        D@MSG         78A  O 23  2
     A  41                                  DSPATR(BL)
     A                                 24  3'F1:END'
     A                                 15 14'7. SHIPPED CONTAINER BY PART# (Sin-
     A                                      gle)'
     A                                      DSPATR(HI)
     A                                 17 14'8. SHIPPED CONTAINER BY PART# (Mul-
     A                                      tiple)'
     A                                      DSPATR(HI)
