     A*%%TS  SD  20040827  143628  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R SFL01                     SFL
     A*%%TS  SD  20040827  143628  TEST        REL-V5R1M0  5722-WDS
     A            S@MHIN        20A  O  5  2
     A            S@USYS         5Y 0O  5 23EDTCDE(1)
     A  61                                  DSPATR(RI)
     A            S@ISYS         5Y 0O  5 31EDTCDE(1)
     A            S@SRYO         9Y 0O  5 39EDTCDE(1)
     A  62                                  DSPATR(RI)
     A            S@SETQ         5Y 0O  5 51EDTCDE(1)
     A            S@ERR         22A  O  5 58DSPATR(HI)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20040827  143628  TEST        REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM           8A  O  1  2
     A                                  1 23'* QUANTITY/CONTAINER DIFFERENCE *'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4  2'USER PART NUMBER'
     A                                      DSPATR(HI)
     A                                  3 25'USER'
     A                                      DSPATR(HI)
     A                                  4 22'QTY/CONT'
     A                                      DSPATR(HI)
     A                                  3 33'IAF'
     A                                      DSPATR(HI)
     A                                  4 31'QTY/CONT'
     A                                      DSPATR(HI)
     A                                  4 42'SHIP QTY'
     A                                      DSPATR(HI)
     A                                  3 51'# of '
     A                                      DSPATR(HI)
     A                                  4 51'Kanbns'
     A                                      DSPATR(HI)
     A                                  2 50'Setting'
     A                                      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
