     A*%%TS  SD  20040316  151956  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A          R DSP01
     A*%%TS  SD  20040316  151956  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 25'** HONDA IPP TAG ENTRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4 18'SHIP TO:'
     A                                      DSPATR(HI)
     A            D@SHIP         4  0B  4 29DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI PC)
     A                                  5 18'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@SHDT         8Y 0B  5 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A                                  6 18'USER PART NUMBER:'
     A                                      DSPATR(HI)
     A            D@MHN1         5A  B  6 36DSPATR(CS)
     A  63                                  DSPATR(RI PC)
     A            D@MHN2         5A  B  6 42DSPATR(CS)
     A  63                                  DSPATR(RI)
     A            D@MHN3         5A  B  6 48DSPATR(CS)
     A  63                                  DSPATR(RI)
     A            D@MHN4         5A  B  6 54DSPATR(CS)
     A  63                                  DSPATR(RI)
     A                                  5 39'YYYYMMDD'
     A          R DSP02
     A*%%TS  SD  20040316  143618  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8   O  1  2
     A                                  1 25'** HONDA IPP TAG ENTRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4 18'SHIP TO:' DSPATR(HI)
     A            D@SHIP         4  0O  4 27
     A                                  5 18'SHIP DATE:' DSPATR(HI)
     A            D@SHDT         8  0O  5 29EDTWRD('    /  /  ')
     A                                  6 18'USER PART NUMBER:' DSPATR(HI)
     A            D@MHN1         5   O  6 36
     A            D@MHN2         5   O  6 42
     A            D@MHN3         5   O  6 48
     A            D@MHN4         5   O  6 54
     A                                  8 17'IPP TAG1:' DSPATR(HI)
     A            D@IPT1        15   B  8 27DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A                                  9 17'REASON CODE 1:' DSPATR(HI)
     A            D@RSN1         2   B  9 32DSPATR(CS)
     A                                      CHECK(RB)
     A  62                                  DSPATR(RI PC)
     A                                 11 17'IPP TAG2:'   DSPATR(HI)
     A            D@IPT2        15   B 11 27DSPATR(CS)
     A  63                                  DSPATR(RI PC)
     A                                 12 17'REASON CODE 2:'  DSPATR(HI)
     A            D@RSN2         2   B 12 32DSPATR(CS)
     A                                      CHECK(RB)
     A  64                                  DSPATR(RI PC)
     A                                 14  4'--------------------- REASON CODES-
     A                                       ------------------------------'
     A                                 15  4'1. Design Change'
     A                                 16  4'2. New Supplier'
     A                                 17  4'3. Material Change'
     A                                 18  4'4. Mfg. Method Change'
     A                                 19  4'5. Mfg. Process Order Change'
     A                                 20  4'6. Machine Change'
     A                                 15 40'7. Jog/Tool Change'
     A                                 16 40'8. Die/Mold Change'
     A                                 17 40'9. Inspetion Method Change'
     A                                 18 39'10. Transport/Packing Change'
     A                                 19 39'11. Sort'
     A                                 20 39'12. Other'
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
