     A*** AB#PW2D ******************************************
     A* HONDA SHORTAGES                                    *
     A*     LEC.          2021/08/02                       *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF03(03)
     A                                  1  3'HONDA - SHORTAGES'
     A                                  3  3'CONTAINER LABEL'
     A            BAR01         18A  B  4  2
     A                                 11  2'F3=BACK'
     A            MSG           25A  O 12  2
     A                                 11 16'SHORT ='
     A            D1SHRT         3Y 0O 11 24EDTCDE(Z)
