     A*%%TS  SD  20230410  110418  I0777       REL-V7R3M0  5770-WDS
     A** AB#PW5D ***********************************
     A*  LONG KANBAN#/RELEASE# INQUIRY             *
     A*  J.WATANABE    2021.08.27                  *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*----------------------------------------------------------------
     A          R SFL01                     SFL
     A*%%TS  SD  20230410  110418  I0777       REL-V7R3M0  5770-WDS
     A            @RRN           4Y 0H
     A*
     A            S1CUS#         4Y 0O  5  3EDTCDE(Z)
     A            S1DEL#         4Y 0O  5  8EDTCDE(Z)
     A            S1NAME         6A  O  5 13
     A            S1DOCK         4A  O  5 20
     A            S1MHN1         5A  O  5 25
     A            S1MHN2         5A  O  5 31
     A            S1MHN3         5A  O  5 37
     A            S1VDAT         8Y 0O  5 43EDTWRD('    /  /  ')
     A                                      COLOR(YLW)
     A            S1KAN#        10A  O  5 54COLOR(TRQ)
     A            S1REL#        15A  O  5 65COLOR(PNK)
     A*----------------------------------------------------------------
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20230407  091040  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      CF01
     A                                      CF03
     A                                      BLINK
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      PROTECT
     A  71                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  98                                  SFLEND(*MORE)
     A                                      ROLLUP(73)
     A                                      ROLLDOWN(73)
     A            DSPRRN         4S 0H      SFLRCDNBR
     A                                  1  3'AB#R5CB'
     A                                  1 22'** LONG KANBAN#/RELEASE# INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3'CUST# POSITION:'
     A                                  4  3'CUST DELV NAME   DOCK'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 25'CUSTOMER PART#   '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 43'VALID FROM'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 54'KANBAN#   '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 65'RELEASE#       '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            XTOKU          4   B  2 19DSPATR(UL)
     A*
     A          R DSP99
     A*%%TS  SD  20200701  101928  I0777       REL-V7R3M0  5770-WDS
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                 24  7' PREV '
     A                                 24 58' PAGE UP/DOWN '
     A                                      DSPATR(RI)
