     A*%%TS  SD  20040715  100312  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01
     A                                      CF05
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20040715  100312  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 19'** Create BILL OF LADING for HINO -
     A                                      **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  4 15'CARRIER:'
     A                                      DSPATR(HI)
     A            D@CARR        15A  B  4 26DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 15'SHIP TO:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  5 26DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A                                  6 15'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@DATE         8Y 0B  6 26DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A                                  6 35'YYYYMMDD'
     A                                  7 15'BIN:'
     A                                      DSPATR(HI)
     A            D@NBIN         2Y 0B  7 26DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
