     A*%%TS  SD  20250408  085355  I0777       REL-V7R4M0  5770-WDS
     A** AGDPW01 *********************************
     A* IAF PRODUCTION PLACE OPERATION CALENDAR *
     A*                  S.YAMAGAMI 90.12.19 *
     A***********************************AGDPW01**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R DSP01
     A*%%TS  SD  20250408  085355  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF09(09)
     A                                      CF12(12)
     A  99                                  ALARM
     A                                      BLINK
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'** ORDER INQUIRY MENU **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AB#PW160'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 16'OPTION'
     A                                  6 19' 1 '
     A                                      DSPATR(RI)
     A                                  6 23'ORDER INQ BY ORDER#        <AB#R16-
     A                                      1>'
     A                                  8 19' 2 '
     A                                      DSPATR(RI)
     A                                  8 23'ORDER INQ BY INVOICE#      <AB#R16-
     A                                      2>'
     A                                 10 19' 3 '
     A                                      DSPATR(RI)
     A                                 10 23'ORDER INQ BY PACKING LIST# <AB#R16-
     A                                      3>'
     A                                 12 19' 4 '
     A                                      DSPATR(RI)
     A                                 12 23'ORDER CHANGE HISTORY       <AB#C1O-
     A                                       >'
     A                                 14 19' 5 '
     A                                      DSPATR(RI)
     A                                 14 23'SHIPPING TRACK INQ         <ALDC01-
     A                                       >'
     A                                 19 16'SELECT OPTION -->'
     A            XOPT           1A  B 19 34DSPATR(PC)
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            XMSG          60A  O 22 16
     A                                 24  7'F1:'
     A                                      DSPATR(RI)
     A                                 24 11'EXIT'
     A                                 24 23'ENTR'
     A                                      DSPATR(RI)
     A                                 24 28'NEXT'
     A                                 24 41'F9:'
     A                                      DSPATR(RI)
     A                                 24 45'INQ BY PO#/DELV#'
     A                                 16 19' 6 '
     A                                      DSPATR(RI)
     A                                 16 23'EDI ORDER INQ              <AB#R12-
     A                                      I>'
