     A** AB#PW67 *****************
     A*  ..SPECIAL   ORDERING..  *
     A*  I-HASADA      97.08.23  *
     A***************** AB#PW67 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R AB#PW671
     A                                      CF01(01)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 24'  **   SPECIAL    ORDERING   -
     A                                      **  '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'AB#PW67'
      *
     A                                  6 11' DELIVERY '
     A                                      DSPATR(RI)
     A                                  6 24' PICK-UP DATE '
     A                                      DSPATR(RI)
     A                                  6 41' ORDER NO '
     A                                      DSPATR(RI)
     A                                  6 54' CONTAINER WEIGHT '
     A                                      DSPATR(RI)
      *
     A            PSIRE          4A  B  8 12DSPATR(CS)
     A  02                                  DSPATR(RI PC)
     A                                  8 17'-'
     A            PSIRK          1A  B  8 19DSPATR(CS)
     A  03                                  DSPATR(RI PC)
     A            PNOHZ          8A  B  8 27DSPATR(CS)
     A  04                                  DSPATR(RI PC)
     A            PODRN         10A  B  8 41DSPATR(CS)
     A  06                                  DSPATR(RI PC)
     A            PWEIG          5Y 2B  8 60DSPATR(CS) EDTCDE(1) AUTO(RAB)
     A  07                                  DSPATR(RI PC)
     A                                  9 28'YYMMDD'
      *
     A                                 11 11'TMMK   3347-0'
     A                                 12 11'NUMMI  0541-0'
     A                                 13 11'TMMC   3503-B'
      *
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 21 18
      *
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 25'MAKING OK'
     A                                 24 35'CMD-5'
     A                                      DSPATR(RI)
