     A*%%TS  SD  20010830  134616  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R DUMMY
     A                                      ASSUME
     A                                      PUTOVR
     A                                  1  2' '
     A                                      DSPATR(ND)
     A          R WSFL1                     SFL
     A*%%TS  SD  20010816  092428  TEST        REL-V3R7M0  5716-PW1
     A            S@OPTN         1   B  4  2
     A            S@CRD          4   O  4  4
     A            S@CRNM        16   O    +2
     A          R WCTL1                     SFLCTL(WSFL1)
     A*%%TS  SD  20010816  102859  TEST        REL-V3R7M0  5716-PW1
     A                                      WINDOW(W01)
     A                                      OVERLAY
     A                                      CF12
     A  55                                  SFLDSP
     A  55                                  SFLDSPCTL
     A  56                                  SFLCLR
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A                                  3  2'X'
     A                                  2  8'CARD OPTION'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A          R W999
     A*%%TS  SD  20010816  103720  TEST        REL-V3R7M0  5716-PW1
     A                                      WINDOW(W01)
     A                                      OVERLAY
     A                                  9  2'F12:GO BACK'
     A          R W01
     A*%%TS  SD  20010830  134616  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      WINDOW(10 2 10 35)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '...:::.:'))
     A                                      USRRSTDSP
