     A*%%TS  SD  20040329  151959  TEST        REL-V5R1M0  5722-WDS
     A** AB#PW2C *********************************
     A*  ..EDI AGAI LABEL PRINTING..             *
     A*                                          *
     A*  N.HYOTO 2000.12.22                       *
     A*  N.HYOTO 2001.04.04                       *
     A********************* AB#PW2C **************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R AB#PWSN0
     A*%%TS  SD  20040329  151055  TEST        REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF05
     A                                      CF09
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 19'** CREATE MIXED LOAD FOR NAPLD SER-
     A                                      VICE PARTS **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AB#PWSN'
     A                                  7 20'BARCODE:'
     A                                      DSPATR(HI)
     A            D@BAR          9A  B  7 29CHECK(ER)
     A                                      DSPATR(CS)
     A                                      DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A  87                             23  4'LABEL DATA HAS BEEN CREATED.    '
     A  87                                  COLOR(TRQ)
     A  87                                  DSPATR(RI)
     A  87                                  DSPATR(BL)
     A                                 24  4'F3:END'
     A                                      DSPATR(RI)
     A                                 24 15'F5:CREATE'
     A                                      DSPATR(RI)
     A                                 24 29'F9:MANUAL ENTRY'
     A                                      DSPATR(RI)
     A                                  5 20'# OF PALLETS:'
     A                                      DSPATR(HI)
     A            D@PLT          2Y 0B  5 34EDTCDE(4)
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A          R AB#PWSN2
     A*%%TS  SD  20040329  151959  TEST        REL-V5R1M0  5722-WDS
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      CF12
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 19'** CREATE MIXED LOAD FOR NAPLD SER-
     A                                      VICE PARTS **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AB#PWSN'
     A                                  4 15'MANDATORY -------------------------
     A                                      ---------------'
     A                                  5 15'DELIVERY'
     A                                      DSPATR(RI)
     A            PNONY          4A  B  7 15DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  5 27'FACTORY'
     A                                      DSPATR(RI)
     A            PNKOJ          1A  B  7 27DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  5 38'DOCK'
     A                                      DSPATR(RI)
     A            PNUKE          4A  B  7 38DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                  5 46'PICK-UP DATE'
     A                                      DSPATR(RI)
     A            PNOHZ          8Y 0B  7 46DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                  8 46'YYYYMMDD'
     A                                 11 15'OPTIONAL --------------------------
     A                                      ---------------'
     A                                 12 15'BIN'
     A                                      DSPATR(RI)
     A            BIN            2Y 0B 14 16DSPATR(CS)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 12 23'ORDER#'
     A                                      DSPATR(RI)
     A            PORD#         10A  B 14 23DSPATR(CS)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A  30                             23  2'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  30        MSG           60A  O 23  9
     A  87                             23  4'LABEL DATA HAS BEEN CREATED.    '
     A  87                                  COLOR(TRQ)
     A  87                                  DSPATR(RI)
     A  87                                  DSPATR(BL)
     A                                 24  4'F3:END'
     A                                      DSPATR(RI)
     A                                 24 12'F5:CREATE'
     A                                      DSPATR(RI)
     A                                 24 45'F12:GO BACK'
     A                                      DSPATR(RI)
     A                                  5 61'# OF PALLETS'
     A                                      DSPATR(RI)
     A            D@PLT          2Y 0B  7 66EDTCDE(4)
     A                                      DSPATR(CS)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A*****************************************************************
     A          R AB#PWSN1
     A  30                             23  2'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  30        MSG           60A  O 23  9
     A                                 24  4'F3:END'
     A                                      DSPATR(RI)
     A                                 24 12'F5:CREATE'
     A                                      DSPATR(RI)
     A                                 24 23'F12:PREVIOUS SCREEN'
     A                                      DSPATR(RI)
