     A*%%TS  SD  20011023  124922  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20011015  152026  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A            #PGM           8   O  1  2
     A                                  1 19'** CREATE KANBAN DATA FOR SERVICE -
     A                                      PARTS **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  5 19'PART#'
     A                                      DSPATR(HI)
     A            D@PRT1         5   B  5 27DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A            D@PRT2         5   B  5 33DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            D@PRT3         2   B  5 39DSPATR(CS)
     A  61                                  DSPATR(RI)
     A          R SFL01                     SFL
     A*%%TS  SD  20011015  152026  TEST        REL-V3R7M0  5716-PW1
     A            S@SLCT         1   B  5  6DSPATR(CS)
     A            S@PRT1         5   O  5  9
     A            S@PRT2         5   O  5 15
     A            S@PRT3         2   O  5 21
     A            S@SLC1         2   O  5 25
     A            S@SLC2         2   O  5 28
     A            S@OLC1         2   O  5 33
     A            S@OLC2         2   O  5 36
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20011015  152026  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF12
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      SFLSIZ(0035)
     A                                      SFLPAG(0034)
     A                                      SFLLIN(0007)
     A            #RCNO          4  0H      SFLRCDNBR
     A            #PGM           8   O  1  2
     A                                  1 19'** CREATE KANBAN DATA FOR SERVICE -
     A                                      PARTS **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4  6'X' DSPATR(HI UL)
     A                                  4  9'PART#'  DSPATR(HI UL)
     A                                  3 27'LOCATION' DSPATR(HI UL)
     A                                  4 24'SERVICE' DSPATR(HI UL)
     A                                  4 32'ORIGINAL' DSPATR(HI UL)
     A                                  4 45'X'     DSPATR(HI UL)
     A                                  4 48'PART#' DSPATR(HI UL)
     A                                  3 66'LOCATION' DSPATR(HI UL)
     A                                  4 63'SERVICE'  DSPATR(HI UL)
     A                                  4 71'ORIGINAL' DSPATR(HI UL)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
