     A*** AB#PWFQ***************************************************************
     A*   PRINT WEEKLY ORDER SHEET                                             *
     A*       2001.02.19  N.HYOTO                                              *
TCHK1A* TCHK1 12/23/05 ADD PRINTER(LANPRT05,LANPRT10)
     A**************************************************************************
     A                                      PRINT
     A                                      CHGINPDFT(UL)
     A          R AB#PWFQ1                  CF03 CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26' PRINT WEEKLY ORDER SHEET'
     A                                      DSPATR(RI)
     A                                  1 66'FMT'
     A                                  1 73'AB#PWFQ'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A*
     A                                  4  9'DATE'
     A                                      DSPATR(RI)
     A            @YY            4Y 0B  4 14
     A  01                                  DSPATR(PC RI)
     A            @MM            2Y 0B  4 20
     A  01                                  DSPATR(PC RI)
     A            @DD            2Y 0B  4 24
     A  01                                  DSPATR(PC RI)
     A*
     A                                  5 14'THE SHIPPMENT WILL COVERED-
     A                                       BY THIS DATE'
TCHK1A*TCH47                           21 47'1.LANPRT02 2.LANPRT07'
TCHK1A*   |                                 DSPATR(HI)
TCHK1A*                                21 70'3.LANPRT08'
TCHK1A*                                     DSPATR(HI)
TCHK1A*                                22 47'4.LANPRT03 5.QPRINTA'
TCHK1A*                                     DSPATR(HI)
TCHK1A*                                22 70'6.LANPRT09'
TCHK1A*   |                                 DSPATR(HI)
TCHK1A*TCH47      P@PRT          1   B 21 45RANGE('1' '6')
TCHK1A                                 20  3'PRINTER:'
TCHK1A                                      DSPATR(HI)
TCHK1A            P@PRT          1A  B 20 12DSPATR(CS)
TCHK1A                                      RANGE('1' '9')
TCHK1A                                 20 15'1.LANPRT02(APICS)'
TCHK1A                                 20 34'2.LANPRT07(APICS)'
TCHK1A                                 20 53'3.LANPRT08(DOCK 6)'
TCHK1A                                 21 15'4.LANPRT03(OFFICE)'
TCHK1A                                 21 34'5.PIRNTER A(APICS)'
TCHK1A                                 21 53'6.LANPRT09'
TCHK1A                                 22 15'7.LANPRT10(DOCK 6)'
TCHK1A                                 22 34'8.LANPRT05(TOOL ROOM)'
     A*
     A  99                             23 02' ERROR '
     A  99                                  DSPATR(RI BL)
     A  98        MSG           60     23 10
     A  98                                  DSPATR(BL HI)
     A                                 24  6'F3:EXIT'
     A                                 24 15'F5:PRINT'
