     A*%%TS  SD  20041022  161144  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                      CF09
     A          R DSP01
     A*%%TS  SD  20041022  133230  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 23'** REPRINT CONTAINER LABELS **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4 24'CUSTOMER:'
     A                                      DSPATR(HI)
     A            D@CUST         4Y 0B  4 35EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 24'DELIVERY:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  5 35EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  6 24'FACTORY:'
     A                                      DSPATR(HI)
     A            D@NKOJ         1A  B  6 35DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                  7 24'DOCK:'
     A                                      DSPATR(HI)
     A            D@NUKE         4A  B  7 35DSPATR(CS)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                  8 24'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@SHDT         8Y 0B  8 35EDTCDE(4)
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  8 44'YYYYMMDD'
     A                                  9 24'BIN:'
     A                                      DSPATR(HI)
     A            D@BIN          2Y 0B  9 35EDTCDE(4)
     A                                      DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                  1 51' '
     A          R SFL01                     SFL
     A*%%TS  SD  20041022  161144  TEST        REL-V5R1M0  5722-WDS
     A            S@SLC1         1A  B  5  4DSPATR(CS)
     A            S@MHN1         5A  O  5  7
     A            S@MHN2         5A  O  5 13
     A            S@MHN3         5A  O  5 19
     A            S@MHN4         5A  O  5 25
     A            S@QTY          9Y 0O  5 32EDTCDE(1)
     A            H@SHN1         5A  H
     A            H@SHN2         5A  H
     A            H@SHN3         2A  H
     A            S@ORNO        10   O  5 45
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20041022  161144  TEST        REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #RCN1          4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 23'** REPRINT CONTAINER LABELS **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3'CUST:'
     A            D@CUST         4S 0O  2  9
     A            D@NKOJ         1A  O  2 14
     A                                  2 17'DELIVERY:'
     A            D@NONY         4S 0O  2 27
     A                                  2 33'DOCK:'
     A            D@NUKE         4A  O  2 39
     A                                  2 47'SHIP DATE:'
     A            D@SHDT         8Y 0O  2 58EDTWRD('    /  /  ')
     A                                  2 70'BIN:'
     A            D@BIN          2Y 0O  2 75EDTCDE(4)
     A                                  4 35'QUANTITY'
     A                                      DSPATR(HI)
     A                                  4  7'CUSTOMER PART NUMBER'
     A                                      DSPATR(HI)
     A                                  4  4'X'
     A                                      DSPATR(HI)
     A                                  4 45'ORDER#'
     A                                      DSPATR(HI)
     A          R SFL02                     SFL
     A*%%TS  SD  20041022  124621  TEST        REL-V5R1M0  5722-WDS
     A            S@SLC2         1A  B  6  6DSPATR(CS)
     A            S@ILBL        18A  O  6  9
     A            S@SCAN         8Y 0O  6 28EDTWRD('    /  /  ')
     A            S@TIME         6Y 0O  6 39EDTWRD('  :  :  ')
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20041022  161144  TEST        REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A            #RCN2          4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 23'** REPRINT CONTAINER LABELS **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3'CUST:'
     A            D@CUST         4S 0O  2  9
     A            D@NKOJ         1A  O  2 14
     A                                  2 17'DELIVERY:'
     A            D@NONY         4S 0O  2 27
     A                                  2 33'DOCK:'
     A            D@NUKE         4A  O  2 39
     A                                  2 47'SHIP DATE:'
     A            D@SHDT         8Y 0O  2 58EDTWRD('    /  /  ')
     A                                  2 70'BIN:'
     A            D@BIN          2Y 0O  2 75EDTCDE(4)
     A                                  5  6'X'
     A                                      DSPATR(HI)
     A                                  5  9'IAF LABEL #'
     A                                      DSPATR(HI)
     A                                  5 29'SCAN DATE'
     A                                      DSPATR(HI)
     A                                  3  3'CUST PART#:'
     A            D@MHN1         5A  O  3 15
     A            D@MHN2         5A  O  3 21
     A            D@MHN3         5A  O  3 27
     A            D@MHN4         5A  O  3 33
     A                                  5 41'TIME'
     A                                      DSPATR(HI)
     A                                  4 43'F9:Select all.'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  3 41'ORDER#:'
     A            D@ORNO        10   O  3 49
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
