     A*%%TS  SD  20250421  094950  I0777       REL-V7R4M0  5770-WDS
     A* TCHK1 12/12/08 CREATE(COPY FROM ABAPW44)
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP01
     A*%%TS  SD  20250421  094950  I0777       REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 17'** TOYOTA DOCK DAILY ORDER CONTAIN-
     A                                      ER INQ **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A*
     A                                  4 33'START'
     A                                      DSPATR(HI)
     A                                  4 44'END'
     A                                      DSPATR(HI)
     A                                  5 25'DATE:'
     A                                      DSPATR(HI)
     A            D@FRM          8Y 0B  5 31EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 40'-'
     A            D@TO           8Y 0B  5 42EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A*
     A                                  6 31'YYYYMMDD'
     A                                  6 42'YYYYMMDD'
     A  61        D@MSG         45A  O  7 31
      *
     A          R DSP99
     A            D@CMD         78   O 24  2
     A*
     A          R SFL02                     SFL
     A*%%TS  SD  20200611  102208  I0777       REL-V7R3M0  5770-WDS
     A            S2SEL          1A  B  6  2
     A            S2BNM         15A  O  6  4
     A            S2B@A1         6Y 1O  6 21EDTCDE(2)
     A            S2B@A2         6Y 1O  6 31EDTCDE(2)
     A            S2B@A3         6Y 1O  6 41EDTCDE(2)
     A            S2B@A4         6Y 1O  6 51EDTCDE(2)
     A            S2B@A5         6Y 1O  6 61EDTCDE(2)
     A            S2B@A6         6Y 1O  6 71EDTCDE(2)
     A            S2BSQ#         4A  H
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20250421  094950  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A N58                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF08
     A                                      CF09
     A            #RCNO2         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 17'** TOYOTA DOCK DAILY ORDER CONTAIN-
     A                                      ER INQ **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  3  2'       Date'
     A            D@SDT1         8A  O  3 21DSPATR(RI)
     A            D@SDT2         8A  O  3 31DSPATR(RI)
     A            D@SDT3         8A  O  3 41DSPATR(RI)
     A            D@SDT4         8A  O  3 51DSPATR(RI)
     A            D@SDT5         8A  O  3 61DSPATR(RI)
     A            D@SDT6         8A  O  3 71DSPATR(RI)
     A                                  4  2'Daily  Total'
     A            D@DTT1         6Y 1O  4 21EDTCDE(2)
     A            D@DTT2         6Y 1O  4 31EDTCDE(2)
     A            D@DTT3         6Y 1O  4 41EDTCDE(2)
     A            D@DTT4         6Y 1O  4 51EDTCDE(2)
     A            D@DTT5         6Y 1O  4 61EDTCDE(2)
     A            D@DTT6         6Y 1O  4 71EDTCDE(2)
     A*
     A          R SFL03                     SFL
     A            S3BNM         15A  O  6  4
     A            S3B@A1         6Y 1O  6 21EDTCDE(2)
     A            S3B@A2         6Y 1O  6 31EDTCDE(2)
     A            S3B@A3         6Y 1O  6 41EDTCDE(2)
     A            S3B@A4         6Y 1O  6 51EDTCDE(2)
     A            S3B@A5         6Y 1O  6 61EDTCDE(2)
     A            S3B@A6         6Y 1O  6 71EDTCDE(2)
     A          R CTL03                     SFLCTL(SFL03)
     A*%%TS  SD  20250421  094950  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A  66                                  SFLDSP
     A  66                                  SFLDSPCTL
     A  67                                  SFLCLR
     A N68                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      CF10
     A                                      CF12
     A                                      CF08
     A                                      CF09
     A            #RCNO3         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 17'** TOYOTA DOCK DAILY ORDER CONTAIN-
     A                                      ER INQ **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  3  2'       Date'
     A            D3SDT1         8A  O  3 21DSPATR(RI)
     A            D3SDT2         8A  O  3 31DSPATR(RI)
     A            D3SDT3         8A  O  3 41DSPATR(RI)
     A            D3SDT4         8A  O  3 51DSPATR(RI)
     A            D3SDT5         8A  O  3 61DSPATR(RI)
     A            D3SDT6         8A  O  3 71DSPATR(RI)
     A                                  4  2'Daily  Total'
     A            D3DTT1         6Y 1O  4 21EDTCDE(2)
     A            D3DTT2         6Y 1O  4 31EDTCDE(2)
     A            D3DTT3         6Y 1O  4 41EDTCDE(2)
     A            D3DTT4         6Y 1O  4 51EDTCDE(2)
     A            D3DTT5         6Y 1O  4 61EDTCDE(2)
     A            D3DTT6         6Y 1O  4 71EDTCDE(2)
