     A*%%TS  SD  20010820  110103  TEST        REL-V3R7M0  5716-PW1
     A** AB#PW40 ***********************
     A* ..EDI FIXED ORDER DATA AMEND.. *
     A*   I-HASADA          97.06.28   *
     A*   H.ITO             00.03.17   *
     A*   N.HYOTO           00.08.16   *
     A*   N.HYOTO           01.03.01   *
     A*   N.HYOTO           01.06.27 ADD SIA FIT&WH LOCATION *
     A********************************************* AB#PW40 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A*
     A          R DSP01
     A*%%TS  SD  20010816  082902  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 21' **  EDI FIXED ORDER DATA    AMEND-
     A                                       ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AB#PW40'
     A                                  5  2' UPDATE '
     A                                      DSPATR(RI)
     A                                  5 11' COSTOMER '
     A                                      DSPATR(RI)
     A                                  5 22' DELIVERY '
     A                                      DSPATR(RI)
     A                                  5 33' FACTORY '
     A                                      DSPATR(RI)
     A                                  5 43' DOCK '
     A                                      DSPATR(RI)
     A            KTYPE          1A  B  7  5DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            D@CUST         4A  B  7 14DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            D@DELV         4A  B  7 24DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            D@FACT         1A  B  7 36DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D@DOCK         4A  B  7 44DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  5 50' ORDER NO '
     A                                      DSPATR(RI)
     A                                  5 61' PICK-UP DATE '
     A                                      DSPATR(RI)
     A            D@ORDR        10A  B  7 50DSPATR(CS)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            D@PKDT         8Y 0B  7 61DSPATR(CS)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A                                  7 70'-'
     A            D@BIN          2Y 0B  7 72DSPATR(CS)
     A                                      EDTCDE(Z)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 11 50'RELEASED YMD'
     A                                      DSPATR(RI)
     A            D@RLDT         8Y 0B 13 52DSPATR(CS)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A  26                             15 51'NIRVANA ONLY'
     A                                  9  3'0-CANCEL'
     A                                 10  3'1-CHANGE'
     A                                 11  3'2-ADD'
     A                                  9 26'TMMK   3347-0'
     A                                 10 26'NUMMI  0541-0'
     A                                 11 26'TMMC   3503-B'
     A                                  9 63'YMD'
     A                                  9 72'BIN'
     A                                 13  3'CHANGE REASON'
     A                                      DSPATR(RI)
     A            D@RSN          1   B 15  6DSPATR(CS)
     A  10                                  DSPATR(RI PC)
     A                                 15 10'1:MISTAKE'
     A                                 16 10'2:SHORTAGE'
     A                                 17 10'3:CUST REQ'
     A          R SFL01                     SFL
     A*%%TS  SD  20010820  082957  TEST        REL-V3R7M0  5716-PW1
     A            S@DEL          1   B  7  2
     A N20                                  DSPATR(PR ND)
     A  20                                  DSPATR(CS)
     A            S@MHN1         5A  B  7  4DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            S@MHN2         5A  B  7 10DSPATR(CS)
     A  01                                  DSPATR(RI)
     A            S@MHN3         5A  B  7 16DSPATR(CS)
     A  01                                  DSPATR(RI)
     A            S@MHN4         5A  B  7 22DSPATR(CS)
     A  01                                  DSPATR(RI)
     A            S@QTY          7Y 0B  7 29DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            S@SBN          4A  B  7 38DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            S@USYS         6Y 0B  7 44EDTCDE(4)
     A                                      DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            S@ORID         1A  B  7 52DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            S@BLDT         6Y 0B  7 55DSPATR(CS)
     A                                      EDTCDE(Y)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                      EDTMSK('  &  &  ')
     A            S@IVNO        16A  B  7 64DSPATR(CS)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20010820  082957  TEST        REL-V3R7M0  5716-PW1
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      OVERLAY
     A                                      CF12
     A                                      CF05
     A                                      CF07
     A                                      CF08
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            @RCN1          4S 0H      SFLRCDNBR
     A                                  6 45'/CONT'
     A                                      DSPATR(HI)
     A                                  5 55'BILLING'
     A                                      DSPATR(HI)
     A                                  6 57'DATE'
     A                                      DSPATR(HI)
     A                                  6  4'USER PART#'
     A                                      DSPATR(HI)
     A                                  6 33'QTY'
     A                                      DSPATR(HI)
     A                                  6 51'EXP'
     A                                      DSPATR(HI)
     A                                  5 43'USR QTY'
     A                                      DSPATR(HI)
     A                                  6 37'KANBAN'
     A                                      DSPATR(HI)
     A                                  6 64'INVOICE#'
     A                                      DSPATR(HI)
     A                                  6  2'D'
     A          R SFL02                     SFL
     A*%%TS  SD  20010817  145030  TEST        REL-V3R7M0  5716-PW1
     A            S@MHN1         5A  O  7  2
     A            S@MHN2         5A  O  7  8
     A            S@MHN3         5A  O  7 14
     A            S@MHN4         5A  O  7 20
     A            S@CARD         4A  B  7 26
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A N11                                  DSPATR(PR)
     A N11                                  DSPATR(ND)
     A  11                                  DSPATR(CS)
     A            S@LNFD         4A  B  7 32
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A N12                                  DSPATR(PR)
     A N12                                  DSPATR(ND)
     A  12                                  DSPATR(CS)
     A            S@RLOC         4A  B  7 38
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A N13                                  DSPATR(PR)
     A N13                                  DSPATR(ND)
     A  13                                  DSPATR(CS)
     A            S@FDPG        12A  B  7 44
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A N14                                  DSPATR(PR)
     A N14                                  DSPATR(ND)
     A  14                                  DSPATR(CS)
     A            S@WHLC        10A  B  7 58
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A N15                                  DSPATR(PR)
     A N15                                  DSPATR(ND)
     A  15                                  DSPATR(CS)
     A            S@FTLC        10A  B  7 70
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A N15                                  DSPATR(PR)
     A N15                                  DSPATR(ND)
     A  15                                  DSPATR(CS)
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20010817  155825  TEST        REL-V3R7M0  5716-PW1
     A                                      CF12
     A                                      CF07
     A                                      CF05
     A                                      CF04
     A                                      CF08
     A                                      OVERLAY
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A            @RCN2          4S 0H      SFLRCDNBR
     A                                  6  2'USER PART#'
     A                                      DSPATR(HI)
     A                                  6 26'CARD'
     A                                      DSPATR(HI)
     A                                  5 32'LINE'
     A                                      DSPATR(HI)
     A                                  6 32'FEED'
     A                                      DSPATR(HI)
     A                                  5 44'FORD'
     A                                      DSPATR(HI)
     A                                  6 44'PGM ID'
     A                                      DSPATR(HI)
     A                                  6 58'WH LOC'
     A                                      DSPATR(HI)
     A                                  6 70'FT LOC'
     A                                      DSPATR(HI)
     A                                  5 38'RSV'
     A                                      DSPATR(HI)
     A                                  6 38'LOC'
     A                                      DSPATR(HI)
     A          R DSP02
     A*%%TS  SD  20010820  110103  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 19' **  EDI FIXED ORDER DATA    AMEND-
     A                                       ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  2'CUST:'
     A                                      DSPATR(RI)
     A            D@CUST         4A  O  2  8
     A                                  2 16'DELIVERY:'
     A                                      DSPATR(RI)
     A            D@DELV         4A  O  2 26
     A                                  2 33'FACTORY:'
     A                                      DSPATR(RI)
     A            D@FACT         1A  O  2 42
     A                                  2 46'DOCK:'
     A                                      DSPATR(RI)
     A            D@DOCK         4A  O  2 52
     A            D@CUNM        15A  O  3  4
     A            D@MODE         6A  O  2 72DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  4  2'ORDER#:'
     A                                      DSPATR(RI)
     A            D@ORDR        10A  O  4 10
     A                                  4 23'PICK UP DATE:'
     A                                      DSPATR(RI)
     A            D@PKDT         8  0O  4 37EDTWRD('    .  .  ')
     A                                  2 59'BIN:'
     A                                      DSPATR(RI)
     A            D@BIN          2S 0O  2 64
     A                                  4 52'SUPPLIER:'
     A                                      DSPATR(RI)
     A            D@SUPL         4   O  4 62
     A                                  4 68'FACTORY:'
     A                                      DSPATR(RI)
     A            D@SFCT         1   O  4 77
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
     A  99                                  DSPATR(RI)
     A  97                                  DSPATR(BL)
