     A*%%TS  SD  20040802  141051  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01
     A                                      CF12
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20040426  135912  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 23'** PICK UP LIST SCAN CHECK **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5 22'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@DATE         8Y 0B  5 33EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 33'YYYYMMDD'
     A                                  2 25'---- NOT SCANNED YET ----'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A          R SFL01                     SFL
     A*%%TS  SD  20040802  141051  TEST        REL-V5R1M0  5722-WDS
     A            S@CUST         4A  O  5  4
     A            S@NONY         4A  O  5  9
     A            S@FACT         1A  O  5 14
     A            S@DOCK         4A  O  5 16
     A            S@NAME        15A  O  5 21
     A            S@BIN          2Y 0O  5 37EDTCDE(4)
     A            S@ORNO        10A  O  5 41
     A            S@SERL         9A  O  5 53
     A            S@NG           2   O  5 68DSPATR(HI)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20040802  141051  TEST        REL-V5R1M0  5722-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM           8A  O  1  2
     A                                  1 23'** PICK UP LIST SCAN CHECK **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2 25'---- NOT SCANNED YET ----'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  4  4'SHIP TO'
     A                                      DSPATR(HI)
     A                                  4 36'BIN'
     A                                      DSPATR(HI)
     A                                  4 41'ORDER#'
     A                                      DSPATR(HI)
     A                                  3  9'SHIP DATE:'
     A            D@DATE         8Y 0O  3 20EDTWRD('    /  /  ')
     A                                  4 53'BARCODE'
     A                                      DSPATR(HI)
     A                                  3 63'Checked but'
     A                                      DSPATR(HI)
     A                                  4 63'not completed'
     A                                      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         50A  O 24 18DSPATR(HI)
