     A*%%TS  SD  20190823  172704  I0777       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A* ----------------------------------------------------
     A          R DSP01
     A*%%TS  SD  20190823  172704  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                      CF06
     A            #PGM           8A  O  1  2
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2 71TIME
     A                                  6 19'Enter Summary(ship) Date.'
     A                                      DSPATR(HI)
     A            D@MM           2Y 0B  6 47
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 50'/'
     A            D@DD           2Y 0B  6 52
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 55'/'
     A            D@YYYY         4Y 0B  6 57
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 46'(month/day/year)'
     A                                      DSPATR(HI)
     A                                      COLOR(YLW)
     A*
     A                                  9 19'SELECT DATA TYPE:'
     A                                      DSPATR(HI)
     A            D@SEL          1A  B  9 37
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  9 40'A.IAF'
     A                                      COLOR(YLW)
     A                                 10 40'B.OUTSOURCE'
     A                                      COLOR(YLW)
     A                                 11 40'C.ALL  '
     A                                      COLOR(YLW)
     A*
     A                                 16 19'SELECT BIN# ....:'
     A                                      DSPATR(HI)
     A            D@BIN1         2Y 0B 16 37EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D@BIN2         2Y 0B 16 40EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D@BIN3         2Y 0B 16 43EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D@BIN4         2Y 0B 16 46EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D@BIN5         2Y 0B 16 49EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 16 52'(All Blank = All Bin#)'
     A                                      COLOR(YLW)
     A*
     A            D@MSG         78A  O 22  2DSPATR(BL)
     A                                 23  3'F1:End'
     A                                 23 12'F6:All Transaction'
     A                                 23 33'Enter:Unscan Only'
     A                                  1 18'** ALL SHIP CONTAINER SHIPMENT WIT-
     A                                      H INVENTORY **'
     A                                      DSPATR(RI)
     A* ----------------------------------------------------
     A          R SFL01                     SFL
     A*%%TS  SD  20190822  162238  I0777       REL-V7R3M0  5770-WDS
     A            S1DLCD         4S 0O  6 22
     A            S1DLNM        15A  O  6 27
     A            S1BOXS         5Y 0O  6 48EDTCDE(Z)
     A            S1NCNT         5Y 0O  6 61EDTCDE(Z)
     A                                      COLOR(RED)
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20190823  084206  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      CF01
     A                                      CF12
     A N71                                  SFLDSP
     A N71                                  SFLDSPCTL
     A  71                                  SFLCLR
     A N72                                  SFLEND(*MORE)
     A                                      OVERLAY
     A            #RCNO3         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A            D@SELN         9A  O  1 11COLOR(RED)
     A                                  1 21'** ALL SHIP CONTAINER SHIPMENT WIT-
     A                                      H INVENTORY 1 **'
     A                                      DSPATR(RI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A  35                              2  2'<UNSCAN Only>'
     A                                      COLOR(YLW)
     A                                  2 72TIME
     A                                  3  2'Sum Ship Date:'
     A                                      DSPATR(HI)
     A            D@MM           2Y 0B  3 17
     A                                  3 20'/'
     A            D@DD           2Y 0B  3 22
     A                                  3 25'/'
     A            D@YYYY         4Y 0B  3 27
     A                                  3 34'TOTAL #BOXES:'
     A                                      DSPATR(HI)
     A            D@BOXS         5Y 0O  3 48EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                  3 56'# OF UNSCANNED:'
     A                                      COLOR(RED)
     A            D@NBOX         5Y 0O  3 72EDTCDE(Z)
     A                                      COLOR(RED)
     A                                      DSPATR(UL)
     A                                  4 11'BIN#:'
     A                                      DSPATR(HI)
     A            D@BIN1         2Y 0O  4 17EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN2         2Y 0O  4 20EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN3         2Y 0O  4 23EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN4         2Y 0O  4 26EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN5         2Y 0O  4 29EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                  5 22'DELIVERY            '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 44'TTL #BOXES'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 56'# OF UNSCANNED'
     A                                      COLOR(RED)
     A                                      DSPATR(UL)
     A* ----------------------------------------------------
     A          R SFL02                     SFL
     A*%%TS  SD  20190822  162238  I0777       REL-V7R3M0  5770-WDS
     A            S@SLCT         1A  B  6  2
     A            S@PAR1         5A  O  6  4
     A            S@PAR2         5A  O  6 10
     A            S@PAR3         5A  O  6 16
     A            S@BMON         4A  O  6 23
     A            S@TCNT         7Y 0O  6 31EDTCDE(Z)
     A            S2NCNT         7Y 0O  6 41EDTCDE(Z)
     A                                      COLOR(RED)
     A            S2RCNT         7Y 0O  6 51EDTCDE(Z)
     A            S2OCNT         7Y 0O  6 61EDTCDE(Z)
     A            S2ICNT         7Y 0O  6 70EDTCDE(Q)
     A  55                                  COLOR(RED)
     A            S@IPT1         5A  O  7  4COLOR(PNK)
     A            S@IPT2         5A  O  7 10COLOR(PNK)
     A            S@IPT3         2A  O  7 16COLOR(PNK)
     A            S@LOC          9A  O  7 20COLOR(PNK)
     A* ----------------------------------------------------
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20190823  084620  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A N51                                  SFLDSP
     A N51                                  SFLDSPCTL
     A  51                                  SFLCLR
     A N52                                  SFLEND(*MORE)
     A  53                                  SFLDROP(CF10)
     A                                      SFLMODE(&N#MODE)
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                      OVERLAY
     A            #RCNO          4S 0H      SFLRCDNBR
     A            N#MODE         1A  H
     A            #PGM           8A  O  1  2
     A            D@SELN         9A  O  1 11COLOR(RED)
     A                                  1 21'** ALL SHIP CONTAINER SHIPMENT WIT-
     A                                      H INVENTORY 2 **'
     A                                      DSPATR(RI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A  35                              2  2'<UNSCAN Only>'
     A                                      COLOR(YLW)
     A                                  2 72TIME
     A                                  3  2'Ship Date:'
     A                                      DSPATR(HI)
     A            D@FRDT        10A  O  3 13DSPATR(UL)
     A                                  3 24'-'
     A                                      COLOR(WHT)
     A            D@TODT        10A  O  3 26DSPATR(UL)
     A            D@BIN1         2Y 0O  3 37EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN2         2Y 0O  3 40EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN3         2Y 0O  3 43EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN4         2Y 0O  3 46EDTCDE(Z)
     A                                      DSPATR(UL)
     A            D@BIN5         2Y 0O  3 49EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                  3 52'Outsrc Order From:'
     A                                      DSPATR(HI)
     A            D@OODT        10A  O  3 71DSPATR(UL)
     A                                  4  2'Printer Select:'
     A                                      DSPATR(HI)
     A            P@PRT          1A  B  4 18COLOR(TRQ)
     A                                      DSPATR(HI)
     A                                      VALUES('1' '2' '3' '9')
     A                                  4 20'1.LANPRT02(APICS)'
     A                                      COLOR(YLW)
     A                                  4 39'2.LANPRT03(OFFICE)'
     A                                      COLOR(YLW)
     A                                  4 59'3.LANPRT04(GL ROOM)'
     A                                      COLOR(YLW)
     A                                  5  2'X'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*
     A                                  5  4'USER PART#       '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 29'SUM #BOXES'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 41'#UNSCAN'
     A                                      COLOR(RED)
     A                                      DSPATR(UL)
     A                                  5 50'RECEIVED'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5 61'SHIPPED'
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  5 69'INVENTORY'
     A                                      COLOR(TRQ)
     A                                      DSPATR(UL)
     A* ----------------------------------------------------
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
