     A*%%TS  SD  20010810  160727  TEST        REL-V3R7M0  5716-PW1
     A** AB#PW62 ******************************
     A*  ..ACCOUNTS RECEIVABLE DETAIL LIST..  *
     A*    I-HASADA               97.08.12    *
     A*    GBC             99.09.06 (9999-FOR ALL USERS)
     A****************************** AB#PW62 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R AB#PW621
     A*%%TS  SD  20010810  160727  TEST        REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      CF05
     A                                      BLINK
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 20'  **  ACCOUNTS RECEIVABLE DETAIL L-
     A                                      IST  **  '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AB#PW62'
     A                                  5 14' DELIVERY '
     A                                      DSPATR(RI)
     A                                  5 29' A/R LIST MONTH '
     A                                      DSPATR(RI)
     A                                  5 50' USER PAYMENT DATE '
     A                                      DSPATR(RI)
     A            INONY          4A  B  7 17DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            INOYM          6Y 0B  7 34DSPATR(CS)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            ISEHZ          8Y 0B  7 56DSPATR(CS)
     A                                      EDTCDE(Z)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  8 34'( YM )'
     A                                  8 56'( YMD )'
     A                                 10 14'0541-NUMMI'
     A                                 11 14'3347-TMMK'
     A                                 12 14'3503-TMMC'
     A                                 13 14'9999-FOR ALL USERS'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18
     A                                 24  4'EXIT:'
     A                                 24 10'F1'
     A                                      DSPATR(RI)
     A                                 24 24'GO:'
     A                                 24 28'F5'
     A                                      DSPATR(RI)
     A                                 16 14'OPTION:'
     A                                      DSPATR(RI)
     A            OPTN           1A  B 16 23DSPATR(CS)
     A                                      DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 16 26'(BLANK=LIST + EDI   1= LIST ONLY  -
     A                                       2= EDI ONLY)'
