     A*%%TS  SD  20260219  090432  I0777       REL-V7R4M0  5770-WDS
     A** AB#PWQ1 ******************************************************
     A*  PLANT+SHIP TABLE MAINTENANCE (GENERAL CUSTOMERS)             *
     A*  J.WATANABE 2019.01.25                                        *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*-------------------------------------
     A          R DSP01
     A*%%TS  SD  20260219  090432  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF12
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' ** PLANT+SHIP TABLE MAINTENANCE *-
     A                                      * '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AB#PWQ1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 25'(FOR GENERAL CUTOMERS)'
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 29'PLANT CODE'
     A                                      DSPATR(UL)
     A                                  5 41'SHIP TO CODE'
     A                                      DSPATR(UL)
     A*
     A            D1KBN          1A  B  7 22DSPATR(CS)
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A*
     A            D1PLNT        10A  B  7 30TEXT('PLANT ID')
     A                                      DSPATR(CS)
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A            D1SHCD        10A  B  7 42TEXT('SHIP TO CODE')
     A                                      DSPATR(CS)
     A  23                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A                                  9 41'(*=Default Ship To Code)'
     A                                      COLOR(YLW)
     A*
     A                                 10 22'0- CANCEL '
     A                                 11 22'1- CHANGE '
     A                                 12 22'2- ADD    '
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D1MSG         60A  O 22 18
     A*
     A                                 24  4' F1 '
     A                                      DSPATR(RI)
     A                                 24  9'EXIT'
     A                                 24 66' F12 '
     A                                      DSPATR(RI)
     A                                 24 72'INQUIRY'
     A*-------------------------------------
     A*-------------------------------------
     A          R DSP02
     A*%%TS  SD  20260219  090432  I0777       REL-V7R4M0  5770-WDS
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 17' ** HONDA PLANT CODE AND SHIP TO C-
     A                                      ODE MAINT ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AB#PWQ1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 29'PLANT CODE'
     A                                      DSPATR(UL)
     A                                  5 41'SHIP TO CODE'
     A                                      DSPATR(UL)
     A*
     A            D2KBN          8A  O  7 20
     A*
     A            D1PLNT        10A  O  7 30TEXT('PLANT ID')
     A            D1SHCD        10A  O  7 42TEXT('SHIP TO CODE')
     A                                  8 41'(*=Default Ship To Code)'
     A                                      COLOR(YLW)
     A*
     A*
     A                                 11 30'CUSTOMER CODE'
     A                                      DSPATR(UL)
     A                                 11 50'DELIVERY CODE'
     A                                      DSPATR(UL)
     A*
     A            D2TOKU         4Y 0B 13 34TEXT('CUSTMER CODE')
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            D2NONY         4Y 0B 13 54TEXT('DELIVERY CODE')
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A*
     A            D2SMEI        15A  O 15 34TEXT('DETAIL NAME KANA')
     A            D2KMEI        15A  O 15 54TEXT('FACTORY NAME (KANA)')
     A*
     A                                 21 11'ERROR'
     A            D2MSG         60A  O 21 18COLOR(WHT)
     A*
     A                                 24  6' F3 '
     A                                      DSPATR(RI)
     A                                 24 11'BACK'
     A                                 24 25' F5 '
     A                                      DSPATR(RI)
     A                                 24 30'UPDATE'
