     A*%%TS  SD  20040331  094336  TEST        REL-V5R1M0  5722-WDS
     A** AB#PW0F ******************************************************
     A*  CREATE ASN DATA                    <COMPILE OPT:WAITRCD=30>  *
TCH86A*  TCH ADD SLI# FOR 0411                                        *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      CF07
     A                                      CF01
     A                                      CF09
     A                                      CF05
     A                                      CF12
     A*
     A          R SFL01                     SFL
     A*%%TS  SD  20040326  111139  TEST        REL-V5R1M0  5722-WDS
     A            S@BARC         9A  O 10  2
     A            H@NONY         4S 0H
     A            H@NKOJ         1A  H
     A            H@NOHZ         8S 0H
     A            H@NOBN         2S 0H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20040331  094336  TEST        REL-V5R1M0  5722-WDS
     A  *DS3                                SFLLIN(0002)
     A                                      SFLSIZ(0085)
     A                                      SFLPAG(0084)
JW   A                                      CF11
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      KEEP
     A                                      INVITE
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 20' CREATE ASN DATA & POST TO SALES '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'AB#PW0P'
     A                                  8  7' BARCODE '
     A                                      DSPATR(RI)
     A                                  4  7' CONTAINER WEIGHT '
     A                                      DSPATR(RI)
     A            PWEIG          5Y 2B  6 12DSPATR(CS)
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  4 51' RECREATE EDI DATA'
     A                                      DSPATR(RI)
     A            PRISU          1A  B  6 55DSPATR(CS)
     A                                  6 57'(1=RECREATE)'
     A            D@BAR          9A  B  8 17DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      CHECK(ER)
     A  02                                  DSPATR(RI)
     A                                  4 33'SHIP TIME'
     A                                      DSPATR(RI)
     A            STM            4A  B  6 34DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  7 34'HHMM'
     A                                  6 39'(ET)'
     A                                  2 30'<< HONDA >>'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A          R DSP99
     A  98
     AO 99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  98
     AO 99        MSG           60A  O 23 18DSPATR(HI)
     A            D@CMD         78   O 24  2
     A          R DSP02
     A*%%TS  SD  20040323  135317  TEST        REL-V5R1M0  5722-WDS
     A                                      INVITE
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 20' CREATE ASN DATA & POST TO SALES '
     A                                      DSPATR(RI)
     A                                  2 30'<< HONDA >>'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A            #PGM           8A  O  1 73
     A                                  5  3' DELIVERY '
     A                                      DSPATR(RI)
     A                                  5 15' PICK-UP DATE '
     A                                      DSPATR(RI)
     A                                  5 33' BIN '
     A                                      DSPATR(RI)
     A            PSIRE          4A  B  7  3DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7  8'-'
     A            PSIRK          1A  B  7 10DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            PNOHZ          8A  B  7 15DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            PNOBN          2Y 0B  7 35DSPATR(CS)
     A                                      EDTCDE(4)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A  98
     AO 99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  98
     AO 99        MSG           60A  O 22 18DSPATR(HI)
     A                                  7 24'YYYYMMDD'
     A                                  5 59' RECREATE EDI DATA'
     A                                      DSPATR(RI)
     A            PRISU          1A  B  7 63DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                  7 65'(1=RECREATE)'
     A                                 24  4'EXIT'
     A                                 24 10'F-1'
     A                                      DSPATR(RI)
     A                                 24 38'BARCODE ENTRY'
     A                                 24 52'F9'
     A                                      DSPATR(RI)
     A                                 24 19'ENTER'
     A                                 24 26'NEXT'
     A                                      DSPATR(RI)
     A                                  5 41'ORDER NUMBER'
     A                                      DSPATR(RI)
     A            D@ORDR        10A  B  7 41DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                  8 41'BLANK = ALL'
     A  66                                  DSPATR(RI PC)
     A          R DSP03
     A*%%TS  SD  20040326  111139  TEST        REL-V5R1M0  5722-WDS
     A                                      INVITE
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' CREATE ASN DATA & POST TO SALES '
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 73
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 30'<< HONDA >>'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  5  3' DELIVERY '
     A                                      DSPATR(RI)
     A                                  5 15' PICK-UP DATE '
     A                                      DSPATR(RI)
     A                                  5 33' BIN '
     A                                      DSPATR(RI)
     A                                  5 41'ORDER NUMBER'
     A                                      DSPATR(RI)
     A                                  5 59' RECREATE EDI DATA'
     A                                      DSPATR(RI)
     A            PSIRE          4A  O  7  3DSPATR(CS)
     A                                  7  8'-'
     A            PSIRK          1A  O  7 10DSPATR(CS)
     A            PNOHZ          8A  O  7 15DSPATR(CS)
     A                                  7 24'YYYYMMDD'
     A            PNOBN          2Y 0O  7 35DSPATR(CS)
     A                                      EDTCDE(4)
     A            D@ORDR        10A  O  7 41DSPATR(CS)
     A            PRISU          1A  O  7 63DSPATR(CS)
     A                                  7 65'(1=RECREATE)'
     A                                  8  3'-----------------------------------
     A                                      ------------------------------------
     A                                      ------'
     A                                  9 20' CONTAINER WEIGHT '
     A                                      DSPATR(RI)
     A                                  9 45'SHIP TIME'
     A                                      DSPATR(RI)
TCH86A                                  9 62'SLI#     '
TCH86A                                      DSPATR(RI)
     A            PWEIG          5Y 2B 11 25DSPATR(CS)
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            STM            4A  B 11 46DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 11 51'HHMM'
TCH86A            SLI#          10A  B 11 62DSPATR(CS)
     A  98
     AO 99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  98
     AO 99        MSG           60A  O 22 18DSPATR(HI)
     A                                 24  4'EXIT'
     A                                 24 10'F-1'
     A                                      DSPATR(RI)
     A                                 24 22'MAKING OK'
     A                                 24 33'F-5'
     A                                      DSPATR(RI)
     A                                 24 42'GO BACK'
     A                                 24 51'F12'
     A                                      DSPATR(RI)
     A                                 11 56'(ET)'
     A          R SFL02                     SFL
     A*%%TS  SD  20021122  103334  TEST        REL-V4R4M0  5769-PW1
     A            S@MANI        16A  O  6 22
     A            S@ADN          4Y 0O  6 41EDTWRD('  /  ')
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20021122  102527  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      OVERLAY
     A                                      INVITE
     A            #PGM           8A  O  1  2
     A                                  1 32'** WARNING **'
     A                                      DSPATR(RI)
     A                                      COLOR(RED)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 69TIME
     A                                  3 12'Some manifests are not scanned!!'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  5 22'Manifest#'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  5 40'ASN date'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A          R SFL03                     SFL
     A*%%TS  SD  20030911  113248  TEST        REL-V4R4M0  5769-PW1
     A            S@SLCT         1A  B  6  5DSPATR(CS)
     A            S@MHN1         5A  O  6  8
     A            S@MHN2         5A  O  6 14
     A            S@MHN3         5A  O  6 20
     A            S@QNTY         5S 0O  6 28
     A            S@SERL        18A  O  6 37
     A          R CTL03                     SFLCTL(SFL03)
     A*%%TS  SD  20031020  153558  TEST        REL-V4R4M0  5769-PW1
     A                                      INVITE
     A                                      OVERLAY
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A            #PGM           8A  O  1  2
     A                                  1 21'** SHIPMENT SCANNING CHECK **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5  8'Part#'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  5 26'Qty/cont'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  5 37'Label #'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  2  4'These labels are not scanned yet. -
     A                                      Go to the shipping area and scan th-
     A                                      em, or'
     A                                      DSPATR(HI)
     A                                  3  4'to ignore scanning, type G and hit-
     A                                       F5.'
     A                                      DSPATR(HI)
     A                                  5  5'G'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
