     A*%%TS  SD  20040402  081547  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF12
     A                                      CF09
     A          R DSP01
     A*%%TS  SD  20040402  081547  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 27'** NAPLD SCAN CHECK **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5 21'SHIP TO:'
     A                                      DSPATR(HI)
     A                                  6 21'FACTORY:'
     A                                      DSPATR(HI)
     A                                  8 21'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  5 32EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            D@NKOJ         1A  B  6 32DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            D@NYMD         8Y 0B  8 32EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A                                  9 32'YYYYMMDD'
     A                                  4 21'CUSTOMER:'
     A                                      DSPATR(HI)
     A            D@CUST         4Y 0B  4 32EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 21'DOCK:'
     A                                      DSPATR(HI)
     A            D@DOCK         4   B  7 32DSPATR(CS)
     A  61                                  DSPATR(RI)
     A          R SFL01                     SFL
     A*%%TS  SD  20040401  163616  TEST        REL-V5R1M0  5722-WDS
     A            S@PRT1         5   O  6  3
     A            S@PRT2         5   O  6  9
     A            S@PRT3         5   O  6 15
     A            S@BOX          3  0O  6 21EDTCDE(4)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20040402  081547  TEST        REL-V5R1M0  5722-WDS
     A  *DS3                                SFLLIN(0003)
     A                                      SFLSIZ(0052)
     A                                      SFLPAG(0051)
     A  31                                  SFLDSP
     A  31                                  SFLDSPCTL
     A  32                                  SFLCLR
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 27'** NAPLD SCAN CHECK **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3  2'CASE LABEL:'
     A                                      DSPATR(HI)
     A            D@CASE         9A  O  3 14DSPATR(HI)
     A                                  5  3'PART#'
     A                                      DSPATR(HI)
     A                                  4 20'# OF'
     A                                      DSPATR(HI)
     A                                  5 20'CASE'
     A                                      DSPATR(HI)
     A                                  5 27'PART#'
     A                                      DSPATR(HI)
     A                                  5 51'PART#'
     A                                      DSPATR(HI)
     A                                  4 44'# OF'
     A                                      DSPATR(HI)
     A                                  5 44'CASE'
     A                                      DSPATR(HI)
     A                                  4 68'# OF'
     A                                      DSPATR(HI)
     A                                  5 68'CASE'
     A                                      DSPATR(HI)
     A                                  2 41'SHIP TO:'
     A            D@NONY         4S 0O  2 50
     A                                  3 26'FACTORY:'
     A            D@NKOJ         1A  O  3 35
     A                                  3 53'SHIP DATE:'
     A            D@NYMD         8Y 0O  3 64EDTWRD('    /  /  ')
     A                                  2 26'CUSTOMER'
     A            D@CUST         4S 0O  2 35
     A                                  3 39'DOCK:'
     A            D@DOCK         4   O  3 45
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
