     A*%%TS  SD  20021126  151734  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01
     A                                      CF22
     A                                      PRINT
     A          R SFL01                     SFL
     A*%%TS  SD  20021126  151734  TEST        REL-V4R4M0  5769-PW1
     A            S@KEY1        10   B  5  4DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A            S@KEY2        10   B  5 15DSPATR(CS)
     A            S@KEY3        10   B  5 26DSPATR(CS)
     A            S@VAL1        10   B  5 37DSPATR(CS)
     A            S@VAL2        10   B  5 48DSPATR(CS)
     A            S@VAL3        10   B  5 59DSPATR(CS)
     A            H@KEY1        10   H
     A            H@KEY2        10   H
     A            H@KEY3        10   H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20021126  151734  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A            #PGM           8      1  2
     A                                  1 22'** GENTRAN EDI CONSTANT KEY VALUE +
     A                                      **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4  4'KEY1' DSPATR(HI)
     A                                  4 15'KEY2' DSPATR(HI)
     A                                  4 26'KEY3' DSPATR(HI)
     A                                  4 37'VAL1' DSPATR(HI)
     A                                  4 48'VAL2' DSPATR(HI)
     A                                  4 59'VAL3' DSPATR(HI)
     A            D@KEY1        10   B  3  4
     A                                  3 16'<-- POSITION'
     A                                      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
