     A*%%TS  SD  20210427  111427  I0777       REL-V7R3M0  5770-WDS
     A** AB#PWF7  ******************************
     A*  FORD EDI(830) FRS ORDER PROCESSING..  *
     A*  N.HYOTO 2000.10.25                    *
     A*  H.AMANO 2002.06.06                    *
     A*         SIMPLIFY THE PROCESS
TCH46A*  TCH 03/08/05 TITLE DYNAMIC            *
TCHK1A*  TCH 01/24/06 CHANGE *ALL TEXT         *
TCHK2A*  TCH 01/08/10 ADD GROUPE CONTROL       *
TCHK3A*  TCH 04/20/10 CHG POSITION RELEASE & SHIPPING DATE
TCHK4A*  TCH 11/18/11 ADD BIN#
TCHK5A*  TCH 03/15/13 ADD GROUPE CONTROL '3'   *
     A**************************** AB#PWF7 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R AB#PWF71
     A*%%TS  SD  20210427  111427  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      CF21(21)
     A                                  1  2'TIME'
     A                                  1  7TIME
TCH46A*                                 1 21' **  FORD     FRS ORDER PROCESSING-
TCH46A*                                       ** '
     A            PTITL         35A  O  1 21DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AB#PWF7'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 27'SHIPPING DATE'
     A                                      DSPATR(HI)
     A            PSYYY          4Y 0B  6 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  6 32'/'
     A            PSMMM          2Y 0B  6 34DSPATR(CS)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  6 37'/'
     A            PSDDD          2Y 0B  6 39DSPATR(CS)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  8 27'RELEASED DATE'
     A                                      DSPATR(HI)
     A            PRYYY          4Y 0B 10 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 10 32'/'
     A            PRMMM          2Y 0B 10 34DSPATR(CS)
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 10 37'/'
     A            PRDDD          2Y 0B 10 39DSPATR(CS)
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 13 27'BIN#'
     A                                      DSPATR(HI)
     A            PBIN#          2Y 0B 13 39DSPATR(CS)
     A                                      EDTCDE(4)
     A                                 15 31'DELIVERY'
     A                                      DSPATR(HI)
     A            PSIRE          4A  B 15 44DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                 15 49'-'
     A            PSIRK          1A  B 15 51DSPATR(CS)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 16 44'( blank = all )'
     A                                 17 27'OR'
     A                                      COLOR(PNK)
     A                                 19 31'GROUP '
     A                                      DSPATR(HI)
     A            PGRP           1A  B 19 44DSPATR(CS)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
TCHK5A*TCHK2                           20 44'( 1 or 2 or blank )'
     A                                 20 44'( 1 or 2 or 3 or blank )'
TCHK2A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18
     A                                 24 11'F1:'
     A                                      DSPATR(RI)
     A                                 24 15'EXIT'
     A                                 24 27'F5:'
     A                                      DSPATR(RI)
     A                                 24 31'PROCESS'
