     A*%%TS  SD  20161109  171154  I0777       REL-V7R1M0  5770-WDS
     A** BTCPW85 *****************************************************
     A****************************************************************
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R DSP01
     A*%%TS  SD  20161109  171154  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT(' ')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24'** Print HONDA SPLIT REPORT **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 67'FMT  AB#PW1K '
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  7 11'Enter Split Date:'
     A            XDATE         10   B  7 29
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(BL)
     A                                 22  9' '
     A  99                             22 12'ERR:'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        XMSG          60A  O 22 17
     A                                 24 12'F1:'
     A                                      DSPATR(RI)
     A                                 24 16'Exit,'
     A                                 24 26'F5:'
     A                                      DSPATR(RI)
     A                                 24 30'Run'
