     A*%%TS  SD  20200618  103146  I0777       REL-V7R3M0  5770-WDS
     A* TCHK  10/22/08 CREATE(COPY FROM AB#PWAS)
     A* TCHK  09/24/10 RE-MAKE
     A* TCHK1 07/02/12 ADD JL,BLACK
     A* TCHK2 08/14/13 ADD MUKON-F
     A* T.SAKAKI 15/03/07 ADD BZ-D,AQUA-SAFE,COSMER  %0005
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP01
     A                                      OVERLAY
     A                                  1  2'AB#RAU'
     A                                  1 17'** SHIP SCANNED BOX -
     A                                      INQUIRY BY LINE **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 23'INFO. BY SCANNED RESULT DATA'
     A                                  4 19'SCAN DATE:' DSPATR(HI)
     A            D@FRM          8  0B  4 30EDTCDE(4)  DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A                                  5 30'YYYYMMDD'
     A          R DSP99
     A            D@MSG         78   O 23  2DSPATR(HI)
     A            D@CMD         78   O 24  2
     A*
     A* ++++++++++++++++++++++++++++++++++++++++++++++++++++
     A*
     A*
     A*
     A*    CURRENT MONTH  DAY BY DAY DETAIL
     A*
     A*
     A*
     A* ++++++++++++++++++++++++++++++++++++++++++++++++++++
     A*
     A          R SFL02                     SFL
     A*%%TS  SD  20200618  103146  I0777       REL-V7R3M0  5770-WDS
     A                                  4  6'SCAN DATE '
     A                                      DSPATR(RI)
     A                                  5  2'BZ-A      '
     A                                  6  2'BZ-B      '
     A                                  7  2'BZ-C      '
     A                                  8  2'BZ-D      '
     A                                  9  2'BZ-E      '
F    A*                             *  10  2'DS-F      '
     A                                 10  2'DS-G      '
     A                                 11  2'DS-H      '
     A                                 12  2'DS-J      '
     A                                 13  2'DS-K      '
     A                                 14  2'DS-L      '
     A                                 15  2'OQ        '
     A                                 16  2'DSM       '
     A                                 17  2'LUBE GREEN'
     A                                 18  2'LUBE CLEAR'
     A                                 19  2'AR8133    '
     A                                 20  2'SAFETY DRAW 711'
     A                                 21  2'WASH/KRO  '
N    A*                                18  2'TNT15     '
O    A*                                19  2'MUCON L   '
PCHK2A*                                20  2'MUCON F   '
QCHK1A*                                21  2'PLUS JL,BLACK'
     A*
     A            S2SDT1        10A  O  4 18DSPATR(RI)
     A            S2B@A1         7Y 0O  5 19EDTCDE(2)
     A            S2B@B1         7Y 0O  6 19EDTCDE(2)
     A            S2B@C1         7Y 0O  7 19EDTCDE(2)
     A            S2B@D1         7Y 0O  8 19EDTCDE(2)
     A            S2B@E1         7Y 0O  9 19EDTCDE(2)
     A*********** S2B@F1         7Y 0O 10 19EDTCDE(2)
     A            S2BFG1         7Y 0O 10 19EDTCDE(2)
     A            S2BFH1         7Y 0O 11 19EDTCDE(2)
     A            S2BFJ1         7Y 0O 12 19EDTCDE(2)
     A            S2BFK1         7Y 0O 13 19EDTCDE(2)
     A            S2BFL1         7Y 0O 14 19EDTCDE(2)
     A            S2B@G1         7Y 0O 15 19EDTCDE(2)
     A            S2B@H1         7Y 0O 16 19EDTCDE(2)
     A            S2B@I1         7Y 0O 17 19EDTCDE(2)
     A            S2B@J1         7Y 0O 18 19EDTCDE(2)
     A            S2B@K1         7Y 0O 19 19EDTCDE(2)
     A            S2B@L1         7Y 0O 20 19EDTCDE(2)
     A            S2B@M1         7Y 0O 21 19EDTCDE(2)
     A*
     A            S2SDT2        10A  O  4 31DSPATR(RI)
     A            S2B@A2         7Y 0O  5 32EDTCDE(2)
     A            S2B@B2         7Y 0O  6 32EDTCDE(2)
     A            S2B@C2         7Y 0O  7 32EDTCDE(2)
     A            S2B@D2         7Y 0O  8 32EDTCDE(2)
     A            S2B@E2         7Y 0O  9 32EDTCDE(2)
     A*********** S2B@F2         7Y 0O 10 32EDTCDE(2)
     A            S2BFG2         7Y 0O 10 32EDTCDE(2)
     A            S2BFH2         7Y 0O 11 32EDTCDE(2)
     A            S2BFJ2         7Y 0O 12 32EDTCDE(2)
     A            S2BFK2         7Y 0O 13 32EDTCDE(2)
     A            S2BFL2         7Y 0O 14 32EDTCDE(2)
     A            S2B@G2         7Y 0O 15 32EDTCDE(2)
     A            S2B@H2         7Y 0O 16 32EDTCDE(2)
     A            S2B@I2         7Y 0O 17 32EDTCDE(2)
     A            S2B@J2         7Y 0O 18 32EDTCDE(2)
     A            S2B@K2         7Y 0O 19 32EDTCDE(2)
     A            S2B@L2         7Y 0O 20 32EDTCDE(2)
     A            S2B@M2         7Y 0O 21 32EDTCDE(2)
     A*
     A            S2SDT3        10A  O  4 44DSPATR(RI)
     A            S2B@A3         7Y 0O  5 45EDTCDE(2)
     A            S2B@B3         7Y 0O  6 45EDTCDE(2)
     A            S2B@C3         7Y 0O  7 45EDTCDE(2)
     A            S2B@D3         7Y 0O  8 45EDTCDE(2)
     A            S2B@E3         7Y 0O  9 45EDTCDE(2)
     A*********   S2B@F3         7Y 0O 10 45EDTCDE(2)
     A            S2BFG3         7Y 0O 10 45EDTCDE(2)
     A            S2BFH3         7Y 0O 11 45EDTCDE(2)
     A            S2BFJ3         7Y 0O 12 45EDTCDE(2)
     A            S2BFK3         7Y 0O 13 45EDTCDE(2)
     A            S2BFL3         7Y 0O 14 45EDTCDE(2)
     A            S2B@G3         7Y 0O 15 45EDTCDE(2)
     A            S2B@H3         7Y 0O 16 45EDTCDE(2)
     A            S2B@I3         7Y 0O 17 45EDTCDE(2)
     A            S2B@J3         7Y 0O 18 45EDTCDE(2)
     A            S2B@K3         7Y 0O 19 45EDTCDE(2)
     A            S2B@L3         7Y 0O 20 45EDTCDE(2)
     A            S2B@M3         7Y 0O 21 45EDTCDE(2)
     A*
     A            S2SDT4        10A  O  4 57DSPATR(RI)
     A            S2B@A4         7Y 0O  5 58EDTCDE(2)
     A            S2B@B4         7Y 0O  6 58EDTCDE(2)
     A            S2B@C4         7Y 0O  7 58EDTCDE(2)
     A            S2B@D4         7Y 0O  8 58EDTCDE(2)
     A            S2B@E4         7Y 0O  9 58EDTCDE(2)
     A**********  S2B@F4         7Y 0O 10 58EDTCDE(2)
     A            S2BFG4         7Y 0O 10 58EDTCDE(2)
     A            S2BFH4         7Y 0O 11 58EDTCDE(2)
     A            S2BFJ4         7Y 0O 12 58EDTCDE(2)
     A            S2BFK4         7Y 0O 13 58EDTCDE(2)
     A            S2BFL4         7Y 0O 14 58EDTCDE(2)
     A            S2B@G4         7Y 0O 15 58EDTCDE(2)
     A            S2B@H4         7Y 0O 16 58EDTCDE(2)
     A            S2B@I4         7Y 0O 17 58EDTCDE(2)
     A            S2B@J4         7Y 0O 18 58EDTCDE(2)
     A            S2B@K4         7Y 0O 19 58EDTCDE(2)
     A            S2B@L4         7Y 0O 20 58EDTCDE(2)
     A            S2B@M4         7Y 0O 21 58EDTCDE(2)
     A*
     A            S2SDT5        10A  O  4 70DSPATR(RI)
     A            S2B@A5         7Y 0O  5 71EDTCDE(2)
     A            S2B@B5         7Y 0O  6 71EDTCDE(2)
     A            S2B@C5         7Y 0O  7 71EDTCDE(2)
     A            S2B@D5         7Y 0O  8 71EDTCDE(2)
     A            S2B@E5         7Y 0O  9 71EDTCDE(2)
     A**********  S2B@F5         7Y 0O 10 71EDTCDE(2)
     A            S2BFG5         7Y 0O 10 71EDTCDE(2)
     A            S2BFH5         7Y 0O 11 71EDTCDE(2)
     A            S2BFJ5         7Y 0O 12 71EDTCDE(2)
     A            S2BFK5         7Y 0O 13 71EDTCDE(2)
     A            S2BFL5         7Y 0O 14 71EDTCDE(2)
     A            S2B@G5         7Y 0O 15 71EDTCDE(2)
     A            S2B@H5         7Y 0O 16 71EDTCDE(2)
     A            S2B@I5         7Y 0O 17 71EDTCDE(2)
     A            S2B@J5         7Y 0O 18 71EDTCDE(2)
     A            S2B@K5         7Y 0O 19 71EDTCDE(2)
     A            S2B@L5         7Y 0O 20 71EDTCDE(2)
     A            S2B@M5         7Y 0O 21 71EDTCDE(2)
     A*
     A          R CTL02                     SFLCTL(SFL02)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A*N58                                  SFLEND(*MORE)
     A                                      PAGEUP(51)
     A                                      PAGEDOWN(52)
     A                                      OVERLAY
     A                                      CF12 CF08
     A**********  #RCNO2         4  0H      SFLRCDNBR
     A                                  1  2'AB#RAU'
     A                                  1 17'** SHIP SCANNED BOX -
     A                                      INQUIRY BY LINE **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 23'INFO. BY SCANNED RESULT DATA'
     A*
     A* ++++++++++++++++++++++++++++++++++++++++++++++++++++
     A*
     A          R SFL03                     SFL
     A*%%TS  SD  20200618  103146  I0777       REL-V7R3M0  5770-WDS
     A                                  4  6'SCAN DATE '
     A                                      DSPATR(RI)
     A*
     A            S2SDT1        10A  O  4 18DSPATR(RI)
     A*
     A            S2SDT2        10A  O  4 31DSPATR(RI)
     A*
     A            S2SDT3        10A  O  4 44DSPATR(RI)
     A*
     A            S2SDT4        10A  O  4 57DSPATR(RI)
     A*
     A            S2SDT5        10A  O  4 70DSPATR(RI)
     A                                  5  2'TNT15     '
     A            S2B@N1         7Y 0O  5 19EDTCDE(2)
     A            S2B@N2         7Y 0O  5 32EDTCDE(2)
     A            S2B@N3         7Y 0O  5 45EDTCDE(2)
     A            S2B@N4         7Y 0O  5 58EDTCDE(2)
     A            S2B@N5         7Y 0O  5 71EDTCDE(2)
     A                                  6  2'MUCON L   '
     A            S2B@O1         7Y 0O  6 19EDTCDE(2)
     A            S2B@O2         7Y 0O  6 32EDTCDE(2)
     A            S2B@O3         7Y 0O  6 45EDTCDE(2)
     A            S2B@O4         7Y 0O  6 58EDTCDE(2)
     A            S2B@O5         7Y 0O  6 71EDTCDE(2)
     A                                  7  2'MUCON F   '
     A            S2B@P1         7Y 0O  7 19EDTCDE(2)
     A            S2B@P2         7Y 0O  7 32EDTCDE(2)
     A            S2B@P3         7Y 0O  7 45EDTCDE(2)
     A            S2B@P4         7Y 0O  7 58EDTCDE(2)
     A            S2B@P5         7Y 0O  7 71EDTCDE(2)
     A                                  8  2'PLUS JL,BLACK'
     A            S2B@Q1         7Y 0O  8 19EDTCDE(2)
     A            S2B@Q2         7Y 0O  8 32EDTCDE(2)
     A            S2B@Q3         7Y 0O  8 45EDTCDE(2)
     A            S2B@Q4         7Y 0O  8 58EDTCDE(2)
     A            S2B@Q5         7Y 0O  8 71EDTCDE(2)
     A                                  9  2'AQUA-SAFE '
     A            S2B@R1         7Y 0O  9 19EDTCDE(2)
     A            S2B@R2         7Y 0O  9 32EDTCDE(2)
     A            S2B@R3         7Y 0O  9 45EDTCDE(2)
     A            S2B@R4         7Y 0O  9 58EDTCDE(2)
     A            S2B@R5         7Y 0O  9 71EDTCDE(2)
     A                                 10  2'COSMER    '
     A            S3B@S1         7Y 0O 10 19EDTCDE(2)
     A            S3B@S2         7Y 0O 10 32EDTCDE(2)
     A            S3B@S3         7Y 0O 10 45EDTCDE(2)
     A            S3B@S4         7Y 0O 10 58EDTCDE(2)
     A            S3B@S5         7Y 0O 10 71EDTCDE(2)
     A                                 11  2'JL BLUE   '
     A            S3B@T1         7Y 0O 11 19EDTCDE(2)
     A            S3B@T2         7Y 0O 11 32EDTCDE(2)
     A            S3B@T3         7Y 0O 11 45EDTCDE(2)
     A            S3B@T4         7Y 0O 11 58EDTCDE(2)
     A            S3B@T5         7Y 0O 11 71EDTCDE(2)
     A                                 12  2'PROTRUST A09'
     A            S3B@U1         7Y 0O 12 19EDTCDE(2)
     A            S3B@U2         7Y 0O 12 32EDTCDE(2)
     A            S3B@U3         7Y 0O 12 45EDTCDE(2)
     A            S3B@U4         7Y 0O 12 58EDTCDE(2)
     A            S3B@U5         7Y 0O 12 71EDTCDE(2)
     A                                 13  2'PROTRUST A20'
     A            S3B@V1         7Y 0O 13 19EDTCDE(2)
     A            S3B@V2         7Y 0O 13 32EDTCDE(2)
     A            S3B@V3         7Y 0O 13 45EDTCDE(2)
     A            S3B@V4         7Y 0O 13 58EDTCDE(2)
     A            S3B@V5         7Y 0O 13 71EDTCDE(2)
     A                                 14  2'E-CONA    '
     A            S3B@W1         7Y 0O 14 19EDTCDE(2)
     A            S3B@W2         7Y 0O 14 32EDTCDE(2)
     A            S3B@W3         7Y 0O 14 45EDTCDE(2)
     A            S3B@W4         7Y 0O 14 58EDTCDE(2)
     A            S3B@W5         7Y 0O 14 71EDTCDE(2)
     A*
     A                                 21  2' '
     A          R CTL03                     SFLCTL(SFL03)
     A                                      SFLSIZ(0001)
     A                                      SFLPAG(0001)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A*N58                                  SFLEND(*MORE)
     A                                      PAGEUP(51)
     A                                      PAGEDOWN(52)
     A                                      OVERLAY
     A                                      CF12 CF08
     A********    #RCNO2         4  0H      SFLRCDNBR
     A                                  1  2'AB#RAU'
     A                                  1 17'** SHIP SCANNED BOX -
     A                                      INQUIRY BY LINE **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 23'INFO. BY SCANNED RESULT DATA'
