     A*%%TS  SD  20240305  143333  I0777       REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01(01)
     A          R DSP01
     A*%%TS  SD  20240305  143333  I0777       REL-V7R4M0  5770-WDS
     A                                  1  2'AB#CGN'
     A                                  1 25'** GENERAL CUSTOMER MENU **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  3  3'* ORDER *'
     A                                      COLOR(WHT)
     A                                  3 41'* INQUIRY *'
     A                                      COLOR(WHT)
     A                                  4  4'1.<AB#C4N> ORDER MAINTENANCE'
     A                                  4 42'41.<AB#C98> CUST SHIPPING STATUS I-
     A                                      NQ'
     A                                  5  4'2.<AB#CS0> SERVICE PARTS MENU'
     A                                  5 42'42.<AHBC02> APICS ORDER STATUS INQ'
     A                                  6  4'3.<AB#C2Z> FRS ORDER UPLOAD (TAKUM-
     A                                      I)'
     A                                  6 42'43.<AB#RAQI> LABEL SCAN STATUS INQ'
     A                                  7  4'4.<AFFC10> UPLOADING ORDER BY IFS'
     A                                  7 42'44.<AB#CL3> ASN PROCESSING INQ'
     A                                  8  4'5.<AB#C0W> PRINT FRS LIST'
     A                                  8 42'45.<AB#C1O> ORDER CHANGE HISTORY'
     A                                  9 42'46.<AM#C27> TOYOTA SCS PALLET VERI-
     A                                      F'
     A                                 10  3'* PACKING LIST *'
     A                                      COLOR(WHT)
     A                                 10 42'47.<AB#CBV> ORDER (WEB vs EDI) COM-
     A                                      P'
     A                                 11  4'11.<AB#C3Q> PACKING LIST'
     A                                 12 41'* MAINTENANCE *'
     A                                      COLOR(WHT)
     A                                 13  3'* LABEL *'
     A                                      COLOR(WHT)
     A                                 13 42'51.<AB#C90> PACKING LIST OPTION'
     A                                 14  4'21.<AB#C2C> PRINT LABEL'
     A                                 14 42'52.<AB#C4M> ORDER CANCELLATION'
     A                                 15  4'22.<AB#RAQ> SCAN DATA MAINTENANCE'
     A                                 15 42'53.<EDIR71> USER PART# MAINTENANCE'
     A                                 16  4'23.<AB#CA8> TOYOTA LABEL MAINTE'
     A                                 16 42'54.<AB#C1G> REVISION/ORIGIN COUNTR-
     A                                      Y'
     A                                 18  3'* ASN *'
     A                                      COLOR(WHT)
     A                                 18 41'* MENU *'
     A                                      COLOR(WHT)
     A                                 19  4'31.<AB#C0F> CREATE ASN (EDI)'
     A                                 19 42'60.<AB#CTM> TOYOTA MAINTENANCE MEN-
     A                                      U'
     A                                 20 42'61.<AM#C41> SHIPPING CONFIRMATION -
     A                                      MENU'
     A                                 21 42'62.<AL#C00> TOYOTA LABEL ISSUE MEN-
     A                                      U'
     A                                 22  5'SELECTION -->'
     A                                      DSPATR(HI)
     A            D@SLCT         2Y 0B 22 19DSPATR(CS)
     A                                      EDTCDE(4)
     A                                 23  5'F1:END'
