     A** AB#PWH3 ******************************************************
     A* UPDATE OF HONDA (DISTRIBUTING MASTER)                           *
     A*
     A*  KIRI 15.08.31
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------
     A          R DSP01
     A                                      CF01 CF12
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' ** DISTRIBUTING -
     A                                      MASTER **  '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT AB#PWH3'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  5 20'UPDATE'   DSPATR(UL)
     A                                   + 4'CUSTOMER'
     A                                      DSPATR(UL)
     A                                   + 2'DELIVERY'
     A                                      DSPATR(UL)
     A                                   + 2'SHIP TO CODE'
     A                                      DSPATR(UL)
     A*
     A            D1KBN          1A  B  7 22DSPATR(CS)
     A  21                                  DSPATR(PC RI)
     A*
     A            D1TOKU         4Y 0B  7 32TEXT('CUSTMER CODE')
     A                                      DSPATR(CS)
     A  22                                  DSPATR(PC RI)
     A                                      EDTCDE(4)
     A            D1NONY         4Y 0B  7 42TEXT('DELIVERY CODE')
     A                                      DSPATR(CS)
     A  23                                  DSPATR(PC RI)
     A                                      EDTCDE(4)
     A            D1SHCD        10   B  7 51TEXT('SHIP TO CODE')
     A                                      DSPATR(CS)
     A  24                                  DSPATR(PC RI)
     A*
     A                                 10 22'0- CANCEL '
     A                                 11 22'1- CHANGE '
     A                                 12 22'2- ADD    '
     A*
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D1ERR         60A  O 22 18
     A*
     A                                 24  4' F1 ' DSPATR(RI)
     A                                   + 1'EXIT'
     A                                 24 66' F12 ' DSPATR(RI)
     A                                   + 1'INQUIRY'
      *-------------------------------------
      *-------------------------------------
     A          R DSP02
     A                                      CF03 CF05
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' ** DISTRIBUTING -
     A                                      MASTER **  '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT AB#PWH3'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  5 20'UPDATE'   DSPATR(UL)
     A                                   + 4'CUSTOMER'
     A                                      DSPATR(UL)
     A                                   + 2'DELIVERY'
     A                                      DSPATR(UL)
     A                                   + 2'SHIP TO CODE'
     A                                      DSPATR(UL)
     A*
     A            D2KBN          8      7 20
     A*
     A            D1TOKU         4Y 0   7 32TEXT('CUSTMER CODE')
     A                                      EDTCDE(4)
     A            D1NONY         4Y 0   7 42TEXT('DELIVERY CODE')
     A                                      EDTCDE(4)
     A            D1SHCD        10      7 51TEXT('SHIP TO CODE')
     A*
     A            D2TNAM        15      8 32TEXT('CUSTMER NAME')
     A            D2NNAM        15      9 42TEXT('DELIVERY NAME')
     A*
     A                                 12 46'DESTINATION'
     A                                      DSPATR(UL)
     A*
     A            D2DEST         1   B 14 51TEXT('DESTINATION')
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  31                                  DSPATR(PC RI)
     A                                 14 56'1 - P.C.'
     A                                 15 56'2 - SALES'
     A*
     A*
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D2ERR         60A  O 22 18
     A*
     A                                 24  4' F3 ' DSPATR(RI)
     A                                   + 1'PREV. SCREEN'
     A                                   + 4' F5 ' DSPATR(RI)
     A                                   + 1'UPDATE OK'
     A*-------------------------------------
     A*-------------------------------------
