     A*%%TS  SD  20021002  102107  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20021001  082522  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 22'** ORDER CANCELLATION **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A            LIN1          78A  O  2  2DSPATR(UL)
     A                                  4 17'BARCODE:'
     A                                      DSPATR(HI)
     A            D@BRCD         9A  B  4 26DSPATR(CS)
     A                                      CHECK(ER)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A          R DSP99
     A            D@LIN2        78   O 22  2DSPATR(UL)
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
     A          R SFL01                     SFL
     A*%%TS  SD  20021001  083746  TEST        REL-V4R4M0  5769-PW1
     A            S@MHN1         5A  O  6  3
     A            S@MHN2         5A  O  6  9
     A            S@MHN3         5A  O  6 15
     A            S@SHN1         5A  O  6 22
     A            S@SHN2         5A  O  6 28
     A            S@SHN3         2A  O  6 34
     A            S@QTY          9Y 0O  6 38EDTCDE(1)
     A            S@ORNO        10A  O  6 52
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20021002  102107  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      CF12
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM           8A  O  1  2
     A                                  1 22'** ORDER CANCELLATION **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A            LIN1          78A  O  2  2DSPATR(UL)
     A                                  5  3'Cust part#'
     A                                      DSPATR(HI)
     A                                  5 22'IAF part#'
     A                                      DSPATR(HI)
     A                                  5 46'Qty'
     A                                      DSPATR(HI)
     A                                  5 52'Order#'
     A                                      DSPATR(HI)
     A                                  3  2'Cust:'
     A                                      DSPATR(HI)
     A            D@CUST         4S 0O  3  8
     A                                  3 13'Ship to:'
     A                                      DSPATR(HI)
     A            D@SHIP         4S 0O  3 22
     A                                  3 27'Factory:'
     A                                      DSPATR(HI)
     A            D@FACT         1A  O  3 36
     A                                  3 38'Dock:'
     A                                      DSPATR(HI)
     A            D@DOCK         4A  O  3 44
     A                                  3 49'Ship date:'
     A                                      DSPATR(HI)
     A            D@SHDT         8Y 0O  3 60EDTWRD('    /  /  ')
     A                                  3 72'Bin:'
     A                                      DSPATR(HI)
     A            D@BIN          2Y 0O  3 77EDTCDE(4)
     A                                  4 49'Release date:' DSPATR(HI)
     A            D@RLDT         8  0O  4 63EDTWRD('    /  /  ')
