     A*%%TS  SD  20211123  142326  I0777       REL-V7R3M0  5770-WDS
     A** AB#PWY1 *******************************************
     A* FORD CONTAINER TYPE MAINTENANCE                    *
     A* JW(SRA) 2015.12.14.                                *
JW   A* JW(SRA) 2021.11.23 ADD F10 PLANT INQ               *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*---------------------------------------------------------------
     A          R AB#PWY11
     A*%%TS  SD  20211123  142326  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('THE 1ST SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      CF07(07)
     A                                      CF09(09)
JW   A                                      CF10(10)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'FORD PLANT CODE & CONTAINER TYPE M-
     A                                      AINTENANCE'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AB#PWY11'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  8 19'PLANT CODE :'
     A            PLNT1          5A  B  8 32DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @MSG1         60A  O 22 18
     A N99N98                               DSPATR(ND)
     A                                 24  2'F3=EXIT'
     A                                      DSPATR(RI)
     A                                 24 14'F5=ADD'
     A                                      DSPATR(RI)
     A                                 24 25'F7=CHANGE'
     A                                      DSPATR(RI)
     A                                 24 39'F9=DELETE'
     A                                      DSPATR(RI)
     A                                 24 53'F10=PLANT INQ'
     A                                      DSPATR(RI)
     A*---------------------------------------------------------------
     A          R AB#PWY12
     A*%%TS  SD  20151214  113843  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT('ADD SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'FORD PLANT CODE & CONTAINER TYPE M-
     A                                      AINTENANCE'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AB#PWY12'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 68'ADD'
     A                                  5  2'PLANT CODE     :'
     A            PLNT2          5A  O  5 19
     A                                  7  2'CONTAINER TYPE :'
     A            @TYPE2        20A  B  7 19DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @MSG2         60A  O 22 18
     A N99N97                               DSPATR(ND)
     A                                 24  2'F3=EXIT'
     A                                      DSPATR(RI)
     A                                 24 15'F5=ADD'
     A                                      DSPATR(RI)
     A                                 24 27'F12=PREVIOUS'
     A                                      DSPATR(RI)
     A*---------------------------------------------------------------
     A          R AB#PWY13
     A*%%TS  SD  20151214  113843  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT('CHANGE SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF07(07)
     A                                      CF12(12)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'FORD PLANT CODE & CONTAINER TYPE M-
     A                                      AINTENANCE'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AB#PWFT3'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 68'CHANGE'
     A                                  5  2'PLANT CODE     :'
     A            PLNT3          5A  O  5 19
     A                                  7  2'CONTAINER TYPE :'
     A            @TYPE3        20A  B  7 19DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @MSG3         60A  O 22 18
     A N99N97                               DSPATR(ND)
     A                                 24  2'F3=EXIT'
     A                                      DSPATR(RI)
     A                                 24 15'F7=CHANGE'
     A                                      DSPATR(RI)
     A                                 24 29'F12=PREVIOUS'
     A                                      DSPATR(RI)
     A*---------------------------------------------------------------
     A          R AB#PWY14
     A*%%TS  SD  20151214  113843  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT('DELETE SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF09(09)
     A                                      CF12(12)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'FORD PLANT CODE & CONTAINER TYPE M-
     A                                      AINTENANCE'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AB#PWFT4'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 68'DELETE'
     A                                  5  2'PLANT CODE     :'
     A            PLNT4          5A  O  5 19
     A                                  7  2'CONTAINER TYPE :'
     A            @TYPE4        20A  O  7 19
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @MSG4         60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  2'F3=EXIT'
     A                                      DSPATR(RI)
     A                                 24 15'F9=DELETE'
     A                                      DSPATR(RI)
     A                                 24 29'F12=PREVIOUS'
     A                                      DSPATR(RI)
