     A*%%TS  SD  20011015  101044  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20011015  101044  TEST        REL-V3R7M0  5716-PW1
     A            #PGM           8A  O  1  2
     A                                  1 26'** CREATE DOCK LABEL DATA **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4 14'DELIVERY:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  4 24EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  4 32'FACTORY :'
     A                                      DSPATR(HI)
     A            D@FACT         1A  B  4 42DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  4 61'BIN:'
     A                                      DSPATR(HI)
     A            D@BIN          1  0B  4 66DSPATR(CS)
     A                                      EDTCDE(4)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  4 47'DOCK:'
     A                                      DSPATR(HI)
     A            D@DOCK         4A  B  4 53DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                  5 47'(BLANK=ALL)'
     A                                      DSPATR(HI)
     A                                  7 14'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D@SHDT         6Y 0B  7 25EDTCDE(4)
     A                                      DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                  7 35'(YYMMDD)'
     A                                      DSPATR(HI)
     A                                 10 14'ORDER#:'
     A                                      DSPATR(HI)
     A            D@ORDR        10A  B 10 22DSPATR(CS)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                 11 22'(BLANK-ALL)'
     A                                      DSPATR(HI)
     A                                 23  3'F1:END'
     A                                 23 14'F5:CREATE'
     A            D@MSG         78A  O 24  2
     A  99                                  DSPATR(RI)
