     A*%%TS  SD  20241209  133851  I0777       REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01(01)
     A          R DSP01
     A*%%TS  SD  20241209  133851  I0777       REL-V7R4M0  5770-WDS
     A            #PGM           8A  O  1  2
     A                                  1 23'** FORECAST PROCESS MENU **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4 14' 1. Process Status Inquiry <ABAR34-
     A                                      >'
     A                                  6 14' 2. Upload Process for TAKATA/JOYS-
     A                                      ON, JTEKT <ABACP3>'
     A                                  8 14' 3. Manual Entry <ABBC60>'
     A                                 10 14' 4. Detail(History) Inquiry By Cus-
     A                                      tomer <ABBR29B>'
     A                                 12 14' 5. Detail(History) Inquiry By IAF-
     A                                       Part# <ABBC25>'
     A                                 14 14' 6. Detail Print <ABBC26>'
     A                                 16 14' 7. Upload IFS(csv) FORECAST <AFFC-
     A                                      70>'
TCHK3A*TCHK2                           14 14' 7. Process/Section Download  '
     A                                 19 14' 9. Duplicate Inquiry <ABBC35>'
     A                                 22 13'Selection -->'
     A                                      DSPATR(HI)
     A            D@SLCT         2Y 0B 22 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(BL)
     A  41        D@MSG         78A  O 23  2
     A  41                                  DSPATR(BL)
     A                                 24  3'F1:END'
