     A* TCHK1 01/07/09 CREATE(COPY FROM ABAPW42)
     A* TCHK2 05/12/09 ADD FUNCTION
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP01
     A                                      OVERLAY
     A*           #PGM           8   O  1  2
     A                                  1  2'ABAR421'
     A                                  1 20'** TOYOTA WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4 19'START DATE:' DSPATR(HI)
     A            D@FRM          8  0B  4 31EDTCDE(4)  DSPATR(CS)
     A  41                                  DSPATR(RI PC)
     A                                  5 31'YYYYMMDD'
     A  41        D@MSG         45   O  6 31
     A          R DSP99
     A            D@CMD         78   O 24  2
     A*
     A          R SFL02                     SFL
     A            S2B@AS         1A  B  8  2
     A  55                                  DSPATR(PC)
     A            S2BNM         10A  O  8  4
     A            S2B@A1         6Y 1O  8 21EDTCDE(2)
     A            S2B@A2         6Y 1O  8 31EDTCDE(2)
     A            S2B@A3         6Y 1O  8 41EDTCDE(2)
     A            S2B@A4         6Y 1O  8 51EDTCDE(2)
     A            S2B@A5         6Y 1O  8 61EDTCDE(2)
     A            S2B@A6         6Y 1O  8 71EDTCDE(2)
     A          R CTL02                     SFLCTL(SFL02)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A N58                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      CF08
     A                                      CF09
     A                                      CF12
     A            #RCNO2         4  0H      SFLRCDNBR
     A*           #PGM           8A  O  1  2
     A                                  1  2'ABAR421'
     A                                  1 20'** TOYOTA WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 26'30 WEEKS # OF CONTAINERS'
     A                                  4  2'Monday date'
     A            S2SDT1         8A  O  4 21
     A                                      DSPATR(RI)
     A            S2SDT2         8A  O  4 31
     A                                      DSPATR(RI)
     A            S2SDT3         8A  O  4 41
     A                                      DSPATR(RI)
     A            S2SDT4         8A  O  4 51
     A                                      DSPATR(RI)
     A            S2SDT5         8A  O  4 61
     A                                      DSPATR(RI)
     A            S2SDT6         8A  O  4 71
     A                                      DSPATR(RI)
     A                                  5  2'Weekly Total'
     A            S2WKL1         6Y 1O  5 21EDTCDE(2)
     A            S2WKL2         6Y 1O  5 31EDTCDE(2)
     A            S2WKL3         6Y 1O  5 41EDTCDE(2)
     A            S2WKL4         6Y 1O  5 51EDTCDE(2)
     A            S2WKL5         6Y 1O  5 61EDTCDE(2)
     A            S2WKL6         6Y 1O  5 71EDTCDE(2)
     A                                  6  2'Daily average'
     A            S2DAV1         6Y 1O  6 21EDTCDE(2)
     A            S2DAV2         6Y 1O  6 31EDTCDE(2)
     A            S2DAV3         6Y 1O  6 41EDTCDE(2)
     A            S2DAV4         6Y 1O  6 51EDTCDE(2)
     A            S2DAV5         6Y 1O  6 61EDTCDE(2)
     A            S2DAV6         6Y 1O  6 71EDTCDE(2)
     A* ----------------------------------------------------
     A          R SFL03                     SFL
     A            S3B@AS         1A  B  8  2
     A  65                                  DSPATR(PC)
     A            S3BNM         10A  O  8  4
     A            S3B@A1         6Y 1O  8 21EDTCDE(2)
     A            S3B@A2         6Y 1O  8 31EDTCDE(2)
     A            S3B@A3         6Y 1O  8 41EDTCDE(2)
     A            S3B@A4         6Y 1O  8 51EDTCDE(2)
     A            S3B@A5         6Y 1O  8 61EDTCDE(2)
     A            S3B@A6         6Y 1O  8 71EDTCDE(2)
     A            H3NONM        10A  H
     A            H3DOCK         4A  H
     A          R CTL03                     SFLCTL(SFL03)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  66                                  SFLDSP
     A  66                                  SFLDSPCTL
     A  67                                  SFLCLR
     A N68                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      CF12
     A                                      CF08
     A                                      CF09
     A            #RCNO3         4  0H      SFLRCDNBR
     A*           #PGM           8A  O  1  2
     A                                  1  2'ABAR421'
     A                                  1 20'** TOYOTA WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 26'30 WEEKS # OF CONTAINERS'
     A                                  4  2'Monday date'
     A            S3SDT1         8A  O  4 21
     A                                      DSPATR(RI)
     A            S3SDT2         8A  O  4 31
     A                                      DSPATR(RI)
     A            S3SDT3         8A  O  4 41
     A                                      DSPATR(RI)
     A            S3SDT4         8A  O  4 51
     A                                      DSPATR(RI)
     A            S3SDT5         8A  O  4 61
     A                                      DSPATR(RI)
     A            S3SDT6         8A  O  4 71
     A                                      DSPATR(RI)
     A                                  5  2'Weekly Total'
     A            S3WKL1         6Y 1O  5 21EDTCDE(2)
     A            S3WKL2         6Y 1O  5 31EDTCDE(2)
     A            S3WKL3         6Y 1O  5 41EDTCDE(2)
     A            S3WKL4         6Y 1O  5 51EDTCDE(2)
     A            S3WKL5         6Y 1O  5 61EDTCDE(2)
     A            S3WKL6         6Y 1O  5 71EDTCDE(2)
     A                                  6  2'Daily Average'
     A            S3DAV1         6Y 1O  6 21EDTCDE(2)
     A            S3DAV2         6Y 1O  6 31EDTCDE(2)
     A            S3DAV3         6Y 1O  6 41EDTCDE(2)
     A            S3DAV4         6Y 1O  6 51EDTCDE(2)
     A            S3DAV5         6Y 1O  6 61EDTCDE(2)
     A            S3DAV6         6Y 1O  6 71EDTCDE(2)
     A* ----------------------------------------------------
     A          R SFL04                     SFL
     A            S4B@AS         1A  B  8  2
     A  75                                  DSPATR(PC)
     A            S4MHIN        15A  O  8  4
     A            S4B@A1         6Y 1O  8 21EDTCDE(2)
     A            S4B@A2         6Y 1O  8 31EDTCDE(2)
     A            S4B@A3         6Y 1O  8 41EDTCDE(2)
     A            S4B@A4         6Y 1O  8 51EDTCDE(2)
     A            S4B@A5         6Y 1O  8 61EDTCDE(2)
     A            S4B@A6         6Y 1O  8 71EDTCDE(2)
     A            S4SHIN        15A  O  9  4COLOR(WHT)
     A            H4SHIN        15A  H
     A          R CTL04                     SFLCTL(SFL04)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A  76                                  SFLDSP
     A  76                                  SFLDSPCTL
     A  77                                  SFLCLR
     A N78                                  SFLEND(*MORE)
     A  79                                  SFLDROP(CF10)
     A                                      OVERLAY
     A                                      CF12
     A                                      CF08
     A                                      CF09
     A            #RCNO4         4  0H      SFLRCDNBR
     A            N#MOD4         1A  H
     A*           #PGM           8A  O  1  2
     A                                  1  2'ABAR421'
     A                                  1 20'** TOYOTA WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 26'30 WEEKS # OF CONTAINERS'
     A            S4NONM        10A  O  3  2
     A            S4DOCK         4A  O  3 14
     A                                  4  2'Monday date'
     A            S4SDT1         8A  O  4 21
     A                                      DSPATR(RI)
     A            S4SDT2         8A  O  4 31
     A                                      DSPATR(RI)
     A            S4SDT3         8A  O  4 41
     A                                      DSPATR(RI)
     A            S4SDT4         8A  O  4 51
     A                                      DSPATR(RI)
     A            S4SDT5         8A  O  4 61
     A                                      DSPATR(RI)
     A            S4SDT6         8A  O  4 71
     A                                      DSPATR(RI)
     A                                  5  2'Weekly Total'
     A            S4WKL1         6Y 1O  5 21EDTCDE(2)
     A            S4WKL2         6Y 1O  5 31EDTCDE(2)
     A            S4WKL3         6Y 1O  5 41EDTCDE(2)
     A            S4WKL4         6Y 1O  5 51EDTCDE(2)
     A            S4WKL5         6Y 1O  5 61EDTCDE(2)
     A            S4WKL6         6Y 1O  5 71EDTCDE(2)
     A                                  6  2'Daily Average'
     A            S4DAV1         6Y 1O  6 21EDTCDE(2)
     A            S4DAV2         6Y 1O  6 31EDTCDE(2)
     A            S4DAV3         6Y 1O  6 41EDTCDE(2)
     A            S4DAV4         6Y 1O  6 51EDTCDE(2)
     A            S4DAV5         6Y 1O  6 61EDTCDE(2)
     A            S4DAV6         6Y 1O  6 71EDTCDE(2)
     A                                  7  2'User Part# /'
     A                                  7 15'IAF Part#'
     A                                      COLOR(WHT)
