     A*%%TS  SD  20200526  173701  I0777       REL-V7R3M0  5770-WDS
     A* TCHK1 10/08/08 CREATE
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP01
     A                                      OVERLAY
     A            #PGM           8   O  1  2
     A                                  1 20'** FORD WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4 19'START DATE:' DSPATR(HI)
     A            D@FRM          8  0B  4 31EDTCDE(4)  DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A                                  5 31'YYYYMMDD'
     A  61        D@MSG         45   O  6 31
     A          R DSP99
     A            D@CMD         78   O 24  2
     A*
     A          R SFL02                     SFL
     A*%%TS  SD  20200526  173701  I0777       REL-V7R3M0  5770-WDS
     A            S2BNM         18A  O  8  2
     A            S2B@A1         6Y 1O  8 21EDTCDE(2)
     A            S2B@A2         6Y 1O  8 31EDTCDE(2)
     A            S2B@A3         6Y 1O  8 41EDTCDE(2)
     A            S2B@A4         6Y 1O  8 51EDTCDE(2)
     A            S2B@A5         6Y 1O  8 61EDTCDE(2)
     A            S2B@A6         6Y 1O  8 71EDTCDE(2)
      *
     A          R CTL02                     SFLCTL(SFL02)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  56                                  SFLDSP
     A  56                                  SFLDSPCTL
     A  57                                  SFLCLR
     A N58                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      CF12
JW1  A                                      CF07
     A                                      CF08
     A                                      CF09
     A            #RCNO2         4  0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 20'** FORD WEEKLY FORECAST -
     A                                      INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 26'30 WEEKS # OF CONTAINERS'
     A                                  4  2'Monday date'
     A            D@SDT1         8A  O  4 21
     A                                      DSPATR(RI)
     A            D@SDT2         8A  O  4 31
     A                                      DSPATR(RI)
     A            D@SDT3         8A  O  4 41
     A                                      DSPATR(RI)
     A            D@SDT4         8A  O  4 51
     A                                      DSPATR(RI)
     A            D@SDT5         8A  O  4 61
     A                                      DSPATR(RI)
     A            D@SDT6         8A  O  4 71
     A                                      DSPATR(RI)
     A                                  5  2'Weekly Total'
     A            D@WKL1         6Y 1O  5 21EDTCDE(2)
     A            D@WKL2         6Y 1O  5 31EDTCDE(2)
     A            D@WKL3         6Y 1O  5 41EDTCDE(2)
     A            D@WKL4         6Y 1O  5 51EDTCDE(2)
     A            D@WKL5         6Y 1O  5 61EDTCDE(2)
     A            D@WKL6         6Y 1O  5 71EDTCDE(2)
     A                                  6  2'Daily Average'
     A            D@DAV1         6Y 1O  6 21EDTCDE(2)
     A            D@DAV2         6Y 1O  6 31EDTCDE(2)
     A            D@DAV3         6Y 1O  6 41EDTCDE(2)
     A            D@DAV4         6Y 1O  6 51EDTCDE(2)
     A            D@DAV5         6Y 1O  6 61EDTCDE(2)
     A            D@DAV6         6Y 1O  6 71EDTCDE(2)
