     A*%%TS  SD  20241108  135540  I0777       REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF12
     A**                                    CF08
     A**                                    CF09
     A          R DSP01
     A*%%TS  SD  20241105  094449  I0777       REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 22'** FORD EDI862 INQUIRY **'
     A                                      DSPATR(RI)
     A                                  2  2'Select'
     A                                      DSPATR(HI)
     A                                  2 10'Cust:'
     A                                      DSPATR(HI)
     A            D@TOKU         4Y 0B  2 16DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                  2 21'Delv:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  2 27DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  2 32'(Required)'
     A                                  3 21'Dock:'
     A            D@NUKE         4A  B  3 27DSPATR(CS)
     A                                  3 32'(Optional)'
     A*----------------------------------------------------------
     A*
     A*
     A*
     A          R SFL01                     SFL
     A*%%TS  SD  20241108  085815  I0777       REL-V7R4M0  5770-WDS
     A*
     A            S@SLCT         1A  B  5  2DSPATR(CS)
     A            S@MHN1         5A  O  5  4
     A            S@MHN2         5A  O  5 10
     A            S@MHN3         5A  O  5 16
     A            S@TOKU         4S 0O  5 22
     A            S@NONY         4S 0O  5 27
     A            S@NUKE         4A  O  5 32
     A            S@QPC          5Y 0O  5 37EDTCDE(1)
     A            S@FRDQ         8Y 0O  5 44EDTCDE(1)
     A                                      COLOR(TRQ)
     A            S@IAFQ         8Y 0O  5 55EDTCDE(1)
     A                                      COLOR(PNK)
     A            S@DIFF         7Y 0O  5 66EDTCDE(2)
     A            S@ADD          1A  O  5 78
     A*------------------------------------------------------------
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20241108  135540  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      CF05
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      OVERLAY
     A N55                                  SFLEND(*MORE)
     A*
     A            #PGM           8A  O  1  2
     A                                  1 15'** FORD EDI862 INQ **'
     A                                      DSPATR(RI)
     A                                  1 37'(SHIP DATE'
     A            D@NOHZ         8Y 0B  1 48EDTWRD('    /  /  ')
     A                                      COLOR(WHT)
     A                                  1 59')'
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  4'Cust:'
     A                                      DSPATR(HI)
     A            D@TOKU         4Y 0B  2 10DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                  2 15'Delv:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  2 21DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            D@NAM         15A  O  2 27COLOR(YLW)
     A                                  2 44'Dock:'
     A            D@NUKE         4A  B  2 50DSPATR(CS)
     A                                  4  4'User Part#     '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 22'CUST'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 27'DELV'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 32'DOCK'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 39' QPC'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 44' FORD-YTD '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 55' IAF-SHPD '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 66'   DIFF. '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 76'AD-ON'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A* ----------------------------------------------------
     A          R SFL02                     SFL
     A*%%TS  SD  20241107  102823  I0777       REL-V7R4M0  5770-WDS
     A            H@DATE         8S 0H
     A            H@QTY1         7Y 0H
     A            H@QTY2         7Y 0H
     A            H@QTY3         7Y 0H
     A            H@QTY4         7Y 0H
     A            H@QTY5         7Y 0H
     A            H@QTY6         7Y 0H
     A            H@QTY7         7Y 0H
     A*
     A            S@DATE         6Y 0O  6  2EDTWRD('  /  /  ')
     A            S@QTY1         9A  O  6 11
     A            S@QTY2         9A  O  6 21
     A            S@QTY3         9A  O  6 31
     A            S@QTY4         9A  O  6 41
     A            S@QTY5         9A  O  6 51
     A            S@QTY6         9A  O  6 61
     A            S@QTY7         9A  O  6 71
     A*------------------------------------------------------
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20241107  102823  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #RCNO1         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 22'** FORD EDI862 INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  2'SHIP TO:'
     A                                      DSPATR(HI)
     A            D2NONY         4S 0O  2 11
     A            D2NUKE         4A  O  2 16
     A            D@NAM         15A  O  3 11
     A                                  3 29'USER PART#:'
     A                                      DSPATR(HI)
     A            D@MHN1         5A  O  3 41
     A            D@MHN2         5A  O  3 47
     A            D@MHN3         5A  O  3 53
     A            D@MHN4         5A  O  3 59
     A                                  4 13'RCV DATE'
     A                                      DSPATR(HI)
     A                                  5  2'SHP DATE'
     A                                      DSPATR(HI)
     A            D@DAT1         6Y 0O  5 13DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT2         6Y 0O  5 23DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT3         6Y 0O  5 33DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT4         6Y 0O  5 43DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT5         6Y 0O  5 53DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT6         6Y 0O  5 63DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A            D@DAT7         6Y 0O  5 73DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A*
     A* ----------------------------------------------------
     A*
     A          R DSP99
     A*%%TS  SD  20210507  131646  I0777       REL-V7R3M0  5770-WDS
     A            D@MSG         78A  O 23  2DSPATR(BL)
     A            D@CMD1        61A  O 24  2
     A* ----------------------------------------------------
     A          R DSP992
     A*%%TS  SD  20210623  155537  I0777       REL-V7R3M0  5770-WDS
     A            D@MSG         78A  O 23  2DSPATR(BL)
     A            D@CMD1        61A  O 24  2
