     A*%%TS  SD  20030718  090336  TEST        REL-V4R4M0  5769-PW1
     A** ABBPW55 ************************
     A*  ..SETTING NUMBER CHECK LIST..  *
     A*                                 *
     A************************ ABBPW55 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R ABBPW551
     A*%%TS  SD  20030718  090336  TEST        REL-V4R4M0  5769-PW1
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 21'  **  SETTING NUMBER CHECK LIST  *-
     A                                      *  '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 67'FMT ABBPW55'
     A                                 24  2'CANCEL'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 22'HANDLING START'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
     A            D@PCNT         3Y 0B  7 39EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 43'%'
     A                                  7 20'LIST UP PARTS OVER'
     A                                  2 28'DEMAND VS. SETTING QTY'
     A                                      DSPATR(RI)
     A                                 11 32'OPTION'
     A            D@OPTN         1A  B 11 39DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                 11 43'A=IAF   B=ASJ   BLANK=BOTH'
     A                                  9 30'OR UNDER'
     A            D@PCNX         3Y 0B  9 39EDTCDE(4)
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 43'%'
