     A*%%TS  SD  20011023  131339  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20011023  131339  TEST        REL-V3R7M0  5716-PW1
     A            #PGM           8A  O  1  2
     A                                  1 14'* MONTHLY SUMMARY DATA OF PRIORIT-
     A                                      Y KANBANS FOR EXCEL *'
     A                                      DSPATR(RI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                 23  3'F3: END      F5: CREATE'
     A            D@MSG         78   O 24  2DSPATR(HI)
     A                                  7 26'MONTH:'
     A                                      DSPATR(HI)
     A            D@MMYY         4  0B  7 34EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 41'(MMYY)'
