     A* TCHK  10/10/13 CREATE
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A            #PGM           8A  O  1  2
     A                                  1 15'** PPRIORITY #OF KANBAN -
     A                                      FOR PC DATA CREATE **'
     A                                      DSPATR(RI)
     A                                  1 42DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A*
     A                                  7 30'DATE :'
     A                                      DSPATR(HI)
     A            D@DATE         8Y 0B  7 37EDTCDE(4)
     A                                      DSPATR(CS)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A*
     A                                  9 30'SHIFT:'
     A                                      DSPATR(HI)
     A            D@SHFT         1A  B  9 37DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A*
     A  69                             23  2'Error'
     A  69                                  DSPATR(RI BL)
     A  69        MSG           70A  O 23  8
     A  69                                  DSPATR(RI BL)
     A*
     A                                 24  2'F1:END'
     A                                 24 12'F5:CREATE'
