     A*%%TS  SD  20020502  132131  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20020502  132131  TEST        REL-V4R4M0  5769-PW1
     A            #PGM           8A  O  1  2
     A                                  1 22'** PRIORITY KANBAN RANKING LIST **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4 17'DATE:'
     A                                      DSPATR(HI)
     A            D@FRM          8Y 0B  4 27EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  4 37'-'
     A                                      DSPATR(HI)
     A            D@TO           8Y 0B  4 40EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  5 27'YYYYMMDD'
     A                                  5 40'YYYYMMDD'
     A                                 13 17'COPIES:'
     A                                      DSPATR(HI)
     A            D@CPY          2Y 0B 13 27EDTCDE(4)
     A                                      DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                 23  3'F3: END      F5: PRINT'
     A                                  7 17'TOP:'
     A                                      DSPATR(HI)
     A            D@TOP          3Y 0B  7 27EDTCDE(4)
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 17'OPTION:'  DSPATR(HI)
     A            D@OPTN         1   B  9 28DSPATR(CS)
     A  65                                  DSPATR(RI PC)
     A                                  9 32'1:BY PART    2:BY MACHINE#'
     A                                 11 17'LOCATION:' DSPATR(HI)
     A  11                                  DSPATR(ND)
     A            D@LOC          1   B 11 28
     A N11                                  DSPATR(CS)
     A  11                                  DSPATR(ND PR)
     A  66                                  DSPATR(RI PC)
     A                                 11 32'1:HD   2:RL   3:SURFACE TREATMENT'
     A  11                                  DSPATR(ND)
