     A** ABBPW01 ********************************
     A*  ..SETTING NUMBER AUTOMATIC HANDLING..  *
     A*     I-HASADA               86.10.01     *
     A******************************** ABBPW01 **
     A                                      CHGINPDFT
     A                                      PRINT
      *
     A          R ABBPW011
     A                                      CF01(01)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 21'* SETTING NUMBER AUTOMATIC HANDLIN-
     A                                      G *'
     A                                      DSPATR(RI UL)
     A                                  1 67'FMT ABBPW01'
      *
     A                                  6 28' CURRENT MONTH DATE '
     A                                      DSPATR(RI)
     A            PYM            6A  O  8 34
      *
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99                             21 18'FRS FOR SPECIFIC USER HAS NOT BEEN-
     A                                       PROCESSED.'
     A  99                             22 18'PLEASE PROCESS. FIN MEANS PROCESS -
     A                                      HAS BEEN CONPLEFED.'
      *
     A                                 24  2'CANCEL'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 22'HANDLING START'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
