     A*%%TS  SD  20240805  141436  I0777       REL-V7R4M0  5770-WDS
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A                                      CF09
     A                                      CF10
     A          R DSP01
     A*%%TS  SD  20240805  141436  I0777       REL-V7R4M0  5770-WDS
     A                                      KEEP
     A            #PGM           8A  O  1  2
     A                                  1 20'* PRIORITY KANBAN LIST (SEPARATE B-
     A                                      Y GROUP) *'
     A                                      DSPATR(RI)
     A                                  1 59DATE
     A                                      EDTCDE(Y)
     A                                  1 68TIME
     A                                  4 23'DATE:'
     A                                      DSPATR(HI)
     A            D@YMD          6Y 0B  4 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 29'YYMMDD'
     A                                  7 23'SHIFT....:'
     A                                      DSPATR(HI)
     A            D@SHFT         1A  B  7 34DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 23'COPIES...:'
     A                                      DSPATR(HI)
     A            D@CPY          2Y 0B  9 34EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                 11 23'LIST TYPE:'
     A                                      DSPATR(HI)
     A            D@TYPE         1A  B 11 34DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 11 37'1=APICS ONLY, Blank=ALL'
     A                                 13 23'Printer..:'
     A                                      DSPATR(HI)
     A            D@PRT          1A  B 13 34DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                 13 37'Blank=Printer C(APICS)'
     A                                 14 37'1.APICS1 (LANPRT02)'
     A                                 15 37'2.APICS2 (LANPRT09)'
     A                                 16 37'3.Office (LANPRT03)'
     A                                 17 37'4.G/L Room (LANPRT04)'
     A                                 18 37'5.APICS3 (PRINTERB)'
     A                                 19 37'6.Computer Room'
     A                                 20 37'7.DOCK 6 (LANPRT10)'
     A                                 21 37'8.Tool Room (LANPRT05)'
     A*
     A            XMSG          60A  O 22  3COLOR(WHT)
     A                                 23  3'F3: END      F5: PRINT'
     A                                 23 31'F9: GROUP MASTER'
     A                                 23 53'F10: KANBAN SCAN INQ'
