     A*%%TS  SD  20190228  111636  I0777       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R SFL00                     SFL
     A*%%TS  SD  20181019  163011  I0777       REL-V7R3M0  5770-WDS
     A            S@SLCT         1A  B  6  2DSPATR(CS)
     A            S@MPR1         5A  O  6  4
     A            S@MPR2         5A  O  6 10
     A            S@MPR3         5A  O  6 16
     A            S@MPR4         5A  O  6 22
     A            S@NONY         4S 0O  6 28
     A            S@NKOJ         1A  O  6 33
     A            S@NUKE         4A  O  6 35
     A            S@SEBN         4A  O  6 40
     A            S@MQT1         9Y 0O  6 45EDTCDE(1)
     A            S@MQT2         9Y 0O  6 57EDTCDE(1)
     A            S@MQT3         9Y 0O  6 69EDTCDE(1)
     A            S@SPR1         5A  O  7  4COLOR(YLW)
     A            S@SPR2         5A  O  7 10COLOR(YLW)
     A            S@SPR3         2A  O  7 16COLOR(YLW)
     A            S@MVOL         7Y 0O  7 19EDTCDE(1)
     A                                      COLOR(YLW)
     A            S@SSYS         5Y 0O  7 34EDTCDE(1)
     A                                      COLOR(YLW)
     A            H@MQT1         9Y 0H
     A            H@MQT2         9Y 0H
     A            H@MQT3         9Y 0H
     A            H@MQT4         9Y 0H
     A            H@MQT5         9Y 0H
     A            H@MQT6         9Y 0H
     A            H@MQT7         9Y 0H
     A            H@MQT8         9Y 0H
     A            H@MQT9         9Y 0H
     A            H@ISDT         6Y 0H
     A            S@CUST         4S 0H
     A          R CTL00                     SFLCTL(SFL00)
     A*%%TS  SD  20181203  174321  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      CF06
     A  53                                  SFLDSP
     A  53                                  SFLDSPCTL
     A  54                                  SFLCLR
     A                                      OVERLAY
     A N55                                  SFLEND(*MORE)
     A  56                                  SFLDROP(CF10)
     A                                      SFLMODE(&N#MODE)
     A            #RCNO          4S 0H      SFLRCDNBR
     A            N#MODE         1A  H
     A*
     A            #PGM           8A  O  1  2
     A                                  1 22'** FORECAST HISTORY DATA INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  2'Select'
     A                                      DSPATR(HI)
     A                                  2 10'Cust:'
     A                                      DSPATR(HI)
     A            D@CUST         4Y 0B  2 16DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  2 21'Ship:'
     A                                      DSPATR(HI)
     A            D@NONY         4Y 0B  2 27DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                  2 32'(one of field required)'
     A                                  3 10'Factory:'
     A            D@NKOJ         1A  B  3 19DSPATR(CS)
     A                                  3 21'Dock:'
     A            D@NUKE         4A  B  3 27DSPATR(CS)
     A                                  3 32'(optional)'
     A                                  4  4'User Part#'
     A                                      DSPATR(HI)
     A                                  4 28'Ship To'
     A                                      DSPATR(HI)
     A                                  4 47'---- Monthly Forecast Qty ----'
     A                                      DSPATR(HI)
     A                                  5  4'IAF Part#'
     A                                      COLOR(YLW)
     A                                  5 18'MonthlyVol'
     A                                      COLOR(YLW)
     A                                  5 37'Q/C'
     A                                      COLOR(YLW)
     A            D@MON1         3A  O  5 51DSPATR(HI)
     A            D@MON2         3A  O  5 63DSPATR(HI)
     A            D@MON3         3A  O  5 75DSPATR(HI)
