     A*%%TS  SD  20240805  125938  I0777       REL-V7R4M0  5770-WDS
     A** ABBPW7Q  ******************************************
     A*  PRIORITY KANBAN FILE INQ                          *
     A*  J.WATANABE 2024.08.05                             *
     A*  TYPE (1-DATE, 2-SFL LINE)                         *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*---------------------------------------------------------------
     A          R DSP01
     A*%%TS  SD  20240805  112344  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE 1ST SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF12(12)
     A                                      BLINK
     A  85                                  ALARM
     A                                      KEEP
     A                                  1  3'ABBR7Q '
     A                                  1 23'** PRIORITY KANBAN FILE INQ **'
     A                                      DSPATR(RI)
     A                                  1 67'DATE'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 67'TIME'
     A                                  2 72TIME
     A                                  9 16'SCAN DATE FROM:'
     A            XFROM         10A  B  9 33DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  9 44'TO:'
     A            XTO           10A  B  9 48DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                  9 59'(YYYYMMDD)'
     A                                      COLOR(YLW)
     A            XMSG          60A  O 22  4
     A                                 24  4'F1/3: EXIT'
     A                                      DSPATR(RI)
     A                                 24 22'ENTR:RUN'
     A                                      DSPATR(RI)
     A*---------------------------------------------------------------
     A          R SFL01                     SFL
     A*%%TS  SD  20240805  125938  I0777       REL-V7R4M0  5770-WDS
     A            S1DATE         8Y 0B  6 20EDTWRD('    /  /  ')
     A            S1SH1          3Y 0O  6 33EDTCDE(1)
     A            S1SH2          3Y 0O  6 40EDTCDE(1)
     A            S1SH3          3Y 0O  6 47EDTCDE(1)
     A*---------------------------------------------------------------
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20240805  125938  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      CF03(03)
     A                                      CF12(12)
     A  70                                  SFLDSP
     A  70                                  SFLDSPCTL
     A  71                                  SFLCLR
     A N51                                  SFLEND(*MORE)
     A                                      BLINK
     A  85                                  ALARM
     A                                      KEEP
     A                                      OVERLAY
     A                                      PROTECT
     A                                  1  2'ABBP7Q '
     A                                  1 20'** PRIORITY KANBAN FILE INQ **'
     A                                      DSPATR(RI)
     A                                  1 67'Date'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 13'SCAN DATE FROM:'
     A                                      COLOR(YLW)
     A            XFROM         10A  O  2 29
     A                                  2 41'TO:'
     A                                      COLOR(YLW)
     A            XTO           10A  O  2 45
     A                                  2 67'Time'
     A                                  2 72TIME
     A                                  4 33'===== SHIFT ====='
     A                                      COLOR(WHT)
     A                                  5 33'1st    2nd    3rd'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A*---------------------------------------------------------------
     A          R DSP99
     A*%%TS  SD  20240222  135516  I0777       REL-V7R4M0  5770-WDS
     A                                      CF03
     A                                      CF12
     A            XMSG          60A  O 23  4
     A                                 24  4'F3:EXIT'
     A                                      DSPATR(RI)
     A                                 24 50'F12:'
     A                                      DSPATR(RI)
     A                                 24 55'BACK'
