     A*%%TS  SD  20040331  133917  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20040331  133917  TEST        REL-V5R1M0  5722-WDS
     A            #PGM           8A  O  1  2
     A                                  1 19'* CREATE PRIORITY DATA FOR DOWNLOA-
     A                                      DING *'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  5 21'DATE:'
     A                                      DSPATR(HI)
     A            D@YYMM         6Y 0B  5 27EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                 23  3'F3:END   F5:CREATE'
     A                                  6 27'YYYYMM'
     A                                 10 21'SHIFT:'
     A                                      DSPATR(HI)
     A                                  8 21'LOCATION:'
     A                                      DSPATR(HI)
     A            D@LOC          1A  B  8 31DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  8 34'(1=HD, 2=RL, 3=SURFACE TREATMENT, -
     A                                      BLANK=ALL)'
     A            D@SHFT         1A  B 10 31DSPATR(CS)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
