     A*%%TS  SD  20001201  162027  TEST        REL-V3R7M0  5716-PW1
     A*** ABBPW40****** **********************
     A* FORCAST FILE UPDATE PROCESS          *
     A*           A-MAMIYA   2000.12.01      *
     A***************************** ABBPW40 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A***********
     A* SCREEN 1*
     A***********
     A          R ABBPW401
     A*%%TS  SD  20001201  160446  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23'** FORECAST FILE UPDATE PROCESS **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT ABBPW401'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 12'UPDATE'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @KOKU          1A  B  7 15DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  8 15'0 - CANCEL'
     A                                  9 15'1 - CHANGE'
     A                                 10 15'2 - ADD'
     A                                  5 28'PLAN DATE'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @KYY           4Y 0B  7 30DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  8 30'YEAR'
     A                                 10 28'WIRE           '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @ZAIS         15A  B 12 28DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  9 46'WIRE'
     A                                      COLOR(WHT)
     A                                 10 46'DIAMETER'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @ZAIK          5Y 2B 12 46DSPATR(CS)
     A                                      EDTWRD('   .  ')
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  9 57'MATERIAL'
     A                                      COLOR(WHT)
     A                                 10 57'TYPE    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @PTCD          1A  B 12 58DSPATR(CS)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                 15 28'SUPPLIER CODE'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @SIRE          4Y 0B 17 32DSPATR(CS)
     A                                      EDTCDE(Z)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 15 44'RECEIVING CODE'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @UKEI          4Y 0B 17 49DSPATR(CS)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  8'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 12 60'R:ROD '
     A                                 13 60'W:WIRE'
     A*
     A************
     A* SCREEN 2*
     A************
     A          R ABBPW402
     A*%%TS  SD  20001201  162027  TEST        REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1 19'** FORECAST FILE UPDATE PROCESS **'
     A                                      DSPATR(RI)
     A                                  2  2'TIME'
     A                                  2  7TIME
     A                                  3  2'DATE'
     A                                  3  7DATE
     A                                      EDTCDE(Y)
     A                                  1 68'FMT ABBPW402'
     A            WKSNM         10A  O  2 21DSPATR(BL)
     A                                  4  5'PLAN DATE'
     A                                      DSPATR(UL)
     A            @KYY           4Y 0O  5  7EDTCDE(Z)
     A                                  4 18'WIRE           '
     A                                      DSPATR(UL)
     A                                  3 36'WIRE'
     A                                  4 36'DIAMETER'
     A                                      DSPATR(UL)
     A                                  3 47'MATERIAL'
     A                                  4 47'TYPE    '
     A                                      DSPATR(UL)
     A                                  3 58'SUPPLIER'
     A                                  4 58'CODE    '
     A                                      DSPATR(UL)
     A                                  3 69'RECEIVING'
     A                                  4 69'CODE     '
     A                                      DSPATR(UL)
     A            @ZAIS         15A  O  5 18
     A            @ZAIK          5Y 2O  5 37EDTCDE(1)
     A            @TYPE          4A  O  5 48
     A            @SIRE          4Y 0O  5 60
     A            @UKEI          4Y 0O  5 71
     A                                  7  7'FORECAST WEIGHT (KG)'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 10'JAN    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 20'FEB    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 30'MAR    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 40'APR    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 50'MAY    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9 60'JUN    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 10'JUL    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 20'AUG    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 30'SEP    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 40'OCT    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 50'NOV    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 60'DEC    '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            @JRY01         7Y 0B 10 10EDTCDE(Z)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A  21                                  DSPATR(PR)
     A N21                                  DSPATR(CS)
     A            @JRY02         7Y 0B 10 20EDTCDE(Z)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A  22                                  DSPATR(PR)
     A N22                                  DSPATR(CS)
     A            @JRY03         7Y 0B 10 30EDTCDE(Z)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  23                                  DSPATR(PR)
     A N23                                  DSPATR(CS)
     A            @JRY04         7Y 0B 10 40EDTCDE(Z)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  24                                  DSPATR(PR)
     A N24                                  DSPATR(CS)
     A            @JRY05         7Y 0B 10 50EDTCDE(Z)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A  25                                  DSPATR(PR)
     A N25                                  DSPATR(CS)
     A            @JRY06         7Y 0B 10 60EDTCDE(Z)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  26                                  DSPATR(PR)
     A N26                                  DSPATR(CS)
     A            @JRY07         7Y 0B 15 10EDTCDE(Z)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  27                                  DSPATR(PR)
     A N27                                  DSPATR(CS)
     A            @JRY08         7Y 0B 15 20EDTCDE(Z)
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A  28                                  DSPATR(PR)
     A N28                                  DSPATR(CS)
     A            @JRY09         7Y 0B 15 30EDTCDE(Z)
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A N29                                  DSPATR(CS)
     A            @JRY10         7Y 0B 15 40EDTCDE(Z)
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A  30                                  DSPATR(PR)
     A N30                                  DSPATR(CS)
     A            @JRY11         7Y 0B 15 50EDTCDE(Z)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A N31                                  DSPATR(CS)
     A            @JRY12         7Y 0B 15 60EDTCDE(Z)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A  32                                  DSPATR(PR)
     A N32                                  DSPATR(CS)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  1'PREVIOUS SCREEN'
     A                                 24 17'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE'
     A                                 24 31'CMD-5'
     A                                      DSPATR(RI)
