     A*%%TS  SD  20170824  093936  I0777       REL-V7R1M0  5770-WDS
     A** ABBPW7L ***********************************
     A* GROUP MASTER
     A*     Y.SAMEJIMA 2015.06.08                  *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R ABBPW7L1
     A*%%TS  SD  20170824  093936  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      CF12(12)
     A                                      BLINK
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** UPDATE MACHINE#/LOCATION/SIZE M-
     A                                      ASTER **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT ABBPW7L'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  7  5'CODE'
     A                                      DSPATR(RI)
     A                                  7 19'MACHINE#'
     A                                  7 29'LOCATION'
     A*
     A            @KOSN          1A  B  9  7DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            @MCN#          3A  B  9 21DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            @LOCT          6A  B  9 29TEXT('LOCATION')
     A                                      DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                 11  7'0 :DELETE'
     A                                 12  7'1 :CHANGE'
     A                                 13  7'2 :ADD   '
     A*
     A                                 23  2'ERR'
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            @ERR          60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
     A*
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                 24  7'END   '
     A                                 24 67' F12 '
     A                                      DSPATR(RI)
     A                                 24 73'INQ   '
     A*
     A          R ABBPW7L2
     A*%%TS  SD  20170824  093936  I0777       REL-V7R1M0  5770-WDS
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** UPDATE MACHINE#/LOCATION/SIZE M-
     A                                      ASTER **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT ABBPW7L'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  4  3'MACHINE#'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  5  3'LOCATION'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A*
     A            @MCN#          3A  O  4 12
     A            @LOCT          6A  O  5 12TEXT('LOCATION')
     A*
     A                                  8 30'PART SIZE'
     A            @SIZE          1A  B 10 30DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                 10 35'1:M6'
     A                                      DSPATR(HI)
     A                                 11 35'2:M8'
     A                                      DSPATR(HI)
     A                                 12 35'3:M10'
     A                                      DSPATR(HI)
     A                                 13 35'4:NUT'
     A                                      DSPATR(HI)
     A                                 14 35'5:TS '
     A                                      DSPATR(HI)
     A                                 15 35'6:H/V'
     A                                      DSPATR(HI)
     A                                 16 35'7:E/G'
     A                                      DSPATR(HI)
     A*
     A                                 23  2'ERR'
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            @ERR          60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
     A*
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                 24  7'BACK'
     A                                 24 13' F5 '
     A                                      DSPATR(RI)
     A                                 24 18'UPDATE'
