     A** ABDPW02 *********************************
     A* A-PICS FIXED INCREASE AND DECREASE LIST *
     A* FILE ID. : ABDPW02. <DSPF> *
     A* CREATE DATE. : NOV.30,'90.               *
     A* AUTHOR.         : KOHHY.                 *
     A********************************* ABDPW02 **
     A*%%EC
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R ABDPW021                  CA01(01) CA02(02) CA05(05)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      BLINK PUTOVR KEEP
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 16'SETTING NBR AUTO HANDLING INC-
     A                                      REASE & DECREASE MEASURE MENU'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2 69'FMT'
     A                                  2 73'ABDPW02'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A*
     A                                  3 32'A-PICS 1'
     A                                  5 21'2'
     A                                      DSPATR(UL)
     A                                  5 26'A-PICS FIXED INCREASE AND DECRE+
     A                                       ASE LIST'
     A                                  9 30'PUBLISH LIST'
     A*
     A*
     A*
     A                                 24  4'EXIT'
     A                                   + 2'CMD-1'
     A                                      DSPATR(RI)
     A                                   + 3'PREVIOUS SCREEN'
     A                                   + 2'CMD-2'
     A                                      DSPATR(RI)
     A                                   + 3'LIST OK'
     A                                   + 2'CMD-5'
     A                                      DSPATR(RI)
