     A** ABDPW05 *********************************
     A* WHICH REFLECTS IT IN A-PICS KANBAN
     A* FILE ID. : ABDPW05. <DSPF> *
     A* CREATE DATE. : NOV.30,'90.               *
     A* AUTHOR.         : KOHHY.                 *
     A********************************* ABDPW05 **
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R ABDPW051
     A                                      CA01(01)
     A                                      CA02(02)
     A                                      CA05(05)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 16'SETTING NBR AUTO HANDLING INC-
     A                                      REASE & DECREASE MEASURE MENU'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2 69'FMT'
     A                                  2 73'ABDPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 21'4'
     A                                      DSPATR(UL)
     A                                  5 26'REFLECTS IT IN  A-PICS 1 KAN-
     A                                      BAN'
     A                                  9 20'(FILE) AU#PP51 -> AU#PP11'
     A                                 11 21'COPY IT.'
     A                                 24  4'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 18'PREVIOUS SCREEN'
     A                                 24 35'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 43'COPY OK'
     A                                 24 52'CMD-5'
     A                                      DSPATR(RI)
