      ** ABHPW60 *****************************************************
      *  ENTER THE BREAKDOWN OF THE ISSUANCE                         *
      *      SEEK                 2023.03.27                         *
      ****************************************************************
     A                                      PRINT
     A                                      CHGINPDFT
      ****************************************************************
      * 画面１                                                     *
      ****************************************************************
     A          R DSP1                      TEXT('画面１')
     A                                      CF03
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** ENTER THE BREAKDOWN OF THE ISSU-
     A                                      ANCE **'
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'ABHPW60'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  4 15'SELECT ONE OF THE FOLLOWING:'
     A                                      COLOR(BLU)
     A            D1NO           1Y 0B  6 17TEXT(' NO-1')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(RI PC)
     A                                    +3'1. MACHINE BEHIND'
     A                                  7 21'2. SAFETY STOCK'
     A                                  8 21'3. WIRE USE UP'
     A                                  9 21'4. OVERHAUL/BUILD AHEAD'
     A                                 10 21'5. DEFECT CHECK'
     A                                 11 21'6. LOCATION CHANGE'
     A                                 12 21'7. VOLUME CHANGE'
     A                                 13 21'8. OTHER'
     A*
     A  99                             23  2' ERROR '
     A                                      DSPATR(RI BL)
     A            DXERR         70O       +1TEXT(' ERROR MSG')
     A                                 24  4'PREVIOUS SCREEN'
     A                                    +1'CMD-3'
     A                                      DSPATR(RI)
      ****************************************************************
      * 画面２                                                     *
      ****************************************************************
     A          R DSP2                      TEXT('画面２')
     A                                      CF03
     A                                      CF05
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** ENTER THE REQUESTED SECTION **'
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'ABHPW60'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  4 15'SELECT ONE OF THE FOLLOWING:'
     A                                      COLOR(BLU)
     A            D2NO           2Y 0B  6 17TEXT(' NO-2')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(RI PC)
     A                                    +3'1. M6'
     A                                  7 22'2. M8'
     A                                  8 22'3. M10'
     A                                  9 22'4. NF/TP/INJ'
     A                                 10 22'5. BZ'
     A                                 11 22'6. DS'
     A                                 12 22'7. JC'
     A                                 13 22'8. HT'
     A                                 14 22'9. QD'
     A                                 15 21'10. PC'
     A                                  6 41'11. PM'
     A                                  7 41'12. TPS'
     A                                  8 41'13. SALES'
     A                                  9 41'14. TOOL ROOM'
     A                                 10 41'15. OTHER'
     A*
     A                                 12 42'IF "15" IS ENTERED, PLEASE ENTER.'
     A                                      COLOR(BLU)
     A                                 13 43'|'
     A                                 14 43'､--'
     A            D2SEC         16   B    +1TEXT(' SECTION')
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A*
     A  99                             23  2' ERROR '
     A                                      DSPATR(RI BL)
     A            DXERR         70O       +1TEXT(' ERROR MSG')
     A                                 24  4'PREVIOUS SCREEN'
     A                                    +1'CMD-3'
     A                                      DSPATR(RI)
     A                                    +2'SELECT OK'
     A                                    +1'CMD-5'
     A                                      DSPATR(RI)
      ****************************************************************
      * 画面３                                                     *
      ****************************************************************
     A          R DSP3                      TEXT('画面３')
     A                                      CF03
     A                                      CF05
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** ENTER THE BREAKDOWN OF THE ISSU-
     A                                      ANCE **'
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'ABHPW60'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A            D1NO           1Y 0   4 22TEXT(' NO-1')
     A                                      DSPATR(CS)
     A                                    +1'OTHER'
     A*
     A                                  6 15'IF IT IS THE SAME AS THE LAST INPU-
     A                                      T, SET "1"'
     A                                      COLOR(BLU)
     A                                  7 15'ENTER "0" IF YOU ARE ENTERING A NE-
     A                                      W ENTRY.'
     A                                      COLOR(BLU)
     A                                    +1'､､､'
     A            D3NO           1   B    +1TEXT(' NO-3')
     A                                      DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A*
     A                                  9 20' PLEASE ENTER THE REASON FOR THE I-
     A                                      SSUANCE '
     A                                      DSPATR(RI)
     A            D3RES         15   B 11 23TEXT(' REASON')
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A*
     A  99                             23  2' ERROR '
     A                                      DSPATR(RI BL)
     A            DXERR         70O       +1TEXT(' ERROR MSG')
     A                                 24  4'PREVIOUS SCREEN'
     A                                    +1'CMD-3'
     A                                      DSPATR(RI)
     A                                    +2'SELECT OK'
     A                                    +1'CMD-5'
     A                                      DSPATR(RI)
