     A*%%TS  SD  20181214  105929  I0777       REL-V7R3M0  5770-WDS
     A** ABMPWH0 ***********************************
     A*仕入先　オーダー警告リスト
     A*     HOTTA.              2018.06.18         *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R ABMPWH01
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK   KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 22' ** SUPPLIER ORDER WARNING +
     A                                       LIST ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ABMPWH0'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                 20  2'PRINTER :'
     A            D1OUTQ         1A  B 20 12DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A                                 20 15'1. QPRINT(COMPUTER ROOM)'
     A                                 20 40'3. LANPRT03(OFFICE)'
     A                                 21 15'2. PRINTER C(APICS)'
     A                                 21 40'4. PRINTER B(APICS)'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'EXIT'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'EXEC'
