     A** ABMPWB5 ******************************************************
     A*  AUTOMATIC SETTING VOLUME
     A*       HOTTA.          2018.08.28                              *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A*-----------------------------------------------------
     A          R SFL010                    SFL
     A            S1SEL          1A  B  6 23
     A  31                                  DSPATR(ND PR)
     A  32                                  DSPATR(PC)
     A                                      VALUES(' ' 'C' 'D')
     A            S1PTAN         2A  O  6 29
     A            S1HTSU         4Y 0O  6 34EDTCDE(4)
     A            S1FUGO         2A  O  6 44
     A            S1ADJU         3Y 0O  6 48EDTWRD(' 0 ')
     A            H1FUGO         1A  H
     A*
     A          R CTL010
     A                                      CF01
     A                                      CF08
     A                                      SFLCTL(SFL010)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN01         4  0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' AUTOMATIC SETTING VOLUME R-
     A                                      ATE MASTER UPDATE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A*
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3  2'KANBAN KIND'
     A            C1KCD1         1A      + 1
     A                                   + 1'-'
     A            C1KCD2         1A      + 1
     A                                  4 23'Add New?'
     A                                  4 32'Press F8'
     A                                      DSPATR(HI)
     A                                  5 22'SEL'
     A                                      DSPATR(HI)
     A                                  5 27'SEQ#'
     A                                      DSPATR(HI)
     A                                  5 33'#OF BOX'
     A                                      DSPATR(HI)
     A                                  5 43'COND'
     A                                      DSPATR(HI)
     A                                  5 50'ADJUST(%)'
     A                                      DSPATR(HI)
     A* ----------------------------------------------------
     A          R FMT090
     A                                 14  2'1) THIS MENU APPLIES TO +
     A                                       PLATING PLASTIC KANBANS.'
     A                                 15  2'2) THE MINIMUM COUNT FOR +
     A                                       PLASTIC KANBANS IS SET TO 8.'
     A                                 16  2'3) IF THE NUMBER OF KANBAN +
     A                                       COUNT TO BE REDUCED IS 12 OR +
     A                                       LESS,'
     A                                 17  5 'KANBAN COUNT IS KEPT THE SAME.'
     A                                 18  5 '(E.G KANBAN COUNT REDUCED FROM +
     A                                       30 TO 18(REDUCTION OF 12 KANBAN),'
     A                                 19  5 'THEN KANBAN COUNT WILL +
     A                                       BE KEPT TO THE ORIGINAL +
     A                                       COUNT OF 30)'
     A                                 20  2'4) AUTOMATIC ADJUSTMENT OF +
     A                                       KANBAN COUNT IS DONE BY THE MENU'
     A                                 21  5'"10.AUTOMATIC SETTING# +
     A                                       ADJUST"'
     A                                 22 22'Select code:'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                 22 35'C(change)'
     A                                      DSPATR(HI)
     A                                 22 45'D(delete)'
     A                                      DSPATR(HI)
     A  69                             23  2'ERROR'
     A                                      DSPATR(RI BL)
     A  69        MSG           60A  O 23  8
     A                                      DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 14'F8:Add New'
     A                                      DSPATR(RI)
     A                                 24 41'Enter:Select'
     A                                      DSPATR(RI)
     A* ----------------------------------------------------
     A          R FMT020
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' AUTOMATIC SETTING VOLUME R-
     A                                      ATE MASTER UPDATE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            F2ACTN        10A  O  4 35
     A*
     A                                  8 25'SEQ#     :'
     A            F2PTAN         2A  B  8 36
     A N51                                  DSPATR(HI)
     A  51                                  DSPATR(RI PC)
     A  61                                  DSPATR(PR)
     A                                 10 25'#OF BOX  :'
     A            F2HTSU         4Y 0B 10 36EDTCDE(4)
     A N52                                  DSPATR(HI)
     A  52                                  DSPATR(RI PC)
     A  62                                  DSPATR(PR)
     A                                 12 25'CONDITION:'
     A            F2FUGO         1A  B 12 36
     A N53                                  DSPATR(HI)
     A  53                                  DSPATR(RI PC)
     A  63                                  DSPATR(PR)
     A                                 12 39'<------'
     A                                 12 47'1 : < '
     A                                 13 47'2 : > '
     A                                 14 47'3 : = '
     A                                 15 47'4 : <='
     A                                 16 47'5 : >='
     A                                 17 47'6 : <>'
     A                                 14 25'ADJUST(%):'
     A            F2ADJU         3Y 0B 14 36EDTWRD(' 0 ')
     A N54                                  DSPATR(HI)
     A  54                                  DSPATR(RI PC)
     A  64                                  DSPATR(PR)
     A*
     A  69                             23  2'ERROR'
     A                                      DSPATR(RI BL)
     A  69        MSG           60A  O 23  8
     A                                      DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 14'F5:Update'
     A                                      DSPATR(RI)
     A                                 24 29'F12:Previous'
     A                                      DSPATR(RI)
