     A** ABMPW19 ***********************************
     A* AUTO CHANGE MONTHLY SETTING#  !!TEMP!!     *
     A*     HOTTA.              2018.06.18         *
     A**********************************************
     A                                      CHGINPDFT
     A          R ABMPW101
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                      BLINK   KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 22' ** AUTO CHANGE MONTHLY +
     A                                       SETTING# ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ABMPW10'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A                                  4 22' !! TEMP !! NO UPDATE SETTING #'
     A                                      DSPATR(RI) COLOR(RED)
      *
     A                                  7 53'WORK DAYS'
     A            D1BTYM         6Y 0   8 39EDTWRD('    /  ')
     A            D1BKAD         3Y 1B  8 55EDTWRD('0 . ')
     A  39                                  DSPATR(PR)
     A N39                                  DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A            D1ATYM         6Y 0   9 39EDTWRD('    /  ')
     A            D1AKAD         3Y 1B  9 55EDTWRD('0 . ')
     A  39                                  DSPATR(PR)
     A N39                                  DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A                                 10 24'FORECAST DATE'
     A            D1NTYM         6Y 0  10 39EDTWRD('    /  ')
     A            D1NKAD         3Y 1B 10 55EDTWRD('0 . ') DSPATR(CS)
     A  39                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
     A            D11TYM         6Y 0  11 39EDTWRD('    /  ') DSPATR(HI)
     A            D11KAD         3Y 1B 11 55EDTWRD('0 . ')    DSPATR(HI)
     A  39                                  DSPATR(PR)
     A N39                                  DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A            D12TYM         6Y 0  12 39EDTWRD('    /  ') DSPATR(HI)
     A            D12KAD         3Y 1B 12 55EDTWRD('0 . ')    DSPATR(HI)
     A  39                                  DSPATR(PR)
     A N39                                  DSPATR(CS)
     A  35                                  DSPATR(RI PC)
     A            D13TYM         6Y 0  13 39EDTWRD('    /  ') DSPATR(HI)
     A            D13KAD         3Y 1B 13 55EDTWRD('0 . ')    DSPATR(HI)
     A  39                                  DSPATR(PR)
     A N39                                  DSPATR(CS)
     A  36                                  DSPATR(RI PC)
      *
     A                                 20  2'PRINTER :'
     A            D1OUTQ         1A  B 20 12DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A                                 20 15'1. QPRINT(COMPUTER ROOM)'
     A                                 20 40'3. LANPRT03(OFFICE)'
     A                                 21 15'2. PRINTER C(APICS)'
     A                                 21 40'4. PRINTER B(APICS)'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'EXIT'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'EXEC'
     A                                   +30' F12 '
     A                                      DSPATR(RI)
     A                                   + 1'CHANGE WORK DAYS'
