     A** ABMPWK4 ***********************************
     A*金型必要数
     A*     HOTTA.              2018.12.26         *
     A**********************************************
     A                                      CHGINPDFT
     A          R ABMPWK41
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK   KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 34' ** # OF NEED DIE ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ABMPWK4'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                 10 15'SELECT SORT'
     A            D1SORT         1A  B 10 30DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                 10 33'1 : DIFF + ---> -'
     A                                 11 33'2 : DIFF - ---> +'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'EXIT'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'EXEC'
