     A** ABMPW01 ***********************************
     A* UPDATE FORECAST USER M/F                   *
     A*     HOTTA.              2018.06.04         *
     A**********************************************
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R ABMPW011
     A                                      CF01(01)
     A                                      CF12(12)
     A                                      BLINK
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' ** UPDATE FORECAST USER M/F ** '
     A                                      DSPATR(RI)
     A                                  1 68'FMT ABMPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                  4 12'UPDATE'
     A                                      DSPATR(RI)
     A                                  4 25'CUSTOMER'
     A                                      DSPATR(RI)
     A                                  4 35'DELIVERY'
     A                                      DSPATR(RI)
     A                                  4 45'FACTORY'
     A                                      DSPATR(RI)
     A                                  4 55'DOCK'
     A                                      DSPATR(RI)
      *
     A            D1KOSN         1A  B  5 14DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A            D1TOKU         4Y 0B  5 27DSPATR(CS) EDTCDE(Z)
     A  32                                  DSPATR(RI PC)
     A            D1NONY         4Y 0B  5 37DSPATR(CS) EDTCDE(Z)
     A  33                                  DSPATR(RI PC)
     A            D1NKOJ         1A  B  5 48DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A            D1NUKE         4A  B  5 55DSPATR(CS)
     A  35                                  DSPATR(RI PC)
     A                                  6 14'0 : DELETE'
     A                                  7 14'2 : ADD NEW'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'EXIT'
     A                                 24 67' F12 '
     A                                      DSPATR(RI)
     A                                   + 1'INQ'
      *
     A          R ABMPW012
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' ** UPDATE FORECAST USER M/F ** '
     A                                      DSPATR(RI)
     A                                  1 68'FMT ABMPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                  4 12'UPDATE'
     A                                      DSPATR(RI)
     A                                  4 25'CUSTOMER'
     A                                      DSPATR(RI)
     A                                  4 35'DELIVERY'
     A                                      DSPATR(RI)
     A                                  4 45'FACTORY'
     A                                      DSPATR(RI)
     A                                  4 55'DOCK'
     A                                      DSPATR(RI)
      *
     A            D1KOSN         1A     5 14
     A            D1TOKU         4Y 0   5 27
     A            D1NONY         4Y 0   5 37
     A            D1NKOJ         1A     5 48
     A            D1NUKE         4A     5 55
     A                                  6 14'0 : DELETE'
     A                                  7 14'2 : ADD NEW'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D2ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'UPDATE'
