     A** ABMPWFE ***********************************
     A*副資材　箱色別必要箱数　画面照会          *
     A*     HOTTA.        2018.12.17               *
     A**********************************************
     A                                      PRINT
     A                                      CHGINPDFT
      *------------------------*
      *                        *
      *------------------------*
     A          R SFL                       SFL
     A            S1BCCD         1A  H
     A            S1BCNM        16A     5 12
     A            S1KMA2         7Y 0   5 31EDTWRD(' ,   , 0 ')
     A            S1KMA1         7Y 0   5 43EDTWRD(' ,   , 0 ')
     A            S1KMAX         7Y 0   5 55EDTWRD(' ,   , 0 ')
     A            S1KMA0         7Y 0   5 68EDTWRD(' ,   , 0 ')
      *非表示項目
     A            @RRN           4Y 0H
      *
      *---------------------------------------*
      *  サブファイル制御　                 *
      *---------------------------------------*
     A          R SFLCTL
     A                                      SFLCTL(SFL)
     A  72                                  SFLDSPCTL
     A  72                                  ERASE(SFL)
     A  73                                  SFLDSP
     A  71                                  SFLCLR
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(16)
     A                                      SFLSIZ(16)
     A                                      CF03(03)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A N99                                  CSRLOC(S@SLIN S@SCLM)
      *
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
     A            S@SLIN         3  0H
     A            S@SCLM         3  0H
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' ** # OF NEED BOXES EACH COLOR ** '
     A                                      DSPATR(RI)
     A                                  1 68'FMT ABMPWFE'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                  3 21'# OF NEED'
     A                                  4 10'BOX COLOR'
     A            C1YM2          6Y 0   4 33EDTWRD('    .  ')
     A            C1YM1          6Y 0   4 45EDTWRD('    .  ')
     A            C1YM           6Y 0   4 57EDTWRD('    .  ')
     A            C1YMD          8Y 0   4 67EDTWRD('    .  .  ')
     A          R ABMPWFE9
     A                                      OVERLAY PROTECT
     A N81                             22 72'MORE...'
     A  81                             22 72'LAST...'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D9ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                   + 2'PAGE UP'
     A                                   + 1'PRV'
     A                                      DSPATR(RI)
     A                                   + 2'PAGE DOWN '
     A                                   + 1'NEXT'
     A                                      DSPATR(RI)
