     A** ABTPW24 ***********************************
     A* SHORTAGE FOLLOW STATUS
     A*    SAKAKI.          2019.11.22             *
     A*                                            *
     A*   !!! COMPILE OPTION !!!                   *
     A*     WAITRCD      > 15                      *
     A**********************************************
     A                                      PRINT
     A                                      CHGINPDFT
      *------------------------*
     A          R SFL                       SFL
     A                                      KEEP
     A            S1SEQN         2Y 0   4  2EDTWRD(' 0')
     A            S1NONM         8A     4  5
     A            S1NDTM        14A     4 15
     A**          S1NODT         4Y 0   4 13EDTWRD('  /  ')
     A**          S1HFN          1A     4 17
     A**          S1NOTM         5A     4 19
     A            S1SHN         14A     4 31
     A  49                                  DSPATR(HI)
     A            S1CNT          3A     4 46
     A  30                                  COLOR(RED)
     A            S1PR1          3A     4 51
     A  31                                  COLOR(GRN)
     A  32                                  COLOR(YLW)
     A  33                                  COLOR(RED)
     A  31
     AO 32
     AO 33                                  DSPATR(RI)
     A            S1PR2          3A     4 55
     A  34                                  COLOR(GRN)
     A  35                                  COLOR(YLW)
     A  36                                  COLOR(RED)
     A  34
     AO 35
     AO 36                                  DSPATR(RI)
     A            S1PR3          3A     4 59
     A  37                                  COLOR(GRN)
     A  38                                  COLOR(YLW)
     A  39                                  COLOR(RED)
     A  37
     AO 38
     AO 39                                  DSPATR(RI)
     A            S1PR4          3A     4 63
     A  40                                  COLOR(GRN)
     A  41                                  COLOR(YLW)
     A  42                                  COLOR(RED)
     A  40
     AO 41
     AO 42                                  DSPATR(RI)
     A*
     A            S1AS1          5A     4 67
     A*
     A            S1TTL          4A     4 73
     A  43                                  DSPATR(RI)
     A  43                                  COLOR(RED)
     A*
     A            S1PRI          3A     4 78
      *非表示項目
     A            @RRN           4Y 0H
      *---------------------------------------*
      * CONTROL                               *
      *---------------------------------------*
     A          R SFLCTL
     A                                      SFLCTL(SFL)
     A  72                                  SFLDSPCTL
     A  72                                  ERASE(SFL)
     A  73                                  SFLDSP
     A  71                                  SFLCLR
     A N71                                  INVITE
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(20)
     A                                      SFLSIZ(20)
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A N99                                  CSRLOC(S@SLIN S@SCLM)
      *
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
     A            S@SLIN         3Y 0H
     A            S@SCLM         3Y 0H
      *
     A                                  1 22' ** OPEN PALLET PART LIST ** '
     A                                      DSPATR(HI)
      *
     A                                  1 52'as of'
      *
     A            C1DATE         8Y 0   1 58EDTWRD('0   /  /  ')
     A            C1TIME         6Y 0   1 70EDTWRD('0  :  :  ')
      *
     A                                  2 52'Bef' COLOR(RED)
     A                                      DSPATR(RI)
     A                                  2 56'In ' COLOR(YLW)
     A                                      DSPATR(RI)
     A                                  2 60'Aft' COLOR(GRN)
     A                                      DSPATR(RI)
      *
     A                                  2 15'SHIPPING'
     A                                  2 42'SHORTAGE'
     A                                  2 67'FINAL'
     A                                  2 78'In'
     A                                  3  2'#  CUSTOMER  DATE-BIN TIME   +
     A                                       PART#          BOX  +
     A                                       LAST 4 PROCESS  LOC.   +
     A                                         TTL Pri'
     A                                      DSPATR(UL)
     A          R ABTPW249
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A                                      KEEP
     A  99                                  ALARM
     A                                      INVITE
      *
     A                                  1 22' ** OPEN PALLET PART LIST ** '
     A                                      DSPATR(HI)
     A            C1DATE         8Y 0   1 58EDTWRD('0   /  /  ')
     A            C1TIME         6Y 0   1 70EDTWRD('0 :  :  ')
     A                                  5 28'NO SHORTAGE DATA' COLOR(RED)
     A          R ABTPW24A                  GRDRCD
     A                                      GRDCLR
     A          R ABTPW24B                  GRDRCD
     A                                      GRDATR((*COLOR WHT))
      *
     A  45                                  GRDLIN((*POS (05 02 79)) +
     A                                             (*TYPE UPPER))
     A  46                                  GRDLIN((*POS (06 02 79)) +
     A                                             (*TYPE UPPER))
     A  47                                  GRDLIN((*POS (07 02 79)) +
     A                                             (*TYPE UPPER))
     A  48                                  GRDLIN((*POS (08 02 79)) +
     A                                             (*TYPE UPPER))
     A  49                                  GRDLIN((*POS (09 02 79)) +
     A                                             (*TYPE UPPER))
     A  50                                  GRDLIN((*POS (10 02 79)) +
     A                                             (*TYPE UPPER))
     A  61                                  GRDLIN((*POS (11 02 79)) +
     A                                             (*TYPE UPPER))
     A  62                                  GRDLIN((*POS (12 02 79)) +
     A                                             (*TYPE UPPER))
     A  63                                  GRDLIN((*POS (13 02 79)) +
     A                                             (*TYPE UPPER))
     A  64                                  GRDLIN((*POS (14 02 79)) +
     A                                             (*TYPE UPPER))
     A  65                                  GRDLIN((*POS (15 02 79)) +
     A                                             (*TYPE UPPER))
     A  95                                  GRDLIN((*POS (16 02 79)) +
     A                                             (*TYPE UPPER))
     A  67                                  GRDLIN((*POS (17 02 79)) +
     A                                             (*TYPE UPPER))
     A  68                                  GRDLIN((*POS (18 02 79)) +
     A                                             (*TYPE UPPER))
     A  69                                  GRDLIN((*POS (19 02 79)) +
     A                                             (*TYPE UPPER))
     A  70                                  GRDLIN((*POS (20 02 79)) +
     A                                             (*TYPE UPPER))
     A  91                                  GRDLIN((*POS (21 02 79)) +
     A                                             (*TYPE UPPER))
     A  92                                  GRDLIN((*POS (22 02 79)) +
     A                                             (*TYPE UPPER))
     A  93                                  GRDLIN((*POS (23 02 79)) +
     A                                             (*TYPE UPPER))
     A  94                                  GRDLIN((*POS (24 02 79)) +
     A                                             (*TYPE UPPER))
