     A*%%TS  SD  20210701  163524  I0777       REL-V7R3M0  5770-WDS
     A** ABVPWF5 ******************************************************
     A*  VW DESADV(ASN)DATA CREATE 2
     A*
     A* T.SAKAKI 2015.09.10
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A* ------------------------------------
     A          R DSP01
     A*%%TS  SD  20210628  115525  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                  1  3'ABVRF5'
     A                                  1 28' VW ASN INQUIRY '
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  6 24'ASN SENT DATE'
     A                                      DSPATR(HI)
     A                                  8 18'From:'
     A            D1KARA         8A  B  8 24DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  8 33'- To:'
     A            D1MADE         8A  B  8 39DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  9 24'YYYYMMDD'
     A                                  9 39'YYYYMMDD'
     A*
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D1ERR         60A  O 23 18
     A*
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                 24  7'EXIT'
     A* ------------------------------------
     A*
     A* ------------------------------------
     A          R SFREC1                    SFL
     A*%%TS  SD  20210701  163524  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('ﾅﾎﾞ､ﾎｦbﾓ')
     A*
     A            S1SEL          1A  B  6  7DSPATR(CS)
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            S1RCVD         8Y 0O  6 10EDTWRD('    /  /  ')
     A                                  6 21'-'
     A            S1RCVT         4Y 0O  6 23EDTWRD('0  :  ')
     A            S1DTID         6A  O  6 32
     A            S1DCBM         6A  O  6 42
     A*-------------------------------------
     A          R SFCTL1                    SFLCTL(SFREC1)
     A*%%TS  SD  20210701  163144  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      TEXT('ﾅﾎﾞ､ﾎｦbﾓ ﾃ]nﾜｰﾓ')
     A                                      CF01
     A                                      CF03
     A  99                                  ALARM
     A                                      BLINK
     A                                      OVERLAY
     A                                      PROTECT
     A  71                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  90                                  SFLEND
     A                                      ROLLUP(73)
     A                                      ROLLDOWN(74)
     A            DSPRRN         4S 0H      SFLRCDNBR
     A                                  1  2'ABVRF5'
     A                                  1 28' VW ASN INQUIRY '
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A*
     A                                  5  7'X'
     A                                  5 10'SENT DATE             TRANS ID    -
     A                                      SEQ#. '
     A                                      DSPATR(UL)
     A                                  4  7'P'
     A*-------------------------------------
     A          R DSP02
     A*%%TS  SD  20210701  163144  I0777       REL-V7R3M0  5770-WDS
     A                                 22  6'"X" -> SHOW RAW ASN,'
     A                                 22 29'"P" -> PRINT RAW ASN'
     A*
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D2ERR         60A  O 23 18
     A*
     A                                 24  4' F1 '
     A                                      DSPATR(RI)
     A                                 24  9'EXIT'
     A                                 24 17' F3 '
     A                                      DSPATR(RI)
     A                                 24 22'BACK'
