     A*%%TS  SD  20210319  130930  I0777       REL-V7R3M0  5770-WDS
     A** ABVPW76 ******************************************************
     A*  VW SHIPPING VERIFICATION INQUIRY
     A*
     A* KIRI  2015.11.16
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A* ------------------------------------
     A          R DSP01
     A*%%TS  SD  20201113  112501  I0777       REL-V7R3M0  5770-WDS
     A                                      CF03
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' VW SHIPPING  VERIFICATION INQUIRY-
     A                                       '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'ABVPW76'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  4 20'DELIVERY.:'
     A                                      DSPATR(HI)
     A            D1NONY         4Y 0B  4 31DSPATR(CS)
     A                                      EDTCDE(4)
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A*
     A                                  6 20'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D1FROM         8Y 0B  6 31EDTCDE(4)
     A                                      DSPATR(CS)
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                  6 40'-'
     A            D1TO           8Y 0B  6 42EDTCDE(4)
     A                                      DSPATR(CS)
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A                                  6 51'YYYYMMDD'
     A                                  8 20'BIN .....:'
     A                                      DSPATR(HI)
     A            D1NOBN         2Y 0B  8 31EDTCDE(4)
     A                                      DSPATR(CS)
     A                                  8 47'(BLANK=ALL)'
     A*
     A                                  9 20'FACTORY .:'
     A                                      DSPATR(HI)
     A            D1NKOJ         1A  B  9 31DSPATR(CS)
     A                                  9 47'(BLANK=ALL)'
     A                                 10 20'DOCK ....:'
     A                                      DSPATR(HI)
     A            D1NUKE         4A  B 10 31DSPATR(CS)
     A                                 10 47'(BLANK=ALL)'
     A*
     A                                 11 20'PART# ...:'
     A                                      DSPATR(HI)
     A            D1SHN1         5A  B 11 31DSPATR(CS)
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A            D1SHN2         5A  B 11 37DSPATR(CS)
     A  14                                  DSPATR(RI)
     A            D1SHN3         2A  B 11 43DSPATR(CS)
     A  14                                  DSPATR(RI)
     A                                 11 47'(BLANK=ALL)'
     A*
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D1ERR         60A  O 23 18
     A*
     A                                 24  4' F3: END'
      * ------------------------------------
      * ------------------------------------
     A          R SFREC1                    SFL
     A            S1SLCT         1A  B  6  2DSPATR(CS)
     A            S1MST1        22A      + 1TEXT('SERIAL#')
     A            S1SHN         14A      + 1
     A            S1SQTY         7  0O   + 1EDTCDE(1)
     A  70                                  COLOR(RED)
     A            S1SDAT         6  0O   + 1EDTWRD('  /  /  ')
     A            S1OQTY         7  0O   + 1EDTCDE(1)
     A            S1ODAT         6  0O   + 1EDTWRD('  /  /  ')
     A            S$SYOS         6  0H
     A            S$ODAT         8  0H
      * ----------
     A          R SFCTL1                    SFLCTL(SFREC1)
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      OVERLAY
     A                                      CF03 CF12
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  80                                  SFLEND(*MORE)
     A                                      ROLLUP(53)
     A            #RCNO1         4  0H      SFLRCDNBR
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 25' VW SHIPPING -
     A                                       VERIFICATION INQUIRY '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'ABVPW76'
     A*
     A                                  3  3'DELIVERY:'
     A                                      DSPATR(HI)
     A            D1NONY         4Y 0O  3 13EDTCDE(4)
     A                                  3 22'SHIP DATE:'
     A                                      DSPATR(HI)
     A            D1FROM         8Y 0O  3 33EDTWRD('    /  /  ')
     A                                  3 44'-'
     A            D1TO           8Y 0O  3 46EDTWRD('    /  /  ')
     A*
     A                                  4 42'---- SCANNED -----'
     A                                      DSPATR(HI)
     A                                  4 61'----- ORDER ------'
     A                                      DSPATR(HI)
     A*
     A                                  5  2'X'
     A                                      DSPATR(HI)
     A                                  5  4'MASTER LABEL'
     A                                      DSPATR(HI)
     A                                  5 27'PART#'
     A                                      DSPATR(HI)
     A                                  5 46'QTY'
     A                                      DSPATR(HI)
     A                                  5 54'DATE'
     A                                      DSPATR(HI)
     A                                  5 65'QTY'
     A                                      DSPATR(HI)
     A                                  5 73'DATE'
     A                                      DSPATR(HI)
      * ----------
     A          R DSP02
     A*
     A  99                             23 11'ERROR' DSPATR(RI BL)
     A  99        D2ERR         60A  O 23 18
     A*
     A                                 24  4' F3: END'
     A                                   + 4' F12: GO BACK'
     A* ------------------------------------
     A* ------------------------------------
     A          R SFREC2                    SFL
     A*%%TS  SD  20210319  130930  I0777       REL-V7R3M0  5770-WDS
     A            S2CON1        22A  O  7  4TEXT('SERIAL#')
     A            S2SHN         14A  O  7 28
     A            S2QTY          6Y 0O  7 44TEXT('PACKAGE CAPACITY')
     A                                      EDTCDE(1)
     A            S2TYP          3   O  7 53
     A          R SFCTL2                    SFLCTL(SFREC2)
     A*%%TS  SD  20210319  130930  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      OVERLAY
     A                                      CF03
     A                                      CF12
     A  54                                  SFLDSP
     A  54                                  SFLDSPCTL
     A  55                                  SFLCLR
     A  85                                  SFLEND(*MORE)
     A            #RCN02         4S 0H      SFLRCDNBR
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 25' VW SHIPPING  VERIFICATION INQUIRY-
     A                                       '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'ABVPW76'
     A*
     A                                  3  4'MASTER LABEL'
     A                                      DSPATR(UL)
     A            S1MST1        22A  O  3 18TEXT('SERIAL#')
     A                                  3 45'PART#'
     A                                      DSPATR(UL)
     A            S1SHN         14A  O  3 52
     A*
     A                                  4  7'SHIP DATE'
     A                                      DSPATR(UL)
     A            S$ODAT         8Y 0O  4 18EDTWRD('    /  /  ')
     A                                  4 33'SCANNED/ORDER QTY'
     A                                      DSPATR(UL)
     A            S1SQTY         7Y 0O  4 52EDTCDE(1)
     A                                  4 62'/'
     A            S1OQTY         7Y 0O  4 64EDTCDE(1)
     A*
     A*
     A                                  6  4'CONTAINER LABEL#        PART#     -
     A                                              QTY    TYP'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
      * ----------
     A          R DSP03
     A*
     A  99                             23 11'ERROR' DSPATR(RI BL)
     A  99        D3ERR         60A  O 23 18
     A*
     A                                 24  4' F3: END'
     A                                   + 4' F12: GO BACK'
