     A*%%TS  SD  20170331  170644  I0777       REL-V7R1M0  5770-WDS
     A** AC#PW0Q ******************************************************
     A*  CREATE CANCEL EDI(856) DATA BY ASN# (HONDA)                  *
     A****************************************************** AB#PW38 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20170331  170644  I0777       REL-V7R1M0  5770-WDS
     A                                      INVITE
     A                                  1  3'AC#R0Q'
     A                                  1 22'** create Cancel EDI(856) Data **'
     A                                  1 66'DATE'
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                  2  3USER
     A                                  2 34'(HONDA)'
     A                                      COLOR(WHT)
     A                                  2 66'TIME'
     A                                  2 71TIME
     A                                  8 21'Enter ASN#. . . .:'
     A            XASN           6Y 0B  8 40EDTCDE(Z)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                 10 27'Data from .:'
     A            XDATA          1Y 0B 10 40EDTCDE(3)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                 10 42'(1=Saved, 2=Archive)'
     A                                      COLOR(YLW)
     A  85                             18  9'MSG:'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            XMSG          60A  O 18 14
     A                                 24  9'F1/F3:'
     A                                      DSPATR(RI)
     A                                 24 16'Exit,'
     A                                 24 23'ENTER:'
     A                                      DSPATR(RI)
     A                                 24 30'Check ASN,'
     A                                 24 42'F5:'
     A                                      DSPATR(RI)
     A                                 24 46'Create Cancel EDI'
