     A*%%TS  SD  20170508  110043  I0777       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01(01)
     A          R DSP01
     A*%%TS  SD  20170508  110043  I0777       REL-V7R1M0  5770-WDS
     A            #PGM           8A  O  1  2
     A                                  1 19'** CONSOLIDATED PACKING LIST MENU -
     A                                      **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 30'** HONDA **'
     A                                      DSPATR(RI)
     A                                  6  6'1. GENERATE CONSOLIDATED PACKING L-
     A                                      IST'
     A                                      DSPATR(HI)
     A                                  8  6'2. PRINT CONSOLIDATED PACKING LIST-
     A                                      /PAPER DOCUMENTS'
     A                                      DSPATR(HI)
     A                                 10  6'3. PRINT MASTER PACKING LIST & B/L'
     A                                      COLOR(WHT)
     A                                 12  6'4. CREATE AND SEND CONSOLIDATED AS-
     A                                      N'
     A                                      COLOR(WHT)
     A                                 22 13'SELECTION -->'
     A                                      DSPATR(HI)
     A            D@SLCT         2Y 0B 22 27DSPATR(CS)
     A                                      EDTCDE(4)
     A                                 23  3'F1:END'
