     A*%%TS  SD  20240613  092053  I0777       REL-V7R4M0  5770-WDS
     A* ACHPW01 **********************************
     A*調整分理由の更新                        *
     A*   ITS.              2012.04.25           *
     A* 2021.01.20 DCS. T.MITSUI
     A*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     A********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INVITE
     A          R ACHPW011
     A*%%TS  SD  20240613  092053  I0777       REL-V7R4M0  5770-WDS
     A  99                                  ALARM
     A                                      CF03(03)
     A                                      CF05(05)
     A  43                              1 31' INQ ADJUSTMENT DETAIL '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 31' INPUT ADJUSTMENT DETAIL '
     A N43                                  DSPATR(RI)
     A N43                                  DSPATR(UL)
     A                                  1 69'FMT ACHPW01'
     A*---------------------------------------------------------------*
     A                                  1  2'UPDATE'
     A            D1KOHZ         8S 0O  1  9
     A                                  2  2'WORKER'
     A            D1KOME        10A  O  2  9
     A*
     A                                  4  2'PART NO.'
     A            D1SHN1         5A  O  4 11
     A                                  4 17'-'
     A            D1SHN2         5A  O  4 19
     A                                  4 25'-'
     A            D1SHN3         2A  O  4 27
     A*
     A                                  6 57'TOTAL'
     A            D1MAIS         5Y 0O  6 63EDTCDE(P)
     A*
     A                                  7  2'1.OVERALL CHANGEOVER'
     A            D1DAND         3Y 0B  7 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A*
     A                                  8  2'2.LARGE NUMBER OF COMMON PARTS'
     A            D1KYOT         3Y 0B  8 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A*
     A                                  9  2'3.NON-CONFORMANCE'
     A            D1FRYO         3Y 0B  9 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A*
     A                                 10  2'4.DEDICATED MACHINE'
     A            D1SENY         3Y 0B 10 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A*
     A                                 11  2'5.FORECAST INCREACE(N+1)'
     A            D11NAI         3Y 0B 11 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A            D11NAD         8Y 0O 11 45EDTWRD('    /  /  ')
     A*
     A                                 12  2'6.FORECAST INCREACE(N+2)'
     A            D12NAI         3Y 0B 12 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A            D12NAD         8Y 0O 12 45EDTWRD('    /  /  ')
     A*
     A                                 13  2'7.ACTUAL SHIPMENT REFLECTED'
     A            D1JISK         3Y 0B 13 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A            D1JISD         8Y 0O 13 45EDTWRD('    /  /  ')
     A*
     A                                 14  2'8.AUTOMATIC SETTING ADJUSTMENT'
     A            D1AUAJ         3Y 0B 14 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A*
     A                                 15  2'9.THE OTHER'
     A            D1OTHH         3Y 0B 15 40EDTCDE(P)
     A N43                                  DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A  43                                  DSPATR(PR)
     A                                 15 55'TOTAL'
     A            D1CMAI         5Y 0O 15 62EDTCDE(P)
     A*
     A            D1CMT1        80O  B 17  1
     A N43                                  DSPATR(CS)
     A  43                                  DSPATR(PR)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            D1CMT2        80O  B 19  1
     A N43                                  DSPATR(CS)
     A  43                                  DSPATR(PR)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A*---------------------------------------------------------------*
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         65A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
     A*
     A                                 24  5'BACK'
     A                                 24 11' CMD-3 '
     A                                      DSPATR(RI)
     A N43                             24 26'UPDATE OK'
     A N43                             24 37' CMD-5 '
     A N43                                  DSPATR(RI)
