     A*** ADHPW10 ************************************
     A* *  QUENCHING KANBAN COMMUNICATION / DISKETTE PUBLICATION *
     A* *      I-HASADA            1995.05.15        *
     A************************************* ADHPW10 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R ADHPW101
     A*%%TS  SD  19961111  091922  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('QUENCHING KANBAN COMMUNICATIO-
     A                                      N .DISKETT PUBLICATIO')
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 16'*QUENCHING KANBAN COMMUNICATION/DI-
     A                                      SKETTE PUBLICATION*'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 70'FMT ADHPW12'
     A                                  4 20' 1 '
     A                                      DSPATR(RI)
     A                                  4 25'DAILY HANDLING'
     A                                  6 20' 2 '
     A                                      DSPATR(RI)
     A                                  6 25'ALL. ORDER BY PART NO.'
     A                                  8 20' 3 '
     A                                      DSPATR(RI)
     A                                  8 25'ALL. ORDER BY QUENCHING SHIP ORDER-
     A                                       NO.'
     A            FNO            1A  B  8 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 12 20'0111- IAF'
     A            FNKOJ          4A  B 12 63DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 15 20' 1 '
     A                                      DSPATR(RI)
     A                                 15 25'PUBILISHES IT BY COMMUNICATION'
     A                                 17 20' 2 '
     A                                      DSPATR(RI)
     A                                 17 25'PUBLISHES IT WITH DISKETTE'
     A            FKB            1A  B 15 63DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'CANCEL'
     A                                 24 16'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 25'MAKING'
     A                                 24 32'CMD-5'
     A                                      DSPATR(RI)
