     A** ADHPW80 ******************************************************
     A* QUENCHING CONDITION M/F UPDATE
     A*  KIRI                                            2017.08.09
     A*****************************************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *----------------------------------------------------------------
      * * SCREEN 1*
      *----------------------------------------------------------------
     A          R ADHPW801
     A  99                                  ALARM
     A                                      CF01 CF07 CF12
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  1 24' ** QUENCHING CONDITION -
     A                                      MASTER ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ADHPW801'
      *
     A                                  7 22'1: OQ'
     A                                  8 22'2: AOQ'
     A                                  9 22'3: LAN(HAN)'
     A                                 10 22'4: NUT'
     A                                 11 22'5: OQ WASHER'
      *
     A            D1TYPE         1   B 16 22DSPATR(CS)
     A  11                                  DSPATR(PC RI)
     A                                   + 2'--> INPUT'
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D1ERR         60   O 22 18
      *
     A                                 24  5' F1=EXIT '
     A                                      DSPATR(RI)
     A                                   +15' F7=PASSWORD M/F '
     A                                      DSPATR(RI)
     A                                   +15' F12=INQUIRY '
     A                                      DSPATR(RI)
      *----------------------------------------------------------------
      * * SCREEN 2*
      *----------------------------------------------------------------
     A          R ADHPW802
     A  99                                  ALARM
     A                                      CF03 CF10 CF12
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  1 24' ** QUENCHING CONDITION -
     A                                      MASTER ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ADHPW802'
      *
     A            D$TYPE        12      2 28DSPATR(HI)
     A*
     A*
     A*
     A                                  5 15'UPDATE'     DSPATR(RI)
     A                                  5 30'MATERIAL'   DSPATR(RI)
     A                                  5 45' MATERIAL ' DSPATR(RI)
     A                                  6 30'  CODE  '   DSPATR(RI)
     A                                  6 45'PROPERTIES' DSPATR(RI)
     A*
     A            D2KKBN         1   B  7 17DSPATR(CS)
     A  21                                  DSPATR(PC RI)
     A            D2ZACD         3   B  7 32TEXT('MATERIAL CODE')
     A                                      DSPATR(CS)
     A  22                                  DSPATR(PC RI)
     A            D2KIKI         3  1B  7 48TEXT('MATERIAL PROPERTIES  ')
     A                                      DSPATR(CS) EDTCDE(4)
     A  23                                  DSPATR(PC RI)
     A*
     A            D2ZANM        15A     8 32TEXT('MATERIAL NAME')
     A*
     A                                  9 17'-> 0-CANCEL'
     A                                 10 17'   1-CHANGE'
     A                                 11 17'   2-ADD   '
     A*
     A  20                             15 11'LAST TIME' DSPATR(UL)
     A  20                             16 15'UPDATE'
     A  20                             16 30'MATERIAL'
     A  20                             16 45' MATERIAL '
     A  20                             17 30'  CODE  '
     A  20                             17 45'PROPERTIES'
     A*
     A  20        D3KKBN         8     18 15
     A  20        D3ZACD         3     18 32TEXT('MATERIAL CODE')
     A  20        D3KIKI         3  1  18 48TEXT('MATERIAL PROPERTIES  ')
     A                                      EDTCDE(4)
     A*
     A  20        D3ZANM        15A    19 32TEXT('MATERIAL NAME')
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D2ERR         60A  O 22 18
      *
     A                                 24  5' F3=RETURN '
     A                                      DSPATR(RI)
     A                                 24 25' F10=MATERIAL CODE INQ. '
     A                                      DSPATR(RI)
     A                                 24 61' F12=INQUIRY '
     A                                      DSPATR(RI)
      *----------------------------------------------------------------
      * * SCREEN 3
      *----------------------------------------------------------------
     A          R SFREC1                    SFL
     A*
     A            S1HOJI         2  0B 11 17EDTCDE(4)
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  31                                  DSPATR(PC RI)
     A            S1ONDO         3  0B 11 31EDTCDE(4)
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  32                                  DSPATR(PC RI)
     A                                   + 1'DEG.C'
     A            S1CO2P         3  2B 11 47EDTCDE(4)
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  33                                  DSPATR(PC RI)
     A                                   + 1'%'
     A            S1KIK1         3  0B 11 58EDTCDE(4)
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  34                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            S1KIK2         3  0B   + 1EDTCDE(4)
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  35                                  DSPATR(PC RI)
      *
     A            S1IN30         1   H      TEXT('*IN30')
      ************
     A          R SFCTL1
     A                                      SFLCTL(SFREC1)
     A  99                                  ALARM
     A                                      CF03 CF05
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0010)
     A                                      OVERLAY
     A                                      PROTECT
     A  71                                  SFLDSP
     A  72                                  SFLDSPCTL
     A  73                                  SFLCLR
     A  90                                  SFLEND
     A                                      ROLLUP(74)
     A                                      ROLLDOWN(75)
     A            DSPRRN         4S 0H      SFLRCDNBR
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  1 24' ** QUENCHING CONDITION -
     A                                      MASTER ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ADHPW803'
      *
     A            D$TYPE        12      2 28DSPATR(HI)
     A*
     A*
     A                                  5 11' UPDATE '   DSPATR(UL)
     A                                  5 24'MATERIAL CODE -
     A                                             MATERIAL -
     A                                      PROPERTIES' DSPATR(UL)
     A            D3KKBN         8      6 11
     A            D3ZACD         3      6 24TEXT('MATERIAL CODE')
     A            D3ZANM        15       + 2TEXT('MATERIAL NAME')
     A            D3KIKI         3  1    + 2TEXT('MATERIAL PROPERTIES  ')
     A                                      EDTWRD('0 . ')
     A*
      * -------------------------------
     A                                  9 11'QUENCHING TIME' DSPATR(RI)
     A                                  8 30' TEMPERING ' DSPATR(RI)
     A                                  9 30'TEMPERATURE' DSPATR(RI)
     A                                  9 46' CO2 '      DSPATR(RI)
     A                                  9 56'HARD STANDARD'
     A                                      DSPATR(RI)
      *
      * -------------------------------
      *
     A          R ADHPW803
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D3ERR         60   O 22 18
      *
     A                                 24  5' F3=RETURN '
     A                                      DSPATR(RI)
     A                                   + 5' F5=UPDATE '
     A                                      DSPATR(RI)
      *----------------------------------------------------------------
      * * SCREEN 4
      *----------------------------------------------------------------
     A          R ADHPW804
     A  99                                  ALARM
     A                                      CF03 CF05
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  1 20' ** QUENCHING CONDITION -
     A                                      PASSWORD MASTER ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ADHPW804'
     A*
     A*
     A                                  8 20'CURRENT PASSWORD'
     A            D4PAS1         8   B   + 1TEXT('PASSWORD')
     A                                      DSPATR(CS)
     A  41                                  DSPATR(PC RI)
     A                                 10 20'NEW PASSWORD'
     A            D4PAS2         8   B 10 37TEXT('PASSWORD')
     A                                      DSPATR(CS)
     A  42                                  DSPATR(PC RI)
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D4ERR         60   O 22 18
      *
     A                                 24  5' F3=RETURN '
     A                                      DSPATR(RI)
     A                                   + 5' F5=UPDATE '
     A                                      DSPATR(RI)
      *----------------------------------------------------------------
      *----------------------------------------------------------------
