     A*%%TS  SD  20010926  125330  TEST        REL-V3R7M0  5716-PW1
     A** AFAPW64 ******************************
     A* CONBINED PARTIAL CONTAINERS (INQUIRY) *
     A* I-HACHISUKA           2000.06.07      *
     A****************************** AFAPW64 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A* *********************************************************
     A          R AFAPW641
     A*%%TS  SD  20000607  103059  HIRO        REL-V3R0M5  5763-PW1
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** CONBINED PARTIAL CONT-
     A                                      AINERS (INQUIRY) **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AFAPW64'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 69'PGM'
     A                                  2 73'AFAR64'
     A* ABSOLUTE NUMBER FIELD
     A                                  3 21'ABSOLUTE NO.:'
     A            DSZETI         4A  B  3 35
     A                                      DSPATR(CS)
     A  31                                  DSPATR(RI)
     A* NEW LOT NUMBER FIELD
     A                                  3 47'NEW LOT NO.:'
     A            DSNLOT         3A  B  3 60
     A                                      DSPATR(CS)
     A  31                                  DSPATR(RI)
     A* ERROR MESSAGE
     A  31                             23 11'ERROR'
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(BL)
     A  31        MSG           60A  O 23 18DSPATR(HI)
     A                                 24 10'EXIT'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 29'PRINT'
     A                                 24 36'CMD-5'
     A                                      DSPATR(RI)
     A*
     A****************************************************
     A          R AFAPW642
     A*%%TS  SD  20010926  125330  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** CONBINED PARTIAL CONTAINERS (IN-
     A                                      QUIRY) **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AFAPW64'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 69'PGM'
     A                                  2 73'AFAR64'
     A                                  3 21'ABSOLUTE NO.:'
     A            DSZETI         4A  B  3 35DSPATR(CS)
     A  31                                  DSPATR(RI)
     A                                  3 47'NEW LOT NO.:'
     A            DSNLOT         3A  B  3 60DSPATR(CS)
     A  31                                  DSPATR(RI)
     A                                  6 12'UPD.DATE'
     A                                      DSPATR(UL)
     A                                  6 22'UPD.TIME'
     A                                      DSPATR(UL)
     A                                  6 32'UPD.TM'
     A                                      DSPATR(UL)
     A                                  6 40'IAF PART NO.'
     A                                      DSPATR(UL)
     A                                  6 54'   KANBANS    '
     A                                      DSPATR(UL)
     A                                  6 70'LOT ID '
     A                                      DSPATR(UL)
     A            DSKODT         6Y 0O  7 12EDTWRD('  .  .  ')
     A            DSKOTM         4Y 0O  7 23EDTWRD('  :  ')
     A            DSKOME         5A  O  7 32
     A            DSPART        12A  O  7 40
     A            DSKAN1        14A  O  7 54
     A            DSKAN2        14A  O  8 54
     A            DSKAN3        14A  O  9 54
     A            DSKAN4        14A  O 10 54
     A            DSKAN5        14A  O 11 54
     A            DSKAN6        14A  O 12 54
     A            DSLOT1         7A  O  7 70
     A            DSLOT2         7A  O  8 70
     A            DSLOT3         7A  O  9 70
     A            DSLOT4         7A  O 10 70
     A            DSLOT5         7A  O 11 70
     A            DSLOT6         7A  O 12 70
     A  31                             23 11'ERROR'
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(BL)
     A            MSG           60A  O 23 18DSPATR(HI)
     A                                 24 10'EXIT'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 29'PRINT'
     A                                 24 36'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 46'PREVIOUS'
     A                                 24 56'CMD-12'
     A                                      DSPATR(RI)
     A                                  4 47'# OF ISSUED:'
     A            DSCOPY         2Y 0O  4 60EDTCDE(4)
     A            DSRPLS         7   O  4 65
     A*************************************************
     A          R AFAPW643
     A*%%TS  SD  20010926  125330  TEST        REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** CONBINED PARTIAL CONTAINERS (IN-
     A                                      QUIRY) **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AFAPW64'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 69'PGM'
     A                                  2 73'AFAR64'
     A                                  3 21'ABSOLUTE NO.:'
     A            DSZETI         4A  B  3 35DSPATR(CS)
     A  31                                  DSPATR(RI)
     A                                  4 47'# OF ISSUED:'
     A            DSCOPY         2Y 0O  4 60EDTCDE(4)
     A                                  5  2'NEW LOT#'
     A                                      DSPATR(UL)
     A            DSNLOT         3A  O  6  4
     A                                  6 12'UPD.DATE'
     A                                      DSPATR(UL)
     A                                  6 22'UPD.TIME'
     A                                      DSPATR(UL)
     A                                  6 32'UPD.TM'
     A                                      DSPATR(UL)
     A                                  6 40'IAF PART NO.'
     A                                      DSPATR(UL)
     A                                  6 54'   KANBANS    '
     A                                      DSPATR(UL)
     A                                  6 70'LOT ID '
     A                                      DSPATR(UL)
     A            DSKODT         6Y 0O  7 12EDTWRD('  .  .  ')
     A            DSKOTM         4Y 0O  7 23EDTWRD('  :  ')
     A            DSKOME         5A  O  7 32
     A            DSPART        12A  O  7 40
     A            DSKAN1        14A  O  7 54
     A            DSKAN2        14A  O  8 54
     A            DSKAN3        14A  O  9 54
     A            DSKAN4        14A  O 10 54
     A            DSKAN5        14A  O 11 54
     A            DSKAN6        14A  O 12 54
     A            DSLOT1         7A  O  7 70
     A            DSLOT2         7A  O  8 70
     A            DSLOT3         7A  O  9 70
     A            DSLOT4         7A  O 10 70
     A            DSLOT5         7A  O 11 70
     A            DSLOT6         7A  O 12 70
     A  31                             23 11'ERROR'
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(BL)
     A            MSG           60A  O 23 18DSPATR(HI)
     A                                 24 10'EXIT'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 29'PRINT'
     A                                 24 36'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 46'PREVIOUS'
     A                                 24 56'CMD-12'
     A                                      DSPATR(RI)
     A            DSRPLS         7   O  4 65
