     A** AFAPW10 *******************************************
     A*INITIAL VALUE OF DISPATCH DATA  IS AUTOMATICALLY APPOINTED, AND JOB ADMIT
     A*S
     A*           M-OKUDA            1986.11.05            *
     A*           N-HYOTO 2001.06.21 HIDE DELETE FUNCTION  *
     A******************************************* AFAPW10 **
     A                                      CHGINPDFT
     A                                      PRINT
      *
     A          R AFAPW101
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01(01)
     A                                      CF05(05)
     A**                                    CF11(11)
     A**                                    CF12(12)
     A                                      CF24(24)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTCDE(Y)
     A                                  1 20'DISPATCH DATA ADMIT BY AUTO CHANGE-
     A                                       INIT VAL APPOINTED'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2 68'FMT AFAPW101'
     A                                  5 14'THIS SYSTEM CAN NOT BE EXECUTED -
     A                                      TODAY'
     A                                      OVRATR
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A                                  6 36'DON T YOU MAKE A MISTAKE?'
     A                                      OVRATR
     A  98                                  DSPATR(RI)
     A N98                                  DSPATR(ND)
     A            JKAN           4A  B 10 11
     A N04                                  DSPATR(CS)
     A  04                                  DSPATR(PR)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 10 17'APPOINT TIME WHEN DISPATCH FIRST (-
     A                                      DEFAULT 0:00)'
     A                                 12 17'IF YOU ADMIT JOB USUALLY, DO NOT-
     A                                       CHANGE ADMITTING TIME'
     A                                 15 21'A-PICS PRODUCTION INSTRUCTION DA-
     A                                      TA MAKING'
     A                                      OVRATR
     A  03                                  DSPATR(BL)
     A N03                                  DSPATR(ND)
     A                                 16 21'PGM IS ACTIVE. (DLTDTAARA)'
     A                                      OVRATR
     A  03                                  DSPATR(BL)
     A N03                                  DSPATR(ND)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  8'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 23'DATA MAKING'
     A                                 24 36'CMD-5'
     A                                      DSPATR(RI)
     A**                               23 63'WRKACTJOB'
     A**                               23 74'CMD-11'
     A**                                    DSPATR(RI)
     A* 06.21.01                       24 63'DLTDTAARA'
     A* 06.21.01                       24 74'CMD-12'
     A* 06.21.01                            DSPATR(RI)
     A                                 24 60'TIME CHANGE'
     A                                 24 73'CMD-24'
     A                                      DSPATR(RI)
