     A*** AFAPW57 **************************
     A*    生産指示データ　受信処理      *
     A*         <各工場>           *
     A*      H.ITO       1992.04.30        *
     A*   N.HAYAKAWA     1999.06.18        *
     A***************** COPY FROM AFAPW50 ***
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AFAPW571
     A                                      KEEP
     A  99                                  ALARM
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                  1  2'日付'
     A                                  1  9DATE  EDTWRD('0  /  /  ')
     A                                  1 26' ** 生産指示+
     A                                      データ　受信処理 ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT AFAPW571'
     A                                  2  2'時刻'
     A                                  2  9TIME  EDTWRD('0  /  /  ')
      *
     A                                  8 13'処理する工場コード+
     A                                      ＝＝＝＞'
     A********    @BMN           4Y 0B  8 42DSPATR(CS) EDTCDE(Z)
     A            @BMN           4Y 0O  8 42
      *
     A  90                             13 41'当日のかんばん発行処理は、終了。'
     A                                 14 13'生産指示データ+
     A                                      受信日付'
     A  91                             15 41'最終便'
      *
     A            @YMD           6Y 0O 14 42
     A                                 14 51'-'
     A            @BIN           2Y 0B 14 53DSPATR(CS) EDTCDE(Z)
     A  99                                  DSPATR(RI BL)
     A                                 14 56'便を入力して下さい。'
     A            WBIN           2Y 0O 15 53
     A                                 15 56'便'
      *
     A                                 17 14'エラー'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
      *
     A            MSG1          40   O 17 26
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(BL)
      *
     A            MSG2          40   O 19 26
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(BL)
      *
     A                                 24  5' CMD-1 ' DSPATR(RI)
     A                                   + 3'中止'
     A                                   + 5' CMD-5 ' DSPATR(RI)
     A                                   + 3'通常受信'
     A                                   +15' CMD-12 ' DSPATR(RI)
     A                                   + 3'再受信'
