     A*%%TS  SD  20011218  102721  TEST        REL-V3R7M0  5716-PW1
     A******************************************************
     A* COMBINED PARTIAL CONTAINERS (INQUIRY BY DATE       *
     A*               DEC/14/01                            *
     A*                                                    *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R SFL01                     SFL
     A*%%TS  SD  20011218  093312  TEST        REL-V3R7M0  5716-PW1
     A            @NLOT          3A  O  5  3
     A            @UPDAY         8Y 0O  5  8EDTWRD('    .  .  ')
     A            @MEMB          6A  O  5 20
     A            @KAN1         14A  O  5 28
     A            @KAN2         14A  O  6 28
     A            @KAN3         14A  O  7 28
     A            @LOT1          7A  O  5 43
     A            @LOT2          7A  O  6 43
     A            @LOT3          7A  O  7 43
     A            @KAN4         14A  O  5 51
     A            @KAN5         14A  O  6 51
     A            @KAN6         14A  O  7 51
     A            @LOT4          7A  O  5 66
     A            @LOT5          7A  O  6 66
     A            @LOT6          7A  O  7 66
     A            @COPY          2Y 0O  5 75EDTCDE(4)
     A            @SRPL          1A  O  5 78
     A                                  6  8'PART'  DSPATR(HI)
     A            @PART         12   O  6 13DSPATR(HI)
     A*
     A****************************************************************
     A          R SFLCTL                    SFLCTL(SFL01)
     A*%%TS  SD  20010911  082103  TEST        REL-V3R7M0  5716-PW1
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A  70                                  SFLDSPCTL
     A  70                                  SFLDSP
     A  71                                  SFLCLR
     A                                      ROLLUP(38)
     A                                      BLINK
     A                                      CF03
     A                                      CF05
     A                                      CF09
     A                                      CF12
     A                                      OVERLAY
     A                                      PROTECT
     A            RRN            4S 0H      SFLRCDNBR
     A                                  4  2'N.LOT'
     A                                      DSPATR(UL)
     A                                  4  8' UPD.DATE '
     A                                      DSPATR(UL)
     A                                  4 20'MEMBER'
     A                                      DSPATR(UL)
     A                                  4 28'   KANBANS    '
     A                                      DSPATR(UL)
     A                                  4 43'LOT ID '
     A                                      DSPATR(UL)
     A                                  4 51'   KANBANS    '
     A                                      DSPATR(UL)
     A                                  4 66'LOT ID '
     A                                      DSPATR(UL)
     A                                  4 74'ISSUED'
     A                                      DSPATR(UL)
     A****************************************************************
     A          R AFAPW699
     A*%%TS  SD  20011218  092147  TEST        REL-V3R7M0  5716-PW1
     A                                      ROLLUP
     A                                      OVERLAY
     A                                      CF03
     A                                      CF05
     A                                      CF09
     A                                      CF12
     A  99                             23 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A  99        @MSG          60A  O 23 18
     A                                 24  2'EXIT'
     A                                 24  7'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 16'PRINT'
     A                                 24 22'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 33'PREVIOUS'
     A                                 24 42'CMD-12'
     A                                      DSPATR(RI)
     A                                 24 68'S=SURPLUS'
     A****************************************************************
     A          R AFAPW691
     A*                                     OVERLAY PROTECT
     A                                      CF03(03)
     A  99                             23 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(HI)
     A  99        @MSG          60A    23 18
     A                                 24 10'EXIT'
     A                                 24 16'CMD-3'
     A                                      DSPATR(RI)
     A*
     A*
     A****************************************************************
     A          R AFAPW692
     A*%%TS  SD  20011218  102721  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF03
     A                                  1  2'TIME:'
     A                                  1  8TIME
     A                                  1 19'** COMBINED PARTIAL CONTAINERS (IN-
     A                                      QUIRY) **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AFAPW65'
     A                                  2  2'DATE'
     A                                  2  8DATE
     A                                      EDTCDE(Y)
     A                                  2 69'PGM'
     A                                  2 73'AFAR65'
     A                                  3 12'DATE:'
     A            DSSTRD         8Y 0B  3 18DSPATR(UL)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  3 27'--'
     A            DSENDD         8Y 0B  3 30DSPATR(UL)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  3 42'(YYYYMMDD)'
