     A*%%TS  SD  20240620  153008  I0777       REL-V7R4M0  5770-WDS
     A** AFBPW93A***********************************
     A*  COMPONENT PARTS ORDER INQUIRY             *
     A* J.WATANABE   2024.06.17                    *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R DSP01
     A*%%TS  SD  20240620  153008  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE FIRST SCREEN')
     A                                      CF01(01)
     A                                      CF07(07)
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** COMPONENT PARTS ORDER INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 72'AFBPW93A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 72'DSP01'
     A                                  6 19'Select By:'
     A            @TYPE          1A  B  6 30DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  6 34'(A: by Component Parts)'
     A                                  7 34'(B: by Supplier Code  )'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24 10'F1:'
     A                                      DSPATR(RI)
     A                                 24 14'EXIT'
     A                                 24 28'F7:'
     A                                      DSPATR(RI)
     A                                 24 32'DOWNLOAD TO csv'
     A*
     A          R DSP02
     A*%%TS  SD  20240619  135232  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE 2ND   SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** COMPONENT PARTS ORDER INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 72'AFBPW93A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 72'DSP02'
     A                                  6 21'PART#...........:'
     A            @HIN1          5A  B  6 40DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  6 46'-'
     A            @HIN2          5A  B  6 48DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  6 54'-'
     A            @HIN3          2A  B  6 56DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  8 21'ORDER DATE FROM :'
     A            @1YY           4Y 0B  8 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  8 45'-'
     A            @1MM           2Y 0B  8 47DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(RI)
     A                                  8 50'-'
     A            @1DD           2Y 0B  8 52DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(RI)
     A                                 10 21'ORDER DATE TO...:'
     A            @2YY           4Y 0B 10 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 10 45'-'
     A            @2MM           2Y 0B 10 47DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(RI)
     A                                 10 50'-'
     A            @2DD           2Y 0B 10 52DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24 10'F1:'
     A                                      DSPATR(RI)
     A                                 24 14'EXIT'
     A                                 24 24'F3:'
     A                                      DSPATR(RI)
     A                                 24 28'BACK'
     A*
     A          R DSP03
     A*%%TS  SD  20240619  135232  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE 2ND   SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18'** COMPONENT PARTS ORDER INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 72'AFBPW93A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 72'DSP03'
     A                                  5 60'0478:AAC    '
     A                                  6 21'SUPPLIER CODE...:'
     A            @SUPP          4A  B  6 40DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  6 46'<-----------'
     A                                  6 60'2323:FREEWAY'
     A                                  7 60'2525:RK METAL'
     A                                  8 21'ORDER DATE FROM :'
     A            @1YY           4Y 0B  8 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                  8 45'-'
     A            @1MM           2Y 0B  8 47DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(RI)
     A                                  8 50'-'
     A            @1DD           2Y 0B  8 52DSPATR(CS)
     A                                      EDTCDE(Z)
     A  33                                  DSPATR(RI)
     A                                  8 60'3111:SEKIDO  '
     A                                 10 21'ORDER DATE TO...:'
     A            @2YY           4Y 0B 10 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                 10 45'-'
     A            @2MM           2Y 0B 10 47DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(RI)
     A                                 10 50'-'
     A            @2DD           2Y 0B 10 52DSPATR(CS)
     A                                      EDTCDE(Z)
     A  34                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24 10'F1:'
     A                                      DSPATR(RI)
     A                                 24 14'EXIT'
     A                                 24 23'F3:'
     A                                      DSPATR(RI)
     A                                 24 27'BACK'
     A*
     A          R SFL01                     SFL
     A*%%TS  SD  20240618  115111  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('SFL')
     A*
     A            @RRN1          4Y 0H
     A            @9HIN1         5A  H
     A            @9HIN2         5A  H
     A            @9HIN3         2A  H
     A            @9SUPP         4A  H
     A            @9ODNO         6Y 0H
     A            @9ZETI         4A  H
     A            @9NOSU         9Y 0H
     A            @SYSS          6Y 0H
     A            @NO1           3Y 0O  7  2EDTCDE(Z)
     A            @CMTD         14A  O  7  6
     A            @9ODHZ         8Y 0O  7 22EDTWRD('0    .  .  ')
     A  41                                  DSPATR(ND)
     A            @9NYHZ         8Y 0O  7 34EDTWRD('0    .  .  ')
     A  42                                  DSPATR(ND)
     A            @9NOHZ         8Y 0O  7 46EDTWRD('0    .  .  ')
     A  43                                  DSPATR(ND)
     A            @9HAKO         3Y 0O  7 58EDTCDE(Z)
     A            @9MINO         3Y 0O  7 65EDTWRD('   -')
     A            @SUPP          4   O  7 73
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20240618  115111  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0013)
     A                                      TEXT('THE SECOND SCREEN')
     A  70                                  SFLDSP
     A  70                                  SFLDSPCTL
     A  71                                  SFLCLR
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      BLINK
     A                                      OVERLAY
     A                                      PROTECT
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A            @SFRC1         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** COMPONENT PARTS ORDER INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 72'AFBPW93A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 72'CTL01'
     A            @CMTH1        10A  O  4  3DSPATR(UL)
     A            @CMTH2        15A  O  4 14
     A  10                              4 31' QPC '
     A                                      DSPATR(UL)
     A  10        @SYS           6Y 0O  4 37EDTWRD('   ,   ')
     A                                  5 63'NON-'
     A                                  6  2'NO.'
     A                                      DSPATR(UL)
     A            @CMTH3         8A  O  6  6DSPATR(UL)
     A                                  6 22'ORDER_DATE'
     A                                      DSPATR(UL)
     A                                  6 34'ETA_DATE  '
     A                                      DSPATR(UL)
     A                                  6 46'RECEIVED  '
     A                                      DSPATR(UL)
     A                                  6 58'BOX'
     A                                      DSPATR(UL)
     A                                  6 63'DELIVERY'
     A                                      DSPATR(UL)
     A                                  6 73'SUPP'
     A                                      DSPATR(UL)
      *
      *---------------------------------*
     A          R SFL02                     TEXT('SFL')
     A                                      SFL
     A            @NO2           3Y 0  17  8EDTCDE(Z)
     A            @8NOHZ         8Y 0  17 13EDTWRD('0    .  .  ')
     A  41                                  DSPATR(ND)
     A            @MAIS          6Y 0  17 31EDTWRD('   ,   ')
     A            @MINO          6Y 0  17 52EDTWRD('   ,   -')
      *
     A            @RRN2          4Y 0H
     A*
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20240618  115111  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0004)
     A                                      SFLPAG(0004)
     A                                      TEXT('THE SECOND SCREEN')
     A  72                                  SFLDSP
     A  72                                  SFLDSPCTL
     A  73                                  SFLCLR
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      BLINK
     A                                      OVERLAY
     A                                      PROTECT
     A                                      ROLLUP(53)
     A                                      ROLLDOWN(54)
     A            @SFRC2         4S 0H      SFLRCDNBR(CURSOR)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** COMPONENT PARTS ORDER INQUIRY *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 72'AFBPW93A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 72'CTL02'
     A                                  4  2'PARTS NO.'
     A            @HIN          14A  O  4 12DSPATR(UL)
     A                                  5  2'ORDER NO.'
     A            @ODERN         6A  O  5 12DSPATR(UL)
     A                                  6  2'ID. NO'
     A            @WZETI         4A  O  6 12DSPATR(UL)
     A            @KANBN        22A  O  6 26
     A                                  8  5'+----------------------------------
     A                                      ------------------------------------
     A                                      ---+'
     A                                  9  5'|'
     A                                  9  8'ORDER_DATE  ETA_DATE      BOX     -
     A                                               QPC       ORDER_QTY'
     A                                  9 77'|'
     A                                 10  5'|'
     A            @HTOHZ         8Y 0O 10  8EDTWRD('0    .  .  ')
     A            @NOHZ          8Y 0O 10 20EDTWRD('0    .  .  ')
     A            @HAKO          3Y 0O 10 34EDTCDE(Z)
     A            @SYS           6Y 0O 10 47EDTWRD('   ,   ')
     A            @NSRYO         9Y 0O 10 59EDTWRD('   ,   ,   ')
     A                                 10 77'|'
     A                                 11  5'|'
     A                                 11 77'|'
     A                                 12  5'|'
     A                                 12  8'SUPPLIER'
     A                                 12 29'DELIVERY CYCLE  LOCATION'
     A                                 12 56'SETTING#'
     A                                 12 69'UPDATE'
     A                                 12 77'|'
     A                                 13  5'|'
     A            @SUPNM        20A  O 13  8
     A            @CIKU          6Y 0O 13 32EDTWRD('0  :  :  ')
     A            @TKR           9A  O 13 45
     A            @SETS          5Y 0O 13 58EDTCDE(Z)
     A            @UPD           1A  O 13 71
     A                                 13 77'|'
     A                                 14  5'+----------------------------------
     A                                      ------------------------------------
     A                                      ---+'
     A                                 16  8'NO.'
     A                                 16 13'DELIVERY_DATE'
     A                                 16 29'DELIVERY_BOX'
     A                                 16 48'NON-DELIVERY_BOX'
     A*
     A          R DSP07
     A*%%TS  SD  20240618  114159  I0777       REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF07(07)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A                                 21 22'Select No.-->'
     A            @BANGO         3Y 0B 21 36DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A N81                             21 71'MORE...'
     A  81                             21 71'BOTTOM'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
      *
     A          R DSP08                     OVERLAY PROTECT
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      ROLLUP(53)
     A                                      ROLLDOWN(54)
      *
     A N82                             21 71'MORE...'
     A  82                             21 71'BOTTOM'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A*
     A*
     A          R DSP09
     A*%%TS  SD  20240618  130219  I0777       REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A                                      PROTECT
     A                                 24  7'F1:'
     A                                      DSPATR(RI)
     A                                 24 11'EXIT'
     A                                 24 20'F3:'
     A                                      DSPATR(RI)
     A                                 24 24'BACK'
     A                                 24 34'F7:'
     A                                      DSPATR(RI)
     A                                 24 38'DOWNLOAD TO csv'
     A                                 24 59'ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 67'ROLL-DWN'
     A                                      DSPATR(RI)
     A*
     A          R DSP0X
     A*%%TS  SD  20240618  102645  I0777       REL-V7R4M0  5770-WDS
     A                                      OVERLAY
     A                                      PROTECT
     A                                 24  7'F1:'
     A                                      DSPATR(RI)
     A                                 24 11'EXIT'
     A                                 24 21'F3:'
     A                                      DSPATR(RI)
     A                                 24 25'BACK'
     A                                 24 59'ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 68'ROLL-DWN'
     A                                      DSPATR(RI)
