     A*%%TS  SD  20010626  105243  TEST        REL-V3R7M0  5716-PW1
     A** AFCPW83 *******************************************
     A* ORDER DATA UPDATE PROCESS<LOCAL PROCURMENT SYSTEM> *
     A*                                                    *
     A* N.HYOTO  2001.06.26                                *
     A******************************************* AFCPW83 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*****************************************************************
     A          R AFCPW831
     A*%%TS  SD  20010626  102617  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE FIRST SCREEN')
     A                                      CF01(01)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  9 20'1.MANUAL DATA ENTRY'
     A                                      DSPATR(HI)
     A                                  9 40'(DELETE,CHANGE,ADD)'
     A                                      DSPATR(HI)
     A                                 11 20'2.CHANGE MATERIAL KANBAN READ SUMM-
     A                                      ARY DATA'
     A                                      DSPATR(HI)
     A            @CODE          1A  B 15 30DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 15 33'<--- INPUT MENU NO.'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  3'F1:EXIT'
     A*
     A*****************************************************************
     A          R AFCPW832
     A*%%TS  SD  20010626  104115  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE 2ND SCREEN')
     A                                      CF01(01)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  7 12'UPDATE INSTRUCTION'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 33'SUPPLIER'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 45'WIRE'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            @KUBN          1A  B  9 12DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            @SUPP          4Y 0B  9 33DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            @ZAIS         15A  B  9 45DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 10 12'|'
     A                                 11 12'+------------+'
     A                                 12 12'| 0: CANSEL  |'
     A                                 13 12'| 1: CHANGE  |'
     A                                 14 12'| 2: ADD.    |'
     A                                 15 12'+------------+'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  3'F1:EXIT'
     A                                 11 33'4511: O & K '
     A                                  7 62'DIAMETER'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            @ZAIK          5Y 2B  9 64DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      EDTCDE(1)
     A*
     A*****************************************************************
     A          R AFCPW833
     A*%%TS  SD  20010626  104115  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE 3RD   SCREEN')
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  4  2'UPDATE INSTRUCTION'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  4 22'SUPPLIER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  4 44'WIRE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            @KBNM          9A  O  5  2
     A            @SUPPC         4Y 0O  5 22
     A            @SUPPN        15A  O  5 27
     A            @ZAIS         15A  O  5 44
     A                                  7 22'WEIGHT /COIL'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 37'NUMBER OF KANBAN'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            @TKJR          6Y 0B  9 23DSPATR(CS)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A            @COIL          3Y 0B  9 43DSPATR(CS)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  3'F3:PREVIOUS'
     A                                 24 31'F5:UPDATE'
     A                                  4 61'DIAMETER'
     A                                      DSPATR(RI)
     A            @ZAIK          5Y 2O  5 63EDTCDE(1)
     A*
     A*****************************************************************
     A          R AFCPW834
     A*%%TS  SD  20010626  105243  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE 4TH SCREEN')
     A                                      CF01(01)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  6 22'*** MATERIAL KANBAN READ SUMMARY D-
     A                                      ATA *'
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A                                  9 24' SUPPLIER '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  9 41' WIRE '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  9 59' DIAMETER '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            @SUPP          4Y 0B 11 25DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            @ZAIS         15A  B 11 42DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            @ZAIK          5Y 2B 11 61DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                      EDTCDE(1)
     A                                 13 24' 4511: O & K '
     A                                 13 38' '
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(BL)
     A                                 24  3' F1:EXIT'
     A*
     A*****************************************************************
     A          R AFCPW835
     A*%%TS  SD  20010626  105243  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE 5TH   SCREEN')
     A                                      CF03(03)
     A                                      ROLLUP(90 'ROLL UP')
     A                                      ROLLDOWN(95 'ROLL DOWN')
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  4  5'SUPPLIER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            @SUPPC         4Y 0O  5  5
     A            @SUPPN        15A  O  5 10
     A                                  7 10'WIRE'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 37'ID NO.'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 46'NUMBER OF'
     A                                      DSPATR(HI)
     A                                  7 46'KANBAN   '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  7 58'WEIGHT/COIL'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            @NO1           1A  B  8  7DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            @ZAIS1        15A  O  8 10
     A  11                                  DSPATR(RI)
     A            @ZAIK1         5Y 2O  8 28EDTCDE(1)
     A            @ZETI1         4A  O  8 38
     A            @MAIS1         3Y 0O  8 49EDTCDE(Z)
     A            @TKJR1         6Y 0O  8 59EDTCDE(Z)
     A*****
     A            @NO2           1A  B  9  7DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            @ZAIS2        15A  O  9 10
     A  12                                  DSPATR(RI)
     A            @ZAIK2         5Y 2O  9 28EDTCDE(1)
     A            @ZETI2         4A  O  9 38
     A            @MAIS2         3Y 0O  9 49EDTCDE(Z)
     A            @TKJR2         6Y 0O  9 59EDTCDE(Z)
     A*****
     A            @NO3           1A  B 10  7DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            @ZAIS3        15A  O 10 10
     A  13                                  DSPATR(RI)
     A            @ZAIK3         5Y 2O 10 28EDTCDE(1)
     A            @ZETI3         4A  O 10 38
     A            @MAIS3         3Y 0O 10 49EDTCDE(Z)
     A            @TKJR3         6Y 0O 10 59EDTCDE(Z)
     A*****
     A            @NO4           1A  B 11  7DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            @ZAIS4        15A  O 11 10
     A  14                                  DSPATR(RI)
     A            @ZAIK4         5Y 2O 11 28EDTCDE(1)
     A            @ZETI4         4A  O 11 38
     A            @MAIS4         3Y 0O 11 49EDTCDE(Z)
     A            @TKJR4         6Y 0O 11 59EDTCDE(Z)
     A*****
     A            @NO5           1A  B 12  7DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            @ZAIS5        15A  O 12 10
     A  15                                  DSPATR(RI)
     A            @ZAIK5         5Y 2O 12 28EDTCDE(1)
     A            @ZETI5         4A  O 12 38
     A            @MAIS5         3Y 0O 12 49EDTCDE(Z)
     A            @TKJR5         6Y 0O 12 59EDTCDE(Z)
     A*****
     A            @NO6           1A  B 13  7DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            @ZAIS6        15A  O 13 10
     A  16                                  DSPATR(RI)
     A            @ZAIK6         5Y 2O 13 28EDTCDE(1)
     A            @ZETI6         4A  O 13 38
     A            @MAIS6         3Y 0O 13 49EDTCDE(Z)
     A            @TKJR6         6Y 0O 13 59EDTCDE(Z)
     A*****
     A            @NO7           1A  B 14  7DSPATR(CS)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            @ZAIS7        15A  O 14 10
     A  17                                  DSPATR(RI)
     A            @ZAIK7         5Y 2O 14 28EDTCDE(1)
     A            @ZETI7         4A  O 14 38
     A            @MAIS7         3Y 0O 14 49EDTCDE(Z)
     A            @TKJR7         6Y 0O 14 59EDTCDE(Z)
     A*****
     A            @NO8           1A  B 15  7DSPATR(CS)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            @ZAIS8        15A  O 15 10
     A  18                                  DSPATR(RI)
     A            @ZAIK8         5Y 2O 15 28EDTCDE(1)
     A            @ZETI8         4A  O 15 38
     A            @MAIS8         3Y 0O 15 49EDTCDE(Z)
     A            @TKJR8         6Y 0O 15 59EDTCDE(Z)
     A*****
     A            @NO9           1A  B 16  7DSPATR(CS)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            @ZAIS9        15A  O 16 10
     A  19                                  DSPATR(RI)
     A            @ZAIK9         5Y 2O 16 28EDTCDE(1)
     A            @ZETI9         4A  O 16 38
     A            @MAIS9         3Y 0O 16 49EDTCDE(Z)
     A            @TKJR9         6Y 0O 16 59EDTCDE(Z)
     A*****
     A            @NO0           1A  B 17  7DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            @ZAIS0        15A  O 17 10
     A  20                                  DSPATR(RI)
     A            @ZAIK0         5Y 2O 17 28EDTCDE(1)
     A            @ZETI0         4A  O 17 38
     A            @MAIS0         3Y 0O 17 49EDTCDE(Z)
     A            @TKJR0         6Y 0O 17 59EDTCDE(Z)
     A                                 18  7'|'
     A                                 19  7'|'
     A                                 20  7'+-- (0:DELETE,1:CHANGE)'
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  1'F3:PREVIOUS'
     A                                 24 39'FRONT PAGE'
     A                                 24 50' PAGE UP '
     A                                      DSPATR(RI)
     A                                 24 60'NEXT PAGE'
     A                                 24 70' PAGE DOWN '
     A                                      DSPATR(RI)
     A                                  7 27'DIAMETER'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A*
     A*****************************************************************
     A          R AFCPW836
     A*%%TS  SD  20010626  105243  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('THE 6TH   SCREEN')
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24' MATERIAL ORDER DATA UPDATE PROCES-
     A                                      S '
     A                                      DSPATR(RI)
     A                                  2 29'<LOCAL PROCURMENT SYSTEM>'
     A                                  1 68'FMT AFCPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  4  5'SUPPLIER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            @SUPPC         4Y 0O  5  5
     A            @SUPPN        15A  O  5 10
     A                                  4 28'WIRE'
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A                                  4 55'ID NO.'
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A            @ZAIS         15A  O  5 28
     A            @ZETI          4A  O  5 56
     A                                  8 18'NUMBER OF KANBAN'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  8 41'WEIGHT/COIL'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            @MAIS          3Y 0B  9 25EDTCDE(Z)
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A            @TKJR          6Y 0B  9 42EDTCDE(Z)
     A                                      DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR1          1A  B 15 14DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A            @ERR2          1A  B 16 14DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  50                                  DSPATR(PR)
     A                                 14 17'<ERROR LIST>'
     A                                      DSPATR(HI)
     A                                 15 16'NO DATA IN MATERIAL KANBAN MASTER.'
     A                                 16 16'SECTION CODE IN MATERIAL KANBAN MA-
     A                                      STER IS DIFFERENT.'
     A                                 17 14'|'
     A                                 18 14'+-->'
     A                                 18 19'AFTER DELETING * , PRESS F5 TO UPD-
     A                                      ATE.'
     A                                      DSPATR(HI)
     A            @ERR          60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  2'F3:PREVIOUS'
     A                                 24 24'F5:UPDATE'
     A                                  4 45'DIAMETER'
     A                                      DSPATR(RI)
     A            @ZAIK          5Y 2O  5 47
