     A* TCHK1 11/01/07 CREATE
     A* TCHK2 06/17/09 CHG PRINTER NAME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R FMT010
     A                                      CF01
     A                                      CF05
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 22'** OUTGOING ORDER SCANNED DATA -
     A                                      PRINT **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  4 25'SUPPLIER:'
     A            D@SUPP         4A  O  4 35
     A            D@SUPX         1A  O  4 40
     A            D@SUPN         8A  O  4 42
     A                                  7 25'SCANNED DATE:'
     A                                      DSPATR(HI)
     A            D@DATE         8Y 0B  7 39EDTCDE(4)
     A                                      DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  7 48'(YYYYMMDD)'
     A                                 11 25'PRINTER:'
     A                                      DSPATR(HI)
     A            D@PRT          1A  B 11 34DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 11 38'1.LANPRT10(DOCK 6)'
     A                                 12 38'2.LANPRT02(APICS)'
     A                                 13 38'3.LANPRT09(APICS)'
     A                                 14 38'4.LANPRT03(OFFICE)'
TCHK2A*                                15 38'5.LANPRT04(OFFICE)'
TCHK2A                                 15 38'5.LANPRT04(GL ROOM)'
     A                                 16 38'6.LANPRT05(TOOL ROOM)'
     A                                 23  2'F1:'
     A                                      DSPATR(RI)
     A                                 23  6'EXIT'
     A                                 23 14'F5:'
     A                                      DSPATR(RI)
     A                                 23 18'PRINT'
     A            D@MSG         78     24  2COLOR(RED)
