     A*%%TS  SD  20190410  151743  I0777       REL-V7R3M0  5770-WDS
     A* TCHK1 05/21/10 CHG ND CONTENTS SUMMARY FOR SEKIDO
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20011217  145142  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF05
     A            #PGM           8A  O  1  2
     A                                  1 18'** CREATE DATA FOR SHIPPING DOCUME-
     A                                      NTS **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A            D@SUPP        15A  O  2 29DSPATR(HI)
     A                                  5 21'ORDER DATE:'
     A                                      DSPATR(HI)
     A            D@DATE         8Y 0B  5 34EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 44'(YYYYMMDD)'
     A                                  7 21'BILL OF LADING:'
     A                                      DSPATR(HI)
     A            D@BL           1A  B  7 39DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  8 21'PURCHASE REQ:'
     A                                      DSPATR(HI)
     A            D@PK           1A  B  8 39DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 21'CONTENTS SUMMARY:'
     A                                      DSPATR(HI)
TCHK1A  65                                  DSPATR(ND)
TCHK1A*           D@CS           1A  B  9 39DSPATR(CS)
TCHK1A            D@CS           1A  B  9 39
TCHK1A N65                                  DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
TCHK1A  65                                  DSPATR(ND PR)
     A                                 11 38'(Y/N)'
     A          R DSP99
     A*%%TS  SD  20190410  151743  I0777       REL-V7R3M0  5770-WDS
     A            D@CMD         78A  O 22  2
     A            D@MSG         78A  O 23  2
