     A*%%TS  SD  20011217  163618  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A          R DSP01
     A                                      OVERLAY
     A*%%TS  SD  20011217  163618  TEST        REL-V3R7M0  5716-PW1
     A            #PGM           8A  O  1  2
     A                                  1 27'** CANCEL RECEIVING **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  4 21'RECIEVED BIN#:'
     A                                      DSPATR(HI)
     A            D@BINN         3A  B  4 36DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 21'RECEIVED DATE:'
     A                                      DSPATR(HI)
     A            D@RCVD         8Y 0B  5 36DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                  5 46'(YYYYMMDD)'
     A            D@UPD         50     10 20DSPATR(HI)
     A          R DSP99
     A            D@CMD         78     23  2
     A            D@MSG         78     24  2DSPATR(HI BL)
