     A*%%TS  SD  20210817  100809  I0777       REL-V7R3M0  5770-WDS
     A** AFDPW82 *******************************************
     A*  OUT SOURCE ORDER RECIEVING                        *
     A*                                                    *
     A* TCHK1 05/14/10 CREATE                              *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A*
     A          R DSP01
     A                                      OVERLAY
     A            TITL          15A  O  1  2DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  3  2'INTRA KANBAN'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            BARCD1        15A  B  5  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                 10  2'F3:END'
     A*
     A          R DSP02
     A                                      OVERLAY
     A            TITL          15A  O  1  2DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  3  2'INTRA KANBAN'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            BARCD1        15A  O  5  2
     A                                  8  2'BIN #'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            BIN            3A  B  8  8CHECK(ER)
     A  62                                  DSPATR(RI)
     A                                 10  2'F3:END'
     A*
     A          R DSP03
     A                                      OVERLAY
     A            TITL          15A  O  1  2
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  3  3'LOT#:'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            BARCD3         8A  B  4  3CHECK(ER)
     A  63                                  DSPATR(RI)
     A            LOT#01         8A  O  6  3
     A            LOT#02         8A  O  7  3
     A            LOT#03         8A  O  8  3
     A                                 10  2'F3:END'
     A*
     A          R DSP04
     A                                      OVERLAY
     A                                      CF05
     A            TITL          15A  O  1  2DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  3  2'PART# barcode'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            BARCD4        13A  B  5  2CHECK(ER)
     A  64                                  DSPATR(RI)
     A                                 10  2'F3:END'
     A                                 11  2'F5:UPDATE'
     A*
     A          R DSP05
     A                                      OVERLAY
     A            TITL          15A  O  1  2DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  3  2'SERIAL# barcode'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
TCHK2A            BARCD5        11A  B  5  2CHECK(ER)
     A  65                                  DSPATR(RI)
     A                                 10  2'F3:END'
     A*
     A          R ERR99
     A                                      OVERLAY
     A                                      TEXT('DUMMY')
     A                                      KEEP
     A                                  1  2'*******************'
     A                                      DSPATR(BL)
     A                                  2  2'*                 *'
     A                                      DSPATR(BL)
     A                                  3  2'*                 *'
     A                                      DSPATR(BL)
     A                                  4  2'*                 *'
     A                                      DSPATR(BL)
     A                                  5  2'*'
     A                                      DSPATR(BL)
     A            MSG           15   O  5  4
     A                                      DSPATR(BL)
     A                                  5 20'*'
     A                                      DSPATR(BL)
     A                                  6  2'*                 *'
     A                                      DSPATR(BL)
     A                                  7  2'*                 *'
     A                                      DSPATR(BL)
     A                                  8  2'*                 *'
     A                                      DSPATR(BL)
     A                                  9  2'*                 *'
     A                                      DSPATR(BL)
     A                                 10  2'*******************'
     A                                      DSPATR(BL)
     A          R ERR98
     A                                      TEXT('DUMMY')
     A                                      OVERLAY
     A                                      KEEP
     A                                      CF05
     A                                  1  2'*******************'
     A                                      DSPATR(BL)
     A                                  2  2'*******************'
     A                                      DSPATR(BL)
     A                                  3  2'*                 *'
     A                                      DSPATR(BL)
     A                                  4  2'*'
     A                                      DSPATR(BL)
     A            MSG           15   O  4  4
     A                                      DSPATR(BL)
     A                                  4 20'*'
     A                                      DSPATR(BL)
     A                                  5  2'*                 *'
     A                                      DSPATR(BL)
     A                                  6  2'* ORDER:'
     A                                      DSPATR(BL)
     A            BIN#1          3   O  6 13
     A                                      DSPATR(BL)
     A                                  6 20'*'
     A                                      DSPATR(BL)
     A                                  7  2'* RECIEVE:'
     A                                      DSPATR(BL)
     A            BIN#2          3   O  7 13
     A                                      DSPATR(BL)
     A                                  7 20'*'
     A                                      DSPATR(BL)
     A                                  8  2'*                 *'
     A                                      DSPATR(BL)
     A                                  9  2'*******************'
     A                                      DSPATR(BL)
     A                                 10  2'*******************'
     A                                      DSPATR(BL)
     A                                 11  2'ENTER:PREV SCREEN'
     A                                 12  2'F3:END'
     A                                 13  2'F5:CONTINUE'
     A          R DSPOK
     A*%%TS  SD  20210817  100809  I0777       REL-V7R3M0  5770-WDS
     A                                      OVERLAY
     A                                  6  2'RECEIVED!!'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  8  3'BIN#'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A            BIN            3A  O  8  8DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 14  2'ENTER:NEXT'
