     A*%%TS  SD  20210817  101022  I0777       REL-V7R3M0  5770-WDS
     A** AFDPW01 ****************************
     A*  OUT SOURCE ORDER(SUPPLY)           *
     A*                                     *
     A*  TCH DEC/12/01                      *
     A**************************** AFDPW01 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A          R DSP01
     A*%%TS  SD  20011214  181200  TEST        REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                      CF04
     A            TITL          15      1  3
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            BARCD         15A  B  8  2CHECK(ER)
     A                                  6  2'APICS KANBAN:'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  3  2'**** CANCEL ****'
     A                                      DSPATR(RI)
     A          R DSP99
     A            D@KEY         18     16  1
      *
      **********************************************************
     A          R ERR99
     A                                      TEXT('DUMMY')
     A                                      PUTOVR
     A                                      OVERLAY
     A                                      KEEP
     A                                  1  2'*******************'
     A                                      DSPATR(BL)
     A                                  2  2'*                 *'
     A                                      DSPATR(BL)
     A                                  3  2'*                 *'
     A                                      DSPATR(BL)
     A                                  4  2'*                 *'
     A                                      DSPATR(BL)
     A                                  5  2'*                 *'
     A                                      DSPATR(BL)
     A                                  6  2'*                 *'
     A                                      DSPATR(BL)
     A                                  7  2'*                 *'
     A                                      DSPATR(BL)
     A                                  8  2'*'
     A                                      DSPATR(BL)
     A            MSG           15   O  8  4
     A                                      DSPATR(BL)
     A                                  8 20'*'
     A                                      DSPATR(BL)
     A                                  9  2'*                 *'
     A                                      DSPATR(BL)
     A                                 10  2'*                 *'
     A                                      DSPATR(BL)
     A                                 11  2'*                 *'
     A                                      DSPATR(BL)
     A                                 12  2'*                 *'
     A                                      DSPATR(BL)
     A                                 13  2'*                 *'
     A                                      DSPATR(BL)
     A                                 14  2'*                 *'
     A                                      DSPATR(BL)
     A                                 15  2'*******************'
     A                                      DSPATR(BL)
     A          R DSPOK
     A*%%TS  SD  20210817  101022  I0777       REL-V7R3M0  5770-WDS
     A                                  6  2'CANCELLED!!'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 14  2'ENTER:NEXT'
