     A** AFGPW03 ********************************************
     A* CREATE EDI ORDER DATA 850 FOR OUTSOURCE             *
     A*       T.SAKAKI                     2016.11.14       *
     A******************************************** AFGPW03 **
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A*--------------------------------------------------------
     A          R SFL01                     SFL
     A*--------------------------------------------------------
     A            S1PART        14A    18 16
     A            S1TWGT         7Y 2  18 32EDTWRD('     .  ')
     A            S1BINN         3A    18 46
     A            S1NBOX         4Y 0  18 55EDTCDE(Z)
     A            S1TQTY         7Y 0  18 65EDTCDE(1)
     A*--------------------------------------------------------
     A          R CTL01
     A*--------------------------------------------------------
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A                                      SFLCTL(SFL01)
     A                                      SFLPAG(4)
     A                                      SFLSIZ(5)
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN02         4  0H      SFLRCDNBR
      *
      * TITLE------------------------
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18'**  OUT-SOURCING EDI ORDER +
     A                                       PROCESSING  **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AFGPW03'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A                                  2 19'SUPPLIER ->'
     A                                      DSPATR(HI)
     A            D1SUPP         4A      + 1DSPATR(HI)
     A            D1SUPN        15O      + 2DSPATR(HI)
      *--------------------------------------------------
      * GPS P.O.NUMBER
     A                                  3  2'GPS P.O. NUMBER'
     A                                      DSPATR(RI)
     A            D1GPPO        17A  B   + 1DSPATR(CS)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
      * GPS ITEM NUMBER
     A                                  3 38'GPS ITEM #'
     A                                      DSPATR(UL)
     A            D1INBR        31O  B   + 1DSPATR(CS)
      *--------------------------------------------------
      * PAYMENT TERMS
     A                                  5  2'PAYMENT TERMS'
     A                                      DSPATR(UL)
     A            D1PAYT        21O  B   + 1DSPATR(CS)
      * CONFIRM WITH
     A                                   + 2'CONFIRM WITH'
     A                                      DSPATR(UL)
     A            D1CONF        15O  B   + 1DSPATR(CS)
      *--------------------------------------------------
      * SHIPPING METHOD
     A                                  6  2'SHIPPING METHOD'
     A                                      DSPATR(UL)
     A            D1SHPM        15O  B   + 1DSPATR(CS)
      * REQUESTED DATA
     A                                   + 2'REQ. DATA'
     A                                      DSPATR(UL)
     A            D1REQD         8Y 0B   + 1EDTWRD('    /  /  ')
     A                                      DSPATR(CS)
      * UNIT OF MEASURE
     A                                   + 2'U/M'
     A                                      DSPATR(UL)
     A            D1UOME         9O  B   + 1DSPATR(CS)
      * F.O.B.
     A                                   + 2'F.O.B.'
     A                                      DSPATR(UL)
     A            D1FONB         1A  B   + 1DSPATR(CS)
      *--------------------------------------------------
      * ORDERED QTY.
     A                                  7  2'ORDERED QTY.'
     A                                      DSPATR(UL)
     A            D1ORDQ         9Y 0B   + 1DSPATR(CS)
     A                                      EDTCDE(4)
      * UNIT PRICE
     A                                   + 2'UNIT PRICE'
     A                                      DSPATR(UL)
     A            D1UNTP        13Y 5B   + 1DSPATR(CS)
     A                                      EDTWRD('      0 .     ')
      * EXTENDED PRICE
     A                                   + 2'EXT.PRICE'
     A                                      DSPATR(UL)
     A            D1EXTP        13Y 5B   + 1DSPATR(CS)
     A                                      EDTCDE(4)
      *--------------------------------------------------
      * ITEM DESCRIPTION
     A                                  9  2'ITEM DESC'
     A                                      DSPATR(UL)
     A            D1ITDS        60O  B   + 2DSPATR(CS)
      *  COMMENTS
     A                                 10  2'COMMENT 1'
     A                                      DSPATR(UL)
     A            D1CMT1        60O  B   + 2DSPATR(CS)
     A                                 11  2'COMMENT 2'
     A                                      DSPATR(UL)
     A            D1CMT2        60O  B   + 2DSPATR(CS)
     A                                 12  2'COMMENT 3'
     A                                      DSPATR(UL)
     A            D1CMT3        60O  B   + 2DSPATR(CS)
     A                                 13  2'COMMENT 4'
     A                                      DSPATR(UL)
     A            D1CMT4        60O  B   + 2DSPATR(CS)
      * SUB FILE TITLE----------------------
     A                                 17  3'DETAIL/BIN'
     A                                      DSPATR(RI)
     A                                 17 16'IAF PART #      WEIGHT(LB)   +
     A                                       BIN #    # OF BOX    +
     A                                       TOTAL QTY.'
     A                                      DSPATR(UL)
      * SUB FILE TITLE----------------------
     A                                 17  3'DETAIL/BIN'
     A                                      DSPATR(RI)
     A                                 17 16'IAF PART #      WEIGHT(LB)   +
     A                                       BIN #    # OF BOX    +
     A                                       TOTAL QTY.'
     A                                      DSPATR(UL)
     A* ----------------------------------------------------
     A          R FMT09
     A* ----------------------------------------------------
     A                                 23  2'ERROR'
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D9ERR         60A  O   + 2
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  5' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK '
     A                                   +10' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'SEND EDI'
     A                                   +10' F12 '
     A                                      DSPATR(RI)
     A                                   + 1'RETRIEVE FROM GPS'
     A                                 24 60'PAGE UP/DOWN'
     A                                      DSPATR(RI)
