     A***************************************************************
     A* * PROGRAM NAME. :INPUT OF LEVELLED PRODUCTION FIXED ORDERING FILE
     A*                  ACCOUNT BOOK OUTPUT PART NUMBER  *
     A* * PROGRAM ID. : AGAPW22. <DSPF>                              *
     A* * CREATE DATE. : SEP.25,'86.                                 *
     A* * AUTHOR.        : E.K                                       *
     A* *                       (INC."G.B.C.")                       *
     A***************************************************************
     A          R AGAPW221
     A*%%TS  SD  19961111  094110  AO          REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                      CF07
     A                                      BLINK
     A  99                                  ALARM
     A                                  1  3'* LEVEL PROD FIXED ORDERING FILE A-
     A                                      CCOUNT BOOK OUTPUT P/N INPUT *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AGAPW22'
     A                                  5 13'1. SELECT SECTION CODE FOLLOWING, -
     A                                      AND INPUT IT.'
     A            BMNCD          4Y 0B  5 70EDTCDE(4)
     A                                      DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  7 22'9999 ALL DEPT'
     A                                  8 22'0111 I A F'
     A                                  9 22'???? EACH SUPPLIER POINT'
     A**                                8 22'8907 COMPANY PURCHASING'
     A**                                7 48'8982 GIFU FACTORY'
     A**                                8 22'8974 ENA FACTORY'
     A**                                8 48'9032 KANI F1'
     A**                                9 22'8990 HEAD OFFICE FACTORY'
     A**                                9 48'9040 KANI F2'
     A**                               11 22'9431 KUMAMOTO FACTORY'
     A                                 13 13'2. INPUT IF YOU APPOINT RANGE OF P-
     A                                      ART NUMBER,'
     A            FROM          12A  B 14 64DSPATR(CS)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 14 58'FROM'
     A            TO            12A  B 16 64DSPATR(CS)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                 16 58'TO'
     A            ERRMSG        60A  O 22 18DSPATR(HI)
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A                                 24  8'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'SECTION CODE INQUIRY'
     A                                 24 47'CMD-7'
     A                                      DSPATR(RI)
