     A*%%TS  SD  20251114  134729  I0777       REL-V7R4M0  5770-WDS
     A** AGDPW01 *********************************
     A* IAF PRODUCTION PLACE OPERATION CALENDAR *
     A*                  S.YAMAGAMI 90.12.19 *
     A***********************************AGDPW01**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A**        R AGDPW011
     A*%%TS  SD  20250217  150314  I0777       REL-V7R4M0  5770-WDS
     A**                                    CF01(01)
     A**99                                  ALARM
     A**                                    BLINK
     A**                                    PUTOVR
     A**                                    KEEP
     A**                                1  2'TIME'
     A**                                1  7TIME
     A**                                1 19'* IAF PRODUCTION CALENDAR *'
     A**                                    DSPATR(RI)
     A**                                    DSPATR(UL)
     A**                                1 68'FMT AGDPW011'
     A**                                2  2'DATE'
     A**                                2  7DATE
     A**                                    EDTCDE(Y)
     A**          XTITL         19A  O  2 23
     A**                                5 16'OPTION'
     A**                                6 19' 1 '
     A**                                    DSPATR(RI)
     A**                                6 24'CALENDAR FILE:'
     A**          XFILE          8A  O  6 39COLOR(WHT)
     A**                               16 16'SELECT OPTION -->'
     A**          @NO1           1A  B 16 34DSPATR(CS)
     A**                                    OVRDTA
     A**02                                  DSPATR(PC)
     A**02                                  DSPATR(RI)
     A**                               22 11'ERROR'
     A**                                    OVRATR
     A**99                                  DSPATR(RI)
     A**99                                  DSPATR(BL)
     A*N99                                  DSPATR(ND)
     A**          MSG           60A  O 22 18
     A**                                    OVRATR
     A*N99                                  DSPATR(ND)
     A**                               24  7'F1:'
     A**                                    DSPATR(RI)
     A**                               24 11'EXIT'
     A*==== 2ND SCREEN =======
     A          R AGDPW012
     A*%%TS  SD  20251114  134729  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01(01)
     A**                                    CF02(02)
     A  99                                  ALARM
     A                                      BLINK
     A**                                    PUTOVR
     A**                                    KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'* IAF PRODUCTION CALENDAR *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AGDPW012'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            XTITL         19A  O  2 24
     A                                  4 22'CALENDAR FILE:'
     A            XFILE          8A  O  4 37COLOR(WHT)
     A**08N09                           4 22'CALENDAR FILE:'
     A**08N09     XFILE          8A  O  4 37COLOR(WHT)
     A**
     A            @NO1           1A  O  4 20
     A*N08N09                           4 24'SETTING NUMBER AUTO-HANDLING <FILE-
     A*                                      -AGDPP21>'
     A*N08 09                           4 24'USER OPERATION HANDLING <FILE -AGD-
     A**                                    PP31>'
     A                                  6 19'OPTION'
     A                                  7 22' 1 '
     A                                      DSPATR(RI)
     A                                  7 28'INQUIRY'
     A  90                              9 22' 2 '
     A                                      DSPATR(RI)
     A  90                              9 28'MAKING DATA'
     A  90                             11 22' 3 '
     A                                      DSPATR(RI)
     A  90                             11 28'CHANGE'
     A  90                             13 22' 4 '
     A                                      DSPATR(RI)
     A  90                             13 28'MAKING LIST'
     A  90 09                          15 22' 5 '
     A                                      DSPATR(RI)
     A  90 09                          15 28'INQUIRY OF ALL CUSTOMER AND FACTOR-
     A                                      IES'
     A                                 19 19'SELETCT OPTION -->'
     A            @NO2           1A  B 19 38DSPATR(CS)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A**03                                  OVRATR
     A                                 22 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  8'F1:'
     A                                      DSPATR(RI)
     A                                 24 12'EXIT'
     A***** 3 SCREEN * * * * *
     A          R AGDPW013
     A*%%TS  SD  20250217  150314  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF02
     A  99                                  ALARM
     A                                      BLINK
     A**                                    PUTOVR
     A**                                    KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'* IAF PRODUCTION CALENDAR *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AGDPW013'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            XTITL         19A  O  2 21
     A  08                              5  6'CALENDAR FILE:'
     A  08        XFILE          8A  O  5 21COLOR(WHT)
     A                                  8  6'INQUIRY'
     A                                 10 37'DATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            @HIZ           6Y 0B 12 37DSPATR(CS)
     A**                                    OVRDTA
     A                                      EDTCDE(Z)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A**03                                  OVRATR
     A                                 22 11'ERROR'
     A**                                    OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A**                                    OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  7'F1:'
     A                                      DSPATR(RI)
     A                                 24 11'EXIT'
     A                                 24 20'F2:'
     A                                      DSPATR(RI)
     A                                 24 24'BACK'
     A*
     A***** 4 SCREEN * * * * *
     A          R AGDPW014
     A*%%TS  SD  20211222  155852  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                      BLINK
     A**                                    PUTOVR
     A**                                    KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'* IAF PRODUCTION CALENDAR *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT AGDPW014'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            XTITL         19A  O  2 25
     A  08                              4  2'CALENDAR FILE:'
     A  08        XFILE          8A  O  4 17COLOR(WHT)
     A                                  4 26'NIGHT DUTY STATUS INST'
     A                                      DSPATR(UL)
     A                                  4 64'WORKING DAY'
     A                                      COLOR(YLW)
     A            @KAD           3Y 1O  4 76EDTCDE(1)
     A                                  5  2'TARGET DATE..:'
     A            @HIZ           6Y 0O  5 17
     A                                      EDTWRD('    .  ')
     A                                      COLOR(WHT)
     A                                  5 26'A:DAYTIME DUTY HOLIDAY'
     A                                  5 51'S:START DATE'
     A                                  5 65'1ST 10 DAY'
     A                                      COLOR(YLW)
     A            @JN1           3Y 1O  5 76EDTCDE(1)
     A                                  6 26'B:NIGHT DUTY HOLIDAY'
     A                                  6 51'E:EXIT DATE'
     A                                  6 65'2nd 10 DAY'
     A                                      COLOR(YLW)
     A            @JN2           3Y 1O  6 76EDTCDE(1)
     A                                  7 26'R:UNWORKINGDAY ATTENDANCE'
     A                                  7 65'3RD 10 DAY'
     A                                      COLOR(YLW)
     A            @JN3           3Y 1O  7 76EDTCDE(1)
     A                                  8 26'M:DURING UNWORKING NIGHT ATTENDANC-
     A                                      E'
     A                                  9  7'SUNDAY'
     A                                      DSPATR(RI)
     A**                                    OVRATR
     A                                  9 17'MONDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  9 26'TUESDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  9 35'WEDNESDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  9 46'THURSDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  9 57'FRIDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  9 66'SATURDAY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A            @YBI01         2Y 0O 10  9
     A                                      EDTCDE(4)
     A  11                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI02         2Y 0O 10 19
     A                                      EDTCDE(4)
     A  12                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI03         2Y 0O 10 29
     A                                      EDTCDE(4)
     A  13                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI04         2Y 0O 10 39
     A                                      EDTCDE(4)
     A  14                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI05         2Y 0O 10 49
     A                                      EDTCDE(4)
     A  15                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI06         2Y 0O 10 59
     A                                      EDTCDE(4)
     A  16                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI07         2Y 0O 10 69
     A                                      EDTCDE(4)
     A  17                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL01         1A  O 11  6
     A            @YOL01         1A  O 11  8
     A            @ZEN01         1A  O 11 10
     A            @RIN01         1A  O 11 12
     A            @HIL02         1A  O 11 16
     A            @YOL02         1A  O 11 18
     A            @ZEN02         1A  O 11 20
     A            @RIN02         1A  O 11 22
     A            @HIL03         1A  O 11 26
     A            @YOL03         1A  O 11 28
     A            @ZEN03         1A  O 11 30
     A            @RIN03         1A  O 11 32
     A            @HIL04         1A  O 11 36
     A            @YOL04         1A  O 11 38
     A            @ZEN04         1A  O 11 40
     A            @RIN04         1A  O 11 42
     A            @HIL05         1A  O 11 46
     A            @YOL05         1A  O 11 48
     A            @ZEN05         1A  O 11 50
     A            @RIN05         1A  O 11 52
     A            @HIL06         1A  O 11 56
     A            @YOL06         1A  O 11 58
     A            @ZEN06         1A  O 11 60
     A            @RIN06         1A  O 11 62
     A            @HIL07         1A  O 11 66
     A            @YOL07         1A  O 11 68
     A            @ZEN07         1A  O 11 70
     A            @RIN07         1A  O 11 72
     A            @YBI08         2Y 0O 12  9
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI09         2Y 0O 12 19
     A                                      EDTCDE(4)
     A  19                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI10         2Y 0O 12 29
     A                                      EDTCDE(4)
     A  20                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI11         2Y 0O 12 39
     A                                      EDTCDE(4)
     A  21                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI12         2Y 0O 12 49
     A                                      EDTCDE(4)
     A  22                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI13         2Y 0O 12 59
     A                                      EDTCDE(4)
     A  23                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI14         2Y 0O 12 69
     A                                      EDTCDE(4)
     A  24                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL08         1A  O 13  6
     A            @YOL08         1A  O 13  8
     A            @ZEN08         1A  O 13 10
     A            @RIN08         1A  O 13 12
     A            @HIL09         1A  O 13 16
     A            @YOL09         1A  O 13 18
     A            @ZEN09         1A  O 13 20
     A            @RIN09         1A  O 13 22
     A            @HIL10         1A  O 13 26
     A            @YOL10         1A  O 13 28
     A            @ZEN10         1A  O 13 30
     A            @RIN10         1A  O 13 32
     A            @HIL11         1A  O 13 36
     A            @YOL11         1A  O 13 38
     A            @ZEN11         1A  O 13 40
     A            @RIN11         1A  O 13 42
     A            @HIL12         1A  O 13 46
     A            @YOL12         1A  O 13 48
     A            @ZEN12         1A  O 13 50
     A            @RIN12         1A  O 13 52
     A            @HIL13         1A  O 13 56
     A            @YOL13         1A  O 13 58
     A            @ZEN13         1A  O 13 60
     A            @RIN13         1A  O 13 62
     A            @HIL14         1A  O 13 66
     A            @YOL14         1A  O 13 68
     A            @ZEN14         1A  O 13 70
     A            @RIN14         1A  O 13 72
     A            @YBI15         2Y 0O 14  9
     A                                      EDTCDE(4)
     A  25                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI16         2Y 0O 14 19
     A                                      EDTCDE(4)
     A  26                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI17         2Y 0O 14 29
     A                                      EDTCDE(4)
     A  27                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI18         2Y 0O 14 39
     A                                      EDTCDE(4)
     A  28                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI19         2Y 0O 14 49
     A                                      EDTCDE(4)
     A  29                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI20         2Y 0O 14 59
     A                                      EDTCDE(4)
     A  30                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI21         2Y 0O 14 69
     A                                      EDTCDE(4)
     A  31                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL15         1A  O 15  6
     A            @YOL15         1A  O 15  8
     A            @ZEN15         1A  O 15 10
     A            @RIN15         1A  O 15 12
     A            @HIL16         1A  O 15 16
     A            @YOL16         1A  O 15 18
     A            @ZEN16         1A  O 15 20
     A            @RIN16         1A  O 15 22
     A            @HIL17         1A  O 15 26
     A            @YOL17         1A  O 15 28
     A            @ZEN17         1A  O 15 30
     A            @RIN17         1A  O 15 32
     A            @HIL18         1A  O 15 36
     A            @YOL18         1A  O 15 38
     A            @ZEN18         1A  O 15 40
     A            @RIN18         1A  O 15 42
     A            @HIL19         1A  O 15 46
     A            @YOL19         1A  O 15 48
     A            @ZEN19         1A  O 15 50
     A            @RIN19         1A  O 15 52
     A            @HIL20         1A  O 15 56
     A            @YOL20         1A  O 15 58
     A            @ZEN20         1A  O 15 60
     A            @RIN20         1A  O 15 62
     A            @HIL21         1A  O 15 66
     A            @YOL21         1A  O 15 68
     A            @ZEN21         1A  O 15 70
     A            @RIN21         1A  O 15 72
     A            @YBI22         2Y 0O 16  9
     A                                      EDTCDE(4)
     A  32                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI23         2Y 0O 16 19
     A                                      EDTCDE(4)
     A  33                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI24         2Y 0O 16 29
     A                                      EDTCDE(4)
     A  34                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI25         2Y 0O 16 39
     A                                      EDTCDE(4)
     A  35                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI26         2Y 0O 16 49
     A                                      EDTCDE(4)
     A  36                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI27         2Y 0O 16 59
     A                                      EDTCDE(4)
     A  37                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI28         2Y 0O 16 69
     A                                      EDTCDE(4)
     A  38                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL22         1A  O 17  6
     A            @YOL22         1A  O 17  8
     A            @ZEN22         1A  O 17 10
     A            @RIN22         1A  O 17 12
     A            @HIL23         1A  O 17 16
     A            @YOL23         1A  O 17 18
     A            @ZEN23         1A  O 17 20
     A            @RIN23         1A  O 17 22
     A            @HIL24         1A  O 17 26
     A            @YOL24         1A  O 17 28
     A            @ZEN24         1A  O 17 30
     A            @RIN24         1A  O 17 32
     A            @HIL25         1A  O 17 36
     A            @YOL25         1A  O 17 38
     A            @ZEN25         1A  O 17 40
     A            @RIN25         1A  O 17 42
     A            @HIL26         1A  O 17 46
     A            @YOL26         1A  O 17 48
     A            @ZEN26         1A  O 17 50
     A            @RIN26         1A  O 17 52
     A            @HIL27         1A  O 17 56
     A            @YOL27         1A  O 17 58
     A            @ZEN27         1A  O 17 60
     A            @RIN27         1A  O 17 62
     A            @HIL28         1A  O 17 66
     A            @YOL28         1A  O 17 68
     A            @ZEN28         1A  O 17 70
     A            @RIN28         1A  O 17 72
     A            @YBI29         2Y 0O 18  9
     A                                      EDTCDE(4)
     A  39                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI30         2Y 0O 18 19
     A                                      EDTCDE(4)
     A  40                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI31         2Y 0O 18 29
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI32         2Y 0O 18 39
     A                                      EDTCDE(4)
     A  42                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI33         2Y 0O 18 49
     A                                      EDTCDE(4)
     A  43                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI34         2Y 0O 18 59
     A                                      EDTCDE(4)
     A  44                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI35         2Y 0O 18 69
     A                                      EDTCDE(4)
     A  45                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL29         1A  O 19  6
     A            @YOL29         1A  O 19  8
     A            @ZEN29         1A  O 19 10
     A            @RIN29         1A  O 19 12
     A            @HIL30         1A  O 19 16
     A            @YOL30         1A  O 19 18
     A            @ZEN30         1A  O 19 20
     A            @RIN30         1A  O 19 22
     A            @HIL31         1A  O 19 26
     A            @YOL31         1A  O 19 28
     A            @ZEN31         1A  O 19 30
     A            @RIN31         1A  O 19 32
     A            @HIL32         1A  O 19 36
     A            @YOL32         1A  O 19 38
     A            @ZEN32         1A  O 19 40
     A            @RIN32         1A  O 19 42
     A            @HIL33         1A  O 19 46
     A            @YOL33         1A  O 19 48
     A            @ZEN33         1A  O 19 50
     A            @RIN33         1A  O 19 52
     A            @HIL34         1A  O 19 56
     A            @YOL34         1A  O 19 58
     A            @ZEN34         1A  O 19 60
     A            @RIN34         1A  O 19 62
     A            @HIL35         1A  O 19 66
     A            @YOL35         1A  O 19 68
     A            @ZEN35         1A  O 19 70
     A            @RIN35         1A  O 19 72
     A            @YBI36         2Y 0O 20  9
     A                                      EDTCDE(4)
     A  46                                  DSPATR(RI)
     A**                                    OVRATR
     A            @YBI37         2Y 0O 20 19
     A                                      EDTCDE(4)
     A  47                                  DSPATR(RI)
     A**                                    OVRATR
     A            @HIL36         1A  O 21  6
     A            @YOL36         1A  O 21  8
     A            @ZEN36         1A  O 21 10
     A            @RIN36         1A  O 21 12
     A            @HIL37         1A  O 21 16
     A            @YOL37         1A  O 21 18
     A            @ZEN37         1A  O 21 20
     A            @RIN37         1A  O 21 22
     A                                 24  6'F1:'
     A                                      DSPATR(RI)
     A                                 24 10'EXIT'
     A                                 24 17'ENTR:'
     A                                      DSPATR(RI)
     A                                 24 23'BACK'
