      **** AH#PW55 ***************************************
      *    A-PICSかんばん異常発行予定リスト            *
      *    MSK.KUNIEDA   98.07.08                        *
      ************************************** AH#PW55 *****
     A                                      PRINT
     A                                      CHGINPDFT
     A          R AH#PW551
     A                                      CF01(01)
     A                                      CF05(05)
     A  99                                  ALARM
     A                                      BLINK KEEP
     A N99N98                               CSRLOC(@SLIN @SCLM)
     A            @SLIN          3  0H
     A            @SCLM          3  0H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'* A-PICS KANBAN ABNORMAL +
     A                                      ISSUE PLANING LIST **'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AH#PW55'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  4 10'1.DATA RANGE INPUT'
     A            @HY            4Y 0B  6 15DSPATR(CS) AUTO(RAB)
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A                                  6 20'-'
     A            @HM            2Y 0B  6 22DSPATR(CS) AUTO(RAB)
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A                                  6 25'-'
     A            @HD            2Y 0B  6 27DSPATR(CS) AUTO(RAB)
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A                                  6 31'  10 DAYS FROM  '
     A                                  9 10'2.OBJECT DATA INPUT'
     A            @TYPE          1   B 11 15DSPATR(CS)
     A  12                                  DSPATR(RI PC)
     A                                 11 24'A:1BOX/DAY LESS THAN'
     A                                 11 49'C:MORE THAN 3 BOX '
     A                                 12 24'B:1-3 BOX/DAY     '
     A                                 12 49'D:ALL RANGE '
     A                                 15 10'3.INPUT COEFFICIENT RATE'
     A            @KEISU         4Y 2B 17 15DSPATR(CS) EDTCDE(1)
     A                                      AUTO(RAB)
     A  13                                  DSPATR(RI PC)
     A                                 17 22'UNDER IRREGULAR ISUUE DATA'
     A                                 18 20'(DAILY SETTING BOX QTY * +
     A                                      COEFFICIENT RATE < PLANNED BOX +
     A                                      QTY'
     A                                 19 21'AND BARREL < PLANNED BOX QTY)'
     A                                 22 11'ERR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            @MSG          60O       +2
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  4'  EXIT    '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24'ISSUE OK  '
     A                                 24 35' CMD-5 '
     A                                      DSPATR(RI)
