     A*%%TS  SD  20041006  144029  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A* TCHK1 06/17/09 CHG LANPRT01 --> LANPRT04
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF03
     A                                      CF05
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20041006  144029  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 20'PRIORITY LIST WITH BZ INFORMATION'
     A                                      DSPATR(RI)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  6 13'# OF COPIES:'
     A                                      DSPATR(HI)
     A            D@CPY          2Y 0B  6 26DSPATR(CS)
     A                                      EDTCDE(4)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A            D@PRT          1A  B  9 22DSPATR(CS)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A                                  9 24'Blank=Printer C(paper with green b-
     A                                      ars)'
     A                                 10 24'1.LANPRT02(APICS)  2.LANPRT07(APIC-
     A                                      S)  3.LANPRT03(office)'
TCHK1A*                                11 24'4.LANPRT01(Group Leader area)'
TCHK1A                                 11 24'4.LANPRT04(Group Leader area)'
     A                                  9 13'Printer:'
     A                                      DSPATR(HI)
     A                                 12 24'5.Printer B'
     A                                 12 43'6.Printer in Computer room'
     A          R DSP99
     A  50                                  FRCDTA
     A  50                                  OVERLAY
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
