     A*** AH#PW80 ************************************
     A* ... A-PICS KANBAN PUBLICATION TOTALIZATION LIST  *
     A* ... DEPARTMENT CODE / DATE(YEAR,MONTH) APPOINTMENT. *
     A*       K.OKACHI               98.10.26        *
     A************************************ AH#PW80 ***
     A*%%EC
     A*                                     DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R AH#PW801
     A*%%TS  SD  19961021  133414  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('A-PICS KANBAN')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 18'* PUBLISHED A-PICS KANBAN TOTALI-
     A                                      ZATION LIST *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT AH#PW80'
     A                                  6 16'1. SECTION CODE'
     A            PBMON          4A  B  6 40DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  6 50'0111 - I A F'
     A**                                6 50'8982 - GIFU FACTORY'
     A**                                7 50'8974 - ENA FACTORY'
     A**                                8 50'8990 - HEAD OFFICE FACTORY'
     A**                                9 50'9032 - KANI FACTORY THE 1ST'
     A**                               10 50'9040 - KANI FACTORY THE 2ND'
     A**                               11 50'9245 - KANI FACTORY THE 3RD'
     A**                               12 50'9253 - KANI FACTORY THE 4TH'
     A**                               13 50'9431 - KUMAMOTO FACTORY'
     A**                               14 50'9024 - GOJYOGAWA FACTORY'
     A                                 17 16'2. DATE(YYYYMM)'
     A            PYYMM          6A  B 17 40DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 18 40'NOTE) ONLY THIS MONTH AND LAST MON-
     A                                      TH'
     A                                 19 46'CAN BE APPOINTED'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'MAKING LIST'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
