     A** AH#PW30 *******************************
     A* .. A-PICS KANBAN INVESTIGATION LIST    *
     A* I-HASADA                88.10.05       *
     A******************************* AH#PW30 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R AH#PW301
     A*%%TS  SD  19961017  170933  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                      CF05
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'** A-PICS KANBAN INVESTIGATION LIS-
     A                                      T **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AH#PW30'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 12'INTRAL COMPANY PART NO'
     A                                      DSPATR(RI)
     A                                  6 35'----->'
     A            HIN1           5A  B  6 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  6 49'-'
     A            HIN2           5A  B  6 51DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  6 57'-'
     A            HIN3           2A  B  6 59DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  9 12'INVESTIGATION DATE'
     A                                      DSPATR(RI)
     A                                  9 31'--------->'
     A            YMD            8Y 0B  9 43DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 12 12'INVESTIGATION TIME OR BIN'
     A                                      DSPATR(RI)
     A                                 12 38'-->'
     A            BIN            2Y 0B 12 43DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                 12 47'..TIME/BIN..'
     A                                 21 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 21 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 23  4'EXIT OR LIST PUBLICATION'
     A                                 23 30'CMD-1'
     A                                      DSPATR(RI)
     A                                 23 39'DATA INPUT'
     A                                 23 51'CMD-5'
     A                                      DSPATR(RI)
