     A** AJBPWP5 *************************
     A* DATA BASE REFERENCE PROGRAM LIST *
     A*   I-HASADA            87.05.21   *
     A************************* AJBPWP5 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R AJBPWP51
     A                                      CF01(01)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 23'  DATA BASE REFERENCE PROGRAM LIS+
     A                                      T  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPWP5'
      *
     A            JOBQ           1A  B 12 16DSPATR(CS)
     A                                 12 18'--> JOBQ ( 0 = SRT . 1 = JOB+
     A                                      Q1 . 2 = JOBQ2 )'
      *
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI BL)
     A  99        MSG           60A  O 22 18
      *
     A                                 24  4'CANCEL'
     A                                 24 15' CMD-1 ' DSPATR(RI)
     A                                 24 24'MAKING OK'
     A                                 24 39' CMD-5 ' DSPATR(RI)
