     A** AJBPW60 ***************************************
     A*  ..AS/400 IAF ATC<-->AOYAMA SOURCE TRANSFER..  *
     A*    I-HASADA              97.09.19              *
     A*************************************** AJBPW60 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R AJBPW601
     A                                      CF01(01)
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW601'
      *
     A                                  3 21'SRCFILE - ?CLSRC , ?RPGSRC'
     A                                  4 21'LIBRARY - IAFHSRC  '
      *
     A                                  6 21'1. SOURCE  ( RPG . CL . CMD . SORT-
     A                                       . NETWORK-JOB )'
     A                                  8 21'2. SOURCE  ( DDS . DSP . PRT )'
      *
     A            AANO           1A  B 11 21DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A                                 11 23'--> INPUT NO.'
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                 24 15' CMD-1' DSPATR(RI)
      *
     A          R AJBPW602
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW602'
      *
     A                                  4 21'( RPG . CL . CMD . SORT . NETWORK-
     A                                      -JOB )'
      *
     A            NO101          6A  B  6 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            NO102          6A  B  6 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            NO103          6A  B  6 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            NO104          6A  B  6 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            NO105          6A  B  6 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
      *
     A            NO106          6A  B  8 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            NO107          6A  B  8 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            NO108          6A  B  8 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            NO109          6A  B  8 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            NO110          6A  B  8 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
      *
     A            NO111          6A  B 10 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            NO112          6A  B 10 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            NO113          6A  B 10 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            NO114          6A  B 10 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            NO115          6A  B 10 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
      *
     A            NO116          6A  B 12 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            NO117          6A  B 12 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            NO118          6A  B 12 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            NO119          6A  B 12 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            NO120          6A  B 12 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
      *
     A            NO121          6A  B 14 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            NO122          6A  B 14 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            NO123          6A  B 14 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI PC)
     A            NO124          6A  B 14 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI PC)
     A            NO125          6A  B 14 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
      *
     A            NO126          6A  B 16 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            NO127          6A  B 16 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            NO128          6A  B 16 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            NO129          6A  B 16 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI PC)
     A            NO130          6A  B 16 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                 24 11' CMD-1 ' DSPATR(RI)
     A                                 24 23'PREVIOUS SCREEN'
     A                                 24 41' CMD-2 ' DSPATR(RI)
     A                                 24 53'TRANSFER OK'
     A                                 24 67' CMD-5 ' DSPATR(RI)
      *
     A          R AJBPW603
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW603'
      *
     A                                  4 21'( DDS . DSP . PRT )'
      *
     A            NO201          7A  B  6 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            NO202          7A  B  6 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            NO203          7A  B  6 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            NO204          7A  B  6 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            NO205          7A  B  6 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
      *
     A            NO206          7A  B  8 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            NO207          7A  B  8 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            NO208          7A  B  8 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            NO209          7A  B  8 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            NO210          7A  B  8 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
      *
     A            NO211          7A  B 10 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            NO212          7A  B 10 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A            NO213          7A  B 10 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            NO214          7A  B 10 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            NO215          7A  B 10 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
      *
     A            NO216          7A  B 12 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            NO217          7A  B 12 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            NO218          7A  B 12 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            NO219          7A  B 12 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            NO220          7A  B 12 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
      *
     A            NO221          7A  B 14 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            NO222          7A  B 14 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            NO223          7A  B 14 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI PC)
     A            NO224          7A  B 14 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI PC)
     A            NO225          7A  B 14 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
      *
     A            NO226          7A  B 16 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            NO227          7A  B 16 29DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            NO228          7A  B 16 41DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            NO229          7A  B 16 53DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI PC)
     A            NO230          7A  B 16 65DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                 24 11' CMD-1 ' DSPATR(RI)
     A                                 24 23'PREVIOUS SCREEN'
     A                                 24 41' CMD-2 ' DSPATR(RI)
     A                                 24 53'TRANSFER OK'
     A                                 24 67' CMD-5 ' DSPATR(RI)
