     A** AJBPW70 ***************************************
     A*  ..AS/400 IAF ATC<-->AOYAMA SOURCE TRANSFER..  *
     A*  ..SRCMBR.SRCFILE.LIBRARY                      *
     A*    I-HASADA                      2001.04.20    *
     A*************************************** AJBPW70 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R AJBPW701
     A                                      CF01(01)
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW701'
      *
     A                                  3 21'SRCFILE - IAFHSRC  '
     A                                  4 21'LIBRARY - IAFHSRC  '
      *
     A                                  6 21'1. SOURCE  ( RPG . CL . CMD . SORT-
     A                                       . NETWORK-JOB )'
     A                                  8 21'2. SOURCE  ( DDS . DSP . PRT )'
      *
     A            AANO           1A  B 11 21DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A                                 11 23'--> INPUT NO.'
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                 24 15' CMD-1' DSPATR(RI)
      *
     A          R AJBPW702
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF09
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW702'
      *
     A                                  3  4'SRCFILE-IAFHSRC'
     A                                  4  4'LIBRARY-IAFHSRC'
      *
     A                                  4 21'( RPG . CL . CMD . SORT . NETWORK-
     A                                      -JOB )'
      *
     A                                  6  5'SRCMBR'
     A                                  6 18'SRCFILE'
     A                                  6 31'LIBRARY'
     A                                  6 44'SRCMBR'
     A                                  6 57'SRCFILE'
     A                                  6 70'LIBRARY'
      *
     A            IMB01         10A  B  8  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            IMB02         10A  B 10  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            IMB03         10A  B 12  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            IMB04         10A  B 14  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            IMB05         10A  B 16  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            IMB06         10A  B 18  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            IMB07         10A  B  8 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            IMB08         10A  B 10 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            IMB09         10A  B 12 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            IMB10         10A  B 14 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            IMB11         10A  B 16 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            IMB12         10A  B 18 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
      *
     A            ISR01         10A  B  8 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            ISR02         10A  B 10 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            ISR03         10A  B 12 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            ISR04         10A  B 14 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            ISR05         10A  B 16 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            ISR06         10A  B 18 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            ISR07         10A  B  8 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            ISR08         10A  B 10 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
     A            ISR09         10A  B 12 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            ISR10         10A  B 14 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            ISR11         10A  B 16 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI PC)
     A            ISR12         10A  B 18 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI PC)
      *
     A            ILB01         10A  B  8 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
     A            ILB02         10A  B 10 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            ILB03         10A  B 12 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            ILB04         10A  B 14 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            ILB05         10A  B 16 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI PC)
     A            ILB06         10A  B 18 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
     A            ILB07         10A  B  8 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI PC)
     A            ILB08         10A  B 10 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI PC)
     A            ILB09         10A  B 12 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI PC)
     A            ILB10         10A  B 14 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI PC)
     A            ILB11         10A  B 16 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI PC)
     A            ILB12         10A  B 18 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI PC)
      *
     A                                  8 15'-'
     A                                 10 15'-'
     A                                 12 15'-'
     A                                 14 15'-'
     A                                 16 15'-'
     A                                 18 15'-'
      *
     A                                  8 28'-'
     A                                 10 28'-'
     A                                 12 28'-'
     A                                 14 28'-'
     A                                 16 28'-'
     A                                 18 28'-'
      *
     A                                  8 54'-'
     A                                 10 54'-'
     A                                 12 54'-'
     A                                 14 54'-'
     A                                 16 54'-'
     A                                 18 54'-'
      *
     A                                  8 67'-'
     A                                 10 67'-'
     A                                 12 67'-'
     A                                 14 67'-'
     A                                 16 67'-'
     A                                 18 67'-'
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                   + 2' CMD-1 ' DSPATR(RI)
     A                                   + 5'BACK'
     A                                   + 2' CMD-2 ' DSPATR(RI)
     A                                   + 5'TRANSFER'
     A                                   + 2' CMD-5 ' DSPATR(RI)
     A                                   + 5'HULFT TRN'
     A                                   + 2' CMD-9 ' DSPATR(RI)
      *
     A          R AJBPW703
     A                                      CF01
     A                                      CF02
     A                                      CF05
     A                                      CF09
     A                                      BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A  98                              1 21'  **  AS/400   IAF SOURCE TRANSFER-
     A                                        **  '
     A                                      DSPATR(RI UL)
     A N98                              1 21'  **  AS/400   AOYAMA SOURCE TRANS-
     A                                      FER  **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AJBPW703'
      *
     A                                  3  4'SRCFILE-IAFHSRC'
     A                                  4  4'LIBRARY-IAFHSRC'
      *
     A                                  4 21'( DDS . DSP . PRT )'
      *
     A                                  6  5'SRCMBR'
     A                                  6 18'SRCFILE'
     A                                  6 31'LIBRARY'
     A                                  6 44'SRCMBR'
     A                                  6 57'SRCFILE'
     A                                  6 70'LIBRARY'
      *
     A            IMB01         10A  B  8  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A            IMB02         10A  B 10  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI PC)
     A            IMB03         10A  B 12  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A            IMB04         10A  B 14  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI PC)
     A            IMB05         10A  B 16  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI PC)
     A            IMB06         10A  B 18  4DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A            IMB07         10A  B  8 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(RI PC)
     A            IMB08         10A  B 10 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(RI PC)
     A            IMB09         10A  B 12 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(RI PC)
     A            IMB10         10A  B 14 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(RI PC)
     A            IMB11         10A  B 16 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A            IMB12         10A  B 18 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
      *
     A            ISR01         10A  B  8 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI PC)
     A            ISR02         10A  B 10 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI PC)
     A            ISR03         10A  B 12 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI PC)
     A            ISR04         10A  B 14 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(RI PC)
     A            ISR05         10A  B 16 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(RI PC)
     A            ISR06         10A  B 18 17DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(RI PC)
     A            ISR07         10A  B  8 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(RI PC)
     A            ISR08         10A  B 10 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(RI PC)
     A            ISR09         10A  B 12 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI PC)
     A            ISR10         10A  B 14 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(RI PC)
     A            ISR11         10A  B 16 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(RI PC)
     A            ISR12         10A  B 18 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(RI PC)
      *
     A            ILB01         10A  B  8 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(RI PC)
     A            ILB02         10A  B 10 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(RI PC)
     A            ILB03         10A  B 12 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  27                                  DSPATR(RI PC)
     A            ILB04         10A  B 14 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  28                                  DSPATR(RI PC)
     A            ILB05         10A  B 16 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  29                                  DSPATR(RI PC)
     A            ILB06         10A  B 18 30DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  30                                  DSPATR(RI PC)
     A            ILB07         10A  B  8 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(RI PC)
     A            ILB08         10A  B 10 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(RI PC)
     A            ILB09         10A  B 12 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(RI PC)
     A            ILB10         10A  B 14 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  34                                  DSPATR(RI PC)
     A            ILB11         10A  B 16 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  35                                  DSPATR(RI PC)
     A            ILB12         10A  B 18 69DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  36                                  DSPATR(RI PC)
      *
     A                                  8 15'-'
     A                                 10 15'-'
     A                                 12 15'-'
     A                                 14 15'-'
     A                                 16 15'-'
     A                                 18 15'-'
      *
     A                                  8 28'-'
     A                                 10 28'-'
     A                                 12 28'-'
     A                                 14 28'-'
     A                                 16 28'-'
     A                                 18 28'-'
      *
     A                                  8 54'-'
     A                                 10 54'-'
     A                                 12 54'-'
     A                                 14 54'-'
     A                                 16 54'-'
     A                                 18 54'-'
      *
     A                                  8 67'-'
     A                                 10 67'-'
     A                                 12 67'-'
     A                                 14 67'-'
     A                                 16 67'-'
     A                                 18 67'-'
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                   + 2' CMD-1 ' DSPATR(RI)
     A                                   + 5'BACK'
     A                                   + 2' CMD-2 ' DSPATR(RI)
     A                                   + 5'TRANSFER'
     A                                   + 2' CMD-5 ' DSPATR(RI)
     A                                   + 5'HULFT TRN'
     A                                   + 2' CMD-9 ' DSPATR(RI)
