     A** AJEPW01 ********************************
     A* ..WORK STATION M/F UPDATE *
     A* A-IDOTA                  87.06.16       *
     A******************************** AJEPW01 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A*                                     IGCCNV(CF24 24)
     A                                      PRINT
     A*
     A*---------------------------*
     A* ... SCREEN-2  *
     A*---------------------------*
     A          R AJEPW012
     A*%%TS  SD  19961017  173014  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT AJEPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            WKINO         26A  O  4 51
     A                                  1 25'WORK STATION M/F UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  7 17'UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  7 38'WS-NO'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  7 58'FACTORY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 11 11'<<<UPDATE INSTRUCTION>>>'
     A                                 12 11'<0 = CANCEL>'
     A                                 13 11'<1 = CHANGE>'
     A                                 14 11'<2 = ADD   >'
     A                                 15 11'<<<<<>>>>>'
     A                                 11 52'<<<FACTORY INSTRUCTION>>>'
     A                                 12 52'<2 = IAF >'
     A                                 13 52'<<<<<>>>>>'
     A            MENT           1A  B  9 20DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            H4WSNO         2A  B  9 40DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            WKOTY          1A  B  9 61DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 21 18
     A                                 23  4'EXIT'
     A                                 23 15'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*---------------------------*
     A* ... SCREEN-3  *
     A*---------------------------*
     A          R AJEPW013
     A*%%TS  SD  19961017  173014  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT AJEPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 25'WORK STATION M/F UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  4  9'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 21'WS-NO'
     A                                      DSPATR(UL)
     A                                  4 31'FACTORY'
     A                                      DSPATR(UL)
     A            MENT           1A  O  6  9
     A                                  6 11'-'
     A            CMNT           6A  O  6 13
     A            H4WSNO         2A  O  6 23
     A            KOMT           8A  O  6 31
     A                                  9  5'WS KIND'
     A                                      DSPATR(UL)
     A                                 10  2'K= KANA'
     A                                 11  2'G= KANJI'
     A                                  9 16'KANA OUTQ'
     A*                                 9 16'OUTQ     '
     A                                      DSPATR(UL)
     A                                  9 26'KANJI OUTQ'
     A                                      DSPATR(UL)
     A                                  9 38'DEVICE ADDRESS'
     A                                      DSPATR(UL)
     A                                  9 53'DEVICE'
     A                                      DSPATR(UL)
     A                                  9 61'MODEL'
     A                                      DSPATR(UL)
     A                                  9 67'CONTROL DEVICE'
     A                                      DSPATR(UL)
     A            H4WSTY         1A  B 11 11DSPATR(CS)
     A*           H4WSTY         1A  O 11 11
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            H4SPLF         7A  B 11 16DSPATR(CS)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            H4SPIG        10A  B 11 26DSPATR(CS)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            H4DADD         6A  B 11 41DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            H4DEVD         4A  B 11 54DSPATR(CS)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            H4MDEL         4A  B 11 61DSPATR(CS)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            H4CLTU         7A  B 11 71DSPATR(CS)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A*                                13  4'SETUP DEPARTMENT (KANJI)          -
     A*                                          (KANA)         '
     A                                 13  4'SETUP DEPARTMENT       '
     A                                      DSPATR(UL)
     A                                 13 61'FOR MSGQ'
     A                                      DSPATR(UL)
     A                                 13 73'PRT DEV'
     A                                      DSPATR(UL)
     A                                 14  4'CODE'
     A            H4BSCD         2A  B 15  4DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 15  7'--'
     A*           H4BSYG        30O  B 15 10DSPATR(CS)
     A* 14                                  DSPATR(RI)
     A* 14                                  DSPATR(PC)
     A*           H4BSYO        15A  B 15 43DSPATR(CS)
     A            H4BSYO        15A  B 15 10DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            H4PMSG         2A  B 15 65DSPATR(CS)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            H4OUTQ         2A  B 15 75DSPATR(CS)
     A  81                                  DSPATR(RI)
     A  81                                  DSPATR(PC)
     A  17                             17  6'WS-ADDRESS'
     A                                      DSPATR(UL)
     A  17                             17 18'KEYBOARD'
     A                                      DSPATR(UL)
     A  17        H4ADRS         6A  B 19  7DSPATR(CS)
     A  17 18                               DSPATR(RI)
     A  17 18                               DSPATR(PC)
     A  17        H4WKBD         5A  B 19 19DSPATR(CS)
     A  17 19                               DSPATR(RI)
     A  17 19                               DSPATR(PC)
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 21 18
     A                                 23  4'KEY INPUT'
     A                                 23 15' CMD-3 '
     A                                      DSPATR(RI)
     A                                 23 24'UPDATE OK'
     A                                 23 35' CMD-5 '
     A                                      DSPATR(RI)
