      ** AJSPW70 *********************************
      * ACTUAL PLATING FILE ETERNITY DELETE      *
      * FILE ID.         : AJSPW70.   <DSPF>     *
      * CREATE DATE.     : 1997/MAR/19.          *
      * AUTHOR.          : S.OHTAKE.             *
      ********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AJSPW701
     A*%%TS  SD  19961113  175915  NIWA        REL-V3R0M5  5763-PW1
     A  99                                  ALARM
     A                                      CF01(01)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 23'ACTUAL PLATING FILE ETERNITY DELET-
     A                                      E'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AJSPW701'
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  5 11'1'
     A                                      DSPATR(RI)
     A                                  5 13'DELETE PLATING / DACRODIZING -
     A                                      PLATING ADMITTED ACTUAL DATA'
     A                                  7 11'2'
     A                                      DSPATR(RI)
     A                                  7 13'DELETE PLATING / DACRODIZING -
     A                                      PLATING DISCHARGED ACTUAL DATA'
     A                                  9 11'3'
     A                                      DSPATR(RI)
     A                                  9 13'DELETE PLATING / DACRODIZING -
     A                                      PLATING BREAKDOWN ACTUAL DATA'
     A                                 11 11'4'
     A                                      DSPATR(RI)
     A                                 11 13'DELETE PLATING / DACRODIZING -
     A                                      PLATING OPERATION ACTUAL DATA'
     A                                 13 11'5'
     A                                      DSPATR(RI)
     A                                 13 13'DELETE OF ALL THE ACTUAL DATA -
     A                                      (ABOVE 1,2,3,4)'
     A            TVBAN          1A  B 16 11DSPATR(CS)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 16 14'<-INPUT NO'
     A  99                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99                             22 18'CHANGE INPUT NUMBER.'
     A                                 24  8'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A          R AJSPW702
     A*%%TS  SD  19961113  175915  NIWA        REL-V3R0M5  5763-PW1
     A  99                                  ALARM
     A                                      CF03(03)
     A                                      CF05(05)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 18' DELETE PLATING / DACRODIZING -
     A                                      PLATING ADMITTED ACTUAL DATA '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AJSPW702'
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 36'ACTUAL ADMITTED'
     A                                      DSPATR(UL)
     A                                      DSPATR(BL)
     A                                  6 11'INPUT ENTERNITY DELETE DATE -->'
     A            TVTOHZ         8A  B  6 62DSPATR(CS)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                  8 11'INPUT SEQUENCE NO.'
     A                                  9 11'OF THE FIRST TAPE SAVING TO THIS T-
     A                                      IME -->'
     A            TVTOJN         2Y 0B  9 62DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A                                 15 15'NOTE) ALL DATA BEFORE INPUT DATE A-
     A                                      RE OBJECT.'
     A                                 18 21'IT''S ALSO DELETED DATA OF INPUT D-
     A                                      ATE'
     A  99                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ER702         60A  O 22 18
     A                                 24  2'PREVIOUS SCREEN'
     A                                 24 18'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'EXECUTION OK'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
     A          R AJSPW703
     A  99                                  ALARM
     A                                      CF03(03)
     A                                      CF05(05)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('  :  :  ')
     A                                  2 18' DELETE PLATING / DACRODIZING -
     A                                      PLATING DISCHARGED ACTUAL DATA '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AJSPW703'
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 36'ACTUAL DISCHARGED'
     A                                      DSPATR(UL)
     A                                      DSPATR(BL)
     A                                  6 11'INPUT ENTERNITY DELETE DATE -->'
     A            TVHIHZ         8A  B  6 62DSPATR(CS)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A                                  8 11'INPUT SEQUENCE NO.'
     A                                  9 11'OF THE FIRST TAPE SAVING TO THIS T-
     A                                      IME -->'
     A            TVHIJN         2Y 0B  9 62DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A                                 15 15'NOTE)ALL DATA BEFORE INPUT DATE AR-
     A                                      E OBJECT.'
     A                                 17 20'IT''S ALSO DELETED DATA OF INPUT -
     A                                      DATE'
     A  99                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ER703         60A  O 22 18
     A                                 24  3'PREVIOUS SCREEN'
     A                                 24 19'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 25'EXECUTION OK'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
     A          R AJSPW704
     A*%%TS  SD  19961113  175915  NIWA        REL-V3R0M5  5763-PW1
     A  99                                  ALARM
     A                                      CF03(03)
     A                                      CF05(05)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 18' DELETE PLATING / DACRODIZING -
     A                                      PLATING BREAKDOWN ACTUAL DATA '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AJSPW704'
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 36'ACTUAL BREAKDOWN'
     A                                      DSPATR(UL)
     A                                      DSPATR(BL)
     A                                  6 11'INPUT ENTERNITY DELETE DATE -->'
     A            TVBRHZ         8A  B  6 62DSPATR(CS)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                  8 11'INPUT SEQUENCE NO.'
     A                                  9 11'OF THE FIRST TAPE SAVING TO THIS T-
     A                                      IME -->'
     A            TVBRJN         2Y 0B  9 62DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A                                 15 15'NOTE) ALL DATA BEFORE INPUT DATE A-
     A                                      RE OBJECT.'
     A                                 18 21'IT''S ALSO DELETED DATA OF INPUT D-
     A                                      ATE'
     A  99                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ER704         60A  O 22 18
     A                                 24  2'PREVIOUS SCREEN'
     A                                 24 18'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'EXECUTION OK'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
     A          R AJSPW705
     A  99                                  ALARM
     A                                      CF03(03)
     A                                      CF05(05)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('  :  :  ')
     A                                  2 18' DELETE PLATING / DACRODIZING -
     A                                      PLATING OPERATION ACTUAL DATA '
     A                                      DSPATR(RI)
     A                                  1 68'FMT AJSPW705'
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTWRD('  :  :  ')
     A                                  4 36'ACTUAL OPERATION'
     A                                      DSPATR(UL)
     A                                      DSPATR(BL)
     A                                  6 11'INPUT ENTERNITY DELETE DATE -->'
     A            TVOPHZ         8A  B  6 62DSPATR(CS)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A                                  8 11'INPUT SEQUENCE NO.'
     A                                  9 11'OF THE FIRST TAPE SAVING TO THIS T-
     A                                      IME -->'
     A            TVOPJN         2Y 0B  9 62DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A                                 15 15'NOTE)ALL DATA BEFORE INPUT DATE AR-
     A                                      E OBJECT.'
     A                                 17 20'IT''S ALSO DELETED DATA OF INPUT -
     A                                      DATE'
     A  99                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ER705         60A  O 22 18
     A                                 24  3'PREVIOUS SCREEN'
     A                                 24 19'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 25'EXECUTION OK'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
