     A*** AJSPW40 *****************************
     A* * SCREEN OF FA M/F MAKING (ON OCCASION)
     A* * C:N.HAYAKAWA            90.05.08    *
     A****************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AJSPW401
     A*%%TS  SD  19961016  154313  NIWA        REL-V3R0M5  5763-PW1
     A                                      CF01(01)
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'* FA M/F MAKING (ON OCCASION) *'
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'AJSPW40'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 22'"PRACTICAL VALUE" IN FA M/F DOES N-
     A                                      OT CHANGE'
     A                                  8 22'IN THIS HANDLING.'
     A                                 10 22'IF CALCULATED FIELD OF PLATING C-
     A                                      OEFFICIENT '
     A                                 12 22'IS CHANGED, ONLY "THEORY VALUE" +
     A                                        CHANGES.'
     A                                 24  8'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
