     A*%%TS  SD  20230616  104316  I0777       REL-V7R3M0  5770-WDS
     A**AKAPW22 ****************************************************
     A* * PROGRAM NAME. : PART WITHDRAWAL KANBAN M/F INQUIRY     * *
     A* * PROGRAM ID. : AKAPW22 <DSPF>                             * *
     A* * CREATE DATE. : DEC.13,'86.                               * *
     A* * AUTHOR.        : CHIEF OF G.B.C                          * *
     A*
     A* TCHK1 05/19/11 ADD SAFETY INVENTORY
     A* TCHK2 08/11/11 ADD F2(PREVIOUS) IN 1ST SCREEN
     A*----------+-----+----------+-----------------------------------*
     A*2021.03.24|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     A*          |     |          |          EXPANSION OF THE "KANBAN"*
     A******************************************************* AKAPW22**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AKAPW221
     A*%%TS  SD  20230616  104316  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('THE FOURTH SCREEN')
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      PUTOVR
     A                                      KEEP
     A                                  1 21'* PART WITHDRAWAL KANBAN M/F INQUI-
     A                                      RY *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AKAPW221'
     A                                  2 68'DATE'
     A                                  2 73DATE
     A                                      EDTCDE(Y)
     A                                  3 68'TIME'
     A                                  3 73TIME
     A                                  3  2'PART NUMBER'
     A            SHIN          14A  O  3 14OVRDTA
     A                                  5  2'KANBAN ADJUSTMENT'
     A                                      DSPATR(RI)
     A                                  6  2' ALL '
     A                                      DSPATR(UL)
     A                                  6  8' MIN '
     A                                      DSPATR(UL)
     A                                  6 14' MAX '
     A                                      DSPATR(UL)
     A                                  5 21'HAND-'
     A                                  6 21' LING'
     A                                      DSPATR(UL)
     A                                  5 27'KANBAN'
     A                                  6 27'SHEETS'
     A                                      DSPATR(UL)
     A                                  5 34'REASONS'
     A                                  6 35'CODE'
     A                                      DSPATR(UL)
     A                                  5 43'CALCULATION'
     A                                  6 41'PER DAY NUMBER'
     A                                      DSPATR(UL)
     A                                  5 56'FIXED PER'
     A                                  6 56'DAY NUMBER'
     A                                      DSPATR(UL)
     A*                                 5 67'ACCOMMODATED'
     A                                  6 67'QPC-UNIT COLOR'
     A                                      DSPATR(UL)
     A            L6KALL         5Y 0O  7  2EDTCDE(3)
     A                                      OVRDTA
     A            L6KMIN         5Y 0O  7  8EDTCDE(3)
     A                                      OVRDTA
     A            L6KMAX         5Y 0O  7 14EDTCDE(3)
     A                                      OVRDTA
     A            L6SRMS         5Y 0O  7 21EDTCDE(3)
     A                                      OVRDTA
     A            WKMAX          5Y 0O  7 28EDTCDE(3)
     A                                      OVRDTA
     A            KSKBN          1Y 0O  7 37OVRDTA
     A            L6KSSU         9Y 0O  7 43EDTCDE(1)
     A                                      OVRDTA
     A            L6KTSU         9Y 0O  7 55EDTCDE(1)
     A                                      OVRDTA
     A            L6SYOS         5Y 0O  7 67EDTCDE(1)
     A                                      OVRDTA
     A            L6SYOT         1A  O  7 74OVRDTA
     A                                  9  2'REASONS FOR ISSUE'
     A                                      DSPATR(UL)
     A            L6HSYU         1A  O  7 78OVRDTA
     A            L6HSNM        12A  O  8 69OVRDTA
     A******                                COLOR(WHT)
     A            L6STI1         2Y 0O 10  3OVRDTA
     A            SETNM         16A  O 10  6OVRDTA
     A                                  9 24'MAX'
     A                                      DSPATR(UL)
     A            L6MAXH         3Y 0O 10 23EDTCDE(Q)
     A                                      OVRDTA
     A                                  9 29'LOT'
     A                                      DSPATR(UL)
     A            L6LOTO         2Y 0O 10 30EDTCDE(4)
     A                                      OVRDTA
     A                                  9 35'L.T'
     A                                      DSPATR(UL)
     A            L6LTIM         3Y 1O 10 34EDTCDE(4)
     A                                      OVRDTA
     A                                  9 40'COEFFICIENT'
     A                                      DSPATR(UL)
     A            L6KEIS         3Y 2O 10 44EDTCDE(4)
     A                                      OVRDTA
     A                                  9 53'KANBAN TYPE'
     A                                      DSPATR(UL)
     A            L6KCD1         1A  O 10 53OVRDTA
     A                                 10 55'-'
     A            L6KCD2         1A  O 10 57OVRDTA
     A            KCDNM         20A  O 10 59OVRDTA
     A                                 12  2'PAPER'
     A                                      DSPATR(UL)
     A            L6YOSI         4A  O 13  3OVRDTA
     A                                 11 10'DRAWING'
     A                                 12 11'INST.'
     A                                      DSPATR(UL)
     A            L6ZMEN         1A  O 13 13OVRDTA
     A                                 12 21'SORT INST'
     A                                      DSPATR(UL)
     A            L6SHIY         2Y 0O 13 24EDTCDE(Z)
     A                                      OVRDTA
     A                                 12 32'PICK-UP CONDITION'
     A                                      DSPATR(UL)
     A                                 13 32'1-1'
     A            L6JOK1         2A  O 13 36OVRDTA
     A            JNM1          16A  O 13 39OVRDTA
     A                                 14 32'1-2'
     A            L6JOK2         2A  O 14 36OVRDTA
     A            JNM2          16A  O 14 39OVRDTA
     A                                 15 32'1-3'
     A            L6JOK3         2A  O 15 36OVRDTA
     A            JNM3          16A  O 15 39OVRDTA
     A                                 12 57'ASSEMBLED FORM CONDITION'
     A                                      DSPATR(UL)
     A                                 13 57'1-1'
     A            L6JOK4         2A  O 13 61OVRDTA
     A            JNM4          16A  O 13 64OVRDTA
     A                                 14 57'2-1'
     A            L6JOK5         2A  O 14 61OVRDTA
     A            JNM5          16A  O 14 64OVRDTA
     A                                 15 57'2-2'
     A            L6JOK6         2A  O 15 61OVRDTA
     A            JNM6          16A  O 15 64OVRDTA
     A                                 16 57'2-3'
     A            L6JOK7         2A  O 16 61OVRDTA
     A            JNM7          16A  O 16 64OVRDTA
     A                                 14  2'REMARKS COLUMN'
     A                                      DSPATR(UL)
     A            L6BIKO        20A  O 15  2OVRDTA
     A                                 16 26'PRESENT'
     A                                 17 26'PROCESS  TYPE BD'
     A                                      DSPATR(UL)
     A                                 20 25'LOCATION'
     A                                      DSPATR(RI)
     A            ATOK2          8A  O 18 25OVRDTA
     A            L6ATYP         1A  O 18 36OVRDTA
     A            L6ATOH         1Y 0O 18 41OVRDTA
     A            NMA           18A  O 19 25OVRDTA
     A            ATKR           9A  O 20 34OVRDTA
     A                                 16  2'PRECEDING'
     A                                 17  3'PROCESS  TYPE  BD'
     A                                      DSPATR(UL)
     A                                 20  2'LOCATION'
     A                                      DSPATR(RI)
     A            MAEK2          8A  O 18  2OVRDTA
     A            L6MTYP         1A  O 18 13OVRDTA
     A            L6MAEH         2Y 0O 18 18OVRDTA
     A            NMB           18A  O 19  2OVRDTA
     A            MTKR           9A  O 20 11OVRDTA
     A                                 17 44'EFFECTIVE DATE-BIN'
     A                                      DSPATR(UL)
     A            L6UKHZ         8Y 0O 18 47EDTWRD('    .  .  ')
     A                                      OVRDTA
     A            L6UBIN         2Y 0O 18 59EDTCDE(4)
     A                                      OVRDTA
     A                                 17 64'LAPSE DATE-BIN'
     A                                      DSPATR(UL)
     A            L6STHZ         8Y 0O 18 63EDTWRD('    .  .  ')
     A                                      OVRDTA
     A            L6SBIN         2Y 0O 18 75EDTCDE(4)
     A                                      OVRDTA
     A                                 24  4'EXIT'
     A                                 24  9'ENTER'
     A                                      DSPATR(RI)
     A                                 24 17'KEY INPUT'
     A                                 24 27'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 35'SAFETY INVENTORY'
     A                                 24 52'CMD-4'
     A                                      DSPATR(RI)
     A                                 24 60'PREVIOUS'
     A                                 24 69'CMD-2'
     A                                      DSPATR(RI)
