     A*** AKAPW2Z ******************************************
     A*  DOWNLOAD PROCESS MASTER BY MACHINE#               *
     A*                                                    *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A*
     A          R FMT010
     A                                      OVERLAY
     A                                      CF01
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' DOWNLOAD PROCESS MASTER -
     A                                      BY MACHINE# '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
      *
     A                                  7 33'MACHINE#:'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            F1MCN#         3A  B  7 43
     A                                      DSPATR(HI)
     A  41                                  DSPATR(RI BL)
     A
     A*
     A  49                             23  2'Error'
     A  49                                  DSPATR(RI BL)
     A  49        MSG           60A  O 23  8
     A  49                                  DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 13'F5:Create data'
     A                                      DSPATR(RI)
