     A*** AKAPW50 ******************
     A* BOX COLOR CODE INQUIRY
     A* A.IDOTA 95.09.11 *
     A******************* AKAPW50 **
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A**************
     A* * SCREEN-1 *
     A**************
     A          R AKAPW501
     A                                      TEXT('THE FIRST SCREEN')
     A                                      PUTOVR
     A                                      KEEP
     A                                  1 27'* BOX COLOR CODE INQUIRY *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6 28'BOX COLOR'
     A                                      DSPATR(RI)
     A                                  6 46'SIGN'
     A                                      DSPATR(RI)
     A                                  8 28'PEACH(PINK)'
     A                                  9 28'YELLOW'
     A                                 10 28'YELLOWISH GREEN'
     A                                 11 28'REDDISH BROWN'
     A                                 12 28'BLACK'
     A                                 13 28'GREEN'
     A                                 14 28'RED'
     A                                 15 28'BROWN'
     A                                 16 28'BLUE'
     A                                 17 28'WHITE'
     A                                 18 28'ORANGE'
     A                                  8 47'P'
     A                                  9 47'Y'
     A                                 10 47'G'
     A                                 11 47'A'
     A                                 12 47'K'
     A                                 13 47'M'
     A                                 14 47'R'
     A                                 15 47'C'
     A                                 16 47'B'
     A                                 17 47'W'
     A                                 18 47'O'
     A                                 24  4'PREVIOUS SCREEN'
     A                                 24 21'ENTER'
     A                                      DSPATR(RI)
