     A*%%TS  SD  20041115  114246  TEST        REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R SFL01                     SFL
     A*%%TS  SD  20041115  114246  TEST        REL-V5R1M0  5722-WDS
     A            S@PRT1         5   B  5  9DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A            S@PRT2         5   B  5 15DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            S@PRT3         2   B  5 21DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            S@WP11         5   O  5 26
     A            S@WP12         5   O  5 32
     A            S@WP13         2   O  5 38
     A            S@WP21         5   O  5 43
     A            S@WP22         5   O  5 49
     A            S@WP23         2   O  5 55
     A            S@WP31         5   O  5 60
     A            S@WP32         5   O  5 66
     A            S@WP33         2   O  5 72
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20041115  114246  TEST        REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A            #RCNO          4  0H      SFLRCDNBR
     A            #PGM           8   O  1  2
     A                                  1 21'** Rolling Washer Retrieval Kanban-
     A                                      s **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4  9'Part Number' DSPATR(HI)
     A                                  4 26'Washer'      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
