     A*%%TS  SD  20030603  142942  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01
     A                                      CF05
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20030603  142942  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A            #PGM           8   O  1  2
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  1 25'** ISSUE WASHER KANBANS **'
     A                                      DSPATR(RI)
     A                                  4 11'LOCATION CODE:'
     A                                                 DSPATR(HI)
     A            D@LOC1         1   B  4 26DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A            D@LOC2         2   B  4 28DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            D@LOC3         2   B  4 31DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            D@LOC4         1   B  4 34DSPATR(CS)
     A  61                                  DSPATR(RI)
     A                                  6 11'PART #:'  DSPATR(HI)
     A            D@PRT1         5   B  6 26DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A            D@PRT2         5   B  6 32DSPATR(CS)
     A  62                                  DSPATR(RI)
     A            D@PRT3         2   B  6 38DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                  8 11'QTY/CONTAINER:' DSPATR(HI)
     A            D@QTY          7  0B  8 26DSPATR(CS) EDTCDE(4)
     A  63                                  DSPATR(RI PC)
     A                                 10 11'# OF KANBANS:' DSPATR(HI)
     A            D@#KAN         5  0B 10 26DSPATR(CS) EDTCDE(4)
     A  64                                  DSPATR(RI PC)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
