     A*%%TS  SD  20211109  152412  I0777       REL-V7R3M0  5770-WDS
     A** AKBPW11 *******************************************
     A* .. PRINTING IAF COMPONENTS KANBAN                  *
     A*    MSK.KUNIEDA      2000.06.23                     *
     A******************************************* AKBPW11***
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*--------------*
     A* SCREEN 1 *
     A*--------------*
     A          R AKBPW111
     A*%%TS  SD  20211109  152412  I0777       REL-V7R3M0  5770-WDS
     A                                      PUTOVR
     A                                      BLINK
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'* PRINTING COMPONENTS KANBAN *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT AKBPW11'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 20'1.  NORMAL PRINTING'
     A                                  8 20'2.  RE-PRINTING'
     A                                  8 23'<- INPUT THE NUMBER'
     A            @NUBR          1A  B 10 20DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 21 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @MSG          60A  O 21 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'F1:'
     A                                      DSPATR(RI)
     A                                 24  8'EXIT'
     A                                 24 24'F5:'
     A                                      DSPATR(RI)
     A                                 24 28'PRINT'
