     A** AKHPWA5 ***********************************
     A* ..INQUIRY OF COMPONENTS PLATING KANBAN M/F  || *.
     A* I-HASADA                    93.08.17       *
     A*********************************** AKHPWA5 **
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R AKHPWA51
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF02
     A                                      CF03
     A                                      BLINK
     A                                  1 19'* COMPONENTS PLATINH KANBAN M/F IN-
     A                                      QUIRY *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT AKHPWA51'
     A                                  2  2'PART NUMBER'
     A            SHIN          14A  O  2 15OVRDTA
     A                                  2 35'ASSEMBLY PROCESS'
     A            E1KKTI         3A  O  2 53OVRDTA
     A                                  2 57'EFFECTIVE/LAPSE DATE-BIN'
     A            E1UKHZ         8S 0O  3 67OVRDTA
     A                                  3 76'-'
     A            E1UBIN         2S 0O  3 78OVRDTA
     A N81                              3  2'SURFACE PLATING HANDLING'
     A N81        E1MEKI         7A  O  3 27
     A N81                                  OVRDTA
     A                                  3 35'RECEIVING FACTORY'
     A            E1UKOJ         4S 0O  3 53OVRDTA
     A            E1STHZ         8S 0O  4 67OVRDTA
     A                                  4 76'-'
     A            E1SBIN         2S 0O  4 78OVRDTA
     A N81                              4  2'PART PLATING'
     A N81        M1MEKI         7A  O  4 15
     A N81                                  OVRDTA
     A                                  4 35'RECEIVING'
     A            E1UKER         4A  O  4 53OVRDTA
     A                                  5  2'KANBAN ADJUSTMENT'
     A                                      DSPATR(RI)
     A                                  6  2'ALL'
     A                                      DSPATR(UL)
     A                                  6  6'MIN'
     A                                      DSPATR(UL)
     A                                  6 10'MAX'
     A                                      DSPATR(UL)
     A                                  6 14'HANDLING'
     A                                      DSPATR(UL)
     A                                  6 24'K SHEETS'
     A                                      DSPATR(UL)
     A                                  5 34'REASON'
     A                                  6 35'CODE'
     A                                      DSPATR(UL)
     A                                  5 42'CALCULATION'
     A                                  6 42'PER DAY NBR'
     A                                      DSPATR(UL)
     A                                  5 55'FIXED PER'
     A                                  6 56'DAY NBR'
     A                                      DSPATR(UL)
     A                                  6 65'ACCOM QTY-UNIT'
     A                                      DSPATR(UL)
     A            E1KALL         3Y 0O  7  2EDTCDE(3)
     A                                      OVRDTA
     A            E1KMIN         3Y 0O  7  6EDTCDE(3)
     A                                      OVRDTA
     A            E1KMAX         3Y 0O  7 10EDTCDE(3)
     A                                      OVRDTA
     A            E1SRMS         3Y 0O  7 17EDTCDE(3)
     A                                      OVRDTA
     A            WKMAX          3Y 0O  7 27EDTCDE(3)
     A                                      OVRDTA
     A            E1KSNK         1Y 0O  7 37OVRDTA
     A            E1KSSU         9Y 0O  7 42EDTCDE(1)
     A                                      OVRDTA
     A            E1KTSU         9Y 0O  7 55EDTCDE(4)
     A                                      OVRDTA
     A            E1SSYS         6Y 0O  7 68EDTCDE(4)
     A                                      OVRDTA
     A            E1SSYT         1A  O  7 76OVRDTA
     A N81                              8 42'BARREL'
     A N81                                  DSPATR(UL)
     A  81                              8 43'LOT'
     A  81                                  DSPATR(UL)
     A                                  9  2'SETTING CODE'
     A                                      DSPATR(UL)
     A                                  9 23'PAPER'
     A                                      DSPATR(UL)
     A                                  9 30'C BOX'
     A                                      DSPATR(UL)
     A                                  9 37'MAX'
     A                                      DSPATR(UL)
     A                                  9 42'A    B'
     A                                      DSPATR(UL)
     A                                  9 50'LINE'
     A                                      DSPATR(UL)
     A                                  8 54'QUENCHING'
     A                                  9 57'LOT'
     A                                      DSPATR(UL)
     A                                  9 64'L.T'
     A                                      DSPATR(UL)
     A                                  9 69'COEFFICIENT'
     A                                      DSPATR(UL)
     A            E1STI1         2Y 0O 10  2OVRDTA
     A            SETNM         16A  O 10  6OVRDTA
     A            E1YOSI         2A  O 10 25OVRDTA
     A            E1CBKO         2Y 0O 10 32EDTCDE(4)
     A                                      OVRDTA
     A            E1MAXH         3Y 0O 10 37EDTCDE(4)
     A                                      OVRDTA
     A            E1BARA         2Y 0O 10 42EDTCDE(4)
     A                                      OVRDTA
     A            E1BARB         2Y 1O 10 45EDTCDE(4)
     A                                      OVRDTA
     A            E1RAIN         1A  O 10 52OVRDTA
     A            E1LOTO         2Y 0O 10 58EDTCDE(4)
     A                                      OVRDTA
     A            E1READ         3Y 1O 10 63EDTCDE(4)
     A                                      OVRDTA
     A            E1KEIS         3Y 2O 10 73EDTCDE(4)
     A                                      OVRDTA
     A                                 12  2'KANBAN KIND'
     A                                      DSPATR(UL)
     A                                 11 29'COMPLETION'
     A                                 12 29'UNIT WEIGHT'
     A                                      DSPATR(UL)
     A                                 11 41'DRAWING'
     A                                 12 42'INST.'
     A                                      DSPATR(UL)
     A                                 12 52'SORT INST'
     A                                      DSPATR(UL)
     A                                 11 62'FOR KANBAN PRINTING'
     A                                 12 64'RCV.FACTORY-RCV.'
     A                                      DSPATR(UL)
     A            E1KCD1         1A  O 13  2OVRDTA
     A                                 13  4'-'
     A            E1KCD2         1A  O 13  6OVRDTA
     A            KCDNM         20A  O 13  8OVRDTA
     A            E1KASI         7Y 2O 13 30EDTCDE(4)
     A                                      OVRDTA
     A            KASI           7Y 2O 14 30EDTCDE(4)
     A                                      OVRDTA
     A            E1ZMEN         1A  O 13 44OVRDTA
     A            E1SHIY         2Y 0O 13 55EDTCDE(Z)
     A                                      OVRDTA
     A            E1KUKJ         4Y 0O 13 67OVRDTA
     A            E1KUKE         4A  O 13 74OVRDTA
     A N81                             15  4'PLATING'
     A N81                                  DSPATR(UL)
     A N81                             15 19'1'
     A N81                                  DSPATR(UL)
     A N81                             16  5'CONDITION'
     A N81                                  DSPATR(UL)
     A N81                             16 19'2'
     A N81                                  DSPATR(UL)
     A  81                             15  4'PROCESSING'
     A  81                                  DSPATR(UL)
     A  81                             15 17'1-1'
     A  81                                  DSPATR(UL)
     A  81                             16  5'CONDITION'
     A  81                                  DSPATR(UL)
     A  81                             16 17'1-2'
     A  81                                  DSPATR(UL)
     A                                 17  4'ASSEMBLED'
     A                                      DSPATR(UL)
     A                                 17 17'1-1'
     A                                      DSPATR(UL)
     A                                 18  5'FORM'
     A                                      DSPATR(UL)
     A                                 18 17'2-1'
     A                                      DSPATR(UL)
     A                                 19  6'CONDITION'
     A                                      DSPATR(UL)
     A                                 19 17'2-2'
     A                                      DSPATR(UL)
     A                                 20 17'2-3'
     A                                      DSPATR(UL)
     A            E1JOK1         2A  O 15 21OVRDTA
     A            JNM1          16A  O 15 25OVRDTA
     A            E1JOK2         2A  O 16 21OVRDTA
     A            JNM2          16A  O 16 25OVRDTA
     A            E1JOK3         2A  O 17 21OVRDTA
     A            JNM3          16A  O 17 25OVRDTA
     A            E1JOK4         2A  O 18 21OVRDTA
     A            JNM4          16A  O 18 25OVRDTA
     A            E1JOK5         2A  O 19 21OVRDTA
     A            JNM5          16A  O 19 25OVRDTA
     A            E1JOK6         2A  O 20 21OVRDTA
     A            JNM6          16A  O 20 25OVRDTA
     A                                 14 43'PROVISION'
     A                                 15 45'MAKER'
     A                                      DSPATR(UL)
     A            E1SRCD         4Y 0O 16 46EDTCDE(4)
     A                                      OVRDTA
     A                                 14 58'DESIGN'
     A                                 15 56'CHANGE MARK'
     A                                      DSPATR(UL)
     A            E1SHKB         1A  O 16 61OVRDTA
     A                                 14 69'REQUEST'
     A                                 15 70'POINT'
     A                                      DSPATR(UL)
     A            E1SEKU         4Y 0O 16 71EDTCDE(4)
     A                                      OVRDTA
     A                                 17 43'PRECEDING'
     A                                 18 45'PROCESS TYPE BD'
     A                                      DSPATR(UL)
     A                                 17 64'PRESENT'
     A                                 18 64'PROCESS TYPE BD'
     A                                      DSPATR(UL)
     A                                 21 43'LOCATION'
     A                                      DSPATR(RI)
     A                                 21 62'LOCATION'
     A                                      DSPATR(RI)
     A            MAEK2          8A  O 19 44OVRDTA
     A            E1MTYP         1A  O 19 55OVRDTA
     A            E1MAEH         2A  O 19 58OVRDTA
     A            ATOK2          8A  O 19 63OVRDTA
     A            E1ATYP         1A  O 19 74OVRDTA
     A            E1ATOH         2A  O 19 77OVRDTA
     A            NMB           16A  O 20 44OVRDTA
     A            MTKR           9A  O 21 52OVRDTA
     A            NMA           16A  O 20 63OVRDTA
     A            ATKR           9A  O 21 71OVRDTA
     A                                 24  2'LOCATION CODE INQUIRY SCREEN'
     A                                 24 31'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 38'PICK-UP LOT INQUIRY'
     A                                 24 58'CMD-2'
     A                                      DSPATR(RI)
