     A** ALBPW60 ********************************
     A* ..KANBAN ASSORTMENT DATA UPDATE..       *
     A*     K.OKACHI               97.11.06     *
     A******************************** ALBPW60 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R ALBPW601
     A                                      CF01
     A                                      KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 19' ** KANBAN ASSORTMENT DATA +
     A                                      UPDATE ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'ALBPW60'
      *
     A                                  5 10'UPDATE'
     A                                      DSPATR(RI)
     A            IKOS           1A  B  7 12DSPATR(CS)
     A  01                                  DSPATR(RI PC)
     A                                  7 14'<--- 0:CANCEL 2:ADD'
      *
     A                                 10 10' PICK-UP DATE ' DSPATR(RI)
     A                                 10 27' BIN(RG CODE) ' DSPATR(RI)
     A                                 10 44' SUPPLIER ' DSPATR(RI)
     A                                 10 57' FACTORY ' DSPATR(RI)
      *
     A            ISYHZ          8Y 0B 12 12DSPATR(CS) EDTCDE(Z)
     A  02                                  DSPATR(RI PC)
     A            IRGCD          2Y 0B 12 32DSPATR(CS) EDTCDE(Z)
     A  03                                  DSPATR(RI PC)
     A            ISIRE          4A  B 12 47DSPATR(CS)
     A  04                                  DSPATR(RI PC)
     A            ISKOJ          1A  B 12 61DSPATR(CS)
     A  05                                  DSPATR(RI PC)
      *
     A                                 13 13'YYMMDD'
     A                                 14 44'TMMK  3347-0'
      *
     A                                 16 10' DOCK ' DSPATR(RI)
     A                                 16 27' USER PART NO. ' DSPATR(RI)
      *
     A            IUKEI          2A  B 18 12DSPATR(CS)
     A  06                                  DSPATR(RI PC)
     A            IUHN1          5A  B 18 21DSPATR(CS)
     A  07                                  DSPATR(RI PC)
     A                                 18 27'-'
     A            IUHN2          5A  B 18 29DSPATR(CS)
     A  07                                  DSPATR(RI PC)
     A                                 18 35'-'
     A            IUHN3          5A  B 18 37DSPATR(CS)
     A  07                                  DSPATR(RI PC)
     A                                 18 43'-'
     A            IUHN4          5A  B 18 45DSPATR(CS)
     A  07                                  DSPATR(RI PC)
      *
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 21 18
      *
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A          R ALBPW602
     A                                      CF03
     A                                      CF05
     A                                      KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 19' ** KANBAN ASSORTMENT DATA +
     A                                      UPDATE ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'ALBPW60'
      *
     A                                  4  2' PICK-UP DATE '
     A                                  4 17' BIN(RG CODE) '
     A                                  4 32' SUPPLIER '
     A                                  4 43' FACTORY '
     A                                  4 53' DOCK '
      *
     A            ISYHZ          8Y 0O  5  4
     A            IRGCD          2Y 0O  5 22EDTCDE(Z)
     A            ISIRE          4A  O  5 35
     A            ISKOJ          1A  O  5 47
     A            IUKEI          2A  O  5 55
      *
     A                                  9 10' USER PART NO. '
     A            IUHN1          5A  O  9 26
     A                                  9 32'-'
     A            IUHN2          5A  O  9 34
     A                                  9 40'-'
     A            IUHN3          5A  O  9 42
     A                                  9 48'-'
     A            IUHN4          5A  O  9 50
      *
     A                                 12  7' KANBAN NO. '
     A                                      DSPATR(RI)
     A                                 12 20' QTY./CONT. '
     A                                      DSPATR(RI)
     A                                 12 33'NO. OF CONT.'
     A                                      DSPATR(RI)
     A                                 12 46'SHIPPING QTY.'
     A                                      DSPATR(RI)
      *
     A            ISBAN          4A  B 14 10DSPATR(CS)
     A  08                                  DSPATR(RI PC)
     A            IUSYS          5  0B 14 23DSPATR(CS) EDTCDE(Z)
     A  09                                  DSPATR(RI PC)
     A            IMAIS          3  0B 14 37DSPATR(CS) EDTCDE(Z)
     A  10                                  DSPATR(RI PC)
     A            ISURY          7  0O 14 48EDTCDE(Z)
      *
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 21 18
      *
     A                                 24  4'KEY INPUT'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE OK'
     A                                 24 35'CMD-5'
     A                                      DSPATR(RI)
