     A** ALBPW33 ******************************************************
     A*  WORKER CODE INQUIRY BY NAME                                  *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF01(01)
     A                                      KEEP
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 24'** Worker Code Inq by Name **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6  7'Enter First or Last Name for Searc-
     A                                      h'
     A                                      DSPATR(RI)
     A            D1NAME        15A  B  6 44DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 14 16'F1 - Exit'
     A            D1PGM         10A  O  1 66
     A                                  7 12'...Or Enter Partial Name...'
