     A*%%TS  SD  20181025  144952  I0777       REL-V7R3M0  5770-WDS
     A** ALCPW05 ***********************************************
     A*  THE NUMBER OD PROCESSED BOXES BY WORKER LIST INQUIRY  *
     A*                                                        *
     A* TCHK1 06/03/09 CREATE(COPY FROM ALDPW05)               *
     A**********************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R ALCPW171
     A*%%TS  SD  20181025  144952  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTCDE(Y)
     A                                  1 18'**  THE NUMBER OF PROCESSED BOXES -
     A                                      BY TM INQUIRY  **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'ALCPW17'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 28' FOR OQ '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6 18' YEAR MONTH DATE :'
     A            YEAR           4Y 0B  6 38DSPATR(UL)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            MM             2Y 0B  6 43DSPATR(UL)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            DD             2Y 0B  6 46DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99                             21 18'DATE  INCORRECT'
     A                                 24  4'F1:END'
     A                                 24 25'F5:PROCESS'
