     A**** ALDPW9XL ****************************************
     A* STORE IN INTRA LOCATION LOT ID SCAN                *
     A*   LEC                        2024.07.15            *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A*
     A          R ALDPW993
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2' ** INTRA STORE IN ** '
     A                                      DSPATR(RI)
     A            D2BAR1        20   O  3  3COLOR(WHT)
     A            D2SHN         14   O  4  6COLOR(WHT)
     A                                  6  5'***  LOT ID  ***'
     A N88                             13  2'F1: BACK'
     A  88                             13 15'F5:DONE'
     A*
     A            D3LOT          8A  B  7  9DSPATR(UL)
     A                                      CHECK(ER)
     A*
     A            D3LOT1         8A  O  8  9COLOR(PNK)
     A            D3LOT2         8A  O  9  9COLOR(PNK)
     A            D3LOT3         8A  O 10  9COLOR(PNK)
     A            D3LOT4         8A  O 11  9COLOR(PNK)
      *
     A          R ALDPW998
     A                                      OVERLAY
     A  90
     AO 99                                  ALARM
      *
     A          R ALDPW999
     A                                      OVERLAY
     A                                  1  2' ** INTRA STORE IN ** '
     A                                      DSPATR(RI)
     A                                  5  6'***          ***'
     A                                  6  6'  ***      ***  '
     A                                  7  6'    ***  ***    '
     A                                  8  6'      ****      '
     A                                  9  6'    ***  ***    '
     A                                 10  6'  ***      ***  '
     A                                 11  6'***          ***'
     A            D9ERR         25A  O 14  2DSPATR(RI)
      ********************************************************************
     A          R DSP98
     A                                  2  2'********************'
     A                                  3  2'********************'
     A                                  4  2'********************'
     A                                  5  2'*                  *'
     A                                  6  2'*                  *'
     A                                  7  2'*'
     A            MSG           16A  O  7  4
     A                                  7 21'*'
     A                                  8  2'*                  *'
     A                                  9  2'*'
     A            MSG@2         16A  O  9  4
     A                                  9 21'*'
     A                                 10  2'*                  *'
     A                                 11  2'********************'
     A                                 12  2'********************'
     A                                 13  2'********************'
     A                                 14  2'ENTER:CONTINUE'
