     A*%%TS  SD  20010828  134357  TEST        REL-V3R7M0  5716-PW1
     A*** ALDPW92 ******************************************
     A* READING BARCODE OF KANBAN(INQ. ACTUAL SHIPPING)    *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R ALDPW010
     A*%%TS  SD  20010730  120406  TEST        REL-V3R7M0  5716-PW1
     A                                      CF05(12)
     A                                  2  2'INVOICE DATE:'
     A                                      DSPATR(UL)
     A            D@YMD          6Y 0B  4  7EDTWRD('  /  /  ')
     A                                      EDTMSK('  &  &  ')
     A                                      DSPATR(UL)
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A                                  5  7'(YYMMDD)'
     A                                 14  2'F5=MAIN MENU'
     A          R ALDPW011
     A*%%TS  SD  20010828  134357  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('TOYOTA BACK KANBAN')
     A                                      CF05
     A                                      CF07
     A                                      CF02
     A                                      CF06
     A                                      BLINK
     A                                  1  2'EKANBAN'
     A                                      DSPATR(UL)
     A            BARCD0        18A  B  3  2
     A                                      DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 13  2'F5=MAIN MENU'
     A                                 15  2'F7=SWITCH TO OTHERS'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A                                 14  2'F6=TMMK'
     A********************************************************************
     A          R ALDPW012
     A*%%TS  SD  20010823  114246  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('TOYOTA BACK KANBAN')
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      BLINK
     A            D@TITL        16   O  1  2
     A                                      DSPATR(UL)
     A            D@NBR0         1S 0O  3  2
     A            D@BCD0         7A  B  3  5
     A                                      DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 13  2'F5=MAIN MENU'
     A                                 14  2'F6=E-KANBAN'
     A                                 15  2'F7=SWITCH TO OTHERS'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A            D@NBR1         1  0O  5  2EDTCDE(4)
     A            D@BCD1         7   O  5  5
     A            D@NBR2         1  0O  6  2EDTCDE(4)
     A            D@BCD2         7   O  6  5
     A            D@NBR3         1  0O  7  2EDTCDE(4)
     A            D@BCD3         7   O  7  5
     A********************************************************************
     A*
     A          R ALDPW013
     A*%%TS  SD  20010828  134357  TEST        REL-V3R7M0  5716-PW1
     A                                      TEXT('OTHERS')
     A                                      CF02
     A                                      CF08
     A                                      CF05
     A                                      CF07
     A                                      BLINK
     A                                  1  8'OTHERS'
     A                                      DSPATR(UL)
     A            BAROTH        19A  B  3  1
     A                                      DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 13  2'F2=TOTAL'
     A                                 15  2'F8=E-KANBAN   '
     A                                 13 12'F5:MENU'
     A                                 14  2'F7=TMMK KANBAN'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A          R ALDPW014
     A*
     A                                      TEXT('INQUIRY')
     A                                      CF02
     A                                      CF05
     A                                      BLINK
     A                                  1  8'INQUIRY'
     A                                      DSPATR(UL)
     A                                  3  3'TOTAL BOX'
     A            TOTAL          3  0O  3 16
     A                                  5  3'EMPTY BOX'
     A            EMPTY          3  0O  5 16
     A                                  7  3'GRAND TOTAL'
     A            GTOTL          3  0O  7 16
     A*
     A                                 14  2'F2=SWITCH'
     A                                 15  2'F5=MAIN MENU'
     A*
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A          R ALDPW015
     A*
     A                                      TEXT('LOCATION')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                  1  7'LOCATION'
     A*                                     DSPATR(UL)
     A                                  3  2'LOCATION'
     A            BARLOC         8   B  3 11
     A                                      DSPATR(UL)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      CHECK(ER)
     A*
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F5=RETURN'
     A*
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A          R ALDPW016
     A*
     A                                      TEXT('KANBAN APICS')
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      BLINK
     A                                  1  2'APICS KANBAN'
     A*                                     DSPATR(UL)
     A*           BARKAN        17   B  3  2
     A            BARKAN        15   B  3  2
     A                                      DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(ER)
     A*
     A                                 13  2'F7=SWITCH TO ASJ'
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F5=RETURN'
     A*
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A*
     A********************************************************************
     A          R ALDPW020
     A*
     A                                      TEXT('KANBAN ASJ')
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      BLINK
     A                                  1  4'ASJ KANBAN'
     A*                                     DSPATR(UL)
     A            BARKAX        17   B  3  2
     A                                      DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(ER)
     A*
     A                                 13  2'F7=SWITCH TO APICS'
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F5=RETURN'
     A*
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A*
     A          R ALDPW021
     A*%%TS  SD  20010613  105401  QPGMR       REL-V3R7M0  5716-PW1
     A                                      TEXT('4POINT')
     A                                      CF05
     A                                      BLINK
     A                                  1  8'4 POINT'
     A                                      DSPATR(UL)
     A                                  2  2'HCM,ELP,MAP,HDM,HTM'
     A                                  3  2'   SHOWA CANADA'
     A            BARHON        19A  B  6  1
     A                                      DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 14  2'F5=MAIN MENU'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A*
     A*************************************
     A          R ALDPW999
     A*
     A                                      TEXT('DUMMY')
     A                                      OVERLAY
     A                                  1  3'BACK SIDE KANBAN'
     A                                      DSPATR(UL)
     A*****************************************************************
     A          R ALDPW997
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2'OO    OO           '
     A                                  7  2' OOOOOO            '
     A                                  8  2'                   '
     A                                  9  2'        KK    KKK  '
     A                                 10  2'        KK   KK    '
     A                                 11  2'        KK  KK     '
     A                                 12  2'        KKKKK      '
     A                                 13  2'        KK  KK     '
     A                                 14  2'        KK   KK    '
     A                                 15  2'        KK    KKK  '
     A*****************************************************************
     A          R ALDPW998
     A*%%TS  SD  20000411  083534  QPGMR       REL-V3R7M0  5716-PW1
     A                                      OVERLAY
     A                                  1  2'*******************'
     A                                      DSPATR(RI BL)
     A                                  2  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  3  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  4  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  5  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  6  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  7  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                  8  2'*'
     A            MSG           15   O  8  4
     A                                  8 20'*'
     A                                  9  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 10  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 11  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 12  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 13  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 14  2'*                 *'
     A                                      DSPATR(RI BL)
     A                                 15  2'*******************'
     A                                      DSPATR(RI BL)
