     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A*** ALDPW2X ******************************************
     A* READING BARCODE OF KANBAN(INQ. ACTUAL SHIPPING)    *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF04
     A                                      CF03
     A                                      CF02
     A                                      CF05
     A          R ALDPW010
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      BLINK
     A                                  1  2'TOYOTA 2D KAN'
     A            BAR01         25A  B  3  2
     A            BAR02         25A  B  4  2
     A            BAR03         25A  B  5  2
     A            BAR04         25A  B  6  2
     A            BAR05         25A  B  7  2
     A            BAR06         25A  B  8  2
     A            BAR07         25A  B  9  2
     A            BAR08         25A  B 10  2
     A            BAR09         25A  B 11  2
     A            BAR10         25A  B 12  2CHECK(ER)
     A*           BAR11         14A  B 13  2
     A*           BAR12         14A  B 14  2
     A*           BAR13         14A  B 15  2
     **           BAR14         14A  B 16  2
     A*           BAR15         14A  B 17  2
     A*           BAR16         14A  B 18  2
     A*           BAR17         14A  B 19  2
     A*           BAR18         12A  B 20  2CHECK(ER)
     A                                 16  2'F3=END F2=1D'
     A          R ALDPW011
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      TEXT('TOYOTA BACK KANBAN')
     A                                      BLINK
     A                                  1  2'* NEW KANBAN *'
     A                                      DSPATR(UL)
     A            BARCD0        18A  B  3  2DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 12  2'F3=MAIN MENU'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A                                 13  2'F4=TOTAL'
     A                                 13 11'F2=2D'
     A********************************************************************
     A********************************************************************
     A*
     A          R ALDPW014
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      BLINK
     A                                  1  8'INQUIRY'
     A                                      DSPATR(UL)
     A                                  3  3'TOTAL BOX'
     A            TOTAL          3S 0O  3 16
     A                                  5  3'EMPTY BOX'
     A            EMPTY          3S 0O  5 16
     A                                  7  3'GRAND TOTAL'
     A            GTOTL          3S 0O  7 16
     A                                 14  2'F2=SWITCH'
     A                                 15  2'F3=MAIN MENU'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A*
     A          R ALDPW015
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      TEXT('LOCATION')
     A                                      BLINK
     A                                  1  7'LOCATION'
     A                                  3  2'LOCATION'
     A            BARLOC         8A  B  3 11DSPATR(UL)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F4=RETURN'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A*
     A          R ALDPW016
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      BLINK
     A                                  1  2'APICS KANBAN'
     A            BARKAN        15A  B  3  2DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 13  2'F2=SWITCH TO ASJ'
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F4=RETURN'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A*
     A********************************************************************
     A*
     A          R ALDPW020
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      TEXT('KANBAN ASJ')
     A                                      BLINK
     A                                  1  4'ASJ KANBAN'
     A            BARKAX        17A  B  3  2DSPATR(UL)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 13  2'F2=SWITCH TO APICS'
     A                                 14  2'F3=MAIN MENU'
     A                                 15  2'F4=RETURN'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A********************************************************************
     A*
     A          R ALDPW021
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      TEXT('4POINT')
     A                                      BLINK
     A                                  1  8'4 POINT'
     A                                      DSPATR(UL)
     A                                  2  2'HCM,ELP,MAP,HDM,HTM'
     A                                  3  2'   SHOWA CANADA'
     A            BARHON        19A  B  6  1DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 14  2'F3=MAIN MENU'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A*
     A          R ALDPW022
     A*%%TS  SD  20031022  090921  TEST        REL-V4R4M0  5769-PW1
     A                                      TEXT('4POINT')
     A                                      BLINK
     A                                  1  6'4 POINT'
     A                                      DSPATR(UL)
     A            BARDEN        14A  B  6  2DSPATR(UL)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      CHECK(ER)
     A                                 14  2'F3=MAIN MENU'
     A            MSG           15A  O 16  2
     A N30                                  DSPATR(ND)
     A                                  2  4'** DENSO **'
     A*****************************************************************
     A          R ALDPW997
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2'OO    OO           '
     A                                  7  2' OOOOOO            '
     A                                  8  2'                   '
     A                                  9  2'        KK    KKK  '
     A                                 10  2'        KK   KK    '
     A                                 11  2'        KK  KK     '
     A                                 12  2'        KKKKK      '
     A                                 13  2'        KK  KK     '
     A                                 14  2'        KK   KK    '
     A                                 15  2'        KK    KKK  '
     A*****************************************************************
     A          R ALDPW998
     A*%%TS  SD  20000411  083534  QPGMR       REL-V3R7M0  5716-PW1
     A                                  1  2'*******************'
     A                                  2  2'*******************'
     A                                  3  2'*******************'
     A                                  4  2'*******************'
     A                                  5  2'*******************'
     A                                  6  2'*                 *'
     A                                  7  2'*                 *'
     A                                  8  2'*'
     A            MSG           15   O  8  4
     A                                  8 20'*'
     A                                  9  2'*                 *'
     A                                 10  2'*                 *'
     A                                 11  2'*******************'
     A                                 12  2'*******************'
     A                                 13  2'*******************'
     A                                 14  2'*******************'
     A                                 15  2'*******************'
