     A*%%TS  SD  20031029  133730  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A* TCHK1 11/20/09 ADD INVENTORY SCAN DATE & TIME
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20031029  133730  TEST        REL-V4R4M0  5769-PW1
     A            #PGM           8A  O  1  2
     A                                  1 23'** SCANNED PARTS DATA TO PC **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5 20'SHIP DATE: From'
     A                                      DSPATR(HI)
     A            D@YMD          8Y 0B  5 36DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 36'YYYYMMDD'
TCHK1A*
TCHK1A                                 12 20'INVENTORY SCAN DATE:'
TCHK1A                                      DSPATR(HI)
TCHK1A            D@IVDT         8Y 0B 12 41DSPATR(CS)
TCHK1A                                      EDTCDE(4)
TCHK1A  62                                  DSPATR(RI)
TCHK1A  62                                  DSPATR(PC)
TCHK1A                                 13 41'YYYYMMDD'
TCHK1A                                 15 35'TIME:'
TCHK1A                                      DSPATR(HI)
TCHK1A            D@IVTM         4Y 0B 15 41DSPATR(CS)
TCHK1A                                      EDTCDE(4)
TCHK1A  63                                  DSPATR(RI)
TCHK1A  63                                  DSPATR(PC)
TCHK1A                                 16 41'HHMM'
TCHK1A*
     A                                 23  4'F1:END   F5:WRITE'
