     A* WORKER CODE ENTRY                                  *
     A*   LEC                07/22/2024                    *
     A******************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R DSP01
     A                                      TEXT('MAIN MENU')
     A                                      CF03(03)
     A                                      CF05(05)
     A                                  4  2'WORKER CODE:'
     A            USRCD          6Y 0B  4 15DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 16  2'F3=END'
     A            MSG           15A  O 17  2
     A N30                                  DSPATR(ND)
     A                                  1  3'SCAN MENU'
