     A*%%TS  SD  20200916  103543  I0777       REL-V7R3M0  5770-WDS
     A** ALDPW25 ***********************************************
     A*   REFERENCE TO OUT-GOING TRACK RECORD  <IAF KANBAN>    *
     A*     DISPLAY-FILE.     : ALDPW25                        *
     A*     CREATE DATE.      : JUN/28/1997.                   *
     A*     AUTHOR.           : S.OHTAKE.                      *
     A*     USER SECTION.     : IAF                            *
     A**********************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------*
      *         .....SCREEN 1.....           *
      *-------------------------------------*
     A          R ALDPW251
     A                                      CF01
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A*******                           1 69'FMT ALDPW25'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 22'*** REFERENCE TO OUT-GOING TRACK +
     A                                       RECORD <IAF KANBAN> ***'
     A                                      DSPATR(RI)
      *
     A                                  4 28'PARTS NUMBER IN-HOUSE'
     A                                      DSPATR(UL)
     A            SHN1           5   B  5 28DSPATR(CS) OVRDTA
     A  01                                  DSPATR(RI PC)
     A                                  5 34'-'
     A            SHN2           5   B  5 36DSPATR(CS) OVRDTA
     A  01                                  DSPATR(RI)
     A                                  5 42'-'
     A            SHN3           2   B  5 44DSPATR(CS) OVRDTA
     A  01                                  DSPATR(RI)
     A                                  8 30'BEGINNING DATE & TIME'
     A                                      DSPATR(UL)
     A                                  9 26'YEAR MONTH  DAY   +
     A                                        HOUR  MINUTES'
     A                                      DSPATR(UL)
     A            YY             4Y 0B 10 26DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A  02                                  DSPATR(RI PC)
     A                                 10 31'-'
     A            MM             2Y 0B 10 33DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A  03                                  DSPATR(RI PC)
     A                                 10 36'-'
     A            DD             2Y 0B 10 38DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A  04                                  DSPATR(RI PC)
     A            JI             2Y 0B 10 45DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A                                 10 49':'
     A            FN             2Y 0B 10 52DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
      *
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60   O 22 20OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24  4' END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A*-------------------------------------*
     A*         .....SCREEN 2.....          *
     A*-------------------------------------*
     A          R ALDPW252
     A*%%TS  SD  20200916  103543  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                      CF03
     A                                      ROLLUP(50 'ROLL UP')
     A                                      ROLLDOWN(51 'ROLL DOWN')
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A*********                         1 69'FMT ALDPW25'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 22'*** REFERENCE TO OUT-GOING TRACK R-
     A                                      ECORD <IAF KANBAN> ***'
     A                                      DSPATR(RI)
     A*
     A                                  3 17'PARTS NO :'
     A            SHN           14A  O  3 28
     A*
     A                                  4  1'DTL'
     A                                  4  6'ID'
     A                                  4 11'ORDER'
     A***************                   4 29'PROD'
     A                                  4 18'LOT'
     A                                  4 27'SCANNED'
     A******                            4 72'OPERATOR'
     A                                  5  2'    NO     NO   NO      DATE  TIME-
     A                                        DLV   DOCK  ORDER#      SHIP DATE-
     A                                         BIN  '
     A                                      DSPATR(UL)
     A*-----------*
     A* DETAIL 1  *
     A*-----------*
     A            DT1            1A  B  6  2OVRDTA
     A                                      OVRATR
     A  80                                  DSPATR(CS)
     A N80                                  DSPATR(ND)
     A N80                                  DSPATR(PR)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A*           TP1            1   O  6 10OVRDTA OVRATR
     A*N80                                  DSPATR(ND)
     A*           TY1            1   O  6 13OVRDTA OVRATR
     A*N80                                  DSPATR(ND)
     A            ZT1            4A  O  6  5OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            OD1            6A  O  6 11OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            PR1            1A  H
     A*N80                                  DSPATR(ND)
     A            LT1            4A  O  6 18OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A*           AD1            9   O  6 41OVRDTA OVRATR
     A*N80                                  DSPATR(ND)
     A            HZ1           10A  H
     A            HD1            5A  O  6 25OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            TM1            5A  O  6 31OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            DLV1           4A  O  6 38OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            DOCK1          4A  O  6 44OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            ORDR1         10A  O  6 50OVRDTA
     A                                      OVRATR
     A N80                                  DSPATR(ND)
     A            SHDT1          8Y 0O  6 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N80                                  DSPATR(ND)
     A            BIN1           2Y 0O  6 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N80                                  DSPATR(ND)
     A*           OP1            6   O  6 73OVRDTA OVRATR
     A*N80                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 2  *
     A*-----------*
     A            DT2            1A  B  7  2OVRDTA
     A                                      OVRATR
     A  81                                  DSPATR(CS)
     A N81                                  DSPATR(ND)
     A N81                                  DSPATR(PR)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A*           TP2            1   O  7 10OVRDTA OVRATR
     A*N81                                  DSPATR(ND)
     A*           TY2            1   O  7 13OVRDTA OVRATR
     A*N81                                  DSPATR(ND)
     A            ZT2            4A  O  7  5OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A            OD2            6A  O  7 11OVRDTA
     A                                      OVRATR
     A*N81                                  DSPATR(ND)
     A            PR2            1A  H
     A*N81                                  DSPATR(ND)
     A            LT2            4A  O  7 18OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A*           AD2            9   O  7 41OVRDTA OVRATR
     A*N81                                  DSPATR(ND)
     A            HZ2           10A  H
     A            HD2            5A  O  7 25OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A            TM2            5A  O  7 31OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A*           OP2            6   O  7 73OVRDTA OVRATR
     A*N81                                  DSPATR(ND)
     A            DLV2           4A  O  7 38OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A            DOCK2          4A  O  7 44OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A            ORDR2         10A  O  7 50OVRDTA
     A                                      OVRATR
     A N81                                  DSPATR(ND)
     A            SHDT2          8Y 0O  7 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N81                                  DSPATR(ND)
     A            BIN2           2Y 0O  7 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N81                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 3  *
     A*-----------*
     A            DT3            1A  B  8  2OVRDTA
     A                                      OVRATR
     A  82                                  DSPATR(CS)
     A N82                                  DSPATR(ND)
     A N82                                  DSPATR(PR)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A*           TP3            1   O  8 10OVRDTA OVRATR
     A*N82                                  DSPATR(ND)
     A*           TY3            1   O  8 13OVRDTA OVRATR
     A*N82                                  DSPATR(ND)
     A            ZT3            4A  O  8  5OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            OD3            6A  O  8 11OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            PR3            1A  H
     A*N82                                  DSPATR(ND)
     A            LT3            4A  O  8 18OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A*           AD3            9   O  8 41OVRDTA OVRATR
     A*N82                                  DSPATR(ND)
     A            HZ3           10A  H
     A            HD3            5A  O  8 25OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            TM3            5A  O  8 31OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A*           OP3            6   O  8 73OVRDTA OVRATR
     A*N82                                  DSPATR(ND)
     A            DLV3           4A  O  8 38OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            DOCK3          4A  O  8 44OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            ORDR3         10A  O  8 50OVRDTA
     A                                      OVRATR
     A N82                                  DSPATR(ND)
     A            SHDT3          8Y 0O  8 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N82                                  DSPATR(ND)
     A            BIN3           2Y 0O  8 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N82                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 4  *
     A*-----------*
     A            DT4            1A  B  9  2OVRDTA
     A                                      OVRATR
     A  83                                  DSPATR(CS)
     A N83                                  DSPATR(ND)
     A N83                                  DSPATR(PR)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A*           TP4            1   O  9 10OVRDTA OVRATR
     A*N83                                  DSPATR(ND)
     A*           TY4            1   O  9 13OVRDTA OVRATR
     A*N83                                  DSPATR(ND)
     A            ZT4            4A  O  9  5OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            OD4            6A  O  9 11OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            PR4            1A  H
     A*N83                                  DSPATR(ND)
     A            LT4            4A  O  9 18OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A*           AD4            9   O  9 41OVRDTA OVRATR
     A*N83                                  DSPATR(ND)
     A            HZ4           10A  H
     A            HD4            5A  O  9 25OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            TM4            5A  O  9 31OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A*           OP4            6   O  9 73OVRDTA OVRATR
     A*N83                                  DSPATR(ND)
     A            DLV4           4A  O  9 38OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            DOCK4          4A  O  9 44OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            ORDR4         10A  O  9 50OVRDTA
     A                                      OVRATR
     A N83                                  DSPATR(ND)
     A            SHDT4          8Y 0O  9 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N83                                  DSPATR(ND)
     A            BIN4           2Y 0O  9 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N83                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 5  *
     A*-----------*
     A            DT5            1A  B 10  2OVRDTA
     A                                      OVRATR
     A  84                                  DSPATR(CS)
     A N84                                  DSPATR(ND)
     A N84                                  DSPATR(PR)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A*           TP5            1   O 10 10OVRDTA OVRATR
     A*N84                                  DSPATR(ND)
     A*           TY5            1   O 10 13OVRDTA OVRATR
     A*N84                                  DSPATR(ND)
     A            ZT5            4A  O 10  5OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            OD5            6A  O 10 11OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            PR5            1A  H
     A*N84                                  DSPATR(ND)
     A            LT5            4A  O 10 18OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A*           AD5            9   O 10 41OVRDTA OVRATR
     A*N84                                  DSPATR(ND)
     A            HZ5           10A  H
     A            HD5            5A  O 10 25OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            TM5            5A  O 10 31OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A*           OP5            6   O 10 73OVRDTA OVRATR
     A*N84                                  DSPATR(ND)
     A            DLV5           4A  O 10 38OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            DOCK5          4A  O 10 44OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            ORDR5         10A  O 10 50OVRDTA
     A                                      OVRATR
     A N84                                  DSPATR(ND)
     A            SHDT5          8Y 0O 10 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N84                                  DSPATR(ND)
     A            BIN5           2Y 0O 10 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N84                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 6  *
     A*-----------*
     A            DT6            1A  B 11  2OVRDTA
     A                                      OVRATR
     A  85                                  DSPATR(CS)
     A N85                                  DSPATR(ND)
     A N85                                  DSPATR(PR)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A*           TP6            1   O 11 10OVRDTA OVRATR
     A*N85                                  DSPATR(ND)
     A*           TY6            1   O 11 13OVRDTA OVRATR
     A*N85                                  DSPATR(ND)
     A            ZT6            4A  O 11  5OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            OD6            6A  O 11 11OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            PR6            1A  H
     A*N85                                  DSPATR(ND)
     A            LT6            4A  O 11 18OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A*           AD6            9   O 11 41OVRDTA OVRATR
     A*N85                                  DSPATR(ND)
     A            HZ6           10A  H
     A            HD6            5A  O 11 25OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            TM6            5A  O 11 31OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A*           OP6            6   O 11 73OVRDTA OVRATR
     A*N85                                  DSPATR(ND)
     A            DLV6           4A  O 11 38OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            DOCK6          4A  O 11 44OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            ORDR6         10A  O 11 50OVRDTA
     A                                      OVRATR
     A N85                                  DSPATR(ND)
     A            SHDT6          8Y 0O 11 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N85                                  DSPATR(ND)
     A            BIN6           2Y 0O 11 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N85                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 7  *
     A*-----------*
     A            DT7            1A  B 12  2OVRDTA
     A                                      OVRATR
     A  86                                  DSPATR(CS)
     A N86                                  DSPATR(ND)
     A N86                                  DSPATR(PR)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A*           TP7            1   O 12 10OVRDTA OVRATR
     A*N86                                  DSPATR(ND)
     A*           TY7            1   O 12 13OVRDTA OVRATR
     A*N86                                  DSPATR(ND)
     A            ZT7            4A  O 12  5OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            OD7            6A  O 12 11OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            PR7            1A  H
     A*N86                                  DSPATR(ND)
     A            LT7            4A  O 12 18OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A*           AD7            9   O 12 41OVRDTA OVRATR
     A*N86                                  DSPATR(ND)
     A            HZ7           10A  H
     A            HD7            5A  O 12 25OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            TM7            5A  O 12 31OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A*           OP7            6   O 12 73OVRDTA OVRATR
     A*N86                                  DSPATR(ND)
     A            DLV7           4A  O 12 38OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            DOCK7          4A  O 12 44OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            ORDR7         10A  O 12 50OVRDTA
     A                                      OVRATR
     A N86                                  DSPATR(ND)
     A            SHDT7          8Y 0O 12 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N86                                  DSPATR(ND)
     A            BIN7           2Y 0O 12 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N86                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 8  *
     A*-----------*
     A            DT8            1A  B 13  2OVRDTA
     A                                      OVRATR
     A  87                                  DSPATR(CS)
     A N87                                  DSPATR(ND)
     A N87                                  DSPATR(PR)
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A*           TP8            1   O 13 10OVRDTA OVRATR
     A*N87                                  DSPATR(ND)
     A*           TY8            1   O 13 13OVRDTA OVRATR
     A*N87                                  DSPATR(ND)
     A            ZT8            4A  O 13  5OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            OD8            6A  O 13 11OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            PR8            1A  H
     A*N87                                  DSPATR(ND)
     A            LT8            4A  O 13 18OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A*           AD8            9   O 13 41OVRDTA OVRATR
     A*N87                                  DSPATR(ND)
     A            HZ8           10A  H
     A            HD8            5A  O 13 25OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            TM8            5A  O 13 31OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A*           OP8            6   O 13 73OVRDTA OVRATR
     A*N87                                  DSPATR(ND)
     A            DLV8           4A  O 13 38OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            DOCK8          4A  O 13 44OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            ORDR8         10A  O 13 50OVRDTA
     A                                      OVRATR
     A N87                                  DSPATR(ND)
     A            SHDT8          8Y 0O 13 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N87                                  DSPATR(ND)
     A            BIN8           2Y 0O 13 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N87                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 9  *
     A*-----------*
     A            DT9            1A  B 14  2OVRDTA
     A                                      OVRATR
     A  88                                  DSPATR(CS)
     A N88                                  DSPATR(ND)
     A N88                                  DSPATR(PR)
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A*           TP9            1   O 14 10OVRDTA OVRATR
     A*N88                                  DSPATR(ND)
     A*           TY9            1   O 14 13OVRDTA OVRATR
     A*N88                                  DSPATR(ND)
     A            ZT9            4A  O 14  5OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            OD9            6A  O 14 11OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            PR9            1A  H
     A*N88                                  DSPATR(ND)
     A            LT9            4A  O 14 18OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A*           AD9            9   O 14 41OVRDTA OVRATR
     A*N88                                  DSPATR(ND)
     A            HZ9           10A  H
     A            HD9            5A  O 14 25OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            TM9            5A  O 14 31OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A*           OP9            6   O 14 73OVRDTA OVRATR
     A*N88                                  DSPATR(ND)
     A            DLV9           4A  O 14 38OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            DOCK9          4A  O 14 44OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            ORDR9         10A  O 14 50OVRDTA
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A            SHDT9          8Y 0O 14 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N88                                  DSPATR(ND)
     A            BIN9           2Y 0O 14 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N88                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 10 *
     A*-----------*
     A            DT10           1A  B 15  2OVRDTA
     A                                      OVRATR
     A  89                                  DSPATR(CS)
     A N89                                  DSPATR(ND)
     A N89                                  DSPATR(PR)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A*           TP10           1   O 15 10OVRDTA OVRATR
     A*N89                                  DSPATR(ND)
     A*           TY10           1   O 15 13OVRDTA OVRATR
     A*N89                                  DSPATR(ND)
     A            ZT10           4A  O 15  5OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            OD10           6A  O 15 11OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            PR10           1A  H
     A*N89                                  DSPATR(ND)
     A            LT10           4A  O 15 18OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A*           AD10           9   O 15 41OVRDTA OVRATR
     A*N89                                  DSPATR(ND)
     A            HZ10          10A  H
     A            HD10           5A  O 15 25OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            TM10           5A  O 15 31OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A*           OP10           6   O 15 73OVRDTA OVRATR
     A*N89                                  DSPATR(ND)
     A            DLV10          4A  O 15 38OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            DOCK10         4A  O 15 44OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            ORDR10        10A  O 15 50OVRDTA
     A                                      OVRATR
     A N89                                  DSPATR(ND)
     A            SHDT10         8Y 0O 15 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N89                                  DSPATR(ND)
     A            BIN10          2Y 0O 15 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N89                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 11 *
     A*-----------*
     A            DT11           1A  B 16  2OVRDTA
     A                                      OVRATR
     A  90                                  DSPATR(CS)
     A N90                                  DSPATR(ND)
     A N90                                  DSPATR(PR)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A*           TP11           1   O 16 10OVRDTA OVRATR
     A*N90                                  DSPATR(ND)
     A*           TY11           1   O 16 13OVRDTA OVRATR
     A*N90                                  DSPATR(ND)
     A            ZT11           4A  O 16  5OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            OD11           6A  O 16 11OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            PR11           1A  H
     A*N90                                  DSPATR(ND)
     A            LT11           4A  O 16 18OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A*           AD11           9   O 16 41OVRDTA OVRATR
     A*N90                                  DSPATR(ND)
     A            HZ11          10A  H
     A            HD11           5A  O 16 25OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            TM11           5A  O 16 31OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A*           OP11           6   O 16 73OVRDTA OVRATR
     A*N90                                  DSPATR(ND)
     A            DLV11          4A  O 16 38OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            DOCK11         4A  O 16 44OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            ORDR11        10A  O 16 50OVRDTA
     A                                      OVRATR
     A N90                                  DSPATR(ND)
     A            SHDT11         8Y 0O 16 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N90                                  DSPATR(ND)
     A            BIN11          2Y 0O 16 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N90                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 12 *
     A*-----------*
     A            DT12           1A  B 17  2OVRDTA
     A                                      OVRATR
     A  91                                  DSPATR(CS)
     A N91                                  DSPATR(ND)
     A N91                                  DSPATR(PR)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A*           TP12           1   O 17 10OVRDTA OVRATR
     A*N91                                  DSPATR(ND)
     A*           TY12           1   O 17 13OVRDTA OVRATR
     A*N91                                  DSPATR(ND)
     A            ZT12           4A  O 17  5OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            OD12           6A  O 17 11OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            PR12           1A  H
     A*N91                                  DSPATR(ND)
     A            LT12           4A  O 17 18OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A*           AD12           9   O 17 41OVRDTA OVRATR
     A*N91                                  DSPATR(ND)
     A            HZ12          10A  H
     A            HD12           5A  O 17 25OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            TM12           5A  O 17 31OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A*           OP12           6   O 17 73OVRDTA OVRATR
     A*N91                                  DSPATR(ND)
     A            DLV12          4A  O 17 38OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            DOCK12         4A  O 17 44OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            ORDR12        10A  O 17 50OVRDTA
     A                                      OVRATR
     A N91                                  DSPATR(ND)
     A            SHDT12         8Y 0O 17 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N91                                  DSPATR(ND)
     A            BIN12          2Y 0O 17 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N91                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 13 *
     A*-----------*
     A            DT13           1A  B 18  2OVRDTA
     A                                      OVRATR
     A  92                                  DSPATR(CS)
     A N92                                  DSPATR(ND)
     A N92                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A*           TP13           1   O 18 10OVRDTA OVRATR
     A*N92                                  DSPATR(ND)
     A*           TY13           1   O 18 13OVRDTA OVRATR
     A*N92                                  DSPATR(ND)
     A            ZT13           4A  O 18  5OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            OD13           6A  O 18 11OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            PR13           1A  H
     A*N92                                  DSPATR(ND)
     A            LT13           4A  O 18 18OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A*           AD13           9   O 18 41OVRDTA OVRATR
     A*N92                                  DSPATR(ND)
     A            HZ13          10A  H
     A            HD13           5A  O 18 25OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            TM13           5A  O 18 31OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A*           OP13           6   O 18 73OVRDTA OVRATR
     A*N92                                  DSPATR(ND)
     A            DLV13          4A  O 18 38OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            DOCK13         4A  O 18 44OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            ORDR13        10A  O 18 50OVRDTA
     A                                      OVRATR
     A N92                                  DSPATR(ND)
     A            SHDT13         8Y 0O 18 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N92                                  DSPATR(ND)
     A            BIN13          2Y 0O 18 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N92                                  DSPATR(ND)
     A*-----------*
     A* DETAIL 14 *
     A*-----------*
     A            DT14           1A  B 19  2OVRDTA
     A                                      OVRATR
     A  93                                  DSPATR(CS)
     A N93                                  DSPATR(ND)
     A N93                                  DSPATR(PR)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A*           TP14           1   O 19 10OVRDTA OVRATR
     A*N93                                  DSPATR(ND)
     A*           TY14           1   O 19 13OVRDTA OVRATR
     A*N93                                  DSPATR(ND)
     A            ZT14           4A  O 19  5OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            OD14           6A  O 19 11OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            PR14           1A  H
     A*N93                                  DSPATR(ND)
     A            LT14           4A  O 19 18OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A*           AD14           9   O 19 41OVRDTA OVRATR
     A*N93                                  DSPATR(ND)
     A            HZ14          10A  H
     A            HD14           5A  O 19 25OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            TM14           5A  O 19 31OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A*           OP14           6   O 19 73OVRDTA OVRATR
     A*N93                                  DSPATR(ND)
     A            DLV14          4A  O 19 38OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            DOCK14         4A  O 19 44OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            ORDR14        10A  O 19 50OVRDTA
     A                                      OVRATR
     A N93                                  DSPATR(ND)
     A            SHDT14         8Y 0O 19 62OVRDTA
     A                                      OVRATR
     A                                      EDTWRD('    /  /  ')
     A N93                                  DSPATR(ND)
     A            BIN14          2Y 0O 19 74OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(4)
     A N93                                  DSPATR(ND)
     A*
     A********                         20  2' |         |'
     A                                 20  1' |'
     A***                              21  2' |'
     A*                                21 13'+--- OUT-GOING TYPE --> E:+
     A******                                 DELV INFO   K:KANBAN'
     A                                 21  1' +--- PRESS ANY CHARACTER KEY TO S-
     A                                      EE THE DETAIL'
     A*
     A                                 23 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 23 20OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24  4' END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24'PRV.SCREEN'
     A                                 24 35' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 44'ROLL UP/DOWN'
     A                                 24 58'NEXT,PRV SCREEN'
     A                                      DSPATR(RI)
     A*-------------------------------------*
     A*         .....SCREEN 3.....          *
     A*-------------------------------------*
     A          R ALDPW253
     A*%%TS  SD  20031112  160857  TEST        REL-V4R4M0  5769-PW1
     A                                      CF01
     A                                      CF03
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A**********                        1 69'FMT ALDPW25'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 22'*** REFERENCE TO OUT-GOING TRACK R-
     A                                      ECORD <IAF KANBAN> ***'
     A                                      DSPATR(RI)
     A                                  4  2'PARTS NO :'
     A            SHN           14A  O  4 13DSPATR(HI)
     A                                  4 29'ADDRESS :'
     A            ADR            9A  O  4 39DSPATR(HI)
     A                                  4 50'OUT-GOING TYPE :'
     A            TYP           10A  O  4 67DSPATR(HI)
     A                                  7  6'KANBAN TYPE'
     A                                      DSPATR(UL)
     A            KANB          13A  O  8  5OVRDTA
     A                                  7 20'ID NO'
     A                                      DSPATR(UL)
     A            IDNO           4A  O  8 20OVRDTA
     A                                  7 27'ORDER NO'
     A                                      DSPATR(UL)
     A            ORDR           6A  O  8 28OVRDTA
     A                                  7 37'PROD INST'
     A                                      DSPATR(UL)
     A            PRIN           1A  O  8 40OVRDTA
     A                                  7 52'LOT NO'
     A                                      DSPATR(UL)
     A            LOTN           4A  O  8 53OVRDTA
     A                                  7 61'LABEL PAGE NO.'
     A                                      DSPATR(UL)
     A            IPAGE          3A  O  8 64OVRDTA
     A                                 10 10'DATE&TIME OF COMPLETION'
     A                                 11 10'    OF OUT-GOING       '
     A                                      DSPATR(UL)
     A            CMHZ          10A  O 12 12OVRDTA
     A            CMTM           5A  O 12 24OVRDTA
     A                                 11 38'OPERATOR ID'
     A                                      DSPATR(UL)
     A            OPER           6S 0O 12 39OVRDTA
     A                                 11 53'OPERATOR NAME'
     A                                      DSPATR(UL)
     A            OPEN          20A  O 12 53OVRDTA
     A                                 14 10'USER PARTS NO'
     A                                      DSPATR(UL)
     A            UHN           23A  O 15  7OVRDTA
     A                                 14 35'QUANTITY(IN-HOUSE/USER)'
     A                                      DSPATR(UL)
     A            SSYS           5S 0O 15 39OVRDTA
     A                                 15 45'/'
     A            USYS           5S 0O 15 47OVRDTA
     A                                 17 10'DELIVERING TO'
     A                                      DSPATR(UL)
     A            NONY           4S 0O 18 13OVRDTA
     A                                 17 26'PLANT'
     A                                      DSPATR(UL)
     A            PLNT           1A  O 18 28OVRDTA
     A                                 17 34'RECEIVING'
     A                                      DSPATR(UL)
     A            RECV           4A  O 18 36OVRDTA
     A                                 17 47'DELIVERING NAME'
     A                                      DSPATR(UL)
     A            DELN          20A  O 18 47OVRDTA
     A                                 24  4' END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24'PRV.SCREEN'
     A                                 24 35' CMD-3 '
     A                                      DSPATR(RI)
     A                                  5  4'SERIAL #:'
     A            SERL          18A  O  5 14DSPATR(HI)
     A                                  5 37'FORD SEQ#:'
     A            FSEQ#          6A  O  5 48DSPATR(HI)
     A                                 20  9'ORDER#'  DSPATR(UL)
     A                                 20 24'BIN' DSPATR(UL)
     A                                 20 32'SHIP DATE' DSPATR(UL)
     A            ORDN          10   O 21  9
     A            BIN            2  0O 21 24EDTCDE(4)
     A            SHDT           8  0O 21 32EDTWRD('    /  /  ')
