     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF12
     A          R SFL01                     SFL
     A            S@COUT         6   O  6  5
     A            S@NAME        20   O  6 14
     A            S@BOXS         6  0O  6 40EDTCDE(Z)
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 20'** # OF BOXES PROCESS BY WORKER **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2 23'** FOR STORE IN LOCATION  **'
     A                                      DSPATR(RI)
     A                                  5  5'CODE'
     A                                      DSPATR(HI)
     A                                  5 14'NAME'
     A                                      DSPATR(HI)
     A                                  5 36'# OF BOXES'
     A                                      DSPATR(HI)
     A                                  3 52'DATE'
     A                                      DSPATR(HI)
     A            C@MM           2S 0O  3 58
     A                                  3 61'/'
     A            C@DD           2S 0O  3 63
     A                                  3 66'/'
     A            C@YYYY         4S 0O  3 68
     A            C@HHMM         5A  O  3 74
     A                                  4 67'TO'
     A                                      DSPATR(HI)
     A            C@MM2          2S 0O  5 58
     A                                  5 61'/'
     A            C@DD2          2S 0O  5 63
     A                                  5 66'/'
     A            C@YYY2         4S 0O  5 68
     A            C@HHM2         5A  O  5 74
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
