     A*%%TS  SD  20250410  084447  I0777       REL-V7R4M0  5770-WDS
     A** ALDPW95 ********************************************
     A*  APICS ISSEU VS SCANNED STATUS INQUIRY              *
     A*                                                     *
     A* TCHK1 : 03/27/08 CREATE                             *
     A* TCHK2 : 04/16/08 ADD APICS RE-ORDER DATA            *
     A* TCHK3 : 09/10/09 ADD APICS STOP ALERT               *
     A* TCHK4 : 12/15/10 ADD OVER 32 CONTROL                *
     A*******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A          R FMT010
     A                                      OVERLAY
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'APICS ISSUED VS SCANNED  -
     A                                       INQUIRY '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
      *
     A                                  3  2'IAF Part#:'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            F1SHN1         5A  B  3 13
     A  31                                  DSPATR(RI PC)
     A N31                                  DSPATR(HI)
     A            F1SHN2         5A  B  3 19
     A  31                                  DSPATR(RI)
     A N31                                  DSPATR(HI)
     A            F1SHN3         2A  B  3 25
     A  31                                  DSPATR(RI)
     A N31                                  DSPATR(HI)
      *-----------------------------------------------------
     A          R SFL020                    SFL
     A            S2SEL          1A  B  5  2
     A  51                                  DSPATR(ND PR)
     A  52                                  DSPATR(PC)
     A            S2THNO         3A  O  5  4
TCHK3A  53                                  DSPATR(RI)
     A            S2ISDT         8Y 0O  5  9EDTWRD('    /  /  ')
TCHK3A  53                                  DSPATR(RI)
     A            S2ISBN         2Y 0O  5 20
     A  51                                  DSPATR(ND)
TCHK3A  53                                  DSPATR(RI)
     A            S2ISMS         3Y 0O  5 25
     A                                      EDTCDE(Z)
     A  51                                  DSPATR(ND)
TCHK3A  53                                  DSPATR(RI)
     A            S2PG01         2A  O  5 31
TCHK2A N71                                  COLOR(RED)
TCHK2A  71                                  COLOR(YLW)
     A            S2PG02         2A  O  5 34
TCHK2A N72                                  COLOR(RED)
TCHK2A  72                                  COLOR(YLW)
     A            S2PG03         2A  O  5 37
TCHK2A N73                                  COLOR(RED)
TCHK2A  73                                  COLOR(YLW)
     A            S2PG04         2A  O  5 40
TCHK2A N74                                  COLOR(RED)
TCHK2A  74                                  COLOR(YLW)
     A            S2PG05         2A  O  5 43
TCHK2A N75                                  COLOR(RED)
TCHK2A  75                                  COLOR(YLW)
     A            S2PG06         2A  O  5 46
TCHK2A N76                                  COLOR(RED)
TCHK2A  76                                  COLOR(YLW)
     A            S2PG07         2A  O  5 49
TCHK2A N77                                  COLOR(RED)
TCHK2A  77                                  COLOR(YLW)
     A            S2PG08         2A  O  5 52
TCHK2A N78                                  COLOR(RED)
TCHK2A  78                                  COLOR(YLW)
     A            S2PG09         2A  O  5 55
TCHK2A N79                                  COLOR(RED)
TCHK2A  79                                  COLOR(YLW)
     A            S2PG10         2A  O  5 58
TCHK2A N80                                  COLOR(RED)
TCHK2A  80                                  COLOR(YLW)
     A            S2PG11         2A  O  5 61
TCHK2A N81                                  COLOR(RED)
TCHK2A  81                                  COLOR(YLW)
     A            S2PG12         2A  O  5 64
TCHK2A N82                                  COLOR(RED)
TCHK2A  82                                  COLOR(YLW)
     A            S2PG13         2A  O  5 67
TCHK2A N83                                  COLOR(RED)
TCHK2A  83                                  COLOR(YLW)
     A            S2PG14         2A  O  5 70
TCHK2A N84                                  COLOR(RED)
TCHK2A  84                                  COLOR(YLW)
     A            S2PG15         2A  O  5 73
TCHK2A N85                                  COLOR(RED)
TCHK2A  85                                  COLOR(YLW)
     A            S2PG16         2A  O  5 76
TCHK2A N86                                  COLOR(RED)
TCHK2A  86                                  COLOR(YLW)
     A            S2MORE         1A  O  5 79
     A            S2PG17         2A  O  6 31
TCHK2A N11                                  COLOR(RED)
TCHK2A  11                                  COLOR(YLW)
     A            S2PG18         2A  O  6 34
TCHK2A N12                                  COLOR(RED)
TCHK2A  12                                  COLOR(YLW)
     A            S2PG19         2A  O  6 37
TCHK2A N13                                  COLOR(RED)
TCHK2A  13                                  COLOR(YLW)
     A            S2PG20         2A  O  6 40
TCHK2A N14                                  COLOR(RED)
TCHK2A  14                                  COLOR(YLW)
     A            S2PG21         2A  O  6 43
TCHK2A N15                                  COLOR(RED)
TCHK2A  15                                  COLOR(YLW)
     A            S2PG22         2A  O  6 46
TCHK2A N16                                  COLOR(RED)
TCHK2A  16                                  COLOR(YLW)
     A            S2PG23         2A  O  6 49
TCHK2A N17                                  COLOR(RED)
TCHK2A  17                                  COLOR(YLW)
     A            S2PG24         2A  O  6 52
TCHK2A N18                                  COLOR(RED)
TCHK2A  18                                  COLOR(YLW)
     A            S2PG25         2A  O  6 55
TCHK2A N19                                  COLOR(RED)
TCHK2A  19                                  COLOR(YLW)
     A            S2PG26         2A  O  6 58
TCHK2A N20                                  COLOR(RED)
TCHK2A  20                                  COLOR(YLW)
     A            S2PG27         2A  O  6 61
TCHK2A N21                                  COLOR(RED)
TCHK2A  21                                  COLOR(YLW)
     A            S2PG28         2A  O  6 64
TCHK2A N22                                  COLOR(RED)
TCHK2A  22                                  COLOR(YLW)
     A            S2PG29         2A  O  6 67
TCHK2A N23                                  COLOR(RED)
TCHK2A  23                                  COLOR(YLW)
     A            S2PG30         2A  O  6 70
TCHK2A N24                                  COLOR(RED)
TCHK2A  24                                  COLOR(YLW)
     A            S2PG31         2A  O  6 73
TCHK2A N25                                  COLOR(RED)
TCHK2A  25                                  COLOR(YLW)
     A            S2PG32         2A  O  6 76
TCHK2A N26                                  COLOR(RED)
TCHK2A  26                                  COLOR(YLW)
TCHK4A            S2MOR2         1A  O  6 79
     A            H2ZENO         4A  H
TCHK2A            H2IND         32A  H
TCHK3A            H2DEPT         3A  H
TCHK3A            H2NC##        10A  H
TCHK3A            H2REAS        30A  H
     A* ----------------------------------------------------
     A          R CTL020                    SFLCTL(SFL020)
     A*%%TS  SD  20250410  084447  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A  43                                  SFLDROP(CF10)
     A                                      SFLMODE(&N#MOD2)
     A            #RCN02         4S 0H      SFLRCDNBR(CURSOR)
     A            N#MOD2         1A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'APICS ISSUED VS SCANNED   INQUIRY '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  3  2'IAF Part#:'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            F1SHN1         5A  B  3 13DSPATR(HI)
     A  44                                  DSPATR(PC)
     A  45                                  DSPATR(RI)
     A            F1SHN2         5A  B  3 19DSPATR(HI)
     A  45                                  DSPATR(RI)
     A            F1SHN3         2A  B  3 25DSPATR(HI)
     A  45                                  DSPATR(RI)
     A                                  3 28'Total #of Unscanned:'
     A                                      COLOR(RED)
     A            C2UCNT         5Y 0O  3 49EDTCDE(Z)
     A                                      COLOR(RED)
     A                                  3 60'#of re-order:'
     A                                      COLOR(YLW)
     A            C2RCNT         5Y 0O  3 74EDTCDE(Z)
     A                                      COLOR(YLW)
     A*
     A                                  4  2'S'
     A                                      DSPATR(UL)
     A                                  4  4'Lot'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  8'Issued Date-Bin'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 24'Issue#'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 31'Unscanned page#'
     A                                      COLOR(WHT)
      * ----------------------------------------------------
     A          R SFL030                    SFL
TCHK4A*           S3PAGE         2A  O  6  3
TCHK4A            S3PAGE         3A  O  6  3
     A            S3SYDT         8Y 0O  6  9
     A                                      EDTWRD('    /  /  ')
     A            S3SYTM         4Y 0O  6 20
     A                                      EDTWRD('  :  ')
     A            S3NONY         4A  O  6 28
     A            S3NONM        15A  O  6 33
     A            S3NKOJ         1A  O  6 50
     A            S3NUKE         4A  O  6 52
     A            S3SERL        18A  O  6 57
     A            S3SHDT         8Y 0O  7  9
     A                                      EDTWRD('    /  /  ')
     A            S3SHBN         2A  O  7 20
     A            S3ODRN        10A  O  7 24
     A            S3OPNM        20A  O  7 35
     A            S3KSNA        10A  O  7 70
     A          R CTL030
     A                                      CF01
     A                                      CF12
     A                                      SFLCTL(SFL030)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      OVERLAY
     A N61                                  SFLDSP
     A N61                                  SFLDSPCTL
     A  61                                  SFLCLR
     A N62                                  SFLEND(*MORE)
     A  63                                  SFLDROP(CF10)
     A                                      SFLMODE(&N#MOD3)
     A            #RCN03         4  0H      SFLRCDNBR(CURSOR)
     A            N#MOD3         1A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'APICS ISSUED VS SCANNED  -
     A                                       INQUIRY '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
TCHK3A                                  2 38'STOP ALERT:'
TCHK3A N65                                  DSPATR(ND)
TCHK3A                                      COLOR(PNK)
TCHK3A            C3DEPT         3A  O  2 50
TCHK3A N65                                  DSPATR(ND)
TCHK3A                                      COLOR(PNK)
TCHK3A            C3NC##        10A  O  2 54
TCHK3A N65                                  DSPATR(ND)
TCHK3A                                      COLOR(PNK)
     A*
     A                                  3  2'IAF Part#:'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            F1SHN1         5A  O  3 13
     A                                      DSPATR(HI)
     A            F1SHN2         5A  O  3 19
     A                                      DSPATR(HI)
     A            F1SHN3         2A  O  3 25
     A                                      DSPATR(HI)
     A                                  3 28'Lot#:'
     A                                      DSPATR(HI)
     A            C3TENO         3A  O  3 34
     A                                      DSPATR(HI)
TCHK3A            C3REAS        30A  O  3 50
TCHK3A N65                                  DSPATR(ND)
TCHK3A                                      COLOR(PNK)
     A*
     A                                  4  2'Page'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  8'Outgoing date-time'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 28'Delivery To'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 50'F'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 52'Dock'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4 57'Serial number'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A*
     A                                  5  9'Ship Date-Bin'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5 24'Order#'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5 35'Scanned TM.'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  5 70'Update Pgm'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A* ----------------------------------------------------
     A          R FMT099
     A  49                             23  2'Error'
     A  49                                  DSPATR(RI BL)
     A  49        MSG           60A  O 23  8
     A  49                                  DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A  47                             24 21'F10:Show/Hide 2nd Line'
     A  47                                  DSPATR(RI)
     A  48                             24 46'F12:Previous'
     A  48                                  DSPATR(RI)
