     A** ALDPW27V  ******************************************
     A*  SERVICE PARTS ORDER VERIFICATION CHECK             *
     A*                                                     *
     A*   LEC ....................... 2021/10/11            *
     A*******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R FMT010
     A                                      CF01
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' SERVICE PARTS ORDER VERIFICATION '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 27'Packing List Barcode'
     A            F1SERL         9A  B  5 49
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A*-----------------------------------------------------
     A          R SFL010                    SFL
     A            S1MHN1         5A  O  8  5COLOR(PNK)
     A            S1MHN2         5A  O  8 11COLOR(PNK)
     A            S1MHN3         5A  O  8 17COLOR(PNK)
     A            S1MHN4         5A  O  8 23COLOR(PNK)
     A            S1HPOS         1A  O  8 30COLOR(PNK)
     A*
     A          R CTL010                    SFLCTL(SFL010)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A N61                                  SFLDSP
     A N61                                  SFLDSPCTL
     A  61                                  SFLCLR
     A N62                                  SFLEND(*MORE)
     A            #RCN01         4S 0H      SFLRCDNBR
     A            N#MOD1         1A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' SERVICE PARTS ORDER VERIFICATION '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5  5'Order #'
     A                                      COLOR(WHT)
     A                                  5 19'Dock'
     A                                      COLOR(WHT)
     A                                  5 27'Ship Date'
     A                                      COLOR(WHT)
     A                                  3 24'Yet to be Scanned to the Case Labe-
     A                                      l'
     A                                      COLOR(PNK)
     A                                  7  5'Part Number'
     A                                      COLOR(WHT)
     A            F1ODRN        12A  O  6  5COLOR(BLU)
     A            F1HOME         2A  O  6 20COLOR(BLU)
     A            F1NYMD         8Y 0O  6 27COLOR(BLU)
     A                                      EDTWRD('    /  /  ')
     A                                  7 29'Home'
     A                                      COLOR(WHT)
      * ----------------------------------------------------
     A          R FMT099
     A  49                             23  2'Error'
     A  49                                  DSPATR(RI BL)
     A  49        MSG           60A  O 23  8
     A  49                                  DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A  48                             24 51'F12:Previous'
     A  48                                  DSPATR(RI)
