     A* TCHK1 03/08/10 CREATE(COPY FROM ALDPW65)
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A            #PGM           8A  O  1  2
     A                                  1 15'** SHIPPING VERIFICATION -
     A                                      ERROR LOG LIST **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  6 23'DATE:'
     A                                      DSPATR(HI)
     A            D@FROM         8Y 0B  6 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 38'TO'
     A                                      DSPATR(HI)
     A            D@TO           8Y 0B  6 41EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  7 29'YYYYMMDD'
     A                                  7 41'YYYYMMDD'
     A                                 10 16'Select List-
     A                                      (any characters):'
     A                                      DSPATR(HI)
     A            D@L1           1A  B 11 29
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 11 31'Error Log'
     A            D@L2           1A  B 12 29
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 12 31'Complete'
     A            D@L3           1A  B 13 29
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 13 31'ImComplete'
     A            D@L4           1A  B 14 29
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 14 31'Cancel'
     A                                 18 12'The list will come out from the Pr-
     A                                      inter in TL area'
     A                                      DSPATR(HI)
     A                                 23  2'F1:END'
     A                                 23 14'F5:PRINT'
