     A** ALDPW81 *****************************************
     A*   .. OUT-GOING TRACK DATA FILE RESTORE ..        *
     A*       K.OKACHI                  1998.03.25       *
     A***************************************** ALDPW81 **
     A                                      CHGINPDFT
      *
     A          R ALDPW811
     A                                      CF01(01)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 20'OUT-GOING TRACK DATA FILE +
     A                                      RESTORE'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT ALDPW81'
      *
     A                                  6 30'INPUT RESTORED MONTH'
     A                                      DSPATR(RI)
     A            HIZ            6A  B  8 37DSPATR(CS)
     A  99                                  DSPATR(RI)
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60   O 22 18
      *
     A                                 24  4' EXIT '
     A                                 24 15' CMD-1 ' DSPATR(RI)
     A                                 24 24' OK '
     A                                 24 35' CMD-5 ' DSPATR(RI)
