     A** ALDPW5A *****************************************************
     A* UNSCANNED APICS IN 3PT PASSTHRU RETRIEVAL INQUIRY            *
     A*      LEC.       2016.08.19                                   *
     A****************************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R SCREEN1
     A                                      CF03(03)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 22' ** UNSCANNED APICS FOR P/T RETRIE-
     A                                      VAL INQ ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'    ALDR5A  '
     A                                  5 15'Ship Date'
     A            D1SDFR         8Y 0B  5 29DSPATR(CS)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  5 39'-'
     A            D1SDTO         8Y 0B  5 42DSPATR(CS)
     A                                      EDTCDE(Z)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  7 13'Internal Part#'
     A            D1PRT1         5A  B  7 31DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A  99                             23 11' ERR '
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            D1ERR         60O  O 23 18
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  7'BACK'
     A                                 24 12' F3 '
     A                                      DSPATR(RI)
     A                                  3 31'From'
     A                                  3 45'To'
     A            D1PRT2         5A  B  7 37DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            D1PRT3         2A  B  7 43DSPATR(CS)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A*---------------------------------------*
     A          R SFL1                      SFL
     *****        S1SEL          1A  B  8  2DSPATR(CS)
     *****                                  VALUES('M' ' ')
     ** 35                                  DSPATR(RI)
     ** 35                                  DSPATR(PC)
     A            S1SDAT         8Y 0O  8  5EDTWRD('    /  /  ')
     A            S1STIM         6Y 0O  8 17EDTWRD('  :  :  ')
     A*
     A            RRN1           4Y 0H
     A            S1ZETI         4S 0O  8 28
     A            S1PRT1         5A  O  8 34
     A            S1PRT2         5A  O  8 40
     A            S1PRT3         2A  O  8 43
     A            S1LOTN         3A  O  8 53
     A            S1PAGE         2A  O  8 59
     A            S1TOKU         4   O  8 64
     A            S1NONY         4   O  8 71
     A*
     A*---------------------------------------*
     A*
     A          R SFLCTL                    SFLCTL(SFL1)
     A                                      SFLSIZ(0024)
     A                                      SFLPAG(0012)
     A  72                                  SFLDSPCTL
     A  73                                  SFLDSP
     A  71                                  SFLCLR
     A  50                                  SFLEND(*MORE)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CF03(03)
     A*
     A            @SFRC1         4S 0H      SFLRCDNBR(CURSOR)
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' ** UNSCANNED APICS FOR P/T RETRIE-
     A                                      VAL INQ ** '
     A                                      DSPATR(RI)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  4  3'SHIP DATE'
     A                                      DSPATR(HI)
     A            D2SDFR         8Y 0O  4 13EDTWRD('    /  /  ')
     A                                  4 24'-'
     A            D2SDTO         8Y 0O  4 26EDTWRD('    /  /  ')
     A*
     A                                  5  4'Internal Part#'
     A                                      DSPATR(HI)
     A            D2PRT1         5A  O  5 20
     A            D2PRT2         5A  O  5 26
     A            D2PRT3         2A  O  5 32
     A*
     A*
     A                                  7  2'   SHIP DATE     TIME      ID     -
     A                                      PART#           LOT#  PAGE  CUST#  -
     A                                      DELV'
     A                                      DSPATR(UL)
     A          R FOOTER
     A                                      OVERLAY PROTECT
      *********                        21  2'|'
      *********                        22  2'+--->  M  : DETAIL'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            S1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                   + 2'PAGE UP/DOWN'
     A                                      DSPATR(RI)
     A          R FOOTER2
     A                                      OVERLAY PROTECT
      *
      *
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                   + 2'PAGE UP/DOWN'
     A                                      DSPATR(RI)
