     A* TCHK1 09/30/10 CREATE
     A* TCHK2 09/24/12 ADD RK-METAL
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A* ----------------------------------------------------
     A          R FMT000
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
     A                                  5  2'USER CODE:'
     A            F0USRC         6Y 0B  5 13DSPATR(UL)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  9  1'ENTER=NEXT'
     A                                 10  1'F3=END'
     A                                      DSPATR(RI)
     A            F0ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT100
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
     A                                  4  2'<<< LOCATION >>>'
     A            F1LOC         10A  B  6  5CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A            F1ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT200
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
     A                                  4  2'<< ASJ KANBAN>>'
     A                                      DSPATR(HI)
     A            F2BARC        17A  B  6  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A                                 10  1'F7=LOCATION'
     A                                      DSPATR(RI)
     A            F2ERR         16A  O 12  1DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT300
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
TCHK2A                                  4  2'<< FRWY/RKMTL >>'
     A                                      DSPATR(HI)
     A                                  5  5'KANBAN'
     A                                      DSPATR(HI)
     A            F3BARC        15A  B  6  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A                                 10  1'F7=LOCATION'
     A                                      DSPATR(RI)
     A            F3ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT400
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
TCHK2A                                  4  2'<< FRWY/RKMTL >>'
     A                                      DSPATR(HI)
     A                                  5  7'TAG'
     A                                      DSPATR(HI)
     A            F4BARC        15A  B  6  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A                                 10  1'F7=LOCATION'
     A                                      DSPATR(RI)
     A            F4ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT450
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
     A                                  4  2'<< FRWY/RKMTL >>'
     A                                      DSPATR(HI)
     A                                  5  6'LOT ID'
     A                                      DSPATR(HI)
     A            F4LOT         20A  B  6  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A                                 10  1'F7=LOCATION'
     A                                      DSPATR(RI)
     A            F4ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT500
     A                                  1  5'CONVEYANCE'
     A                                      DSPATR(RI)
     A                                  2  7'WASHER'
     A                                      DSPATR(RI)
     A                                  4  2'<< RETRIEVAL >>'
     A                                      DSPATR(HI)
     A                                  5  5'KANBAN'
     A                                      DSPATR(HI)
     A            F5BARC        15A  B  6  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A                                  9  1'F3=END'
     A                                      DSPATR(RI)
     A                                 10  1'F7=LOCATION'
     A                                      DSPATR(RI)
     A            F5ERR         16A  O 12  1
     A                                      DSPATR(BL)
     A* ----------------------------------------------------
     A          R FMT900
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2'OO    OO           '
     A                                  7  2' OOOOOO            '
     A                                  8  2'        KK    KKK  '
     A                                  9  2'        KK   KK    '
     A                                 10  2'        KK  KK     '
     A                                 11  2'        KKKKK      '
     A                                 12  2'        KK  KK     '
     A                                 13  2'        KK   KK    '
     A                                 14  2'        KK    KKK  '
     A                                 16  2'ENTER:CONTINUE'
     A* ----------------------------------------------------
     A          R FMT999
     A                                  1  2'*******************'
     A                                      DSPATR(BL)
     A                                  2  2'*******************'
     A                                      DSPATR(BL)
     A                                  3  2'*******************'
     A                                      DSPATR(BL)
     A                                  4  2'*******************'
     A                                      DSPATR(BL)
     A                                  5  2'*                 *'
     A                                      DSPATR(BL)
     A                                  6  2'*                 *'
     A                                      DSPATR(BL)
     A                                  7  2'*'
     A                                      DSPATR(BL)
     A            F99ER1        15A  O  7  4
     A                                      DSPATR(BL)
     A                                  7 20'*'
     A                                      DSPATR(BL)
     A                                  8  2'*'
     A                                      DSPATR(BL)
     A            F99ER2        15A  O  8  4
     A                                      DSPATR(BL)
     A                                  8 20'*'
     A                                      DSPATR(BL)
     A                                  9  2'*                 *'
     A                                      DSPATR(BL)
     A                                 10  2'*                 *'
     A                                      DSPATR(BL)
     A                                 11  2'*******************'
     A                                      DSPATR(BL)
     A                                 12  2'*******************'
     A                                      DSPATR(BL)
     A                                 13  2'*******************'
     A                                      DSPATR(BL)
     A                                 14  2'*******************'
     A                                      DSPATR(BL)
     A                                 16  2'ENTER:CONTINUE'
     A                                      DSPATR(HI)
