     A**** ALFPW60 *****************************************
     A* CONTAINER TRANSFER - 2PT SCAN                      *
     A*   LEC....................    2019.12.04            *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R ALFPW601
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      CF01(01)
     A                                  1  2' ** CONTAINER TRANSFER ** '
     A                                      DSPATR(RI)
     A                                  3  7' APICS KANBAN '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            D1BAR1        25A  B  5  3DSPATR(UL)
     A                                 19 13'F1:EXIT'
     A            D1BAR2        25A  B  6  3DSPATR(UL)
     A            D1BAR3        25A  B  7  3DSPATR(UL)
     A            D1BAR4        25A  B  8  3DSPATR(UL)
     A            D1BAR5        25A  B  9  3DSPATR(UL)
     A            D1BAR6        25A  B 10  3DSPATR(UL)
     A            D1BAR7        25A  B 11  3DSPATR(UL)
     A            D1BAR8        25A  B 12  3DSPATR(UL)
     A            D1BAR9        25A  B 13  3DSPATR(UL)
     A            D1BA10        25A  B 14  3DSPATR(UL)
     A                                 17  8'Total -'
     A            D1TOTL         5Y 0O 17 16COLOR(WHT)
     A                                      EDTCDE(4)
     A            D1#PGM        10   O  1 69
      *
     A          R ALFPW602
     A                                      TEXT('Y')
     A                                      CF01(01)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                  1  2'** CONTAINER TRANSFER **  '
     A                                      DSPATR(RI)
     A                                  3  3'PART NO.'
     A            D2PART        20A  O  3 12
     A                                  4  3'LOT NO.'
     A                                  6  3' PASSTHRU KANBAN '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            D2PTBC        20A  B  7  3DSPATR(UL)
     A                                 14  2'F1:BACK'
     A            D2LOT#         3   O  4 12
     A            D2PAGE         2   O  4 16
     A            D1#PGM        10   O  1 68
      *
      * ----------------------------------------------------
     A          R ALFPW603
     A                                  1  2' ** CONTAINER TRANSFER ** '
     A                                      DSPATR(RI)
     A*
     A                                  4  4'***  LOT ID  ***'
     A            F5LTID         8A  B  5  8DSPATR(UL)
     A  61                                  DSPATR(RI)
     A*
     A            F5LOT1         8A  O  6  8COLOR(PNK)
     A            F5LOT2         8A  O  7  8COLOR(PNK)
     A            F5LOT3         8A  O  8  8COLOR(PNK)
     A            F5LOT4         8A  O  9  8COLOR(PNK)
     A*
     A            F5ERR         16A  O 11  4DSPATR(BL)
     A                                 13  2'F3: BACK'
     A                                 13 15'F5: DONE'
     A*
      * ----------------------------------------------------
     A          R ALFPW095
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO  KK    KKK'
     A                                  6  2'OO    OO  KK   KK  '
     A                                  7  2' OOOOOO   KK  KK   '
     A                                  8  2'          KKKKK    '
     A                                  9  2'          KK  KK   '
     A                                 10  2'          KK   KK  '
     A                                 11  2'          KK    KKK'
     A                                 14  2'ENTER:CONTINUE'
     A          R ALFPW098
     A                                      OVERLAY
     A  90
     AO 99                                  ALARM
      *
     A          R ALFPW099
     A                                      OVERLAY
     A                                  1  5' ** CONTAINER TRANSFER ERROR ** '
     A                                      DSPATR(RI)
     A                                  4 13'***          ***'
     A                                      COLOR(RED)
     A                                  5 13'  ***      ***  '
     A                                      COLOR(RED)
     A                                  6 13'    ***  ***    '
     A                                      COLOR(RED)
     A                                  7 13'      ****      '
     A                                      COLOR(RED)
     A                                  8 13'    ***  ***    '
     A                                      COLOR(RED)
     A                                  9 13'  ***      ***  '
     A                                      COLOR(RED)
     A                                 10 13'***          ***'
     A                                      COLOR(RED)
     A            D9ERR         25A  O 12  8DSPATR(RI)
     A                                 14  2'ENTER:CONTINUE'
     A                                      COLOR(WHT)
     A            D1#PGM        10   O  1 68
