     A*** ALFPW00 ******************************************
     A* CONVEYANCE PULL SCAN MENU                          *
     A*     LEC.          2018.01.29                       *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF03(03)
     A                                  1  2'CONVEYANCE PULL MENU'
     A                                  3  2'USER CODE :'
     A            USRCD          6Y 0O  3 14
     A                                  5  2'1 : WASHER PULL SCAN'
     A                                  6  2'2 : ASJ WASHER IN-PROCESS SCAN'
     A                                  7  2'3 : WIRE PULL FROM LOC'
     A                                  8  2'4 : WIRE PULL INTO LOC'
     A                                  9  2'5 : OUTSOURCE SCAN'
     A                                 10  2'6 : WIRE RECEIVE SCAN'
     A                                 11  2'7 : WIRE STORAGE SCAN'
     A                                 12  2'8 : CV WASHER STORE IN'
     A                                 13  2'9 : CV WASHER PULL'
     A            D1SEL          2Y 0B 15  2DSPATR(UL)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 16  2'F3=BACK'
     A            MSG           15A  O 17  2
