     A** ALGPW20 ********************************************
     A*  HEAT TREAT PRE-LOAD SIGN PRINT                     *
     A*                                                     *
     A* LEC   : 02/25/20 CREATE                             *
     A*******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A* ----------------------------------------------------
     A          R FMT100
     A                                      OVERLAY
     A                                  1  2'DATE'
     A                                  1  7DATE
     A                                      EDTCDE(Y)
     A                                  1 25' PRINT HEAT TREATMENT PRE-LOAD SIG-
     A                                      N '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'TIME'
     A                                  2  7TIME
     A  99        MSG           60A  O 23  8
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 12'F5:Print Sign'
     A                                      DSPATR(RI)
     A                                  5 12'Machine #'
     A            HTMCH#         3A  B  5 23DSPATR(UL)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                      COLOR(WHT)
     A                                  6 17'Time'
     A            HTTIME         3Y 0B  6 23DSPATR(UL)
     A                                      CHECK(RZ)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                      COLOR(WHT)
     A                                  7 10'Temperature'
     A            HTTEMP         3Y 0B  7 23DSPATR(UL)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      COLOR(WHT)
     A                                  8 17'CO2%'
     A            HTCO2          3Y 2B  8 23
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A                                  8 34'ex. 9.99'
