     A** ALTPW10 ********************************************
     A*  NONCONFORMANCE SHEET PRINT                         *
     A*                                                     *
     A* LEC   : 09/21/2022  CREATE                          *
     A*******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A* ----------------------------------------------------
     A          R FMT100
     A                                      OVERLAY
     A                                  1  3' NON-CONFORMANCE SHEET '
     A                                      DSPATR(RI)
     A            @@PROC         8A  O  2  9DSPATR(RI)
     A            #PGM           8A  O  1 72
     A  99        MSG           60A  O 11  3
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 13  4'F3:Back'
     A                                      DSPATR(RI)
     A                                  3  2'<< Scan Kanban QR Code >>'
     A            F1BARC       400A  B  5  1COLOR(WHT)
     A*
     A          R FMT200
     A                                      OVERLAY
     A                                  1  4' NON-CONFORMANCE SHEET '
     A                                      DSPATR(RI)
     A            @@PROC         8A  O  2  9DSPATR(RI)
     A  99        MSG           60A  O 10  2
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 12  9'F3:Back'
     A                                      DSPATR(RI)
     A                                  3  6'Sample Sheet Barcode'
     A            F2BARC        12A  B  5  9COLOR(WHT)
     A*
     A          R FMT300
     A                                      CF05
     A                                      CF07
     A                                      OVERLAY
     A                                  1  4' NON-CONFORMANCE SHEET '
     A                                      DSPATR(RI)
     A            @@PROC         8A  O  2  9DSPATR(RI)
     A  99        MSG           60A  O 10  2
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 12  2'F3:Back'
     A                                 12 15'F5:Done'
     A                                      DSPATR(RI)
     A                                  3  6'Lot Id Barcode'
     A            F3LOT#         8A  B  5  9COLOR(WHT)
     A            F3LOT1         8A  O  6  9COLOR(PNK)
     A            F3LOT2         8A  O  7  9COLOR(PNK)
     A            F3LOT3         8A  O  8  9COLOR(PNK)
     A                                 13  8'F7:F/Way'
     A*
     A          R FMT400
     A                                      OVERLAY
     A                                      CF05
     A                                      CF08
     A                                  1  3' NON-CONFORMANCE SHEET '
     A                                      DSPATR(RI)
     A            F4MACH         3A  O  4  3COLOR(PNK)
     A            F4TSQ#         4Y 0O  4 13COLOR(PNK)
     A            F4TTLW         6Y 1O  5  3EDTCDE(1)
     A                                      COLOR(PNK)
     A            F4CONT         3Y 0O  4  8COLOR(PNK)
     A                                      EDTCDE(Z)
     A            F4SHIN        14A  O  3  3COLOR(PNK)
     A            F4LOT0        25A  O  3 19COLOR(PNK)
     A            F4LOT1         7A  O  4 19COLOR(PNK)
     A            F4LOT2         7A  O  4 28COLOR(PNK)
     A            F4LOT3         7A  O  5 19COLOR(PNK)
     A            F4LOT4         7A  O  5 28COLOR(PNK)
     A            F4CODE         3A  B  6 12COLOR(WHT)
     A                                  6  3'N/C Code'
     A            F4MESG        50A  O  7  3COLOR(PNK)
     A  99        MSG           60A  O  9  3
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 11  4'F3:Back'
     A                                 12  7'F5:Print Sheet'
     A                                      DSPATR(RI)
     A            F4AREA        15A  O  6 17COLOR(PNK)
     A                                 11 14'F8:Code Inquiry'
     A            @@PROC         8A  O  2  9DSPATR(RI)
     A                                  5 13'Kg'
     A                                      COLOR(PNK)
     A          R FMT500
     A                                      OVERLAY
     A                                  1  4' NON-CONFORMANCE SHEET '
     A                                      DSPATR(RI)
     A            @@PROC         8A  O  2  9DSPATR(RI)
     A  99        MSG           60A  O 10  2
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 12  2'F3:Back'
     A                                  3  6'Freeway Lot Id'
     A            F5LOT#        25A  B  5  2COLOR(WHT)
