     A**** ALXPW12 *****************************************
     A* SECONDARY TREATMENT PULL/PUSH SCAN                 *
     A*   COPIED                     2025.04.25            *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
      *
      ******************************************************
     A          R ALDPW991
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF06(06)
     A                                      CF07(07)
     A                                      CF08(08)
     A                                      CF09(09)
     A                                      CF10(10)
     A                                      CF11(11)
     A                                      CF12(12)
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A                                  5  5' LOCATION BARCODE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            D1BAR1        20A  B  6  5DSPATR(UL)
     A                                      CHECK(ER)
     A                                 14  2'F1:Exit'
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
      *
      *****************************************************************
     A          R ALDPW992
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF06(06)
     A                                      CF07(07)
     A                                      CF08(08)
     A                                      CF09(09)
     A                                      CF10(10)
     A                                      CF11(11)
     A                                      CF12(12)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A                                  4  4' Location '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            D1BAR1        20A  O  5  4
     A                                  6  4'PART NO.'
     A            D2SHN         14A  O  6 13
     A                                  8  2'* Scan Plastic Kanban  *'
     A                                  9  2'*      QR Code         *'
     A                                 11  7'Scan Count'
     A            D2CNT          3  0O 11 18EDTCDE(3)
     A                                      COLOR(PNK)
     A                                 14  2'F1: Back'
     A                                 14 13'ENTER: Continue'
      *
     A            D2BAR1       512A  B 16  1DSPATR(UL)
     A                                      CHECK(ER)
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
      *
      *****************************************************************
     A          R ALDPW993
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF06(06)
     A                                      CF07(07)
     A                                      CF08(08)
     A                                      CF09(09)
     A                                      CF10(10)
     A                                      CF11(11)
     A                                      CF12(12)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A                                  4  4' Location '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            D1BAR1        20A  O  5  4
     A                                  6  4'PART NO.'
     A            D2SHN         14A  O  6 13
     A                                  8  2'* Scan APICS Kanban    *'
     A                                  9  2'*      QR Code         *'
     A                                 11  4'Scan Count:'
     A            D3CNT          3  0O 11 16EDTCDE(3)
     A                                      COLOR(PNK)
     A                                 14  2'F1: Back'
     A                                 14 13'ENTER: Continue'
      *
     A            D3BAR1       512A  B 16  1DSPATR(UL)
     A                                      CHECK(ER)
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
     A                                 11 20'of'
     A            D2CNT          3  0O 11 23EDTCDE(3)
     A                                      COLOR(PNK)
     A*
     A*****************************************************************
     A          R ALDPW994
     A                                      CF01(01)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A            D1BAR1        20A  O  4  3COLOR(WHT)
     A            D2SHN         14A  O  5  3COLOR(WHT)
     A                                  9  5'***  LOT ID  ***'
     A                                 16  2'F1: Back'
     A*
     A            D4LOT          8A  B 10  9DSPATR(UL)
     A*
     A            D4LOT1         8A  O 11  9COLOR(PNK)
     A            D4LOT2         8A  O 12  9COLOR(PNK)
     A            D4LOT3         8A  O 13  9COLOR(PNK)
     A            D4LOT4         8A  O 14  9COLOR(PNK)
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
     A            #LOTS          1S 0O  7 10COLOR(BLU)
     A                                  7 12'Lot Tags'
     A                                      COLOR(BLU)
     A                                  7  5'Scan'
     A                                      COLOR(BLU)
     A*
     A*****************************************************************
     A          R ALDPW995
     A                                      CF01(01)
     A  99                                  ALARM
     A                                      OVERLAY
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
     A            D1BAR1        20A  O  4  3COLOR(WHT)
     A            D2SHN         14A  O  5  3COLOR(WHT)
     A                                  7  5'*** PRELOAD LOCATION ***'
     A*
     A            D5BAR1        10A  B  8 12DSPATR(UL)
     A*
     A                                 14  2'F1: Back'
     A            ##PUC          6   O  4 31COLOR(PNK)
      *
      *****************************************************************
     A          R ALDPW900
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2' OOOOOO            '
     A                                  7  2'        KK    KKK  '
     A                                  8  2'        KK   KK    '
     A                                  9  2'        KK  KK     '
     A                                 10  2'        KKKKK      '
     A                                 11  2'        KK  KK     '
     A                                 12  2'        KK   KK    '
     A                                 13  2'        KK    KKK  '
     A                                 14  2'ENTER:CONTINUE'
     A                                      DSPATR(HI)
      *
      *****************************************************************
     A          R ALDPW998
     A                                      OVERLAY
     A  90
     AO 99                                  ALARM
      *
      *****************************************************************
     A          R ALDPW999
     A                                      OVERLAY
     A                                  1  3' CONVEYANCE PULL/PUSH SCAN '
     A                                      DSPATR(RI)
     A                                  5  6'***          ***'
     A                                  6  6'  ***      ***  '
     A                                  7  6'    ***  ***    '
     A                                  8  6'      ****      '
     A                                  9  6'    ***  ***    '
     A                                 10  6'  ***      ***  '
     A                                 11  6'***          ***'
     A            D9ERR         25A  O 14  2DSPATR(RI)
     A                                  2  3' ** Secondary Treatment ** '
     A                                      DSPATR(RI)
      *
     A          R DSP95
     A                                      CF08(08)
      *
     A                                  1  2'********************'
     A                                  2  2'********************'
     A                                  3  2'********************'
     A                                  4  2'*                  *'
     A                                  5  2'*  A  L  E  R  T   *'
     A                                  6  2'*                  *'
     A                                  7  2'*N/C#:'
     A            D95NC#        10A  O  7  9
     A                                  7 21'*'
     A                                  8  2'*                  *'
     A                                  9  2'*DEPT:'
     A            D95DEP         3A  O  9  9
     A                                  9 21'*'
     A                                 10  2'*                  *'
     A                                 11  2'********************'
     A                                 12  2'********************'
     A                                 13  2'********************'
     A                                 14  2'ENTER:CONTINUE'
      ********************************************************************
     A          R DSP98
     A                                  2  2'********************'
     A                                  3  2'********************'
     A                                  4  2'********************'
     A                                  5  2'*                  *'
     A                                  6  2'*                  *'
     A                                  7  2'*'
     A            MSG           16A  O  7  4
     A                                  7 21'*'
     A                                  8  2'*                  *'
     A                                  9  2'*'
     A            MSG@2         16A  O  9  4
     A                                  9 21'*'
     A                                 10  2'*                  *'
     A                                 11  2'********************'
     A                                 12  2'********************'
     A                                 13  2'********************'
     A                                 14  2'ENTER:CONTINUE'
