     A*%%TS  SD  20161101  145105  I0777       REL-V7R1M0  5770-WDS
     A*** ALXPW00 ******************************************
     A* TEST                                               *
%0001A*     T.SAKAKI      2017.02.28   ADD OPTN '4'        *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20161101  145105  I0777       REL-V7R1M0  5770-WDS
     A                                      CF03(03)
     A                                  1  2'CONVEYANCE SCANNING'
     A                                  3  2'USER CODE :'
     A            USRCD          6Y 0O  3 14
     A                                  5  2'1 : LOT TAG SCAN'
     A                                  6  2'2 : REPLACE SCAN'
     A                                  7  2'3 : INTRA STORE IN'
%0001A                                  8  2'4 : 4 POINT SCAN'
%0001A                                  9  2'5 : STOCK CHECK'
     A            D1SEL          2Y 0B 12  2DSPATR(UL)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                 13  2'F3=BACK'
     A            MSG           15A  O 14  2
     A                                 15  2'XXX'
