     A** AM#PW71 *****************************************************
     A* WORKING SHIFT M/F                                            *
     A*       ITS.      2015.06.23                                   *
     A****************************************************************
      *
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
      *----------------------------*
      * 1ST                        *
      *----------------------------*
     A          R AM#PW711
     A                                      CF01(01)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 26' ** WORKING SHIFT M/F ** '
     A                                      DSPATR(RI)
     A                                  1 69'FMT AM#PW71'
      *
     A                                  3  5'SHIFT  START  END    +
     A                                       SUN  MON  TUE  WED  +
     A                                       THU  FRI  SAT  '
     A                                      DSPATR(UL)
     A            D1SFT1         1A     4  7DSPATR(HI)
     A            D1SFT2         1A     5  7DSPATR(HI)
     A            D1SFT3         1A     6  7DSPATR(HI)
     A            D1SFT4         1A     7  7DSPATR(HI)
     A            D1SFT5         1A     8  7DSPATR(HI)
      * 1
     A            D1STR1         4Y 0B  4 12DSPATR(CS)
     A  31 41                               DSPATR(RI PC)
     A                                  4 17'-'
     A            D1END1         4Y 0B  4 19DSPATR(CS)
     A  32 41                               DSPATR(RI PC)
     A            D1SUN1         1A  B  4 27DSPATR(CS)
     A  33 41                               DSPATR(RI PC)
     A            D1MON1         1A  B  4 32DSPATR(CS)
     A  34 41                               DSPATR(RI PC)
     A            D1TUE1         1A  B  4 37DSPATR(CS)
     A  35 41                               DSPATR(RI PC)
     A            D1WED1         1A  B  4 42DSPATR(CS)
     A  36 41                               DSPATR(RI PC)
     A            D1THU1         1A  B  4 47DSPATR(CS)
     A  37 41                               DSPATR(RI PC)
     A            D1FRI1         1A  B  4 52DSPATR(CS)
     A  38 41                               DSPATR(RI PC)
     A            D1SAT1         1A  B  4 57DSPATR(CS)
     A  39 41                               DSPATR(RI PC)
      * 2
     A            D1STR2         4Y 0B  5 12DSPATR(CS)
     A  31 42                               DSPATR(RI PC)
     A                                  5 17'-'
     A            D1END2         4Y 0B  5 19DSPATR(CS)
     A  32 42                               DSPATR(RI PC)
     A            D1SUN2         1A  B  5 27DSPATR(CS)
     A  33 42                               DSPATR(RI PC)
     A            D1MON2         1A  B  5 32DSPATR(CS)
     A  34 42                               DSPATR(RI PC)
     A            D1TUE2         1A  B  5 37DSPATR(CS)
     A  35 42                               DSPATR(RI PC)
     A            D1WED2         1A  B  5 42DSPATR(CS)
     A  36 42                               DSPATR(RI PC)
     A            D1THU2         1A  B  5 47DSPATR(CS)
     A  37 42                               DSPATR(RI PC)
     A            D1FRI2         1A  B  5 52DSPATR(CS)
     A  38 42                               DSPATR(RI PC)
     A            D1SAT2         1A  B  5 57DSPATR(CS)
     A  39 42                               DSPATR(RI PC)
      * 3
     A            D1STR3         4Y 0B  6 12DSPATR(CS)
     A  31 43                               DSPATR(RI PC)
     A                                  6 17'-'
     A            D1END3         4Y 0B  6 19DSPATR(CS)
     A  32 43                               DSPATR(RI PC)
     A            D1SUN3         1A  B  6 27DSPATR(CS)
     A  33 43                               DSPATR(RI PC)
     A            D1MON3         1A  B  6 32DSPATR(CS)
     A  34 43                               DSPATR(RI PC)
     A            D1TUE3         1A  B  6 37DSPATR(CS)
     A  35 43                               DSPATR(RI PC)
     A            D1WED3         1A  B  6 42DSPATR(CS)
     A  36 43                               DSPATR(RI PC)
     A            D1THU3         1A  B  6 47DSPATR(CS)
     A  37 43                               DSPATR(RI PC)
     A            D1FRI3         1A  B  6 52DSPATR(CS)
     A  38 43                               DSPATR(RI PC)
     A            D1SAT3         1A  B  6 57DSPATR(CS)
     A  39 43                               DSPATR(RI PC)
      * 4
     A            D1STR4         4Y 0B  7 12DSPATR(CS)
     A  31 44                               DSPATR(RI PC)
     A                                  7 17'-'
     A            D1END4         4Y 0B  7 19DSPATR(CS)
     A  32 44                               DSPATR(RI PC)
     A            D1SUN4         1A  B  7 27DSPATR(CS)
     A  33 44                               DSPATR(RI PC)
     A            D1MON4         1A  B  7 32DSPATR(CS)
     A  34 44                               DSPATR(RI PC)
     A            D1TUE4         1A  B  7 37DSPATR(CS)
     A  35 44                               DSPATR(RI PC)
     A            D1WED4         1A  B  7 42DSPATR(CS)
     A  36 44                               DSPATR(RI PC)
     A            D1THU4         1A  B  7 47DSPATR(CS)
     A  37 44                               DSPATR(RI PC)
     A            D1FRI4         1A  B  7 52DSPATR(CS)
     A  38 44                               DSPATR(RI PC)
     A            D1SAT4         1A  B  7 57DSPATR(CS)
     A  39 44                               DSPATR(RI PC)
      * 5
     A            D1STR5         4Y 0B  8 12DSPATR(CS)
     A  31 45                               DSPATR(RI PC)
     A                                  8 17'-'
     A            D1END5         4Y 0B  8 19DSPATR(CS)
     A  32 45                               DSPATR(RI PC)
     A            D1SUN5         1A  B  8 27DSPATR(CS)
     A  33 45                               DSPATR(RI PC)
     A            D1MON5         1A  B  8 32DSPATR(CS)
     A  34 45                               DSPATR(RI PC)
     A            D1TUE5         1A  B  8 37DSPATR(CS)
     A  35 45                               DSPATR(RI PC)
     A            D1WED5         1A  B  8 42DSPATR(CS)
     A  36 45                               DSPATR(RI PC)
     A            D1THU5         1A  B  8 47DSPATR(CS)
     A  37 45                               DSPATR(RI PC)
     A            D1FRI5         1A  B  8 52DSPATR(CS)
     A  38 45                               DSPATR(RI PC)
     A            D1SAT5         1A  B  8 57DSPATR(CS)
     A  39 45                               DSPATR(RI PC)
      *
     A                                  9 27'INPUT ''*'' +
     A                                       IF THE SHIFT WORKING.'
     A                                      DSPATR(HI)
      *
     A                                 10  5'BREAK TIME'
     A            D1BST1         4Y 0B 11  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN1)
     A  31 51                               DSPATR(RI PC)
     A                                 11 10'-'
     A            D1BEN1         4Y 0B 11 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST2)
     A  32 51                               DSPATR(RI PC)
     A            D1BST2         4Y 0B 12  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN2)
     A  31 52                               DSPATR(RI PC)
     A                                 12 10'-'
     A            D1BEN2         4Y 0B 12 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST3)
     A  32 52                               DSPATR(RI PC)
     A            D1BST3         4Y 0B 13  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN3)
     A  31 53                               DSPATR(RI PC)
     A                                 13 10'-'
     A            D1BEN3         4Y 0B 13 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST4)
     A  32 53                               DSPATR(RI PC)
     A            D1BST4         4Y 0B 14  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN4)
     A  31 54                               DSPATR(RI PC)
     A                                 14 10'-'
     A            D1BEN4         4Y 0B 14 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST5)
     A  32 54                               DSPATR(RI PC)
     A            D1BST5         4Y 0B 15  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN5)
     A  31 55                               DSPATR(RI PC)
     A                                 15 10'-'
     A            D1BEN5         4Y 0B 15 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST6)
     A  32 55                               DSPATR(RI PC)
     A            D1BST6         4Y 0B 16  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN6)
     A  31 56                               DSPATR(RI PC)
     A                                 16 10'-'
     A            D1BEN6         4Y 0B 16 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST7)
     A  32 56                               DSPATR(RI PC)
     A            D1BST7         4Y 0B 17  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN7)
     A  31 57                               DSPATR(RI PC)
     A                                 17 10'-'
     A            D1BEN7         4Y 0B 17 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST8)
     A  32 57                               DSPATR(RI PC)
     A            D1BST8         4Y 0B 18  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN8)
     A  31 58                               DSPATR(RI PC)
     A                                 18 10'-'
     A            D1BEN8         4Y 0B 18 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BST9)
     A  32 58                               DSPATR(RI PC)
     A            D1BST9         4Y 0B 19  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BEN9)
     A  31 59                               DSPATR(RI PC)
     A                                 19 10'-'
     A            D1BEN9         4Y 0B 19 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BSTA)
     A  32 59                               DSPATR(RI PC)
     A            D1BSTA         4Y 0B 20  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BENA)
     A  31 60                               DSPATR(RI PC)
     A                                 20 10'-'
     A            D1BENA         4Y 0B 20 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BSTB)
     A  32 60                               DSPATR(RI PC)
     A            D1BSTB         4Y 0B 21  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BENB)
     A  31 61                               DSPATR(RI PC)
     A                                 21 10'-'
     A            D1BENB         4Y 0B 21 12DSPATR(CS)
     A                                      FLDCSRPRG(D1BSTC)
     A  32 61                               DSPATR(RI PC)
     A            D1BSTC         4Y 0B 22  5DSPATR(CS)
     A                                      FLDCSRPRG(D1BENC)
     A  31 62                               DSPATR(RI PC)
     A                                 22 10'-'
     A            D1BENC         4Y 0B 22 12DSPATR(CS)
     A                                      FLDCSRPRG(D1PULC)
     A  32 62                               DSPATR(RI PC)
      *
     A                                 11 36'PULLING CYCLE'
     A            D1PULC         4Y 0B 11 52DSPATR(CS)
     A                                      FLDCSRPRG(D1PACC)
     A  71                                  DSPATR(RI PC)
     A                                 11 57'MIN'
      *
     A                                 12 36'PACKING CYCLE'
     A            D1PACC         4Y 0B 12 52DSPATR(CS)
     A                                      FLDCSRPRG(D1PAPU)
     A  72                                  DSPATR(RI PC)
     A                                 12 57'MIN'
      *
     A                                 13 34'PACKING-PULLING'
     A            D1PAPU         3Y 0B 13 52DSPATR(CS)
     A                                      FLDCSRPRG(D11BIN)
     A  73                                  DSPATR(RI PC)
     A                                 13 57'BIN'
      *
     A                                 14 28'START TIME OF 1ST BIN'
     A            D11BIN         4Y 0B 14 52DSPATR(CS)
     A                                      FLDCSRPRG(D1STR1)
     A  74                                  DSPATR(RI PC)
      *
     A****                             15 38'START SHIFT'
     A****        D1STSF         1Y 0B 15 52DSPATR(CS)
     A****                                  FLDCSRPRG(D1STR1)
     A**75                                  DSPATR(RI PC)
      *
     A  99                             23 11' ERR '
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A            D1ERR         60O       +2
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  7'EXIT'
     A                                   + 1' F1 '
     A                                      DSPATR(RI)
     A                                   + 2'UPDATE'
     A                                   + 1' F5 '
     A                                      DSPATR(RI)
