     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R SFL010                    SFL
     A            @SCALE         3Y 0O  4 17EDTCDE(M)
     A                                  4 21'|'
     A            @SA01          2A  O  4 23
     A  31                                  DSPATR(HI)
     A  31                                  DSPATR(RI)
     A                                      COLOR(BLU)
     A            @SA02          2A  O  4 27
     A  32                                  DSPATR(HI)
     A  32                                  DSPATR(RI)
     A                                      COLOR(GRN)
     A            @SA03          2A  O  4 31
     A  33                                  DSPATR(HI)
     A  33                                  DSPATR(RI)
     A                                      COLOR(PNK)
     A            @SA04          2A  O  4 35
     A  34                                  DSPATR(HI)
     A  34                                  DSPATR(RI)
     A                                      COLOR(RED)
     A            @SA05          2A  O  4 39
     A  35                                  DSPATR(HI)
     A  35                                  DSPATR(RI)
     A                                      COLOR(GRN)
     A            @SA06          2A  O  4 43
     A  36                                  DSPATR(HI)
     A  36                                  DSPATR(RI)
     A                                      COLOR(WHT)
     A            @SA07          2A  O  4 47
     A  37                                  DSPATR(HI)
     A  37                                  DSPATR(RI)
     A                                      COLOR(PNK)
     A            @SA08          2A  O  4 51
     A  38                                  DSPATR(HI)
     A  38                                  DSPATR(RI)
     A                                      COLOR(BLU)
     A            @SA09          2A  O  4 55
     A  39                                  DSPATR(HI)
     A  39                                  DSPATR(RI)
     A                                      COLOR(GRN)
     A            @SA10          2A  O  4 59
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(RI)
     A                                      COLOR(PNK)
     A            @SA11          2A  O  4 63
     A  41                                  DSPATR(HI)
     A  41                                  DSPATR(RI)
     A                                      COLOR(RED)
     A            @SA12          2A  O  4 67
     A  42                                  DSPATR(HI)
     A  42                                  DSPATR(RI)
     A                                      COLOR(GRN)
     A*
     A          R CTL010                    SFLCTL(SFL010)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0015)
     A                                      CF01(01 'EXIT PROGRAM')
     A                                      OVERLAY
     A N30                                  SFLDSP
     A N30                                  SFLDSPCTL
     A  30                                  SFLCLR
     A            #RCN01         4S 0H      SFLRCDNBR
     A            MODE           1A  H
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                  1 12TIME
     A                                  1 28' Pallet Return Productivity '
     A                                      DSPATR(RI)
     A            #PGM          10A  O  1 69
     A                                  3 16'Count'
     A            @TOTL          3  0O  3  8COLOR(WHT)
     A                                      EDTCDE(M)
     A                                  3  2'Total'
     A                                      COLOR(WHT)
      *
     A          R DATAFOOT
     A                                      OVERLAY
     A                                 24  3'F1=Go Back'
     A                                 19 13'-----------------------------------
     A                                      ----------------------'
     A                                      COLOR(WHT)
     A                                 20 17'Hour'
     A            @HR01          2  0O 20 23COLOR(WHT)
     A            @HR02          2  0O 20 27COLOR(WHT)
     A            @HR03          2  0O 20 31COLOR(WHT)
     A            @HR04          2  0O 20 35COLOR(WHT)
     A            @HR05          2  0O 20 39COLOR(WHT)
     A            @HR06          2  0O 20 43COLOR(WHT)
     A            @HR07          2  0O 20 47COLOR(WHT)
     A            @HR08          2  0O 20 51COLOR(WHT)
     A            @HR09          2  0O 20 55COLOR(WHT)
     A            @HR10          2  0O 20 59COLOR(WHT)
     A            @HR11          2  0O 20 63COLOR(WHT)
     A            @HR12          2  0O 20 67COLOR(WHT)
