     A** AM#PW45N *****************************
     A*  PALLET RETURN SCAN                   *
     A*  LEC        2019.10.30                *
     A*****************************************
     A                                      DSPSIZ(24 80 *DS3)
     A*
     A          R DSP01
     A                                      CF01(01)
     A                                      CF09(09)
     A                                      CF05(05)
     A                                      CF12(12)
     A*
     A            #PGM           8A  O  1  3
     A                                  1 26' ** Pallet Return Scan ** '
     A                                      DSPATR(RI)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  3 27'Manifest Barcode'
     A                                      DSPATR(HI)
     A            MSG           40A  O 13 19COLOR(PNK)
     A                                 22  5'F1:End'
     A            MAN1          25A  B  4 27
     A            MAN2          25A  B  5 27
     A                                  9 22'Order'
     A            LSORD#        12A  O  9 28COLOR(WHT)
     A            LSNUKE         2A  O  8 56COLOR(WHT)
     A                                  8 51'Dock'
     A            LSNAME        20A  O  8 28COLOR(WHT)
     A                                  8 22'Plant'
     A                                  9 51'PalCd'
     A            LSPALT         2A  O  9 57COLOR(WHT)
     A                                  9 42'Cyc#'
     A            LSMRSO         2A  O  9 47COLOR(WHT)
     A                                 11 26'Condition'
     A            LSCOND         8A  O 11 36COLOR(WHT)
     A                                  7 19'* * * * *    Last    * * * * * * *-
     A                                       * * *'
     A            SCWKCD         6   O 17 40DSPATR(ND)
     A                                      COLOR(WHT)
     A            SCWKNM        20A  O 17 50COLOR(WHT)
     A                                 18 51'Start Date/Time'
     A            SCSTDT         8Y 0O 19 51COLOR(WHT)
     A                                      EDTWRD('    /  /  ')
     A            SCSTTM         4Y 0O 19 63COLOR(WHT)
     A                                      EDTWRD('0 :  ')
     A                                 20 51'Total Pallets'
     A            SCTOTP         5Y 0O 20 65COLOR(WHT)
     A                                      EDTCDE(1)
     A                                 16 50'Team Member'
     A*
     A          R DSP02
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      CF12(12)
     A*
     A            #PGM           8A  O  1  6
     A                                  1 27' ** Pallet Return Scan ** '
     A                                      DSPATR(RI)
     A                                  1 69DATE
     A                                      EDTCDE(Y)
     A                                  2 69TIME
     A            MSG           40A  O  9 22COLOR(PNK)
     A                                 20  6'F1:Go Back'
     A                                  6 24'Order'
     A            MFORD#        12A  O  6 30COLOR(WHT)
     A            MFNUKE         2A  O  5 58COLOR(WHT)
     A                                  5 53'Dock'
     A            MFNAME        20A  O  5 30COLOR(WHT)
     A                                  5 24'Plant'
     A                                  6 53'PalCd'
     A            MFPALT         2A  O  6 59COLOR(WHT)
     A                                  6 44'Cyc#'
     A            MFMRSO         2A  O  6 49COLOR(WHT)
     A                                  4 21'Manifest Info:'
     A                                 14 19'F5:Good Pallet'
     A                                 14 52'F12: Bad Pallet'
     A*
     A          R DSP03
     A*
     A            #PGM           8A  O  1  6
     A                                  1 28' ** Pallet Return Scan ** '
     A                                      DSPATR(RI)
     A                                  1 68DATE
     A                                      EDTCDE(Y)
     A                                  2 68TIME
     A                                  5  7'   GGGGGG           OOOOOOO       -
     A                                          OOOOOOO         DDDDDDDD     '
     A                                      COLOR(WHT)
     A                                  8  7'G         G       O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                  9  7'G                 O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 10  7'G                 O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 11  7'G                 O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 12  7'G    GGGGGG       O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 13  7'G         G       O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 14  7'G         G       O         O     -
     A                                        O         O       D         D  '
     A                                      COLOR(WHT)
     A                                 15  7' G        G       O         O     -
     A                                        O         O       D        D   '
     A                                      COLOR(WHT)
     A                                 16  7'  G      G         O       O      -
     A                                         O       O        D       D    '
     A                                      COLOR(WHT)
     A                                 17  7'   GGGGGG           OOOOOOO       -
     A                                          OOOOOOO         DDDDDDDD     '
     A                                      COLOR(WHT)
     A                                  6  7'  G      G         O       O      -
     A                                         O       O        D       D    '
     A                                      COLOR(WHT)
     A                                  7  7' G        G       O         O     -
     A                                        O         O       D        D   '
     A                                      COLOR(WHT)
     A*
     A          R DSP04
     A*
     A            #PGM           8A  O  1  6
     A                                  1 28' ** Pallet Return Scan ** '
     A                                      DSPATR(RI)
     A                                  1 68DATE
     A                                      EDTCDE(Y)
     A                                  2 68TIME
     A                                  5 16'   BBBBBBBBB             AAA      -
     A                                           DDDDDDDD   '
     A                                      COLOR(RED)
     A                                  8 16'   B         B        A       A   -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                  9 16'   B         B       A         A  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 10 16'   B        B        A         A  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 11 16'   BBBBBBBBB         AAAAAAAAAAA  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 12 16'   B        B        A         A  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 13 16'   B         B       A         A  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 14 16'   B         B       A         A  -
     A                                           D         D'
     A                                      COLOR(RED)
     A                                 15 16'   B         B       A         A  -
     A                                           D        D '
     A                                      COLOR(RED)
     A                                 16 16'   B        B        A         A  -
     A                                           D       D  '
     A                                      COLOR(RED)
     A                                 17 16'   BBBBBBBBB         A         A  -
     A                                           DDDDDDDD   '
     A                                      COLOR(RED)
     A                                  6 16'   B        B           A   A     -
     A                                           D       D  '
     A                                      COLOR(RED)
     A                                  7 16'   B         B         A     A    -
     A                                           D        D '
     A                                      COLOR(RED)
