     A** AM#PW262 *******************************************
     A*  ORDER STATUS INQUIRY                               *
     A*                                                     *
     A*   LEC ....................... 2021/01/20            *
     A*******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R FMT010
     A                                      CF01
     A                                      CF05
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' Order Status Inquiry '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4  5'Manifest'
     A            F1BC1         50A  B  4 19
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            F1BC2         50A  B  5 19
     A  31                                  DSPATR(RI)
     A            F1BC3         50A  B  6 19
     A  31                                  DSPATR(RI)
     A            F1BC4         50A  B  7 19
     A  31                                  DSPATR(RI)
     A            F1BC5         50A  B  8 19
     A  31                                  DSPATR(RI)
     A                                  5  5'-- OR --'
     A                                  6  5'Container'
     A                                  7  5'Barcode'
     A          R FMT020
     A                                      CF01
     A                                      CF05
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' Order Status Inquiry '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5  6'Dock:'
     A                                  6  6'Order Number:'
     A            F2NAMC         5A  B  4 12
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            F2DOCK         2A  B  5 12
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            F2ORD#        12A  B  6 20
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                  4  6'NAMC:'
     A*-----------------------------------------------------
     A*
     A          R SFL01                     SFL
     A            S@PALT         2A  O 15  2
     A            S@SKID         3A  O 15  7
     A            S@PACK         3Y 0O 15 12EDTCDE(Z)
     A            S@SKDT        11A  O 15 23
     A            S@SKOK         1A  O 15 36COLOR(PNK)
     A            S@TRDT        11A  O 15 41
     A            S@TROK         1A  O 15 55COLOR(PNK)
     A            S@TICK        19A  O 15 59
     A            S@OVR          1A  O 15 79
     A            S@ORD          3Y 0O 15 18EDTCDE(Z)
     A            S@SLSH         1   O 15 16
     A            S@MFBC        50   O 16 10COLOR(WHT)
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0004)
     A                                      SFLPAG(0003)
     A                                      SFLDROP(CF10)
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' Order Status Inquiry '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 44'Order #'
     A                                      COLOR(WHT)
     A                                  4 25'Ship Time'
     A                                      COLOR(WHT)
     A                                  4  3'Ship Date'
     A                                      COLOR(WHT)
     A                                  3 51'Delv Cd'
     A                                      COLOR(WHT)
     A                                  3 23'Dest Name'
     A                                      COLOR(WHT)
     A                                  4 66'Dock'
     A                                      COLOR(WHT)
     A                                  3  3'NAMC'
     A                                      COLOR(WHT)
     A            F3SURT         9A  O  3  8
     A            F3SMEI        15A  O  3 33
     A            F3NONY         4S 0O  3 59
     A            F3DOCK         2A  O  4 71
     A            F3ORD#        12A  O  4 52
     A            F3SHIT         6Y 0O  4 35EDTWRD('0  :  :  ')
     A            F3SHID         8Y 0O  4 13EDTWRD('    /  /  ')
     A                                  7  7'SlsOrder?'
     A                                      COLOR(WHT)
     A                                  7 35'WebOrder?'
     A                                      COLOR(WHT)
     A                                 11  7'ShipPull?'
     A                                      COLOR(WHT)
     A                                  8  7'AB#PP10'
     A                                  8 35'AL#PP01'
     A                                  9 35'AL#PP02'
     A                                 12  7'AB#PP65'
     A                                  8 19'conts'
     A                                  8 47'conts'
     A                                  9 47'conts'
     A                                 12 19'conts'
     A            AB10YN         1A  O  8 16COLOR(PNK)
     A            AL01YN         1A  O  8 44COLOR(PNK)
     A            AB65YN         1A  O 12 16COLOR(PNK)
     A            AL02YN         1A  O  9 44COLOR(PNK)
     A*
     A            AB10#          4Y 0O  8 26COLOR(BLU)
     A                                      EDTCDE(Z)
     A            AL01#          4Y 0O  8 54COLOR(BLU)
     A                                      EDTCDE(Z)
     A            AL02#          4Y 0O  9 54COLOR(BLU)
     A                                      EDTCDE(Z)
     A            AB65#          4Y 0O 12 26COLOR(BLU)
     A                                      EDTCDE(Z)
     A                                  6  3'------------------  Order Info ----
     A                                      -----------------------------------'
     A                                      COLOR(RED)
     A                                 10  3'------------------  Pulling  ------
     A                                      -----------------------------------'
     A                                      COLOR(RED)
     A                                 13  3'------------------  Packing/Loadin-
     A                                      g/SCS  ----------------------------'
     A                                      COLOR(RED)
     A                                 14  1'Palt'
     A                                      COLOR(WHT)
     A                                 14  6'Skid'
     A                                      COLOR(WHT)
     A                                 14 12'-Packing-'
     A                                      COLOR(WHT)
     A                                 14 24'Sent Skid'
     A                                      COLOR(WHT)
     A                                 14 35'OK?'
     A                                      COLOR(WHT)
     A                                 14 40'Sent Trailer'
     A                                      COLOR(WHT)
     A                                 14 54'OK?'
     A                                      COLOR(WHT)
     A                                 14 59'Truck Ticket'
     A                                      COLOR(WHT)
     A                                 14 78'Ovr'
     A                                      COLOR(WHT)
     A                                 11 40'Shortages?'
     A                                      COLOR(WHT)
     A                                 12 48'conts'
     A            SHRT#          4Y 0O 12 43COLOR(BLU)
     A                                      EDTCDE(Z)
      * ----------------------------------------------------
     A          R FMT099
     A  99                             23  2'Error'
     A  99                                  DSPATR(RI BL)
     A  99        MSG           60A  O 23  8
     A  99                                  DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A  48                             24 22'F10:Manifest'
     A  48                                  DSPATR(RI)
     A  48                             24 51'F12:Previous'
     A  48                                  DSPATR(RI)
