     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A* ----------------------------------------------------
     A          R SFL01                     SFL
     A            S1EXTY        30A  O  4  6
     A            S1SEL          1A  B  4  3
     A            S1EXCD         2A  O  4 39
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A N61                                  SFLDSP
     A N61                                  SFLDSPCTL
     A  61                                  SFLCLR
     A N62                                  SFLEND(*MORE)
     A                                      OVERLAY
     A            #RCNO1         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 13' ** Toyota SCS Exceptions ** '
     A                                      DSPATR(RI)
     A                                  1 46DATE
     A                                      EDTCDE(Y)
     A                                  2 46TIME
     A                                  3 38'Code'
     A                                      DSPATR(HI)
     A                                  3  6'Exception Type'
     A                                      DSPATR(HI)
     A                                  3  3'X'
     A* ----------------------------------------------------
     A          R DSP99
     A                                 14  4'Enter-Continue'
     A                                 14 22'F1-Cancel'
