     A*** AM#PW17 ******************************************
     A* PACKING -  SHORTAGES                               *
     A* LEC    COPY FROM AM#PW16         2019.02.07        *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF03(03)
     A                                  1  3'PACKING'
     A                                  3  3'PALLET BARCODE'
     A            BAR01         25A  B  4  2
     A            BAR02         25A  B  5  2
     A            BAR03         22A  B  6  2CHECK(ER)
      *
     A            D1SUMI         3Y 0  13 24EDTCDE(Z)
     A            D1SRSH         1A    13 28
     A            D1TOTL         3Y 0  13 30EDTCDE(Z)
     A                                 14  2'F3=BACK'
     A            MSG           25A  O 15  2
     A***
     A          R DSP02
     A                                      CF03(03)
     A                                  1  3'ORDER SHORTAGES'
     A                                  2  6'PACKING'
     A                                  3  3'CUSTOMER KANBAN'
     A            D2R01         25A  B  4  2
     A            D2R02         25A  B  5  2
     A            D2R03         25A  B  6  2
     A            D2R04         25A  B  7  2
     A            D2R05         25A  B  8  2
     A            D2R06         25A  B  9  2
     A            D2R07         25A  B 10  2
     A            D2R08         25A  B 11  2
     A            D2R09         25A  B 12  2
     A            D2R10         25A  B 13  2CHECK(ER)
     A            D2CONT         6A  O 14 16
     A            D2SUMI         3Y 0O 14 24EDTCDE(Z)
     A            D2SRSH         1A  O 14 28
     A            D2TOTL         3Y 0O 14 30EDTCDE(Z)
     A                                 15  2'F3=BACK'
     A            MSG           25A  O 16  2
      ***
     A          R DSP03
      *
     A                                  4  3'  ****  '
     A                                  5  3' *    * '
     A                                  6  3'*      *'
     A                                  7  3'*      *'
     A                                  8  3'*      *'
     A                                  9  3' *    * '
     A                                 10  3'  ****  '
     A                                  4 13'*    *'
     A                                  5 13'*   *'
     A                                  6 13'*  *'
     A                                  7 13'***'
     A                                  8 13'*  *'
     A                                  9 13'*   *'
     A                                 10 13'*    *'
      *
     A                                 13  2'BIN'
     A            D2IAFB         3A    13  6
     A                                 13 11'PALLET#'
     A            D2IAFP         3A    13 19
     A            D2SUMI         3Y 0  13 24EDTCDE(Z)
     A                                 13 28'/'
     A            D2TOTL         3Y 0  13 30EDTCDE(Z)
     A                                 14  2'F3=BACK'
     A            MSG           25A  O 15  2
     A          R DSP04
     A                                      CF03(03)
     A                                  1  3'ORDER SHORTAGES'
     A                                  2  6'PACKING'
     A                                  4  3'MANIFEST BARCODE'
     A            MAN01         25A  B  5  2
     A            MAN02         25A  B  6  2CHECK(ER)
     A*
     A            D1CONT         6A  O 13 16
     A            D1SUMI         3Y 0O 13 24EDTCDE(Z)
     A            D1SRSH         1A  O 13 28
     A            D1TOTL         3Y 0O 13 30EDTCDE(Z)
     A                                 14  2'F3=BACK'
     A            MSG           25A  O 15  2
