     A*** AM#PW21PR ****************************************
     A* GET TRUCK/LOAD INFO FOR TSCS TRAILER BUILD         *
     A*     LEC           2020.11.20                       *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF03(03)
     A                                  1  3'Send Toyota Truck'
     A                                  4  3'Scan Truck Ticket'
     A            BAR01         19A  B  5  2
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A*
     A                                 10  2'F3=END'
     A            MSG           25A  O 12  2
     A                                  2  4'Load Information'
     A          R DSP02
     A                                      CF03(03)
     A                                  1  3'Send Toyota Truck'
     A                                  2  4'Load Information'
     A                                  4  3'Enter Trailer Info'
     A*
     A                                  6  2'Trailer#'
     A            FTRLR#        20A  B  6 11
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 10  2'F3=BACK'
     A            MSG           25A  O 12  2
     A          R DSP03
     A                                      CF03(03)
     A                                  1  3'Send Toyota Truck'
     A                                  2  4'Load Information'
     A                                  4  3'Enter Driver Info'
     A                                  6  2'Driver Name/Badge'
     A            FDRNAM        79A  B  7  2
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                 10  2'F3=BACK'
     A            MSG           25A  O 12  2
