     A** AM#PW45P *******************************************
     A*   PALLET RETURN SCAN BY TM, DATE                    *
     A*                                                     *
     A*   ........................... 2016/05/31            *
     A*******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R FMT010
     A                                      OVERLAY
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' PALLET RETURN SCAN BY TM, DATE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  3  2' Select '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3 13'Scan'
     A                                  3 18'From:'
     A            F1SCFY         4Y 0B  3 24
     A N31                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            F1SCFM         2Y 0B  3 29
     A N31                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            F1SCFD         2Y 0B  3 32
     A N31                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  3 45'To:'
     A            F1SCTY         4Y 0B  3 49
     A N32                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            F1SCTM         2Y 0B  3 54
     A N32                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            F1SCTD         2Y 0B  3 57
     A N32                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            F1FRTM         4Y 0B  3 37EDTCDE(4)
     A N33                                  DSPATR(HI)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            F1TOTM         4Y 0B  3 62EDTCDE(4)
     A N34                                  DSPATR(HI)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                  4 24'YYYY MM DD'
     A                                  4 49'YYYY MM DD'
     A                                  4 37'HHMM'
     A                                  4 62'HHMM'
     A*-----------------------------------------------------
     A          R SFL020                    SFL
     A            S2SEL          1A  B  6  2
     A  51                                  DSPATR(ND)
     A  51                                  DSPATR(PR)
     A  52                                  DSPATR(PC)
     A            S2TMNM        20A  O  6  4
     A            S2ACNT         6Y 0O  6 39EDTCDE(Z)
     A            H2TMCD        10A  H
     A* ----------------------------------------------------
     A          R CTL020                    SFLCTL(SFL020)
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      CF01
     A                                      CF06
     A                                      CF12
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN02         4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' PALLET RETURN SCAN BY TM, DATE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  3  2' Select '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3 13'Scan From:'
     A            F1SCFY         4Y 0O  3 24DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1SCFM         2Y 0O  3 29DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1SCFD         2Y 0O  3 32DSPATR(HI)
     A                                      EDTCDE(Z)
     A                                  3 45'To:'
     A            F1SCTY         4Y 0O  3 49DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1SCTM         2Y 0O  3 54DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1SCTD         2Y 0O  3 57DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1FRTM         4Y 0O  3 37DSPATR(HI)
     A                                      EDTCDE(Z)
     A            F1TOTM         4Y 0O  3 62DSPATR(HI)
     A                                      EDTCDE(Z)
     A*
     A                                  4  2'Total # Pallets:'
     A                                      COLOR(YLW)
     A            C2ACNT         6Y 0O  4 19EDTCDE(Z)
     A                                      COLOR(YLW)
     A                                  5  2'S'
     A                                  5  4'TM name'
     A                                      COLOR(WHT)
     A                                  5 35'# of Pallets'
     A                                      COLOR(WHT)
     A* ----------------------------------------------------
     A          R SFL030                    SFL
     A            S3DATE         4Y 0O  7 12EDTWRD('  /  ')
     A            S3TIME         5A  O  7 20
     A            S3NAME        10   O  7 28
     A            S3COND         8   O  7 40
     A*
     A          R CTL030                    SFLCTL(SFL030)
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A N61                                  SFLDSP
     A N61                                  SFLDSPCTL
     A  61                                  SFLCLR
     A N62                                  SFLEND(*MORE)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A            #RCN03         4S 0H      SFLRCDNBR
     A            N#MOD3         1A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' PALLET RETURN SCAN BY TM, DATE '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  3 13'Scan From:'
     A            F1SCFY         4Y 0O  3 24EDTCDE(Z)
     A            F1SCFM         2Y 0O  3 29EDTCDE(Z)
     A            F1SCFD         2Y 0O  3 32EDTCDE(Z)
     A                                  3 45'To:'
     A            F1SCTY         4Y 0O  3 49EDTCDE(Z)
     A            F1SCTM         2Y 0O  3 54EDTCDE(Z)
     A            F1SCTD         2Y 0O  3 57EDTCDE(Z)
     A            F1FRTM         4Y 0O  3 37EDTCDE(Z)
     A            F1TOTM         4Y 0O  3 62EDTCDE(Z)
     A*
     A                                  4  2'TM name:'
     A            C3TMNM        20A  O  4 11COLOR(WHT)
     A                                  4 32'# of Pallets:'
     A                                      COLOR(TRQ)
     A            C3ACNT         5Y 0O  4 46EDTCDE(Z)
     A                                      COLOR(TRQ)
     A*
     A                                  5 13'Date'
     A                                  5 21'Time'
     A                                  5 28'Plant'
     A                                  5 39'Condition'
      * ----------------------------------------------------
     A          R FMT099
     A  49                             23  2'Error'
     A  49                                  DSPATR(RI BL)
     A  49        MSG           60A  O 23  8
     A  49                                  DSPATR(RI BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A  48                             24 51'F12:Previous'
     A  48                                  DSPATR(RI)
