     A** AL#PW52 ***********************************
     A* PULLING PROGRESS                           *
     A*     ITS.    2015.06.02                     *
     A**********************************************
     A                                      PRINT
     A                                      CHGINPDFT
     A                                      INVITE
      *------------------------*
     A          R SFL                       SFL
     A                                      KEEP
     A***         S1TRKB         2A     6  3
     A***         S1IAFB         3A     6  6
     A            S1SHID         8A     6  2
     A  35                                  DSPATR(HI)
     A            S1SHIT         5A     6 11
     A  35                                  DSPATR(HI)
     A            S1SUMI         3Y 0   6 17EDTCDE(Z)
     A***                               6 16'/'
     A            S1SR           1A     6 21
     A            S1BOX          3Y 0   6 23EDTCDE(Z)
     A            S1PSTD         4Y 0   6 27EDTWRD('  /  ')
     A  36                                  DSPATR(BL)
     A            S1PSTT         5A     6 33
     A  36                                  DSPATR(BL)
      *
     A            S1ASTD         4Y 0   6 39EDTWRD('  /  ')
     A  38                                  DSPATR(BL)
     A            S1ASTT         5A     6 45
     A  38                                  DSPATR(BL)
     A            S1PEDD         4Y 0   6 51EDTWRD('  /  ')
     A            S1PEDT         5A     6 57
      *
     A            S1AEDD         4Y 0   6 63EDTWRD('  /  ')
     A  39                                  DSPATR(BL)
     A            S1AEDT         5A     6 69
     A  39                                  DSPATR(BL)
     A            S1STS          4A     6 75
      *非表示項目
     A            @RRN           4Y 0H
     A            H138           1A  H
     A            H139           1A  H
      *---------------------------------------*
      * CONTROL                               *
      *---------------------------------------*
     A          R SFLCTL
     A                                      SFLCTL(SFL)
     A  72                                  SFLDSPCTL
     A  72                                  ERASE(SFL)
     A  73                                  SFLDSP
     A  71                                  SFLCLR
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(15)
     A                                      SFLSIZ(15)
     A                                      CF03(03)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A N99                                  CSRLOC(S@SLIN S@SCLM)
     A                                      KEEP
      *
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
     A            S@SLIN         3  0H
     A            S@SCLM         3  0H
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 28' ** PULLING PROGRESS ** '
     A                                      DSPATR(RI)
     A                                  1 69'FMT AM#PW52'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
      *
     A****                              3 14'SHIP DATE' DSPATR(HI)
     A****        C1SHID         8Y 0    + 1EDTWRD('    /  /  ')
      *
     A                                  4  3'IAF'
     A                                  4 28'PULL PLAN'
     A                                  4 39'PULL ACTUAL'
     A                                  4 52'PULL PLAN'
     A                                  4 63'PULL ACTUAL'
     A                                  5  2'   BIN#       +
     A                                       CONTAINERS    +
     A                                       START       START        +
     A                                       END         END    +
     A                                       STATUS'
     A                                      DSPATR(UL)
      *------------------------*
     A          R AM#PW529
     A                                      OVERLAY PROTECT
     A                                 22  3'EXTRA BIN'
     A                                      DSPATR(HI)
     A N81                             22 72'MORE...'
     A  81                             22 72'LAST...'
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D9ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                 24 62' PAGE UP/DOWN'
     A                                      DSPATR(RI)
