     A*%%TS  SD  20220411  150630  I0777       REL-V7R3M0  5770-WDS
     A** AN#PWF1 ***************************************************************
     A*  ANDROID EDI MENU                                                      *
     A*
     A* TCHK1 07/10/06 CREATE(COPY FFROM AB#CF1)
     A**************************** AN#PWF1 *************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R AN#PWF01
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1 12TIME
     A                                  1  3DATE
     A                                      EDTCDE(Y)
     A                                  1 30'** EDI  ANDROID  MENU **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'AN#PWF1'
     A                                  3  2'EDI ORDER PROCESSED BY GENTRAN:'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            D@DAT          8Y 0O  3 34EDTWRD('    /  /  ')
     A                                      DSPATR(HI)
     A            D@TIM          6Y 0O  3 45EDTWRD('  :  :  ')
     A                                      DSPATR(HI)
      *
     A                                  5  2' 2.RE-PRINT DATA LIST'
     A********************************  5  2' 4.FRS EXPORT ORDER PROCESS'
     A********************************  6  2' 5.PRINT WEEKLY ORDER LIST'
     A                                  8  2' 6.CREATE FRS ORDER'
     A                                  9  2' 7.RE-CREATE FRS ORDER'
     A******************************** 10  2' 8.CONTAINER SHIPMENT INQ'
     A                                 11  2'10.PACKING SLIP'
     A                                 12  2'11.PACKING SLIP(FREEZE)'
     A                                 13  2'12.PACKING SLIP(SUPERVISOR)'
     A  88                                  DSPATR(ND)
     A                                 14  2'13.PACKING SLIP(REPRINT)'
     A                                 15  2'14.CONTAINER SHIPMENT INQ'
     A                                 17  2'22.CREATE LABEL DATA(2D)'
     A                                 18  2'23.RE-CREATE LABEL DATA(2D)'
     A                                 20  2'30.BILL OF LADING'
     A******************************** 21  2'31.MIXED LOAD LIST'
     A                                 21  2'AG.RESET CUM.FROM AUG/01'
     A  63                                  DSPATR(BL)
     A N63                                  DSPATR(ND)
      *
     A********************************  4 30'40.CUSTOM SHEET'
     A                                  5 30'50.CREATE ASN DATA'
     A                                  7 30'51.FORECAST VS.SETTING QTY.'
     A                                  8 30'52.ASN pattern maintenance.'
     A********************************  9 30'60.MAINTENANCE ADDRESS MASTER'
     A******************************** 10 30'61.MAINTENANCE ROUTE MASTER'
     A******************************** 11 30'62.MAINTENANCE BIN/ROUTE MASTER'
     A                                 13 30'63.MAINTENANCE CUM. MASTER'
     A                                 14 30'70.CUM. LIST BY PLANT,DOCK'
     A******************************** 15 30'71.PRINT FUTURE FORD ORDER INFORMA-
     A********************************      TION'
     A******************************** 16 30'80.FORD NOTE INQUIRY'
     A                                 17 30'81.FABRICATION & RAW MATERIAL-
     A                                       INQUIRY'
      *
     A                                  4 59'45.LABEL SCAN CHECK'
     A                                  5 59'46.LINE FEED SEARCH'
     A                                  6 59'47.SHP HIST & FORECST'
     A                                  7 59'48.DISUSE PARTS LIST'
     A                                  8 59'49.RETURNABLE SHIP'
      *
     A            SELET          2A  B 22 15
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 23 18
     A                                 24  4'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 25'DATA PROCESSING'
     A                                 24 42'CMD-5'
     A                                      DSPATR(RI)
