     A** ANBPW56 *******************************************
     A*  ANDROID SETTING NUMBER CHECK LIST                 *
     A*                                                    *
     A* TCHK1 08/01/06 CREATE(COPY FROM ABBPW56)           *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A          R DSP01
     A                                      CF01(01)
     A                                      CF05(05)
     A            #PGM           8      1  2
     A                                  1 21'  **  SETTING NUMBER CHECK LIST  *-
     A                                      *  '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2 28'DEMAND VS. SETTING QTY'
     A                                      DSPATR(RI)
     A                                  4  8'<< ANDROID >>'
     A                                      DSPATR(RI)
     A                                  7 20'LIST UP PARTS OVER'
     A            D@PCNT         3Y 0B  7 39EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 43'%'
     A                                  9 30'OR UNDER'
     A            D@PCNX         3Y 0B  9 39EDTCDE(4)
     A                                      DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 43'%'
     A                                 24  2'CANCEL'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 22'HANDLING START'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
