     A** ANYPW52 ********************************************
     A*  QUENCHING KANBAN L/T ABNORMAL DETECTION INQUIRY    *
     A*                                                     *
     A* TCHK  06/30/11 CREATE                               *
     A* TCHK1 08/11/11 ADD #OF KANBAN & DSPATR(RI)          *
     A*----------+-----+----------+-----------------------------------*
     A*2021.03.01|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     A*          |     |          |          EXPANSION OF THE "KANBAN"*
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A                                      CF03
      *-----------------------------------------------------
     A          R SFL020                    SFL
     A            S2SHIN        14A  O  5 10
TCHK1A  45                                  DSPATR(RI)
     A            S2LOC          9A  O  5 26
TCHK1A  45                                  DSPATR(RI)
     A            S2TEMP         3Y 0O  5 41EDTCDE(1)
TCHK1A  45                                  DSPATR(RI)
     A            S2LT1          3Y 1O  5 51EDTCDE(1)
TCHK1A  45                                  DSPATR(RI)
TCHK1A            S2KAN1         5Y 0O  5 55EDTCDE(1)
TCHK1A  45                                  DSPATR(RI)
TCHK1A            S2LT2          3Y 1O  5 66EDTCDE(1)
TCHK1A  45                                  DSPATR(RI)
TCHK1A            S2KAN2         4Y 0O  5 71EDTCDE(1)
TCHK1A  45                                  DSPATR(RI)
      * ----------------------------------------------------
     A          R CTL020
     A                                      SFLCTL(SFL020)
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A                                      CF10
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN02         4  0H      SFLRCDNBR
     A                                  1  2'DATE'
     A                                  1  7DATE
     A                                      EDTCDE(Y)
     A                                  1 18' QUENCHING KANBAN ABNORM-
     A                                      AL L/T DETECTION INQUIRY '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'TIME'
     A                                  2  7TIME
     A*
TCHK1A                                  3 52'Current'
     A                                      COLOR(WHT)
TCHK1A                                  3 67'Normal'
     A                                      COLOR(WHT)
     A                                  4 10'Part'
     A                                      COLOR(WHT)
     A                                  4 26'Location'
     A                                      COLOR(WHT)
     A                                  4 41'Temp'
     A                                      COLOR(WHT)
     A                                  4 52'LT'
     A                                      COLOR(WHT)
TCHK1A                                  4 57'KAN'
TCHK1A                                      COLOR(WHT)
TCHK1A                                  4 67'LT'
TCHK1A                                      COLOR(WHT)
TCHK1A                                  4 72'KAN'
TCHK1A                                      COLOR(WHT)
     A* ----------------------------------------------------
     A          R SFL030                    SFL
     A            S3TEMP         3Y 0O  5 18EDTCDE(Z)
     A            S3COMT        10A  O  5 22
     A            S3LT1          3Y 1O  5 33EDTCDE(1)
     A* ----------------------------------------------------
     A          R CTL030
     A                                      SFLCTL(SFL030)
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A                                      CF12
     A N51                                  SFLDSP
     A N51                                  SFLDSPCTL
     A  51                                  SFLCLR
     A N52                                  SFLEND(*MORE)
     A            #RCN03         4  0H      SFLRCDNBR
     A                                  1  2'DATE'
     A                                  1  7DATE
     A                                      EDTCDE(Y)
     A                                  1 18' QUENCHING KANBAN ABNORM-
     A                                      AL L/T DETECTION INQUIRY '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 72
     A                                  2  2'TIME'
     A                                  2  7TIME
     A*
     A                                  4 18'Temp'
     A                                      COLOR(WHT)
     A                                  4 31'Base LT'
     A                                      COLOR(WHT)
     A* ----------------------------------------------------
     A          R FMT099
     A  49                             23  2'Error'
     A  49                                  DSPATR(RI BL)
     A  49        MSG           60A  O 23  8
     A  49                                  DSPATR(RI BL)
     A                                 24  2'F3:End'
     A                                      DSPATR(RI)
     A  48                             24 12'F10:BASE LT'
     A  48                                  DSPATR(RI)
     A  47                             24 27'F12:Previous'
     A  47                                  DSPATR(RI)
