     A*%%TS  SD  20220118  145422  I0777       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSP01
     A*%%TS  SD  20220118  145422  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'APLC02'
     A                                  1 23'** DOWNLOAD PF TO CSV **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A*
     A                                  5 15'Enter Type.........:'
     A            XTYPE          1A  B  5 37DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  5 39'(1=TXT, 2=PF)'
     A                                      COLOR(YLW)
     A                                  7 21'PF File......:'
     A            XFIL          10A  B  7 37DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                  9 21'PF Library...:'
     A*
     A            XLIB          10A  B  9 37DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                 11 21'csv File Name:'
     A*
     A            XFILN         30A  B 11 37DSPATR(CS)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 13 21'Extention ...:'
     A*
     A            XCSV           1A  B 13 37DSPATR(CS)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A                                 13 39'(C=.csv N=no Ext Code T=.txt)'
     A                                      COLOR(YLW)
     A                                 15 21'Column Name..:'
     A*
     A            XCLM           1A  B 15 37DSPATR(CS)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A                                 15 39'(Y=Column Name, N=No Name)'
     A                                      COLOR(YLW)
     A                                 17 17'* File Data will be transfered to -
     A                                      csv format data.'
     A                                      COLOR(YLW)
     A                                 18 17'* File Data will be transfered to -
     A                                      own Directory/Folder.'
     A                                      COLOR(YLW)
     A            XMSG          65A  O 22  7
     A                                 24  7'F1: END'
     A                                      COLOR(BLU)
     A                                 24 17'F5: RUN'
     A                                      COLOR(BLU)
