      ** APLPW84 **********************************
      * MULTIPLE PROCESS CONTROL FILE INQUIRY     *
      *  CREATE DATE.    :  2016.10.14            *
      *  AUTHOR.         :  T.SAKAKI              *
      ********************************** APLPW84 **
     A                                      PRINT(QPRINT)
     A                                      CHGINPDFT
      *
     A          R SFL
     A                                      SFL
     A            OP             1   B  5  2DSPATR(CS) VALUES(' ' '0')
     A  35                                  DSPATR(RI PC)
      *--------------------*
      *
      *--------------------*
     A            @1PGMN        10      5  4
     A  21                                  DSPATR(RI)
      *-----------*
      * WSID
      *-----------*
     A            @1WSID        10      5 15
     A  21                                  DSPATR(RI)
      *-----------*
      * USER ID   *
      *-----------*
     A            @1USID        10      5 26
     A  21                                  DSPATR(RI)
      *-----------*
      * MENU NO.  *
      *-----------*
     A            @1MNNO         3  0   5 37
     A  21                                  DSPATR(RI)
      *-----------*
      * NAME
      *-----------*
     A            @1KONA        15O     5 42
     A  21                                  DSPATR(RI)
      *-----------*
      * TIME DATE *
      *-----------*
     A            @1STHZ         8Y 0   5 58EDTWRD('0    .  .  ')
     A  21                                  DSPATR(RI)
     A            @1STTI         6Y 0   5 70EDTWRD('0 :  :  ')
     A  21                                  DSPATR(RI)
      *-----------*
      * DELETE    *
      *-----------*
     A            @OPSTS         1   H
      *
      *
     A          R SFLCTL
     A                                      SFLCTL(SFL)
     A                                      CF01(01) CF05(05)
     A                                      CF10(10) BLINK
     A                                      PUTOVR KEEP
     A  99                                  ALARM
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(15) SFLSIZ(15)
     A  70                                  SFLDSPCTL
     A  72                                  SFLDSP
     A  71                                  SFLCLR
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
     A                                  1  2'TIME'
     A                                    +1TIME
     A                                  1 20' **MULTIPLE PROCESS +
     A                                      CONTROL M/F**  '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                    +1'APLPW84'
     A*
     A                                  3  1'   RPG/       W.S.ID/ '
     A                                  4  1'   FILE       JOB ID   -
     A                                        ID         NO   NAME          -
     A                                        TIME                '
     A                                      DSPATR(UL)
     A*
     A          R APLPW841
     A                                 21  2'､'
     A                                 22  2'､､､> INPUT'
     A                                 22 13'''0'''
     A                                 22 17'FOR COMPULSORY DELETE    +
     A                                       * CHECK REASON FOR ABNORMAL END'
     A N81                             22 72' MORE... '
     A  81                             22 72' BOTTOM..'
      *
     A                                 23  3' ERR '
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            @ERR          70O       +2
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI BL)
     A*
     A                                 24  3'EXIT'
     A                                    +1' F1 '
     A                                      DSPATR(RI)
     A                                    +3'DELETE'
     A                                    +1' F5 '
     A                                      DSPATR(RI)
     A                                    +3'RETRY'
     A                                    +1' F10 '
     A                                      DSPATR(RI)
     A                                    +3'PREVIOUS'
     A                                    +1'PAGE-DOWN'
     A                                      DSPATR(RI)
     A                                    +3'NEXT'
     A                                    +1'PAGE-UP'
     A                                      DSPATR(RI)
     A*
     A          R APLPW842
     A                                      CF01(01)
     A                                      CF10(10) BLINK
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                    +1TIME
     A                                  1 20' **MULTIPLE PROCESS +
     A                                      CONTROL M/F**  '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                    +1'APLPW84'
     A*
     A                                  3  1'     RPG/               MACHINE'
     A                                  4  1'     FILE               NUMBER  -
     A                                         ID    NO    NAME      TIME   -
     A                                                    '
     A                                      DSPATR(UL)
     A                                 21  2'､'
     A                                 22  2'､､､> INPUT'
     A                                 22 13'''0'''
     A                                 22 17'FOR COMPULSORY DELETE    +
     A                                       * CHECK REASON FOR ABNORMAL END'
     A N81                             22 72' MORE... '
     A  81                             22 72' BOTTOM..'
      *
     A                                 23  3' ERR '
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            @ERR          70O       +2
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI BL)
     A*
     A                                 24  3'EXIT'
     A                                    +1' F1 '
     A                                      DSPATR(RI)
     A                                    +3'DELETE'
     A                                    +1' F5 '
     A                                      DSPATR(RI)
     A                                    +3'RETRY'
     A                                    +1' F10 '
     A                                      DSPATR(RI)
     A                                    +3'PREVIOUS'
     A                                    +1'PAGE-DOWN'
     A                                      DSPATR(RI)
     A                                    +3'NEXT'
     A                                    +1'PAGE-UP'
     A                                      DSPATR(RI)
