     A          R APPPW101                  CF01(01)
     A
      *時間の表示
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 68'FMT APPPW10'
      *タイトル表示
     A                                  1 29'ソース比較'
     A                                      DSPATR(RI)
      *
     A                                  4  3'　１'
     A                                  4 11'ライブラリ：'
     A            @LIB1         10A  B   + 1
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI PC)
      *
     A                                  5 11'ファイル　：'
     A            @SRC1         10A  B   + 1
     A                                      DSPATR(CS)
     A  02                                  DSPATR(RI PC)
      *
     A                                  6 11'メンバー　：'
     A            @MBR1         10A  B   + 1
     A                                      DSPATR(CS)
     A  03                                  DSPATR(RI PC)
      *
     A                                  8  3'　２'
     A                                  8 11'ライブラリ：'
     A            @LIB2         10A  B   + 1
     A                                      DSPATR(CS)
     A  11                                  DSPATR(RI PC)
      *
     A                                  9 11'ファイル　：'
     A            @SRC2         10A  B   + 1
     A                                      DSPATR(CS)
     A  12                                  DSPATR(RI PC)
      *
     A                                 10 11'メンバー　：'
     A            @MBR2         10A  B   + 1
     A                                      DSPATR(CS)
     A  13                                  DSPATR(RI PC)
      *
