     A*** ASCPW01 ******************************************
     A* SCRAP SCAN - REMOVE APICS FROM INVENTORY (NZUPP01)
     A*     LEC.          2024.10.14                       *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      CF01(01)
     A                                  1  3' REMOVE FROM INVENTORY '
     A                                      DSPATR(RI)
     A                                  3  8'APICS KANBAN QR'
     A            D1BARC       240A  B  4  1DSPATR(UL)
     A                                 10  2'F1=End'
     A            MSG           25A  O 11  2
     A                                 10 14'Total -'
     A            D1TOTL         5Y 0O 10 22COLOR(PNK)
     A                                      EDTCDE(Z)
