     A** AU#PW10 ********************************
     A*    .. LIST OF A-PICS ABNOMAL DATA ..    *
     A* CODING:K.OKACHI    2002.07.16           *
     A******************************** AU#PW10 **
     A                                      PRINT
     A                                      CHGINPDFT
      ******************************************************
     A          R AU#PW101
     A                                      CF01
     A                                      CF05
     A                                      KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 19' ** A-PICS ORDER RECEIPT NUMBER +
     A                                      ABNORMAL LIST ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'AU#PW10'
      *
     A                                  8 29'SALES ADDING UP DATE'
      *
     A                                  9 27'START DATE' DSPATR(UL)
     A                                  9 42'END   DATE' DSPATR(UL)
      *
     A            SDATE          8A  B 10 28DSPATR(CS)
     A  01                                  DSPATR(RI PC)
     A                                 10 39'-'
     A            EDATE          8A  B 10 43DSPATR(CS)
     A  02                                  DSPATR(RI PC)
      *
     A                                 11 27'(YYYYMMDD)'
     A                                 11 42'(YYYYMMDD)'
      *
     A                                 14 27'RATIO +'
     A            RATIO          3Y 0B 14 35DSPATR(CS) EDTCDE(2)
     A  03                                  DSPATR(RI PC)
     A                                 14 39'%'
      *
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI BL)
     A  99        MSG           60A  O 22 18
      *
     A                                 24  4'EXIT'
     A                                 24 11'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 30'ISSUE'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
