     A** AU#PW80 ***********************************
     A*  A-PICS PICK OUT DATA ACCUMULATION FILE REFORM
     A*        I-HASADA            87.10.28        *
     A*********************************** AU#PW80 **
     A                                      CHGINPDFT
     A          R AU#PW801
     A                                      CF01(01)
     A                                      CF05(05)
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 17'A-PICS PICK OUT DATA ACCUMULATION +
     A                                      FILE INZ'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT AU#PW80'
     A*
     A                                  6 37'COMING OUT DAY' DSPATR(RI)
     A            PHIZ           8A  B  8 38DSPATR(CS)
     A  99                                  DSPATR(RI)
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60   O 22 18
     A*
     A                                 24  4'EXIT'
     A                                 24 15' CMD-1 ' DSPATR(RI)
     A                                 24 24' OK '
     A                                 24 35' CMD-5 ' DSPATR(RI)
