     A********************************************
     A* INQUIRY SCREEN (AUBPW50)  OF UNDELIVERED INFORMATION
     A*            M S K             87.03.17    *
     A********************************************
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AUBPW501
     A*%%TS  SD  19961113  091236  MIKA        REL-V3R0M5  5763-PW1
     A                                      BLINK
     A                                      CA01(01 'CANCEL')
     A                                      KEEP
     A                                  1 16'UNDELIVERED INFORMATION INQUIRY BY-
     A                                       SECTION'
     A                                      DSPATR(RI)
     A                                  1 67'DATE'
     A            @DATE          6Y 0O  1 72EDTWRD('  .  .  ')
     A                                  2 67'TIME'
     A            @TIME          6Y 0O  2 72EDTWRD('  .  .  ')
     A                                  5 18'SELECT PROCESS SECTION...'
     A            @TYPE          1A  B  5 44DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  5 48'4 IS NOT NECESSARY TO KEY SELECT'
     A                                  8 26'PRECEDING PROCESS SECTION      ...-
     A                                       1'
     A                                  9 26'PLATING PROCESS SECTION        ...-
     A                                       2'
     A                                 10 26'2 PROCESSING PROCESS SECTION   ...-
     A                                       3'
     A                                 11 26'COMPLETION STORAGE             ...-
     A                                       4'
     A                                 13 18'SELECT KEY...'
     A            @KEY           1A  B 13 32DSPATR(CS)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 15 26'INTRAL CO. PART NO KEY..... A'
     A                                 16 26'FACTORY CODE KEY      ..... B'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(HI)
     A  97        @MSG          60A  O 22 15DSPATR(BL)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 43'AFTER KEY INPUT'
     A                                 24 63'ENTER'
     A                                      DSPATR(RI)
