     A********************************************
     A*INQUIRY SCREEN (AUBPW51)  OF  PRECEDING PROCESS UNDELIVERED INFORMATION
     A*            M S K             87.03.17    *
     A********************************************
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R AUBPW511
     A*%%TS  SD  19961113  091931  MIKA        REL-V3R0M5  5763-PW1
     A                                      BLINK
     A                                      CA01(01 'END')
     A                                      CA03(03 'PREVIOUS SCREEN')
     A                                  1 21'PRECEDING PROCESS UNDELIVERED INFO-
     A                                      RMATION'
     A                                      DSPATR(RI)
     A                                  1 67'DATE'
     A            @DATE          6Y 0O  1 72EDTWRD('  .  .  ')
     A                                  2 67'TIME'
     A            @TIME          6Y 0O  2 72EDTWRD('  .  .  ')
     A                                  7 16'INPUT PART NO INQUIRED TO ........-
     A                                      ..'
     A            @HIN1          5A  B  7 53DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  7 59'-'
     A            @HIN2          5A  B  7 61DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  7 67'-'
     A            @HIN3          2A  B  7 69DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                  9 53'YEAR'
     A                                  9 58'MONTH'
     A                                  9 64'DAY'
     A                                  9 69'BIN'
     A                                 10 16'INPUT UNDELIVERED HANDLING DATE...-
     A                                      ..'
     A            @HY            4Y 0B 10 53DSPATR(CS)
     A                                      EDTCDE(4)
     A  11
     AO 12                                  DSPATR(RI)
     A  11
     AO 12                                  DSPATR(PC)
     A                                 10 58'-'
     A            @HM            2Y 0B 10 60DSPATR(CS)
     A                                      EDTCDE(4)
     A  11
     AO 12                                  DSPATR(RI)
     A                                 10 63'-'
     A            @HD            2Y 0B 10 65DSPATR(CS)
     A                                      EDTCDE(4)
     A  11
     AO 12                                  DSPATR(RI)
     A                                 10 68'-'
     A            @BB            2Y 0B 10 70DSPATR(CS)
     A                                      EDTCDE(4)
     A  11
     AO 12                                  DSPATR(RI)
     A                                 12 16'SEARCHING COND OF HANDLING DATE...-
     A                                      ..'
     A            @JOKEN         1A  B 12 53DSPATR(CS)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                 13 22'A UNDELV STATUS UNTIL HANDLING DAT-
     A                                      E'
     A                                 14 22'B UNDELV STATUS OF HANDLING DATE'
     A                                 15 22'C UNDELV STATUS AFTER HANDLING DAT-
     A                                      E'
     A                                 17 16'INFORMATION ONLY UNDELV RIGHT NOW -
     A                                      ..'
     A            @YN            1A  B 17 53DSPATR(CS)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                 18 22'Y UNDELIVERED NOW'
     A                                 19 22'N ALL'
     A                                 20 16'DO YOU PRINT ?'
     A            @PRINT         1A  B 20 53DSPATR(CS)
     A  15                                  DSPATR(RI)
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(HI)
     A                                 24  4'EXIT'
     A                                 24 11'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 20'PREVIOUS SCREEN'
     A                                 24 38'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 47'AFTER KEY INPUT'
     A                                 24 65'ENTER'
     A                                      DSPATR(RI)
     A          R AUBPW512
     A*%%TS  SD  19961113  091931  MIKA        REL-V3R0M5  5763-PW1
     A                                      BLINK
     A                                      CA01(01 'END')
     A                                      CA03(03 'PREVIOUS SCREEN')
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A                                  1 27'PRECEDING PROCESS UNDELIVERED INFO-
     A                                      RMATION'
     A                                      DSPATR(RI)
     A                                  2  2'INT CO. PART NO'
     A            @HINBN        14A  O  2 18
     A            @SHURU        20A  O  2 33
     A                                  2 59'LOC CODE'
     A                                  2 71'MACHINE NO'
     A                                  3  2'ID NUMBER   '
     A            @ZETAI         4A  O  3 18
     A            @BANCI         9A  O  3 59
     A            @KIBAN         3A  O  3 75
     A                                  4  1'HANDLING DATE'
     A                                  4 23'PROD'
     A                                  4 38'RETRIEVAL'
     A                                  4 56'RETRIEVAL'
     A                                  4 70'UNDELIVERED'
     A                                  5  2'(OUTGOING)      SEC  ORDER NO. BOX-
     A                                               DATE 1 BOX         DATE 2 -
     A                                      BOX  NBR'
     A            @A01          13A  O  6  3
     A            @B01           4Y 0O  6 18EDTCDE(4)
     A            @C01           3A  O  6 25
     A            @D01           3Y 0O  6 33EDTCDE(4)
     A            @E01          11A  O  6 38
     A            @F01           3Y 0O  6 51EDTCDE(4)
     A            @G01          11A  O  6 57
     A            @H01           3Y 0O  6 70EDTCDE(4)
     A            @I01           3Y 0O  6 76EDTCDE(4)
     A            @A02          13A  O  7  3
     A            @B02           4Y 0O  7 18EDTCDE(4)
     A            @C02           3A  O  7 25
     A            @D02           3Y 0O  7 33EDTCDE(4)
     A            @E02          11A  O  7 38
     A            @F02           3Y 0O  7 51EDTCDE(4)
     A            @G02          11A  O  7 57
     A            @H02           3Y 0O  7 70EDTCDE(4)
     A            @I02           3Y 0O  7 76EDTCDE(4)
     A            @A03          13A  O  8  3
     A            @B03           4Y 0O  8 18EDTCDE(4)
     A            @C03           3A  O  8 25
     A            @D03           3Y 0O  8 33EDTCDE(4)
     A            @E03          11A  O  8 38
     A            @F03           3Y 0O  8 51EDTCDE(4)
     A            @G03          11A  O  8 57
     A            @H03           3Y 0O  8 70EDTCDE(4)
     A            @I03           3Y 0O  8 76EDTCDE(4)
     A            @A04          13A  O  9  3
     A            @B04           4Y 0O  9 18EDTCDE(4)
     A            @C04           3A  O  9 25
     A            @D04           3Y 0O  9 33EDTCDE(4)
     A            @E04          11A  O  9 38
     A            @F04           3Y 0O  9 51EDTCDE(4)
     A            @G04          11A  O  9 57
     A            @H04           3Y 0O  9 70EDTCDE(4)
     A            @I04           3Y 0O  9 76EDTCDE(4)
     A            @A05          13A  O 10  3
     A            @B05           4Y 0O 10 18EDTCDE(4)
     A            @C05           3A  O 10 25
     A            @D05           3Y 0O 10 33EDTCDE(4)
     A            @E05          11A  O 10 38
     A            @F05           3Y 0O 10 51EDTCDE(4)
     A            @G05          11A  O 10 57
     A            @H05           3Y 0O 10 70EDTCDE(4)
     A            @I05           3Y 0O 10 76EDTCDE(4)
     A            @A06          13A  O 11  3
     A            @B06           4Y 0O 11 18EDTCDE(4)
     A            @C06           3A  O 11 25
     A            @D06           3Y 0O 11 33EDTCDE(4)
     A            @E06          11A  O 11 38
     A            @F06           3Y 0O 11 51EDTCDE(4)
     A            @G06          11A  O 11 57
     A            @H06           3Y 0O 11 70EDTCDE(4)
     A            @I06           3Y 0O 11 76EDTCDE(4)
     A            @A07          13A  O 12  3
     A            @B07           4Y 0O 12 18EDTCDE(4)
     A            @C07           3A  O 12 25
     A            @D07           3Y 0O 12 33EDTCDE(4)
     A            @E07          11A  O 12 38
     A            @F07           3Y 0O 12 51EDTCDE(4)
     A            @G07          11A  O 12 57
     A            @H07           3Y 0O 12 70EDTCDE(4)
     A            @I07           3Y 0O 12 76EDTCDE(4)
     A            @A08          13A  O 13  3
     A            @B08           4Y 0O 13 18EDTCDE(4)
     A            @C08           3A  O 13 25
     A            @D08           3Y 0O 13 33EDTCDE(4)
     A            @E08          11A  O 13 38
     A            @F08           3Y 0O 13 51EDTCDE(4)
     A            @G08          11A  O 13 57
     A            @H08           3Y 0O 13 70EDTCDE(4)
     A            @I08           3Y 0O 13 76EDTCDE(4)
     A            @A09          13A  O 14  3
     A            @B09           4Y 0O 14 18EDTCDE(4)
     A            @C09           3A  O 14 25
     A            @D09           3Y 0O 14 33EDTCDE(4)
     A            @E09          11A  O 14 38
     A            @F09           3Y 0O 14 51EDTCDE(4)
     A            @G09          11A  O 14 57
     A            @H09           3Y 0O 14 70EDTCDE(4)
     A            @I09           3Y 0O 14 76EDTCDE(4)
     A            @A10          13A  O 15  3
     A            @B10           4Y 0O 15 18EDTCDE(4)
     A            @C10           3A  O 15 25
     A            @D10           3Y 0O 15 33EDTCDE(4)
     A            @E10          11A  O 15 38
     A            @F10           3Y 0O 15 51EDTCDE(4)
     A            @G10          11A  O 15 57
     A            @H10           3Y 0O 15 70EDTCDE(4)
     A            @I10           3Y 0O 15 76EDTCDE(4)
     A            @A11          13A  O 16  3
     A            @B11           4Y 0O 16 18EDTCDE(4)
     A            @C11           3A  O 16 25
     A            @D11           3Y 0O 16 33EDTCDE(4)
     A            @E11          11A  O 16 38
     A            @F11           3Y 0O 16 51EDTCDE(4)
     A            @G11          11A  O 16 57
     A            @H11           3Y 0O 16 70EDTCDE(4)
     A            @I11           3Y 0O 16 76EDTCDE(4)
     A            @A12          13A  O 17  3
     A            @B12           4Y 0O 17 18EDTCDE(4)
     A            @C12           3A  O 17 25
     A            @D12           3Y 0O 17 33EDTCDE(4)
     A            @E12          11A  O 17 38
     A            @F12           3Y 0O 17 51EDTCDE(4)
     A            @G12          11A  O 17 57
     A            @H12           3Y 0O 17 70EDTCDE(4)
     A            @I12           3Y 0O 17 76EDTCDE(4)
     A            @A13          13A  O 18  3
     A            @B13           4Y 0O 18 18EDTCDE(4)
     A            @C13           3A  O 18 25
     A            @D13           3Y 0O 18 33EDTCDE(4)
     A            @E13          11A  O 18 38
     A            @F13           3Y 0O 18 51EDTCDE(4)
     A            @G13          11A  O 18 57
     A            @H13           3Y 0O 18 70EDTCDE(4)
     A            @I13           3Y 0O 18 76EDTCDE(4)
     A            @A14          13A  O 19  3
     A            @B14           4Y 0O 19 18EDTCDE(4)
     A            @C14           3A  O 19 25
     A            @D14           3Y 0O 19 33EDTCDE(4)
     A            @E14          11A  O 19 38
     A            @F14           3Y 0O 19 51EDTCDE(4)
     A            @G14          11A  O 19 57
     A            @H14           3Y 0O 19 70EDTCDE(4)
     A            @I14           3Y 0O 19 76EDTCDE(4)
     A            @A15          13A  O 20  3
     A            @B15           4Y 0O 20 18EDTCDE(4)
     A            @C15           3A  O 20 25
     A            @D15           3Y 0O 20 33EDTCDE(4)
     A            @E15          11A  O 20 38
     A            @F15           3Y 0O 20 51EDTCDE(4)
     A            @G15          11A  O 20 57
     A            @H15           3Y 0O 20 70EDTCDE(4)
     A            @I15           3Y 0O 20 76EDTCDE(4)
     A            @MSG           2A  O 21 77
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(HI)
     A                                 24  4'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 16'PRV SCREEN'
     A                                 24 27'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 34'NEXT DETAILS'
     A                                 24 47'ROLL UP'
     A                                      DSPATR(RI)
     A                                 24 56'PRV DETAILS'
     A                                 24 68'ROLL DOWN'
     A                                      DSPATR(RI)
