     A*%%TS  SD  20170731  101432  I0777       REL-V7R1M0  5770-WDS
     A** AUCPW11 ***********************************
     A* ...INQUIRY / UPDATE OF  SALES DATA ,,,     *
     A* I-HASADA 81.11.01 N.HAYAKAWA *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*-------------------------------------*
     A*         .....SCREEN 1.....           *
     A*-------------------------------------*
     A          R AUCPW111
     A*%%TS  SD  20170731  101432  I0777       REL-V7R1M0  5770-WDS
     A                                      CHGINPDFT
     A                                      TEXT('SALES DATA INQUIRY &MAINTNANC-
     A                                      E KEY')
     A                                      CF01
     A                                  1  3TIME
     A                                  1 21'* SALES DATA INQUIRY & MAINTENANCE-
     A                                       *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 66'DAILY'
     A            B1DAIY         6Y 0O  1 72EDTCDE(Y)
     A                                  6 10'APPOINTED KEY INQUIRED TO -->'
     A                                  6 41'DELIVERY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1WNOY         4A  B  6 56DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7 41'FACTORY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1NKOJ         1A  B  7 56DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  8 41'DOCK'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1NUKE         4A  B  8 56DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  9 41'U PART NUMBER'
     A                                      DSPATR(RI)
     A            B1MHNB        20A  B  9 56DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 13 10'DEFAULT DELIVERY CODE ->'
     A                                 13 41'CUSTOMER'
     A                                      DSPATR(RI)
     A            B1WTOK         4A  B 13 56DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 16 10'DATE OF DATA INQUIRED TO --->'
     A                                 16 41'YEAR / MONTH'
     A                                      DSPATR(RI)
     A            B1NHZ1         6Y 0B 16 56DSPATR(CS)
     A                                      EDTCDE(Z)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                 17 56'--> DEFAULT IS ALL DATA'
     A                                 19 35'TOTAL INPUT COUNT'
     A                                      DSPATR(UL)
     A            @KEN           3Y 0O 19 56EDTCDE(3)
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A  99        B1EROR         5A  O 22  8DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        B1MSG         65A  O 22 16
     A                                 24 14'EXIT'
     A                                 24 21'CMD-1'
     A                                      DSPATR(RI)
     A                                  2  3'AUCPW11'
     A*-------------------------------------*
     A*         .....SCREEN 2.....           *
     A*-------------------------------------*
     A          R AUCPW112
     A*%%TS  SD  20170731  101432  I0777       REL-V7R1M0  5770-WDS
     A                                      CHGINPDFT
     A                                      TEXT('SALES DATA INQUIRY')
     A                                      CF01
     A                                      CF03
     A                                      ROLLUP(07 'ROLL UP')
     A                                      ROLLDOWN(08 'ROLL DOWN')
     A                                  1  2'CUSTOMER'
     A                                      DSPATR(UL)
     A            B1WTOK         4A  O  1 12
     A            B1WTNM        16A  O  1 17
     A                                  1 35'SALES DATA INQUIRY & MAINTENANCE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1DAIY         6Y 0O  1 72EDTCDE(Y)
     A                                  2  2'DELIVERY'
     A                                      DSPATR(UL)
     A            B1WNOY         4A  O  2 12
     A            B1WNNM        16A  O  2 17
     A                                  3  2'F. DOCK'
     A                                      DSPATR(UL)
     A            B1WKNJ         1A  O  3 12
     A            B1WKNU         4A  O  3 14
     A            B1NKNM        15A  O  3 19
     A            ROLMSG        40A  O  3 40
     A  41
     AO 49
     AO 51
     AO 52
     AO 79                                  DSPATR(HI)
     A  41
     AO 49
     AO 51
     AO 52
     AO 79                                  DSPATR(BL)
     A                                  4  2'U PART NUMBER'
     A                                      DSPATR(UL)
     A            B1MHIB        23A  O  4 17
     A                                  4 40'S PART NUMBER'
     A                                      DSPATR(UL)
     A            B1SHIB        14A  O  4 55
     A                                  6  2'NO'
     A                                      DSPATR(RI)
     A                                  6  6'DELV.DATE'
     A                                      DSPATR(RI)
     A                                  6 16'BIN'
     A                                      DSPATR(RI)
     A                                  6 22'AMOUNT'
     A                                      DSPATR(RI)
     A                                  6 29'ORDER.NO.'
     A                                      DSPATR(RI)
     A                                  6 40'DELV.NO.'
     A                                      DSPATR(RI)
     A                                  6 56'PAMT.DATE'
     A                                      DSPATR(RI)
     A*                                 6 66'J'
     A*                                     DSPATR(RI)
     A                                  5 68'BILL'
     A                                      DSPATR(RI)
     A                                  6 68'MONTH'
     A                                      DSPATR(RI)
     A                                  5 74'CRY'
     A                                      DSPATR(RI)
     A                                  6 74'OVR'
     A                                      DSPATR(RI)
     A*
     A            B1KOS1         1A  B  8  2DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A  01                              8  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ1         6Y 0O  8  6EDTWRD('  .  .  ')
     A  01                                  DSPATR(RI)
     A            B1NBI1         1Y 0O  8 16EDTCDE(Z)
     A            B1SRY1         7Y 0O  8 19EDTCDE(2)
     A            B1OER1        10A  O  8 29
     A            B1NBA1        16A  O  8 40
     A            B1JYZ1         6Y 0O  8 57EDTWRD('  .  .  ')
     A*           B1JRY1         1A  O  8 66
     A            B1SEM1         2Y 0O  8 69EDTCDE(Z)
     A            B1KRS1         1Y 0O  8 75EDTCDE(Z)
     A            B1KOS2         1A  B 10  2DSPATR(CS)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A  02                             10  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ2         6Y 0O 10  6EDTWRD('  .  .  ')
     A  02                                  DSPATR(RI)
     A            B1NBI2         1Y 0O 10 16EDTCDE(Z)
     A            B1SRY2         7Y 0O 10 19EDTCDE(2)
     A            B1OER2        10A  O 10 29
     A            B1NBA2        16A  O 10 40
     A            B1JYZ2         6Y 0O 10 57EDTWRD('  .  .  ')
     A*           B1JRY2         1A  O 10 66
     A            B1SEM2         2Y 0O 10 69EDTCDE(Z)
     A            B1KRS2         1Y 0O 10 75EDTCDE(Z)
     A            B1KOS3         1A  B 12  2DSPATR(CS)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A  03                             12  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ3         6Y 0O 12  6EDTWRD('  .  .  ')
     A  03                                  DSPATR(RI)
     A            B1NBI3         1Y 0O 12 16EDTCDE(Z)
     A            B1SRY3         7Y 0O 12 19EDTCDE(2)
     A            B1OER3        10A  O 12 29
     A            B1NBA3        16A  O 12 40
     A            B1JYZ3         6Y 0O 12 57EDTWRD('  .  .  ')
     A*           B1JRY3         1A  O 12 66
     A            B1SEM3         2Y 0O 12 69EDTCDE(Z)
     A            B1KRS3         1Y 0O 12 75EDTCDE(Z)
     A            B1KOS4         1A  B 14  2DSPATR(CS)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A  04                             14  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ4         6Y 0O 14  6EDTWRD('  .  .  ')
     A  04                                  DSPATR(RI)
     A            B1NBI4         1Y 0O 14 16EDTCDE(Z)
     A            B1SRY4         7Y 0O 14 19EDTCDE(2)
     A            B1OER4        10A  O 14 29
     A            B1NBA4        16A  O 14 40
     A            B1JYZ4         6Y 0O 14 57EDTWRD('  .  .  ')
     A*           B1JRY4         1A  O 14 66
     A            B1SEM4         2Y 0O 14 69EDTCDE(Z)
     A            B1KRS4         1Y 0O 14 75EDTCDE(Z)
     A            B1KOS5         1A  B 16  2DSPATR(CS)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A  05                             16  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ5         6Y 0O 16  6EDTWRD('  .  .  ')
     A  05                                  DSPATR(RI)
     A            B1NBI5         1Y 0O 16 16EDTCDE(Z)
     A            B1SRY5         7Y 0O 16 19EDTCDE(2)
     A            B1OER5        10A  O 16 29
     A            B1NBA5        16A  O 16 40
     A            B1JYZ5         6Y 0O 16 57EDTWRD('  .  .  ')
     A*           B1JRY5         1A  O 16 66
     A            B1SEM5         2Y 0O 16 69EDTCDE(Z)
     A            B1KRS5         1Y 0O 16 75EDTCDE(Z)
     A            B1KOS6         1A  B 18  2DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  06                             18  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ6         6Y 0O 18  6EDTWRD('  .  .  ')
     A  06                                  DSPATR(RI)
     A            B1NBI6         1Y 0O 18 16EDTCDE(Z)
     A            B1SRY6         7Y 0O 18 19EDTCDE(2)
     A            B1OER6        10A  O 18 29
     A            B1NBA6        16A  O 18 40
     A            B1JYZ6         6Y 0O 18 57EDTWRD('  .  .  ')
     A*           B1JRY6         1A  O 18 66
     A            B1SEM6         2Y 0O 18 69EDTCDE(Z)
     A            B1KRS6         1Y 0O 18 75EDTCDE(Z)
     A            B1KOS7         1A  B 20  2DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  95                             20  4'D'
     A                                      DSPATR(BL)
     A            B1NYZ7         6Y 0O 20  6EDTWRD('  .  .  ')
     A  95                                  DSPATR(RI)
     A            B1NBI7         1Y 0O 20 16EDTCDE(Z)
     A            B1SRY7         7Y 0O 20 19EDTCDE(2)
     A            B1OER7        10A  O 20 29
     A            B1NBA7        16A  O 20 40
     A            B1JYZ7         6Y 0O 20 57EDTWRD('  .  .  ')
     A*           B1JRY7         1A  O 20 66
     A            B1SEM7         2Y 0O 20 69EDTCDE(Z)
     A            B1KRS7         1Y 0O 20 75EDTCDE(Z)
     A                                 21  2'|'
     A                                 22  2'+->INPUT UPDATE INSTRUCTION(0-CAN -
     A                                      1-CHG 2-ADD M-DTL)'
     A  98        B1WTKH        11A  O 22 58DSPATR(HI)
     A                                      DSPATR(BL)
     A  99        B1EROR         5A  O 23  8DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        B1MSG         65A  O 23 16
     A                                 24  3'INQUIRY EXIT'
     A                                 24 16'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 23'KEY INPUT'
     A                                 24 33'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 40'BACKWARD'
     A                                 24 49'ROLL-DWN'
     A                                      DSPATR(RI)
     A                                 24 59'FORWARD'
     A                                 24 67'ENTER.ROLL-UP'
     A                                      DSPATR(RI)
     A                                  2 72'AUCPW11'
     A*-------------------------------------*
     A*         .....SCREEN 3.....           *
     A*-------------------------------------*
     A          R AUCPW113
     A                                      CHGINPDFT
     A                                      TEXT('SALES DATA UPDATE')
     A                                      CF03
     A                                      CF05
     A            B1SNNM        16A  O  1  2
     A                                  1 23'* SALES DATA INQUIRY & MAINTENANCE-
     A                                       *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1SKNM        16A  O  1 65
     A                                  2  2'+----------------------------------
     A                                      ------------------------------------
     A                                      --------+'
     A                                  3  2'|'
     A                                  3  4'UPDATE'
     A            B1KOSN         1A  O  3 20
     A            B1KSNM         6A  O  3 22
     A                                  3 37'SALES ADDING UP DATE'
     A            B1URHX         6Y 0O  3 66EDTWRD('  .  .  ')
     A                                  3 79'|'
     A                                  4  2'|'
     A                                  4  4'RECORD NO.'
     A            B1RCOD         7Y 0O  4 22EDTCDE(Z)
     A                                  4 37'UPDATE DATE'
     A            B1KSHX         6Y 0O  4 50EDTWRD('  .  .  ')
     A                                  4 60'TIME'
     A            B1TME          4Y 0O  4 66EDTWRD('  :  ')
     A                                  4 79'|'
     A                                  5  2'|'
     A                                  5  4'DELETE DUE DATE'
     A  96        B1SKH1         6Y 0O  5 22EDTWRD('  .  .  ')
     A                                  5 37'NAME'
     A            B1NAME        16A  O  5 50
     A                                  5 79'|'
     A                                  6  2'|'
     A                                  6  4'BUSINESS CODE'
     A            B1GYOM         2A  O  6 19
     A            WGYOM@        14A  O  6 22
     A                                  6 37'DATA KIND'
     A            B1DTRI         1A  O  6 50
     A            WDTRI         24A  O  6 52
     A                                  6 79'|'
     A                                  7  2'|'
     A                                  7  4'INTRAL CO. PROD ORDER INST.'
     A                                  8  2'|'
     A            B1THAI         1A  O  8 18
     A            WTHAI@        16A  O  8 20
     A                                  7 37'DATA CLASS'
     A            B1DTSO         1A  O  7 50
     A            WDTSO         24A  O  7 52
     A                                  8 79'|'
     A                                  7 79'|'
     A                                  9  2'|'
     A                                  9  4'USER ACCOM. QTY.'
     A            B1SYUY         5Y 0O  9 22EDTCDE(1)
     A                                  9 37'LOT NUMBER'
     A            B1LOTO         2Y 0O  9 50EDTCDE(Z)
     A                                  9 53'PAGE'
     A            B1PAGE         4Y 0O  9 62EDTCDE(Z)
     A                                  9 69'LINE'
     A            B1GIYO         2Y 0O  9 75EDTCDE(Z)
     A                                  9 79'|'
     A                                 10  2'+----------------------------------
     A                                      ------------------------------------
     A                                      --------+'
     A                                 11  3'CUSTOMER F DOCK'
     A                                      DSPATR(UL)
     A                                 11 23'DELV.CO. F DOCK'
     A                                      DSPATR(UL)
     A                                 11 41'USER PART NBR.'
     A                                      DSPATR(UL)
     A                                 11 62'INTRAL CO. PART NO.'
     A                                      DSPATR(UL)
     A            B1WTTK         4A  B 12  3DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            B1TKOJ         1A  B 12  9DSPATR(CS)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            B1TUKE         4A  B 12 13DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            B1WNNY         4A  B 12 23DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            B1NKOJ         1A  B 12 30DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            B1NUKE         4A  B 12 33DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            B1MHNB        20A  B 12 41DSPATR(CS)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            B1SHNB        12A  B 12 65DSPATR(CS)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                 14  3'DELV.DATE  BIN'
     A                                      DSPATR(UL)
     A                                 14 19'ORDER.NO.'
     A                                      DSPATR(UL)
     A  90                             14 32'SALES UNP  INST'
     A                                      DSPATR(UL)
     A                                 14 48'UNP FORM'
     A                                      DSPATR(UL)
     A                                 13 57'STATEMENT OF'
     A                                 14 57'DELV.NO.'
     A                                      DSPATR(UL)
     A                                 14 74'INST.'
     A                                      DSPATR(UL)
     A            B1NHZ2         8Y 0B 15  4DSPATR(CS)
     A                                      EDTCDE(Z)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            B1NOBI         2Y 0B 15 14DSPATR(CS)
     A                                      EDTCDE(Z)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            B1ODR1        10A  B 15 19DSPATR(CS)
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A  90        B1TANK        10Y 5B 15 31DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  90        B1TKBN         1A  B 15 45DSPATR(CS)
     A  90 29                               DSPATR(RI)
     A  90 29                               DSPATR(PC)
     A            B1TTAI         1A  B 15 51DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            B1NBAN        16A  B 15 57DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            B1NSYO         1A  B 15 75DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 17  7'DELV AMT  UNIT'
     A                                      DSPATR(UL)
     A                                 16 26'RECEIPT'
     A                                 17 28'DATE  INST.'
     A                                      DSPATR(UL)
     A                                 17 42'S.SEQUENCE   PAYMENT'
     A                                      DSPATR(UL)
     A                                 17 68'SIGN-OFF'
     A                                      DSPATR(UL)
     A            B1SRYO         7Y 0B 18  8DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            B1TANI         1A  B 18 19DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            B1JRHZ         8Y 0B 18 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            B1JRYO         1A  B 18 36DSPATR(CS)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            B1SQES         1A  B 18 47
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A            B1SEHZ         8Y 0B 18 54DSPATR(CS) EDTCDE(Z)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            B1KSYU         1A  B 18 72
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A                                 20  5'MONTHLY'
     A                                      DSPATR(UL)
     A                                 19 13'CARRY'
     A                                 20 14'OVER'
     A                                      DSPATR(UL)
     A                                 20 19'REASON'
     A                                      DSPATR(UL)
     A                                 20 27'ID NO'
     A                                      DSPATR(UL)
     A                                 20 35'CARD'
     A                                      DSPATR(UL)
     A                                 20 51'P INST.'
     A                                      DSPATR(UL)
     A                                 20 60'PURCHASING'
     A                                      DSPATR(UL)
     A                                 20 72'RED SLIP'
     A                                      DSPATR(UL)
     A            B1GEMM         2Y 0B 21  7EDTCDE(Z)
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            B1KRKS         1Y 0B 21 15EDTCDE(Z)
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A            B1RYU1         1A  B 21 21DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            B1SBAN         4A  B 21 28DSPATR(CS)
     A                                      CHECK(RZ)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            B1CARD         4A  B 21 35DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            B1RYU2         1A  B 21 54DSPATR(CS)
     A            B1KOBI         2A  B 21 64DSPATR(CS)
     A            B1AKAD         1A  B 21 76DSPATR(CS)
     A                                 22 35'M390-NORMAL SHIPMENT'
     A                                 22 57'M391-SHORT SHIPMENT'
     A  99        B1EROR         5A  O 23  8DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        B1MSG         65A  O 23 16
     A                                 24  2'RETURN TO KEY INPUT'
     A                                 24 23'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 31'UPDATE OK'
     A                                 24 42'CMD-5'
     A                                      DSPATR(RI)
