      ** AYBPW01 ******************************************************
      * ADDDIRE   ディレクトリー項目追加
      * ADDNETJOBEネットワーク・ジョブ項目追加のUSRID指示
      *  KIRI 2014.11.06
      *****************************************************************
     A                                      PRINT(QPRINT)
     A                                      CHGINPDFT
     A          R DSP01
     A                                      CF01(01) CF05(05)
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                    +1TIME
     A                                  1 35' ADDDIRE '
     A                                      DSPATR(RI UL)
     A                                  2 35' ADDNETJOBE '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                    +1'AYBPW01'
     A                                  2  2'DATE'
     A                                    +1DATE EDTWRD('0  .  .  ')
      *
     A                                  6 15'USER ID'
     A            USRID         10   B   + 2DSPATR(CS)
     A  11                                  DSPATR(PC RI)
      *
     A  99                             22 10'ERROR' DSPATR(RI BL)
     A  99        D1ERR         60O    22 20DSPATR(HI)
      *
     A                                 24  4' F1 ' DSPATR(RI)
     A                                   + 1' EXIT '
     A                                   + 4' F5 ' DSPATR(RI)
     A                                   + 1' DO '
