     A** BADPW04 *********************************
     A* * PRODUCTION ORDER AGAIN AND OVER MADE
     A* FILE ID. : BADPW04. <DSPF> *
     A* CREATE DATE. : MAR.23,'90.               *
     A* AUTHOR.         : E.KAWASHIMA            *
     A* TCHK1 03/02/06 CHG                       *
     A********************************* BADPW04 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R BADPW041
     A*%%TS  SD  19961014  163651  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                      CF03
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** PROD REORDER & OVER MADE DA-
     A                                      TA INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 73'BADPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3 13'1.APPOINTMENT -
     A                                      DATA INST / PLATING MAKER / PERI-
     A                                      OD'
     A                                  8 20'DATA INST'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            KBN            1A  B  8 41DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 12 20'PLATING MAKER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            KOJO           4Y 0B 12 41DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 16 20'PERIOD'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            STHZ           8Y 0B 16 41DSPATR(CS)
     A                                      EDTCDE(4)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                      OVRATR
     A                                      OVRDTA
     A                                 16 50' -'
     A            ENHZ           8Y 0B 16 54DSPATR(CS)
     A                                      EDTCDE(4)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A                                      OVRATR
     A                                      OVRDTA
     A                                  8 49'1 - PRODUCTION REORDER'
     A                                  9 49'2 - OVER MADE '
     A                                 10 49'3 - ALL'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            ERR           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 11'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 20' PRV SCREEN'
     A                                 24 34'CMD-3'
     A                                      DSPATR(RI)
     A*
     A*
     A*
     A          R DSP2R                     SFL
     A*%%TS  SD  19961014  164406  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      TEXT('SUBFILE')
     A            @HIN          14A  O  7  2
     A            @KBNM         10A  O  7 17
     A            @NHIZ          6Y 0O  7 28EDTWRD('  .  .  ')
TCHK1A*           @KBN           5A  O  7 40
TCHK1A            @KBN           7A  O  7 39
     A            @MAIS          3Y 0O  7 50EDTCDE(2)
     A            @KAIS          5Y 0O  7 57EDTCDE(4)
     A            @SYOS          5Y 0O  7 65EDTCDE(2)
     A            @SYOT          1A  O  7 75
     A            @RAIN          1A  O  7 78
     A                                  8  3'UPDATE PERSON'
     A            @NAM          10A  O  8 17
     A                                  8 28'C BOX RATIO'
     A            @CHKO          2Y 0O  8 40EDTCDE(2)
     A                                  8 44'PRECEDING PROC'
     A            @ZCD           4Y 0O  8 59EDTCDE(4)
     A            @ZNM          16A  O  8 64
     A                                  9 50' '
     A*
     A          R DSP2C                     SFLCTL(DSP2R)
     A*%%TS  SD  19961014  164406  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A                                      TEXT('SUBFILE CONTROL')
     A                                      CF01
     A                                      CF03
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      PROTECT
     A  91                                  SFLDSP
     A  91                                  SFLDSPCTL
     A  91                                  SFLEND
     A  92                                  SFLCLR
     A  93                                  SFLINZ
     A                                      ROLLUP(81)
     A  99                                  SFLMSG('NO DATA AFTER ALL' 99)
     A            RCDNBR         4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** PROD REORDER & OVER MADE DA-
     A                                      TA INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 73'BADPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3 11'DATA INST'
     A            DTNM          10A  O  3 24
     A                                  3 36'PLATING MAKER'
     A            KOJO           4Y 0O  3 53EDTCDE(4)
     A            MKNM          16A  O  3 59
     A                                  4 11'PERIOD'
     A            STHZ           8Y 0O  4 24EDTWRD('    .  .  ')
     A                                  4 36' -'
     A            ENHZ           8Y 0O  4 42EDTWRD('    .  .  ')
     A                                  5  2'INT CO.'
     A                                  5 48'INPUT'
     A                                  5 55'ORDERING'
     A                                  6  2'PART NO'
     A                                      DSPATR(UL)
     A                                  6 17'DATA INST'
     A                                      DSPATR(UL)
     A                                  6 27'INPUT DATE'
     A                                      DSPATR(UL)
TCHK1A*                                 6 39'MCH.NO.'
TCHK1A                                  6 39'LOT/PAGE'
     A                                      DSPATR(UL)
     A                                  6 48'SHEETS'
     A                                      DSPATR(UL)
     A                                  6 55'FREQUENCY'
     A                                      DSPATR(UL)
     A                                  6 65'ACCOM QTY-C'
     A                                      DSPATR(UL)
     A                                  6 77'LINE'
     A                                      DSPATR(UL)
     A*
     A          R DSP2X                     TEXT('COMMAND EXPLANATION')
     A                                      PUTOVR KEEP
     A                                 24  3'EXIT'
     A                                    +1'CMD-1'
     A                                      DSPATR(RI)
     A                                    +3'PRV SCREEN'
     A                                    +1'CMD-3'
     A                                      DSPATR(RI)
     A                                    +3'PRV SCREEN'
     A                                    +1'ROLL-DOWN'
     A                                      DSPATR(RI)
     A                                    +3'NEXT DETAILS'
     A                                    +1'ROLL-UP'
     A                                      DSPATR(RI)
