     A*** BAHPW03 **********************
     A* INTRA-PROCESS L / T M/F ACCOUNT BOOK *
     A* A.IDOTA 1994.11.15 *
     A*********************** BAHPW03 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A************
     A* * SCREEN 1*
     A************
     A          R BAHPW031
     A*%%TS  SD  19961011  161011  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('INTRA-PROCESS KANBAN')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 25'** INTRA-PROCESS L / T ACCOUNT -
     A                                      BOOK **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT BAHPW031'
     A                                  6 37'SECTION'
     A                                      DSPATR(RI)
     A            BMN            4A  B  8 39DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  5'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'PUBLICATION OK'
     A                                 24 41'CMD-5'
     A                                      DSPATR(RI)
