     A********************************************
     A* TOYOTA SYSTEM VOLUME PRODUCTION UNIT PRICE M/F UPDATE *
     A* FILE ID. : BBAPW01. <DSPF> *
     A* CREATE DATE. : APR.11,'90.               *
     A* AUTHOR.         : KOHHY                  *
     A********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R BBAPW011
     A*%%TS  SD  19961015  111142  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 1')
     A                                      CF01
     A                                      CF07
     A                                      BLINK
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 17'** TOYOTA SYSTEM VOL.PROD UNIT PRI-
     A                                      CE M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 72'BBAPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3 20'TOYOTA SYSTEM'
     A                                      DSPATR(UL)
     A                                  5  5'HOUSING OF TOYOTA MUST +
     A                                      UPDATE VOL.PROD UNIT PRICE M/F'
     A                                  6  5'BESIDES TOYOTA SYSTEM'
     A                                  7  4'USER PART NBR'
     A                                      DSPATR(RI)
     A                                  7 25'RECEIVING CO.'
     A                                      DSPATR(RI)
     A                                  7 39'FACTORY'
     A                                      DSPATR(RI)
     A                                  7 47'MANAGEMENT NO.'
     A                                      DSPATR(RI)
     A                                  7 63'UPDATE'
     A                                      DSPATR(RI)
     A                                  7 70'CUSTOMER'
     A                                      DSPATR(RI)
     A            HIN1           5A  B  9  4DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  9 10'-'
     A            HIN2           5A  B  9 12DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  9 18'-'
     A            HIN3           5A  B  9 20DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A            NONY           4Y 0B  9 30DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A            KOJO           1A  B  9 42DSPATR(CS)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            KNNO          10A  B  9 49DSPATR(CS)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A            KTYPE          1A  B  9 66DSPATR(CS)
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            TOKU           4Y 0B  9 72DSPATR(CS)
     A                                      EDTCDE(4)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A                                 11 60'UPDATE INSTRUCTION'
     A                                 12 62'0- CANCEL'
     A                                 13 62'1- CHANGE'
     A                                 14 62'2- ADD'
     A                                 15  3'LAST TIME-----'
     A                                 17  4'USER PART NUMBER'
     A                                      DSPATR(UL)
     A                                 17 25'RECEIVING CO.'
     A                                      DSPATR(UL)
     A                                 17 39'FACTORY'
     A                                      DSPATR(UL)
     A                                 17 47'MANAGEMENT NO.'
     A                                      DSPATR(UL)
     A                                 17 63'UPDATE'
     A                                      DSPATR(UL)
     A                                 17 70'CUSTOMER'
     A                                      DSPATR(UL)
     A            MHIN          17A  O 19  6
     A            MNONY          4Y 0O 19 30EDTCDE(4)
     A            MKOJO          1A  O 19 42
     A            MKNNO         10A  O 19 49
     A            MKTYPE         1A  O 19 62
     A            MKTYNM         6A  O 19 64
     A            MTOKU          4Y 0O 19 72EDTCDE(4)
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ERR           60O  O 22 18DSPATR(HI)
     A                                 24  3'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 17'USER PART NBR CONFIRMATION'
     A                                 24 45'CMD-7'
     A                                      DSPATR(RI)
     A*
     A*
     A*
     A          R BBAPW012
     A*%%TS  SD  19961114  092755  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 2')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A  99                                  ALARM
     A                                  1 17'** TOYOTA SYSTEM VOL.PROD UNIT PRI-
     A                                      CE M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 72'BBAPW01'
     A                                  2  2'TOYOTA SYSTEM'
     A                                      DSPATR(UL)
     A                                  4  4'USER PART NBR'
     A                                      DSPATR(UL)
     A                                  4 25'RECEIVING CO.'
     A                                      DSPATR(UL)
     A                                  4 39'FACTORY'
     A                                      DSPATR(UL)
     A                                  4 47'MANAGEMENT NO.'
     A                                      DSPATR(UL)
     A                                  4 63'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 70'CUSTOMER'
     A                                      DSPATR(UL)
     A            HIN1           5A  O  5  4
     A                                  5 10'-'
     A            HIN2           5A  O  5 12
     A                                  5 18'-'
     A            HIN3           5A  O  5 20
     A            NONY           4Y 0O  5 30EDTCDE(4)
     A            KOJO           1A  O  5 42
     A            KNNO          10A  O  5 49
     A            KTYPE          1A  O  5 61
     A            KTYNM          6O  O  5 63
     A            TOKU           4Y 0O  5 72EDTCDE(4)
     A                                  7 19'THIS TIME PURCHASE UNIT PRICE -----
     A                                      ----------------'
     A                                  8  5'NO.'
     A                                      DSPATR(UL)
     A                                  8 10'PACKING'
     A                                      DSPATR(UL)
     A                                  8 20'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                  8 32'APPLY'
     A                                      DSPATR(UL)
     A                                  8 48'APPLY'
     A                                      DSPATR(UL)
     A                                  8 60'PRESENT/OLD'
     A                                      DSPATR(UL)
     A                                  8 73'OLD DIE'
     A                                      DSPATR(UL)
     A                                  9 32'START DATE'
     A                                      DSPATR(UL)
     A                                  9 48'EXIT DATE'
     A                                      DSPATR(UL)
     A            NO01           4Y 0O 10  4EDTCDE(4)
     A            KN01           1A  O 10 13
     A            TN01           9Y 2O 10 19EDTCDE(2)
     A            ST01           6Y 0O 10 34EDTWRD('  .  .  ')
     A            EN01           6Y 0O 10 49EDTWRD('  .  .  ')
     A            GK01           1A  O 10 66
     A            OT01           1A  O 10 75
     A            NO02           4Y 0O 11  4EDTCDE(4)
     A            KN02           1A  O 11 13
     A            TN02           9Y 2O 11 19EDTCDE(2)
     A            ST02           6Y 0O 11 34EDTWRD('  .  .  ')
     A            EN02           6Y 0O 11 49EDTWRD('  .  .  ')
     A            GK02           1A  O 11 66
     A            OT02           1A  O 11 75
     A            NO03           4Y 0O 12  4EDTCDE(4)
     A            KN03           1A  O 12 13
     A            TN03           9Y 2O 12 19EDTCDE(2)
     A            ST03           6Y 0O 12 34EDTWRD('  .  .  ')
     A            EN03           6Y 0O 12 49EDTWRD('  .  .  ')
     A            GK03           1A  O 12 66
     A            OT03           1A  O 12 75
     A            NO04           4Y 0O 13  4EDTCDE(4)
     A            KN04           1A  O 13 13
     A            TN04           9Y 2O 13 19EDTCDE(2)
     A            ST04           6Y 0O 13 34EDTWRD('  .  .  ')
     A            EN04           6Y 0O 13 49EDTWRD('  .  .  ')
     A            GK04           1A  O 13 66
     A            OT04           1A  O 13 75
     A            NO05           4Y 0O 14  4EDTCDE(4)
     A            KN05           1A  O 14 13
     A            TN05           9Y 2O 14 19EDTCDE(2)
     A            ST05           6Y 0O 14 34EDTWRD('  .  .  ')
     A            EN05           6Y 0O 14 49EDTWRD('  .  .  ')
     A            GK05           1A  O 14 66
     A            OT05           1A  O 14 75
     A            NO06           4Y 0O 15  4EDTCDE(4)
     A            KN06           1A  O 15 13
     A            TN06           9Y 2O 15 19EDTCDE(2)
     A            ST06           6Y 0O 15 34EDTWRD('  .  .  ')
     A            EN06           6Y 0O 15 49EDTWRD('  .  .  ')
     A            GK06           1A  O 15 66
     A            OT06           1A  O 15 75
     A            NO07           4Y 0O 16  4EDTCDE(4)
     A            KN07           1A  O 16 13
     A            TN07           9Y 2O 16 19EDTCDE(2)
     A            ST07           6Y 0O 16 34EDTWRD('  .  .  ')
     A            EN07           6Y 0O 16 49EDTWRD('  .  .  ')
     A            GK07           1A  O 16 66
     A            OT07           1A  O 16 75
     A            NO08           4Y 0O 17  4EDTCDE(4)
     A            KN08           1A  O 17 13
     A            TN08           9Y 2O 17 19EDTCDE(2)
     A            ST08           6Y 0O 17 34EDTWRD('  .  .  ')
     A            EN08           6Y 0O 17 49EDTWRD('  .  .  ')
     A            GK08           1A  O 17 66
     A            OT08           1A  O 17 75
     A            NO09           4Y 0O 18  4EDTCDE(4)
     A            KN09           1A  O 18 13
     A            TN09           9Y 2O 18 19EDTCDE(2)
     A            ST09           6Y 0O 18 34EDTWRD('  .  .  ')
     A            EN09           6Y 0O 18 49EDTWRD('  .  .  ')
     A            GK09           1A  O 18 66
     A            OT09           1A  O 18 75
     A            NO10           4Y 0O 19  4EDTCDE(4)
     A            KN10           1A  O 19 13
     A            TN10           9Y 2O 19 19EDTCDE(2)
     A            ST10           6Y 0O 19 34EDTWRD('  .  .  ')
     A            EN10           6Y 0O 19 49EDTWRD('  .  .  ')
     A            GK10           1A  O 19 66
     A            OT10           1A  O 19 75
     A                                 20  4'REASON CODE'
     A                                      DSPATR(RI)
     A            ##TYPE         1A  B 20 16DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                 20 18'CANCEL 1- CHANGE 2- ADD)'
     A                                 20 53'NO.'
     A                                      DSPATR(RI)
     A            ##NO           2Y 0B 20 58DSPATR(CS)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A  55                             22 12'ALL CANCELLED =INPUT O TO UPDATE I-
     A                                      NSTRUCTION THEN CMD-5'
     A                                      DSPATR(BL)
     A  99                             23 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ERR           60O  O 23 18DSPATR(HI)
     A                                 24  3'PRV SCREEN'
     A                                 24 14'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 22'UPDATE OK'
     A                                 24 32'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 40'PRV SCREEN'
     A                                 24 51'ROLL-DOWN'
     A                                      DSPATR(RI)
     A*
     A*
     A*
     A          R BBAPW013
     A*%%TS  SD  19961114  093234  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 2')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A  99                                  ALARM
     A                                  1 17'** TOYOTA SYSTEM VOL.PROD UNIT PRI-
     A                                      CE M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 72'BBAPW01'
     A                                  2  2'TOYOTA SYSTEM'
     A                                      DSPATR(UL)
     A                                  2 56'UPDATE DATE'
     A            #KOHZ          6Y 0O  2 70EDTWRD('  .  .  ')
     A                                  3 56'UPDATE PERSON'
     A            #KOME         10A  O  3 70
     A                                  4  4'USER PART NUMBER'
     A                                      DSPATR(UL)
     A                                  4 25'RECEIVING CO.'
     A                                      DSPATR(UL)
     A                                  4 39'FACTORY'
     A                                      DSPATR(UL)
     A                                  4 47'MANAGEMENT NO.'
     A                                      DSPATR(UL)
     A                                  4 63'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 70'CUSTOMER'
     A                                      DSPATR(UL)
     A            HIN1           5A  O  5  4
     A                                  5 10'-'
     A            HIN2           5A  O  5 12
     A                                  5 18'-'
     A            HIN3           5A  O  5 20
     A            NONY           4Y 0O  5 30EDTCDE(4)
     A            KOJO           1A  O  5 42
     A            KNNO          10A  O  5 49
     A            KTYPE          1A  O  5 61
     A            KTYNM          6O  O  5 63
     A            TOKU           4Y 0O  5 72EDTCDE(4)
     A                                  7 11'THIS TIME PURCHASE UNIT PRICE -----
     A                                      ----------------'
     A                                  8  3'PACKING'
     A                                      DSPATR(UL)
     A                                  8 11'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                  8 23'APPLY'
     A                                      DSPATR(UL)
     A                                  8 35'APPLY'
     A                                      DSPATR(UL)
     A                                  8 46'PRESENT/OLD'
     A                                      DSPATR(UL)
     A                                  8 58'OLD DIE'
     A                                      DSPATR(UL)
     A                                  8 66'PURCHASING TEAM'
     A                                      DSPATR(UL)
     A                                  9 23'START DATE'
     A                                      DSPATR(UL)
     A                                  9 35'EXIT DATE'
     A                                      DSPATR(UL)
     A            #KHKB          1A  B 10  5DSPATR(CS)
     A  33                                  DSPATR(PR)
     A            #KTNK          9Y 2B 10 11DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A            #KSHZ          6Y 0B 10 25DSPATR(CS)
     A                                      EDTCDE(4)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A            #KEHZ          6Y 0B 10 36DSPATR(CS)
     A                                      EDTCDE(4)
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A            #KGKB          1A  B 10 51DSPATR(CS)
     A  33                                  DSPATR(PR)
     A            #KKKB          1A  B 10 61DSPATR(CS)
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A            #KBKK          2A  B 10 71DSPATR(CS)
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A  33                                  DSPATR(PR)
     A                                 12 11'BREAKDOWN------------------'
     A                                 12 48'*-AROUND APPLICATION PERIOD DAY-*'
     A                                 13 10'PART UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 13 27'PACKING UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 13 48'*'
     A                                 13 51'BEFORE'
     A                                      DSPATR(UL)
     A            ZSTHZ          6Y 0O 13 59EDTWRD('  .  .  ')
     A                                 13 68'-'
     A            ZENHZ          6Y 0O 13 70EDTWRD('  .  .  ')
     A                                 13 80'*'
     A                                 14 48'*'
     A                                 14 51'AFTER'
     A                                      DSPATR(UL)
     A            ASTHZ          6Y 0O 14 59EDTWRD('  .  .  ')
     A                                 14 68'-'
     A            AENHZ          6Y 0O 14 70EDTWRD('  .  .  ')
     A                                 14 80'*'
     A            #UBTN          7Y 2O 15 13EDTCDE(2)
     A            #UKTN          7Y 2O 15 33EDTCDE(2)
     A                                 15 48'*-------------------------------*'
     A                                 17 11'LAST TIME PURCHASE UNIT PRICE -----
     A                                      ----------------'
     A                                 18 11'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 18 23'APPLY'
     A                                      DSPATR(UL)
     A                                 18 35'APPLY'
     A                                      DSPATR(UL)
     A                                 18 46'PRESENT/OLD'
     A                                      DSPATR(UL)
     A                                 18 58'OLD DIE'
     A                                      DSPATR(UL)
     A                                 19 23'START DATE'
     A                                      DSPATR(UL)
     A                                 19 35'EXIT DATE'
     A                                      DSPATR(UL)
     A            #ZTNK          9Y 2O 20  9EDTCDE(2)
     A            #ZSHZ          6Y 0O 20 24EDTWRD('  .  .  ')
     A            #ZEHZ          6Y 0O 20 36EDTWRD('  .  .  ')
     A            #ZGKB          1A  O 20 51
     A            #ZKKB          1A  O 20 61
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        ERR           60O  O 22 18DSPATR(HI)
     A                                 24  3'PRV SCREEN'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 23'UPDATE OK'
     A                                 24 34'CMD-5'
     A                                      DSPATR(RI)
