     A** CABPW83 *******************************************
     A*  A-PICS2/3 OFFLINE PART NO. SELECT                 *
     A*              T.SAKASHITA 2020.09.28                *
     A******************************************* CABPW83 **
     A                                      PRINT
     A                                      CHGINPDFT
     A                                      MOUBTN(*ULR CF24)
      *
     A*----------------------------------------------------------------
     A          R SFREC1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ')
     A                                      SFL
     A            C3SHN1         5      6 15
     A            C3SHN2         5      6 21
     A            C3SHN3         2      6 27
     A            C3UKYY         4  0    + 1
     A                                   + 1'/'
     A            C3UKMM         2  0    + 1
     A                                   + 1'/'
     A            C3UKDD         2  0    + 1
     A                                   + 1'-'
     A            C3UKBB         2  0    + 1
     A*----------------------------------------------------------------
      *
     A          R SFCTL1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ ﾃ]nﾜｰﾓ')
     A                                      SFLCTL(SFREC1)
     A                                      CF03 BLINK
     A  99                                  ALARM
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(16) SFLSIZ(17)
     A  71                                  SFLDSP
     A  72                                  SFLCLR
     A  74                                  SFLDSPCTL
     A* 74                                  ERASE(SFREC1)
     A  90                                  SFLEND(*MORE)
     A N90                                  ROLLUP(73)
     A                                      ROLLDOWN(73)
     A                                      SFLCSRRRN(&$RRN)
     A* 99                                  SFLMSG('NO MORE DATA      ' 99)
     A            DSPRRN         4  0H      SFLRCDNBR
     A            $RRN           5  0H      SFLSCROLL
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' A-PICS2/3 OFFLINE PART NO.-
     A                                       SELECT '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'CABPW83'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  5 15' PART NO. '
     A                                       DSPATR(UL)
     A                                  5 28' KANBAN EFFECTIVE DATE'
     A                                       DSPATR(UL)
      *
     A          R DSP01                     TEXT('ﾃu]nﾞ ﾈlxb')
     A                                 24  2' F3 ' DSPATR(RI)
     A                                   + 1' BACK '
     A                                   +45' PAGE UP/DOWN ' DSPATR(RI)
