     A*%%TS  SD  20201113  131118  I0777       REL-V7R3M0  5770-WDS
     A** CHKPW64 *********************************
     A*  CHECK LABEL DATE FOR VW                 *
     A*  JW    2020.11.13                        *
     A********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20201113  131118  I0777       REL-V7R3M0  5770-WDS
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                      CF01(01)
     A                                  1  2'DATE'
     A                                  1  9DATE
     A                                      EDTWRD('0  /  /  ')
     A                                  1 25'** CHECK LABEL DATE FOR VW **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT CHKPW64 '
     A                                  2  2'TIME'
     A                                  2  9TIME
     A                                      EDTCDE(Y)
     A                                  7 22'SHIP DATE:'
     A            XNOHZ          8Y 0B  7 33EDTWRD('    /  /  ')
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  7 45'YYYY/MM/DD'
     A                                  9 22'BIN#.....:'
     A            XNOBN          2Y 0B  9 33EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 11 22'ORDER#...:'
     A            XORDN         10A  B 11 33DSPATR(CS)
     A                                      DSPATR(UL)
     A                                 11 45'(Blank=All)'
     A            XMSG          60A  O 22 20OVRDTA
     A                                 24 10'F1:'
     A                                      DSPATR(RI)
     A                                 24 14'END'
