     A*%%TS  SD  20210622  170832  I0777       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R WIN01
     A*%%TS  SD  20210622  170832  I0777       REL-V7R3M0  5770-WDS
     A                                      WINDOW(2 10 13 42)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI))
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      CF07(07)
     A                                  1 36'CHKC27'
     A                                  2  2'Unlock following job...'
     A                                      COLOR(YLW)
     A                                  4  6'Keyword........:'
     A                                      DSPATR(HI)
     A            XKEY          10A  B  4 23
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A  45                                  DSPATR(PR)
     A                                  6  6'User...........:'
     A                                      DSPATR(HI)
     A            XUSER         10A  O  6 23
     A                                  7  6'Work Station...:'
     A                                      DSPATR(HI)
     A            XWSID         10A  O  7 23
     A                                  8  6'Start Day/Time :'
     A                                      DSPATR(HI)
     A            XDATE          8Y 0O  8 23EDTWRD('    /  /  ')
     A            XTIME          6Y 0O  8 34EDTWRD('0 :  :  ')
     A                                  9  6'Program Using..:'
     A                                      DSPATR(HI)
     A            XPGM          10A  O  9 23
     A            XMSG          40A  O 11  2COLOR(YLW)
     A                                 12  2'F1:End,  F5:Update, F7:Force, ENTR-
     A                                      :Check'
     A                                      COLOR(PNK)
