     A*%%TS  SD  20170913  134916  I0777       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A** CHKPWIP ***************************
     A*  DEVICE IP ADDRESS CHECK           *
     A*       T-SAKASHITA 2001.11.22       *
     A*************************** CHKPWIP **
     A*----------*
     A* ��� *
     A*----------*
     A          R CHKPWIP1
     A*%%TS  SD  20170913  134916  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  1 20' **  DEVICE IP ADDRESS INQ  ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT CHKPWIP1'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  7 22'DEVICE'
     A            DDEV          10A  B  7 38DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A*
     A                                  9 22'CONTROLLER'
     A            DCTL          10A  O  9 38DSPATR(CS)
     A                                 11 22'IP ADDRESS'
     A            DIP           15A  O 11 38DSPATR(CS)
     A*
     A                                 22 11'MSG'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24 15'F1:'
     A                                      DSPATR(RI)
     A                                 24 19'END'
