     A** CHKPW40 *************************
     A*  SYSTEM CHECK MENU               *
     A*  K.YASUDA   2002.10.22           *
     A************************************
     A                                      CHGINPDFT
     A                                      PRINT
     A          R CHKPW401
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
     A                                      CF01(01)
     A                                  1  2'DATE'
     A                                  1  7DATE  EDTWRD('0  /  /  ')
     A                                  1 25'***  SYSTEM CHECK MENU  ***'
     A                                      DSPATR(RI)
     A                                  1 68'FMT CHKPW401'
     A                                  3 27'SYSTEM:'
     A            WSYS           8O      + 1
     A                                  2  2'TIME'
     A                                  2  7TIME  EDTCDE(Y)
      *
     A                                  5 10' NO '
     A                                      DSPATR(RI)
     A                                  5 15'MENU ---------------'
     A                                      DSPATR(HI)
     A                                  7 10'  1 '
     A                                      DSPATR(RI)
     A                                  7 15' '
     A                                      DSPATR(HI)
     A                                  9 10'  2 '
     A                                      DSPATR(RI)
     A                                  9 15'WRKDSKSTS'
     A                                      DSPATR(HI)
     A                                 11 10'  3 '
     A                                      DSPATR(RI)
     A                                 11 15'WRKDSTQ'
     A                                      DSPATR(HI)
     A                                 13 10'  4 '
     A                                      DSPATR(RI)
     A                                 13 15'WRKNETF (*ALL)'
     A                                      DSPATR(HI)
     A                                 15 10'  5 '
     A                                      DSPATR(RI)
     A                                  7 15' '
     A                                      DSPATR(HI)
     A                                  5 50'№'
     A                                      DSPATR(RI)
     A                                  5 55'MENU ---------------'
     A                                      DSPATR(HI)
     A                                  7 50'  6 '
     A                                      DSPATR(RI)
     A                                 11 55' '
     A                                      DSPATR(HI)
     A                                  9 50'  7 '
     A                                      DSPATR(RI)
     A                                 11 55' '
     A                                      DSPATR(HI)
     A                                 11 50'  8 '
     A                                      DSPATR(RI)
     A                                 11 55' '
     A                                      DSPATR(HI)
     A                                 13 50'  9 '
     A                                      DSPATR(RI)
     A                                 13 55' '
     A                                      DSPATR(HI)
     A                                 15 50' 10 '
     A                                      DSPATR(RI)
     A                                   + 1'WRKPRB'
     A                                      DSPATR(HI)
     A                                 15 55' '
     A                                      DSPATR(HI)
      *
     A                                 19 15'<----- INPUT MENU NUMBER'
     A            @NO            2Y 0B 19 11OVRATR OVRDTA
     A                                      EDTCDE(Z)
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI PC)
      *
     A                                 22 10' ERR '
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
      *
     A            MSG           60A  O 22 20
     A                                      OVRDTA OVRATR
     A N99                                  DSPATR(ND)
      *
     A                                 24  4'EXIT'
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
      *
     A                                 24 34'ENTER'
     A                                 24 45' CTRL '
     A                                      DSPATR(RI)
