     A** DA#PW5B *******************************************
     A*       受注データの照会                           *
     A*       （ユーザー品番）                           *
     A*       MSK                       2004.07.28         *
     A******************************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *
     A          R DA#PW5B1                  TEXT('fﾞx]-2/2')
     A  99                                  ALARM
     A                                      CF01(01)
     A                                      CF03(03)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  /  /  ')
     A                                  1 21'＊＊　受注データの照会　＊＊'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'DA#PW5B'
     A                                  3  2'  ユ　ー　ザ　ー　品　番   '
     A                                      DSPATR(UL)
     A                                  3 34'得意先'
     A                                      DSPATR(UL)
     A                                  3 43'納入先'
     A                                      DSPATR(UL)
     A                                  3 52'工場'
     A                                      DSPATR(UL)
     A                                  3 59'受入'
     A                                      DSPATR(UL)
     A                                  3 66'納期～'
     A                                      DSPATR(UL)
     A            @MHN1          5   B  4  2DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            @MHN2          5   B   + 1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            @MHN3          5   B   + 1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            @MHN4          5   B   + 1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A            @TOKU          4Y 0B  4 36DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A                                      EDTCDE(4)
     A            @NONY          4Y 0B  4 45DSPATR(CS)
     A  33                                  DSPATR(RI PC)
     A                                      EDTCDE(4)
     A            @NKOJ          1   B  4 54DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A            @NUKE          4   B  4 60DSPATR(CS)
     A  35                                  DSPATR(RI PC)
      *
     A            @HYY1          6Y 0B  4 67DSPATR(CS)
     A  36                                  DSPATR(RI PC)
     A                                      EDTCDE(Z)
     A                                 22 11' d[ｰ '
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            @ERR          63     22 18
     A N99                                  DSPATR(ND)
      *
     A                                 24  2'終　了'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                   + 2'前の画面'
     A                                   + 1' CMD-3 '
     A                                      DSPATR(RI)
     A*---------------------------*
     A*  明細照会画面（データ） *
     A*---------------------------*
     A          R SFL                       SFL
     A                                      TEXT('ﾅﾎﾞ ﾎabﾓ ﾛﾃ-nﾞ')
     A            @KUBN          1   B  8  2DSPATR(CS)
     A  45                                  DSPATR(RI PC)
     A            @8TOKU         4Y 0O  8  4
     A            @8NONY         4Y 0O  8 10
     A            @8NKOJ         1   O  8 20
     A            @8NUKE         4   O  8 24
     A            XXMHIN        23   O  8 30
     A            @8MEHZ         6Y 0O  8 54EDTWRD('0  /  /  ')
     A            @8TKRO         6   O  8 63
     A            @8SRYO         7Y 0O  8 71EDTCDE(1)
     A**          @COMT         31      9 50
     A            @TORI          1   O  9  2DSPATR(BL)
     A            @8NBAN        10   O  9 42DSPATR(BL)
     A            @8KANR        15   O  9 56DSPATR(BL)
     A            @8EEHU         8O  O  9 72DSPATR(BL)
      *
     A            @RRN           6Y 0H
     A            @SAMM          2Y 0H
     A            @RENO          5Y 0H
     A            @8STBN         1   H
     A            @8UKHZ         8Y 0H
     A            @8MEH8         8Y 0H
     A            @8MHN1         5   H
     A            @8MHN2         5   H
     A            @8MHN3         5   H
     A            @8MHN4         5   H
     A            @8MHN5         5   H
     A            @8MHN6         5   H
     A            @8MHN7         5   H
     A            @SHN1          5   H
     A            @SHN2          5   H
     A            @SHN3          2   H
     A            @8ODRN        10   H
     A          R SFLCTL                    SFLCTL(SFL)
     A                                      TEXT('ﾅﾎﾞ ﾎabﾓ ﾃ]nﾜ-ﾓ ﾛﾃ-nﾞ')
     A                                      OVERLAY
     A  99                                  ALARM
     A                                      SETOF(99)
     A                                      CF01(01) CF03(03)
     A                                      CF09 CF12
     A                                      SFLPAG(06)
     A                                      SFLSIZ(06)
     A  72                                  SFLDSPCTL
     A  72                                  ERASE(SFL)
     A  73                                  SFLDSP
     A  71                                  SFLCLR
     A                                      ROLLUP(51) ROLLDOWN(52)
      *
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  /  /  ')
     A                                  1 21'＊＊　受注データの照会　＊＊'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'DA#PW5B'
      *
     A                                  3  1'ユーザー品番'
     A                                      DSPATR(UL)
     A            @MHIN         23       + 1
     A                                  3 45'納期：'
     A                                      DSPATR(UL)
     A            @SNOHZ         6Y 0    + 1EDTWRD('0  /  /  ')
     A                                   + 1'～'
     A*           @ENOHZ         6Y 0    + 1EDTWRD('0  /  /  ')
     A                                  4  1'得意先'
     A                                      DSPATR(UL)
     A            @TOKNM        16O      + 1
     A                                   + 1'納入先'
     A                                      DSPATR(UL)
     A            @NONNM        16O      + 1
     A                                   + 1'工場'
     A                                      DSPATR(UL)
     A            @NKOJ          1       + 1
     A                                   + 1'受入'
     A                                      DSPATR(UL)
     A            @NUKE          4       + 1
     A                                  6  1'得意先　納入先　工場　受+
     A                                       入　社内品番　　　　　+
     A                                      　納期所番地   納入数'
     A                                      DSPATR(UL)
     A**          @MIDA         31      7 49DSPATR(UL)
     A                                  7 43'納　番'
     A                                      DSPATR(UL)
     A                                  7 56'管理番号'
     A                                      DSPATR(UL)
     A                                  7 71'エフ発行'
     A                                      DSPATR(UL)
TT    *
     A          R DA#PW5B9                  TEXT('fﾞx]-2/2')
     A                                      OVERLAY PROTECT
     A                                 20  2'､'
     A                                 21  2'､､>Ｍ＝照会'
     A N81                             21 72'続く…'
     A  81                             21 72'終り'
      *
     A                                 23  2'終　了'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                   + 2'前の画面'
     A                                   + 1' CMD-3 '
     A                                      DSPATR(RI)
     A                                   + 2'次sﾟ-ﾆﾞ'
     A                                   + 1' ROOL-UP ' DSPATR(RI)
     A                                   + 2'前sﾟ-ﾆﾞ'
     A                                   + 1' ROOL-DUN ' DSPATR(RI)
     A                                 24 11' d[ｰ '
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            @ERR          63     24 18
     A N99                                  DSPATR(ND)
