     A          R DATPW431                  CA01
     A            PIDATE        26S 0B 13 12
     A                                 14 18'YYYYMMDDJJFFBB'
     A            PF             1A  B 17 10
     A            PA             5S 0B 17 12
     A                                 21 18'YYYYMMDDJJFFBB'
     A            PODATE        26S 0O 20 12
