     A** DGBPW02 *********************************
     A*   パソコンへのデータ転送総合メニュー   *
     A*         M-OKUDA     03.07.02             *
     A********************************* DGBPW02 **
     A                                      PRINT
     A                                      CHGINPDFT
     A          R DGBPW021
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF07(02)
     A  99                                  ALARM
     A                                  1 22'パソコンへのデータ転送用総合+
     A                                      メニュー'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'DGBPW02'
     A*
     A                                  2  8'　１．　設備負荷グラフ用データ　+
     A                                      　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  3  8'　２．　設備負荷情報の作成　　　+
     A                                      　　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  4  8'　３．　設備管理Ｍと生産実績デー+
     A                                      タの作成　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  5  8'　４．　工程Ｍと設備管理Ｍとの不+
     A                                      照合データ作成　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  6  8'　５．　設備管理Ｍを条件抜出し　+
     A                                      　　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  7  8'　６．　金型の新設・継続・廃止別+
     A                                      型増減データ作成　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  8  8'　７．　機番別個当り型費データ作+
     A                                      成　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                  9  8'　８．　機番別型消費統計データの+
     A                                      抜出し　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 10  8'　９．　型番の範囲指定で型消費デ+
     A                                      ータの作成　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 11  8'１０．　廃止型工場間転売データの+
     A                                      作成　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 12  8'１１．　再メッキ品番明細データの+
     A                                      作成　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 13  8'１２．　工場間物流データの作成　+
     A                                      　　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 14  8'１３．　工程内不良データの抜出し+
     A                                      　　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 15  8'１４．　機番別品種切替データの作+
     A                                      成　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 16  8'１５．　作業日報の品番明細データ+
     A                                      抜出し　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 17  8'１６．　作業日報項目別時間データ+
     A                                      の作成　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 18  8'１７．　機番別作業日報データ　　+
     A                                      　　　　　　　　　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 19  8'１８．　センター・社員別作業日報+
     A                                      集計データ抜出し　　　　　　　　'
     A*                                     DSPATR(UL)
     A                                 20  8'１９．　センター別の項目別時間デ+
     A                                      ータ作成　　　　　　　　　　　　'
     A                                 21  8'２０．　金型かんばんマスターから+
     A                                      データ作成'
     A*
     A            NO             2Y 0B 22 10DSPATR(CS) EDTCDE(Z)
     A  03                                  DSPATR(PC RI)
     A                                 22 14'メニュー番号を入力       '
     A  99                             23 11' D[ｰ '
     A  99                                  DSPATR(RI BL)
     A  99        MSG           60O    23 18
     A                                 24  4'終　了'
     A                                 24 13' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24'前のメニュー'
     A                                 24 39' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 50'SPOOL'
     A                                 24 56' CMD-7 '
     A                                      DSPATR(RI)
