     A**
     A** IT IS THAT DBGPW52 REVISES, TOO WHEN REVISES  EADPW2A
     A**
     A** EADPW2A ***********************
     A* .. UNDELIVERED ANALYSIS LIST .. *
     A* I-HASADA            89.03.07   *
     A*********************** EADPW2A **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*--------------------*
     A* .. SCREEN-1 ..     *
     A*--------------------*
     A          R EADPW2A1
     A*%%TS  SD  19961114  094406  MIKA        REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 1')
     A                                      CF01(01)
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** UNDELIVERED ANALYSIS LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'EADPW2A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 25'1'
     A                                      DSPATR(RI)
     A                                  6 29'LIST BY UNDELIVERED FREQUENCY'
     A                                  9 25'2'
     A                                      DSPATR(RI)
     A                                  9 29'LIST BY USER FACTORY'
     A                                 12 25'3'
     A                                      DSPATR(RI)
     A                                 12 29'WORST UNDELIVERED ANALYSIS LIST'
     A            PKBN           1A  B 15 25DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A                                 15 29'-->INPUT NO..'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A*--------------------*
     A* .. SCREEN-2 ..     *
     A*--------------------*
     A          R EADPW2A2
     A*%%TS  SD  19961114  094406  MIKA        REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 2')
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** UNDELIVERED ANALYSIS LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'EADPW2A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 18'1.IN ORDER OF PART NUMBER'
     A                                  7 18'2.DESCENDING UNDELIVERED FREQUENCY-
     A                                       '
     A            PNO2           1A  B  7 56DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(PC)
     A  23                                  DSPATR(RI)
     A                                  7 58'..>INPUT NO..'
     A                                 10 25'PERIOD'
     A                                      DSPATR(RI)
     A            PHZ11          8A  B 10 34DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A                                 10 44'-'
     A            PHZ12          8A  B 10 47DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 23'PREVIOUS SCREEN'
     A                                 24 40'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 48'LIST OK'
     A                                 24 57'CMD-5'
     A                                      DSPATR(RI)
     A*
     A*--------------------*
     A* .. SCREEN-3 ..     *
     A*--------------------*
     A          R EADPW2A3
     A*%%TS  SD  19961018  135402  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 3')
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** UNDELIVERED ANALYSIS LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'EADPW2A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 24'LIST BY USER FACTORY'
     A                                  8 21'RECEIVING CO.'
     A                                      DSPATR(RI)
     A            PNONY          4A  B  8 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                  8 47'9999 --> ALL OF RECEIVING CO.'
     A                                 12 21'PERIOD'
     A                                      DSPATR(RI)
     A            PHZ21          8A  B 12 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 12 47'-'
     A            PHZ22          8A  B 12 50DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 23'PREVIOUS SCREEN'
     A                                 24 39'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 47'LIST OK'
     A                                 24 55'CMD-5'
     A                                      DSPATR(RI)
     A*
     A*--------------------*
     A* .. SCREEN-4 || *.
     A*--------------------*
     A          R EADPW2A4
     A*%%TS  SD  19961114  094406  MIKA        REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 4')
     A                                      CF01(01)
     A                                      CF02(02)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** UNDELIVERED ANALYSYS LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'EADPW2A'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 24'UNDELIVERED ANALYSIS LIST'
     A                                  7 31'1'
     A                                      DSPATR(RI)
     A                                  7 34'OR'
     A                                  7 38'2'
     A                                      DSPATR(RI)
     A                                  7 25'INPUT'
     A                                  9 25'1'
     A                                      DSPATR(RI)
     A                                  9 27'WORST'
     A                                  9 55'RANK'
     A            PWST           3Y 0B  9 51DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                 11 25'2'
     A                                      DSPATR(RI)
     A                                 11 27'UNDELIVERED FREQUENCY'
     A                                 11 55'OVER'
     A            PKAI           3Y 0B 11 51DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                 14 25'PERIOD'
     A                                      DSPATR(RI)
     A            PHZ31          8A  B 14 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A                                 14 47'-'
     A            PHZ32          8A  B 14 50DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  44                                  DSPATR(PC)
     A  44                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 23'PREVIOUS SCREEN'
     A                                 24 39'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 46'LIST OK'
     A                                 24 54'CMD-5'
     A                                      DSPATR(RI)
