     A*%%TS  SD  20030402  113809  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A                                      CF10
     A          R DSP01
     A*%%TS  SD  20030402  113809  TEST        REL-V4R4M0  5769-PW1
     A  10                                  FRCDTA
     A  10                                  LOCK
     A            #PGM           8A  O  1  2
     A                                  1 20'** HIGHEST USAGE TOOLS BY CATEGORY-
     A                                       **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4 21'TOOL CATEGORY:'
     A                                      DSPATR(HI)
     A            D@CATG         2A  B  4 36DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 21'AVERAGE USE FOR 6 MONTHS:'
     A                                      DSPATR(HI)
     A            D@YYMM         6Y 0B  6 53EDTCDE(4)
     A                                      DSPATR(CS)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  7 53'YYYYMM'
     A  10                             13  7'Please be patient while preparing -
     A                                      your data.'
     A                                      DSPATR(HI)
     A                                 23  3'F1:END      F5:PRINT'
     A                                  6 47'UNTIL'
     A                                      DSPATR(HI)
     A                                 23 27'F10:UPDATE PRICES FROM ASJ DATA'
