     A** ECSPW90 ******************************************
     A*  RESTRICTION QUANTITY ON TAKING OUT DIE           *
     A*          2017.09.11  ITS.  T.MITSUI               *
     A****************************************** ECSPW90 **
     A                                      PRINT
     A                                      CHGINPDFT
     A*===================================================*
     A*         SCREEN-1                                  *
     A*===================================================*
     A          R ECSPW901
     A                                      CF01(01)
     A                                      CF12(12)
     A                                      BLINK
     A                                      KEEP
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' RESTRICTION QUANTITY -
     A                                      ON TAKING OUT DIE '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ECSPW901'
     A*
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  5 24' UPDATE '
     A                                      DSPATR(RI UL)
     A*
     A            D#UPKB         1A  B  7 27TEXT(' UPDATE ')
     A                                      DSPATR(CS)
     A  31                                  DSPATR(PC RI)
     A                                  7 29'<--- 0:CANCEL 1:CHANGE 2:ADD'
     A*
     A                                 10 24' DIE NUMBER '
     A                                      DSPATR(RI UL)
     A*
     A            D#KAT1         2A  B 12 27TEXT(' DIE NUMBER 1 ')
     A                                      DSPATR(CS)
     A  32                                  DSPATR(PC RI)
     A                                 12 30'-'
     A            D#KAT2         4A  B 12 32TEXT(' DIE NUMBER 2 ')
     A                                      DSPATR(CS)
     A  33                                  DSPATR(PC RI)
     A                                 12 37'-'
     A            D#KAT3         1A  B 12 39TEXT(' DIE NUMBER 3 ')
     A                                      DSPATR(CS)
     A  34                                  DSPATR(PC RI)
     A                                 12 41'-'
     A            D#KAT4         1A  B 12 43TEXT(' DIE NUMBER 4 ')
     A                                      DSPATR(CS)
     A  35                                  DSPATR(PC RI)
     A*
     A*
     A  99                             23 10' ERROR '
     A                                      DSPATR(RI BL)
     A  99        D#EMSG        60O  O 23 19
     A*
     A                                 24  4'EXIT'
     A                                 24 10' F1 '
     A                                      DSPATR(RI)
     A                                 24 65'INQUIRY'
     A                                 24 74' F12 '
     A                                      DSPATR(RI)
     A*
     A*===================================================*
     A*         SCREEN-2                                  *
     A*===================================================*
     A          R ECSPW902
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A                                      KEEP
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' RESTRICTION QUANTITY -
     A                                      ON TAKING OUT DIE '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ECSPW902'
     A*
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  5 24' UPDATE '
     A                                      DSPATR(RI UL)
     A*
     A            D#UPKB         1A  O  7 27TEXT(' UPDATE ')
     A                                      DSPATR(UL HI)
     A            D#UPNM         6A  O  7 30TEXT(' UPDATE NAME ')
     A                                      DSPATR(HI)
     A*
     A                                 10 24' DIE NUMBER '
     A                                      DSPATR(RI UL)
     A*
     A            D#KAT1         2A  O 12 27TEXT(' DIE NUMBER 1 ')
     A                                      DSPATR(UL HI)
     A                                 12 30'-'
     A            D#KAT2         4A  O 12 32TEXT(' DIE NUMBER 2 ')
     A                                      DSPATR(UL HI)
     A                                 12 37'-'
     A            D#KAT3         1A  O 12 39TEXT(' DIE NUMBER 3 ')
     A                                      DSPATR(UL HI)
     A                                 12 41'-'
     A            D#KAT4         1A  O 12 43TEXT(' DIE NUMBER 4 ')
     A                                      DSPATR(UL HI)
     A*
     A                                 14 24' RESTRICTION QUANTITY '
     A                                      DSPATR(RI UL)
     A*
     A            D#REQT         3Y 0B 16 27TEXT(' RESTRICTION QTY ')
     A                                      CHECK(RB)
     A                                      EDTWRD(' 0 ')
     A  51                                  DSPATR(PR UL HI)
     A N51                                  DSPATR(CS)
     A  36                                  DSPATR(PC RI)
     A*
     A*
     A  99                             23 10' ERROR '
     A                                      DSPATR(RI BL)
     A  99        D#EMSG        60O  O 23 19
     A*
     A                                 24  4'KEY INPUT'
     A                                 24 15' F3 '
     A                                      DSPATR(RI)
     A                                 24 23'UPDATE OK'
     A                                 24 34' F5 '
     A                                      DSPATR(RI)
     A*
     A*===================================================*
     A*         SCREEN-3                                  *
     A*===================================================*
     A*      << HEDDER RECORD >>
     A          R ECSPW903
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' RESTRICTION QUANTITY -
     A                                      ON TAKING OUT DIE '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT ECSPW903'
     A*
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A*
     A                                  4  2' DIE NUMBER  QTY  |-
     A                                        DIE NUMBER  QTY  |-
     A                                        DIE NUMBER  QTY  |-
     A                                        DIE NUMBER  QTY '
     A                                      DSPATR(HI UL)
     A*
     A*      << SUB FILE ITEM >>
     A          R ECSPW90S                  SFL
     A*
     A            D#SDI1        11A  O  5  3TEXT('DIE NUMBER (1)')
     A            D#SRQ1         3Y 0O  5 15TEXT('RESRICTION QTY (1)')
     A                                      EDTWRD('   ')
     A                                  5 20'|'
     A                                      DSPATR(HI)
     A            D#SDI2        11A  O  5 23TEXT('DIE NUMBER (2)')
     A            D#SRQ2         3Y 0O  5 35TEXT('RESRICTION QTY (2)')
     A                                      EDTWRD('   ')
     A                                  5 40'|'
     A                                      DSPATR(HI)
     A            D#SDI3        11A  O  5 43TEXT('DIE NUMBER (3)')
     A            D#SRQ3         3Y 0O  5 55TEXT('RESRICTION QTY (3)')
     A                                      EDTWRD('   ')
     A                                  5 60'|'
     A                                      DSPATR(HI)
     A            D#SDI4        11A  O  5 63TEXT('DIE NUMBER (4)')
     A            D#SRQ4         3Y 0O  5 75TEXT('RESRICTION QTY (4)')
     A                                      EDTWRD('   ')
     A*
     A*      << SUB FILE CONTROL >>
     A          R ECSPW90C
     A                                      SFLCTL(ECSPW90S)
     A  70                                  SFLCLR
     A N70                                  SFLDSPCTL
     A  71                                  SFLDSP
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(17)
     A                                      SFLSIZ(17)
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      ROLLDOWN(25)
     A                                      ROLLUP(26)
     A            #RRN1          4  0H      SFLRCDNBR
     A*
     A*
     A  99                             23 10' ERROR '
     A                                      DSPATR(RI BL)
     A  99        D#SMSG        60O  O 23 19
     A*
     A                                 24  4'EXIT'
     A                                 24 10' F1 '
     A                                      DSPATR(RI)
     A                                 24 18'KEY INPUT'
     A                                 24 29' F3 '
     A                                      DSPATR(RI)
     A                                 24 65' PAGE UP/DOWN '
     A                                      DSPATR(RI)
     A*
