     A*%%TS  SD  20030930  160223  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP01
     A*%%TS  SD  20030930  160223  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 28'** DIE WAREHOUSING ENTRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4  5'RECEIVED DATE:'
     A            D@DATE         8Y 0B  4 20EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  4 30'(YYYYMMDD)'
     A          R SFL01                     SFL
     A*%%TS  SD  20020830  094427  TEST        REL-V4R4M0  5769-PW1
     A            S@NBR          3Y 0O  7  2EDTCDE(4)
     A  30                                  DSPATR(HI)
     A            S@DIE1         2A  O  7  6
     A  30                                  DSPATR(HI)
     A            S@DIE2         4A  O  7  9
     A  30                                  DSPATR(HI)
     A            S@DIE3         1A  O  7 14
     A  30                                  DSPATR(HI)
     A            S@DIE4         1A  O  7 16
     A  30                                  DSPATR(HI)
     A            S@QTY          2Y 0B  7 18EDTCDE(4)
     A  30                                  DSPATR(HI)
     A N01                                  DSPATR(PR)
     A  01                                  DSPATR(CS)
     A            H@QTY          2Y 0H
     A            H@ISNO         3   H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020903  135156  TEST        REL-V4R4M0  5769-PW1
     A  *DS3                                SFLLIN(0002)
     A                                      SFLSIZ(0061)
     A                                      SFLPAG(0060)
     A                                      CF12
     A                                      CF05
     A                                      CF09
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #RCNO          4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 28'** DIE WAREHOUSING ENTRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3 19'BARCODE:'
     A                                      DSPATR(HI)
     A            D@BRCD        17A  B  3 28CHECK(ER)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  01                                  DSPATR(PR)
     A                                  5  2'-------------------------------  S-
     A                                      CANNED  ----------------------------
     A                                      --------'
     A                                      DSPATR(HI)
     A                                  6  6'Die#'
     A                                      DSPATR(HI)
     A                                  6 17'Qty'
     A                                      DSPATR(HI)
     A                                  6 26'Die#'
     A                                      DSPATR(HI)
     A                                  6 37'Qty'
     A                                      DSPATR(HI)
     A                                  6 46'Die#'
     A                                      DSPATR(HI)
     A                                  6 57'Qty'
     A                                      DSPATR(HI)
     A                                  6 66'Die#'
     A                                      DSPATR(HI)
     A                                  6 77'Qty'
     A                                      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
     A          R WIN01
     A*%%TS  SD  20020830  133431  TEST        REL-V4R4M0  5769-PW1
     A                                      CF05
     A                                      OVERLAY
     A                                      WINDOW(8 15 8 42)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI))
     A                                  4  2'Qty has been changed.'
     A                                  5  2'If you want to save the change, hi-
     A                                      t F5.'
     A                                  6  2'Otherwise hit Enter key.'
     A                                  2 15' Warning!! '
     A                                      DSPATR(RI)
