      ** EDIPW10 *******************************
      *   IAF ONE WAY KANBAN PUBLICATION       *
      *     DISPLAY-FILE.     : EDIPW10        *
      *     CREATE DATE.      : JUL/21/1997.   *
      *     AUTHOR.           : S.OHTAKE.      *
      *     USER SECTION.     : IAF            *
      ******************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------*
      *         .....SCREEN 1.....           *
      *-------------------------------------*
     A          R EDIPW101
     A                                      CF01 CF05
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT EDIPW10'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 22'*** IAF ONE WAY KANBAN +
     A                                       PUBLICATION ***'
     A                                      DSPATR(RI)
      *
     A                                  7 11'DELIVERY   F'
     A                                      DSPATR(UL)
     A            SUPL           4   B  9 13DSPATR(CS)
     A                                      OVRDTA
     A  01                                  DSPATR(RI PC)
     A                                  9 19'-'
     A            SUPK           1   B  9 22DSPATR(CS) OVRDTA
     A  02                                  DSPATR(RI PC)
     A                                 11 13'0541-0 : NUMMI'
     A                                 12 13'3503-B : TMMC'
     A                                  7 30'INVOICE DATE'
     A                                      DSPATR(UL)
     A            SYHZ           8Y 0B  9 32DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A  03                                  DSPATR(RI PC)
     A                                 11 31'(MMDDYYYY)'
     A                                  6 46'PUBLICATION NO'
     A                                      DSPATR(UL)
     A                                  7 49'OF SHEETS'
     A                                      DSPATR(UL)
     A            MAIS           2Y 0B  9 53DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A  04                                  DSPATR(RI PC)
     A                                  7 66'ORDER NO'
     A                                      DSPATR(UL)
     A            ODER          10   B  9 65DSPATR(CS)
     A                                      OVRDTA
     A  05                                  DSPATR(RI PC)
     A                                 11 65'ALL=9999..'
      *
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60   O 22 20OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24  4' END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24' OK  '
     A                                 24 35' CMD-5 '
     A                                      DSPATR(RI)
