     A*%%TS  SD  20240917  165728  I0777       REL-V7R4M0  5770-WDS
     A** EDIPW82  ******************************************
     A*  HONDA EDI856 ASN INQUIRY BY DELIVERY CODE         *
     A*  J.WATANABE 2024.09.17                             *
     A*  TYPE (1-DATE, 2-SFL LINE)                         *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*---------------------------------------------------------------
     A          R DSP01
     A*%%TS  SD  20240917  165728  I0777       REL-V7R4M0  5770-WDS
     A                                      TEXT('THE 1ST SCREEN')
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF12(12)
     A                                      BLINK
     A  85                                  ALARM
     A                                      KEEP
     A                                  1  3'EDIR82 '
     A                                  1 67'DATE'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 67'TIME'
     A                                  2 72TIME
     A                                  7 15'DELIVERY CODE....:'
     A            XNONY          4Y 0B  7 34EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  9 15'ASN SENT DATE FROM'
     A            XFROM         10A  B  9 34DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                  9 45'TO:'
     A            XTO           10A  B  9 49DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A                                  9 60'(YYYYMMDD)'
     A                                      COLOR(YLW)
     A            XMSG          60A  O 22  4
     A                                 24  4'F1/3:'
     A                                      DSPATR(RI)
     A                                 24 10'EXIT'
     A                                 24 22'ENTR:'
     A                                      DSPATR(RI)
     A                                 24 28'RUN'
     A                                  1 23'** HONDA ASN INQ BY DELIV# **'
     A                                      DSPATR(RI)
     A*---------------------------------------------------------------
     A          R SFL01                     SFL
     A*%%TS  SD  20240627  143341  I0777       REL-V7R4M0  5770-WDS
     A            S1RCHZ         8Y 0O  6  2EDTWRD('    /  /  ')
     A                                      COLOR(WHT)
     A            S1RCTM         4Y 0O  6 13EDTWRD('0 :  ')
     A            S1MHIN        17A  O  6 19
     A            S1NOHZ         8Y 0O  6 37EDTWRD('    /  /  ')
     A  51                                  COLOR(RED)
     A            S1IAHZ         8Y 0O  6 48EDTWRD('    /  /  ')
     A N52                                  COLOR(WHT)
     A  52                                  COLOR(RED)
     A            S1QTY          6Y 0O  6 59EDTCDE(2)
     A            S1ODRN        13A  O  6 67
     A*---------------------------------------------------------------
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20240917  165728  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A                                      CF03(03)
     A                                      CF12(12)
     A  70                                  SFLDSP
     A  70                                  SFLDSPCTL
     A  71                                  SFLCLR
     A N51                                  SFLEND(*MORE)
     A                                      BLINK
     A  85                                  ALARM
     A                                      KEEP
     A                                      OVERLAY
     A                                      PROTECT
     A                                  1  2'EDIR82 '
     A                                  1 18'** HONDA ASN INQ BY DELIV# **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  2'DELIVERY#'
     A                                      COLOR(YLW)
     A            XNONY          4Y 0O  2 12EDTCDE(4)
     A            XNAME         15A  O  2 17
     A                                  2 35'ASN SENT DATE FROM'
     A                                      COLOR(YLW)
     A            XFROM         10A  O  2 54
     A                                  2 66'TO:'
     A                                      COLOR(YLW)
     A            XTO           10A  O  2 70
     A                                  4  2'ASN SENT  / TIME USER PART#       -
     A                                       SHIP-DATE  SHIP-DATE     QTY  ORDE-
     A                                      R#     '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A*---------------------------------------------------------------
     A          R DSP99
     A*%%TS  SD  20240222  135516  I0777       REL-V7R4M0  5770-WDS
     A                                      CF03
     A                                      CF12
     A            XMSG          60A  O 23  4
     A                                 24  4'F3:EXIT'
     A                                      DSPATR(RI)
     A                                 24 50'F12:'
     A                                      DSPATR(RI)
     A                                 24 55'BACK'
