     A*%%TS  SD  20190718  161520  I0777       REL-V7R3M0  5770-WDS
     A** EDIPW62 ******************************************************
     A*  ORDER ENTRY TYPE ANALYSIS                                    *
     A*  J.WATANABE  2019.03.25                                       *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*---------------------------------------*
     A          R DSP01
     A*%%TS  SD  20190718  161520  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                      CF05
     A                                  1  3'EDIPW61'
     A                                  1 18'** Order Entry Type Analysis **'
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3USER
     A                                  6 15'Target YYMM...From:'
     A            XFROM          6A  B  6 35
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6 42'(YYYYMM)'
     A                                      COLOR(YLW)
     A                                  8 29'To  :'
     A            XTO            6A  B  8 35
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  8 42'(YYYYMM)'
     A                                      COLOR(YLW)
     A            XMSG          65A  O 22  7COLOR(RED)
     A                                 24  5' '
     A                                 24  7' F1 '
     A                                      DSPATR(RI)
     A                                 24 12'Exit'
     A                                 24 20' F5 '
     A                                      DSPATR(RI)
     A                                 24 25'Output'
