     A*%%TS  SD  20161219  133155  I0777       REL-V7R1M0  5770-WDS
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A          R DSP01
     A*%%TS  SD  20161215  085430  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      CF12(12)
     A                                      OVERLAY
     A                                      RTNCSRLOC(&D1RCD &D1FLD)
     A                                      CSRLOC(D1LIN      D1COL)
     A            D1LIN          3S 0H
     A            D1COL          3S 0H
     A            D1RCD         10A  H
     A            D1FLD         10A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** Gentran Mapping Table Maintenan-
     A                                      ce **'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  1 70'EJGPW10'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 23'============== EDI ===============-
     A                                      ='
     A                                  4 60'=== AS400 ==='
     A                                  5 15'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 23' EDI-ID  '
     A                                      DSPATR(UL)
     A                                  5 33'HDT'
     A                                      DSPATR(UL)
     A                                  5 37'FIL#'
     A                                      DSPATR(UL)
     A                                  5 42'  FIELD   '
     A                                      DSPATR(UL)
     A                                  5 53'GROUP'
     A                                      DSPATR(UL)
     A                                  5 60'FIL#'
     A                                      DSPATR(UL)
     A                                  5 65' FIELD  '
     A                                      DSPATR(UL)
     A            D1SEL          1A  B  7 18DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            D1RCID        10A  B  7 23DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            D1RTYP         1A  B  7 34DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            D1EFIL         4A  B  7 37DSPATR(CS)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A            D1EFLD        10A  B  7 42DSPATR(CS)
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(PC)
     A            D1EGRP         5A  B  7 53DSPATR(CS)
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(PC)
     A            D1AFIL         4A  B  7 60DSPATR(CS)
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(PC)
     A            D1AFLD         8A  B  7 65DSPATR(CS)
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(PC)
     A                                 10 18'0:DELETE'
     A                                 11 18'1:CHANGE'
     A                                 12 18'2:ADD'
     A  99                             22 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99        D1MSG         60O  O 22 17
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 24 15'F1:'
     A                                      DSPATR(RI)
     A                                 24 19'EXIT'
     A                                 24 28'ENTER:'
     A                                      DSPATR(RI)
     A                                 24 35'NEXT'
     A                                 24 43'F12:'
     A                                      DSPATR(RI)
     A                                 24 48'INQUIRY'
     A*==============================================================**
     A          R DSP02
     A*%%TS  SD  20161219  133155  I0777       REL-V7R1M0  5770-WDS
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      OVERLAY
     A                                      RTNCSRLOC(&D2RCD &D2FLD)
     A                                      CSRLOC(D2LIN      D2COL)
     A            D2LIN          3S 0H
     A            D2COL          3S 0H
     A            D2RCD         10A  H
     A            D2FLD         10A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** Gentran Mapping Table Maintenan-
     A                                      ce **'
     A                                      COLOR(WHT)
     A                                  1 67'FMT: EJGPW10'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3 18'============ EDI =================-
     A                                      ==='
     A                                  3 57'=== AS400 ===='
     A                                  4  8'UPDATE'
     A                                  4 18'EDI-ID'
     A                                  4 29'HDT'
     A                                  4 33'FIL#'
     A                                  4 38'FIELD  '
     A                                  4 50'GROUP'
     A                                  4 57'FIL#'
     A                                  4 63'FIELD'
     A            D2SEL          8A  O  5  8COLOR(YLW)
     A            D1RCID        10A  O  5 18COLOR(YLW)
     A            D1RTYP         1A  O  5 30COLOR(YLW)
     A            D1EFIL         4A  O  5 33COLOR(YLW)
     A            D1EFLD        10A  O  5 38COLOR(YLW)
     A            D1EGRP         5A  O  5 50COLOR(YLW)
     A            D1AFIL         4A  O  5 57COLOR(YLW)
     A            D1AFLD         8A  O  5 63COLOR(YLW)
     A                                  6  8'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A                                  8  8'Attribute......:'
     A            D2FTYP         2A  B  8 25
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                  8 28'(AN/ID/DT/TM/N/R/C)'
     A                                      COLOR(YLW)
     A                                  8 65'Attribute'
     A                                      COLOR(WHT)
     A                                  9  8'Sart Position .:'
     A            D2POS1         4Y 0B  9 25
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                  9 65'AN: Alpha'
     A                                      COLOR(YLW)
     A                                 10  8'End  Position .:'
     A            D2POS2         4Y 0B 10 25
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                 10 65'ID: ID'
     A                                      COLOR(YLW)
     A                                 11  8'Length/Dec.....:'
     A            D2LNG          3Y 0B 11 25
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                 11 30'/'
     A            D2DEC          1Y 0B 11 32
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                      EDTCDE(1)
     A                                 11 65'DT: Date'
     A                                      COLOR(YLW)
     A                                 12  8'Field Name ....:'
     A            D2ANAM        35A  B 12 25
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A                                 12 65'TM: Time'
     A                                      COLOR(YLW)
     A                                 13  8'Value1 ........:'
     A            D2VAL1        10A  B 13 25
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A                                 13 65'N : Numeric'
     A                                      COLOR(YLW)
     A                                 14  8'Value2 ........:'
     A            D2VAL2        10A  B 14 25
     A                                 14 65'R : Numeric'
     A                                      COLOR(YLW)
     A                                 15  8'Value3 ........:'
     A            D2VAL3        10A  B 15 25
     A                                 15 65'C : Constant'
     A                                      COLOR(YLW)
     A*
     A  99                             23  8'ERORR'
     A  99                                  DSPATR(RI)
     A  99        D2MSG         60O  O 23 14
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 24  8'F3:'
     A                                      DSPATR(RI)
     A                                 24 12'GO BACK'
     A                                 24 24'F5:'
     A                                      DSPATR(RI)
     A                                 24 28'UPDATE'
