     A*%%TS  SD  20161201  134913  I0777       REL-V7R1M0  5770-WDS
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A          R DSP01
     A*%%TS  SD  20161129  125259  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      CF12(12)
     A                                      OVERLAY
     A                                      RTNCSRLOC(&D1RCD &D1FLD)
     A                                      CSRLOC(D1LIN      D1COL)
     A            D1LIN          3S 0H
     A            D1COL          3S 0H
     A            D1RCD         10A  H
     A            D1FLD         10A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 24'**  B2B PROGRAM M/F MAINTENANCE **'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  1 69'FMT EJKPW15'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  5 19'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 29'PARTNER '
     A                                  5 29'GROUP   '
     A                                      DSPATR(UL)
     A                                  5 38'R/S'
     A                                      DSPATR(UL)
     A                                  5 43'EDI-CODE'
     A                                      DSPATR(UL)
     A            D1SEL          1A  B  7 22DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            D1JSYS         2A  B  7 31DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            D1SNRV         1A  B  7 39DSPATR(CS)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            D1DKBN         3A  B  7 45DSPATR(CS)
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(PC)
     A                                 10 22'0:DELETE'
     A                                 11 22'1:CHANGE'
     A                                 12 22'2:ADD'
     A                                 22 11'ERROR'
     A                                      DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1MSG         53O  O 22 18
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24 15'F1:'
     A                                      DSPATR(RI)
     A                                 24 19'EXIT'
     A                                 24 28'ENTER:'
     A                                      DSPATR(RI)
     A                                 24 35'NEXT'
     A                                 24 43'F12:'
     A                                      DSPATR(RI)
     A                                 24 48'INQUIRY'
     A*==============================================================**
     A          R DSP02
     A*%%TS  SD  20161201  134913  I0777       REL-V7R1M0  5770-WDS
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      OVERLAY
     A                                      RTNCSRLOC(&D2RCD &D2FLD)
     A                                      CSRLOC(D2LIN      D2COL)
     A            D2LIN          3S 0H
     A            D2COL          3S 0H
     A            D2RCD         10A  H
     A            D2FLD         10A  H
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21'** B2B PROGRAM M/F MAINTENANCE **'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  1 65'FMT: EJKPW15'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4  8'UPDATE'
     A                                  3 20'PARTNER'
     A                                  4 20'GROUP     R/S  EDI-CODE'
     A            D2SEL          8A  O  5  8COLOR(YLW)
     A            D1JSYS         2A  O  5 23COLOR(YLW)
     A            D1SNRV         1A  O  5 31COLOR(YLW)
     A            D1DKBN         3A  O  5 37COLOR(YLW)
     A                                  6  8'-----------------------------------
     A                                      ------------------------------------
     A                                      --'
     A*
     A  45                              8  8'RCV PGM (B2B  -->AS400).:'
     A  45        D2RPG1        10A  B  8 34
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A*
     A  45                              9  8'B2B TXT FILE LENGTH.....:'
     A  45        D2LENG         5  0B  9 34EDTCDE(Z)
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(PC)
     A*
     A N45                             10  8'SND PGM (AS400-->B2B)...:'
     A N45        D2CPG1        10A  B 10 34
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A N45                             11  8'HULFT FILE ID...........:'
     A N45        D2HFID        10A  B 11 34
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A N45                             12  8'B2B TXT FILE NAME.......:'
     A N45        D2FNAM        10A  B 12 34
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(PC)
     A N45                             14  8'SERVER NAME.............:'
     A N45        D2HOST        10A  B 14 34
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(PC)
     A N45                             15  8'RECEPTION LIBRARY/FILE..:'
     A N45        D2LIBL        10A  B 15 34
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A N45                             15 45'/'
     A N45        D2FILE        10A  B 15 47
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A                                 17  8'B2B PARTNER ID..........:'
     A            D2PTID        10A  B 17 34
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(PC)
     A                                 18  8'DETAIL CODE.............:'
     A            D2NONY         4A  B 18 34
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D2MSG         53O  O 22 18
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  8'F3:'
     A                                      DSPATR(RI)
     A                                 24 12'GO BACK'
     A                                 24 24'F5:'
     A                                      DSPATR(RI)
     A                                 24 28'UPDATE'
