     A** EJKPW32 **************************************
     A* INQUIRY & UPDATE B2B MANAGEMENT FILE          *
     A*    **ORIGINAL IS JK599D0 FROM ASJ**           *
     A*  T.SAKAKI                   2016.12.13        *
     A*************************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------
     A          R DSP01
     A                                      CF01(01)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' **INQUIRY & UPDATE B2B -
     A                                      MANAGEMENT FILE** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'EJKPW32'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
      *
     A                                  5  7'RECEIVE' DSPATR(UL)
     A                                  5 15' 1.'
     A                                   + 1' B2B_R RECEIVE MANAGEMENT +
     A                                      FILE ( EJKPP01 )'
      *
     A                                  7  7'SEND   ' DSPATR(UL)
     A                                  7 15' 2.'
     A                                   + 1' B2B_S SEND MANAGEMENT +
     A                                      FILE    ( EJKPP50 )'
      *
     A                                  9 15' 3.'
     A                                   + 1' B2B_FORD SEND MANAGEMENT +
     A                                      FILE ( EJKPP40 )'
      *
     A                                 11 15' 4.'
     A                                   + 1' SEND ERROR MANAGEMENT +
     A                                      FILE    ( EJKPP55 )'
      *
     A                                 20 15'SELECT -->'
     A            D1SEL          1   B   + 1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
      *
      *
     A  99                             23 11'ERROR' DSPATR(RI BL)
     A  99        D1ERR         60     23 18
      *
     A                                 24  4' F1 ' DSPATR(RI)
     A                                   + 1' END '
