     F** EJKPW35 *****************************************
     F* INQUIRY & UPDATE B2B_FORD MANAGEMENT FILE        *
      *    **ORIGINAL IS JK590D0 FROM ASJ**              *
     F* T.SAKAKI          2016.12.13                     *
     F**************************************** EJKPW35 ***
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------
     A          R DSP01
     A                                      CF03
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' **INQUIRY & UPDATE B2B_FORD +
     A                                      MANAGEMENT FILE** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'EJKPW35'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  4 16'SEND DATE'
     A            D1ADSD         8  0B  4 31TEXT('START DATE')
     A                                      EDTCDE(4)
     A                                      DSPATR(CS)
     A  11                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1ADED         8  0B   + 1TEXT('END DATE')
     A                                      EDTCDE(4)
     A                                      DSPATR(CS)
     A  17                                  DSPATR(PC RI)
     A                                  6 16'     TIME'
     A            D1ADST         2  0B  6 31TEXT('START TIME')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  12                                  DSPATR(PC RI)
     A                                   + 1': 00 -'
     A            D1ADET         2  0B   + 1TEXT('END TIME')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  18                                  DSPATR(PC RI)
     A                                   + 1': 00'
     A*
     A                                  8 16'PARTNER GROUP'
     A            D1JSYS         2   B  8 31TEXT('PARTNER GRP')
     A                                      DSPATR(CS)
     A  13                                  DSPATR(PC RI)
     A                                 10 16'EDI DATA CODE'
     A            D1DKBN         3   B 10 31TEXT('EDI CODE')
     A                                      DSPATR(CS)
     A  14                                  DSPATR(PC RI)
     A                                 12 16'STRING SEARCH'
     A            D1MOJI        20O  B 12 31TEXT('SEARCH')
     A                                      DSPATR(CS)
     A  16                                  DSPATR(PC RI)
     A                                 14 16'FILTER  '
     A            D1FILT         1   B 14 31TEXT('FILTER')
     A                                      DSPATR(CS)
     A  19                                  DSPATR(PC RI)
     A                                    +1'--> " "= ALL | "E"= ERROR DATA'
      *
     A                                 16 16'SERVER  '
     A            D1SAKI        10   B 16 31TEXT('SERVER')
     A                                      DSPATR(CS)
     A  15                                  DSPATR(PC RI)
     A                                    +1'--> "IAF-B2B" OR "IAF-B2B-T"'
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        D1MSG         60   O 22 18
      *
     A                                 24  4' BACK '
     A                                   + 1' F3 ' DSPATR(RI)
      *-------------------------------------
      *-------------------------------------
     A          R SFREC1                    TEXT('SUB FILE')
     A                                      SFL
     A            S1SEL          1   B  5  4TEXT('NO.')
     A                                      DSPATR(CS)
     A  21                                  DSPATR(PC RI)
     A            S1ADHZ         8  0    + 2TEXT('DATE')
     A                                      EDTWRD('    .  .  ')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1ADTM         6  0    + 1TEXT('TIME')
     A                                      EDTWRD('  :  :  ')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1JSYS         2A      + 2TEXT('RCV DIV')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1DKBN         3A      + 1TEXT('EDI CODE')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1PTID        12A      + 1TEXT('PARTNER ID')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1FILE        10A      + 1TEXT('FILE')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1LIBL        10A      + 1TEXT('LIBRARY')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
     A            S1SAKI        10A      + 1TEXT('SERVER')
     A  22                                  DSPATR(HI)
     A  23                                  COLOR(RED)
      *-------------------------------------
     A          R SFCTL1
     A  99                                  ALARM
     A                                      SFLCTL(SFREC1)
     A                                      CF01 CF03 CF10
     A                                      BLINK
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(15) SFLSIZ(16)
     A                                      ROLLUP(75)
     A                                      ROLLDOWN(75)
     A  71                                  SFLDSPCTL
     A  72                                  SFLDSP
     A  73                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A            RRN1           4  0H      SFLRCDNBR
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' **INQUIRY & UPDATE B2B_FORD +
     A                                      MANAGEMENT FILE** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'EJKPW35'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  4  3'    DATE-
     A                                           TIME      PG EDI-
     A                                       PARTNER ID -
     A                                        FILE       LIBRARY-
     A                                          SERVER    '
     A                                      DSPATR(UL)
      *
     A          R DSP02
     A                                 21  4'|... "1" SELECT : "M" DETAIL'
     A                                 22  9'DATA HIGHLIGHTED IN RED HAS +
     A                                      AN ERROR'
     A                                      COLOR(RED)
      *
     A  99                             23 11'ERROR' DSPATR(RI BL)
     A  99        D2MSG         60   O 23 18
      *
     A                                 24  4' END '
     A                                   + 1' F1 ' DSPATR(RI)
     A                                   + 4' BACK '
     A                                   + 1' F3 ' DSPATR(RI)
     A                                   + 7' REFRESH '
     A                                   + 1' F10 ' DSPATR(RI)
