     A*%%TS  SD  20260304  095810  I0777       REL-V7R4M0  5770-WDS
     A** FAAPW24 ******************************************************
     A*  COMMON PART MAINTENANCE LOG                                  *
     A*  J.WATANABE  2019.03.08
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*---------------------------------------*
     A          R DSP01
     A*%%TS  SD  20260304  095810  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF03
     A                                  1  3'FAAPW24'
     A                                  1 18'** COMMON PART MAINTENANCE LOG **'
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3USER
     A                                  6 15'Target Date...From:'
     A            XFROM         10A  B  6 35
     A  41                                  DSPATR(PC)
     A  41                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6 47'(YYYYMMDD)'
     A                                      COLOR(YLW)
     A                                  8 29'To  :'
     A            XTO           10A  B  8 35
     A  42                                  DSPATR(PC)
     A  42                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  8 47'(YYYYMMDD)'
     A                                      COLOR(YLW)
     A                                 10 22'User Part..:'
     A            XMHN1          5A  B 10 35
     A  43                                  DSPATR(PC)
     A  43                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            XMHN2          5A  B 10 41
     A  43                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            XMHN3          5A  B 10 47
     A  43                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 10 53'(BLANK FOR ALL)'
     A                                      COLOR(YLW)
     A                                 12 19'Delivery Code :'
     A            XNONY          4A  B 12 35
     A  44                                  DSPATR(PC)
     A  44                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 12 41'(BLANK FOR ALL)'
     A                                      COLOR(YLW)
     A            XMSG1         65A  O 22  7COLOR(RED)
     A                                 24  5' '
     A                                 24  7' F1 '
     A                                      DSPATR(RI)
     A                                 24 12'Exit'
     A                                 24 31'ENTR'
     A                                      DSPATR(RI)
     A                                 24 36'Inquiry'
     A          R SFL01                     SFL
     A*%%TS  SD  20230413  160318  I0777       REL-V7R3M0  5770-WDS
     A            S@CRTM         4Y 0H
     A*
     A            S@CRDT         8Y 0O  5  3EDTWRD('    /  /  ')
     A            X@CRTM         5A  O  5 14
     A            S@CRUS         5A  O  5 20
      *
     A            S@EDIT         3A  O  5 26
     A  31                                  COLOR(WHT)
     A  32                                  COLOR(YLW)
     A  33                                  COLOR(RED)
      *
     A            S@CUST         4A  O  5 30
     A            S@NONY         4A  O  5 35
     A            S@NKOJ         1A  O  5 40
     A            S@NUKE         4A  O  5 42
     A            S@MHIN        16A  O  5 47COLOR(YLW)
     A            S@IPAR        14A  O  5 64
     A*
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20260304  095810  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      CF01
     A                                      CF03
     A                                      CF07
     A                                      CF09
     A                                      CF12
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM          10A  O  1  3
     A                                  1 20'** CPM MAINTENANCE LOG INQUIRY **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3'DATE FROM:'
     A                                      COLOR(YLW)
     A            XFROM         10A  O  2 14
     A                                  2 26'TO:'
     A                                      COLOR(YLW)
     A            XTO           10A  O  2 30
     A                                  2 42'PART#'
     A                                      COLOR(YLW)
     A            X@MHIN        17A  O  2 48
     A                                  2 67'Delv#'
     A                                      COLOR(YLW)
     A            XNONY          4   O  2 73
     A                                  4  3'UPDATE DATE/TIME USER  EDT CST# DL-
     A                                      V# F DOCK USER PART#       IAF PART-
     A                                      #     '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A*
     A          R DSP99
     A*%%TS  SD  20230413  133250  I0777       REL-V7R3M0  5770-WDS
     A            XMSG2         65A  O 23  3
     A                                 24  3'F1:'
     A                                      DSPATR(RI)
     A                                 24  7'Exit'
     A                                 24 15'F7:'
     A                                      DSPATR(RI)
     A                                 24 19'Print'
     A                                 24 28'F9:'
     A                                      DSPATR(RI)
     A                                 24 32'Download to csv'
