     A*%%TS  SD  20210511  172425  I0777       REL-V7R3M0  5770-WDS
     A** FBCPW35 ***********************************
     A*  SALES EXPANSION M/F INQUIRY               *
     A*    T.SAKAKI     2016.07.20                 *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*----------------------------------------------------------------
     A          R SFREC1                    SFL
     A*%%TS  SD  20210511  172425  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('ﾅﾎﾞ､ﾎｦbﾓ')
     A            @SHN1          5A  H
     A            @SHN2          5A  H
     A            @SHN3          2A  H
     A            @CLAS          2Y 0H
     A            @RMK1         30A  H
     A            @RMK2         30A  H
     A            @KYMD          8Y 0H
     A            @KTIM          6Y 0H
     A            @KOME         10A  H
     A*
     A            @TOKU          4Y 0O  5  3COLOR(WHT)
     A                                      EDTCDE(4)
     A            @NONY          4Y 0O  5  8EDTCDE(4)
     A            @NKOJ          1A  O  5 13
     A            @NUKE          2A  O  5 15
     A            @CNAM         10A  O  5 18
     A            @MHN1          5A  O  5 29COLOR(YLW)
     A            @MHN2          5A  O  5 35COLOR(YLW)
     A            @MHN3          5A  O  5 41COLOR(YLW)
     A            @UPRC          9Y 5O  5 47EDTWRD(' , 0 .     ')
     A                                      COLOR(WHT)
     A            @SLSP          5A  O  5 59
     A            @EFC           6Y 0O  5 65EDTWRD('    /  ')
     A            @EXP           6Y 0O  5 73EDTWRD('    /  ')
     A  41                                  COLOR(PNK)
     A*----------------------------------------------------------------
     A*
     A          R SFCTL1                    SFLCTL(SFREC1)
     A*%%TS  SD  20210511  172425  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      TEXT('ﾅﾎﾞ､ﾎｦbﾓ ﾃ]nﾜｰﾓ')
     A                                      CF03
     A                                      CF07
     A                                      BLINK
     A  99                                  ALARM
     A                                      OVERLAY
     A                                      PROTECT
     A  71                                  SFLDSP
     A  71                                  SFLDSPCTL
     A  72                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP(73)
     A                                      ROLLDOWN(73)
     A* 99                                  SFLMSG('DATA END' 99)
     A            DSPRRN         4S 0H      SFLRCDNBR
     A                                  1  2'FBCPW35'
     A                                  1 20' ** SALES EXPANSION M/F INQUIRY **-
     A                                       '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A*
     A                                  4  3'CUST'
     A                                      DSPATR(UL)
     A                                  4  8'DELV'
     A                                      DSPATR(UL)
     A                                  4 13'F'
     A                                      DSPATR(UL)
     A                                  4 15'DK'
     A                                      DSPATR(UL)
     A                                  4 18'NAME      '
     A                                      DSPATR(UL)
     A                                  4 29'USER PART #      '
     A                                      DSPATR(UL)
     A                                  4 47'     PRICE '
     A                                      DSPATR(UL)
     A                                  4 59'SALES'
     A                                      DSPATR(UL)
     A                                  4 65'EFC.DAT'
     A                                      DSPATR(UL)
     A                                  4 73'EXP.DAT'
     A                                      DSPATR(UL)
     A*
     A          R DSP99
     A*%%TS  SD  20200701  101928  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('ﾃu]nﾞ ﾈlxb')
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                 24  7' PREV '
     A                                 24 19' F7 '
     A                                      DSPATR(RI)
     A                                 24 24'Download to CSV'
     A                                 24 58' PAGE UP/DOWN '
     A                                      DSPATR(RI)
