     A*%%TS  SD  20200901  170202  I0777       REL-V7R3M0  5770-WDS
     A** FBCPW04 *****************************
     A*  SALES PRICE MASTER MAINTENANCE
     A*   < UNIT PRICE IN MASS PRODUCTION >
     A*   MSK KUNIEDA          2000.03.27
     A****************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R FBCPW041
     A*%%TS  SD  20160727  135610  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      BLINK
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' * SALES UNIT PRICE MASTER ADDITIO-
     A                                      N * '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'FBCPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 69USER
     A*
     A                                  4  9'UNIT PRICE IN MASS PRODUCTION'
     A*
     A                                  7 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  7 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                  7 30'FACTORY'
     A                                      DSPATR(UL)
     A                                  7 39'DOCK'
     A                                      DSPATR(UL)
     A                                  7 45'   USER PARTS NO.            '
     A                                      DSPATR(UL)
     A*
     A            @TOKU          4Y 0B  9 12DSPATR(CS)
     A                                      EDTCDE(Z)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            @NONY          4Y 0B  9 22DSPATR(CS)
     A                                      EDTCDE(Z)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            @NKOJ          1A  O  9 33DSPATR(CS)
     A* 32                                  DSPATR(RI PC)
     A            @NUKE          4A  O  9 39DSPATR(CS)
     A* 33                                  DSPATR(RI PC)
     A            @MHN1          5A  B  9 45DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                  9 51'-'
     A            @MHN2          5A  B  9 53DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 59'-'
     A            @MHN3          5A  B  9 61DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 67'-'
     A            @MHN4          5A  B  9 69DSPATR(CS)
     A  34                                  DSPATR(RI)
     A*
     A                                 13  7'* LAST TIME *'
     A                                 15 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                 15 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                 15 30'FACTORY'
     A                                      DSPATR(UL)
     A                                 15 39'DOCK'
     A                                      DSPATR(UL)
     A                                 15 45'   USER PARTS NO.            '
     A                                      DSPATR(UL)
     A*
     A            @TOKUD         4A  O 17 12
     A            @NONYD         4A  O 17 22
     A            @NKOJD         1A  O 17 33
     A            @NUKED         4A  O 17 39
     A            @MHIND        23A  O 17 45
     A*
     A  99                             22  3'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          70A  O 22  9
     A                                 24  9'F1'
     A                                      DSPATR(RI)
     A                                 24 12'EXIT'
     A*
     A          R FBCPW042
     A*%%TS  SD  20200901  170202  I0777       REL-V7R3M0  5770-WDS
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' * SALES UNIT PRICE MASTER MAINTEN-
     A                                      ANCE * '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'FBCPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 69USER
     A*
     A                                  4  9'UNIT PRICE IN MASS PRODUCTION'
     A*
     A                                  6 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  6 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                  6 30'FACTORY'
     A                                      DSPATR(UL)
     A                                  6 39'DOCK'
     A                                      DSPATR(UL)
     A                                  6 45'   USER PARTS NO.      '
     A                                      DSPATR(UL)
     A*
     A            @TOKU          4Y 0O  7 12
     A            @NONY          4Y 0O  7 22
     A            @NKOJ          1A  O  7 33
     A            @NUKE          4A  O  7 39
     A            @MHIN         23A  O  7 45
     A*
     A                                  9  9' CURRENT UNIT PRICE ---------------
     A                                      ------'
     A                                 10 25'APPLY'
     A                                 10 38'APPLY'
     A                                 10 50'UPDATE'
     A                                 11 10'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 11 25'START DATE'
     A                                      DSPATR(UL)
     A                                 11 38'EXP DATE '
     A                                      DSPATR(UL)
     A                                 11 50'INDIVIDUAL'
     A                                      DSPATR(UL)
     A*
     A  19        @1TNK         10Y 5O 12 10EDTWRD('  , 0 .     ')
     A            @1SYMD         8Y 0O 12 25EDTWRD('    /  /  ')
     A            @1EYMD         8Y 0O 12 38EDTWRD('    /  /  ')
     A            @1IND          1A  O 12 54
     A*
     A                                 15  9' CHANGE ---------------------------
     A                                      ------'
     A                                 16 25'APPLY'
     A                                 16 38'APPLY'
     A                                 17 10'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 17 25'START DATE'
     A                                      DSPATR(UL)
     A                                 17 38'EXP DATE '
     A                                      DSPATR(UL)
     A*
     A            @2TNK         10Y 5B 18 10EDTWRD('  , 0 .     ')
     A                                      DSPATR(CS)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            @2SYY          4Y 0B 18 25DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2SMM          2Y 0B 18 30DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2SDD          2Y 0B 18 33DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2EYY          4Y 0B 18 38DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            @2EMM          2Y 0B 18 43DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            @2EDD          2Y 0B 18 46DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A*
     A  99                             23  3'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          70A  O 23  9
     A                                 24 11'F3'
     A                                      DSPATR(RI)
     A                                 24 14'GO BACK,'
     A                                 24 25'F5'
     A                                      DSPATR(RI)
     A                                 24 28'UPDATE'
