     A*%%TS  SD  20220310  171811  I0777       REL-V7R3M0  5770-WDS
     A** FBCPW04 *****************************
     A* ..SALES UNIT PRICE MASTER ADDITION.  *
     A*   < UNIT PRICE IN MASS PRODUCTION >  *
     A*   MSK KUNIEDA          2000.03.27    *
     A***************************** FBCPW04 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R FBCPW041
     A*%%TS  SD  20171011  155721  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' * SALES UNIT PRICE MASTER (ADD) *-
     A                                       '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 73
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 17'APPLY TO ALL THE DELIVERY CODES UN-
     A                                      DER A CUSTOMER'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4  7'UNIT PRICE FOR MASS PRODUCTION'
     A                                  7  4'   USER PARTS NO.            '
     A                                      DSPATR(UL)
     A                                  7 38'CUSTOMER'
     A                                      DSPATR(UL)
     A            @MHN1          5A  B  9  4DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A                                  9 10'-'
     A            @MHN2          5A  B  9 12DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 18'-'
     A            @MHN3          5A  B  9 20DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 26'-'
     A            @MHN4          5A  B  9 28DSPATR(CS)
     A  34                                  DSPATR(RI)
     A            @TOKU          4Y 0B  9 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 20  4'UPDATED'
     A            @TOKUD         4A  O 21  4
     A            @MHIND        23A  O 21  9
     A  99                             22  9'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          65A  O 22 15
     A                                 24  4' F1: '
     A                                      DSPATR(RI)
     A                                 24 10'EXIT'
     A*
     A          R FBCPW042
     A*%%TS  SD  20220310  171811  I0777       REL-V7R3M0  5770-WDS
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' * SALES UNIT PRICE MASTER (ADD) *-
     A                                       '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            #PGM           8A  O  1 73
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  2 17'APPLY TO ALL THE DELIVERY CODES UN-
     A                                      DER A CUSTOMER'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  3 42'DELIVERY'
     A                                      DSPATR(UL)
     A                                  4  7'UNIT PRICE FOR MASS PRODUCTION'
     A            @NON01         4Y 0O  4 42EDTCDE(4)
     A            D@NM01        12A  O  4 47
     A            @NON18         4Y 0O  4 61EDTCDE(4)
     A            D@NM18        12A  O  4 66
     A            @NON02         4Y 0O  5 42EDTCDE(4)
     A            D@NM02        12A  O  5 47
     A            @NON19         4Y 0O  5 61EDTCDE(4)
     A            D@NM19        12A  O  5 66
     A                                  6  4'   USER PARTS NO.      '
     A                                      DSPATR(UL)
     A                                  6 28'CUSTOMER'
     A                                      DSPATR(UL)
     A            @NON03         4Y 0O  6 42EDTCDE(4)
     A            D@NM03        12A  O  6 47
     A            @NON20         4Y 0O  6 61EDTCDE(4)
     A            D@NM20        12A  O  6 66
     A            @MHIN         23A  O  7  4
     A            @TOKU          4Y 0O  7 29EDTCDE(4)
     A            @NON04         4Y 0O  7 42EDTCDE(4)
     A            D@NM04        12A  O  7 47
     A            @NON21         4Y 0O  7 61EDTCDE(4)
     A            D@NM21        12A  O  7 66
     A            @NON05         4Y 0O  8 42EDTCDE(4)
     A            D@NM05        12A  O  8 47
     A            @NON22         4Y 0O  8 61EDTCDE(4)
     A            D@NM22        12A  O  8 66
     A            @NON06         4Y 0O  9 42EDTCDE(4)
     A            D@NM06        12A  O  9 47
     A            @NON23         4Y 0O  9 61EDTCDE(4)
     A            D@NM23        12A  O  9 66
     A                                 10  2' CURRENT UNIT PRICE ---------------
     A                                      --'
     A            @NON07         4Y 0O 10 42EDTCDE(4)
     A            D@NM07        12A  O 10 47
     A            @NON24         4Y 0O 10 61EDTCDE(4)
     A            D@NM24        12A  O 10 66
     A                                 11 16'APPLY'
     A                                 11 28'APPLY'
     A            @NON08         4Y 0O 11 42EDTCDE(4)
     A            D@NM08        12A  O 11 47
     A            @NON25         4Y 0O 11 61EDTCDE(4)
     A            D@NM25        12A  O 11 66
     A                                 12  3'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 12 16'EFFECTIVE '
     A                                      DSPATR(UL)
     A                                 12 28'EXP_DATE '
     A                                      DSPATR(UL)
     A            @NON09         4Y 0O 12 42EDTCDE(4)
     A            D@NM09        12A  O 12 47
     A            @NON26         4Y 0O 12 61EDTCDE(4)
     A            D@NM26        12A  O 12 66
     A  19        @1TNK         10Y 5O 13  2EDTWRD('  , 0 .     ')
     A            @1SYMD         8Y 0O 13 16EDTWRD('    /  /  ')
     A            @1EYMD         8Y 0O 13 28EDTWRD('    /  /  ')
     A            @NON10         4Y 0O 13 42EDTCDE(4)
     A            D@NM10        12A  O 13 47
     A            @NON27         4Y 0O 13 61EDTCDE(4)
     A            D@NM27        12A  O 13 66
     A            @NON11         4Y 0O 14 42EDTCDE(4)
     A            D@NM11        12A  O 14 47
     A            @NON28         4Y 0O 14 61EDTCDE(4)
     A            D@NM28        12A  O 14 66
     A            @NON12         4Y 0O 15 42EDTCDE(4)
     A            D@NM12        12A  O 15 47
     A            @NON29         4Y 0O 15 61EDTCDE(4)
     A            D@NM29        12A  O 15 66
     A                                 16  2' NEW UNIT PRICE -------------------
     A                                      --'
     A            @NON13         4Y 0O 16 42EDTCDE(4)
     A            D@NM13        12A  O 16 47
     A            @NON30         4Y 0O 16 61EDTCDE(4)
     A            D@NM30        12A  O 16 66
     A                                 17 16'APPLY'
     A                                 17 28'APPLY'
     A            @NON14         4Y 0O 17 42EDTCDE(4)
     A            D@NM14        12A  O 17 47
     A            @NON31         4Y 0O 17 61EDTCDE(4)
     A            D@NM31        12A  O 17 66
     A                                 18  2'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 18 16'EFFECTIVE '
     A                                      DSPATR(UL)
     A                                 18 28'EXP_DATE '
     A                                      DSPATR(UL)
     A            @NON15         4Y 0O 18 42EDTCDE(4)
     A            D@NM15        12A  O 18 47
     A            @NON32         4Y 0O 18 61EDTCDE(4)
     A            D@NM32        12A  O 18 66
     A            @2TNK         10Y 5B 19  2EDTWRD('  , 0 .     ')
     A                                      DSPATR(CS)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            @2SYY          4Y 0B 19 16DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2SMM          2Y 0B 19 21DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2SDD          2Y 0B 19 24DSPATR(CS)
     A                                      EDTCDE(Z)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            @2EYY          4Y 0B 19 28DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            @2EMM          2Y 0B 19 34DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            @2EDD          2Y 0B 19 37DSPATR(CS)
     A                                      EDTCDE(Z)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            @NON16         4Y 0O 19 42EDTCDE(4)
     A            D@NM16        12A  O 19 47
     A            @NON33         4Y 0O 19 61EDTCDE(4)
     A            D@NM33        12A  O 19 66
     A            @NON17         4Y 0O 20 42EDTCDE(4)
     A            D@NM17        12A  O 20 47
     A            @NON34         4Y 0O 20 61EDTCDE(4)
     A            D@NM34        12A  O 20 66
     A            @NON35         4Y 0O 21 42EDTCDE(4)
     A            D@NM35        12A  O 21 47
     A            @NON36         4Y 0O 21 61EDTCDE(4)
     A            D@NM36        12A  O 21 66
     A            @NON37         4Y 0O 22 42EDTCDE(4)
     A            D@NM37        12A  O 22 47
     A            @NON38         4Y 0O 22 61EDTCDE(4)
     A            D@NM38        12A  O 22 66
     A  99                             23  6'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          65A  O 23 12
     A                                 24  6' F3: '
     A                                      DSPATR(RI)
     A                                 24 12'GO BACK'
     A                                 24 24' F5: '
     A                                      DSPATR(RI)
     A                                 24 30'UPDATE'
