     A*%%TS  SD  20240408  130832  I0777       REL-V7R4M0  5770-WDS
     A*** FBCPW60 ******************************************
     A*  SALES UNIT PRICE M/F INQUIRY                      *
     A*                                                    *
     A* TCHK1 03/12/09 CREATE                              *
     A**************************************** FBCPW60 *****
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R FMT010
     A*%%TS  SD  20240408  130832  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 24'** SALES UNIT PRICE M/F INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4  8'Process Type:'
     A                                  4 24'1. TOYOTA Mass Production'
     A                                  5 24'2. TOYOTA Service/Special'
     A                                  6 24'3. Except TOYOTA Customer'
     A                                  7 24'4. All Customer'
     A                                  8 24'5. All Part# of the Selected Custo-
     A                                      mer'
     A                                 11 11'Select Process:'
     A            D1SEL          1Y 0B 11 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A                                 11 29'(Required)'
     A                                 13 11'Select IAF Part#:'
     A            D1SHN1         5A  B 14 27DSPATR(CS)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A            D1SHN2         5A  B 14 33DSPATR(CS)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A            D1SHN3         2A  B 14 39DSPATR(CS)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                 14 42'(Required if Process=1,2,3 or 4)'
     A                                 16 11'Select Customer/Delivery:'
     A            D1TOKU         4Y 0B 17 18DSPATR(CS)
     A                                      EDTCDE(4)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A            D1NONY         4Y 0B 17 27DSPATR(CS)
     A                                      EDTCDE(4)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A                                 17 32'(Deliv# is option, valid when cust-
     A                                      omer entered)'
     A                                 18 18'(Customer is ignoreed if Procees=1-
     A                                      , 2 or 4)'
     A                                 19 18'(Customer is option   if Process=3-
     A                                      )'
     A                                 20 18'(Customer is required if Process=5-
     A                                      )'
     A*
     A                                 22  2'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            D1MSG         70O  O 22  9
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A                                 23  2'F1:END'
      * ----------------------------------------------------
     A          R SFL020                    SFL
     A            S2SLCT         1A  B  6  2DSPATR(CS)
     A  46                                  DSPATR(PC)
     A            S2TOKU         4   O  6  4
     A            S2NONY         4   O  6  9
     A            S2NKOJ         1   O  6 14
     A            S2NUKE         4   O  6 16
     A            S2NONM        10   O  6 21
     A            S2MHIN        23   O  6 32
     A            S2TANK        10Y 5O  6 56EDTWRD('  , 0 .     ')
     A            S2SYMD         8Y 0O  6 70EDTWRD('    .  .  ')
     A            H2TOKU         4Y 0H
     A            H2NONY         4Y 0H
     A            H2NKOJ         1A  H
     A            H2NUKE         4A  H
     A            H2MHN1         5   H
     A            H2MHN2         5   H
     A            H2MHN3         5   H
     A            H2MHN4         5   H
     A            H2TKYY         4Y 0H
     A            H2TKMM         2Y 0H
     A            H2TKDD         2Y 0H
     A            H2NONM        15   H
     A*
     A          R CTL020                    SFLCTL(SFL020)
     A*%%TS  SD  20230817  093803  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN02         4S 0H      SFLRCDNBR(CURSOR)
     A            #PGM           8A  O  1  2
     A                                  1 24'** SALES UNIT PRICE M/F INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A            D2PRNM        60A  O  2  2
     A                                  3  2'IAF PART#'
     A            D2SHN@        14A  O  3 12DSPATR(UL)
     A                                  3 30'CUSTOMER'
     A            D2TOK@         4A  O  3 39DSPATR(UL)
     A            D2NON@         4A  O  3 44DSPATR(UL)
     A*
     A                                  5  4'CUST'
     A                                      DSPATR(UL)
     A                                  5  9'DELI'
     A                                      DSPATR(UL)
     A                                  5 14'F'
     A                                      DSPATR(UL)
     A                                  5 16'DOCK'
     A                                      DSPATR(UL)
     A                                  5 21'NAME'
     A                                      DSPATR(UL)
     A            D2PKND        23A  O  5 32DSPATR(UL)
     A                                  5 63'PRICE'
     A                                      DSPATR(UL)
     A                                  5 70'EFECTIVE'
     A                                      DSPATR(UL)
     A*
     A* ----------------------------------------------------
     A          R SFL030                    SFL
     A*%%TS  SD  20180809  164709  I0777       REL-V7R3M0  5770-WDS
     A            @85            1   H
      *
     A            S3SEQ#         4Y 0O  8  8EDTCDE(4)
     A            S3TANK        10Y 5O  8 14EDTWRD('  , 0 .     ')
     A                                      COLOR(WHT)
     A            S3EFDT         8Y 0O  8 29EDTWRD('    .  .  ')
     A  85                                  COLOR(YLW)
     A            S3EXDT         8Y 0O  8 41EDTWRD('    .  .  ')
     A  85                                  COLOR(YLW)
     A            S3UDAT         8Y 0O  8 53EDTWRD('    .  .  ')
     A            S3UTIM         4Y 0O  8 64EDTWRD('0 :  ')
     A            S3UID          6   O  8 70
     A*
     A          R CTL030                    SFLCTL(SFL030)
     A*%%TS  SD  20230817  093803  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      CF01
     A                                      CF12
     A                                      CF10
     A                                      OVERLAY
     A N51                                  SFLDSP
     A N51                                  SFLDSPCTL
     A  51                                  SFLCLR
     A N52                                  SFLEND(*MORE)
     A            #RCN03         4S 0H      SFLRCDNBR(CURSOR)
     A            #PGM           8A  O  1  2
     A                                  1 24'** SALES UNIT PRICE M/F INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A            D3PRNM        60A  O  2  2
     A                                  3  2'CUST'
     A                                  3  7'DELI'
     A                                  3 12'F'
     A                                  3 14'DOCK'
     A                                  3 36'USER PART# :'
     A            D3MHIN        23A  O  3 49DSPATR(UL)
     A            D3TOK@         4A  O  4  2DSPATR(UL)
     A            D3NON@         4A  O  4  7DSPATR(UL)
     A            D3NKOJ         1A  O  4 12DSPATR(UL)
     A            D3NUKE         4A  O  4 14DSPATR(UL)
     A            D3NONM        15A  O  4 19DSPATR(UL)
     A                                  4 36'IAF PART#  :'
     A            D3SHIN        14A  O  4 49DSPATR(UL)
     A                                  6 14'THIS TIME PURCHASE UNIT PRICE -----
     A                                      -------------------------'
     A                                  7  8' NO     UNIT PRICE   APPLY START A-
     A                                      PPLY END '
     A                                      DSPATR(UL)
     A                                  7 53'UPDATE DATE/TIME USER ID'
     A                                      DSPATR(UL)
     A* ----------------------------------------------------
     A          R SFL040                    SFL
     A*%%TS  SD  20191002  091428  I0777       REL-V7R3M0  5770-WDS
     A            @85            1A  H
     A            @86            1A  H
     A            S4SKJY         1   O  8  6
     A            S4SEQ#         4Y 0O  8  8EDTCDE(4)
     A            S4TANK        10Y 5O  8 14EDTWRD('  , 0 .     ')
     A N86                                  COLOR(WHT)
     A  86                                  COLOR(RED)
     A            S4EFDT         8Y 0O  8 29EDTWRD('    .  .  ')
     A  85                                  COLOR(YLW)
     A            S4EXDT         8Y 0O  8 41EDTWRD('    .  .  ')
     A  85                                  COLOR(YLW)
     A            S4UDAT         8Y 0O  8 53EDTWRD('    .  .  ')
     A            S4UTIM         4Y 0O  8 64EDTWRD('0 :  ')
     A            S4UID          6A  O  8 70
     A*
     A          R CTL040                    SFLCTL(SFL040)
     A*%%TS  SD  20230817  093803  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      CF01
     A                                      CF12
     A                                      OVERLAY
     A N51                                  SFLDSP
     A N51                                  SFLDSPCTL
     A  51                                  SFLCLR
     A N52                                  SFLEND(*MORE)
     A            #RCN04         4S 0H      SFLRCDNBR(CURSOR)
     A            #PGM           8A  O  1  2
     A                                  1 12'** SALES UNIT PRICE M/F INQUIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 47'(SORT BY UPD-DATE/TIME)'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A            D4PRNM        60A  O  2  2
     A                                  2 72TIME
     A                                  3  2'CUST'
     A                                  3  7'DELI'
     A                                  3 12'F'
     A                                  3 14'DOCK'
     A                                  3 37'USER PART# :'
     A            D4MHIN        23A  O  3 50DSPATR(UL)
     A            D4TOK@         4A  O  4  2DSPATR(UL)
     A            D4NON@         4A  O  4  7DSPATR(UL)
     A            D4NKOJ         1A  O  4 12DSPATR(UL)
     A            D4NUKE         4A  O  4 14DSPATR(UL)
     A            D4NONM        15A  O  4 19DSPATR(UL)
     A                                  4 37'IAF PART#  :'
     A            D4SHIN        14A  O  4 50DSPATR(UL)
     A                                  6 14'THIS TIME PURCHASE UNIT PRICE -----
     A                                      -------------------------'
     A                                  7  6'D'
     A                                      DSPATR(UL)
     A                                  7  8' NO     UNIT PRICE   APPLY START A-
     A                                      PPLY END '
     A                                      DSPATR(UL)
     A                                  7 53'UPDATE DATE/TIME USER ID'
     A                                      DSPATR(UL)
      *
     A          R FMT099
     A                                      OVERLAY
     A                                 22  2'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            D99MSG        70O  O 22  9
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
      *
     A            D99CMD        70O  O 23  2
