     A*%%TS  SD  20250310  115817  I0777       REL-V7R4M0  5770-WDS
     A* FBCPW41  ******************************************************
     A* FORD PO CODE MAINTENANCE                                      *
     A* JW   2021.06.29                                               *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*-------------------------------------
     A          R DSP01
     A*%%TS  SD  20250310  115817  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF06
     A                                      CF10
     A                                      BLINK
     A                                  1  4'FBCR41A'
     A                                  1 20' ** FORD PO CODE MAINTENANCE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 30'PO CODE'
     A                                      DSPATR(UL)
     A*
     A            D1KBN          1A  B  7 22DSPATR(CS)
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A*
     A            D1SHP1         2A  B  7 32TEXT('PLANT ID')
     A                                      DSPATR(CS)
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A*
     A                                 10 22'0- CANCEL '
     A                                 11 22'1- CHANGE '
     A                                 12 22'2- ADD    '
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D1ERR         60A  O 22 18
     A*
     A                                 24  4' F1 '
     A                                      DSPATR(RI)
     A                                 24  9'EXIT'
     A                                 24 33' F6 '
     A                                      DSPATR(RI)
     A                                 24 38'Download to csv'
     A                                 24 66' F10 '
     A                                      DSPATR(RI)
     A                                 24 72'INQUIRY'
     A*-------------------------------------
     A*-------------------------------------
     A          R DSP02
     A*%%TS  SD  20250310  115817  I0777       REL-V7R4M0  5770-WDS
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                  1  3'FBCR41A'
     A                                  1 20' ** FORD PO CODE MAINTENANCE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 30'PO CODE'
     A                                      DSPATR(UL)
     A*
     A            D2KBN          8A  O  7 20
     A            D1SHP1         2A  O  7 32TEXT('PLANT ID')
     A                                 11 20'DELIVERY CODE'
     A                                      DSPATR(UL)
     A            D2NONY         4Y 0B 13 24TEXT('DELIVERY CODE')
     A N30                                  DSPATR(CS)
     A  30                                  DSPATR(PR)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            D2KMEI        15A  O 15 24TEXT('FACTORY NAME (KANA)')
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D2ERR         60A  O 22 18
     A*
     A                                 24  4' F3 '
     A                                      DSPATR(RI)
     A                                 24  9'PREV. SCREEN'
     A                                 24 25' F5 '
     A                                      DSPATR(RI)
     A                                 24 30'UPDATE   '
