     A** FBCPW14 *****************************
     A* ..SALES UNIT PRICE MASTER ADDITION.  *
     A*   < EXCEPTIONAL UNIT PRICE >         *
     A*   MSK KUNIEDA          2000.03.27    *
     A***************************** FBCPW14 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R FBCPW141
     A                                      CF01(01)
     A                                      BLINK
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  1 20' * SALES UNIT PRICE MASTER ADDITIO-
     A                                      N * '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'FBCPW14'
      *
     A                                  4  9'EXCEPTIONAL UNIT PRICE'
      *
     A                                  7 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  7 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                  7 30'FACTORY'
     A                                      DSPATR(UL)
     A                                  7 39'DOCK'
     A                                      DSPATR(UL)
     A                                  7 45'   USER PARTS NO.            '
     A                                      DSPATR(UL)
      *
     A            @TOKU          4Y 0B  9 12DSPATR(CS) EDTCDE(Z)
     A  35                                  DSPATR(RI PC)
     A            @NONY          4Y 0B  9 22DSPATR(CS) EDTCDE(Z)
     A  31                                  DSPATR(RI PC)
     A            @NKOJ          1A  B  9 33DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A            @NUKE          4A  B  9 39DSPATR(CS)
     A  33                                  DSPATR(RI PC)
     A            @MHN1          5A  B  9 45DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A                                  9 50'-'
     A            @MHN2          5A  B  9 53DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 59'-'
     A            @MHN3          5A  B  9 61DSPATR(CS)
     A  34                                  DSPATR(RI)
     A                                  9 67'-'
     A            @MHN4          5A  B  9 69DSPATR(CS)
     A  34                                  DSPATR(RI)
      *
     A                                 13  7'* LAST TIME *'
     A                                 15 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                 15 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                 15 30'FACTORY'
     A                                      DSPATR(UL)
     A                                 15 39'DOCK'
     A                                      DSPATR(UL)
     A                                 15 45'   USER PARTS NO.            '
     A                                      DSPATR(UL)
      *
     A            @TOKUD         4A    17 12
     A            @NONYD         4A    17 22
     A            @NKOJD         1A    17 33
     A            @NUKED         4A    17 39
     A            @MHIND        23A    17 45
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        @ERR          60A  O 22 18
      *
     A                                 24  4'EXIT'
     A                                 24  9' CMD-1 '
     A                                      DSPATR(RI)
      *
     A          R FBCPW142
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      BLINK
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A                                  1 20' * SALES UNIT PRICE MASTER ADDITIO-
     A                                      N * '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'FBCPW14'
      *
     A                                  4  9'EXCEPTIONAL UNIT PRICE'
      *
     A                                  7 10'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  7 20'DELIVERY'
     A                                      DSPATR(UL)
     A                                  7 30'FACTORY'
     A                                      DSPATR(UL)
     A                                  7 39'DOCK'
     A                                      DSPATR(UL)
     A                                  7 45'   USER PARTS NO.      '
     A                                      DSPATR(UL)
      *
     A            @TOKU          4Y 0   8 12
     A            @NONY          4Y 0   8 22
     A            @NKOJ          1      8 33
     A            @NUKE          4      8 39
     A            @MHIN         23      8 45
      *
     A                                 10  9' LAST TIME UNIT PRICE -------------
     A                                      ------'
     A                                 11 25'APPLY'
     A                                 11 38'APPLY'
     A                                 12 10'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 12 25'START DATE'
     A                                      DSPATR(UL)
     A                                 12 38'EXIT DATE'
     A                                      DSPATR(UL)
      *
     A  19        @1TNK         10Y 5  13 10EDTWRD('  , 0 .     ')
     A            @1SYMD         8Y 0  13 25EDTWRD('    /  /  ')
     A            @1EYMD         8Y 0  13 38EDTWRD('    /  /  ')
      *
     A                                 16  9' THIS TIME UNIT PRICE -------------
     A                                      ------'
     A                                 17 25'APPLY'
     A                                 17 38'APPLY'
     A                                 18 10'UNIT PRICE'
     A                                      DSPATR(UL)
     A                                 18 25'START DATE'
     A                                      DSPATR(UL)
     A                                 18 38'EXIT DATE'
     A                                      DSPATR(UL)
      *
     A            @2TNK         10Y 5B 19 10EDTWRD('  , 0 .     ')
     A                                      DSPATR(CS)
     A  37                                  DSPATR(RI PC)
     A            @2SYY          4Y 0B 19 25DSPATR(CS)   EDTCDE(Z)
     A  38                                  DSPATR(RI PC)
     A            @2SMM          2Y 0B 19 30DSPATR(CS)   EDTCDE(Z)
     A  38                                  DSPATR(RI PC)
     A            @2SDD          2Y 0B 19 33DSPATR(CS)   EDTCDE(Z)
     A  38                                  DSPATR(RI PC)
     A            @2EYY          4Y 0B 19 38DSPATR(CS)   EDTCDE(Z)
     A  39                                  DSPATR(RI PC)
     A            @2EMM          2Y 0B 19 43DSPATR(CS)   EDTCDE(Z)
     A  39                                  DSPATR(RI PC)
     A            @2EDD          2Y 0B 19 46DSPATR(CS)   EDTCDE(Z)
     A  39                                  DSPATR(RI PC)
      *
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        @ERR          60A  O 21 18
      *
     A                                 24  4'PRV SCREEN'
     A                                 24 16' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE OK'
     A                                 24 34' CMD-5 '
     A                                      DSPATR(RI)
