     A*%%TS  SD  20010813  084749  TEST        REL-V3R7M0  5716-PW1
     A** FCCPW10 ***********************************
     A*  KANBAN M/F LIST                           *
     A*                                            *
     A* DATE  (CODING):K.OKACHI   1997.05.07       *
     A*********************************** FCCPW10 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R FCCPW101
     A*%%TS  SD  20010813  084749  TEST        REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      CF05
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 30'**  KANBAN M/F LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT FCCPW10'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  7 15'MONTH'
     A                                      DSPATR(RI)
     A            #MM            2Y 0B  7 25DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 10 26'RECEIVING CO.'
     A                                      DSPATR(RI)
     A            #NONY          4  0B 12 30DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 10 42'FACTORY'
     A                                      DSPATR(RI)
     A            #KOJ           1A  B 12 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 10 52'DOCK CODE'
     A                                      DSPATR(RI)
     A            #UKE           4A  B 12 54DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  5'EXIT'
     A                                 24 10' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 25' OK  '
     A                                 24 31' CMD-5 '
     A                                      DSPATR(RI)
     A                                 16 15'OPTION'
     A                                      DSPATR(RI)
     A            #OPT           1A  B 16 23DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 10 15'CUSTOMER'
     A                                      DSPATR(RI)
     A            #CUST          4  0B 12 17DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(RI PC)
     A                                 16 27'SORT BY: 1=CUSTOMER/RECEIVING/CUST-
     A                                       PART#'
     A                                 17 36'2=KANBAN#/CUSTOMER/RECEIVING/CUST -
     A                                      PART#'
     A                                 18 36'3=INNER CO.PART#/CUST/RECEIVING'
     A                                 11  5'BLANK=ALL'
