     A*** FCEPW81 ****************************
     A*UPDATE OFNEW PRODUCT PART NUMBER M/F *
     A* H.ITO 89.11.01                       *
     A**************************** FCEPW81 ***
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R FCEPW811
     A*%%TS  SD  19961015  172154  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CF01
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** NEW PRODUCT PART NUMB-
     A                                      ER M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT FCEPW811'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  6 21'UPDATE'
     A                                      DSPATR(RI)
     A            @KOSN          1A  B  8 24DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  6 43'INTRAL CO. PART NO'
     A                                      DSPATR(RI)
     A                                  8 49'-'
     A                                  8 57'-'
     A            @NHN1          5A  B  8 43DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A            @NHN2          5A  B  8 51DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A            @NHN3          2A  B  8 59DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 10 11'< 0 - CANCEL  1 - CHANGE  2 - ADD -
     A                                      >'
     A                                 15 11'LAST TIME'
     A                                      DSPATR(UL)
     A                                 17 20'UPDATE'
     A                                      DSPATR(UL)
     A                                 17 43'INTRAL CO. PART NO'
     A                                      DSPATR(UL)
     A            MKOSN          1A  O 18 20OVRDTA
     A            MKONM          7A  O 18 22OVRDTA
     A            MNHN1          5A  O 18 43OVRDTA
     A  90                             18 49'-'
     A            MNHN2          5A  O 18 51OVRDTA
     A  91                             18 57'-'
     A            MNHN3          2A  O 18 59OVRDTA
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  6'WORK EXIT'
     A                                 24 18'CMD-1'
     A                                      DSPATR(RI)
     A          R FCEPW812
     A*%%TS  SD  19961016  093823  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      CF03
     A                                      CF05
     A                                      CF12
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** NEW PRODUCT PART NUMB-
     A                                      ER M/F UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT FCEPW812'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  4 21'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 43'NEW INTRAL CO. PART NO'
     A                                      DSPATR(UL)
     A            @KOSN          1A  O  5 21OVRDTA
     A            @KONM          7A  O  5 23OVRDTA
     A            @NHIN         14A  O  5 43OVRDTA
     A                                  7  4'CUSTOMER'
     A                                  8  4'CODE     '
     A                                      DSPATR(UL)
     A            @TOKU          4A  B  8 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A            @TONM         16A  O  9 14OVRDTA
     A                                  8 23'MONTHLY SETTING NBR'
     A                                      DSPATR(UL)
     A            @STEI          9Y 0B  8 43DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      CHECK(RB)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                  8 53'DATE OF START PROD'
     A                                      DSPATR(UL)
     A            @THHZ          8Y 0B  8 72DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                 11  4'CAR DIE'
     A                                      DSPATR(UL)
     A            @SKEI          4A  B 11 14DSPATR(CS)
     A                                      OVRDTA
     A                                 11 21'ACCOM QTY'
     A                                      DSPATR(UL)
     A            @SYOS          5Y 0B 11 32DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                 11 40'CONTAINER TYPE'
     A                                      DSPATR(UL)
     A            @SYOT          1A  B 11 56DSPATR(CS)
     A                                      OVRDTA
     A                                 11 60'ANSWER DATE'
     A                                      DSPATR(UL)
     A            @KAHZ          6Y 0B 11 72DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 13  4'POS'
     A                                      DSPATR(UL)
     A                                 14  4'RECEIPT DATE'
     A                                      DSPATR(UL)
     A            @UKHZ          8Y 0B 14 21DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 14 32'INPUT DATE'
     A                                      DSPATR(UL)
     A            @TRHZ          8Y 0B 14 44DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                 14 55'APPOINTMENT DATE'
     A                                      DSPATR(UL)
     A            @SIHZ          6Y 0B 14 72EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  70                                  DSPATR(CS)
     A  70                                  DSPATR(PC)
     A                                 17  4'LOCATION CODE'
     A                                      DSPATR(UL)
     A            @BAN1          1A  B 17 18DSPATR(CS)
     A                                      OVRDTA
     A                                 17 20'-'
     A            @BAN2          2A  B 17 22DSPATR(CS)
     A                                      OVRDTA
     A                                 17 25'-'
     A            @BAN3          2A  B 17 27DSPATR(CS)
     A                                      OVRDTA
     A                                 17 30'-'
     A            @BAN4          1A  B 17 32DSPATR(CS)
     A                                      OVRDTA
     A                                 17 37'OLD INTRAL CO. PART NO'
     A                                      DSPATR(UL)
     A            @OHN1          5A  B 17 60DSPATR(CS)
     A                                      OVRDTA
     A                                 17 66'-'
     A            @OHN2          5A  B 17 68DSPATR(CS)
     A                                      OVRDTA
     A                                 17 74'-'
     A            @OHN3          2A  B 17 76DSPATR(CS)
     A                                      OVRDTA
     A                                 19  4'REMARKS'
     A                                      DSPATR(UL)
     A            @BIKO         38A  B 19 14DSPATR(CS)
     A                                      OVRDTA
     A                                 21  4'IN CHARGE'
     A                                      DSPATR(UL)
     A            @PERS         20A  B   + 1DSPATR(CS)
     A                                      OVRDTA
     A                                 21 39'SHIPMENT DATE OF INITIAL'
     A                                      DSPATR(UL)
     A            @IKHZ          8Y 0B   + 2DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A*
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'KEY INPUT'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE OK'
     A                                 24 35'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 50'APPOINTMENT DATE CHANGE'
     A                                 24 75'CMD-12'
     A                                      DSPATR(RI)
