     A****************************************************************
     A*         uﾇj-ﾒﾇn ﾎﾟﾒ]n ﾈ]jhfﾞx]     ﾌﾞ]kuﾇj-onﾞ...            *
     A*            A-SENGA             1981.10.09                    *
     A****************************************************************
     A                                      CHGINPDFT
     A                                      PRINT(QPRINT)
     A          R FCEPW031
     A                                      CF01(01)
     A                                  1 65'FMT FCEPW031'
     A                                  5 20' **  SELECT OF MASTER LIST  ** '
     A                                      DSPATR(RI UL)
     A                                  8 11'1.'
     A                                      DSPATR(HI)
     A                                  8 16'WHICH SHEET DO YOU SELECT TO PRIN-
     A                                      T THE MASTER LIST?'
     A            YOSI           4A  B 10 18
     A                                      DSPATR(CS HI)
     A                                 10 26'( K6S1,K6H1)'
     A                                 14 11'2.'
     A                                      DSPATR(HI)
     A                                 14 16'HOW MANY PAPERS DO YOU NEED TO PR-
                                            INT THE MASTER LIST?'
     A            BSU            1Y 0B 16 18
     A                                      EDTCDE(Z)
     A                                      DSPATR(CS HI)
     A                                 24 20'CANCEL OF JOB'
     A                                 24 34' CMD-1 '
     A                                      DSPATR(RI)
