     A** FCEPW76 **************************************
     A*  ..PRODUCTION PREPARATIONS FOR NEW PRODUCT..  *
     A*    I-HASADA                       97.08.12    *
     A************************************** FCEPW76 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R FCEPW761
     A                                      CF01
     A                                      CF05
     A                                      BLINK
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 17' ** PRODUCTION PREPARATIONS FOR-
     A                                       NEW PRODUCT ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'FCEPW76'
      *
     A                                  6 34' CAR MODEL NO '
     A                                      DSPATR(RI)
      *
     A            ISKEI          4A  B  8 39DSPATR(CS)
     A  01                                  DSPATR(RI PC)
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 22 18
      *
     A                                 24  4'EXIT'
     A                                 24 13'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'LIST'
     A                                 24 33'CMD-5'
     A                                      DSPATR(RI)
