     A*** FCEPW83 ******************************************
     A*INQUIRY  OF PRODUCT NEW PART NUMBER M/F <DATE OF START PRODUCTION ORDER>
     A*           H.ITO               89.11.07             *
     A****************************************** FCEPW83 ***
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R @SCR1
     A*%%TS  SD  19961114  102957  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      TEXT('HEADER SCREEN -1')
     A                                      SETOF(99)
     A  99                                  ALARM
     A  99                                  PUTOVR
     A                                      CA01
     A                                  1 22'** NEW PRODUCT PART NUMBER M/F INQ-
     A                                      UIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT FCEPW831'
     A                                  2  2'DATE OF START PRODUCTION'
     A                                      DSPATR(RI)
     A            @THYY          4Y 0B  3  2DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                  3  7'-'
     A            @THMM          2Y 0B  3  9DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                  3 12'-'
     A            @THDD          2Y 0B  3 14DSPATR(CS)
     A                                      EDTCDE(Z)
     A  99        ERRMSG        60   M
     A  99                                  OVRDTA
     A                                 24  3'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A          R @SCR2
     A*%%TS  SD  19961114  102957  QSECOFR     REL-V3R0M5  5763-PW1
     A                                      TEXT('HEADER SCREEN 1/1')
     A                                      LOCK
     A                                  1 22'** NEW PRODUCT PART NUMBER M/F INQ-
     A                                      UIRY **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT FCEPW831'
     A                                  2  2'DATE OF START PRODUCTION'
     A                                      DSPATR(RI)
     A            @THYY          4Y 0O  3  2DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                  3  7'-'
     A            @THMM          2Y 0O  3  9DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                  3 12'-'
     A            @THDD          2Y 0O  3 14DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                  4  2'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  4 11'INTRAL PART #   '
     A                                      DSPATR(UL)
     A                                  4 28'SETTING NO/M'
     A                                      DSPATR(UL)
     A                                  4 41'CAR MODEL'
     A                                      DSPATR(UL)
     A                                  4 51'ACCOM QTY'
     A                                      DSPATR(UL)
     A                                  4 61'CONTAINER'
     A                                      DSPATR(UL)
     A                                  4 71'LOC CODE'
     A                                      DSPATR(UL)
     A*
     A          R SFLREC                    SFL
     A                                      TEXT('SUB FILE RECORD')
     A            F1TOKU         4Y 0O  5  3
     A  88                                  DSPATR(RI)
     A            F1SHIN        14   O  5 12
     A            F1STEI         9Y 0O  5 29EDTCDE(1)
     A            F1SKEI         4   O  5 44
     A            F1SYOS         5Y 0O  5 52EDTCDE(1)
     A            F1SYOT         1   O  5 63
     A            F1TKRO         9   O  5 68
     A*
     A          R SFLCTL                    SFLCTL(SFLREC)
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0019)
     A                                      TEXT('SUB FILE CONTROL RECORD')
     A                                      OVERLAY
     A  99                                  PUTOVR
     A  99                                  ALARM
     A                                      SETOF(94)
     A                                      SETOF(99)
     A                                      CA01
     A                                      CA02
     A                                      SFLRNA
     A  98                                  SFLDSPCTL
     A  97                                  SFLDSP
     A  96                                  SFLCLR
     A  95                                  SFLINZ
     A  94                                  SFLEND
     A                                      ROLLUP(91)
     A                                      ROLLDOWN(92)
     A                                 24  3'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 18'FIRST SCREEN'
     A                                 24 31'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 39' NEXT PAGE'
     A                                 24 52'RL-UP'
     A                                      DSPATR(RI)
     A                                 24 58' PREVIOUS PAGE'
     A                                 24 73'RL-DN'
     A                                      DSPATR(RI)
     A  99        ERRMSG        60   M
     A  99                                  OVRDTA
