     A*%%TS  SD  20011016  081723  TEST        REL-V3R7M0  5716-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01(01)
     A                                      CF05(05)
     A          R DSP01
     A*%%TS  SD  20011016  081723  TEST        REL-V3R7M0  5716-PW1
     A                                  1 27'** SERVICE PARTS LIST **'
     A                                      DSPATR(RI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1  3'FCEC61'
     A                                  5 21'OPTION:' DSPATR(HI)
     A            D@OPT          1   B  5 30DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A                                  7 26'1. BY PART#'
     A                                      DSPATR(HI)
     A                                  8 26'2. BY LOCATION CODE'
     A                                      DSPATR(HI)
     A                                 23  3'F1:END    F5:PRINT'
