     A*%%TS  SD  20030814  152745  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20030814  152745  TEST        REL-V4R4M0  5769-PW1
     A            #PGM           8   O  1  2
     A                                  1 21'** PARTS LIST BY MACHINE#/LOCATION-
     A                                       **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5 20'OPTION 1:' DSPATR(HI)
     A            D@OP11         1   B  5 31DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A                                  5 34'BY MACHINE #' DSPATR(HI)
     A            D@OP12         1   B  6 31DSPATR(CS)
     A  61                                  DSPATR(RI)
     A                                  6 34'BY LOCATION#' DSPATR(HI)
     A                                  9 20'OPTION 2:' DSPATR(HI)
     A            D@HD           1   B  9 31DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A                                  9 34'HD' DSPATR(HI)
     A            D@RL           1   B 10 31DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                 10 34'RL' DSPATR(HI)
     A            D@ST           1   B 11 31DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                 11 34'ST' DSPATR(HI)
     A            D@ALL          1   B 12 31DSPATR(CS)
     A  62                                  DSPATR(RI)
     A                                 12 34'ALL' DSPATR(HI)
     A                                 23  4'F1:END     F5:PRINT'
