     A** FCHPW31 *******************
     A* ..MACHINE ABILITY M/F UPDATE .. *
     A* I-HASADA 89.02.23 *
     A******************* FCHPW31 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R FCHPW311
     A*%%TS  SD  19961114  134935  MIKA        REL-V3R0M5  5763-PW1
     A                                      TEXT('MACHINE ABILITY M/F UPDATE')
     A  99                                  ALARM
     A                                      CF01
     A                                  1 23' MACHINE ABILITY M/F UPDATE'
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A                                  1 68'FMT FCHPW311'
     A                                  6 25'UPDATE'
     A                                      DSPATR(UL)
     A                                  6 35'SECTION'
     A                                      DSPATR(UL)
     A                                  6 45'MACHINE NO'
     A                                      DSPATR(UL)
     A            MENT           1A  B  8 26DSPATR(CS)
     A            BMON           4Y 0B  8 35DSPATR(CS)
     A                                      EDTCDE(Z)
     A            KBAN           3A  B  8 45DSPATR(CS)
     A                                  9 26'| '
     A                                 10 30'+-UPDATE INSTRUCTION-+   '
     A                                 11 30'| 0 = CANCEL .'
     A                                 12 30'| 1 = CHANGE .'
     A                                 13 30'| 2 = ADD .'
     A                                 14 30'+--------------------+'
     A                                 17  8'WHEN UPDATE PLEASE INFORM IT TO ED-
     A                                      P SEC, DIRECT LINE MACHINE...'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18DSPATR(HI)
     A                                 24 10'CANCEL'
     A                                 24 17'CMD-1'
     A                                      DSPATR(RI)
     A                                 11 51'|'
     A                                 12 51'|'
     A                                 13 51'|'
     A                                 10 26'+->'
     A*
     A          R FCHPW312
     A*%%TS  SD  19961114  134935  MIKA        REL-V3R0M5  5763-PW1
     A                                      TEXT('MACHINE ABILITY M/F UPDATE')
     A  99                                  ALARM
     A                                      CF03
     A                                      CF05
     A                                      CF10
     A                                  1 23' MACHINE ABILITY M/F UPDATE'
     A                                      DSPATR(UL)
     A                                      DSPATR(RI)
     A                                  1 68'FMT FCHPW312'
     A                                  2  2'UPDATE'
     A                                      DSPATR(UL)
     A            MENT           1A  O  2 13
     A            CMT            4A  O  2 18DSPATR(HI)
     A                                  4  2'SECTION'
     A                                      DSPATR(UL)
     A            BMON           4Y 0O  3 13DSPATR(HI)
     A            BMEI          10A  O  3 18
     A                                  3  2'MACHINE NO'
     A                                      DSPATR(UL)
     A            KBAN           3A  O  4 13DSPATR(HI)
     A N04N03                           4 26'UPDATE DATE'
     A N04N03     KHIZK          8Y 0O  4 38EDTWRD('    .  .  ')
     A N04N03                           4 55'UPDATE PERSON'
     A N04N03     M8KMEI        10A  O  4 69
     A                                  6  2'IN CHARGE .TEAM'
     A                                      DSPATR(UL)
     A                                  6 18'PROC'
     A                                      DSPATR(UL)
     A                                  6 23'SIZE'
     A                                      DSPATR(UL)
     A                                  6 30'NOMINAL LENGTH .RANGE'
     A                                      DSPATR(UL)
     A                                  6 54'MCH TURN NBR'
     A                                      DSPATR(UL)
     A                                  6 71'MCH GROUP'
     A                                      DSPATR(UL)
     A                                  7 35'MIN - MAX'
     A                                  7 52'HIGH'
     A                                  7 64'LOW'
     A            M8KKR1         1A  B  8  2DSPATR(CS)
     A                                  8  4'-'
     A            M8KKR2         1A  B  8  6DSPATR(CS)
     A                                  8  8'-'
     A            M8KKR3         1A  B  8 10DSPATR(CS)
     A            M8KOTE         3A  B  8 18DSPATR(CS)
     A            M8SAIZ         5Y 2B  8 23EDTCDE(4)
     A                                      DSPATR(CS)
     A            M8KMIN         3Y 0B  8 35EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                  8 39'-'
     A            M8KMAX         3Y 0B  8 41EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            M8SPDI         5Y 0B  8 52EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            M8SPCY         5Y 0B  8 58EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            M8SPSY         5Y 0B  8 64EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A            M8GRUP         3A  B  8 71DSPATR(CS)
     A                                 10  3'L O T COEFFICIENT   '
     A                                      DSPATR(UL)
     A                                 10 44'STANDARD COEFFICIENT   '
     A                                      DSPATR(UL)
     A                                 11  3'0- 1'
     A                                 11 11'1- 3'
     A                                 11 19'4-10'
     A                                 11 27'11-25'
     A                                 11 35'26-99'
     A                                 11 44'0- 1'
     A                                 11 52'1- 3'
     A                                 11 60'4-10'
     A                                 11 68'11-25'
     A                                 11 76'26-99'
     A            M8LOT1         4Y 2B 12  3DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8LOT2         4Y 2B 12 11DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8LOT3         4Y 2B 12 19DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8LOT4         4Y 2B 12 27DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8LOT5         4Y 2B 12 35DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8ANZ1         4Y 2B 12 44DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8ANZ2         4Y 2B 12 52DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8ANZ3         4Y 2B 12 60DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8ANZ4         4Y 2B 12 68DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            M8ANZ5         4Y 2B 12 76DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                 14  2'PURCHANCE'
     A                                      DSPATR(UL)
     A                                 14 12'MACHINE'
     A                                      DSPATR(UL)
     A                                 14 24'MACHINE'
     A                                      DSPATR(UL)
     A                                 14 35'MCH YEAR TYPE'
     A                                      DSPATR(UL)
     A                                 14 50'OPERATION'
     A                                      DSPATR(UL)
     A                                 14 60'SETUP'
     A                                      DSPATR(UL)
     A                                 14 70'MCH CHARGE'
     A                                      DSPATR(UL)
     A                                 15 39'YYYY : MM'
     A                                 15 60'HH : MM'
     A                                 15 70'DAY   NIGHT'
     A            M8KONY         4Y 0B 16  2DSPATR(CS)
     A                                      CHECK(M11)
     A                                      EDTCDE(Z)
     A            M8KINO        10A  B 16 12DSPATR(CS)
     A            M8KSIK        10A  B 16 24DSPATR(CS)
     A            M8SEYY         4Y 0B 16 39DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 16 44':'
     A            M8SEMM         2Y 0B 16 46DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8KADO         5Y 2B 16 50DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                 16 57'%'
     A            M8DNJJ         2Y 0B 16 60DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 16 63':'
     A            M8DNMM         2Y 0B 16 65DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8TANH         4A  B 16 70DSPATR(CS)
     A            M8TANY         4A  B 16 76DSPATR(CS)
     A                                 18  2'SETTING TIME'
     A                                      DSPATR(UL)
     A                                 18 15'PRODUCTION'
     A                                      DSPATR(UL)
     A                                 18 28'FIXED'
     A                                      DSPATR(UL)
     A                                 18 47'DESERVED'
     A                                      DSPATR(UL)
     A                                 18 60'DESERVED'
     A                                      DSPATR(UL)
     A                                 18 73'ABILITY'
     A                                      DSPATR(UL)
     A                                 19  2'HH : MM'
     A                                 19 47'PART'
     A                                      DSPATR(UL)
     A            M8STHH         2Y 0B 20  2DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 20  5':'
     A            M8STSS         2Y 0B 20  7DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8SESU         9Y 0B 20 15DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8TOR1         3A  B 20 27DSPATR(CS)
     A                                 20 31'-'
     A            M8TOR2         3A  B 20 33DSPATR(CS)
     A            M8HKAT         3Y 0B 20 47
     A  07                                  DSPATR(CS)
     A  07                                  DSPATR(PC)
     A N07                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8NAIJ         9Y 0B 20 60
     A  07                                  DSPATR(CS)
     A N07                                  DSPATR(PR)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A            M8NORY         5Y 2B 20 73
     A  07                                  DSPATR(CS)
     A N07                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                 20 80'%'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 17DSPATR(HI)
     A                                 24  2'KEY INPUT'
     A                                 24 12'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 20'UPDATE OK'
     A                                 24 30'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 44'SETTING NUMBER CHANGE'
     A                                 24 68'CMD-10'
     A                                      DSPATR(RI)
     A                                  7 58'MED'
     A                                 15  2'POINT'
     A                                      DSPATR(UL)
     A                                 15 12'MAKER'
     A                                      DSPATR(UL)
     A                                 15 24'FORM-NO'
     A                                      DSPATR(UL)
     A                                 19 15'QUANTITY'
     A                                      DSPATR(UL)
     A                                 19 26'ASSETS-NO'
     A                                      DSPATR(UL)
     A                                 19 60'SETTING NBR'
     A                                      DSPATR(UL)
     A                                 15 50'RATE'
     A                                      DSPATR(UL)
