     A**FCKPW11********************************************
     A* ...  ARRIVAL M/F BY SUPPLIER ... DISPLAY DEVICE FILE *
     A*           I-HASADA                 82.11.19       *
     A********************************************FCKPW11**
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A*--------------------------*
     A* ...SCREEN 1... *
     A*--------------------------*
     A          R FCKPW111
     A*%%TS  SD  19961114  133136  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('ARRIVAL M/F BY SUPPLIER ..1..-
     A                                      ')
     A                                      CF01
     A*****                                 CF07
     A                                  1  3TIME
     A                                  1 27'**ARRIVAL M/F BY SUPPLIER**'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 65'DATE'
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  5 30'UPDATE'
     A                                      DSPATR(RI)
     A                                  5 41'SUPPLIER'
     A                                      DSPATR(RI)
     A                                  7 17'............'
     A            L4KOSN         1A  B  7 33DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            L4WSIR         4A  B  7 43DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                  8 17'. 0-CANCEL .    .'
     A                                  9 17'. 1-CHANGE .<....'
     A                                 10 17'. 2-ADD    .'
     A                                 11 17'............'
     A  99                             22  8'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        L4MSG         65A  O 22 16
     A                                 24 16'UPDATE EXIT'
     A                                 24 29'CMD-1'
     A                                      DSPATR(RI)
     A******                           24 44'PURCHASING KANBAN M/F'
     A******                           24 67'CMD-7'
     A******                                DSPATR(RI)
     A*--------------------------*
     A* ...SCREEN 2... *
     A*--------------------------*
     A          R FCKPW112
     A*%%TS  SD  19961114  133136  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('ARRIVAL M/F BY SUPPLIER ..2..-
     A                                      ')
     A                                      CF03
     A                                      CF05
     A N03                              1  2'IN CHARGE'
     A N03        L4TANT        10A  O  1 12
     A                                  1 28'*ARRIVAL M/F BY SUPPLIER*'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A N03                              1 54'LAST INPUT DATE'
     A N03        L4KOHZ         8Y 0O  1 70EDTWRD('    .  .  ')
     A                                  4 13'UPDATE'
     A                                      DSPATR(UL)
     A            L4KOSN         1A  O  4 21
     A            L4NAME         4A  O  4 23
     A                                  4 30'SUPPLIER'
     A                                      DSPATR(UL)
     A            L4WSIR         4A  O  4 40
     A            L4SRNM        15A  O  4 45
     A                                  5  2'                                  -
     A                                                                         -
     A                                               '
     A                                      DSPATR(UL)
     A                                  7 14'KANBAN FACTORY NAME'
     A                                      DSPATR(RI)
     A                                  7 35'DELIVERY DAY IN A WEEK'
     A                                      DSPATR(RI)
     A                                  7 62'CYCLE'
     A                                      DSPATR(RI)
     A            L4KJNM         8A  B  9 20DSPATR(CS)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A            L4MOND         1A  B  9 38DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            L4TUED         1A  B  9 42DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            L4WEND         1A  B  9 46DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            L4THUD         1A  B  9 50DSPATR(CS)
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(PC)
     A            L4FRID         1A  B  9 54DSPATR(CS)
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(PC)
     A            L4SKR1         2A  B  9 59DSPATR(CS)
     A                                      CHECK(RZ)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                  9 62':'
     A            L4SKR2         2A  B  9 64DSPATR(CS)
     A                                      CHECK(RZ)
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(PC)
     A                                  9 67':'
     A            L4SKR3         2A  B  9 69DSPATR(CS)
     A                                      CHECK(RZ)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 10 37'MON'
     A                                 10 41'TUE'
     A                                 10 45'WEN'
     A                                 10 49'THU'
     A                                 10 53'FRI'
     A                                 12 10'L.T SAFETY L.T = TOTAL'
     A                                 12 37'DELIVERY TIME (1)'
     A                                      DSPATR(RI)
     A                                 12 60'DELIVERY TIME (2)'
     A                                      DSPATR(RI)
     A            L4LTM1         3Y 1B 14 10DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            L4LTM2         3Y 1B 14 18DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A                                 14 25'='
     A            L4TOTL         3Y 1O 14 28EDTCDE(4)
     A            L4TIM1         4Y 0B 14 43DSPATR(CS)
     A                                      EDTCDE(Z)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            L4TIM2         4Y 0B 14 66DSPATR(CS)
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                 17 29'RECEIVING'
     A                                      DSPATR(RI)
     A                                 17 39'PROVISION POINT'
     A                                      DSPATR(RI)
     A            L4UKER         4A  B 19 32DSPATR(CS)
     A            L4WSKU         4A  B 19 44DSPATR(CS)
     A  99                             22  8'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        L4MSG         65A  O 22 16
     A                                 24 16'RETURNS TO KEY INPUT'
     A                                 24 38'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 47'UPDATE OK'
     A                                 24 58'CMD-5'
     A                                      DSPATR(RI)
