     A** FCQPW36 ***************************
     A*REFERENCE TO THE DIE SPECIFICATION MASTER*
     A*     I-HASADA          91.04.06     *
     A*     GBC             2002.04.20   MARK 5 => 8
     A*************************** FCQPW36 **
.    A*                                     PRINT(70)
.    A                                      PRINT(71)
     A                                      CHGINPDFT
      *
     A          R FCQPW361                  CF01 CF02 BLINK
     A                                  1  2'DIE NO ' DSPATR(RI)
     A            KACD           2   B  1 11DSPATR(CS)
     A  19                                  DSPATR(RI PC)
     A            O9KANM        20   O  2  8
     A                                  1 27'*REFERENCE TO DIE HANDLING MASTER*'
     A                                      DSPATR(RI UL)
     A                                  1 72'FCQPW36'
      *
     A N81                              3  2'FIGURE(XXX.XX) '
     A N82                             13  2'CHARACTER(5DIGITS)'
.    A N84                             17 22'CHARACTER(8DIGITS)'
.    A N83                             17 50'CHARACTER(10DIGITS)'
      *
     A            NN01          18   O  4  2DSPATR(UL)
     A  51                                  DSPATR(ND)
     A            NN02          18   O  4 22DSPATR(UL)
     A  52                                  DSPATR(ND)
     A            NN03          18   O  4 42DSPATR(UL)
     A  53                                  DSPATR(ND)
     A            NN04          18   O  4 62DSPATR(UL)
     A  54                                  DSPATR(ND)
     A            NN05          18   O  7  2DSPATR(UL)
     A  55                                  DSPATR(ND)
     A            NN06          18   O  7 22DSPATR(UL)
     A  56                                  DSPATR(ND)
     A            NN07          18   O  7 42DSPATR(UL)
     A  57                                  DSPATR(ND)
     A            NN08          18   O  7 62DSPATR(UL)
     A  58                                  DSPATR(ND)
     A            NN09          18   O 10  2DSPATR(UL)
     A  59                                  DSPATR(ND)
     A            NN10          18   O 10 22DSPATR(UL)
     A  60                                  DSPATR(ND)
     A            NN11          18   O 10 42DSPATR(UL)
     A  61                                  DSPATR(ND)
     A            NN12          18   O 10 62DSPATR(UL)
     A  62                                  DSPATR(ND)
     A            NN13          18   O 14  2DSPATR(UL)
     A  63                                  DSPATR(ND)
     A            NN14          18   O 14 22DSPATR(UL)
     A  64                                  DSPATR(ND)
     A            NN15          18   O 14 42DSPATR(UL)
     A  65                                  DSPATR(ND)
     A            NN16          18   O 14 62DSPATR(UL)
     A  66                                  DSPATR(ND)
     A            NN17          18   O 18  2DSPATR(UL)
     A  67                                  DSPATR(ND)
.     *
.    A            NN20          26   O 18 22DSPATR(UL)
.    A  70                                  DSPATR(ND)
.     *
.    A            NN18          26   O 18 50DSPATR(UL)
.    A  68                                  DSPATR(ND)
.    A            NN19          26   O 20 50DSPATR(UL)
.    A  69                                  DSPATR(ND)
      *
     A N51        SU01A          5Y 2B  5  3DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  01                                  DSPATR(RI)
     A N99
     AO 42                                  DSPATR(PC)
     A N51                              5 10'- '
     A N51        SU01B          5Y 2B  5 13DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  21                                  DSPATR(RI PC)
      *
     A N52        SU02A          5Y 2B  5 23DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  02                                  DSPATR(RI PC)
     A N52                              5 30'- '
     A N52        SU02B          5Y 2B  5 33DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  22                                  DSPATR(RI PC)
      *
     A N53        SU03A          5Y 2B  5 43DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  03                                  DSPATR(RI PC)
     A N53                              5 50'- '
     A N53        SU03B          5Y 2B  5 53DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  23                                  DSPATR(RI PC)
      *
     A N54        SU04A          5Y 2B  5 63DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  04                                  DSPATR(RI PC)
     A N54                              5 70'- '
     A N54        SU04B          5Y 2B  5 73DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  24                                  DSPATR(RI PC)
      *
     A N55        SU05A          5Y 2B  8  3DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  05                                  DSPATR(RI PC)
     A N55                              8 10'- '
     A N55        SU05B          5Y 2B  8 13DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  25                                  DSPATR(RI PC)
      *
     A N56        SU06A          5Y 2B  8 23DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  06                                  DSPATR(RI PC)
     A N56                              8 30'- '
     A N56        SU06B          5Y 2B  8 33DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  26                                  DSPATR(RI PC)
      *
     A N57        SU07A          5Y 2B  8 43DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  07                                  DSPATR(RI PC)
     A N57                              8 50'- '
     A N57        SU07B          5Y 2B  8 53DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  27                                  DSPATR(RI PC)
      *
     A N58        SU08A          5Y 2B  8 63DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  08                                  DSPATR(RI PC)
     A N58                              8 70'- '
     A N58        SU08B          5Y 2B  8 73DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  28                                  DSPATR(RI PC)
      *
     A N59        SU09A          5Y 2B 11  3DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  09                                  DSPATR(RI PC)
     A N59                             11 10'- '
     A N59        SU09B          5Y 2B 11 13DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  29                                  DSPATR(RI PC)
      *
     A N60        SU10A          5Y 2B 11 23DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  10                                  DSPATR(RI PC)
     A N60                             11 30'- '
     A N60        SU10B          5Y 2B 11 33DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  30                                  DSPATR(RI PC)
      *
     A N61        SU11A          5Y 2B 11 43DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  11                                  DSPATR(RI PC)
     A N61                             11 50'- '
     A N61        SU11B          5Y 2B 11 53DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  31                                  DSPATR(RI PC)
      *
     A N62        SU12A          5Y 2B 11 63DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  12                                  DSPATR(RI PC)
     A N62                             11 70'- '
     A N62        SU12B          5Y 2B 11 73DSPATR(CS) EDTCDE(4) AUTO(RAB)
     A  32                                  DSPATR(RI PC)
      *
     A N63        AL01A          5   B 15  3DSPATR(CS)
     A  13                                  DSPATR(RI PC)
     A N63                             15 10'- '
     A N63        AL01B          5   B 15 13DSPATR(CS)
     A  33                                  DSPATR(RI PC)
      *
     A N64        AL02A          5   B 15 23DSPATR(CS)
     A  14                                  DSPATR(RI PC)
     A N64                             15 30'- '
     A N64        AL02B          5   B 15 33DSPATR(CS)
     A  34                                  DSPATR(RI PC)
      *
     A N65        AL03A          5   B 15 43DSPATR(CS)
     A  15                                  DSPATR(RI PC)
     A N65                             15 50'- '
     A N65        AL03B          5   B 15 53DSPATR(CS)
     A  35                                  DSPATR(RI PC)
      *
     A N66        AL04A          5   B 15 63DSPATR(CS)
     A  16                                  DSPATR(RI PC)
     A N66                             15 70'- '
     A N66        AL04B          5   B 15 73DSPATR(CS)
     A  36                                  DSPATR(RI PC)
      *
     A N67        AL05A          5   B 19  3DSPATR(CS)
     A  17                                  DSPATR(RI PC)
     A N67                             19 10'- '
     A N67        AL05B          5   B 19 13DSPATR(CS)
     A  37                                  DSPATR(RI PC)
.     *
.    A N70        ALFA3          8   B 19 25DSPATR(CS)
.    A  40                                  DSPATR(RI PC)
.    A N70                             19 34'- '
.    A N70        ALFB3          8   B 19 37DSPATR(CS)
.    A  40                                  DSPATR(RI PC)
.     *
.    A N68        ALFA1         10   B 19 51DSPATR(CS)
.    A  18                                  DSPATR(RI PC)
.    A N68                             19 62'- '
.    A N68        ALFB1         10   B 19 65DSPATR(CS)
.    A  38                                  DSPATR(RI PC)
.     *
.    A N69        ALFA2         10   B 21 51DSPATR(CS)
.    A  19                                  DSPATR(RI PC)
.    A N69                             21 62'- '
.    A N69        ALFB2         10   B 21 65DSPATR(CS)
.    A  39                                  DSPATR(RI PC)
      *
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        ERR           60   O 22 18
      *
     A                                 24 24'DIE NO. BLOCK NO. NAME SCREEN'
     A                                 24 54' CMD-2 ' DSPATR(RI)
     A                                 24  4'CANCEL'
     A                                 24 15' CMD-1 ' DSPATR(RI)
      *
     A          R FCQPW362                  CF01 CF03 ROLLUP(98) ROLLDOWN(97)
     A                                      BLINK
     A                                  2 25'DIE NO.' DSPATR(RI)
     A            KACD           2   O  2 33
     A            O9KANM        20   O  2 36
     A                                  1 27'*REFERENCE TO DIE HANDLING MASTER*'
     A                                      DSPATR(RI UL)
     A                                  1 72'FCQPW36'
      *
     A                                  2  2'*->ORDINARY KANBAN'
      *
     A                                  3  3'NEW DIE NO' DSPATR(UL)
     A                                  3 14'OLD DIE NO    ' DSPATR(UL)
     A N51        NA01          10   O  3 30DSPATR(UL)
     A N52        NA02          10   O  3 42DSPATR(UL)
     A N53        NA03          10   O  3 54DSPATR(UL)
     A N54        NA04          10   O  3 66DSPATR(UL)
      *
     A            KBN01          1   O  4  2
     A            KBN02          1   O  5  2
     A            KBN03          1   O  6  2
     A            KBN04          1   O  7  2
     A            KBN05          1   O  8  2
     A            KBN06          1   O  9  2
     A            KBN07          1   O 10  2
     A            KBN08          1   O 11  2
     A            KBN09          1   O 12  2
     A            KBN10          1   O 13  2
     A            KBN11          1   O 14  2
     A            KBN12          1   O 15  2
     A            KBN13          1   O 16  2
     A            KBN14          1   O 17  2
     A            KBN15          1   O 18  2
     A            KBN16          1   O 19  2
     A            KBN17          1   O 20  2
      *
     A            NEW01          7   O  4  4
     A            NEW02          7   O  5  4
     A            NEW03          7   O  6  4
     A            NEW04          7   O  7  4
     A            NEW05          7   O  8  4
     A            NEW06          7   O  9  4
     A            NEW07          7   O 10  4
     A            NEW08          7   O 11  4
     A            NEW09          7   O 12  4
     A            NEW10          7   O 13  4
     A            NEW11          7   O 14  4
     A            NEW12          7   O 15  4
     A            NEW13          7   O 16  4
     A            NEW14          7   O 17  4
     A            NEW15          7   O 18  4
     A            NEW16          7   O 19  4
     A            NEW17          7   O 20  4
      *
     A            OLD01         15   O  4 13
     A            OLD02         15   O  5 13
     A            OLD03         15   O  6 13
     A            OLD04         15   O  7 13
     A            OLD05         15   O  8 13
     A            OLD06         15   O  9 13
     A            OLD07         15   O 10 13
     A            OLD08         15   O 11 13
     A            OLD09         15   O 12 13
     A            OLD10         15   O 13 13
     A            OLD11         15   O 14 13
     A            OLD12         15   O 15 13
     A            OLD13         15   O 16 13
     A            OLD14         15   O 17 13
     A            OLD15         15   O 18 13
     A            OLD16         15   O 19 13
     A            OLD17         15   O 20 13
      *
     A            AA01          10   O  4 30
     A            AA02          10   O  5 30
     A            AA03          10   O  6 30
     A            AA04          10   O  7 30
     A            AA05          10   O  8 30
     A            AA06          10   O  9 30
     A            AA07          10   O 10 30
     A            AA08          10   O 11 30
     A            AA09          10   O 12 30
     A            AA10          10   O 13 30
     A            AA11          10   O 14 30
     A            AA12          10   O 15 30
     A            AA13          10   O 16 30
     A            AA14          10   O 17 30
     A            AA15          10   O 18 30
     A            AA16          10   O 19 30
     A            AA17          10   O 20 30
      *
     A            BB01          10   O  4 42
     A            BB02          10   O  5 42
     A            BB03          10   O  6 42
     A            BB04          10   O  7 42
     A            BB05          10   O  8 42
     A            BB06          10   O  9 42
     A            BB07          10   O 10 42
     A            BB08          10   O 11 42
     A            BB09          10   O 12 42
     A            BB10          10   O 13 42
     A            BB11          10   O 14 42
     A            BB12          10   O 15 42
     A            BB13          10   O 16 42
     A            BB14          10   O 17 42
     A            BB15          10   O 18 42
     A            BB16          10   O 19 42
     A            BB17          10   O 20 42
      *
     A            CC01          10   O  4 54
     A            CC02          10   O  5 54
     A            CC03          10   O  6 54
     A            CC04          10   O  7 54
     A            CC05          10   O  8 54
     A            CC06          10   O  9 54
     A            CC07          10   O 10 54
     A            CC08          10   O 11 54
     A            CC09          10   O 12 54
     A            CC10          10   O 13 54
     A            CC11          10   O 14 54
     A            CC12          10   O 15 54
     A            CC13          10   O 16 54
     A            CC14          10   O 17 54
     A            CC15          10   O 18 54
     A            CC16          10   O 19 54
     A            CC17          10   O 20 54
      *
     A            DD01          10   O  4 66
     A            DD02          10   O  5 66
     A            DD03          10   O  6 66
     A            DD04          10   O  7 66
     A            DD05          10   O  8 66
     A            DD06          10   O  9 66
     A            DD07          10   O 10 66
     A            DD08          10   O 11 66
     A            DD09          10   O 12 66
     A            DD10          10   O 13 66
     A            DD11          10   O 14 66
     A            DD12          10   O 15 66
     A            DD13          10   O 16 66
     A            DD14          10   O 17 66
     A            DD15          10   O 18 66
     A            DD16          10   O 19 66
     A            DD17          10   O 20 66
      *
     A            WID            1   B 21  3DSPATR(CS) VALUES('1' '0' ' ')
     A                                 21  5'-->'
     A                                 21  9'1-SHIFT 1 ITEM TO LEFT'
     A                                 21 33'0-SHIFT 1 ITEM TO RIGHT'
      *
     A                                 21 59'NUMBER OF DATA' DSPATR(RI)
     A            KENS           5Y 0O 21 74DSPATR(BL) EDTCDE(1)
      *
     A  99                             22 11'ERROR' DSPATR(RI BL)
     A  99        ERR           60   O 22 18
      *
     A                                 23  4'EXIT'
     A                                 23  9'CMD-1' DSPATR(RI)
     A                                 23 15','
     A                                 23 17'KEY INPUT'
     A                                 23 27'CMD-3' DSPATR(RI)
     A                                 23 33','
     A                                 23 35'BACKWARD '
     A                                 23 45'ROLL-DWN' DSPATR(RI)
     A                                 23 54','
     A                                 23 56'FORWARD'
     A                                 23 65'ENTER.ROOL-UP' DSPATR(RI)
      *
     A          R SFLREC                    SFL
     A            SFKBN          1   H
     A            SFNEW          7   O  4  2
     A            SFOLD         15   H
     A            SF01          10   H
     A            SF02          10   H
     A            SF03          10   H
     A            SF04          10   H
     A            SF05          10   H
     A            SF06          10   H
     A            SF07          10   H
     A            SF08          10   H
     A            SF09          10   H
     A            SF10          10   H
     A            SF11          10   H
      *
     A          R SFLCTL                    SFLCTL(SFLREC)
     A                                      SFLPAG(17)  SFLSIZ(18)
     A  91                                  SFLDSP SFLDSPCTL
     A  92                                  SFLCLR
