     A** FIXDTAD ***************************************************************
     A*  RECREATING SOURCE FOR DISPLAY FILE FOR FIXDTA COMMAND                 *
     A*  LEC, JW    2024/08/23
     A*
     A**************************************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*****************************************************************
     A*
     A          R DSP0
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      OVERLAY
     A                                      CF03
     A                                      CF05
     A                                      CF08
     A                                      CF09
     A                                      CF12
     A                                      CF15
     A                                      CF24

     A            $FILIB        21A  O  1  7DSPATR(HI)
     A            $MBR          10A  O  1 36DSPATR(HI)
     A                                  4  7'@@@@        @@      @@@@@@@@@@'
     A                                  5  7'@@  @@      @@    @@          @@'
     A                                  6  7'@@   @@     @@    @@          @@'
     A                                  7  7'@@    @@    @@    @@          @@'
     A                                  8  7'@@     @@   @@    @@          @@'
     A                                  9  7'@@      @@  @@    @@          @@'
     A                                 10  7'@@        @@@@      @@@@@@@@@@'
     A                                 13  7'@@@@@@@@@@@@           @@@@       -
     A                                        @@@@@@@@@@@@          @@@@'
     A                                 14  7'@@          @@       @@    @@     -
     A                                             @@             @@    @@'
     A                                 15  7'@@          @@     @@        @@   -
     A                                             @@           @@        @@'
     A                                 16  7'@@          @@     @@@@@@@@@@@@   -
     A                                             @@           @@@@@@@@@@@@'
     A                                 17  7'@@          @@     @@        @@   -
     A                                             @@           @@        @@'
     A                                 18  7'@@          @@     @@        @@   -
     A                                             @@           @@        @@'
     A                                 19  7'@@@@@@@@@@@@       @@        @@   -
     A                                             @@           @@        @@'
     A                                  1  2'File'
     A                                  1 32'Mbr'
      *************************************************************
      *
     A          R DSP0X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A  99                                  DSPATR(HI)
     A*************************************************************
     A*
     A          R DSP1
     A                                      OVERLAY
     A                                      CHGINPDFT
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF13
     A                                      CF14
     A                                      CF15
     A                                      CF16
     A                                      CF17
     A                                      CF18
     A                                      CF19
     A                                      CF20
     A                                      CF21
     A                                      CF22
     A                                      CF23
     A                                      CF24
     A            $FILIB        21A  O  1  7DSPATR(HI)
     A            $MBR          10A  O  1 36DSPATR(HI)
     A            $RECL          4Y 0O  1 58DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $MODE         14A  O  1 63DSPATR(HI)
     A            $RRN           7Y 0B  2 13EDTCDE(Z)
     A                                      DSPATR(UL)
     A  50                                  DSPATR(PR)
     A            $WIN           4Y 0B  2 26EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCAN         30A  B  2 38
     A                                      DSPATR(UL)
     A            $SCLN          2Y 0B  2 74EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCKB          1A  B  2 79VALUES(' ' 'H')
     A                                      DSPATR(UL)
     A            $KEY          62A  B  3 13
     A                                      DSPATR(UL)
     A            $KYKB          1A  B  3 79VALUES(' ' 'K')
     A                                      DSPATR(UL)
     A  52                                  DSPATR(ND)
     A            $HDR           7A  O  4  2DSPATR(HI)
     A                                      DSPATR(UL)
     A            $TTL          70A  O  4 10DSPATR(HI)
     A******
     A            $NO01          7Y 0O  5  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT01         70A  B  5 10
     A  21                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO02          7Y 0O  6  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT02         70A  B  6 10
     A  22                                  DSPATR(PR)
     A******
     A            $NO03          7Y 0O  7  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT03         70A  B  7 10
     A  23                                  DSPATR(PR)
     A******
     A            $NO04          7Y 0O  8  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT04         70A  B  8 10
     A  24                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO05          7Y 0O  9  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT05         70A  B  9 10
     A  25                                  DSPATR(PR)
     A******
     A            $NO06          7Y 0O 10  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT06         70A  B 10 10
     A  26                                  DSPATR(PR)
     A******
     A            $NO07          7Y 0O 11  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT07         70A  B 11 10
     A  27                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO08          7Y 0O 12  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT08         70A  B 12 10
     A  28                                  DSPATR(PR)
     A******
     A            $NO09          7Y 0O 13  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT09         70A  B 13 10
     A  29                                  DSPATR(PR)
     A******
     A            $NO10          7Y 0O 14  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT10         70A  B 14 10
     A  30                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO11          7Y 0O 15  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT11         70A  B 15 10
     A  31                                  DSPATR(PR)
     A******
     A            $NO12          7Y 0O 16  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT12         70A  B 16 10
     A  32                                  DSPATR(PR)
     A******
     A            $NO13          7Y 0O 17  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT13         70A  B 17 10
     A  33                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO14          7Y 0O 18  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT14         70A  B 18 10
     A  34                                  DSPATR(PR)
     A******
     A            $NO15          7Y 0O 19  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT15         70A  B 19 10
     A  35                                  DSPATR(PR)
     A******
     A            $NO16          7Y 0O 20  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT16         70A  B 20 10
     A  36                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A******
     A            $NO17          7Y 0O 21  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT17         70A  B 21 10
     A  37                                  DSPATR(PR)
     A******
     A            $NO18          7Y 0O 22  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT18         70A  B 22 10
     A  38                                  DSPATR(PR)
     A******
     A                                  1  2'File'
     A                                  1 32'Mbr'
     A                                  1 49'Rcd Lgth'
     A                                  2  9'RRN'
     A                                      DSPATR(RI)
     A                                  2 22'Col'
     A                                      DSPATR(RI)
     A                                  2 31'Search'
     A                                      DSPATR(RI)
     A                                  2 70'Len'
     A                                      DSPATR(RI)
     A                                  2 77'H'
     A                                      DSPATR(RI)
     A                                  3 77'K'
     A                                      DSPATR(RI)
     A  52                                  DSPATR(ND)
      *
     A          R DSP1X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A  99                                  DSPATR(HI)
     A*************************************************************
     A*
     A          R DSP2
     A                                      CHGINPDFT
     A                                      OVERLAY
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF06
     A                                      CF07
     A                                      CF08
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF13
     A                                      CF14
     A                                      CF15
     A                                      CF16
     A                                      CF17
     A                                      CF18
     A                                      CF19
     A                                      CF20
     A                                      CF21
     A                                      CF22
     A                                      CF23
     A                                      CF24
     A            $FILIB        21A  O  1  7DSPATR(HI)
     A            $MBR          10A  O  1 36DSPATR(HI)
     A            $RECL          4Y 0O  1 58DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $MODE         14A  O  1 63DSPATR(HI)
     A            $RRN           7Y 0B  2 13EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $WIN           4Y 0B  2 26EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCAN         30A  B  2 38DSPATR(UL)
     A            $SCLN          2Y 0B  2 74EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCKB          1A  B  2 79DSPATR(UL)
     A                                      VALUES(' ' 'H')
     A            $KEY          62A  B  3 13DSPATR(UL)
     A            $KYKB          1A  B  3 79DSPATR(UL)
     A                                      VALUES(' ' 'K')
     A            $FDT        1520A  O  4  1
     A                                  1  2'File'
     A                                  1 32'Mbr'
     A                                  1 49'Rcd Lgth'
     A                                  2  9'RRN'
     A                                      DSPATR(RI)
     A                                  2 22'Col'
     A                                      DSPATR(RI)
     A                                  2 31'Search'
     A                                      DSPATR(RI)
     A                                  2 70'Len'
     A                                      DSPATR(RI)
     A                                  2 77'H'
     A                                      DSPATR(RI)
     A                                  3 77'K'
     A                                      DSPATR(RI)
      *************************************************************
      *
     A          R DSP2X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A  99                                  DSPATR(HI)
      *************************************************************
      *
     A          R DSP3
     A                                      OVERLAY
     A                                      CHGINPDFT
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF01
     A                                      CF02
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A                                      CF12
     A                                      CF13
     A                                      CF14
     A                                      CF15
     A                                      CF18
     A                                      CF19
     A                                      CF20
     A                                      CF21
     A                                      CF24
     A            $FILIB        21A  O  1  7DSPATR(HI)
     A            $MBR          10A  O  1 36DSPATR(HI)
     A            $RECL          4Y 0O  1 58DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $MODE         14A  O  1 63DSPATR(HI)
     A            $RRN           7Y 0B  2 13EDTCDE(Z)
     A  50                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A            $WIN           4Y 0B  2 26EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCAN         30A  B  2 38
     A                                      DSPATR(UL)
     A            $SCLN          2Y 0B  2 74EDTCDE(Z)
     A                                      DSPATR(UL)
     A            $SCKB          1A  B  2 79VALUES(' ' 'H')
     A                                      DSPATR(UL)
     A            $KEY          62A  B  3 13
     A  52                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A            $KYKB          1A  B  3 79VALUES(' ' 'K')
     A  52                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A            $HDR           7A  O  4  2DSPATR(HI)
     A                                      DSPATR(UL)
     A            $TTL          70A  O  4 10DSPATR(HI)
     A            $NO01          7Y 0O  5  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT01         70A  O  5 10
     A            $NO02          7Y 0O  6  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT02         70A  O  6 10
     A            $NO03          7Y 0O  7  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT03         70A  O  7 10
     A            $NO04          7Y 0O  8  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT04         70A  O  8 10
     A            $NO05          7Y 0O  9  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT05         70A  O  9 10
     A            $NO06          7Y 0O 10  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT06         70A  O 10 10
     A            $NO07          7Y 0O 11  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT07         70A  O 11 10
     A            $NO08          7Y 0O 12  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT08         70A  O 12 10
     A            $NO09          7Y 0O 13  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT09         70A  O 13 10
     A            $NO10          7Y 0O 14  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT10         70A  O 14 10
     A            $NO11          7Y 0O 15  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT11         70A  O 15 10
     A            $NO12          7Y 0O 16  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT12         70A  O 16 10
     A            $NO13          7Y 0O 17  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT13         70A  O 17 10
     A            $NO14          7Y 0O 18  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT14         70A  O 18 10
     A            $NO15          7Y 0O 19  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT15         70A  O 19 10
     A            $NO16          7Y 0O 20  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT16         70A  O 20 10
     A            $NO17          7Y 0O 21  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT17         70A  O 21 10
     A            $NO18          7Y 0O 22  2DSPATR(HI)
     A                                      EDTCDE(Z)
     A            $DT18         70A  O 22 10
     A                                  1  2'File'
     A                                  1 32'Mbr'
     A                                  1 49'Rcd Lgth'
     A                                  2  9'RRN'
     A                                      DSPATR(RI)
     A                                  2 22'Col'
     A                                      DSPATR(RI)
     A                                  2 31'Search'
     A                                      DSPATR(RI)
     A                                  2 70'Len'
     A                                      DSPATR(RI)
     A                                  2 77'H'
     A                                      DSPATR(RI)
     A                                  3 77'K'
     A                                      DSPATR(RI)
      *************************************************************
      *
     A          R DSP3X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A  99                                  DSPATR(HI)
     A*************************************************************
     A*
     A          R DSP4
     A                                      OVERLAY
     A                                      CHGINPDFT
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF01
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF08
     A                                      CF09
     A                                      CF12
     A                                      CF15
     A                                      CF18
     A                                      CF24
     A                                  1  2'FIXDTA'
     A                                  1 31'Fix Data'
     A                                      DSPATR(HI)
     A                                  5  5'Viewing Style ....................'
     A                                  8  5'View data in format ..............'
     A                                 13  5'Check Shift ......................'
     A                                 15  5'Printing:'
     A                                 16  9'Record wrapping (fold)........'
     A            $EDK1          1Y 0B  5 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(1 2)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            $EDK2          1Y 0B  8 41DSPATR(UL)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                      VALUES(1 2 3 4)
     A            $EDK3          1Y 0B 13 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(1 2)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            $FOLD          1Y 0B 16 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(1 2)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  5 51'1= Single Record'
     A                                  6 51'2= Multiple Records'
     A                                  8 51'1= Character'
     A                                  9 51'2= Hexadecimal'
     A                                 10 51'3= Field Name'
     A                                 11 51'4= Column Heading'
     A                                 13 51'1= Yes'
     A                                 14 51'2= No'
     A                                 16 51'1= Yes'
     A                                 17 51'2= No'
     A                                  3  3'Type Choice and Press Enter'
      *************************************************************
      *
     A          R DSP4X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A  99                                  DSPATR(HI)
     A*************************************************************
     A*
     A          R DSP5
     A                                      OVERLAY
     A                                      CHGINPDFT
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF01
     A                                      CF03
     A                                      CF04
     A                                      CF05
     A                                      CF08
     A                                      CF09
     A                                      CF12
     A                                      CF13
     A                                      CF15
     A                                      CF16
     A                                      CF17
     A                                      CF18
     A                                      CF24
     A                                  1  2'FIXDTA'
     A                                  1 31'Search/Change'
     A                                      DSPATR(HI)
     A                                  3  3'Type Choice and Press Enter'
     A                                  5  5'Search:'
     A                                  6  9'String .......................'
     A                                  7  9'Length .......................'
     A                                  8  9'Type .........................'
     A                                  9  5'Change:'
     A                                 10  9'String .......................'
     A                                 11  9'Length .......................'
     A                                 12  9'Type .........................'
     A                                 14  5'Direction to process .............'
     A                                 15  5'Which records to change ..........'
     A                                 17  5'Starting record number ...........'
     A                                 18  5'Ending record number .............'
     A                                 19  5'Starting column ..................'
     A                                 20  5'Ending column ....................'
     A            $SCAN         30A  B  6 41DSPATR(UL)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            $SCLN          2Y 0B  7 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            $SCKB          1A  B  8 41DSPATR(UL)
     A                                      VALUES(' ' 'H')
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            $RPL          30A  B 10 41DSPATR(UL)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            $RPLN          2Y 0B 11 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A            $RPKB          1A  B 12 41DSPATR(UL)
     A                                      VALUES(' ' 'H')
     A            $SCK1          1Y 0B 14 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(1 2)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            $SCK2          1Y 0B 15 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(1 2)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            $STR           7Y 0B 17 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            $END           7Y 0B 18 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            $FRM           4Y 0B 19 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            $TO            4Y 0B 20 41DSPATR(UL)
     A                                      EDTCDE(Z)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            $RECL          4Y 0O 19 55
     A                                      EDTCDE(Z)
     A            $RECL2         4Y 0O 20 55
     A                                      EDTCDE(Z)
     A                                  8 51'H= Hexadecimal'
     A                                 12 51'H= Hexadecimal'
     A                                 14 51'1= Next, 2= Previous'
     A                                 15 51'1= 1st Matching record'
     A                                 16 51'2= All Matching records'
     A                                 17 51'1 - 9999999'
     A                                 18 51'1 - 9999999'
     A                                 19 51'1 -'
     A                                 20 51'1 -'
      *************************************************************
      *
     A          R DSP5X
     A            $CMD1         79   O 23  2
     A  98                                  DSPATR(HI)
     A            $CMD2         79   O 24  2
     A*************************************************************
     A*
     A          R DSP6
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF07
     A                                      CF12
     A                                      OVERLAY
     A            $CHR          10A  B 23 13
     A            $HEX1         10A  O 23 34DSPATR(UL)
     A            $HEX2         10A  O 24 34
     A                                 23  2'Char value'
     A                                      DSPATR(HI)
     A                                 23 30'Hex'
     A                                      DSPATR(HI)
     A                                 23 61'F7= Hex convert'
     A                                 24 61'F12= Prev screen'
     A  99        $ERR          78   O 22  2
      *************************************************************
      *
     A          R DSP7
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF07
     A                                      CF12
     A                                      OVERLAY
     A                                 23  2'Hex value'
     A                                      DSPATR(HI)
     A            $HEX1         10A  B 23 13DSPATR(UL)
     A            $HEX2         10A  B 24 13
     A                                 23 30'Char'
     A                                      DSPATR(HI)
     A            $CHR          10A  O 23 36
     A                                 23 61'F7= Char convert'
     A                                 24 61'F12= Prev screen'
     A  99        $ERR          78   O 22  2
      *************************************************************
      *
     A          R DSP8
     A                                      HELP(83)
     A                                      VLDCMDKEY(20)
     A                                      CF12
     A                                      OVERLAY
     A            $KAK          60   O 23 11
     A                                 24 12'Press Enter to Continue'
     A                                 24 61'F12= Prev screen'
