     A** FQAPW40 ********************************
     A* ..UPDATE OF MANUFACTURE NAME NAME..     *
     A*     K.OKACHI               98.04.08     *
     A******************************** FQAPW40 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R FQAPW401
     A                                      CF01
     A                                      KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 25' ** UPDATE OF MANUFACTURE +
     A                                      NAME ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'FQAPW40'
      ***************************************************************
     A                                  8 27' UPDATE ' DSPATR(UL)
     A                                  8 42' MANUFACTURE CODE ' DSPATR(UL)
      *
     A            IKOS           1A  B  9 31DSPATR(CS)
     A  01                                  DSPATR(RI PC)
     A            ICODE          4A  B  9 49DSPATR(CS)
     A  02                                  DSPATR(RI PC)
      *
     A                                 10 31'､'
     A                                 11 31'､､､､>'
     A                                 11 38'0:CANCEL'
     A                                 12 38'1:CHANGE'
     A                                 13 38'2:ADD'
      ***************************************************************
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 21 18
      *
     A                                 24  4'END'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'NEXT'
     A                                 24 29'CTRL'
     A                                      DSPATR(RI)
      *
     A          R FQAPW402
     A                                      CF03 CF05
     A                                      KEEP
     A  99                                  ALARM
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  1 25' ** UPDATE OF MANUFACTURE +
     A                                      NAME ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'FQAPW40'
      ***************************************************************
     A                                  8 10' MANUFACTURE CODE '
     A                                      DSPATR(UL)
     A                                  8 40' MANUFACTURE NAME'
     A                                      DSPATR(UL)
      *
     A            ICODE          4A  O 10 17
     A            INAME         30A  B 10 35DSPATR(CS)
     A  03                                  DSPATR(RI PC)
     A  04                                  DSPATR(PR)
      ***************************************************************
     A  99                             21 11'ERROR' DSPATR(RI BL)
     A  99        MSG           60A  O 21 18
      *
     A                                 24  4'KEY INPUT'
     A                                 24 14'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE'
     A                                 24 31'CMD-5'
     A                                      DSPATR(RI)
