     A*****************************************
     A*INQUIRY  OF QUENCHING FURNANCE HANDLING ABILITY GAEPW15 *
     A* M S K                       87.05.28  *
     A*****************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R SFL01                     SFL
     A            @HINBN        14A  O 10  2
     A            @HM01          7Y 0O 10 19EDTWRD(' ,   ,   ')
     A            @HM02          7Y 0O 10 31EDTWRD(' ,   ,   ')
     A            @HM03          7Y 0O 10 43EDTWRD(' ,   ,   ')
     A            @HM04          7Y 0O 10 56EDTWRD(' ,   ,   ')
     A            @HM05          7Y 0O 10 68EDTWRD(' ,   ,   ')
     A            @HM06          7Y 0O 11 19EDTWRD(' ,   ,   ')
     A            @HM07          7Y 0O 11 31EDTWRD(' ,   ,   ')
     A            @HM08          7Y 0O 11 43EDTWRD(' ,   ,   ')
     A            @HM09          7Y 0O 11 56EDTWRD(' ,   ,   ')
     A            @HM10          7Y 0O 11 68EDTWRD(' ,   ,   ')
     A          R SFLREC                    SFLCTL(SFL01)
     A                                      SFLSIZ(0600)
     A                                      SFLPAG(0006)
     A  70                                  SFLCLR
     A  71                                  SFLDSPCTL
     A  71                                  SFLDSP
     A  72                                  SFLEND
     A                                      ROLLUP(51)
     A                                      CA01
     A                                      CA03
     A                                      BLINK
     A                                      OVERLAY
     A                                      PROTECT
     A            @SFRCD         4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A            @TIME          6Y 0O  1  7EDTWRD('  :  :  ')
     A                                  1 20'* QUENCHING FURNANCE DAI-
     A                                      LY ABILITY INQUIRY *'
     A                                      DSPATR(RI)
     A                                  1 69'FMT GAEPW151'
     A                                  2  2'DATE'
     A            @DATE          8Y 0O  2  7EDTWRD('    .  .  ')
     A                                  2 54'WEIGHT UNIT = KG'
     A                                  3 16'RESULTS PERIOD'
     A            @SYMD          8A  O  3 32
     A                                  3 41'-'
     A            @EYMD          8A  O  3 43
     A                                  5  1'FURNACE'
     A                                  6  1'NUMBER'
     A                                  6 10'ABILITY'
     A                                  5 10'PER DAY'
     A            @M1            4Y 0O  5 19DSPATR(UL)
     A                                      EDTWRD('0 /  ')
     A                                  5 25'DAY'
     A            @M2            4Y 0O  5 32DSPATR(UL)
     A                                      EDTWRD('0 /  ')
     A                                  5 38'DAY'
     A            @M3            4Y 0O  5 44DSPATR(UL)
     A                                      EDTWRD('0 /  ')
     A                                  5 50'DAY'
     A            @M4            4Y 0O  5 56DSPATR(UL)
     A                                      EDTWRD('0 /  ')
     A                                  5 62'DAY'
     A            @M5            4Y 0O  5 68DSPATR(UL)
     A                                      EDTWRD('0 /  ')
     A                                  5 74'DAY'
     A            @ROBAN         4A  O  7  2
     A            @NOURK         6Y 0O  7 10EDTWRD('   ,   ')
     A            @H101          7Y 0O  7 19EDTWRD(' ,   ,   ')
     A            @H102          7Y 0O  7 31EDTWRD(' ,   ,   ')
     A            @H103          7Y 0O  7 43EDTWRD(' ,   ,   ')
     A            @H104          7Y 0O  7 56EDTWRD(' ,   ,   ')
     A            @H105          7Y 0O  7 68EDTWRD(' ,   ,   ')
     A            @H106          7Y 0O  8 19EDTWRD(' ,   ,   ')
     A            @H107          7Y 0O  8 31EDTWRD(' ,   ,   ')
     A            @H108          7Y 0O  8 43EDTWRD(' ,   ,   ')
     A            @H109          7Y 0O  8 56EDTWRD(' ,   ,   ')
     A            @H110          7Y 0O  8 68EDTWRD(' ,   ,   ')
     A                                  9  2'PART NUMBER'
     A                                  9 19'------------ DETAILS ------------'
     A          R GAEPW151
     A                                      OVERLAY
     A                                      PROTECT
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18DSPATR(HI)
     A                                 24  2'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 15'KEY INPUT'
     A                                 24 26'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 33'NEXT SCREEN'
     A                                 24 46'ROLL UP'
     A                                      DSPATR(RI)
     A                                 24 55'PRV. SCREEN'
     A                                 24 69'ROLL DOWN'
     A                                      DSPATR(RI)
