     A******************************************************
     A* QUENCHING PRODUCTION INFORMATION MANAGEMENT SYSTEM  GAEPW11 *
     A*                              M S K        87.05.12 *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R GAEPW111
     A*%%TS  SD  19961015  154144  AO          REL-V3R0M5  5763-PW1
     A                                      BLINK
     A                                      CA01(01 'EXIT')
     A                                  1  2'TIME'
     A            @TIME          8A  O  1  7
     A                                  1 20'* QUENCHING PRODUCTION INFORMATION-
     A                                       MANAGEMANT SYSTEM *'
     A                                  2 69'FMT GAEPW111'
     A                                  2  2'DATE'
     A            @DATE          8A  O  2  7
     A                                  5 21'SELECT  WORK CONTENTS'
     A                                      DSPATR(UL)
     A                                  7 15'1 ABILITY INQUIRY BY MONTHLY -
     A                                      SALES PLAN AND RESULT'
     A                                  9 15'2 ABILITY CALCULATION LISTING BY T-
     A                                      HIS MONTH PER DAY SALES'
     A                                 11 15'3 QUENCHING KANBAN M/F LISTING BY -
     A                                      CONDITION APPOINTMENT'
     A                                 12 15'|'
     A                                 13 15'|'
     A                                 14 15'|'
     A                                 15 15'+---->'
     A            @BANGO         1A  B 15 26DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                 15 28'INPUT NO'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A  99        @ERR          60A  O 22 18DSPATR(HI)
     A                                 24  4'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 43'EXECUTION'
     A                                 24 55'ENTER'
     A                                      DSPATR(RI)
