     A** GBFPW41 *******************************************
     A* SALES UNIT PRICE ESTIMATE PURCHASE PART PRIMITIVE COST M/F UPDATE *
     A*             M-OKUDA           1985.11.05           *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R GBFPW411
     A*%%TS  SD  19970210  155334  MIKA        REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                  1 25'WASHER & CONPONENT UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT GBFPW411'
     A                                  4  6'CUSTOMER'
     A            PTOKU          4A  O  4 15DSPATR(HI)
     A                                  4 20'-'
     A            PTKOJ          1A  O  4 22
     A            TMEIG         16A  O  4 24DSPATR(HI)
     A                                  7 17'UPDATE'
     A                                      DSPATR(UL)
     A                                  7 31'PURCHASE    PART NO'
     A                                      DSPATR(UL)
     A                                  7 54'COPIED CUSTOMER'
     A                                      DSPATR(UL)
     A            MENT           1A  B  9 21DSPATR(CS)
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            H2KHN1         5A  B  9 31DSPATR(CS)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                  9 37'-'
     A            H2KHN2         5A  B  9 39DSPATR(CS)
     A  91                                  DSPATR(RI)
     A                                  9 45'-'
     A            H2KHN3         2A  B  9 47DSPATR(CS)
     A  91                                  DSPATR(RI)
     A            XTOKU          4A  B  9 56DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                  9 61'-'
     A            XNKOJ          1A  B  9 63DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 13 10'+- UPDATE INSTRUCTION -+'
     A                                 14 10'|'
     A                                 14 12'0'
     A                                      DSPATR(HI)
     A                                 14 14'= CANCEL'
     A                                 14 33'|'
     A                                 15 10'|'
     A                                 15 12'1'
     A                                      DSPATR(HI)
     A                                 15 14'= CHANGE'
     A                                 15 33'|'
     A                                 16 10'|'
     A                                 16 12'2'
     A                                      DSPATR(HI)
     A                                 16 14'= ADD'
     A                                 16 33'|'
     A                                 17 10'+----------------------+'
     A  99                             22  8'ABNORMAL'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A  99        MSG           60A  O 22 18DSPATR(HI)
     A                                 24 11'UPDATE EXIT'
     A                                 24 23'CMD-1'
     A                                      DSPATR(RI)
     A          R GBFPW412
     A*%%TS  SD  19970210  154414  MIKA        REL-V3R0M5  5763-PW1
     A                                      CF03
     A                                      CF05
     A                                  1  3'PURCHASE PART PRIMITIVE COST M/F F-
     A                                      UPDATE FOR SALES UNP ESTIMATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT GBFPW412'
     A                                  4  6'CUSTOMER'
     A            PTOKU          4A  O  4 15DSPATR(HI)
     A                                  4 20'-'
     A            PTKOJ          1A  O  4 22
     A            TMEIG         16A  O  4 24DSPATR(HI)
     A                                  7 17'UPDATE'
     A                                      DSPATR(UL)
     A                                  7 31'WASHER & CONPONENT PART NO'
     A                                      DSPATR(UL)
     A            MENT           1A  O  9 17
     A            CMNT           6A  O  9 19DSPATR(HI)
     A            H2KHN1         5A  O  9 31
     A                                  9 37'-'
     A            H2KHN2         5A  O  9 39
     A                                  9 45'-'
     A            H2KHN3         2A  O  9 47
     A                                 14 10'PURCHASE PRICE'
     A                                      DSPATR(UL)
     A                                 14 27'SIZE'
     A                                      DSPATR(UL)
     A                                 14 39'CODE     PART NAME'
     A                                      DSPATR(UL)
     A            H2TANK         7Y 5B 16 11DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(2)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            H2SAIZ         2Y 0B 16 28DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(2)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A            H2MCOD         2A  B 16 40DSPATR(CS)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A            GMEI          20A  O 16 47
     A                                 17 14'-----'
     A  99                             22  8'ABNORMAL'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18DSPATR(HI)
     A                                 24 11'KEY INPUT'
     A                                 24 24'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 35'UPDATE OK'
     A                                 24 46'CMD-5'
     A                                      DSPATR(RI)
