     A*** GBFPW21 ******************************************
     A* SUPPLIER PROCESSING <PLATING > PRIMITIVE COST M/F UPDATE SCREEN  *
     A*              M-OKUDA          1985.11.07           *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*                                     IGCCNV(CF24 24)
     A          R GBFPW211
     A*%%TS  SD  19970210  165734  SUGIYAMA    REL-V3R0M5  5763-PW1
     A                                      CF01
     A  99                                  ALARM
     A                                  2 20'SURFACE TREATMENT COST UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT GBFPW211'
     A                                  4  6'CUSTOMER'
     A            PTOKU          4A  O  4 15DSPATR(HI)
     A                                  4 20'-'
     A            PTKOJ          1A  O  4 22
     A            TMEIG         16A  O  4 24DSPATR(HI)
     A                                  6 25'SURFACE TREATMENT'
     A                                  7 16'UPDATE'
     A                                      DSPATR(UL)
     A                                  7 27'PLAT THICKNESS SP'
     A                                      DSPATR(UL)
     A                                  7 50'SIZE'
     A                                      DSPATR(UL)
     A                                  7 59'COPIED CUSTOMER'
     A                                      DSPATR(UL)
     A            MENT           1A  B  9 18DSPATR(CS)
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A            G7MEK1         4A  B  9 27DSPATR(CS)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A            G7MEK2         2A  B  9 35DSPATR(CS)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            G7MEK3         1A  B  9 42DSPATR(CS)
     A  89                                  DSPATR(RI)
     A  89                                  DSPATR(PC)
     A            G7SAIZ         2Y 0B  9 51DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RZ)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A            XTOKU          4A  B  9 61DSPATR(CS)
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                  9 66'-'
     A            XNKOJ          1A  B  9 68DSPATR(CS)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                 11 16'.. UPDATE INST...'
     A                                 11 41'.. SIZE ................'
     A                                 12 16'.  0 = CANCEL   .'
     A                                 12 41'.  1 =LESS THAN  5 MM  .'
     A                                 13 16'.  1 = CHANGE   .'
     A                                 13 41'.  2 =MORE THAN  6 MM  .'
     A                                 14 16'.  2 = ADD      .'
     A                                 14 41'........................'
     A                                 15 16'.................'
     A  99                             21  8'ABNORMAL'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A  99        MSG           60A  O 21 17DSPATR(HI)
     A                                 23  9'EXIT'
     A                                 23 22'CMD-1'
     A                                      DSPATR(RI)
     A          R GBFPW212
     A*%%TS  SD  19970210  172655  SUGIYAMA    REL-V3R0M5  5763-PW1
     A                                      CF03
     A                                      CF05
     A  99                                  ALARM
     A                                  1 20'SURFACE TREATMENT COST UPDATE'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT GBFPW212'
     A                                  4  6'CUSTOMER'
     A            PTOKU          4A  O  4 15DSPATR(HI)
     A                                  4 20'-'
     A            PTKOJ          1A  O  4 22
     A            TMEIG         16A  O  4 24DSPATR(HI)
     A                                  6 25'SURFACE TREATMENT'
     A                                  7 14'UPDATE'
     A                                      DSPATR(UL)
     A                                  7 27'PLAT THICKNESS SP'
     A                                      DSPATR(UL)
     A                                  7 50'SIZE'
     A                                      DSPATR(UL)
     A            MENT           1A  O  9 14
     A            CMNT           6A  O  9 16
     A            G7MEK1         4A  O  9 27
     A            G7MEK2         2A  O  9 35
     A            G7MEK3         1A  O  9 42
     A            G7SAIZ         2Y 0O  9 51EDTCDE(Z)
     A                                 12 34'CUSTOMER'
     A                                 13  8'PRICE (\/KG)'
     A                                      DSPATR(UL)
     A                                 13 28'UNIT'
     A                                      DSPATR(UL)
     A                                 13 34'SURFACE TREAT CODE'
     A                                      DSPATR(UL)
     A                                 13 53'SURFACE TREAT NAME'
     A                                      DSPATR(UL)
     A            G7HTNK         7Y 5B 15 14DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(2)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A            G7HTNI         1A  B 15 29DSPATR(CS)
     A  95                                  DSPATR(RI)
     A  95                                  DSPATR(PC)
     A            G7MCOD        10A  B 15 38DSPATR(CS)
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A            G7MMEI        25A  B 15 55DSPATR(CS)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                 16 17'~~~~~'
     A                                 17 29'.. UNIT ......'
     A                                 18 29'. K = KG     .'
     A                                 19 29'. C = PIECE  .'
     A                                 20 29'..............'
     A  99                             21  7'ABNORMAL'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A  99        MSG           60A  O 21 17DSPATR(HI)
     A                                 23 11'KEY INPUT'
     A                                 23 24'CMD-3'
     A                                      DSPATR(RI)
     A                                 23 35'UPDATE'
     A                                 23 46'CMD-5'
     A                                      DSPATR(RI)
