     A*%%TS  SD  20020910  144141  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R DSP00
     A*%%TS  SD  20020910  125056  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 14'** COMPARISON OF NEW PRICES WITH T-
     A                                      HE CURRENT **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  7 18'CUSTOMER CODE:'
     A                                      DSPATR(HI)
     A            D@CUST         4Y 0B  7 33DSPATR(CS)
     A                                      EDTCDE(4)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  8 18'FACTORY:'
     A                                      DSPATR(HI)
     A            D@FACT         1A  B  8 33DSPATR(CS)
     A  61                                  DSPATR(RI)
     A                                 10 18'OPTION:' DSPATR(HI)
     A            D@OPTN         1   B 10 33DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A                                 10 36'BLANK= ALL     1=OMIT IAF PRODUCTS'
     A          R DSP01
     A*%%TS  SD  20020910  083624  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF12
     A                                      CF05
     A            #PGM           8A  O  1  2
     A                                  1 14'** COMPARISON OF NEW PRICES WITH T-
     A                                      HE CURRENT **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  7  9'Total new prices (New qty x new pr-
     A                                      ice)'
     A                                      DSPATR(HI)
     A            D@NEWP        15Y 4O  7 57EDTCDE(1)
     A                                  9  9'Total current prices (New qty x cu-
     A                                      rrent price)'
     A                                      DSPATR(HI)
     A            D@CURP        15Y 4O  9 57EDTCDE(1)
     A            D@PCNT         5Y 2O 11 67EDTCDE(M)
     A                                 11 74'%'
     A                                      DSPATR(HI)
     A          R SFL01                     SFL
     A*%%TS  SD  20020910  082405  TEST        REL-V4R4M0  5769-PW1
     A            S@SLCT         1A  B  5  3DSPATR(CS)
     A            S@PRT1         5A  O  5  6
     A            S@PRT2         5A  O  5 12
     A            S@PRT3         5A  O  5 18
     A            S@NQTY         9Y 0O  5 25EDTCDE(1)
     A            S@CURP         7Y 4O  5 38EDTCDE(4)
     A            S@NEWP         7Y 4O  5 48EDTCDE(4)
     A            S@BALP         7Y 4O  5 58EDTCDE(M)
     A            S@PCNT         5Y 2O  5 68EDTCDE(M)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020910  142217  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A                                      CF12
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #RCNO          4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  2
     A                                  1 14'** COMPARISON OF NEW PRICES WITH T-
     A                                      HE CURRENT **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4  6'Part#'
     A                                      DSPATR(HI)
     A                                  4 29'New qty'
     A                                      DSPATR(HI)
     A                                  3 39'Current'
     A                                      DSPATR(HI)
     A                                  4 39'U/price'
     A                                      DSPATR(HI)
     A                                  3 52'New'
     A                                      DSPATR(HI)
     A                                  4 49'U/price'
     A                                      DSPATR(HI)
     A                                  4 59'Balance'
     A                                      DSPATR(HI)
     A                                  4 73'%'
     A                                      DSPATR(HI)
     A                                  4  3'X'
     A                                      DSPATR(HI)
     A          R DSP02
     A*%%TS  SD  20020910  144141  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF12
     A            #PGM           8A  O  1  2
     A                                  1 14'** COMPARISON OF NEW PRICES WITH T-
     A                                      HE CURRENT **'
     A                                      DSPATR(RI)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  3  3'Part#'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            D@PRT1         5A  O  3  9
     A            D@PRT2         5A  O  3 15
     A            D@PRT3         5A  O  3 21
     A                                  3 31'New Qty'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            D@NQTY         9Y 0O  3 39EDTCDE(1)
     A                                  3 52'New Price'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A            D@NUPR         7Y 4O  3 63EDTCDE(4)
     A                                  6  3'Proc'
     A                                      DSPATR(HI)
     A                                  6  9'Cost'
     A                                      DSPATR(HI)
     A            D@PR01         3A  O  7  3
     A            D@PR02         3A  O  8  3
     A            D@PR03         3A  O  9  3
     A            D@PR04         3A  O 10  3
     A            D@PR05         3A  O 11  3
     A            D@PR06         3A  O 12  3
     A            D@PR07         3A  O 13  3
     A            D@PR08         3A  O 14  3
     A            D@PR09         3A  O 15  3
     A            D@PR10         3A  O 16  3
     A            D@PC01         5Y 4O  7  7EDTCDE(4)
     A            D@PC02         5Y 4O  8  7EDTCDE(4)
     A            D@PC03         5Y 4O  9  7EDTCDE(4)
     A            D@PC04         5Y 4O 10  7EDTCDE(4)
     A            D@PC05         5Y 4O 11  7EDTCDE(4)
     A            D@PC06         5Y 4O 12  7EDTCDE(4)
     A            D@PC07         5Y 4O 13  7EDTCDE(4)
     A            D@PC08         5Y 4O 14  7EDTCDE(4)
     A            D@PC09         5Y 4O 15  7EDTCDE(4)
     A            D@PC10         5Y 4O 16  7EDTCDE(4)
     A                                 17  2'Proc total'
     A                                      DSPATR(HI)
     A            D@PTOT         5Y 4O 18  7EDTCDE(4)
     A                                  6 43'Material'
     A                                      DSPATR(HI)
     A            D@MATC        15A  O  7 43
     A            D@MWIN         5Y 2O  7 59EDTCDE(4)
     A            D@MWBL         5Y 2O  7 66EDTCDE(4)
     A            D@MWOT         5Y 2O  7 73EDTCDE(4)
     A                                  8 59'Yield'
     A                                      DSPATR(HI)
     A            D@MYLD         5Y 2O  9 58EDTCDE(4)
     A                                  8 49'U/price'
     A                                      DSPATR(HI)
     A            D@MUPR         6Y 4O  9 49EDTCDE(4)
     A                                  8 66'Mat cost'
     A                                      DSPATR(HI)
     A            D@MCST         6Y 4O  9 67EDTCDE(4)
     A                                  6 15'Component'
     A                                      DSPATR(HI)
     A            D@CP11         5A  O  7 15
     A            D@CP12         5A  O  7 21
     A            D@CP13         2A  O  7 27
     A            D@CPC1         6Y 4O  7 33EDTCDE(4)
     A            D@CP21         5A  O  8 15
     A            D@CP22         5A  O  8 21
     A            D@CP23         2A  O  8 27
     A            D@CPC2         6Y 4O  8 33EDTCDE(4)
     A            D@CP31         5A  O  9 15
     A            D@CP32         5A  O  9 21
     A            D@CP33         2A  O  9 27
     A            D@CPC3         6Y 4O  9 33EDTCDE(4)
     A            D@CP41         5A  O 10 15
     A            D@CP42         5A  O 10 21
     A            D@CP43         2A  O 10 27
     A            D@CPC4         6Y 4O 10 33EDTCDE(4)
     A            D@CP51         5A  O 11 15
     A            D@CP52         5A  O 11 21
     A            D@CP53         2A  O 11 27
     A            D@CPC5         6Y 4O 11 33EDTCDE(4)
     A            D@CPU1         2Y 0O  7 30EDTCDE(4)
     A            D@CPU2         2Y 0O  8 30EDTCDE(4)
     A            D@CPU3         2Y 0O  9 30EDTCDE(4)
     A            D@CPU4         2Y 0O 10 30EDTCDE(4)
     A            D@CPU5         2Y 0O 11 30EDTCDE(4)
     A                                 12 15'Component total'
     A                                      DSPATR(HI)
     A            D@CPTT         6Y 4O 12 33EDTCDE(4)
     A                                 11 45'Surface trmt'
     A                                      DSPATR(HI)
     A            D@SRF1         4A  O 12 47
     A            D@SRF2         2A  O 12 52
     A            D@SRF3         1A  O 12 55
     A                                 11 63'Cost'
     A                                      DSPATR(HI)
     A            D@SRCT         6Y 4O 12 60EDTCDE(4)
     A                                 14 15'Purchased product'
     A                                      DSPATR(HI)
     A            D@PRCH         6Y 4O 14 33EDTCDE(4)
     A                                 16 31'Total cost'
     A                                      DSPATR(HI)
     A            D@CTOT         6Y 4O 16 45EDTCDE(4)
     A                                 17 31'Mangmnt rate'
     A                                      DSPATR(HI)
     A            D@MGRT         4Y 2O 17 47EDTCDE(4)
     A                                 18 31'SG & A'
     A                                      DSPATR(HI)
     A            D@SGA          6Y 4O 18 45EDTCDE(4)
     A                                 19 31'Pkg cost'
     A                                      DSPATR(HI)
     A            D@PCKG         5Y 4O 19 46EDTCDE(4)
     A                                 20 31'Prf rate'
     A                                      DSPATR(HI)
     A            D@PFRT         4Y 2O 20 47EDTCDE(4)
     A                                 21 31'Profit'
     A                                      DSPATR(HI)
     A            D@PRFT         5Y 4O 21 46EDTCDE(4)
     A                                  4 10'Name'
     A                                      DSPATR(HI)
     A            D@MSYO         2A  O  4 15
     A                                  4 21'Diam'
     A                                      DSPATR(HI)
     A            D@TUSZ         3Y 1O  4 26EDTCDE(4)
     A                                  4 32'Length'
     A                                      DSPATR(HI)
     A            D@LENG         5Y 2O  4 40EDTCDE(4)
     A                                  5 59'------ Weight -----'
     A                                      DSPATR(HI)
     A                                  6 62'In'
     A                                      DSPATR(HI)
     A                                  6 76'Fin'
     A                                      DSPATR(HI)
     A                                  6 67'Blank'
     A                                      DSPATR(HI)
     A          R DSP99
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
