     A*%%TS  SD  20000727  113145  QPGMR       REL-V3R7M0  5716-PW1
     A** GBFPW43 ************************
     A*   UPDATE OF SALES UNIT PRICE QUOTATION DATA
     A*    S.YAMAGAMI      1991.10.18   *
     A*    GBC             2000.07.19
     A*    TCH             2000.07.27 CHANGE TITLE
     A************************ GBFPW43 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R GBFPW431
     A*%%TS  SD  20000727  113145  QPGMR       REL-V3R7M0  5716-PW1
     A                                      KEEP
     A                                      CF01(10)
     A                                      CF05(11)
     A                                      BLINK
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' ** SALES UNIT PRICE   PRICE UPDAT-
     A                                      E  '
     A                                      DSPATR(RI)
     A                                  2 20'       QUOTATION DATA TRANSACTION -
     A                                      ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT GBFPW43'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  /  /  ')
     A                                  5 26' USER   '
     A                                      DSPATR(RI)
     A            @TOKU          4A  B  5 38DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7 26' PLANT  '
     A                                      DSPATR(RI)
     A            @KOJO          1A  B  7 38DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  9  4'1. INITIAL'
     A                                  9 26' => '
     A            @SYOKA         1A  B  9 32DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  9 37'0 - UNIT PRICE OF THIS TERM ONLY'
     A                                 11  4'2. UNIT PRICE THIS TERM - UNIT PRI-
     A                                      CE NEXT TERM = ITEM TO INPUT DIFFER-
     A                                      ENCE'
     A                                 12 53'  | '
     A            @KMK1          1A  B 13 55DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 13 17'1-THEME1 '
     A                                 13 29'2-THEME2 '
     A                                 13 42'3-MATERIAL '
     A                                 15  4'3. (UNIT PRICE THIS TERM - UNIT PR-
     A                                      ICE NEXT TERM ) - '
     A                                 17 23'ITEM CHOSEN BEFORE    LAST TIME IT-
     A                                      EM   ITEM OF UNIT'
     A                                 18 24'    THE LAST TIME -       TO CHOOS-
     A                                      E = PRICE DIFFERENCE'
     A                                 19 34'  | '
     A                                 19 50'  | '
     A                                 19 63'  | '
     A            @KMK2          1A  B 20 36DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            @KMK3          1A  B 20 52DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            @KMK4          1A  B 20 65DSPATR(CS)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A                                 21 47'1-THEME1'
     A                                 21 57'2-THEME2'
     A                                 21 68'3-MATERIAL'
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        @ERR          60A  O 22 18
     A                                 24  6'    END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 24' CREAT DATA '
     A                                 24 37' CMD-5 '
     A                                      DSPATR(RI)
