     A*** GBFPW01 ************************
     A* ...  WEIGHT TOTALIZATION LIST BY PART NO *.
     A*        H.ITO        87.11.10     *
     A************************ GBFPW01 ***
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R GBFPW011
     A*%%TS  SD  19970210  144730  SUGIYAMA    REL-V3R0M5  5763-PW1
     A                                      TEXT('WEIGHT TOTALIZATION LIST BY  -
     A                                      PART NO')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A                                      PUTOVR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18'* WG TOTALIZATION LIST BY P/N-
     A                                       SELECTION SCREEN *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GBFPW01'
     A                                  6 21'1. CUSTOMER'
     A            PTOKU          4A  B  6 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  9 21'2. FACTORY'
     A            PNKOJ          1A  B  9 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 12 21'3. INSTRUCTION'
     A            PKUBN          1A  B 12 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 12 50'1. PLAN QUANTITY'
     A                                 13 50'2. RESULT QUANTITY'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24 10'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'LIST CREATE'
     A                                 24 38'CMD-5'
     A                                      DSPATR(RI)
