     A*%%TS  SD  20020906  093002  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01(01)
     A                                      CF05(05)
     A          R DSP01
     A*%%TS  SD  20020906  093002  TEST        REL-V4R4M0  5769-PW1
     A                                  1  3'GBFR92'
     A                                  1 16'** REPLACE QTY FOR ESTIMATION WIT-
     A                                      H UPLOADED DATA **'
     A                                      DSPATR(RI)
     A                                  1 69DATE
     A                                      EDTCDE(Y)
     A                                  2 69TIME
     A  99                              5 13'NO UPLOADED DATA !!!'
     A                                      DSPATR(RI BL)
     A N99                              7 13'Hit F5, then the qty in the quotat-
     A                                      ion files will be replaced'
     A                                      DSPATR(HI)
     A N99                              8 13'with the new data.'
     A                                      DSPATR(HI)
     A                                 23  5'F1:END        F5:UPDATE'
