     A*%%TS  SD  19970114  220810  QPGMR       REL-V3R7M0  5716-PW1
     A** GCKPW21 *******************************
     A* ... LT M/F BY SECTION UPDATE ... *
     A*        I-HASADA        85.12.13        *
     A******************************* GCKPW21 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*-------------------------*
     A* ...SCREEN 1... *
     A*-------------------------*
     A          R GCKPW211
     A                                      TEXT('... SCREEN 1 ...')
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25'* LT M/F BY SECTION UPDATE *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 69'FMT GCKPW21'
     A                                  5 23'UPDATE'
     A                                      DSPATR(RI)
     A                                  5 39'SECTION / TYPE'
     A                                      DSPATR(RI)
     A            WKOSN          1A  B  7 25DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            WBMON          4A  B  7 41DSPATR(CS)
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A            T2TAIP         1A  B  7 50DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A                                  9 20'+---------------+'
     A                                 10 20'|0- CANCEL      |'
     A                                 11 20'|1- CHANGE      |'
     A                                 12 20'|2- ADD         |'
     A                                 13 20'+---------------+'
     A                                 15 20'LAST TIME -----'
     A                                 17 22'UPDATE'
     A                                      DSPATR(UL)
     A                                 17 34'SECTION / TYPE'
     A                                      DSPATR(UL)
     A            ZNAME          8A  O 18 21
     A            ZBMON          4A  O 18 36
     A            ZTAIP          1A  O 18 45
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 21 18
     A                                 23  4'EXIT'
     A                                 23 15'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*-------------------------*
     A* ...SCREEN 2... *
     A*-------------------------*
     A          R GCKPW212
     A*%%TS  SD  19970114  220810  QPGMR       REL-V3R7M0  5716-PW1
     A                                      TEXT('... SCREEN 2 ...')
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 25'* LT M/F BY SECTION UPDATE *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GCKPW21'
     A                                  3 23'UPDATE'
     A                                      DSPATR(RI)
     A            WNAME          8A  O  3 30
     A                                  3 39'SECTION / TYPE'
     A                                      DSPATR(RI)
     A            WTAIP          6A  O  3 54
     A                                  5 25'THE DELIVERY DAY IN A WEEK'
     A                                  6  7'SECTION NAME'
     A                                      DSPATR(UL)
     A                                  6 29'MON TUE WED TUR FRI'
     A                                      DSPATR(UL)
     A                                  6 51'CYCLE'
     A                                      DSPATR(UL)
     A                                  6 65'LT'
     A                                      DSPATR(UL)
     A                                  6 71'SAFE LT'
     A                                      DSPATR(UL)
     A                                  8  2'KANA'
     A            T2NAMN        20A  B  8  7DSPATR(CS)
     A  08                                  DSPATR(RI)
     A  08                                  DSPATR(PC)
     A            T2MOND         1A  B  8 30DSPATR(CS)
     A  09                                  DSPATR(RI)
     A  09                                  DSPATR(PC)
     A            T2TUED         1A  B  8 34DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A            T2WEND         1A  B  8 38DSPATR(CS)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            T2THUD         1A  B  8 42DSPATR(CS)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            T2FRID         1A  B  8 46DSPATR(CS)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            T2SKR1         2Y 0B  8 51DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                  8 54':'
     A            T2SKR2         2Y 0B  8 56DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  14                                  DSPATR(RI)
     A                                  8 59':'
     A            T2SKR3         2Y 0B  8 61DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  14                                  DSPATR(RI)
     A            T2LTM1         3Y 1B  8 65DSPATR(CS)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A            T2LTM2         3Y 1B  8 74DSPATR(CS)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A                                 12  7' DELIVERY TIME'
     A                                      DSPATR(UL)
     A                                 12 23'1'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 13 23'2'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 14 23'3'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 15 23'4'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 16 23'5'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 17 23'6'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 18 23'7'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 19 23'8'
     A                                      DSPATR(RI)
     A            T2NHH1         2Y 0B 12 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 12 29':'
     A            WNMM1          2A  B 12 31DSPATR(CS)
     A                                      CHECK(RB)
     A  17                                  DSPATR(RI)
     A            T2NHH2         2Y 0B 13 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                 13 29':'
     A            WNMM2          2A  B 13 31DSPATR(CS)
     A                                      CHECK(RB)
     A  18                                  DSPATR(RI)
     A            T2NHH3         2Y 0B 14 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 14 29':'
     A            WNMM3          2A  B 14 31DSPATR(CS)
     A                                      CHECK(RB)
     A  19                                  DSPATR(RI)
     A            T2NHH4         2Y 0B 15 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 15 29':'
     A            WNMM4          2A  B 15 31DSPATR(CS)
     A                                      CHECK(RB)
     A  20                                  DSPATR(RI)
     A            T2NHH5         2Y 0B 16 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                 16 29':'
     A            WNMM5          2A  B 16 31DSPATR(CS)
     A                                      CHECK(RB)
     A  21                                  DSPATR(RI)
     A            T2NHH6         2Y 0B 17 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A                                 17 29':'
     A            WNMM6          2A  B 17 31DSPATR(CS)
     A                                      CHECK(RB)
     A  22                                  DSPATR(RI)
     A            T2NHH7         2Y 0B 18 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 18 29':'
     A            WNMM7          2A  B 18 31DSPATR(CS)
     A                                      CHECK(RB)
     A  23                                  DSPATR(RI)
     A            T2NHH8         2Y 0B 19 26DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      CHECK(RB)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                 19 29':'
     A            WNMM8          2A  B 19 31DSPATR(CS)
     A                                      CHECK(RB)
     A  24                                  DSPATR(RI)
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 21 18
     A                                 23  4'KEY INPUT'
     A                                 23 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 23 24'UPDATE OK'
     A                                 23 35'CMD-5'
     A                                      DSPATR(RI)
