     A*%%TS  SD  20031114  133901  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF05
     A          R DSP01
     A*%%TS  SD  20031114  133901  TEST        REL-V4R4M0  5769-PW1
     A            #PGM           8A  O  1  2
     A                                  1 22'** DIE KANBAN MASTER CHECK LIST **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  6 17'SETTING QTY INCREASED/DECREASED:'
     A                                      DSPATR(HI)
     A            D@PCNT         3Y 0B    +1EDTCDE(4)
     A                                      DSPATR(CS)
     A  61                                  DSPATR(PC RI)
     A                                    +1'% MORE/LESS'
     A                                      DSPATR(HI)
     A                                 23  3'F1:END   F5:PRINT'
     A            D@MSG         78   O 24  2DSPATR(HI)
