     A****************************************************************
     A*     FILE  NAME.      :  DIE ALLOTMENT M/F UPDATE             *
     A*     FILE  ID.        :  GCQPW31.     <DSPF>                  *
     A*     CREATE DATE.     :  MAR.29,'90.                          *
     A*     AUTHOR.          :  E.KAWASHIMA                          *
     A****************************************************************
     A*    型構成マスター対応                      2020.10.29      *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R GCQPW311
     A                                      TEXT('SCREEN1')
     A                                      CF01
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW311'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A*                                 5 23'UPDATE'
     A*                                     DSPATR(RI)
     A                                  5 28'INTRAL COMPANY P/N'
     A                                      DSPATR(RI)
     A*           OP             1A  B  7 25DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 01                                  DSPATR(RI)
     A* 01                                  DSPATR(PC)
     A            SHN1           5A  B  7 28DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  7 34'-'
     A            SHN2           5A  B  7 36DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  7 42'-'
     A            SHN3           2A  B  7 44DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A*                                10 43'COPYING POINT INTRAL COMPANY P/N'
     A*                                     DSPATR(RI)
     A*           COP1           5A  B 12 49DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 05                                  DSPATR(RI)
     A* 05                                  DSPATR(PC)
     A*                                12 56'-'
     A*           COP2           5A  B 12 59DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 05                                  DSPATR(RI)
     A* 05                                  DSPATR(PC)
     A*                                12 66'-'
     A*           COP3           2A  B 12 69DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 06                                  DSPATR(RI)
     A* 06                                  DSPATR(PC)
     A*                                13 51'|'
     A*                                14 51'+->IT IS COPIED BY THIS INTRAL'
     A*                                15 54'COMPANY P/N DATA.'
     A*                                16 53'<ONLY WHEN IT IS ADDED>'
     A*                                18 22'FACTORY'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(RI)
     A*                                18 42'HEAD OFFICE'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                18 60'ENA'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                19 42'GIFU'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                19 60'KANI'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                20 42'KUMAMOTO'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                20 60'GOJYOGAWA'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*                                21 42'NORTH AMERICA'
     A*                                     OVRATR
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A*           KJ             1A  B 20 25
     A* 77                                  DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 77 07                               DSPATR(RI)
     A* 77 07                               DSPATR(PC)
     A*N77                                  DSPATR(ND)
     A* 77                                  DSPATR(HI)
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 16OVRDTA
     A                                 24  3'UPDATED'
     A                                 24 11' CMD-1 '
     A                                      DSPATR(RI)
     A*                                18 38'0'
     A*                                     DSPATR(RI)
     A*                                 9 20'0-CANCEL (ALL)'
     A*                                10 20'1-CHG'
     A*                                11 20'2-ADD'
     A*                                12 20'3-UPDATE STATUS INQUIRY'
     A*                                19 38'2'
     A*                                     DSPATR(RI)
     A*                                20 38'4'
     A*                                     DSPATR(RI)
     A*                                21 38'6'
     A*                                     DSPATR(RI)
     A*                                18 56'1'
     A*                                     DSPATR(RI)
     A*                                19 56'3'
     A*                                     DSPATR(RI)
     A*                                20 56'5'
     A*                                     DSPATR(RI)
     A*
     A          R GCQPW312
     A*%%TS  SD  19961008  143635  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN2')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE *-
     A                                      * '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW312'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  4 18'UPDATE'
     A                                      DSPATR(UL)
     A                                  4 37'INTRAL COMPANY P/N'
     A            HIN           14A  O  4 57OVRDTA
     A                                  6  2'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                  7  2'*'
     A                                  7 79'*'
     A                                  8  2'*'
     A                                  8  5'PROCESS'
     A                                      DSPATR(UL)
     A                                  8 14'COMPONENTS NO'
     A                                      DSPATR(UL)
     A                                  8 31'DIE NO'
     A                                      DSPATR(UL)
     A                                  8 46'DIE NAME'
     A                                      DSPATR(UL)
     A                                  8 57'NUMBER'
     A                                      DSPATR(UL)
     A                                  8 66'INSTRUCTION'
     A                                      DSPATR(UL)
     A                                  8 79'*'
     A                                  9  2'*'
     A            XXKOTI         3A  O  9  7OVRDTA
     A            XXKSEI         2A  O  9 18OVRDTA
     A            XXKATA        15A  O  9 27OVRDTA
     A            XXKANM        10A  O  9 45OVRDTA
     A            XXKOSU         2Y 0O  9 59EDTCDE(4)
     A                                      OVRDTA
     A            XXKUNM         6A  O  9 69OVRDTA
     A                                  9 79'*'
     A                                 10  2'*'
     A                                 10 79'*'
     A                                 11  2'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 14  5'PROCESS'
     A                                      DSPATR(RI)
     A                                 14 14'COMPONENTS NO'
     A                                      DSPATR(RI)
     A                                 14 31'DIE NO'
     A                                      DSPATR(RI)
     A                                 14 46'DIE NAME'
     A                                      DSPATR(RI)
     A                                 14 57'NUMBER'
     A                                      DSPATR(RI)
     A                                 14 66'INSTRUCTION'
     A                                      DSPATR(RI)
     A            D2KOTI         3A  B 16  7DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            D2KSEI         2A  B 16 18DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            D2KATA        15A  B 16 27DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  50                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            D2KANM        10A  O 16 45OVRDTA
     A            D2KOSU         2Y 0B 16 59DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A            D2KUBN         1A  B 16 71DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 18 16'NEW DIE NO='
     A                                      OVRATR
     A  60                                  DSPATR(ND)
     A            D2NEWK        15A  O 18 29DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(ND)
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 16OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 23'UPDATE OK'
     A                                 24 33' CMD-5 '
     A                                      DSPATR(RI)
     A                                  4 26'2-ADD'
     A                                 18 70'0-NEW'
     A*
     A          R GCQPW313
     A                                      TEXT('SCREEN3')
     A                                      CF03
     A                                      CF07
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  3'INTRAL COMPANY P/N'
     A                                      DSPATR(UL)
     A                                  1 26' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW313'
     A            HIN           14A  O  2  2OVRDTA
     A*                                 2 20'UPDATE INSTRUCTION'
     A*           OPNM          12A  O  2 39OVRDTA
     A                                  2 59'NEXT DATA'
     A                                      DSPATR(RI)
     A            CON            6A  O  2 69OVRDTA
     A                                  3  2'NO PROC. COMPT. DIE NO.  NAME  C-
     A                                      OUNT P'
     A                                      DSPATR(UL)
     A                                  3 42'NO PROC. COMPT. DIE NO.  NAME  C-
     A                                      OUNT P'
     A                                      DSPATR(UL)
     A            NO01           2Y 0O  4  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KOT01          3A  O  4  6OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KSE01          2Y 0O  4 12OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KAT01          9A  O  4 17OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NAM01          6A  O  4 27OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            SU01           2Y 0O  4 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KATK01         1A  O  4 39
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NO02           2Y 0O  5  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KOT02          3A  O  5  6OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KSE02          2Y 0O  5 12OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KAT02          9A  O  5 17OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NAM02          6A  O  5 27OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            SU02           2Y 0O  5 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KATK02         1A  O  5 39
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NO03           2Y 0O  6  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KOT03          3A  O  6  6OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KSE03          2Y 0O  6 12OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KAT03          9A  O  6 17OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NAM03          6A  O  6 27OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            SU03           2Y 0O  6 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KATK03         1A  O  6 39
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NO04           2Y 0O  7  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KOT04          3A  O  7  6OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KSE04          2Y 0O  7 12OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KAT04          9A  O  7 17OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NAM04          6A  O  7 27OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            SU04           2Y 0O  7 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KATK04         1A  O  7 39
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NO05           2Y 0O  8  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KOT05          3A  O  8  6OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KSE05          2Y 0O  8 12OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KAT05          9A  O  8 17OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NAM05          6A  O  8 27OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            SU05           2Y 0O  8 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KATK05         1A  O  8 39
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NO06           2Y 0O  9  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KOT06          3A  O  9  6OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KSE06          2Y 0O  9 12OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KAT06          9A  O  9 17OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NAM06          6A  O  9 27OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            SU06           2Y 0O  9 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KATK06         1A  O  9 39
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NO07           2Y 0O 10  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KOT07          3A  O 10  6OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KSE07          2Y 0O 10 12OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KAT07          9A  O 10 17OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NAM07          6A  O 10 27OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            SU07           2Y 0O 10 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KATK07         1A  O 10 39
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NO08           2Y 0O 11  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KOT08          3A  O 11  6OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KSE08          2Y 0O 11 12OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KAT08          9A  O 11 17OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NAM08          6A  O 11 27OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            SU08           2Y 0O 11 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KATK08         1A  O 11 39
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NO09           2Y 0O 12  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KOT09          3A  O 12  6OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KSE09          2Y 0O 12 12OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KAT09          9A  O 12 17OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NAM09          6A  O 12 27OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            SU09           2Y 0O 12 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KATK09         1A  O 12 39
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NO10           2Y 0O 13  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KOT10          3A  O 13  6OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KSE10          2Y 0O 13 12OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KAT10          9A  O 13 17OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NAM10          6A  O 13 27OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            SU10           2Y 0O 13 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KATK10         1A  O 13 39
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NO11           2Y 0O 14  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KOT11          3A  O 14  6OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KSE11          2Y 0O 14 12OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KAT11          9A  O 14 17OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NAM11          6A  O 14 27OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            SU11           2Y 0O 14 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KATK11         1A  O 14 39
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NO12           2Y 0O 15  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KOT12          3A  O 15  6OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KSE12          2Y 0O 15 12OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KAT12          9A  O 15 17OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NAM12          6A  O 15 27OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            SU12           2Y 0O 15 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KATK12         1A  O 15 39
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NO13           2Y 0O 16  2EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KOT13          3A  O 16  6OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KSE13          2Y 0O 16 12OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KAT13          9A  O 16 17OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NAM13          6A  O 16 27OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            SU13           2Y 0O 16 35EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KATK13         1A  O 16 39
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NO14           2Y 0O  4 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KOT14          3A  O  4 46OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KSE14          2Y 0O  4 52OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KAT14          9A  O  4 57OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NAM14          6A  O  4 67OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            SU14           2Y 0O  4 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KATK14         1A  O  4 79
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NO15           2Y 0O  5 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KOT15          3A  O  5 46OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KSE15          2Y 0O  5 52OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KAT15          9A  O  5 57OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NAM15          6A  O  5 67OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            SU15           2Y 0O  5 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KATK15         1A  O  5 79
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NO16           2Y 0O  6 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KOT16          3A  O  6 46OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KSE16          2Y 0O  6 52OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KAT16          9A  O  6 57OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NAM16          6A  O  6 67OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            SU16           2Y 0O  6 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KATK16         1A  O  6 79
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NO17           2Y 0O  7 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KOT17          3A  O  7 46OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KSE17          2Y 0O  7 52OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KAT17          9A  O  7 57OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NAM17          6A  O  7 67OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            SU17           2Y 0O  7 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KATK17         1A  O  7 79
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NO18           2Y 0O  8 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KOT18          3A  O  8 46OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KSE18          2Y 0O  8 52OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KAT18          9A  O  8 57OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NAM18          6A  O  8 67OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            SU18           2Y 0O  8 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KATK18         1A  O  8 79
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NO19           2Y 0O  9 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KOT19          3A  O  9 46OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KSE19          2Y 0O  9 52OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KAT19          9A  O  9 57OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NAM19          6A  O  9 67OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            SU19           2Y 0O  9 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KATK19         1A  O  9 79
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NO20           2Y 0O 10 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KOT20          3A  O 10 46OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KSE20          2Y 0O 10 52OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KAT20          9A  O 10 57OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NAM20          6A  O 10 67OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            SU20           2Y 0O 10 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KATK20         1A  O 10 79
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NO21           2Y 0O 11 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KOT21          3A  O 11 46OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KSE21          2Y 0O 11 52OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KAT21          9A  O 11 57OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NAM21          6A  O 11 67OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            SU21           2Y 0O 11 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KATK21         1A  O 11 79
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NO22           2Y 0O 12 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KOT22          3A  O 12 46OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KSE22          2Y 0O 12 52OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KAT22          9A  O 12 57OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NAM22          6A  O 12 67OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            SU22           2Y 0O 12 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KATK22         1A  O 12 79
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NO23           2Y 0O 13 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KOT23          3A  O 13 46OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KSE23          2Y 0O 13 52OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KAT23          9A  O 13 57OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NAM23          6A  O 13 67OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            SU23           2Y 0O 13 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KATK23         1A  O 13 79
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NO24           2Y 0O 14 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KOT24          3A  O 14 46OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KSE24          2Y 0O 14 52OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KAT24          9A  O 14 57OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NAM24          6A  O 14 67OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            SU24           2Y 0O 14 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KATK24         1A  O 14 79
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NO25           2Y 0O 15 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KOT25          3A  O 15 46OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KSE25          2Y 0O 15 52OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KAT25          9A  O 15 57OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NAM25          6A  O 15 67OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            SU25           2Y 0O 15 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KATK25         1A  O 15 79
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NO26           2Y 0O 16 42EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KOT26          3A  O 16 46OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KSE26          2Y 0O 16 52OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KAT26          9A  O 16 57OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            NAM26          6A  O 16 67OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            SU26           2Y 0O 16 75EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KATK26         1A  O 16 79
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A*                                18  3'UPDATE'
     A*                                     DSPATR(UL)
     A*                                18 11' NO '
     A*                                     DSPATR(UL)
     A*                                18 17'PROCESS'
     A*                                     DSPATR(UL)
     A*                                18 26'COMPONENTS NO'
     A*                                     DSPATR(UL)
     A*                                18 41'DIE NO'
     A*                                     DSPATR(UL)
     A*                                18 49'DIE NAME'
     A*                                     DSPATR(UL)
     A*                                18 59'NUMBER'
     A*                                     DSPATR(UL)
     A*                                18 67'INSTRUCTION'
     A*                                     DSPATR(UL)
     A*           D3OP           1A  B 19  5DSPATR(CS)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 31                                  DSPATR(RI)
     A* 31                                  DSPATR(PC)
     A*           D3NO           2Y 0B 19 12DSPATR(CS)
     A*                                     CHECK(ER)
     A*                                     EDTCDE(4)
     A*                                     OVRDTA
     A*                                     OVRATR
     A* 32                                  DSPATR(RI)
     A* 32                                  DSPATR(PC)
     A*                                20  2'0-CAN'
     A*                                21  2'1-CHG'
     A*                                22  2'2-ADD'
     A*                                21 73'0-NEW'
     A*
     A                                 21  2'NO.'
     A            D3NO2          2Y 0B 21  6EDTCDE(4)
     A                                      OVRDTA OVRATR
     A                                      DSPATR(CS)
     A  36                                  DSPATR(RI PC)
     A  60                                  DSPATR(PR)
     A                                 21 10'<=== DIE COMPONENT INQUIRY -
     A                                      ( CMD-7 ) INPUT WHEN PRESSED'
     A*
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 17OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 21'DIE COMPT. INQ.'
     A                                 24 37' CMD-7 '
     A                                      DSPATR(RI)
     A                                 24 46'RIGHT'
     A                                 24 52'RL-UP'
     A                                      DSPATR(RI)
     A                                 24 60'LEFT'
     A                                 24 66'RL-DN'
     A                                      DSPATR(RI)
     A*
     A          R GCQPW313X
     A                                      TEXT('SCREEN3-X')
     A                                      CF03
     A*                                     CF05
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  2'INTRAL COMPANY P/N'
     A                                      DSPATR(UL)
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW313'
     A            HIN           14A  O  2  4OVRDTA
     A*                                 2 20'UPDATE INSTRUCTION'
     A*           OPNM          12A  O  2 39OVRDTA
     A                                  2 59'NEXT DATA'
     A                                      DSPATR(RI)
     A            CON            6A  O  2 69OVRDTA
     A                                  3  2' NO. PROC. COMPT. DIE NO.  NAME  C-
     A                                      OUNT'
     A                                      DSPATR(UL)
     A                                  3 42' NO. PROC. COMPT. DIE NO.  NAME  C-
     A                                      OUNT'
     A                                      DSPATR(UL)
     A            NO01           2Y 0O  4  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KOT01          3A  O  4  8OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KSE01          2Y 0O  4 14OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KAT01          9A  O  4 19OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NAM01          6A  O  4 29OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            SU01           2Y 0O  4 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NO02           2Y 0O  5  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KOT02          3A  O  5  8OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KSE02          2Y 0O  5 14OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KAT02          9A  O  5 19OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NAM02          6A  O  5 29OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            SU02           2Y 0O  5 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NO03           2Y 0O  6  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KOT03          3A  O  6  8OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KSE03          2Y 0O  6 14OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KAT03          9A  O  6 19OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NAM03          6A  O  6 29OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            SU03           2Y 0O  6 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NO04           2Y 0O  7  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KOT04          3A  O  7  8OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KSE04          2Y 0O  7 14OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KAT04          9A  O  7 19OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NAM04          6A  O  7 29OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            SU04           2Y 0O  7 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NO05           2Y 0O  8  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KOT05          3A  O  8  8OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KSE05          2Y 0O  8 14OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KAT05          9A  O  8 19OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NAM05          6A  O  8 29OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            SU05           2Y 0O  8 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NO06           2Y 0O  9  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KOT06          3A  O  9  8OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KSE06          2Y 0O  9 14OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KAT06          9A  O  9 19OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NAM06          6A  O  9 29OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            SU06           2Y 0O  9 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NO07           2Y 0O 10  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KOT07          3A  O 10  8OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KSE07          2Y 0O 10 14OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KAT07          9A  O 10 19OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NAM07          6A  O 10 29OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            SU07           2Y 0O 10 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NO08           2Y 0O 11  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KOT08          3A  O 11  8OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KSE08          2Y 0O 11 14OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KAT08          9A  O 11 19OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NAM08          6A  O 11 29OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            SU08           2Y 0O 11 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NO09           2Y 0O 12  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KOT09          3A  O 12  8OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KSE09          2Y 0O 12 14OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KAT09          9A  O 12 19OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NAM09          6A  O 12 29OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            SU09           2Y 0O 12 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NO10           2Y 0O 13  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KOT10          3A  O 13  8OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KSE10          2Y 0O 13 14OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KAT10          9A  O 13 19OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NAM10          6A  O 13 29OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            SU10           2Y 0O 13 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NO11           2Y 0O 14  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KOT11          3A  O 14  8OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KSE11          2Y 0O 14 14OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KAT11          9A  O 14 19OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NAM11          6A  O 14 29OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            SU11           2Y 0O 14 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NO12           2Y 0O 15  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KOT12          3A  O 15  8OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KSE12          2Y 0O 15 14OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KAT12          9A  O 15 19OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NAM12          6A  O 15 29OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            SU12           2Y 0O 15 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NO13           2Y 0O 16  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KOT13          3A  O 16  8OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KSE13          2Y 0O 16 14OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KAT13          9A  O 16 19OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NAM13          6A  O 16 29OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            SU13           2Y 0O 16 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NO14           2Y 0O  4 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KOT14          3A  O  4 48OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KSE14          2Y 0O  4 54OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KAT14          9A  O  4 59OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NAM14          6A  O  4 69OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            SU14           2Y 0O  4 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NO15           2Y 0O  5 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KOT15          3A  O  5 48OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KSE15          2Y 0O  5 54OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KAT15          9A  O  5 59OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NAM15          6A  O  5 69OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            SU15           2Y 0O  5 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NO16           2Y 0O  6 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KOT16          3A  O  6 48OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KSE16          2Y 0O  6 54OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KAT16          9A  O  6 59OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NAM16          6A  O  6 69OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            SU16           2Y 0O  6 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NO17           2Y 0O  7 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KOT17          3A  O  7 48OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KSE17          2Y 0O  7 54OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KAT17          9A  O  7 59OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NAM17          6A  O  7 69OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            SU17           2Y 0O  7 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NO18           2Y 0O  8 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KOT18          3A  O  8 48OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KSE18          2Y 0O  8 54OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KAT18          9A  O  8 59OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NAM18          6A  O  8 69OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            SU18           2Y 0O  8 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NO19           2Y 0O  9 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KOT19          3A  O  9 48OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KSE19          2Y 0O  9 54OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KAT19          9A  O  9 59OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NAM19          6A  O  9 69OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            SU19           2Y 0O  9 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NO20           2Y 0O 10 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KOT20          3A  O 10 48OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KSE20          2Y 0O 10 54OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KAT20          9A  O 10 59OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NAM20          6A  O 10 69OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            SU20           2Y 0O 10 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NO21           2Y 0O 11 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KOT21          3A  O 11 48OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KSE21          2Y 0O 11 54OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KAT21          9A  O 11 59OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NAM21          6A  O 11 69OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            SU21           2Y 0O 11 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NO22           2Y 0O 12 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KOT22          3A  O 12 48OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KSE22          2Y 0O 12 54OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KAT22          9A  O 12 59OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NAM22          6A  O 12 69OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            SU22           2Y 0O 12 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NO23           2Y 0O 13 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KOT23          3A  O 13 48OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KSE23          2Y 0O 13 54OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KAT23          9A  O 13 59OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NAM23          6A  O 13 69OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            SU23           2Y 0O 13 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NO24           2Y 0O 14 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KOT24          3A  O 14 48OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KSE24          2Y 0O 14 54OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KAT24          9A  O 14 59OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NAM24          6A  O 14 69OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            SU24           2Y 0O 14 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NO25           2Y 0O 15 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KOT25          3A  O 15 48OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KSE25          2Y 0O 15 54OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KAT25          9A  O 15 59OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NAM25          6A  O 15 69OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            SU25           2Y 0O 15 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NO26           2Y 0O 16 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KOT26          3A  O 16 48OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KSE26          2Y 0O 16 54OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KAT26          9A  O 16 59OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            NAM26          6A  O 16 69OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            SU26           2Y 0O 16 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A                                 18  3'UPDATE'
     A                                      DSPATR(UL)
     A                                 18 11' NO '
     A                                      DSPATR(UL)
     A                                 18 17'PROCESS'
     A                                      DSPATR(UL)
     A                                 18 26'COMPT.NO.'
     A                                      DSPATR(UL)
     A                                 18 37'DIE NO'
     A                                      DSPATR(UL)
     A                                 18 54'DIE NAME'
     A                                      DSPATR(UL)
     A                                 18 66'NUMBER'
     A                                      DSPATR(UL)
     A                                 18 74'INST.'
     A                                      DSPATR(UL)
     A            D3OP           1A  O 19  5DSPATR(UL)
     A                                      OVRDTA
     A            D3NO           2Y 0O 19 12DSPATR(UL)
     A                                      OVRDTA
     A            XXKOTI         3A  O 19 19OVRDTA
     A            XXKSEI         2A  O 19 28OVRDTA
     A            XXKATA        15A  O 19 37OVRDTA
     A            XXKANM        10A  O 19 54OVRDTA
     A            XXKOSU         2Y 0O 19 68EDTCDE(4)
     A                                      OVRDTA
     A            XXKUNM         6A  O 19 74OVRDTA
     A            D3KOTI         3A  B 20 19DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            D3KSEI         2A  B 20 28DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            D3KATA         9A  B 20 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            D3KANM        10A  O 20 54OVRDTA
     A            D3KOSU         2Y 0B 20 68DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            D3KUBN         1A  B 20 76DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  60                                  DSPATR(PR)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A                                 20  2'0-CAN'
     A                                 21  2'1-CHG'
     A                                 22  2'2-ADD'
     A                                 21 73'0-NEW'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 17OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 22'UPDATE OK'
     A                                 24 32' CMD-5 '
     A                                      DSPATR(RI)
     A                                 24 43'RIGHT'
     A                                 24 50' RL-UP '
     A                                      DSPATR(RI)
     A                                 24 61'LEFT'
     A                                 24 67' RL-DN '
     A                                      DSPATR(RI)
     A*
     A          R GCQPW314
     A*%%TS  SD  19961008  143635  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN4')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE *-
     A                                      * '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW314'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  3  6'* DIE NO FOLLOWING ARE EXCLUSIVE. -
     A                                      PLEASE ABOLISH IT.'
     A            HIN           14A  O  4 40
     A                                  5  6'DIE NO'
     A                                      DSPATR(UL)
     A                                  5 17'LOCATION'
     A                                      DSPATR(UL)
     A                                  5 31'DIE NO'
     A                                      DSPATR(UL)
     A                                  5 42'LOCATION'
     A                                      DSPATR(UL)
     A                                  5 56'DIE NO'
     A                                      DSPATR(UL)
     A                                  5 67'LOCATION'
     A                                      DSPATR(UL)
     A            BAN01          9A  O  6  5OVRDTA
     A            TKR01         11A  O  6 16OVRDTA
     A            BAN02          9A  O  7  5OVRDTA
     A            TKR02         11A  O  7 16OVRDTA
     A            BAN03          9A  O  8  5OVRDTA
     A            TKR03         11A  O  8 16OVRDTA
     A            BAN04          9A  O  9  5OVRDTA
     A            TKR04         11A  O  9 16OVRDTA
     A            BAN05          9A  O 10  5OVRDTA
     A            TKR05         11A  O 10 16OVRDTA
     A            BAN06          9A  O 11  5OVRDTA
     A            TKR06         11A  O 11 16OVRDTA
     A            BAN07          9A  O 12  5OVRDTA
     A            TKR07         11A  O 12 16OVRDTA
     A            BAN08          9A  O 13  5OVRDTA
     A            TKR08         11A  O 13 16OVRDTA
     A            BAN09          9A  O 14  5OVRDTA
     A            TKR09         11A  O 14 16OVRDTA
     A            BAN10          9A  O 15  5OVRDTA
     A            TKR10         11A  O 15 16OVRDTA
     A            BAN11          9A  O 16  5OVRDTA
     A            TKR11         11A  O 16 16OVRDTA
     A            BAN12          9A  O 17  5OVRDTA
     A            TKR12         11A  O 17 16OVRDTA
     A            BAN13          9A  O 18  5OVRDTA
     A            TKR13         11A  O 18 16OVRDTA
     A            BAN14          9A  O 19  5OVRDTA
     A            TKR14         11A  O 19 16OVRDTA
     A            BAN15          9A  O 20  5OVRDTA
     A            TKR15         11A  O 20 16OVRDTA
     A            BAN16          9A  O 21  5OVRDTA
     A            TKR16         11A  O 21 16OVRDTA
     A            BAN17          9A  O 22  5OVRDTA
     A            TKR17         11A  O 22 16OVRDTA
     A            BAN18          9A  O  6 30OVRDTA
     A            TKR18         11A  O  6 41OVRDTA
     A            BAN19          9A  O  7 30OVRDTA
     A            TKR19         11A  O  7 41OVRDTA
     A            BAN20          9A  O  8 30OVRDTA
     A            TKR20         11A  O  8 41OVRDTA
     A            BAN21          9A  O  9 30OVRDTA
     A            TKR21         11A  O  9 41OVRDTA
     A            BAN22          9A  O 10 30OVRDTA
     A            TKR22         11A  O 10 41OVRDTA
     A            BAN23          9A  O 11 30OVRDTA
     A            TKR23         11A  O 11 41OVRDTA
     A            BAN24          9A  O 12 30OVRDTA
     A            TKR24         11A  O 12 41OVRDTA
     A            BAN25          9A  O 13 30OVRDTA
     A            TKR25         11A  O 13 41OVRDTA
     A            BAN26          9A  O 14 30OVRDTA
     A            TKR26         11A  O 14 41OVRDTA
     A            BAN27          9A  O 15 30OVRDTA
     A            TKR27         11A  O 15 41OVRDTA
     A            BAN28          9A  O 16 30OVRDTA
     A            TKR28         11A  O 16 41OVRDTA
     A            BAN29          9A  O 17 30OVRDTA
     A            TKR29         11A  O 17 41OVRDTA
     A            BAN30          9A  O 18 30OVRDTA
     A            TKR30         11A  O 18 41OVRDTA
     A            BAN31          9A  O 19 30OVRDTA
     A            TKR31         11A  O 19 41OVRDTA
     A            BAN32          9A  O 20 30OVRDTA
     A            TKR32         11A  O 20 41OVRDTA
     A            BAN33          9A  O 21 30OVRDTA
     A            TKR33         11A  O 21 41OVRDTA
     A            BAN34          9A  O 22 30OVRDTA
     A            TKR34         11A  O 22 41OVRDTA
     A            BAN35          9A  O  6 55OVRDTA
     A            TKR35         11A  O  6 66OVRDTA
     A            BAN36          9A  O  7 55OVRDTA
     A            TKR36         11A  O  7 66OVRDTA
     A            BAN37          9A  O  8 55OVRDTA
     A            TKR37         11A  O  8 66OVRDTA
     A            BAN38          9A  O  9 55OVRDTA
     A            TKR38         11A  O  9 66OVRDTA
     A            BAN39          9A  O 10 55OVRDTA
     A            TKR39         11A  O 10 66OVRDTA
     A            BAN40          9A  O 11 55OVRDTA
     A            TKR40         11A  O 11 66OVRDTA
     A            BAN41          9A  O 12 55OVRDTA
     A            TKR41         11A  O 12 66OVRDTA
     A            BAN42          9A  O 13 55OVRDTA
     A            TKR42         11A  O 13 66OVRDTA
     A            BAN43          9A  O 14 55OVRDTA
     A            TKR43         11A  O 14 66OVRDTA
     A            BAN44          9A  O 15 55OVRDTA
     A            TKR44         11A  O 15 66OVRDTA
     A            BAN45          9A  O 16 55OVRDTA
     A            TKR45         11A  O 16 66OVRDTA
     A            BAN46          9A  O 17 55OVRDTA
     A            TKR46         11A  O 17 66OVRDTA
     A            BAN47          9A  O 18 55OVRDTA
     A            TKR47         11A  O 18 66OVRDTA
     A            BAN48          9A  O 19 55OVRDTA
     A            TKR48         11A  O 19 66OVRDTA
     A            BAN49          9A  O 20 55OVRDTA
     A            TKR49         11A  O 20 66OVRDTA
     A            BAN50          9A  O 21 55OVRDTA
     A            TKR50         11A  O 21 66OVRDTA
     A            BAN51          9A  O 22 55OVRDTA
     A            TKR51         11A  O 22 66OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 22'UPDATE OK'
     A                                 24 32' CMD-5 '
     A                                      DSPATR(RI)
     A*
     A          R GCQPW315
     A                                      TEXT('SCREEN5')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW315'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  7 12'* THERE ARE ALL COMMON DIE NO. THE-
     A                                      RE IS NO DIE NO ABOLISHED'
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 22'UPDATE OK'
     A                                 24 32' CMD-5 '
     A                                      DSPATR(RI)
     A*
     A          R GCQPW316
     A                                      TEXT('SCREEN6')
     A                                      CF03
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW316'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  3  2'UPDATE STATUS INQUIRY'
     A                                  3 25'INT CO. P/N'
     A            HIN           14A  O  3 37OVRDTA
     A                                  3 53'MAKING PERSON'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            WUSR          12A  O  3 68DSPATR(HI)
     A                                  4 53'MAKING DATE'
     A                                      DSPATR(RI)
     A            WDAT           8Y 0O  4 68EDTWRD('    /  /  ')
     A                                      DSPATR(HI)
     A                                  5  2' PROC. COMPT. DIE NO. NAME   NBR. -
     A                                      INST.  UPDATE PERSON  UPD DATE TIME-
     A                                        DLT DATE'
     A                                      DSPATR(UL)
     A            DKOT01         3A  O  6  4OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DKSE01         2Y 0O  6 10OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DKAT01         9A  O  6 14OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DNAM01         6A  O  6 24OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DSU01          2Y 0O  6 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DKB01          6A  O  6 36OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DUSR01        12A  O  6 44OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DDAT01         6Y 0O  6 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DTIM01         4Y 0O  6 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DSAK01         6Y 0O  6 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            DKOT02         3A  O  7  4OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DKSE02         2Y 0O  7 10OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DKAT02         9A  O  7 14OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DNAM02         6A  O  7 24OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DSU02          2Y 0O  7 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DKB02          6A  O  7 36OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DUSR02        12A  O  7 44OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DDAT02         6Y 0O  7 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DTIM02         4Y 0O  7 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DSAK02         6Y 0O  7 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            DKOT03         3A  O  8  4OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DKSE03         2Y 0O  8 10OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DKAT03         9A  O  8 14OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DNAM03         6A  O  8 24OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DSU03          2Y 0O  8 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DKB03          6A  O  8 36OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DUSR03        12A  O  8 44OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DDAT03         6Y 0O  8 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DTIM03         4Y 0O  8 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DSAK03         6Y 0O  8 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            DKOT04         3A  O  9  4OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DKSE04         2Y 0O  9 10OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DKAT04         9A  O  9 14OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DNAM04         6A  O  9 24OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DSU04          2Y 0O  9 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DKB04          6A  O  9 36OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DUSR04        12A  O  9 44OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DDAT04         6Y 0O  9 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DTIM04         4Y 0O  9 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DSAK04         6Y 0O  9 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            DKOT05         3A  O 10  4OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DKSE05         2Y 0O 10 10OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DKAT05         9A  O 10 14OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DNAM05         6A  O 10 24OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DSU05          2Y 0O 10 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DKB05          6A  O 10 36OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DUSR05        12A  O 10 44OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DDAT05         6Y 0O 10 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DTIM05         4Y 0O 10 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DSAK05         6Y 0O 10 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            DKOT06         3A  O 11  4OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DKSE06         2Y 0O 11 10OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DKAT06         9A  O 11 14OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DNAM06         6A  O 11 24OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DSU06          2Y 0O 11 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DKB06          6A  O 11 36OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DUSR06        12A  O 11 44OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DDAT06         6Y 0O 11 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DTIM06         4Y 0O 11 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DSAK06         6Y 0O 11 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            DKOT07         3A  O 12  4OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DKSE07         2Y 0O 12 10OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DKAT07         9A  O 12 14OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DNAM07         6A  O 12 24OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DSU07          2Y 0O 12 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DKB07          6A  O 12 36OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DUSR07        12A  O 12 44OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DDAT07         6Y 0O 12 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DTIM07         4Y 0O 12 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DSAK07         6Y 0O 12 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            DKOT08         3A  O 13  4OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DKSE08         2Y 0O 13 10OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DKAT08         9A  O 13 14OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DNAM08         6A  O 13 24OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DSU08          2Y 0O 13 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DKB08          6A  O 13 36OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DUSR08        12A  O 13 44OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DDAT08         6Y 0O 13 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DTIM08         4Y 0O 13 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DSAK08         6Y 0O 13 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            DKOT09         3A  O 14  4OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DKSE09         2Y 0O 14 10OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DKAT09         9A  O 14 14OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DNAM09         6A  O 14 24OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DSU09          2Y 0O 14 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DKB09          6A  O 14 36OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DUSR09        12A  O 14 44OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DDAT09         6Y 0O 14 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DTIM09         4Y 0O 14 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DSAK09         6Y 0O 14 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            DKOT10         3A  O 15  4OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DKSE10         2Y 0O 15 10OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DKAT10         9A  O 15 14OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DNAM10         6A  O 15 24OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DSU10          2Y 0O 15 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DKB10          6A  O 15 36OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DUSR10        12A  O 15 44OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DDAT10         6Y 0O 15 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DTIM10         4Y 0O 15 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DSAK10         6Y 0O 15 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            DKOT11         3A  O 16  4OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DKSE11         2Y 0O 16 10OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DKAT11         9A  O 16 14OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DNAM11         6A  O 16 24OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DSU11          2Y 0O 16 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DKB11          6A  O 16 36OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DUSR11        12A  O 16 44OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DDAT11         6Y 0O 16 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DTIM11         4Y 0O 16 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DSAK11         6Y 0O 16 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            DKOT12         3A  O 17  4OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DKSE12         2Y 0O 17 10OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DKAT12         9A  O 17 14OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DNAM12         6A  O 17 24OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DSU12          2Y 0O 17 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DKB12          6A  O 17 36OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DUSR12        12A  O 17 44OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DDAT12         6Y 0O 17 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DTIM12         4Y 0O 17 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DSAK12         6Y 0O 17 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            DKOT13         3A  O 18  4OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DKSE13         2Y 0O 18 10OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DKAT13         9A  O 18 14OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DNAM13         6A  O 18 24OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DSU13          2Y 0O 18 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DKB13          6A  O 18 36OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DUSR13        12A  O 18 44OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DDAT13         6Y 0O 18 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DTIM13         4Y 0O 18 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DSAK13         6Y 0O 18 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            DKOT14         3A  O 19  4OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DKSE14         2Y 0O 19 10OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DKAT14         9A  O 19 14OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DNAM14         6A  O 19 24OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DSU14          2Y 0O 19 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DKB14          6A  O 19 36OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DUSR14        12A  O 19 44OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DDAT14         6Y 0O 19 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DTIM14         4Y 0O 19 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DSAK14         6Y 0O 19 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            DKOT15         3A  O 20  4OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DKSE15         2Y 0O 20 10OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DKAT15         9A  O 20 14OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DNAM15         6A  O 20 24OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DSU15          2Y 0O 20 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DKB15          6A  O 20 36OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DUSR15        12A  O 20 44OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DDAT15         6Y 0O 20 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DTIM15         4Y 0O 20 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DSAK15         6Y 0O 20 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            DKOT16         3A  O 21  4OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DKSE16         2Y 0O 21 10OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DKAT16         9A  O 21 14OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DNAM16         6A  O 21 24OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DSU16          2Y 0O 21 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DKB16          6A  O 21 36OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DUSR16        12A  O 21 44OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DDAT16         6Y 0O 21 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DTIM16         4Y 0O 21 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DSAK16         6Y 0O 21 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            DKOT17         3A  O 22  4OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DKSE17         2Y 0O 22 10OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DKAT17         9A  O 22 14OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DNAM17         6A  O 22 24OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DSU17          2Y 0O 22 32EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DKB17          6A  O 22 36OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DUSR17        12A  O 22 44OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DDAT17         6Y 0O 22 58EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DTIM17         4Y 0O 22 67EDTWRD('  :  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            DSAK17         6Y 0O 22 73EDTWRD('  .  .  ')
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A                                 23 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 23 16OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 22'BACKWARD'
     A                                 24 31' RL-DN '
     A                                      DSPATR(RI)
     A                                 24 40'FORWARD'
     A                                 24 48' RL-UP '
     A                                      DSPATR(RI)
     A*
     A          R GCQPW317
     A                                      TEXT('SCREEN3')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'INTRAL COMPANY P/N'
     A                                      DSPATR(UL)
     A                                  1 23' ** DIE ALLOTMENT M/F UPDATE ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW317'
     A            HIN           14A  O  2  4OVRDTA
     A                                  2 20'UPDATE INSTRUCTION'
     A            OPNM          12A  O  2 39OVRDTA
     A                                  2 59'NEXT DATA'
     A                                      DSPATR(RI)
     A            CON            6A  O  2 69OVRDTA
     A                                  3  2' NO. PROC. COMPT. DIE NO.  NAME   -
     A                                      NBR.'
     A                                      DSPATR(UL)
     A                                  3 42' NO. PROC. COMPT. DIE NO.  NAME   -
     A                                      NBR.'
     A                                      DSPATR(UL)
     A            NO01           2Y 0O  4  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KOT01          3A  O  4  8OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KSE01          2Y 0O  4 14OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            KAT01          9A  O  4 19OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NAM01          6A  O  4 29OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            SU01           2Y 0O  4 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(ND)
     A            NO02           2Y 0O  5  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KOT02          3A  O  5  8OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KSE02          2Y 0O  5 14OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            KAT02          9A  O  5 19OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NAM02          6A  O  5 29OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            SU02           2Y 0O  5 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(ND)
     A            NO03           2Y 0O  6  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KOT03          3A  O  6  8OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KSE03          2Y 0O  6 14OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            KAT03          9A  O  6 19OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NAM03          6A  O  6 29OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            SU03           2Y 0O  6 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(ND)
     A            NO04           2Y 0O  7  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KOT04          3A  O  7  8OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KSE04          2Y 0O  7 14OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            KAT04          9A  O  7 19OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NAM04          6A  O  7 29OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            SU04           2Y 0O  7 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(ND)
     A            NO05           2Y 0O  8  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KOT05          3A  O  8  8OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KSE05          2Y 0O  8 14OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            KAT05          9A  O  8 19OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NAM05          6A  O  8 29OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            SU05           2Y 0O  8 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(ND)
     A            NO06           2Y 0O  9  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KOT06          3A  O  9  8OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KSE06          2Y 0O  9 14OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            KAT06          9A  O  9 19OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NAM06          6A  O  9 29OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            SU06           2Y 0O  9 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  06                                  DSPATR(ND)
     A            NO07           2Y 0O 10  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KOT07          3A  O 10  8OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KSE07          2Y 0O 10 14OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            KAT07          9A  O 10 19OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NAM07          6A  O 10 29OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            SU07           2Y 0O 10 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  07                                  DSPATR(ND)
     A            NO08           2Y 0O 11  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KOT08          3A  O 11  8OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KSE08          2Y 0O 11 14OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            KAT08          9A  O 11 19OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NAM08          6A  O 11 29OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            SU08           2Y 0O 11 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  08                                  DSPATR(ND)
     A            NO09           2Y 0O 12  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KOT09          3A  O 12  8OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KSE09          2Y 0O 12 14OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            KAT09          9A  O 12 19OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NAM09          6A  O 12 29OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            SU09           2Y 0O 12 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  09                                  DSPATR(ND)
     A            NO10           2Y 0O 13  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KOT10          3A  O 13  8OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KSE10          2Y 0O 13 14OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            KAT10          9A  O 13 19OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NAM10          6A  O 13 29OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            SU10           2Y 0O 13 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  10                                  DSPATR(ND)
     A            NO11           2Y 0O 14  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KOT11          3A  O 14  8OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KSE11          2Y 0O 14 14OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            KAT11          9A  O 14 19OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NAM11          6A  O 14 29OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            SU11           2Y 0O 14 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(ND)
     A            NO12           2Y 0O 15  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KOT12          3A  O 15  8OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KSE12          2Y 0O 15 14OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            KAT12          9A  O 15 19OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NAM12          6A  O 15 29OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            SU12           2Y 0O 15 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(ND)
     A            NO13           2Y 0O 16  3EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KOT13          3A  O 16  8OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KSE13          2Y 0O 16 14OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            KAT13          9A  O 16 19OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NAM13          6A  O 16 29OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            SU13           2Y 0O 16 37EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(ND)
     A            NO14           2Y 0O  4 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KOT14          3A  O  4 48OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KSE14          2Y 0O  4 54OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            KAT14          9A  O  4 59OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NAM14          6A  O  4 69OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            SU14           2Y 0O  4 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(ND)
     A            NO15           2Y 0O  5 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KOT15          3A  O  5 48OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KSE15          2Y 0O  5 54OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            KAT15          9A  O  5 59OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NAM15          6A  O  5 69OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            SU15           2Y 0O  5 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(ND)
     A            NO16           2Y 0O  6 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KOT16          3A  O  6 48OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KSE16          2Y 0O  6 54OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            KAT16          9A  O  6 59OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NAM16          6A  O  6 69OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            SU16           2Y 0O  6 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  16                                  DSPATR(ND)
     A            NO17           2Y 0O  7 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KOT17          3A  O  7 48OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KSE17          2Y 0O  7 54OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            KAT17          9A  O  7 59OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NAM17          6A  O  7 69OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            SU17           2Y 0O  7 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  17                                  DSPATR(ND)
     A            NO18           2Y 0O  8 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KOT18          3A  O  8 48OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KSE18          2Y 0O  8 54OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            KAT18          9A  O  8 59OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NAM18          6A  O  8 69OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            SU18           2Y 0O  8 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  18                                  DSPATR(ND)
     A            NO19           2Y 0O  9 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KOT19          3A  O  9 48OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KSE19          2Y 0O  9 54OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            KAT19          9A  O  9 59OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NAM19          6A  O  9 69OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            SU19           2Y 0O  9 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  19                                  DSPATR(ND)
     A            NO20           2Y 0O 10 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KOT20          3A  O 10 48OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KSE20          2Y 0O 10 54OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            KAT20          9A  O 10 59OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NAM20          6A  O 10 69OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            SU20           2Y 0O 10 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  20                                  DSPATR(ND)
     A            NO21           2Y 0O 11 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KOT21          3A  O 11 48OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KSE21          2Y 0O 11 54OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            KAT21          9A  O 11 59OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NAM21          6A  O 11 69OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            SU21           2Y 0O 11 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(ND)
     A            NO22           2Y 0O 12 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KOT22          3A  O 12 48OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KSE22          2Y 0O 12 54OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            KAT22          9A  O 12 59OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NAM22          6A  O 12 69OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            SU22           2Y 0O 12 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  22                                  DSPATR(ND)
     A            NO23           2Y 0O 13 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KOT23          3A  O 13 48OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KSE23          2Y 0O 13 54OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            KAT23          9A  O 13 59OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NAM23          6A  O 13 69OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            SU23           2Y 0O 13 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  23                                  DSPATR(ND)
     A            NO24           2Y 0O 14 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KOT24          3A  O 14 48OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KSE24          2Y 0O 14 54OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            KAT24          9A  O 14 59OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NAM24          6A  O 14 69OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            SU24           2Y 0O 14 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  24                                  DSPATR(ND)
     A            NO25           2Y 0O 15 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KOT25          3A  O 15 48OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KSE25          2Y 0O 15 54OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            KAT25          9A  O 15 59OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NAM25          6A  O 15 69OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            SU25           2Y 0O 15 77EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  25                                  DSPATR(ND)
     A            NO26           2Y 0O 16 43EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KOT26          3A  O 16 48OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KSE26          2Y 0O 16 54OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            KAT26          9A  O 16 59OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            NAM26          6A  O 16 71OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A            SU26           2Y 0O 16 79EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  26                                  DSPATR(ND)
     A                                 18 25'CONFIRMATION SCREEN FOR COPYING'
     A                                      DSPATR(RI)
     A                                 20 25'* ABOVE DATA IS COPIED.'
     A                                 23 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 23 16OVRDTA
     A                                 24  3'KEY INPUT'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 22'UPDATE OK'
     A                                 24 32' CMD-5 '
     A                                      DSPATR(RI)
     A                                 24 44'RIGHT'
     A                                 24 50'RL-UP'
     A                                      DSPATR(RI)
     A                                 24 60'LEFT'
     A                                 24 65'RL-DN'
     A                                      DSPATR(RI)
