     A*********************************************
     A* PUBLICATION OF DIE RESERVE  M/F LIST    *
     A* FILE ID.             : GCQPW34.           *
     A* CREATE DATE. : MAR.05,'87. *
     A* AUTHOR.              : E.KAWASHIMA *
     A*********************************************
     A*                                     DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INVITE
     A*
     A          R GCQPW341
     A                                      CF01
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18'<< RESERVE PART NUMBER-
     A                                       FOR DIE NO INQUIRY >>'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW341'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  5 27'DIE NO'
     A                                      DSPATR(UL)
     A                                  5 47'SECTION'
     A                                      DSPATR(UL)
     A            KAT1           2A  B  7 27DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  7 30'-'
     A            KAT2           4A  B  7 32DSPATR(CS)
     A                                      CHECK(RZ)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            BUMCD          4Y 0B  7 49DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  9 21'+------ SECTION CODE  -------------
     A                                      ---------------+'
     A                                 10 21'| 0111- IAF             |         -
     A                                                     |'
     A                                 11 21'|                       |         -
     A                                                     |'
     A                                 12 21'|                       |         -
     A                                                     |'
     A                                 13 21'|                       |         -
     A                                                     |'
     A                                 14 21'|                       |         -
     A                                                     |'
     A                                 15 21'|                       |         -
     A                                                     |'
     A                                 16 21'|                       |         -
     A                                                     |'
     A                                 17 21'|                       |         -
     A                                                     |'
     A                                 18 21'+----------------------------------
     A                                      ---------------+'
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 16OVRDTA
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*
     A*
     A*
     A          R GCQPW342
     A*%%TS  SD  19961023  135709  AO          REL-V3R0M5  5763-PW1
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      PUTOVR
     A                                      KEEP
     A  99                                  ALARM
     A                                  1  3'DIE NO'
     A            KATXX          7A  O  1 10OVRDTA
     A                                  1 19'<< RESERVE PART NUMBER-
     A                                       FOR DIE NO INQUIRY >>'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  1 68'FMT GCQPW341'
     A                                  2  3'SECTION'
     A            BUMCD          4Y 0O  2 15EDTCDE(4)
     A                                      OVRDTA
     A                                  3 60'DATA COUNT'
     A            KENSU          4Y 0O  3 72DSPATR(BL)
     A                                      EDTCDE(4)
     A                                      OVRDTA
     A                                  4  3'PART NUMBER     SEC  PROC  COMPT N-
     A                                      O'
     A                                      DSPATR(UL)
     A                                  4 42'PART NUMBER     SEC  PROC  COMPT N-
     A                                      O'
     A                                      DSPATR(UL)
     A            HIN01         14A  O  5  3OVRDTA
     A            HIN02         14A  O  6  3OVRDTA
     A            HIN03         14A  O  7  3OVRDTA
     A            HIN04         14A  O  8  3OVRDTA
     A            HIN05         14A  O  9  3OVRDTA
     A            HIN06         14A  O 10  3OVRDTA
     A            HIN07         14A  O 11  3OVRDTA
     A            HIN08         14A  O 12  3OVRDTA
     A            HIN09         14A  O 13  3OVRDTA
     A            HIN10         14A  O 14  3OVRDTA
     A            HIN11         14A  O 15  3OVRDTA
     A            HIN12         14A  O 16  3OVRDTA
     A            HIN13         14A  O 17  3OVRDTA
     A            HIN14         14A  O 18  3OVRDTA
     A            HIN15         14A  O 19  3OVRDTA
     A            HIN16         14A  O 20  3OVRDTA
     A            BUM01          4A  O  5 19OVRDTA
     A            BUM02          4A  O  6 19OVRDTA
     A            BUM03          4A  O  7 19OVRDTA
     A            BUM04          4A  O  8 19OVRDTA
     A            BUM05          4A  O  9 19OVRDTA
     A            BUM06          4A  O 10 19OVRDTA
     A            BUM07          4A  O 11 19OVRDTA
     A            BUM08          4A  O 12 19OVRDTA
     A            BUM09          4A  O 13 19OVRDTA
     A            BUM10          4A  O 14 19OVRDTA
     A            BUM11          4A  O 15 19OVRDTA
     A            BUM12          4A  O 16 19OVRDTA
     A            BUM13          4A  O 17 19OVRDTA
     A            BUM14          4A  O 18 19OVRDTA
     A            BUM15          4A  O 19 19OVRDTA
     A            BUM16          4A  O 20 19OVRDTA
     A            KOT01          3A  O  5 24OVRDTA
     A            KOT02          3A  O  6 24OVRDTA
     A            KOT03          3A  O  7 24OVRDTA
     A            KOT04          3A  O  8 24OVRDTA
     A            KOT05          3A  O  9 24OVRDTA
     A            KOT06          3A  O 10 24OVRDTA
     A            KOT07          3A  O 11 24OVRDTA
     A            KOT08          3A  O 12 24OVRDTA
     A            KOT09          3A  O 13 24OVRDTA
     A            KOT10          3A  O 14 24OVRDTA
     A            KOT11          3A  O 15 24OVRDTA
     A            KOT12          3A  O 16 24OVRDTA
     A            KOT13          3A  O 17 24OVRDTA
     A            KOT14          3A  O 18 24OVRDTA
     A            KOT15          3A  O 19 24OVRDTA
     A            KOT16          3A  O 20 24OVRDTA
     A            KSE01          2A  O  5 32OVRDTA
     A            KSE02          2A  O  6 32OVRDTA
     A            KSE03          2A  O  7 32OVRDTA
     A            KSE04          2A  O  8 32OVRDTA
     A            KSE05          2A  O  9 32OVRDTA
     A            KSE06          2A  O 10 32OVRDTA
     A            KSE07          2A  O 11 32OVRDTA
     A            KSE08          2A  O 12 32OVRDTA
     A            KSE09          2A  O 13 32OVRDTA
     A            KSE10          2A  O 14 32OVRDTA
     A            KSE11          2A  O 15 32OVRDTA
     A            KSE12          2A  O 16 32OVRDTA
     A            KSE13          2A  O 17 32OVRDTA
     A            KSE14          2A  O 18 32OVRDTA
     A            KSE15          2A  O 19 32OVRDTA
     A            KSE16          2A  O 20 32OVRDTA
     A            HIN17         14A  O  5 42OVRDTA
     A            HIN18         14A  O  6 42OVRDTA
     A            HIN19         14A  O  7 42OVRDTA
     A            HIN20         14A  O  8 42OVRDTA
     A            HIN21         14A  O  9 42OVRDTA
     A            HIN22         14A  O 10 42OVRDTA
     A            HIN23         14A  O 11 42OVRDTA
     A            HIN24         14A  O 12 42OVRDTA
     A            HIN25         14A  O 13 42OVRDTA
     A            HIN26         14A  O 14 42OVRDTA
     A            HIN27         14A  O 15 42OVRDTA
     A            HIN28         14A  O 16 42OVRDTA
     A            HIN29         14A  O 17 42OVRDTA
     A            HIN30         14A  O 18 42OVRDTA
     A            HIN31         14A  O 19 42OVRDTA
     A            HIN32         14A  O 20 42OVRDTA
     A            BUM17          4A  O  5 58OVRDTA
     A            BUM18          4A  O  6 58OVRDTA
     A            BUM19          4A  O  7 58OVRDTA
     A            BUM20          4A  O  8 58OVRDTA
     A            BUM21          4A  O  9 58OVRDTA
     A            BUM22          4A  O 10 58OVRDTA
     A            BUM23          4A  O 11 58OVRDTA
     A            BUM24          4A  O 12 58OVRDTA
     A            BUM25          4A  O 13 58OVRDTA
     A            BUM26          4A  O 14 58OVRDTA
     A            BUM27          4A  O 15 58OVRDTA
     A            BUM28          4A  O 16 58OVRDTA
     A            BUM29          4A  O 17 58OVRDTA
     A            BUM30          4A  O 18 58OVRDTA
     A            BUM31          4A  O 19 58OVRDTA
     A            BUM32          4A  O 20 58OVRDTA
     A            KOT17          3A  O  5 65OVRDTA
     A            KOT18          3A  O  6 65OVRDTA
     A            KOT19          3A  O  7 65OVRDTA
     A            KOT20          3A  O  8 65OVRDTA
     A            KOT21          3A  O  9 65OVRDTA
     A            KOT22          3A  O 10 65OVRDTA
     A            KOT23          3A  O 11 65OVRDTA
     A            KOT24          3A  O 12 65OVRDTA
     A            KOT25          3A  O 13 65OVRDTA
     A            KOT26          3A  O 14 65OVRDTA
     A            KOT27          3A  O 15 65OVRDTA
     A            KOT28          3A  O 16 65OVRDTA
     A            KOT29          3A  O 17 65OVRDTA
     A            KOT30          3A  O 18 65OVRDTA
     A            KOT31          3A  O 19 65OVRDTA
     A            KOT32          3A  O 20 65OVRDTA
     A            KSE17          2A  O  5 73OVRDTA
     A            KSE18          2A  O  6 73OVRDTA
     A            KSE19          2A  O  7 73OVRDTA
     A            KSE20          2A  O  8 73OVRDTA
     A            KSE21          2A  O  9 73OVRDTA
     A            KSE22          2A  O 10 73OVRDTA
     A            KSE23          2A  O 11 73OVRDTA
     A            KSE24          2A  O 12 73OVRDTA
     A            KSE25          2A  O 13 73OVRDTA
     A            KSE26          2A  O 14 73OVRDTA
     A            KSE27          2A  O 15 73OVRDTA
     A            KSE28          2A  O 16 73OVRDTA
     A            KSE29          2A  O 17 73OVRDTA
     A            KSE30          2A  O 18 73OVRDTA
     A            KSE31          2A  O 19 73OVRDTA
     A            KSE32          2A  O 20 73OVRDTA
     A                                 21 42'FOLLOWING DATA EXIST'
     A                                      OVRATR
     A N88                                  DSPATR(ND)
     A  88                                  DSPATR(RI)
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A            ERR           60A  O 22 16OVRDTA
     A                                 24  2'PRV SCREEN'
     A                                 24 13'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 20'LIST'
     A                                 24 25'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 33'NEXT DETAILS'
     A                                 24 47'ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 57'PRV DETAILS'
     A                                 24 70'ROLL-DOWN'
     A                                      DSPATR(RI)
