     A** GCRPW20 ****************************************
     A* CREATE DIE ALLOTMENT CSV DATA                   *
     A*    ITS.                  2013.08.26             *
     A***************************************************
     A                                      PRINT CHGINPDFT
     A*---------------------------*
     A*      ...画面－１...     *
     A*---------------------------*
     A          R GCRPW201                  TEXT('第１画面')
     A                                      KEEP
     A                                      CF01(01) CF05(05) BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' ** TOOL KANBAN MAINTENANCE +
     A                                      DATA CREATION ** '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT GCRPW20'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A                                  6 20'DATA IS CREATED.'
     A                                 10 20'PLEASE PUSH F5.'
     A                                 10 36'IF IT IS OK.'
      *
     A  99                             22 11' ERR '
     A  99                                  DSPATR(RI BL)
     A  99        MSG           60     22 18
     A                                 24  2'EXIT'
     A                                   + 1' F1 '
     A                                      DSPATR(RI)
     A                                   + 2'DATA CREATE'
     A                                   + 1' F5 '
     A                                      DSPATR(RI)
