     A** GCRPW01 *******************************************
     A* PART NO. -> DIE NO.                                *
     A* T.SAKASHITA          2013/APL/29                   *
     A******************************************* BTMPWD1 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A*----------------------------------------------------------------
     A          R SFREC1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ')
     A                                      SFL
     A            S1RENO         4  0   6 15
     A            S1UHN1         5   B  6 25DSPATR(CS)
     A            S1UHN2         5   B  6 31DSPATR(CS)
     A            S1UHN3         2   B  6 37DSPATR(CS)
     A            S1SETI         8  0B  6 47DSPATR(CS)
     A                                      EDTCDE(L)
     A*----------------------------------------------------------------
      *
     A          R SFCTL1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ ﾃ]nﾜｰﾓ')
     A                                      SFLCTL(SFREC1)
     A                                      CF03 BLINK
     A                                      CF05
     A                                      CF24
     A  99                                  ALARM
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(14) SFLSIZ(15)
     A  71                                  SFLDSP SFLDSPCTL
     A  72                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP(73)
     A                                      ROLLDOWN(73)
     A* 99                                  SFLMSG(' END OF DATA      ' 99)
     A            DSPRRN         4  0H      SFLRCDNBR
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'  PART NO. -> DIE NO.     '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'GCRPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  5 25' PART NO.'
     A                                       DSPATR(UL)
     A                                  5 45' MONTHLY VOL. '
     A                                       DSPATR(UL)
      *
     A          R DSP01                     TEXT('ﾃu]nﾞ ﾈlxb')
     A                                 21 02' DATA WILL BE CREATED IN THE +
     A                                      FOLLOWING PATH'
     A N55                             22 02'\\IAF-AS400-FILE\AS400-TRANS\+
     A                                       \MANUFACTURING\DOWNLOAD\+
     A                                       *USERID*\DIE-PART NO.CSV'
     A                                      DSPATR(HI)
     A  55                             22 02'K:\ACCOUNTING\DOWNLOAD\+
     A                                       *USERID*\DIE-PART NO.CSV       +
     A                                                                      '
     A                                      DSPATR(HI)
      *
     A                                 24  2' F3 ' DSPATR(RI)
     A                                   + 1' PREV '
     A                                   + 2' F5 ' DSPATR(RI)
     A                                   + 1' RUN '
     A                                   + 2' F24 ' DSPATR(RI)
     A                                   + 1' CLEAR '
     A                                   +25' PAGE UP/DOWN ' DSPATR(RI)
