     A*%%TS  SD  20030512  135706  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01(01)
     A          R DSP01
     A*%%TS  SD  20030512  135706  TEST        REL-V4R4M0  5769-PW1
     A                                  1  3'GDAC00'
     A                                  1 20'** ASJ MATERIAL ORDER PROCESSING *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  9 18'3. CHANGE SUMMARIZED DATA'
     A                                 11 18'4. ISSUE ORDER SHEETS'
     A                                 13 18'5. RE-ISSUE ORDER SHEETS'
     A                                 18 19'SELECT -->'
     A                                      DSPATR(HI)
     A            D@OPT          1A  B 18 30DSPATR(CS)
     A                                 23  3'F1:END'
     A                                  4 18'1. ORDER ENTRY'
     A                                  4 33'(Scan'
     A                                  4 39'barcodes,or'
     A                                  4 51'input'
     A                                  4 57'manually,'
     A                                  4 67'or'
     A                                  5 34'change'
     A                                  5 41'the'
     A                                  5 45'data'
     A                                  5 50'before'
     A                                  5 57'summarization.)'
     A                                  7 18'2. SUMMARIZE ORDER DATA'
     A                                  7 42'(After #1)'
     A                                 11 40'(After #2)'
     A                                 15 18'6. CHANGE ORDER DATA'
     A                                 15 39'(After #4)'
