     A*%%TS  SD  20030520  120125  TEST        REL-V4R4M0  5769-PW1
     A*** GDGAW01 <DSPF> *********************************************
     A*   MATERIAL KANBAN READ
     A*                    TCH        03/02/03       *
     A* TCHK1 01/07/08 CHG 0002 TO 8990
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF01
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20030206  142004  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1 26'** MATERIAL ORDER SYSTEM **'
     A                                      DSPATR(RI)
     A                                  2 30'<< ORDER ENTRY >>'
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 69
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  8 25'SUPPLIER'
     A            D@SUPL         4A  B  8 36DSPATR(CS)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
TCHK1A*                                 8 42'0002 - AMC'
TCHK1A                                  8 42'8990 - ASJ'
     A**************
     A* DSP01 *
     A**************
     A          R DSP02
     A*%%TS  SD  20030203  155047  TEST        REL-V4R4M0  5769-PW1
     A                                      CF07
     A                                      CF09
     A                                      CF03
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** MATERIAL ORDER SYSTEM **'
     A                                      DSPATR(RI)
     A                                  2 30'<< ORDER ENTRY >>'
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 69
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  5 12' BARCODE --->'
     A            D1BAR         17A  B  5 27CHECK(ER)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A**************
     A* DSP03  *
     A**************
     A          R DSP03
     A*%%TS  SD  20030203  155331  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** MATERIAL ORDER SYSTEM **'
     A                                      DSPATR(RI)
     A                                  2 30'<< ORDER ENTRY >>'
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 69
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  4  5' MANUAL INPUT '
     A                                      DSPATR(RI)
     A                                  7 10'MATERIAL CODE'
     A                                  7 33'NUMBER OF KANBANS'
     A                                  7 52'PROD.CODE'
     A                                  7 64'ORDER DATE'
     A            PWIR          15A  B  9 10DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            PSIZ           5Y 2B  9 26EDTCDE(4) DSPATR(CS)
     A  21                                  DSPATR(RI)
     A            PMAI           3Y 0B  9 41EDTCDE(4) DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            PCOD           1A  B  9 56DSPATR(CS)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            PDAT           8Y 0B  9 65EDTCDE(4) DSPATR(CS)
     A  24                                  DSPATR(RI PC)
     A**************
     A* SFL01
     A**************
     A          R SFL01                     SFL
     A*%%TS  SD  20030205  125539  TEST        REL-V4R4M0  5769-PW1
     A            IKUBN          1A  O  6  6
     A            S1MARK         1A  B  6  9DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            S1ZAIS        15A  O  6 12
     A            S1ZAIK         5Y 2O  6 28EDTCDE(4)
     A            S1MAIS         3Y 0B  6 37EDTCDE(4) DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S1ZETI         4A  O  6 44
     A            S1SEIH         1A  O  6 55
     A            S1HAHZ         8Y 0O  6 62EDTWRD('    /  /  ')
     A            H1ODER         6Y 0H
     A            H1RENB         6S 0H
     A**************
     A* CTL01
     A**************
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20030206  154908  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      CF03
     A                                      CF05
     A                                      OVERLAY
     A  81                                  SFLDSP
     A  82                                  SFLDSPCTL
     A  83                                  SFLCLR
     A            NBR            4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** MATERIAL ORDER SYSTEM **'
     A                                      DSPATR(RI)
     A                                  2 30'<< ORDER ENTRY >>'
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 69
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  3  5' DATA CORRECTION SCREEN '
     A                                      DSPATR(RI)
     A                                  3 41'MATERIAL'
     A            D3ZAIS        15A  O  3 50
     A            D3ZAIK         5Y 2O  3 66EDTCDE(4)
     A                                  5  6'  MRK MATERIAL                KANB-
     A                                      S  ID NO.   PRD.CODE  INPUT DATE '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 36'# OF'
     A                                      DSPATR(HI)
     A          R WIN01
     A*%%TS  SD  20030520  120125  TEST        REL-V4R4M0  5769-PW1
     A                                      FRCDTA
     A                                      OVERLAY
     A                                      WINDOW(10 10 8 50)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI))
     A                                      USRRSTDSP
     A                                  1 16'<< CONFIRMATION >>'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  3  2'MATERIAL'
     A                                      DSPATR(HI)
     A                                  3 27'ID'
     A                                      DSPATR(HI)
     A                                  3 32'ORDER#'
     A                                      DSPATR(HI)
     A            D@ZAIS        15A  O  4  2
     A            D@ZAIK         5Y 2O  4 18EDTCDE(4)
     A            D@ZETI         4A  O  4 26
     A            D@ORDR         6Y 0O  4 32EDTCDE(4)
     A            D@CASE         5Y 0O  4 41EDTCDE(4)
     A                                  3 41'CASE#'
     A                                      DSPATR(HI)
     A*---------------------------------------------------
     A          R DSP98
     A*%%TS  SD  20030205  104716  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                 20  9'|'
     A                                 21  9'+----> INPUT "0" TO DELETE'
     A                                 20  6'|'
     A                                 21  6'|'
     A                                 22  6'+--------> D:INC/DECREASE H:MANUAL-
     A                                       INPUT  K:KANBAN READ'
     A**************
     A* MSG        *
     A**************
     A          R DSP99
     A            D@MSG         78     24  2
     A                                      DSPATR(BL)
     A            D@CMD         78     23  2
     A* SFL01
     A**************
     A          R SFL02                     SFL
     A*%%TS  SD  20030318  094508  TEST        REL-V4R4M0  5769-PW1
     A            IKUBN          1A  O  6  6
     A            S1ZAIS        15A  O  6 12
     A            S1ZAIK         5Y 2O  6 28EDTCDE(4)
     A            S1MAIS         3Y 0O  6 37EDTCDE(4)
     A            S1ZETI         4A  O  6 44
     A            S1SEIH         1A  O  6 55
     A            S1HAHZ         8Y 0O  6 62EDTWRD('    /  /  ')
     A            H1ODER         6Y 0H
     A            H1RENB         6S 0H
     A**************
     A          R CTL02                     SFLCTL(SFL02)
     A*%%TS  SD  20030318  094508  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A                                      CF03
     A                                      OVERLAY
     A  81                                  SFLDSP
     A  82                                  SFLDSPCTL
     A  83                                  SFLCLR
     A            NBR            4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'** MATERIAL ORDER SYSTEM **'
     A                                      DSPATR(RI)
     A                                  2 30'<< ORDER ENTRY >>'
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 69
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  3  5' DATA CORRECTION SCREEN '
     A                                      DSPATR(RI)
     A                                  3 41'MATERIAL'
     A            D3ZAIS        15A  O  3 50
     A            D3ZAIK         5Y 2O  3 66EDTCDE(4)
     A                                  5  6'      MATERIAL                KANB-
     A                                      S  ID NO.   PRD.CODE  INPUT DATE '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 36'# OF'
     A                                      DSPATR(HI)
     A          R DSP97
     A*%%TS  SD  20030318  094508  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                 20  6'|'
     A                                 21  6'|'
     A                                 22  6'+--------> D:INC/DECREASE H:MANUAL-
     A                                       INPUT  K:KANBAN READ'
