     A*%%TS  SD  20020827  163207  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A          R DSP01                     OVERLAY
     A*%%TS  SD  20010716  142122  TEST        REL-V3R7M0  5716-PW1
     A            #PGM           8   O  1  3
     A                                  1 27'ASJ PART - QUICK SCHEDULE'
     A                                      DSPATR(RI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 69TIME
     A                                  3  7'PART#:' DSPATR(HI)
     A            D@PRT1         5   B  3 14DSPATR(CS)
     A  61                                  DSPATR(RI PC)
     A            D@PRT2         5   B  3 20DSPATR(CS)
     A  61                                  DSPATR(RI)
     A            D@PRT3         2   B  3 26DSPATR(CS)
     A  61                                  DSPATR(RI)
     A                                  4  7'STOCK:' DSPATR(HI)
     A            D@STCK         7  0B  4 14EDTCDE(4) DSPATR(CS)
     A                                  4 22'(BOXES)' DSPATR(HI)
     A          R SFL01                     SFL
     A*%%TS  SD  20020827  163207  TEST        REL-V4R4M0  5769-PW1
     A            S@DATE         4Y 0O  7  5EDTWRD('  /  ')
     A            S@HLDY         1A  O  7 11
     A            S@IVNO         6A  B  7 14
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            S@STK1         5Y 0O  7 22EDTCDE(M)
     A            S@AIR          5Y 0B  7 44EDTCDE(4)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            S@SEA          5Y 0B  7 52EDTCDE(4)
     A  63                                  DSPATR(RI)
     A            S@ORD          5Y 0B  7 59EDTCDE(4)
     A            S@STK2         5Y 0O  7 74EDTCDE(M)
     A            S@SIML         1A  B  7  2DSPATR(CS)
     A            S@SAIR         3Y 0B  7 31EDTCDE(4)
     A  63                                  DSPATR(RI)
     A            S@SRMK         4A  B  7 37
     A            H@IVNO         6A  H
     A            H@DATE         8S 0H
     A            S@CHBX         5Y 0B  7 67EDTCDE(4)
     A            H@CHBX         5  0H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020827  163207  TEST        REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      OVERLAY
     A                                      CF12
     A                                      CF05
     A                                      CF07
     A                                      CF09
     A                                      CF11
     A  52                                  SFLDSP
     A  52                                  SFLDSPCTL
     A  51                                  SFLCLR
     A                                      ROLLUP(38)
     A            #RCNO1         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  3
     A                                  1 27'ASJ PART - QUICK SCHEDULE'
     A                                      DSPATR(RI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 69TIME
     A                                  2  3'PART#:'
     A                                      DSPATR(HI)
     A            D@PRT1         5A  O  2 10
     A            D@PRT2         5A  O  2 16
     A            D@PRT3         2A  O  2 22
     A            D@PPBX         7Y 0O  2 61EDTCDE(1)
     A                                  3  3'BOXES/DAY:'
     A                                      DSPATR(HI)
     A            D@BXDY         7Y 0B  3 14EDTCDE(1)
     A                                  3 46'INVENTORY/DAY:'
     A                                      DSPATR(HI)
     A            D@IVDY         8Y 1O  3 61EDTCDE(1)
     A                                  4  3'LOCATION:'
     A                                      DSPATR(HI)
     A            D@LOC1         1A  O  4 14
     A            D@LOC2         2A  O  4 16
     A            D@LOC3         2A  O  4 19
     A            D@LOC4         1A  O  4 22
     A            D@LINE        78A  O  5  2DSPATR(UL)
     A                                  6  6'DATE'
     A                                      DSPATR(HI)
     A                                  6 13'INVOICE#'
     A                                      DSPATR(HI)
     A                                  6 22'STOCK'
     A                                      DSPATR(HI)
     A                                  6 46'AIR'
     A                                      DSPATR(HI)
     A                                  6 53'SHIP'
     A                                      DSPATR(HI)
     A                                  6 59'ORDER'
     A                                      DSPATR(HI)
     A                                  6 74'STOCK'
     A                                      DSPATR(HI)
     A                                  6  2'X'
     A                                      DSPATR(HI)
     A                                  2 46'PCS/DAY:'
     A                                      DSPATR(HI)
     A                                  6 31'AIR(SPECIAL)'
     A                                      DSPATR(HI)
     A                                  6 66'CHANGE' DSPATR(HI)
     A          R DSP99
     A            D@LIN2        78   O 22  2DSPATR(UL)
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2
