     A*%%TS  SD  20001111  181217  QPGMR       REL-V3R7M0  5716-PW1
     A** GDGPW35 ********************
     A*  PRINT NON-DELIVERY LISTER  *
     A*    K.YASUDA     2000.10.24  *
     A******************** GDGPW35 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*----------*
     A* SCREEN 1 *
     A*----------*
     A          R GDGPW351
     A*%%TS  SD  20001111  181217  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 27'** PRINT NON-DELIVERY LIST **'
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDGPW35'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  6 18'IN ORDER BY PARTS NO.'
     A                                      DSPATR(RI)
     A                                  8 23'1.NON-DELIVERY LIST'
     A                                 10 23'2.ORDER HISTORY LIST'
     A                                 12 18'IN ORDER BY ORDER NO.'
     A                                      DSPATR(RI)
     A                                 14 23'3.NON-DELIVERY LIST'
     A                                 16 23'4.ORDER HISTORY LIST'
     A            @NO            1A  B 18 23OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 18 26'<----INPUT MENU NO.'
     A                                 22 11' ERROR '
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            MSG           59A  O 22 23OVRATR
     A                                      OVRDTA
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  5'EXIT'
     A                                 24 13' CMD-1 '
     A                                      DSPATR(RI)
     A*----------*
     A* SCREEN 2 *
     A*----------*
     A          R GDGPW352
     A*%%TS  SD  20001111  181039  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 27'** PRINT NON-DELIVERY LIST **'
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDGPW35'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                 10 23'PARTS NO.'
     A                                 12 23'ORDER NO.'
     A            IHIN1          5A  B 10 35OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 10 41'-'
     A            IHIN2          5A  B 10 43OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 10 49'-'
     A            IHIN3          2A  B 10 51OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 12 35'IAF -'
     A            ISODR          6A  B 12 41OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 12 48'-'
     A                                 12 50'IAF -'
     A            IEODR          6A  B 12 56OVRATR
     A                                      OVRDTA
     A                                      DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 15 18'ALL DATA IS PRINTED OUT'
     A                                 15 42'IF DATA IS NOT INPUT.'
     A                                 22 11' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            MSG           59A  O 22 20OVRATR
     A                                      OVRDTA
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  5'GO BACK'
     A                                 24 13' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 25'PRINT OK'
     A                                 24 34' CMD-5 '
     A                                      DSPATR(RI)
