     A*%%TS  SD  20240509  103828  I0777       REL-V7R4M0  5770-WDS
     A**** GDGPW13 <DSPF> ********************************************
     A*   CHANGE CARRY CODE SHIP > AIR
     A*       G.B.C                         2003.11.28
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(CS)
     A                                      PRINT
     A**************
     A* SFL01
     A**************
     A          R SFREC1                    SFL
     A*%%TS  SD  20240508  153017  I0777       REL-V7R4M0  5770-WDS
     A            S1CHG          1A  B  6  3TEXT('CHG')
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            S1HIN         14A  O  6  6TEXT('PART NO.')
     A            S1SURY         9Y 0O  6 22TEXT('QTY')
     A                                      EDTCDE(2)
     A            S1SYOS         7Y 0O  6 35TEXT('QTY/BOX')
     A                                      EDTCDE(2)
     A            S1MAIS         5Y 0O  6 46TEXT('BOX')
     A                                      EDTCDE(2)
     A            S1SHIP         5Y 0O  6 54TEXT('SHIP/BOX')
     A                                      EDTCDE(2)
     A            S1AIR          5Y 0O  6 62TEXT('AIR/BOX')
     A                                      EDTCDE(2)
     A            S1DLVR         8Y 0O  6 70TEXT('DELIVERY')
     A                                      EDTWRD('  .  .    ')
     A            S1ZETI         4A  H      TEXT('IAF PART ID NO')
     A            S1SEIH         1A  H      TEXT('PART CODE')
     A**************
     A* CTL01
     A**************
     A          R SFCTL                     SFLCTL(SFREC1)
     A*%%TS  SD  20240509  103828  I0777       REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A                                      CF01
     A                                      OVERLAY
     A                                      PROTECT
     A  81                                  SFLDSP
     A  82                                  SFLDSPCTL
     A  83                                  SFLCLR
     A            RRN            4S 0H      SFLRCDNBR
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' CHANGE CARRY CODE SHIP / AIR '
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDGPW13'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A*
     A                                  3 25' ORDER NO. '
     A                                      DSPATR(RI)
     A            D1ODR0         3A  O  3 37
     A                                  3 41'-'
     A            D1ODR1         2Y 0O  3 43EDTCDE(4)
     A                                  3 46'-'
     A            D1ODR2         2Y 0O  3 48EDTCDE(4)
     A                                  3 51'-'
     A            D1ODR3         2Y 0O  3 53EDTCDE(4)
     A*
     A                                  5  2'CHG  PARTS NO.              QTY   -
     A                                       QTY/BOX ALL BOX    SHIP     AIR   -
     A                                       DELIVERY'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A*         1         2         3         4         5         6
     A*123456789012345678901234567890123456789012345678901234567890
     A* CHG  PARTS NO.              QTY    QTY/BOX     BOX
     A*  X  XXXXX-XXXXX-XX  999,999,999  9,999,999  99,999
     A*         5         6         7         8
     A*1234567890123456789012345678901234567890
     A*        BOX    SHIP     AIR    DELIVERY
     A*     99,999  99,999  99,999  99.99.9999
     A*
     A**************
     A* DSP01
     A**************
     A          R DSP01
     A                                 19  3'|'
     A                                 20  3'+------> INPUT "1" TO-
     A                                       CHANGE.'
     A  99                             22 10' ERROR ' DSPATR(RI BL)
     A  99        D#MSG         60     22 19DSPATR(BL)
     A                                 24  2' F1 '
     A                                      DSPATR(RI)
     A                                   + 1'EXIT'
     A                                 24 60' PAGE U/D '
     A                                      DSPATR(RI)
     A                                   + 1'ROLL U/D'
     A*
     A**************
     A* DSP02
     A**************
     A          R DSP02
     A*%%TS  SD  20240508  153017  I0777       REL-V7R4M0  5770-WDS
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 25' CHANGE CARRY CODE SHIP / AIR '
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDGPW13'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A*
     A                                  3 25' ORDER NO. '
     A                                      DSPATR(RI)
     A            D1ODR0         3A  O  3 37
     A                                  3 41'-'
     A            D1ODR1         2Y 0O  3 43EDTCDE(4)
     A                                  3 46'-'
     A            D1ODR2         2Y 0O  3 48EDTCDE(4)
     A                                  3 51'-'
     A            D1ODR3         2Y 0O  3 53EDTCDE(4)
     A*
     A                                  6 14'    PART NO.    '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  6 32'   ALL QTY   '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  6 47' ALL BOX'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  6 57'  QTY/BOX  '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A*
     A            D2HIN         14A  O  8 15TEXT('PART NO.')
     A            D2SURY         9Y 0O  8 33TEXT('QTY')
     A                                      EDTCDE(2)
     A            D2MAIS         5Y 0O  8 48TEXT('BOX')
     A                                      EDTCDE(2)
     A            D2SYOS         7Y 0O  8 58TEXT('QTY/BOX')
     A                                      EDTCDE(2)
     A*
     A                                 11 30'     SHIP/BOX'
     A                                      DSPATR(HI)
     A                                 13 30'      AIR/BOX'
     A                                      DSPATR(HI)
     A                                 15 30'DELIVERY DATE'
     A                                      DSPATR(HI)
     A*
     A            D2SHIP         5Y 0O 11 46TEXT('SHIP/BOX')
     A                                      EDTCDE(2)
     A**21                                  DSPATR(RI PC)
     A            D2AIR          5Y 0B 13 46TEXT('AIR/BOX')
     A                                      EDTCDE(2)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            D2DLMM         2Y 0B 15 46TEXT('DELIVERY')
     A                                      EDTCDE(4)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 15 49'.'
     A            D2DLDD         2Y 0B 15 51TEXT('DELIVERY')
     A                                      EDTCDE(4)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 15 54'.'
     A            D2DLYY         4Y 0B 15 56TEXT('DELIVERY')
     A                                      EDTCDE(4)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A                                 16 46'MM   DD   YYYY'
     A*
     A*
     A  99                             22 10' ERROR '
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D#MSG         60A  O 22 19DSPATR(BL)
     A                                 24  2' F3 '
     A                                      DSPATR(RI)
     A                                 24  7'BACK'
     A                                 24 15' F5 '
     A                                      DSPATR(RI)
     A                                 24 20'INPUT'
     A*
      ***********************************************
      * POP WINDOW                                  *
      ***********************************************
     A          R W1
     A                                      OVERLAY
      * A:START LINE  B:START COLUMN
      * C:LINE WITHIN WINDOW  D:COLUMN WITHIN WINDOW
      *                                            A  B  C   D
     A                                      WINDOW(6 21  10  35)
     A                                      WDWBORDER((*DSPATR RI HI) (*CHAR ' -
     A                                             '))
     A                                      RMVWDW
     A                                      USRRSTDSP
     A                                      WDWTITLE((*TEXT '          '))
      *
     A          R DSP09
     A                                      OVERLAY PROTECT
     A                                      WINDOW(W1)
     A                                      CF03(03)
     A                                      CF05(05)
      *
     A                                  4  2'PLEASE CONFIRM AIR FRIGHT'
     A                                  9  2' F3 '
     A                                      DSPATR(RI)
     A                                   + 1'BACK'
     A                                   + 2' F5 '
     A                                      DSPATR(RI)
     A                                   + 1'OK'
