      *** GDGPW89 ******************************
      *   REQUEST OF RE-PRINT ASJ KANBAN DATA  *
      *       K.YASUDA            2004.04.21   *
      ****************************** GDGPW 89 **
     A                                      PRINT
     A                                      CHGINPDFT(CS)
     A**************
     A* DSP01
     A**************
     A          R DSP01
     A                                      CF01 CF03 CF12
     A*
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 23' REQUEST OF RE-PRINT +
     A                                       ASJ KANBAN DATA '
     A                                      DSPATR(RI)
     A                                  2 38'PRODUCT'
     A                                  1 69'FMT GDGPW89'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A*
     A                                  9 20' ORDER NO.          '
     A                                      DSPATR(RI)
     A            D1ODKG         3   O 11 21
     A                                   + 1'-'
     A            D1ODR1         2Y 0B   + 1
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D1ODR2         2Y 0B   + 1
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D1ODR3         2Y 0B   + 1
     A                                      EDTCDE(Z)
     A  11                                  DSPATR(RI PC)
     A*
     A                                  9 43' PART NO.           '
     A                                      DSPATR(RI)
     A            D1HIN1         5   B 11 44
     A  12                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D1HIN2         5   B   + 1
     A  12                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D1HIN3         2   B   + 1
     A  12                                  DSPATR(RI PC)
     A*
     A                                 16 13'... LAST INPUT DATA'
     A                                 17 22'ORDER NO.'
     A            D2ODR         12   O 18 22
     A*
     A                                 17 37'PART NO.'
     A            D2HIN         14   O 18 37
     A*
     A                                 17 54'NUMBER OF KANBAN'
     A                                 18 54'SHIP'
     A            D2MAIS         3Y 0O 18 60EDTCDE(Z)
     A*
     A                                 20 54'AIR'
     A            D2MAIA         3Y 0O 20 60EDTCDE(Z)
     A*
     A*
     A*
     A  99                             22 10' ERROR ' DSPATR(RI BL)
     A  99        D1MSG         60     22 19DSPATR(BL)
     A*
     A                                 24  8'END JOB'
     A                                   + 1' F1 ' DSPATR(RI)
     A                                   + 4'BACK'
     A                                   + 1' F3 ' DSPATR(RI)
     A                                 24 65'INQUIRY'
     A                                   + 1' F12 ' DSPATR(RI)
     A**************
     A* DSP02
     A**************
     A          R DSP02
     A                                      CF03 CF05
     A*
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 23' VARIOUS KANBAN ISSUE +
     A                                       REQUEST '
     A                                      DSPATR(RI)
     A                                  2 36'PRODUCT'
     A                                  1 69'FMT GDGPW89'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A*
     A                                  7 14' ORDER NO.    '
     A                                      DSPATR(UL)
     A            D1ODR         12   O  8 15
     A                                      DSPATR(HI)
     A*
     A                                  7 31' PART NO.       '
     A                                      DSPATR(UL)
     A            D1HIN         14   O  8 32
     A                                      DSPATR(HI)
     A*
     A                                 11 10' ITEM NO. '
     A                                      DSPATR(RI)
     A                                 13  2' SHIP '
     A            D1ITMS         5   O 13 12
     A                                      DSPATR(HI)
     A                                 15  2' AIR '
     A            D1ITMA         5   O 15 12
     A                                      DSPATR(HI)
     A*
     A                                 11 33' NUMBER OF ORDER BOXES '
     A                                      DSPATR(RI)
     A            D1BOXS         3  0O 13 42EDTCDE(4)
     A            D1BOXA         3  0O 15 42EDTCDE(4)
     A*
     A                                 11 60' NUMBER OF SHEETS '
     A                                      DSPATR(RI)
     A            D1MAIS         3  0B 13 67EDTCDE(4)
     A  11                                  DSPATR(RI PC)
     A            D1MAIA         3  0B 15 67EDTCDE(4)
     A  12                                  DSPATR(RI PC)
     A*
     A*
     A  99                             22 10' ERROR ' DSPATR(RI BL)
     A  99        D2MSG         60     22 19DSPATR(BL)
     A*
     A                                 24  8'BACK'
     A                                   + 1' F3 ' DSPATR(RI)
     A                                   + 4'INPUT OK'
     A                                   + 1' F5 ' DSPATR(RI)
     A**************
     A* SFL01
     A**************
     A          R SFREC1                    SFL
     A            S1DEL          1   B  6  7TEXT('CHG')
     A  21                                  DSPATR(RI PC)
     A            S1ODR         12      6 10TEXT('ORDER NO.')
     A            S1HIN         14      6 30TEXT('PART NO.')
     A            S1MAIS         3  0   6 53TEXT('QTY')
     A                                      EDTCDE(4)
     A**************
     A* CTL01
     A**************
     A          R SFCTL                     SFLCTL(SFREC1)
     A                                      CF03 CF05
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(13) SFLSIZ(14)
     A  71                                  SFLDSP
     A  72                                  SFLDSPCTL
     A  73                                  SFLCLR
     A            RRN            4  0H      SFLRCDNBR
     A*
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 23' REQUEST OF RE-PRINT +
     A                                       ASJ KANBAN DATA '
     A                                      DSPATR(RI)
     A                                  2 38'PRODUCT'
     A                                  1 69'FMT GDGPW89'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A*
     A*
     A                                  5  6'    ORDER NO.       -
     A                                      PART NO.         -
     A                                      NUMBER OF KANBAN    '
     A                                      DSPATR(HI UL)
     A*         1         2         3         4         5         6
     A*123456789012345678901234567890123456789012345678901234567890
     A*         ORDER NO.       PART NO.         NUMBER OF KANBAN
     A*      X  XXX-XX-XX-XX    XXXXX-XXXXX-XX         XXX
     A*         5         6         7         8
     A*1234567890123456789012345678901234567890
     A*
     A*
     A*
     A**************
     A* DSP03
     A**************
     A          R DSP03
     A                                 19  7'|'
     A                                 20  7'+------> 0 : DELETE DATA'
     A  99                             22 10' ERROR ' DSPATR(RI BL)
     A  99        D2MSG         60     22 19DSPATR(BL)
     A*
     A                                 24  2'BACK'
     A                                   + 1' F3 ' DSPATR(RI)
     A                                   + 4'DELETE OK'
     A                                   + 1' F5 ' DSPATR(RI)
     A                                 24 60' PAGE U/D '
     A                                      DSPATR(RI)
     A                                   + 1'ROLL U/D'
     A*
