     A*%%TS  SD  20021216  110214  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A                                      CF10
     A          R DSP01
     A*%%TS  SD  20021216  110214  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A            #PGM           8A  O  1  2
     A                                  1 22'** ASJ PARTS ETA QTY REFERENCE **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5 19'OPTION:'
     A                                      DSPATR(HI)
     A            D@OPTN         1A  B  5 27DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  5 33'1:SORT BY LOCATION'
     A                                  6 33'2:     BY PART NUMBER'
     A                                  9 19'INVOICE#:' DSPATR(HI)
     A            D@INVO         6   B  9 29DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A          R SFL01                     SFL
     A*%%TS  SD  20021213  135126  TEST        REL-V4R4M0  5769-PW1
     A            S@PRT1         5A  O  5  3
     A                                      DSPATR(UL)
     A            S@PRT2         5A  O  5  9
     A                                      DSPATR(UL)
     A            S@PRT3         2A  O  5 15
     A                                      DSPATR(UL)
     A            S@LOC1         1A  O  5 18
     A                                      DSPATR(UL)
     A            S@LOC2         2A  O  5 20
     A                                      DSPATR(UL)
     A            S@LOC3         2A  O  5 23
     A                                      DSPATR(UL)
     A            S@LOC4         1A  O  5 26
     A                                      DSPATR(UL)
     A            S@CAS1         4A  O  5 28
     A                                      DSPATR(UL)
     A            S@QTY1         3Y 0O  5 33EDTCDE(4)
     A                                      DSPATR(UL)
     A            S@CAS2         4A  O  5 38
     A                                      DSPATR(UL)
     A            S@QTY2         3Y 0O  5 43EDTCDE(4)
     A                                      DSPATR(UL)
     A            S@CAS3         4A  O  5 48
     A                                      DSPATR(UL)
     A            S@QTY3         3Y 0O  5 53EDTCDE(4)
     A                                      DSPATR(UL)
     A            S@CAS4         4A  O  5 58
     A                                      DSPATR(UL)
     A            S@QTY4         3Y 0O  5 63EDTCDE(4)
     A                                      DSPATR(UL)
     A            S@CAS5         4A  O  5 68
     A                                      DSPATR(UL)
     A            S@QTY5         3Y 0O  5 73EDTCDE(4)
     A                                      DSPATR(UL)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20021216  102330  TEST        REL-V4R4M0  5769-PW1
     A                                      CF12
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM           8A  O  1  2
     A                                  1 22'** ASJ PARTS ETA QTY REFERENCE **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  4  3'PART#'
     A                                      DSPATR(HI)
     A            D@INV1         6A  O  2 29DSPATR(HI)
     A            D@INV2         6A  O  2 39DSPATR(HI)
     A            D@INV3         6A  O  2 49DSPATR(HI)
     A            D@INV4         6A  O  2 59DSPATR(HI)
     A            D@INV5         6A  O  2 69DSPATR(HI)
     A            D@DAT1         4Y 0O  3 30EDTWRD('  /  ')
     A                                      DSPATR(HI)
     A            D@DAT2         4Y 0O  3 40EDTWRD('  /  ')
     A                                      DSPATR(HI)
     A            D@DAT3         4Y 0O  3 50EDTWRD('  /  ')
     A                                      DSPATR(HI)
     A            D@DAT4         4Y 0O  3 60EDTWRD('  /  ')
     A                                      DSPATR(HI)
     A            D@DAT5         4Y 0O  3 70EDTWRD('  /  ')
     A                                      DSPATR(HI)
     A                                  4 18'LOCATION'
     A                                      DSPATR(HI)
     A                                  4 28'CASE QTY' DSPATR(HI)
     A                                  4 38'CASE QTY' DSPATR(HI)
     A                                  4 48'CASE QTY' DSPATR(HI)
     A                                  4 58'CASE QTY' DSPATR(HI)
     A                                  4 68'CASE QTY' DSPATR(HI)
     A          R DSP99
     A            D@MSG         78     23  2
     A            D@CMD         78     24  2
