     A*%%TS  SD  20231002  112530  I0777       REL-V7R3M0  5770-WDS
     A*** GDGPW81 **********************************************
     A*   INQUIRY SCREEN OF ORDER INFORMATION                  *
     A*   MSK.KUNIEDA          2000.03.17                      *
     A*                        2000.11.09                      *
     A******************************************** GADPW81 *****
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R SFL1                      SFL
     A*%%TS  SD  20231002  112530  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT(' ﾅﾎﾞ､ﾎｦbﾓ')
     A            @SEL           1A  B 10  2DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            @ODER          8A  O 10  4
     A            @ODATE         6Y 0O 10 13EDTWRD('  /  /  ')
     A            @ITEM          5Y 0O 10 22
     A            @PARTN        22A  O 10 28
     A            @HANY          1A  O 10 51
     A            @INVO          7A  O 10 53
     A            @RDATE         6Y 0O 10 61EDTWRD('  /  /  ')
     A            @MQTY          7Y 0O 10 70EDTWRD(' ,   ,   ')
     A*
     A            @OQTY          9Y 0O 11 12EDTWRD('   ,   ,   ')
     A            @CQTY          6Y 0O 11 30EDTWRD('   ,   ')
     A            @OBOX          4Y 0O 11 45EDTWRD(' ,   ')
     A            @IQTY          7Y 0O 11 51EDTWRD(' ,   ,   ')
     A            @IBOX          4Y 0O 11 62EDTWRD(' ,   ')
     A            @MBOX          4Y 0O 11 70EDTWRD(' ,   ')
     A            @DLVR          8S 0H      TEXT('DELIVERY')
      *
     A          R SREC1                     TEXT(' SFL-CTL')
     A                                      SFLCTL(SFL1)
     A  70                                  SFLDSP SFLDSPCTL
     A  71                                  SFLCLR
     A                                      CF03(03)
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(05) SFLSIZ(05)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A            @SFRC1         4  0H      SFLRCDNBR(CURSOR)
      *
     A                                  1  2'TIME'
     A                                    +1TIME
     A                                  1 22'** ORDER INFORMATION **'
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT'
     A                                    +1'GDGPW81'
     A                                  2  2'DATE'
     A                                    +1DATE EDTCDE(Y)
      *
     A            @TYPE         13      3 12DSPATR(UL)
     A                                  4  2'ORDER NO.'
     A            @ODER1         8      4 12DSPATR(UL)
     A                                  4 21'-'
     A            @ODER2         8      4 23DSPATR(UL)
     A  10                              4 32'PARTS NO.'
     A  10        @PARTS        15      4 42DSPATR(UL)
      *
     A                                  6  3'-------------- ORDER INFORMA+
     A                                      TION ---------------'
     A                                  6 52'-RCV INFORMATION- - UNPAID -'
     A                                  7  3'ORDER NO  DATE'
     A                                  7 20'ITEM NO'
     A                                  7 28'PARTS NO.'
     A                                  7 49'CRY'
     A                                  7 53'INVOICE  DATE'
     A                                  7 70'QTY'
      *
     A                                  8 12'ORDER QTY'
     A                                  8 30'CONTAIN QTY'
     A                                  8 45'BOX'
     A                                  8 53'QTY'
     A                                  8 61'BOX'
     A                                  8 70'BOX'
      *
     A          R GDGPW817                  OVERLAY PROTECT
     A                                 21  2'+- DETAIL ... INPUT (M)'
     A                                 21 31'TOTAL ....'
     A            @TOBOX         6Y 0  21 43EDTWRD('   ,   ')
     A            @TIBOX         6Y 0  21 59EDTWRD('   ,   ')
     A            @TMBOX         7Y 0  21 70EDTWRD(' ,   ,   ')
      *
     A          R GDGPW818                  OVERLAY PROTECT
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            @ERR          33A  O 22 18
     A N99                                  DSPATR(ND)
     A N81                             23 71'MORE...'
     A  81                             23 71'BOTTOM'
      *
     A          R GDGPW819                  TEXT('INFORMATION OF CMD')
     A                                      OVERLAY PROTECT
     A                                 24  4'PRV SCREEN'
     A                                 24 15' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 24'NEXT DETAIL'
     A                                 24 36' ROOL UP '
     A                                      DSPATR(RI)
     A                                 24 47'PRV DETAILS'
     A                                 24 59' ROLL DOWN '
     A                                      DSPATR(RI)
