     A*%%TS  SD  20031016  131522  TEST        REL-V4R4M0  5769-PW1
     A*** GDGPW85 <DSPF> *********************************************
     A*    SCRAP ENTRY
     A*
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(CS)
     A                                      PRINT
     A**************
     A* DSP01 *
     A**************
     A          R DSP01
     A*%%TS  SD  20031016  095214  TEST        REL-V4R4M0  5769-PW1
     A                                      CF01
     A                                      CF07
     A                                      CF12
     A                                      OVERLAY
     A                                      PROTECT
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' ASJ PARTS SCRAP/DISPOSAL ENTRY '
     A                                      DSPATR(RI)
     A                                  1 47'(PRODUCTS)'
     A                                  1 69'FMT GDGPW85'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A            D1BAR         17A  B  9 38CHECK(ER)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                  9 18'ASJ KANBAN BARCODE:'
     A**************
     A* DSP03  *
     A**************
     A          R DSP02
     A*%%TS  SD  20031016  095214  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ASJ PARTS SCRAP ENTRY '
     A                                      DSPATR(RI)
     A                                  1 55'(PRODUCTS)'
     A                                  1 69'FMT GDGPW85'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  4  5' MANUAL INPUT '
     A                                      DSPATR(RI)
     A                                  7 13'PART NO.'
     A                                  7 31'NUMBER OF SHEETS'
     A                                  7 51'PROD.CODE'
     A            D3HIN1         5A  B  9 13
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A                                  9 19'-'
     A            D3HIN2         5A  B  9 21
     A  21                                  DSPATR(RI)
     A                                  9 27'-'
     A            D3HIN3         2A  B  9 29
     A  21                                  DSPATR(RI)
     A            D3MAIS         3Y 0B  9 38EDTCDE(4)
     A                                      CHECK(RB)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            D3SEIH         1A  B  9 54
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A**************
     A* MSG02 *
     A**************
     A          R DSP99
     A                                 22 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     22 20
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            D@CMD         78     23  2
     A**************
     A* SFL01
     A**************
     A          R SFL01                     SFL
     A*%%TS  SD  20031016  095214  TEST        REL-V4R4M0  5769-PW1
     A            IKUBN          1A  O 10  6
     A            S1MARK         1A  B 10 10
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            S1HIN         14A  O 10 17
     A            S1MAIS         3S 0B 10 36CHECK(RB)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            S1ZETI         4A  O 10 43
     A            S1SEIH         1A  O 10 58
     A            H1ODER         6Y 0H
     A            H1SEIH         1A  H
     A            H1RENB         4Y 0O 10 50
     A            HRECNO         9  0H
     A**************
     A* CTL01
     A**************
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20031016  131522  TEST        REL-V4R4M0  5769-PW1
     A                                      CF01
     A                                      CF03
     A                                      CF05
     A                                      ROLLUP(71)
     A                                      OVERLAY
     A                                      PROTECT
     A  81                                  SFLDSP
     A  82                                  SFLDSPCTL
     A  83                                  SFLCLR
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A            NBR            4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23' ASJ PARTS SCRAP ENTRY '
     A                                      DSPATR(RI)
     A                                  1 55'(PRODUCTS)'
     A                                  1 69'FMT GDGPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  4  5' DATA CORRECTION SCRREN '
     A                                      DSPATR(RI)
     A                                  6  5'PART NO.'
     A            D3HIN1         5A  O  7  5
     A                                  7 11'-'
     A            D3HIN2         5A  O  7 13
     A                                  7 19'-'
     A            D3HIN3         2A  O  7 21
     A                                  9  6'   MARK      PART NO.      SHEETS -
     A                                        ID NO.  SEQ.  PROD.CODE '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A**************
     A* MSG03
     A**************
     A          R DSP98
     A                                      OVERLAY
     A                                 19 10'|'
     A                                 20 10'+----> INPUT "0" TO DELET-
     A                                      E'
     A                                 19 06'|'
     A                                 20 06'|'
     A                                 21 06'+--------> H:MANUAL INPUT  -
     A                                       K:READING OF KANBAN'
     A          R WIN01
     A*%%TS  SD  20031016  095633  TEST        REL-V4R4M0  5769-PW1
     A                                      WINDOW(10 5 8 60)
     A                                      WDWBORDER((*DSPATR RI))
     A                                  1 22'VERIFICATION'
     A                                      DSPATR(RI)
     A                                  3  2'PART NO'
     A                                  3 21'SHEETS'
     A                                  3 32'ID #'
     A                                  3 40'PROD CODE'
     A            D@HIN1         5   O  4  2
     A                                  4  8'-'
     A            D@HIN2         5   O  4 10
     A                                  4 16'-'
     A            D@HIN3         2   O  4 18
     A            D@MAIS         3  0O  4 23EDTCDE(4)
     A            D@ZETI         4   O  4 31
     A            D@SEIH         1   O  4 44
     A                                  6  4'The above kanban has been processe-
     A                                      d.'
