      *** GDGPW11 <DSPF> *********************************************
      *    ORDER FIXED HANDING / DAYLY ORDER FILE ADD&CHANGE
      *     G.B.C                        97/02/21
      ****************************************************************
     A                                      PRINT
     A                                      CHGINPDFT(CS)
     A**************
     A* DSP01
     A**************
     A          R DSP01                     CF01
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 19' DAILY CORRECTION & ADDIT-
     A                                      ION OF ORDERS '
     A                                      DSPATR(RI)
     A                                    +1'(PROD.)'
     A                                  1 69'FMT GDGPW11'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  7 11'TREATMENT CLASSIFICATION'
     A                                  7 47'PART NO.'
     A            D1OPT          1   B  9 17
     A  11                                  DSPATR(RI PC)
     A                                  9 19'--------- 0:DELETION'
     A                                 10 29'1:CORRECTION'
     A                                 11 29'2:ADDITION'
     A            D1HIN1         5   B  9 48
     A  12                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D1HIN2         5   B   + 1
     A  12                                  DSPATR(RI)
     A                                   + 1'-'
     A            D1HIN3         2   B   + 1
     A  12                                  DSPATR(RI)
     A*
     A                                 22 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     22 19
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  9'END JOB'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A**************
     A* DSP02
     A**************
     A          R DSP02                     CF01 CF03 CF05
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 19' DAILY CORRECTION & ADDIT-
     A                                      ION OF ORDERS '
     A                                      DSPATR(RI)
     A                                    +1'(PROD.)'
     A                                  1 69'FMT GDGPW11'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  6 15'PART NO.'
     A            D1HIN1         5      8 15
     A                                   + 1'-'
     A            D1HIN2         5       + 1
     A                                   + 1'-'
     A  20                                  DSPATR(ND)
     A            D1HIN3         2       + 1
     A  80                              8 41' DELETION   '
     A                                      DSPATR(RI)
     A  81                              8 41' CORRECTION '
     A                                      DSPATR(RI)
     A  82                              8 41' ADDITION   '
     A                                      DSPATR(RI)
     A                                 12 21'BOX'
     A            D2MAIS         5Y 0B 12 40EDTCDE(4) CHECK(RB)
     A  21                                  DSPATR(RI PC)
     A  29                                  DSPATR(PR)
     A                                 14 21'CONTAINRTS'
     A            D2SYOS         7Y 0O 14 36EDTCDE(1)
     A                                 16 21'ORDER QTY'
     A            D2SURY         7Y 0O 16 36EDTCDE(1)
     A*
     A                                 22 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     22 19
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  9'END JOB'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 30'PRV SCREEN'
     A                                   + 1' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 54'INPUT OK'
     A                                   + 1' CMD-5 '
     A                                      DSPATR(RI)
