      **** GDIPW01 ***************************************************
      *   INPUT OF OUT GOING INFORMATION
      *   G.B.C                       97/04/10       *
      ****************************************************************
     A                                      PRINT
     A                                      CHGINPDFT(CS)
     A**************
     A* ＤＳＰ１ *
     A**************
     A          R DSP01                     CF01 CF07
     A                                      OVERLAY PROTECT
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 22' INPUT OF DELIVERY INFORM-
     A                                      ATION '
     A                                      DSPATR(RI)
     A                                    +1'(DIE)'
     A                                  1 69'FMT GDIPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  5  5' INPUT OF BARCODES '
     A                                  9 11'GAVE A BARCODES BE READ -
     A                                      ----->'
     A            D1BAR         13   B  9 42CHECK(ER)
     A  99                                  DSPATR(RI PC)
     A**************
     A* ＤＳＰ２ *
     A**************
     A          R DSP02                     OVERLAY
     A                                 13  7'                      -
     A                                      VERIFICATION SCREEN-
     A                                                               '
     A                                      DSPATR(RI)
     A                                 14  7' '   DSPATR(RI)
     A                                 15  7' '   DSPATR(RI)
     A                                 16  7' '   DSPATR(RI)
     A                                 17  7' '   DSPATR(RI)
     A                                 18  7' '   DSPATR(RI)
     A                                 14 72' '   DSPATR(RI)
     A                                 15 72' '   DSPATR(RI)
     A                                 16 72' '   DSPATR(RI)
     A                                 17 72' '   DSPATR(RI)
     A                                 18 72' '   DSPATR(RI)
     A                                 19  7'                      -
     A                                                         -
     A                                                               '
     A                                      DSPATR(RI)
     A                                 15 16'ITEM NO.'
     A                                 15 32'DIE NO.'
     A                                 15 47'ISSUE NO.'
     A                                 15 59'C/D'
     A            D2ITEM         5Y 0  16 17
     A            D2KATA        11     16 30
     A            D2RENB         3     16 50
     A            D2CD           1     16 60
     A                                 18 24'"KANBAN" AVOBE HAS -
     A                                      BEEN INPUT'
     A**************
     A* ＭＳＧ１ *
     A**************
     A          R MSG01
     A                                 22 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     22 20
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24 10'END JOB'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 35'PRESS'
     A                                   + 1' CMD-7 '
     A                                      DSPATR(RI)
     A                                   + 1'FOR MANUAL INPUT'
     A**************
     A* ＤＳＰ３ *
     A**************
     A          R DSP03                     OVERLAY PROTECT
     A                                      CF01 CF03 CF05 CF07
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 22' INPUT OF DELIVERY INFORM-
     A                                      ATION '
     A                                      DSPATR(RI)
     A                                    +1'(DIE)'
     A                                  1 69'FMT GDIPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  4  5' MANUAL INPUT '
     A                                      DSPATR(RI)
     A                                  7 16'DIE NO.'
     A                                  7 35'NUMBER OF SHEETS'
     A                                  7 56'ORDER DATE'
     A            D3KAT1         2   B  9 16
     A  21                                  DSPATR(RI PC)
     A                                   + 1'-'
     A            D3KAT2         4   B   + 1AUTO(RAZ)
     A  21                                  DSPATR(RI)
     A                                   + 1'-'
     A            D3KAT3         1   B   + 1
     A  21                                  DSPATR(RI)
     A                                   + 1'-'
     A            D3KAT4         1   B   + 1
     A  21                                  DSPATR(RI)
     A            D3MAIS         3Y 0B  9 48EDTCDE(4) CHECK(RB)
     A  22                                  DSPATR(RI PC)
     A            D3HAHZ         8Y 0B  9 57EDTCDE(4) CHECK(RB)
     A  23                                  DSPATR(RI PC)
     A**************
     A* ＤＳＰ４ *
     A**************
     A          R DSP04                     OVERLAY
     A                                 13 11'                   -
     A                                      VERIFICATION SCREEN    -
     A                                                         '
     A                                      DSPATR(RI)
     A                                 14 11' '   DSPATR(RI)
     A                                 15 11' '   DSPATR(RI)
     A                                 16 11' '   DSPATR(RI)
     A                                 17 11' '   DSPATR(RI)
     A                                 18 11' '   DSPATR(RI)
     A                                 14 71' '   DSPATR(RI)
     A                                 15 71' '   DSPATR(RI)
     A                                 16 71' '   DSPATR(RI)
     A                                 17 71' '   DSPATR(RI)
     A                                 18 71' '   DSPATR(RI)
     A                                 19 11'                    -
     A                                                          -
     A                                                           '
     A                                      DSPATR(RI)
     A                                 15 21'DIE NO.'
     A                                 15 40'SHEETS'
     A                                 15 53'ORDER DATE'
     A            D4KATA        11     16 19
     A            D4MAIS         3Y 0  16 43EDTCDE(4)
     A            D4HAHZ         8Y 0  16 53EDTCDE(4)
     A                                 18 27'"KANBAN" ABOVE HAS BEEN -
     A                                      INPUT'
     A**************
     A* ＭＳＧ２ *
     A**************
     A          R MSG02
     A                                 21 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     21 20
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 23  4'END JOB'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                 23 21'PRV SCREEN'
     A                                   + 1' CMD-3 '
     A                                      DSPATR(RI)
     A                                 23 42'INPUT OK'
     A                                   + 1' CMD-5 '
     A                                      DSPATR(RI)
     A                                 24 49'DATA CORRECTION SCREEN'
     A                                   + 2' CMD-7 '
     A                                      DSPATR(RI)
     A**************
     A* ＳＦＬ１ *
     A**************
     A          R SFL01                     SFL
     A            S1MARK         1   B 10 15
     A  31                                  DSPATR(RI PC)
     A            S1KATA        11     10 22
     A            S1MAIS         3Y 0B 10 43EDTCDE(4) CHECK(RB)
     A  32                                  DSPATR(RI PC)
     A            S1HAHZ         8Y 0B 10 53CHECK(RB) EDTCDE(4)
     A            H1ITEM         5Y 0H
     A            H1RENB         3   H
     A            H1KATA         8   H
     A**************
     A* ＣＴＬ１ *
     A**************
     A          R CTL01                     SFLCTL(SFL01)
     A                                      CF01 CF03 CF05
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(9) SFLSIZ(10)
     A                                      ROLLUP(71)
     A                                      ROLLDOWN(72)
     A  81                                  SFLDSP
     A  82                                  SFLDSPCTL
     A  83                                  SFLCLR
     A            NBR            4  0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 22' INPUT OF DELIVERY INFORM-
     A                                      ATION '
     A                                      DSPATR(RI)
     A                                    +1'(DIE)'
     A                                  1 69'FMT GDIPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  4  5' DATA CORRECTION SCRREN '
     A                                      DSPATR(RI)
     A                                  6  5'DIE NO.'
     A            D4KATA        11      7  5
     A                                  9 12' DELETE     DIE NO.         -
     A                                      SHEETS       ORDER DATE '
     A                                      DSPATR(HI UL)
     A**************
     A* ＭＳＧ３ *
     A**************
     A          R MSG03
     A                                 19 15'|'
     A                                 20 15'+----> INPUT "0" TO DELET-
     A                                      E'
     A                                 22 10' ERROR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D#MSG         59     22 20
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  3'END JOB'
     A                                   + 1' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 23'PRV SCREEN'
     A                                   + 1' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 46'INPUT OK'
     A                                   + 1' CMD-5 '
     A                                      DSPATR(RI)
     A                                 24 67' ROLL-UP/DWN '
     A                                      DSPATR(RI)
