     A*%%TS  SD  20001107  104239  QPGMR       REL-V3R7M0  5716-PW1
     A**** GDIPW25 <DSPF> ********************************************
     A*   INPUT OF SHIPPING INFORMATION (DIE)
     A*       G.B.C                         2000.10.30
     A*       %001    CHANGE   N.HAYAKAWA  2004.01.150
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A**************
     A*   DSP01
     A**************
     A          R DSP01
     A*%%TS  SD  20001107  094704  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF01
     A                                      OVERLAY
     A                                      PROTECT
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' INPUT OF THE SHIPPING INFORMATION-
     A                                       '
     A                                      DSPATR(RI)
     A                                  1 56'(PRODUCTS)'
     A                                  1 69'FMT GDIPW25'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  2 20' (DIE) '
     A                                  4 10'UPDATE'
     A                                      DSPATR(RI)
     A            D1KBN          1A  B  4 18DSPATR(CS)
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A                                  6 18'0- CANCEL'
     A                                  7 18'2- ADD'
     A                                  4 35'ORDER NO.  '
     A                                      DSPATR(RI)
     A            D1ODER         6Y 0B  4 47TEXT('ORDER NO')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A                                  6 35'ITEM NO.   '
     A                                      DSPATR(RI)
     A            D1ITEM         5Y 0B  6 47TEXT('ITEM NO')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                  6 53'-'
     A            D1IKBN         2Y 0B  6 55TEXT('     DEVISION CODE')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A                                  8 35'PALLETE NO.'
     A                                      DSPATR(RI)
 %001A            D1PARE         4A     8 47TEXT('PALLETE NO.')
     A                                      DSPATR(CS)
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A                                 10 35'SN-BOX NO. '
     A                                      DSPATR(RI)
     A            D1BXNO         4Y 0B 10 47TEXT('SNBOX NO.')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                 12 22'INVOICE NO.                       '
     A                                      DSPATR(UL)
     A            D1INVO         6A  B 12 59TEXT('INVOICE NO.')
     A                                      DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A                                 14 22'ORDER RECEIVED DATE               '
     A                                      DSPATR(UL)
     A            D1RECV         8Y 0B 14 59TEXT('ORDER RECEIVED')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A                                 16 22'ASJ PROCESSING DATE               '
     A                                      DSPATR(UL)
     A            D1ASJ          8Y 0B 16 59TEXT('ASJ PROCESSING')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A                                 18 22'DEPARTURE JP PORT DATE            '
     A                                      DSPATR(UL)
     A            D1SKO          8Y 0B 18 59TEXT('DEPARTURE JP PORT')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A                                 20 22'CALCULATION ARRIVAL KSCHEDULE DATE'
     A                                      DSPATR(UL)
     A            D1TOY          8Y 0B 20 59TEXT('CALCULATION ARRIVAL')
     A                                      DSPATR(CS)
     A                                      EDTCDE(4)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            D1ERR         60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  3'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A*
     A**************
     A*   DSP02
     A**************
     A*
     A          R DSP02
     A*%%TS  SD  20001107  104239  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20' INPUT OF THE SHIPPING INFORMATION-
     A                                       '
     A                                      DSPATR(RI)
     A                                  1 56'(PRODUCTS)'
     A                                  1 69'FMT GDIPW25'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  2 20' (DIE) '
     A                                  5  6'UPDATE'
     A                                      DSPATR(UL)
     A  30                              7  5'0- CANCEL'
     A N30                              7  5'2- ADD'
     A                                  5 17'ORDER NO.'
     A                                      DSPATR(UL)
     A            D1ODER         6Y 0O  7 18TEXT('ORDER NO')
     A                                  5 28'  ITEM NO.  '
     A                                      DSPATR(UL)
     A            D1ITEM         5Y 0O  7 29TEXT('ITEM NO')
     A                                  7 35'-'
     A            D1IKBN         2Y 0O  7 37TEXT('     DEVISION CODE')
     A                                  5 42'PALLETE NO.'
     A                                      DSPATR(UL)
 %001A            D1PARE         4A  O  7 45TEXT('ITEM NO')
     A                                  5 55'SN-BOX NO.'
     A                                      DSPATR(UL)
     A            D1BXNO         4Y 0O  7 58TEXT('ITEM NO')
     A                                  5 67'INVOICE NO.'
     A                                      DSPATR(UL)
     A            D1INVO         6A  O  7 69TEXT('INVOICE NO.')
     A                                  9  5'ORDER RECEIVED'
     A                                 10  5'     DATE     '
     A                                      DSPATR(UL)
     A            D1RECV         8Y 0O 12  7TEXT('ORDER RECEIVED')
     A                                      EDTWRD('    .  .  ')
     A                                  9 23'ASJ PROCESSING'
     A                                 10 23'     DATE     '
     A                                      DSPATR(UL)
     A            D1ASJ          8Y 0O 12 25TEXT('ASJ PROCESSING')
     A                                      EDTWRD('    .  .  ')
     A                                  9 41'  DEPARTURE   '
     A                                 10 41' JP PORT DATE '
     A                                      DSPATR(UL)
     A            D1SKO          8Y 0O 12 43TEXT('DEPARTURE JP PORT')
     A                                      EDTWRD('    .  .  ')
     A                                  9 57'CALCULATION ARRIVAL'
     A                                 10 59'KSCHEDULE DATE'
     A                                      DSPATR(UL)
     A            D1TOY          8Y 0O 12 61TEXT('CALCULATION ARRIVAL')
     A                                      EDTWRD('    .  .  ')
     A                                 14  5'      DIE CODE      '
     A                                      DSPATR(UL)
     A            D2KAT1         2A  B 16  6TEXT('DIE CODE1')
     A N30                                  DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 16  9'-'
     A            D2KAT2         4A  B 16 11TEXT('        2')
     A N30                                  DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 16 16'-'
     A            D2KAT3         1A  B 16 18TEXT('        3')
     A N30                                  DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 16 20'-'
     A            D2KAT4         1A  B 16 22TEXT('        4')
     A N30                                  DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 14 28'  QTY/BOX  '
     A                                      DSPATR(UL)
     A            D2SYOS         7Y 0B 16 29TEXT('QTY/BOX')
     A N30                                  DSPATR(CS)
     A                                      EDTCDE(2)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 14 42'   BOX  '
     A                                      DSPATR(UL)
     A            D2SBOX         5Y 0B 16 43TEXT('BOX')
     A N30                                  DSPATR(CS)
     A                                      EDTCDE(2)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 13 57'ASJ'
     A                                 14 53' UNIT PRICE '
     A                                      DSPATR(UL)
     A            D2TANK         8Y 2B 16 54TEXT('UNIT PRICE')
     A N30                                  DSPATR(CS)
     A                                      EDTCDE(2)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 14 67' CARRY CODE '
     A                                      DSPATR(UL)
     A            D2HANY         1A  B 16 72TEXT('UNIT PRICE')
     A N30                                  DSPATR(CS)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A  30                                  DSPATR(PR)
     A                                 17 71' S:SHIP '
     A                                 18 71' A:AIR '
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            D1ERR         60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  2'KEY INPUT'
     A                                 24 12'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 19'UPDATE OK'
     A                                 24 29'CMD-5'
     A                                      DSPATR(RI)
