     A*%%TS  SD  20020607  074319  TEST        REL-V4R4M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01
     A          R SFL01                     SFL
     A*%%TS  SD  20020419  150428  TEST        REL-V4R4M0  5769-PW1
     A            S@NBR          3  0O  4  2EDTCDE(4) DSPATR(HI)
     A            S@D01          2   O  4  6
     A  11                                  DSPATR(RI)
     A            S@D02          4   O  4  9
     A  11                                  DSPATR(RI)
     A            S@D03          1   O  4 14
     A  11                                  DSPATR(RI)
     A            S@D04          1   O  4 16
     A  11                                  DSPATR(RI)
     A            S@QTY          3  0O  4 18EDTCDE(4)
     A  11                                  DSPATR(RI)
     A            S@DAT1         6Y 0O  4 22EDTWRD('  /  /  ')
     A  11                                  DSPATR(RI)
     A            S@DAT2         6Y 0O  4 31EDTWRD('  /  /  ')
     A  11                                  DSPATR(RI)
     A                                    +1':'
     A            H@DAT1         8  0H
     A            H@DAT2         8  0H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020424  082330  TEST        REL-V4R4M0  5769-PW1
     A  *DS3                                SFLLIN(0001)
     A                                      SFLSIZ(0031)
     A                                      SFLPAG(0030)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #RCNO          4S 0H      SFLRCDNBR
     A                                  3  6'DIE#'
     A                                      DSPATR(HI)
     A                                  3 18'QTY'
     A                                      DSPATR(HI)
     A                                  2 25'ASJ'
     A                                      DSPATR(HI)
     A                                  3 23'DUE DAT'
     A                                      DSPATR(HI)
     A                                  2 33'IAF'
     A                                      DSPATR(HI)
     A                                  3 31'ORDR DAT'
     A                                      DSPATR(HI)
     A                                  3 46'DIE#'
     A                                      DSPATR(HI)
     A                                  3 58'QTY'
     A                                      DSPATR(HI)
     A                                  3 63'DUE DAT'
     A                                      DSPATR(HI)
     A                                  2 65'ASJ'
     A                                      DSPATR(HI)
     A                                  2 73'IAF'
     A                                      DSPATR(HI)
     A                                  3 71'ORDR DAT'
     A                                      DSPATR(HI)
     A            #PGM           8A  O  1  2
     A                                  1 22'** DIE SHIPMENT REQUEST BY AIR **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3  2'LIN'
     A                                      DSPATR(HI)
     A                                  3 42'LIN'
     A                                      DSPATR(HI)
     A                                  3 40':'
     A          R DSP01
     A*%%TS  SD  20020607  074319  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF08
     A            LIN1          78A  O 19  2DSPATR(UL)
     A                                 20  3'OPTION'
     A                                      DSPATR(HI)
     A            D@OPT          1A  B 20 10DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  02                                  DSPATR(PR)
     A                                 20 12'(0=DELETE 1=CHANGE 2=ADD)'
     A                                 20 39'LIN#'
     A                                      DSPATR(HI)
     A            D@NBR          3Y 0B 20 44DSPATR(CS)
     A                                      EDTCDE(4)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  02                                  DSPATR(PR)
     A                                 20 55'(OPTION 0 OR 1)'
     A                                 20 48'-'
     A            D@NBR2         3  0B 20 50DSPATR(CS)
     A                                      EDTCDE(4)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A  02                                  DSPATR(PR)
     A          R DSP02
     A*%%TS  SD  20020422  081421  TEST        REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CF05
     A                                      CF12
     A            D@MODE         6A  O 21  2DSPATR(RI)
     A                                 21  9'DIE'
     A                                      DSPATR(HI)
     A            D@D01          2A  B 21 13DSPATR(CS)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A            D@D02          4A  B 21 16DSPATR(CS)
     A  63                                  DSPATR(RI)
     A            D@D03          1A  B 21 21DSPATR(CS)
     A  63                                  DSPATR(RI)
     A            D@D04          1A  B 21 23DSPATR(CS)
     A  63                                  DSPATR(RI)
     A                                 21 25'QTY' DSPATR(HI)
     A            D@QTY          3  0B 21 29EDTCDE(4)
     A                                      DSPATR(CS)
     A  66                                  DSPATR(RI PC)
     A                                 21 33'ASJ DATE'
     A                                      DSPATR(HI)
     A            D@DAT1         8Y 0B 21 42EDTCDE(4)
     A                                      DSPATR(CS)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                 21 51'ORDR DATE'
     A                                      DSPATR(HI)
     A            D@DAT2         8Y 0B 21 61EDTCDE(4)
     A                                      DSPATR(CS)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 21 70'(YYYYMMDD)'
     A          R DSP99
     A            LIN2          78   O 22  2DSPATR(UL)
     A            D@CMD         78   O 23  2
     A            D@MSG         78   O 24  2DSPATR(HI)
