      *** GDJPW15 <DSPF> *********************************************
      *   INVENTORY DATA ENTRY
      *   G.B.C                       97/02/18                       *
      ****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(CS UL)
     A                                      PRINT
     A**************
     A* DSP1       *
     A**************
     A          R DSP01
     A                                      CF01(01)
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'  INVENTORY DATA ADD/CORRECION  '
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDJPW15'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                 10 20' 1 ' DSPATR(RI)
     A                                    +1'INVENTORY DATA ADD (PARTS)'
     A                                 12 20' 2 ' DSPATR(RI)
     A                                    +1'INVENTORY DATA ADD (DIE)  '
     A                                 15 20'NO.'
     A            D1NO           1Y 0B 15 27EDTCDE(4) CHECK(RB)
     A                                      VALUES(1 2)
     A                                      DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                    +1'INPUT THE NO. ("1" OR "2").'
     A            D#MSG         60A  O 22 20
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A                                 24  9'END JOB'
     A                                    +1' CMD-1 '
     A                                      DSPATR(RI)
