     A** GDKPW99 ***********************************
     A*  IMPORTS UNIT PRICE M/F LIST               *
     A*                                            *
     A* DATE  (CODING):K.OKACHI   1997.11.03       *
     A*********************************** GDKPW99 **
     A                                      CHGINPDFT
     A                                      PRINT
     A          R GDKPW991                  CF01 CF05
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 21' UNIT PRICE MASTER CHECK LIST'
     A
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDKPW99'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  2 33'<< INPORT >>'
     A                                  8 18'UPDATE DAY'
     A            #HIZ           8Y 0B  9 18DSPATR(CS) EDTCDE(Z)
     A                                      OVRATR
     A  01                                  DSPATR(RI BL)
     A                                 24  9'END JOB'
     A                                 24 17' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 51' LIST '
     A                                 24 58' CMD-5 '
     A                                      DSPATR(RI)
     A*
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           60   O 22 18
     A                                      OVRDTA OVRATR
     A N99                                  DSPATR(ND)
