      ** GDLPW80 ****************************
      *  MATERIAL UNIT PRICE MASTER UPDATE  *
      *              K.YASUDA   2000.08.21  *
      **************************** GDGPW80 **
     A                                      PRINT
     A                                      CHGINPDFT
      *----------*
      * SCREEN 1 *
      *----------*
     A          R GDLPW851                  CF01 CF05
     A                                      BLINK PUTOVR KEEP
     A                                  1  2'TIME'
     A                                  1  7 TIME
     A                                  1 22' MATERIAL UNIT PRICE MASTER -
     A                                      LIST '
     A                                      DSPATR(RI)
     A                                  1 69'FMT GDLPW85'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
      *
     A                                 10 20' SUPPLIER '
     A                                      DSPATR(RI)
     A            ISIRE          4   B 10 33OVRDTA OVRATR
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI PC)
     A                                 12 33'9999 - ALL SUPPLIER'
      *
     A                                 22  8' ERROR '
     A                                      OVRATR
     A  99                                  DSPATR(RI BL)
     A N99                                  DSPATR(ND)
     A            MSG           59     22 20OVRATR OVRDTA
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
      *
     A                                 24  7'EXIT'
     A                                 24 13' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 23'PRINTING'
     A                                 24 33' CMD-5 '
     A                                      DSPATR(RI)
