     A*%%TS  SD  20181012  082157  I0777       REL-V7R3M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CF02
     A          R SFL01                     SFL
     A*%%TS  SD  20181010  100908  I0777       REL-V7R3M0  5770-WDS
     A            S@ZAIS        12A  O  5  2
     A            S@ZAIK         5Y 2O  5 15EDTCDE(4)
     A            S@SUPL         3A  O  5 22
     A            S@SETG         7Y 0O  5 26EDTCDE(4)
     A            S@QTY1         7Y 0O  5 34EDTCDE(4)
     A            S@QTY2         7Y 0O  5 42EDTCDE(4)
     A            S@QTY3         7Y 0O  5 50EDTCDE(4)
     A            S@QTY4         7Y 0O  5 58EDTCDE(4)
     A            S@QTY5         7Y 0O  5 66EDTCDE(4)
     A            S@QTY6         7Y 0O  5 74EDTCDE(4)
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20181012  082157  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      OVERLAY
     A  51                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A            #PGM           8A  O  1  2
     A                                  1 23'** MATERIAL ORDER INQ (DETAIL) **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  2USER
     A                                  2 28'( SUPPLIER:'
     A                                      COLOR(YLW)
     A            D@SUPP         9A  O  2 40COLOR(YLW)
     A                                  2 50')'
     A                                      COLOR(YLW)
     A                                  3 37'------------- LATEST 6 DAYS -------
     A                                      ---------'
     A                                      DSPATR(HI)
     A                                  4  2'MATERIAL'
     A                                      DSPATR(HI)
     A                                  4 17'DIAM'
     A                                      DSPATR(HI)
     A                                  4 26'SET(/20)'
     A                                      DSPATR(HI)
     A            D@DAY1         5A  O  4 36DSPATR(HI)
     A            D@DAY2         5A  O  4 44DSPATR(HI)
     A            D@DAY3         5A  O  4 52DSPATR(HI)
     A            D@DAY4         5A  O  4 60DSPATR(HI)
     A            D@DAY5         5A  O  4 68DSPATR(HI)
     A            D@DAY6         5A  O  4 76DSPATR(HI)
      *
     A          R DSP98
     A                                      OVERLAY
     A                                 22 10'TOTAL'   DSPATR(HI)
     A            D@QTY1         7  0O 22 34EDTCDE(4) DSPATR(HI)
     A            D@QTY2         7  0O 22 42EDTCDE(4) DSPATR(HI)
     A            D@QTY3         7  0O 22 50EDTCDE(4) DSPATR(HI)
     A            D@QTY4         7  0O 22 58EDTCDE(4) DSPATR(HI)
     A            D@QTY5         7  0O 22 66EDTCDE(4) DSPATR(HI)
     A            D@QTY6         7  0O 22 74EDTCDE(4) DSPATR(HI)
      *
     A          R DSP99
     A            D@MSG         78   O 23  2
     A            D@CMD         78   O 24  2
