     A*%%TS  SD  20001109  155526  QPGMR       REL-V3R7M0  5716-PW1
     A*** GDLPW35 **********************************************
     A*   DAILY ACCOUNT PAYABLE PROCESS                        *
     A*   A.MAMIYA             2000.11.08                      *
     A******************************************** GDLPW35 *****
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R GDLPW351
     A*%%TS  SD  20001109  155526  QPGMR       REL-V3R7M0  5716-PW1
     A                                      CF01(01)
     A                                      CF05(05)
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 22'*** MONTHLY ACCOUNT PAYABLE PROCES+
     A                                      S ***'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT'
     A                                  1 72'GDLPW35'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  8 10'PROCESS TYPE'
     A                                      DSPATR(RI UL)
     A                                  8 27'PAYMENT DATE'
     A                                      DSPATR(RI UL)
     A                                  8 44'SUPPLIER CODE'
     A                                      DSPATR(RI UL)
     A                                  8 60'RECEIVER CODE'
     A                                      DSPATR(RI UL)
     A            @CODE          1A  B  9 15DSPATR(CS)
     A  11                                  DSPATR(RI PC)
     A            @SIHZ          6Y 0B  9 30DSPATR(CS)
     A                                      EDTCDE(Z)
     A  12                                  DSPATR(RI PC)
     A            @SIRE          4A  B  9 46DSPATR(CS)
     A  13                                  DSPATR(RI PC)
     A                                  9 51'-'
     A            @SKOJ          1A  B  9 53DSPATR(CS)
     A  14                                  DSPATR(RI PC)
     A            @NUKE          4A  B  9 62DSPATR(CS)
     A  15                                  DSPATR(RI PC)
     A                                  9 67'-'
     A            @NKOJ          1A  B  9 69DSPATR(CS)
     A  16                                  DSPATR(RI PC)
     A                                 10 30'YYYYMM'
     A                                 11  9'1:DATA TRANSFER'
     A                                 12  9'2:ISSUE LIST'
     A                                 22 11' ERROR '
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 20
     A N99                                  DSPATR(ND)
     A                                 24  5'END'
     A                                 24 10' CMD-1 '
     A                                      DSPATR(RI)
     A                                 24 30'EXECUTE'
     A                                 24 39' CMD-5 '
     A                                      DSPATR(RI)
