      ** GHCPW23 *****************************************************
      * 工程マスターの更新確認                                     *
      *      SEEK                 2023.06.09                         *
      ****************************************************************
     A                                      PRINT
     A                                      CHGINPDFT
      ****************************************************************
      * 画面１                                                     *
      ****************************************************************
     A          R DSP1                      TEXT('画面１')
     A                                      CF01
     A                                      BLINK
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18' ** PRODUCTOION INFORMATION MANAGE+
     A                                      NT SYSTEM ** '
     A                                      DSPATR(RI)
     A                                  1 69'FMT'
     A                                  1 73'GHCPW23'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  9 31'PASSWORD'
     A                                      DSPATR(HI)
     A            D1PSWD         8   B 11 31TEXT('PASSWORD')
     A                                      DSPATR(CS ND)
     A*
     A  99                             23  2' d[ｰ '
     A                                      DSPATR(RI)
     A            $ERR          70O    23  8TEXT('ERROR MESSAGE')
     A                                      DSPATR(HI)
     A                                 24  2'EXIT'
     A                                    +1'CMD-1'
     A                                      DSPATR(RI)
