     A********************************************
     A*INQUIRY OF  MATERIALS PROD ORDER CHECK M/F  *
     A* FILE ID. : GKBPW34. <DSPF> *
     A* CREATE DATE. : MAR.03,'89.               *
     A* AUTHOR.         : E.KAWASHIMA <G.B.C> *
     A********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R GKBPW341
     A*%%TS  SD  19961114  160058  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 1')
     A                                      CF01
     A                                      BLINK
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'* MATERIALS PROD ORDER CHECK M/F I-
     A                                      NQUIRY *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 70'FMT'
     A                                  1 74'GKBPW34'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  9 16'COMPLETION MATERIAL'
     A                                      DSPATR(RI)
     A            @KNZI         15A  B 11 18DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  9 37'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A            @ZIST          5Y 2B 11 40DSPATR(CS)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                  9 52'RECEIVING'
     A                                      DSPATR(RI)
     A            @UKE           4Y 0B 11 54DSPATR(CS)
     A                                      EDTCDE(4)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                 13 54'0111 IAF'
     A                                 14 54'SUPPLIER ????'
     A  99                             22 11'ERROR'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            ERR           60A  O 22 18
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24  3'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A*
     A*
     A*
     A          R GKBPW342
     A*%%TS  SD  19961114  160058  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('SCREEN 2')
     A                                      CF01
     A                                      CF03
     A                                      BLINK
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'* MATERIALS PROD ORDER CHECK M/F I-
     A                                      NQUIRY *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 70'FMT'
     A                                  1 74'GKBPW34'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  3  7'COMPLETION MATERIAL'
     A N60        @KNZI         15A  O  4 11
     A                                  3 28'WIRE DIAMETER'
     A N60        @ZIST          5Y 2O  4 31EDTCDE(4)
     A                                  3 43'RECEIVING'
     A N60        @UKE           4Y 0O  4 45EDTCDE(4)
     A N60        UKNM          10A  O  4 52
     A N60        HIHN1         78A  O  5  2
     A N60                              6  3'SUPPLIER 1'
     A                                      DSPATR(RI)
     A N60        @SRE1          4Y 0O  7  6EDTCDE(4)
     A N60        @SNM1         18A  O  7 12
     A N60                              9 12'MATERIAL'
     A                                      DSPATR(RI)
     A N60        BZAI1         15A  O 10  8
     A N60                              9 25'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A N60        ZAI1           5Y 2O 10 28EDTCDE(4)
     A N60                              9 40'RECEIVING'
     A                                      DSPATR(RI)
     A N60        UKE1           4Y 0O 10 42EDTCDE(4)
     A N60                              9 51'SUPPLIER'
     A                                      DSPATR(RI)
     A N60        SRE1           4Y 0O 10 53EDTCDE(4)
     A N60        SNM1          18A  O 10 59
     A N60                             12 12'PROD ORDER INSTRUCTION'
     A                                      DSPATR(RI)
     A N60        TKB1           2Y 0O 13 17EDTCDE(4)
     A N60        TNM1          12A  O 13 21
     A N60                             12 40'STEEL TYPE INSTRUCTION'
     A                                      DSPATR(RI)
     A N60        KS1            1A  O 13 45
     A N60        KSNM1          8A  O 13 48
     A N60        HIHN2         78A  O 14  2
     A N70                             15  3'SUPPLIER 2'
     A                                      DSPATR(RI)
     A N70        @SRE2          4Y 0O 16  6EDTCDE(4)
     A N70        @SNM2         18A  O 16 12
     A N70                             18 12'MATERIAL'
     A                                      DSPATR(RI)
     A N70        BZAI2         15A  O 19  8
     A N70                             18 25'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A N70        ZAI2           5Y 2O 19 28EDTCDE(4)
     A N70                             18 40'RECEIVING'
     A                                      DSPATR(RI)
     A N70        UKE2           4Y 0O 19 42EDTCDE(4)
     A N70                             18 51'SUPPLIER'
     A                                      DSPATR(RI)
     A N70        SRE2           4Y 0O 19 53EDTCDE(4)
     A N70        SNM2          18A  O 19 59
     A N70                             21 12'PROD ORDER INSTRUCTION'
     A                                      DSPATR(RI)
     A N70        TKB2           2Y 0O 22 17EDTCDE(4)
     A N70        TNM2          12A  O 22 21
     A N70                             21 40'STEEL TYPE INSTRUCTION'
     A                                      DSPATR(RI)
     A N70        KS2            1A  O 22 45
     A N70        KSNM2          8A  O 22 48
     A                                 24  3'EXIT'
     A                                 24  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 17'PREVIOUS SCREEN'
     A                                 24 34'CMD-3'
     A                                      DSPATR(RI)
