     A*** GKBPW16 *********************************
     A*INQUIRY & UPDATE OF MATERIALS INCOMING RESULTS DATA  *
     A*        H.ITO             88.11.04         *
     A********************************* GKBPW16 ***
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      INVITE
     A          R GKBPW161
     A*%%TS  SD  19961114  133217  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('MATERIALS')
     A                                      CF01
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTCDE(Y)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 17'** MATERIALS INCOMING RESULTS INQU-
     A                                      IRY & UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GKBPW161'
     A                                  4  3' 1 . APPOINTMENT OF INCOMING DATE'
     A            @YY            4Y 0B  4 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  4 45'YEAR'
     A            @MM            2Y 0B  4 50DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                  4 53'MONTH'
     A                                  7  3' 2 . APPOINTMENT OF RCV FACTORY'
     A            @UKER          4Y 0B  7 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                  9 40'0111 IAF'
     A                                 10 40'???? PURCHASE SECTION / SUPPLIER'
     A                                 17  3' 3 . APPOINTMENT OF MATERIALS INST'
     A            @KUBN          1A  B 17 40DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  05                                  DSPATR(RI)
     A  05                                  DSPATR(PC)
     A                                 19 40'A - COMPLETION MATERIALS'
     A                                 20 40'B - MATERIAL'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'INQUIRY EXIT'
     A                                 24 18'CMD-1'
     A                                      DSPATR(RI)
    *A*
    *A*
     A          R GKBPW162
     A*%%TS  SD  19961114  133217  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('MATERIALS')
     A                                      CF01
     A                                      CF03
     A                                      ROLLUP(81)
     A                                      ROLLDOWN(82)
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTCDE(Y)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 17'** MATERIALS INCOMING RESULTS INQU-
     A                                      IRY & UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GKBPW162'
     A                                  3 21'INCOMING DATE'
     A                                      DSPATR(UL)
     A            @YY            4Y 0O  3 40OVRDTA
     A                                  4 39'YEAR'
     A            @MM            2Y 0O  3 50OVRDTA
     A                                  4 49'MONTH'
     A                                  5 21'RCV FACTORY'
     A                                      DSPATR(UL)
     A            @UKER          4Y 0O  5 40OVRDTA
     A            @UMEI         16A  O  5 45OVRDTA
     A                                  7 21'MATERIALS INST'
     A                                      DSPATR(UL)
     A            @KUBN          1A  O  7 40OVRDTA
     A            @KMEI         10A  O  7 45OVRDTA
     A            @KSN1          6A  O 11  3DSPATR(BL)
     A                                      OVRDTA
     A            @KSN2          6A  O 13  3DSPATR(BL)
     A                                      OVRDTA
     A            @KSN3          6A  O 15  3DSPATR(BL)
     A                                      OVRDTA
     A            @KSN4          6A  O 17  3DSPATR(BL)
     A                                      OVRDTA
     A            @KSN5          6A  O 19  3DSPATR(BL)
     A                                      OVRDTA
     A                                  9 13'NO.'
     A                                      DSPATR(RI)
     A            @NO1           1A  B 11 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI)
     A  11                                  DSPATR(PC)
     A            @NO2           1A  B 13 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI)
     A  12                                  DSPATR(PC)
     A            @NO3           1A  B 15 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  13                                  DSPATR(RI)
     A  13                                  DSPATR(PC)
     A            @NO4           1A  B 17 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  14                                  DSPATR(RI)
     A  14                                  DSPATR(PC)
     A            @NO5           1A  B 19 14DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  15                                  DSPATR(RI)
     A  15                                  DSPATR(PC)
     A                                  9 18'ABOLISH'
     A                                      DSPATR(RI)
     A            @SKJ1          3A  O 11 20OVRDTA
     A            @SKJ2          3A  O 13 20OVRDTA
     A            @SKJ3          3A  O 15 20OVRDTA
     A            @SKJ4          3A  O 17 20OVRDTA
     A            @SKJ5          3A  O 19 20OVRDTA
     A                                  9 29'MATERIAL'
     A                                      DSPATR(RI)
     A            @ZNM1         15A  O 11 26OVRDTA
     A            @ZNM2         15A  O 13 26OVRDTA
     A            @ZNM3         15A  O 15 26OVRDTA
     A            @ZNM4         15A  O 17 26OVRDTA
     A            @ZNM5         15A  O 19 26OVRDTA
     A                                  9 41'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A            @ZIK1          5Y 2O 11 44EDTWRD('   .  ')
     A                                      OVRDTA
     A            @ZIK2          5Y 2O 13 44EDTWRD('   .  ')
     A                                      OVRDTA
     A            @ZIK3          5Y 2O 15 44EDTWRD('   .  ')
     A                                      OVRDTA
     A            @ZIK4          5Y 2O 17 44EDTWRD('   .  ')
     A                                      OVRDTA
     A            @ZIK5          5Y 2O 19 44EDTWRD('   .  ')
     A                                      OVRDTA
     A                                  9 56'SUPPLIER'
     A                                      DSPATR(RI)
     A            @SIR1          4Y 0O 11 56EDTCDE(Z)
     A                                      OVRDTA
     A            @SIR2          4Y 0O 13 56EDTCDE(Z)
     A                                      OVRDTA
     A            @SIR3          4Y 0O 15 56EDTCDE(Z)
     A                                      OVRDTA
     A            @SIR4          4Y 0O 17 56EDTCDE(Z)
     A                                      OVRDTA
     A            @SIR5          4Y 0O 19 56EDTCDE(Z)
     A                                      OVRDTA
     A            @SNM1         16A  O 11 62OVRDTA
     A            @SNM2         16A  O 13 62OVRDTA
     A            @SNM3         16A  O 15 62OVRDTA
     A            @SNM4         16A  O 17 62OVRDTA
     A            @SNM5         16A  O 19 62OVRDTA
     A                                 20 14'|'
     A                                 21 14'+-> INPUTS UPDATE INST'
     A                                 21 37'( 0- CANCEL 1- CHANGE M- DETAILS)'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  2'INQUIRY EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 21'PRV.SCREEN'
     A                                 24 32'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 38'NEXT DETAILS'
     A                                 24 51'ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 59'PRV.DETAILS'
     A                                 24 71'ROLL-DWN'
     A                                      DSPATR(RI)
    *A*
    *A*
     A          R GKBPW163
     A*%%TS  SD  19961114  133217  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('MATERIALS')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTCDE(Y)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 17'** MATERIALS INCOMING RESULTS INQU-
     A                                      IRY & UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GKBPW163'
     A                                  3 21'UPDATE INST'
     A                                      DSPATR(UL)
     A            @KOSN          9A  O  3 40OVRDTA
     A                                  5 21'INCOMING DATE'
     A                                      DSPATR(UL)
     A            @YY            4Y 0O  5 40OVRDTA
     A                                  5 45'YEAR'
     A            @MM            2Y 0O  5 50OVRDTA
     A                                  5 53'MONTH'
     A                                  7 21'RCV FACTORY'
     A                                      DSPATR(UL)
     A            @UKER          4Y 0O  7 40OVRDTA
     A            @UMEI         16A  O  7 45OVRDTA
     A                                  9 21'MATERIALS INST'
     A                                      DSPATR(UL)
     A            @KUBN          1A  O  9 40OVRDTA
     A            @KMEI         10A  O  9 45OVRDTA
     A                                 12  5'CMPLET MATERIAL'
     A                                      DSPATR(RI)
     A            X4KAZN        15A  O 14  5OVRDTA
     A                                 12 22'CMPLET WIRE DIAMETER'
     A                                      DSPATR(RI)
     A            X4KAZI         5Y 2O 14 29EDTCDE(2)
     A                                      OVRDTA
     A                                 12 44'QUALITY OF MATERIAL'
     A                                      DSPATR(RI)
     A            X4BOZN        15A  O 14 46OVRDTA
     A                                 12 65'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A            X4BOZI         5Y 2O 14 68EDTCDE(2)
     A                                      OVRDTA
     A                                 17 10'INCOMING WEIGHT'
     A                                      DSPATR(RI)
     A            X4JRYO         9Y 0B 19 13EDTCDE(3)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  31                                  DSPATR(PR)
     A                                 17 27'SUPPLIER'
     A                                      DSPATR(RI)
     A            X4SIRE         4Y 0O 19 29OVRDTA
     A                                 17 37'PROD ORDER INST'
     A                                      DSPATR(RI)
     A            X4TEHI         2Y 0O 19 39EDTCDE(Z)
     A                                      OVRDTA
     A            X4TMEI        12A  O 19 42OVRDTA
     A                                 17 58'STEEL TYPE INST'
     A                                      DSPATR(RI)
     A            X4KUBN         1A  O 19 60OVRDTA
     A            X4KMEI         8A  O 19 62OVRDTA
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'KEY INPUT'
     A                                 24 16'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 25'UPDATE OK'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
    *A*
    *A*
     A          R GKBPW164
     A*%%TS  SD  19961114  133217  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('MATERIALS')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTCDE(Y)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 17'** MATERIALS INCOMING RESULTS INQU-
     A                                      IRY & UPDATE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT GKBPW164'
     A                                  3 21'UPDATE INST'
     A                                      DSPATR(UL)
     A            @KOSN          9A  O  3 40OVRDTA
     A                                  5 21'INCOMING DAY'
     A                                      DSPATR(UL)
     A            @YY            4Y 0O  5 40OVRDTA
     A                                  5 45'YEAR'
     A            @MM            2Y 0O  5 50OVRDTA
     A                                  5 53'MONTH'
     A                                  7 21'RCV FACTORY'
     A                                      DSPATR(UL)
     A            @UKER          4Y 0O  7 40OVRDTA
     A            @UMEI         16A  O  7 45OVRDTA
     A                                  9 21'MATERIALS INST'
     A                                      DSPATR(UL)
     A            @KUBN          1A  O  9 40OVRDTA
     A            @KMEI         10A  O  9 45OVRDTA
     A                                 12  5'CMPLET MATERIAL'
     A                                      DSPATR(RI)
     A                                 12 22'CMPLET WIRE DIAMETER'
     A                                      DSPATR(RI)
     A                                 12 44'QUALITY OF MATERIAL'
     A                                      DSPATR(RI)
     A            X6BOZN        15A  O 14 46OVRDTA
     A                                 12 65'WIRE DIAMETER'
     A                                      DSPATR(RI)
     A            X6BOZI         5Y 2O 14 68EDTCDE(2)
     A                                      OVRDTA
     A                                 17 10'INCOMING WEIGHT'
     A                                      DSPATR(RI)
     A            X6JRYO         9Y 0B 19 13EDTCDE(3)
     A                                      DSPATR(CS)
     A                                      CHECK(RB)
     A                                      OVRDTA
     A                                      OVRATR
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A  31                                  DSPATR(PR)
     A                                 17 27'SUPPLIER'
     A                                      DSPATR(RI)
     A            X6SIRE         4Y 0O 19 29OVRDTA
     A                                 17 37'PROD ORDER INST'
     A                                      DSPATR(RI)
     A            X6TEHI         2Y 0O 19 39EDTCDE(Z)
     A                                      OVRDTA
     A            X6TMEI        12A  O 19 42OVRDTA
     A                                 17 58'STEEL TYPE INST'
     A                                      DSPATR(RI)
     A            X6KUBN         1A  O 19 60OVRDTA
     A            X6KMEI         8A  O 19 62OVRDTA
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'KEY INPUT'
     A                                 24 16'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 25'UPDATE OK'
     A                                 24 37'CMD-5'
     A                                      DSPATR(RI)
