     A* TCHK  10/05/12 CREATE(COPY FROM GDGPW05)
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF01(01)
     A                                      CF05(05)
     A          R DSP01
     A*%%TS  SD  20031009  082804  TEST        REL-V4R4M0  5769-PW1
     A                                  1  2'GTBC05'
     A                                  1 20'** ACZ PARTS ORDER SUMMARIZATION *-
     A                                      *'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                 23  4'F1:END      F5:SUMMARIZE'
     A                                  7 14'You have'
     A                                      DSPATR(HI)
     A            D@KN           5Y 0O  7 23EDTCDE(3) DSPATR(HI)
     A                                  7 29'kanbans already scanned.'
     A                                      DSPATR(HI)
