     A*%%TS  SD  20250905  145406  I0777       REL-V7R4M0  5770-WDS
     A** IAFPW01 ********************************************
     A*  UPDATE IAF JOB SCHEDULER CONTROL FILE              *
     A*  LEC    2024.01.23                                  *
     A*******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(UL)
     A                                      PRINT
     A*-----------------------------------------------------
     A          R SFL01                     SFL
     A            S1SEL          1A  B  4  7DSPATR(UL)
     A            S1JBNM        10   O  4 11
     A            S1PGNM        10   O  4 24
     A            S1JOBQ        10   O  4 37
     A            S1STAT         1   O  4 51
     A            H1DESC        30   H
     A            H1DAYS         7   H
     A            H1FCAL         4S 0H
     A            H1LCAL         4S 0H
     A            H1FQMN         4S 0H
     A* ----------------------------------------------------
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A                                      CF01
     A                                      CF06
     A                                      OVERLAY
     A N41                                  SFLDSP
     A N41                                  SFLDSPCTL
     A  41                                  SFLCLR
     A N42                                  SFLEND(*MORE)
     A            #RCN01         4S 0H      SFLRCDNBR
     A            #PGM           8A  O  1  3
     A                                  1 24'** Job Scheduler Control **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3  7'X'
     A                                  3 11'Job Name  '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3 24'Program   '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 37'JobQ Name '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 49'Status'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A* ----------------------------------------------------
     A          R FMT02
     A*%%TS  SD  20250905  145406  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF12
     A            #PGM           8A  O  1  3
     A                                  1 24'** Job Scheduler Control **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3 11'Job Name  '
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  3 24'Program   '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 37'JobQ Name '
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 49'Status'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A  99                             23  2'Error'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A  99        XMSG          60A  O 23  8
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 47'F12:Cancel'
     A                                      DSPATR(RI)
     A            F2JBNM        10A  O  4 11COLOR(PNK)
     A            F2PGM         10A  B  4 24
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            F2JOBQ        10A  B  4 37
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            F2STAT         1A  B  4 51
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  6 11'Description'
     A                                      COLOR(WHT)
     A            F2DESC        30A  B  6 24
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                      CHECK(LC)
     A                                  8 22'Schedule Days'
     A                                      COLOR(WHT)
     A                                  9 25'Mon'
     A                                 10 25'Tue'
     A                                 11 25'Wed'
     A                                 12 25'Thu'
     A                                 13 25'Fri'
     A                                 14 25'Sat'
     A                                 15 25'Sun'
     A            F2MON          1A  B  9 30VALUES('0' '1')
     A            F2TUE          1A  B 10 30VALUES('0' '1')
     A            F2WED          1A  B 11 30VALUES('0' '1')
     A            F2THU          1A  B 12 30VALUES('0' '1')
     A            F2FRI          1A  B 13 30VALUES('0' '1')
     A            F2SAT          1A  B 14 30VALUES('0' '1')
     A            F2SUN          1A  B 15 30VALUES('0' '1')
     A                                 17 10'First Run Time'
     A                                      COLOR(WHT)
     A                                 18 11'Last Run Time'
     A                                      COLOR(WHT)
     A                                 19 15'Run Every'
     A                                      COLOR(WHT)
     A            F2FCAL         4Y 0B 17 26CHECK(RZ)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                      EDTWRD('0  :  ')
     A            F2LCAL         4Y 0B 18 26CHECK(RZ)
     A                                      EDTWRD('  :  ')
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A            F2FQMN         4Y 0B 19 27EDTCDE(Z)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                      CHECK(RB)
     A                                 19 33'minutes'
     A                                      COLOR(WHT)
     A                                  3 65'A = Active'
     A                                      COLOR(BLU)
     A                                  4 65'H = Hold'
     A                                      COLOR(BLU)
     A                                  5 65'D = Delete'
     A                                      COLOR(RED)
     A                                 11 14'1 = Run'
     A                                      COLOR(BLU)
     A                                 10 14'0 = No'
     A                                      COLOR(BLU)
     A* ----------------------------------------------------
     A          R DSP98
     A  99                             23  2'Error'
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A  99        XMSG          60A  O 23  8
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 24  2'F1:End'
     A                                      DSPATR(RI)
     A                                 24 20'F6:Add Job'
     A                                      DSPATR(RI)
     A* ----------------------------------------------------
     A          R WINADD
     A                                      WINDOW(5 15 10 50)
     A                                      CF12
     A                                      INVITE
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
     A                                       (*CHAR '...:::.:'))
     A                                  2  3' Add Job to Schedule '
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  5  3'Job Name:'
     A            W1JBNM        10A  B  5 13DSPATR(CS)
     A  67                                  DSPATR(RI)
     A                                  9  4'F12: Cancel'
     A            WMSG          25   O  7  5COLOR(RED)
