TCHK1A* TCHK1 04/26/06 CREATE(COPY FROM INVPW10)           *
TCHK2A* TCHK2 02/07/11 RMV LOCATION                        *
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      CF02
     A                                      CF04
     A                                      CF06
     A*
     A          R DSP00
     A  99                                  ALARM
     A                                  1  2'    * WASHER *     '
     A                                      DSPATR(RI)
     A                                  2  2'* INVENTORY ENTRY *'
     A                                      DSPATR(RI)
     A                                  4  3'YOUR USER ID'
     A            D@USER         6Y 0B  5  4
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                  8  2'F3:END ENTER:NEXT'
     A                                      DSPATR(RI)
     A            MSG           16A  O 10  1
     A*
     A          R DSP01
     A  99                                  ALARM
     A                                  1  2'   * WASHER *    '
     A                                      DSPATR(RI)
TCHK2A*                                 2  2'*KANBAN/LOCATION*'
TCHK2A                                  2  2'***  KANBAN  ***'
     A                                      DSPATR(RI)
     A            D@KNBN        17A  B  5  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  9  1'F2=DEL PRV'
     A                                      DSPATR(RI)
     A                                  9 12'F3=PRV.'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O 10  1
     A*
     A          R DSP03
     A  99                                  ALARM
     A                                  1  2'  * WASHER *   '
     A                                      DSPATR(RI)
     A                                  2  2'# OF CONTAINERS'
     A                                      DSPATR(RI)
TCHK2A            D@BART        17A  O  3  2
TCHK2A            D@LOCT         9A  O  4  2
TCHK2A                                  5  2'QPC='
TCHK2A            D@QPCT         7Y 0O  5  7EDTCDE(4)
TCHK2A            D@KANS         3Y 0B  7  6EDTCDE(4)
     A                                      DSPATR(CS)
     A                                  8  1'F3=PREV.'
     A                                      DSPATR(RI)
     A                                  9  1'ENTR:WRT  F2=SUBTRACT'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O 10  1
     A*
     A*
     A          R DSP07
     A                                  1  2' * WASHER * '
     A                                      DSPATR(RI)
     A                                  2  2'PREV KANBANS'
     A                                      DSPATR(RI)
     A            D@BARV        17A  O  3  2
     A            D@KANV         3Y 0O  5  6EDTCDE(4)
     A                                      DSPATR(CS)
     A                                  8  1'F3=CANCEL'
     A                                      DSPATR(RI)
     A                                  9  1'F4=DELETE'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O 10  1
     A*
     A          R DSP97
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2'OO    OO           '
     A                                  7  2' OOOOOO            '
     A                                  8  2'        KK    KKK  '
     A                                  9  2'        KK   KK    '
     A                                 10  2'        KK  KK     '
     A                                 11  2'        KKKKK      '
     A                                 12  2'        KK  KK     '
     A                                 13  2'        KK   KK    '
     A                                 14  2'        KK    KKK  '
     A                                 16  2'ENTER:CONTINUE'
