     A* TCHK  10/23/12 CREATE(COPY FROM INVPW10)
     A* TCHK1 04/24/13 ADD TM-CODE CHECK
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A                                      CF05
     A                                      CF07
     A                                      CF02
     A                                      CF04
     A                                      CF06
     A* ----------------------------------------------------
     A          R DSP00
     A                                  1  2'* QD OUTS INVENTORY *'
     A                                      DSPATR(RI)
     A                                  4  3'YOUR USER ID'
     A            D@USER         6Y 0B  5  4
TCHK1A  61                                  DSPATR(RI)
TCHK1A  61                                  DSPATR(PC)
     A                                  8  2'F3:END ENTER:NEXT'
     A                                      DSPATR(RI)
     A            MSG           16A  O  9  1
     A* ----------------------------------------------------
     A          R DSP01
     A                                  1  2'* QD OUTS INVENTORY *'
     A                                      DSPATR(RI)
     A                                  2  3'*  KANBAN  *'
     A                                      DSPATR(RI)
     A            D@APCS        15A  B  5  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  8  1'F2=DEL PRV'
     A                                      DSPATR(RI)
     A                                  8 12'F3=PRV.'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O  9  1
     A* ----------------------------------------------------
     A          R DSP03
     A                                  1  2'* QD OUTS INVENTORY *'
     A                                      DSPATR(RI)
     A                                  2  2'* BIN# *'
     A                                      DSPATR(RI)
     A            D@BAR         15A  O  3  2
     A            D@BIN#         3A  B  5  6
     A                                      DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7  1'F3=PREV.'
     A                                      DSPATR(RI)
     A                                  8  1'ENTR:WRITE'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O  9  1
     A* ----------------------------------------------------
     A          R DSP04
     A                                  1  2'* QD OUTS INVENTORY *'
     A                                      DSPATR(RI)
     A                                  2  2'CANCEL APICS KANBAN'
     A                                      DSPATR(RI) COLOR(PNK)
     A            D@APCS        15A  B  3  2CHECK(ER)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7  1'F7:GO BACK       '
     A            D@ERR         16A  O  9  1
     A* ----------------------------------------------------
     A          R DSP07
     A                                  1  2'* QD OUTS INVENTORY *'
     A                                      DSPATR(RI)
     A                                  2  2'PREV KANBANS'
     A                                      DSPATR(RI)
     A            D@BARV        15A  O  3  2
     A            D@BINN         3A  O  5  6
     A                                  7  1'F3=CANCEL'
     A                                      DSPATR(RI)
     A                                  8  1'F4=DELETE'
     A                                      DSPATR(RI)
     A            D@ERR         16A  O  9  1
     A*****************************************************************
     A          R DSP97
     A                                  1  2' OOOOOO            '
     A                                  2  2'OO    OO           '
     A                                  3  2'OO    OO           '
     A                                  4  2'OO    OO           '
     A                                  5  2'OO    OO           '
     A                                  6  2'OO    OO           '
     A                                  7  2' OOOOOO            '
     A                                  8  2'        KK    KKK  '
     A                                  9  2'        KK   KK    '
     A                                 10  2'        KK  KK     '
     A                                 11  2'        KKKKK      '
     A                                 12  2'        KK  KK     '
     A                                 13  2'        KK   KK    '
     A                                 14  2'        KK    KKK  '
     A                                 16  2'ENTER:CONTINUE'
