     A** INVPW49 *******************************************
     A*                                                    *
     A*              T.SAKASHITA 2014.08.05                *
     A******************************************* BTMPWD1 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A*----------------------------------------------------------------
     A          R SFREC1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ')
     A                                      SFL
     A* * *       S1SELC         1   B  6  2DSPATR(CS UL)
     A            P#BMON         4      6  2
     A            P#KOTE         3       + 1
     A            P#KIBN         3       + 1
     A            O@BOX1         5  1    + 1
     A            O@BOX2         5  1    + 1
     A            P#RUNB         4  0    + 1
     A            O@BOX3         5  1    + 1
     A            K@BAN1         1       + 1
     A            K@BAN2         2       + 1
     A            K@BAN3         2       + 1
     A            K@BAN4         1       + 1
     A            W@KANS         4  0    + 1
     A            W@SHTB         5  1    + 1
     A            W@PRDB         5  1    + 1
     A            ##DYMD         8  0    + 1
     A            ##THMS         6  0    + 1
     A*----------------------------------------------------------------
      *
     A          R SFCTL1                    TEXT('ﾅﾎﾞ､ﾎｦbﾓ ﾃ]nﾜｰﾓ')
     A                                      SFLCTL(SFREC1)
     A                                      CF03 BLINK
     A  99                                  ALARM
     A                                      OVERLAY PROTECT
     A                                      SFLPAG(16) SFLSIZ(17)
     A  71                                  SFLDSP SFLDSPCTL
     A  72                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP(73)
     A                                      ROLLDOWN(73)
     A* 99                                  SFLMSG('これ以上データ無し' 99)
     A            DSPRRN         4  0H      SFLRCDNBR
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'                                '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'INVPW49'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  5  2'DEP '
     A                                       DSPATR(UL)
     A                                   + 1'PRC'
     A                                       DSPATR(UL)
     A                                   + 1'M/C'
     A                                       DSPATR(UL)
     A                                   + 1'GROUP'
     A                                       DSPATR(UL)
     A                                   + 1'COST CENTER'
     A                                       DSPATR(UL)
     A                                  5 40'ASSETS NO'
     A                                       DSPATR(UL)
     A* * *                             5 44'旧収容数'
     A* * *                                  DSPATR(UL)
     A* * *                             5 56'新収容数'
     A* * *                                  DSPATR(UL)
     A* * *                             5 71'切替日'
     A* * *                                  DSPATR(UL)
      *
     A          R DSP01                     TEXT('ﾃu]nﾞ ﾈlxb')
     A  99                             23 11'ERROR' DSPATR(RI BL)
     A  99        @ERR          60A  O 23 18
     A                                 24  2' F3 ' DSPATR(RI)
     A                                   + 1' RETURN '
     A                                   +45' PAGE UP/DOWN ' DSPATR(RI)
