     A*%%TS  SD  20220503  143102  I0777       REL-V7R3M0  5770-WDS
     A**** IZAPW65 ****************************************************
     A*  WIRE 4 POINT SCAN RESULT INQUIRY
     A*   KIRI                                               2019.09.16
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R DSP01
     A*%%TS  SD  20220503  143102  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('SCREEN 1')
     A                                      CF01
     A                                      BLINK
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23'* WIRE 4 POINT SCAN RESULT INQUIRY-
     A                                       *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT'
     A                                  1 72'IZAPW65'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  6 25'FROM'
     A                                  6 45'TO'
     A*
     A                                  7 10'SCAN DATE'
     A*
     A*
     A            D1SHIZ         8Y 0B  7 25DSPATR(CS)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A            D1STMH         2Y 0B  7 35DSPATR(CS)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A                                  7 38':'
     A            D1STMM         2Y 0B  7 40DSPATR(CS)
     A  32                                  DSPATR(PC)
     A  32                                  DSPATR(RI)
     A*
     A                                  7 43'-'
     A            D1EHIZ         8Y 0B  7 45DSPATR(CS)
     A                                      EDTCDE(4)
     A  33                                  DSPATR(PC)
     A  33                                  DSPATR(RI)
     A            D1ETMH         2Y 0B  7 55DSPATR(CS)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                  7 58':'
     A            D1ETMM         2Y 0B  7 60DSPATR(CS)
     A  34                                  DSPATR(PC)
     A  34                                  DSPATR(RI)
     A                                  9 10'LOT TAG #'
     A*
     A            D1LOT          7A  B  9 25DSPATR(CS)
     A  35                                  DSPATR(PC)
     A  35                                  DSPATR(RI)
     A                                 11 10'SUPPLIER '
     A*
     A            D1SUPP         4Y 0B 11 25DSPATR(CS)
     A                                      EDTCDE(4)
     A  36                                  DSPATR(PC)
     A  36                                  DSPATR(RI)
     A                                 13 10'MATERIAL NAME'
     A*
     A            D1ZAIS        15A  B 13 25DSPATR(CS)
     A  37                                  DSPATR(PC)
     A  37                                  DSPATR(RI)
     A                                 15 10'DIAMETER'
     A            D1ZAIK         5Y 2B 15 25DSPATR(CS)
     A                                      EDTCDE(4)
     A  38                                  DSPATR(PC)
     A  38                                  DSPATR(RI)
     A                                 17 10'JUDGE'
     A            D1OKNG         1A  B 17 25DSPATR(CS)
     A  39                                  DSPATR(PC)
     A  39                                  DSPATR(RI)
     A*
     A                                 17 29'(1:OK, 2:NG, Blank:All)'
     A* *
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D1ERR         60A  O 22 18DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 24  6' F1 '
     A                                      DSPATR(RI)
     A                                 24 11'EXIT'
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R SFREC1                    SFL
     A*%%TS  SD  20220503  141502  I0777       REL-V7R3M0  5770-WDS
     A                                      TEXT('SUBFILE')
     A            S1OP           1A  B  5  2DSPATR(CS)
     A                                      VALUES(' ' 'M')
     A            S1CODT         8Y 0O  5  4TEXT('CHECK DATE')
     A                                      EDTWRD('    /  /  ')
     A            S1COTM         6Y 0O  5 15TEXT('CHECK TIME')
     A                                      EDTWRD('0 :  :  ')
     A            S1LTB1         7A  O  5 24TEXT('LOT TAG BARCODE')
     A            S1ZAIS        15A  O  5 33TEXT('MATERIAL NAME')
     A            S1ZAIK         5Y 2O  5 49TEXT('DIAMETER')
     A                                      EDTWRD(' 0 .  ')
     A            S1WZAS        15A  O  5 56TEXT('MATERIAL NAME')
     A            S1WZAK         5Y 2O  5 72TEXT('DIAMETER')
     A                                      EDTWRD(' 0 .  ')
     A            S1OKNG         2A  O  5 79TEXT('JUDGE')
     A  88                                  COLOR(RED)
     A*
     A            S1LOTN        11A  H      TEXT('LOT TAG NO.')
     A            S1ADNO         7A  H      TEXT('Q.A. NO.')
     A            S1WOKR        10A  H      TEXT('WORKER CODE')
     A            S1WKCD         6S 0H      TEXT('WORKER CODE')
     A            S1WKNM        20A  H      TEXT('WORKER NAME')
     A            S1SUPP         4S 0H      TEXT('SUPPLIER')
     A            S1CHNO        10A  H      TEXT('CHARGE NO.')
     A            S1WEIG         5S 1H      TEXT('WEIGHT')
     A            S1MNDT         8S 0H      TEXT('MANUFACTURE DATE')
     A            S1INDT         8S 0H      TEXT('INCOMING DATE')
     A            S1COIN         9A  H      TEXT('COIL NO.')
     A            S1QAQR        76A  H      TEXT('QR C')
     A*
     A            S1WBCD        17A  H      TEXT('WIRE KANBAN BCD')
     A            S12UPP         4S 0H      TEXT('SUPPLIER')
     A            S12DNO         7A  H      TEXT('Q.A. NO.')
     A            S12AIS        15A  H      TEXT('MATERIAL NAME')
     A            S12AIK         5S 2H      TEXT('DIAMETER')
     A            S12HNO        10A  H      TEXT('CHARGE NO.')
     A            S12EIG         5S 1H      TEXT('WEIGHT')
     A            S12NDT         8S 0H      TEXT('MANUFACTURE DATE')
     A            S12IDT         8S 0H      TEXT('INCOMING DATE')
     A            S12OIN         9A  H      TEXT('COIL NO.')
     A            S12OTN        11A  H      TEXT('LOT TAG NO.')
     A            S12AQR        76A  H      TEXT('QR A')
     A            S188           1A  H      TEXT('SAVE *IN88')
     A*
     A          R SFCTL1                    SFLCTL(SFREC1)
     A*%%TS  SD  20200312  135018  I0777       REL-V7R3M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0015)
     A                                      TEXT('SUBFILE CONTROL')
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CF03
JW   A                                      CF12
     A                                      BLINK
     A  99                                  ALARM
     A  71                                  SFLDSPCTL
     A  72                                  SFLDSP
     A  73                                  SFLCLR
     A                                      ROLLUP(75)
     A                                      ROLLDOWN(76)
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23'* WIRE 4 POINT SCAN RESULT INQUIRY-
     A                                       *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT'
     A                                  1 72'IZAPW65'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  3 23'/LOT TAG'
     A                                      COLOR(WHT)
     A                                  3 32'/QA TAG'
     A                                      COLOR(WHT)
     A                                  3 55'/WIRE KANBAN'
     A                                      COLOR(WHT)
     A                                  3 78'/OK'
     A                                      COLOR(WHT)
     A*
     A                                  4  2'M SCAN DATE/TIME     /ID #    /MAT-
     A                                      ERIAL NAME     DIA /MATERIAL NAME  -
     A                                         DIA /NG'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R DSP02
     A*%%TS  SD  20220503  143102  I0777       REL-V7R3M0  5770-WDS
     A                                 20  2'|'
     A                                 21  2'+--> M:DETAILS'
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        D2ERR         60A  O 22 18DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 24  7' F3 '
     A                                      DSPATR(RI)
     A                                 24 12'BACK'
     A                                 24 33'ROLL-UP/DOWN'
     A                                      DSPATR(RI)
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R DSP03
     A*%%TS  SD  20220503  141738  I0777       REL-V7R3M0  5770-WDS
     A                                      CF03
     A                                      BLINK
     A  99                                  ALARM
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23'* WIRE 4 POINT SCAN RESULT INQUIRY-
     A                                       *'
     A                                      DSPATR(RI)
     A                                  1 68'FMT'
     A                                  1 72'IZAPW65'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A************
     A                                  4  4'SCAN DATE'
     A                                      COLOR(WHT)
     A            S1CODT         8Y 0O  4 14TEXT('CHECK DATE')
     A                                      EDTWRD('    /  /  ')
     A                                  4 25'-'
     A            S1COTM         6Y 0O  4 27TEXT('CHECK TIME')
     A                                      EDTWRD('  :  :  ')
     A                                  4 39'TEAM MEMBER'
     A                                      COLOR(WHT)
     A            S1WKCD         6Y 0O  4 51
     A            S1WKNM        20A  O  4 58
     A*
     A                                  5  4'SCAN RESULT'
     A                                      COLOR(WHT)
     A            S1OKNG         2A  O  5 17TEXT('JUDGE')
     A  88                                  COLOR(RED)
     A************
     A*
     A                                  6  4'1-(LOT TAG)'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  6 23'4-(WIRE KANBAN)'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                  7  4'LOT TAG ID'
     A                                      DSPATR(UL)
     A                                  7 23'MATERIAL NAME  '
     A                                      DSPATR(UL)
     A                                  7 42'DIAMETER'
     A                                      DSPATR(UL)
     A                                  7 54'BARCODE          '
     A                                      DSPATR(UL)
     A*
     A            S1LTB1         7A  O  8  6TEXT('LOT TAG BARCODE')
     A            S1WZAS        15A  O  8 23TEXT('MATERIAL NAME')
     A            S1WZAK         5Y 2O  8 43TEXT('DIAMETER')
     A                                      EDTWRD(' 0 .  ')
     A            S1WBCD        17A  O  8 54TEXT('WIRE KANBAN BCD')
     A*
     A************
     A*
     A                                  9  4'2-(QA TAG C)'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 10  4'SUPPLIER'
     A                                      DSPATR(UL)
     A                                 10 16'QUALITY ASUARANCE #'
     A                                      DSPATR(UL)
     A                                 10 39' MATERIAL NAME '
     A                                      DSPATR(UL)
     A                                 10 58'DIAMETER'
     A                                      DSPATR(UL)
     A                                 10 69'CHARGE #  '
     A                                      DSPATR(UL)
     A*
     A            S1SUPP         4S 0O 11  6TEXT('SUPPLIER')
     A            S1ADNO         7A  O 11 22TEXT('Q.A. NO.')
     A            S1ZAIS        15A  O 11 40TEXT('MATERIAL NAME')
     A            S1ZAIK         5Y 2O 11 59TEXT('DIAMETER')
     A                                      EDTWRD(' 0 .  ')
     A            S1CHNO        10A  O 11 70TEXT('CHARGE NO.')
     A*          *
     A                                 12  4'WEIGHT'
     A                                      DSPATR(UL)
     A                                 12 14'MANUFACTURE DATE'
     A                                      DSPATR(UL)
     A                                 12 34'INCOMING DATE'
     A                                      DSPATR(UL)
     A                                 12 51'COIL #     '
     A                                      DSPATR(UL)
     A                                 12 66'LOT TAG #   '
     A                                      DSPATR(UL)
     A*
     A            S1WEIG         5Y 1O 13  4TEXT('WEIGHT')
     A                                      EDTWRD('  0 . ')
     A            S1MNDT         8Y 0O 13 16TEXT('MANUFACTURE DATE')
     A                                      EDTWRD('    /  /  ')
     A            S1INDT         8Y 0O 13 35TEXT('INCOMING DATE')
     A                                      EDTWRD('    /  /  ')
     A            S1COIN         9A  O 13 52TEXT('COIL NO.')
     A            S1LOTN        11A  O 13 67TEXT('LOT TAG NO.')
     A*
     A                                 14  4'QR CODE                           -
     A                                                                         -
     A                                             '
     A                                      DSPATR(UL)
     A            S1QAQR        76A  O 15  5
     A*
     A************
     A*
     A                                 16  4'3-(QA TAG A)'
     A                                      DSPATR(RI)
     A                                      DSPATR(HI)
     A                                 17  4'SUPPLIER'
     A                                      DSPATR(UL)
     A                                 17 16'QUALITY ASUARANCE #'
     A                                      DSPATR(UL)
     A                                 17 39' MATERIAL NAME '
     A                                      DSPATR(UL)
     A                                 17 58'DIAMETER'
     A                                      DSPATR(UL)
     A                                 17 69'CHARGE #  '
     A                                      DSPATR(UL)
     A*
     A            S12UPP         4S 0O 18  6TEXT('SUPPLIER')
     A            S12DNO         7A  O 18 22TEXT('Q.A. NO.')
     A            S12AIS        15A  O 18 40TEXT('MATERIAL NAME')
     A            S12AIK         5Y 2O 18 59TEXT('DIAMETER')
     A                                      EDTWRD(' 0 .  ')
     A            S12HNO        10A  O 18 70TEXT('CHARGE NO.')
     A*          *
     A                                 19  4'WEIGHT'
     A                                      DSPATR(UL)
     A                                 19 14'MANUFACTURE DATE'
     A                                      DSPATR(UL)
     A                                 19 34'INCOMING DATE'
     A                                      DSPATR(UL)
     A                                 19 51'COIL #     '
     A                                      DSPATR(UL)
     A                                 19 66'LOT TAG #   '
     A                                      DSPATR(UL)
     A*
     A            S12EIG         5Y 1O 20  4TEXT('WEIGHT')
     A                                      EDTWRD('  0 . ')
     A            S12NDT         8Y 0O 20 15TEXT('MANUFACTURE DATE')
     A                                      EDTWRD('    /  /  ')
     A            S12IDT         8Y 0O 20 35TEXT('INCOMING DATE')
     A                                      EDTWRD('    /  /  ')
     A            S12OIN         9A  O 20 52TEXT('COIL NO.')
     A            S12OTN        11A  O 20 67TEXT('LOT TAG NO.')
     A*
     A                                 21  4'QR CODE                           -
     A                                                                         -
     A                                             '
     A                                      DSPATR(UL)
     A            S12AQR        76A  O 22  5
     A                                 24  5' F3 '
     A                                      DSPATR(RI)
     A                                 24 10'BACK'
