     A** IZBPW20 ***********************
     A* UPDATE OF MATERIAL COLOR MASTER FILE
     A* GBC              2000.07.27    *
     A*********************** IZBPW20 **
     A                                      PRINT
     A                                      CHGINPDFT
     A* *
     A          R IZBPW201
     A                                      CF01
     A                                      OVERLAY
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 24'** MATERIAL COLOR M/F UPDATE **'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'IZBPW20'
     A                                  5 22'UPDATE'
     A                                      DSPATR(RI)
     A                                  5 32'   MATERIAL    '
     A                                      DSPATR(RI)
     A            KTYPE          1A  B  7 24DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC RI)
     A*
     A            D1ZAIS        15A  B  7 32DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(PC RI)
     A*
     A                                 10 22' 0- CANCEL '
     A                                 11 22' 1- CHANGE '
     A                                 12 22' 2- ADD    '
     A*
     A                                 17 14'LAST TIME'
     A                                 19 22'UPDATE'
     A                                      DSPATR(UL)
     A                                 19 32'   MATERIAL    '
     A                                      DSPATR(UL)
     A            MTYPE          1A  O 20 24OVRDTA
     A            MZAIS         15A  O 20 32OVRDTA
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A*-------------------------------------
     A          R IZBPW202
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 24'** MATERIAL COLOR M/F UPDATE **'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'IZBPW20'
     A*
     A                                  4 25'UPDATE'
     A                                      DSPATR(UL)
     A            KTYPE          1A  O  4 41OVRDTA
     A                                  4 43'-'
     A            WNAME          6A  O  4 45OVRDTA
     A*
     A                                  5 25'MATERIAL'
     A                                      DSPATR(UL)
     A            D2ZAIS        15A  O  5 41OVRDTA
     A*                                      5678901234567890123
     A                                  9 25'MATERIAL COLOR CODE'
     A                                      DSPATR(RI)
     A            D2ZRCD         1A  B  9 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(PC RI)
     A*
     A                                 11 25'MATERIAL COLOR'
     A                                      DSPATR(RI)
     A            D2ZIRO        20A  B 11 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  04                                  DSPATR(PC RI)
     A*
     A                                 21 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 21 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A*
     A                                 23  4'KEY INPUT'
     A                                 23 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 23 24'UPDATE OK'
     A                                 23 35'CMD-5'
     A                                      DSPATR(RI)
