     A*%%TS  SD  20251008  150951  I0777       REL-V7R4M0  5770-WDS
     A** JCMPW17 ****************************************
     A*  CREATE FORD J-COM SHEET DATA  (WORK)           *
     A*  J. WATANABE 05.25.2016                         *
     A***************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A*%%TS  SD  20251008  150951  I0777       REL-V7R4M0  5770-WDS
     A                                      KEEP
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      CF10(10)
     A                                      BLINK
     A                                  1  3'JCMR17'
     A                                  1 22'** CREATE FORD J-COM SHEET DATA **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 66'DATE:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  3'JCMPW17'
     A                                  2 66'TIME:'
     A                                  2 72TIME
     A                                  3  3USER
     A                                  7 24'Fﾏﾄｳﾎｹﾅﾄ..:'
     A            D@PPS          1A  B  7 36
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                  7 39'(A:SEND ASN, C:CANCEL ASN)'
     A                                      COLOR(YLW)
     A                                 11 24'Eﾄﾎｵﾈ ASN#:'
     A            D@ASN          8Y 0B 11 36EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A            XMSG1         70A  O 20  5
     A  85                                  DSPATR(RI)
     A            XMSG2         70A  O 21  5
     A                                 24 16'F1'
     A                                      DSPATR(RI)
     A                                 24 19'END'
     A                                 24 29'F5'
     A                                      DSPATR(RI)
     A                                 24 32'RUN'
     A                                 24 43'F10'
     A                                      DSPATR(RI)
     A                                 24 47'ASN INQ ｱﾄｴ Pﾈｹﾄﾎ Mﾏﾂﾎｹﾆﾂｵ ASNﾍ'
