     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R DSP01
     A                                      KEEP
     A                                      CF01(01)
     A                                  1 22'** TEST JAZZY SCAN PGM FOR JON  **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 66'DATE:'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 66'TIME:'
     A                                  2 72TIME
     A                                  3  3USER
     A                                  8 24'BARCODE:'
     A                                 24 16'F1'
     A                                      DSPATR(RI)
     A                                 24 19'END'
     A            D@BCD         25   B  8 34CHECK(ER)
