     A** KBCPW28 ***********************************
     A* ...SALES DATA INQUIRY UPDATE ... FOR PARM
     A*         I-HASADA           82.05.13        *
     A*********************************** KBCPW28 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A*-------------------------------------*
     A*         .....SCREEN 1.....           *
     A*-------------------------------------*
     A          R KBCPW252
     A*%%TS  SD  19961114  132340  MIKA        REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('SALES DATA INQUIRY')
     A                                      CF01
     A                                      CF03
     A                                      ROLLUP(07 'ROLL UP')
     A                                      ROLLDOWN(08 'ROLL DOWN')
     A                                  1  2'CUSTOMER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1WTOK         4A  O  1 12
     A            B1WTNM        15A  O  1 17
     A                                  1 33'INQUIRY BY  PART NUMB-
     A                                      ER'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1DAIY         6Y 0O  1 72EDTCDE(Y)
     A                                  2  2'DELIVERY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1WNOY         4A  O  2 12
     A            B1WNNM        15A  O  2 17
     A                                  3  2'F.DOCK'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1WKNJ         1A  O  3 10
     A            B1WKNU         4A  O  3 12
     A            B1NKNM        15A  O  3 17
     A  41
     AO 49                              3 39'SALES RECORD IS NO ANY MORE'
     A  41
     AO 49                                  DSPATR(HI)
     A  41
     AO 49                                  DSPATR(BL)
     A  51
     AO 52                              3 39'SALES RECORD CAN NOT COME BACK ANY'
     A  51
     AO 52                                  DSPATR(HI)
     A  51
     AO 52                                  DSPATR(BL)
     A  79                              3 35'INQUIRY.UPDATING BUT THERE ARE NOT-
     A                                       SALES DATA'
     A  79                                  DSPATR(HI)
     A  79                                  DSPATR(BL)
     A                                  4  2'U P/N'
     A                                      DSPATR(RI)
     A            B1MHIB        23A  O  4 10
     A                                  4 31'INT CO P/N'
     A                                      DSPATR(RI)
     A            B1SHIB        14A  O  4 42
     A                                  4 59'PERIOD'
     A                                      DSPATR(RI)
     A            B1WKHZ         4Y 0O  4 66EDTWRD('  .  ')
     A                                  4 72'-'
     A            B1WSHZ         4Y 0O  4 74EDTWRD('  .  ')
     A                                  6  2'NO'
     A                                      DSPATR(RI)
     A                                  6  6'DELV.DATE'
     A                                      DSPATR(RI)
     A                                  6 16'BIN'
     A                                      DSPATR(RI)
     A                                  6 22'AMOUNT'
     A                                      DSPATR(RI)
     A                                  6 29'ORDER.NO.'
     A                                      DSPATR(RI)
     A                                  6 40'DELV.NO.'
     A                                      DSPATR(RI)
     A                                  6 56'PAMT.DATE'
     A                                      DSPATR(RI)
     A*                                 6 66'J'
     A*                                     DSPATR(RI)
     A                                  6 68'BILL'
     A                                      DSPATR(RI)
     A                                  7 68'MONTH'
     A                                      DSPATR(RI)
     A                                  6 74'CRY'
     A                                      DSPATR(RI)
     A                                  7 74'OVR'
     A                                      DSPATR(RI)
     A            B1KOS1         1A  B  8  2DSPATR(CS)
     A  16                                  DSPATR(RI)
     A  16                                  DSPATR(PC)
     A            B1NYZ1         6Y 0O  8  6EDTWRD('  .  .  ')
     A            B1NBI1         1Y 0O  8 16EDTCDE(Z)
     A            B1SRY1         7Y 0O  8 19EDTCDE(2)
     A            B1OER1        10A  O  8 29
     A            B1NBA1        16A  O  8 40
     A            B1JYZ1         6Y 0O  8 57EDTWRD('  .  .  ')
     A*           B1JRY1         1A  O  8 66
     A            B1SEM1         2Y 0O  8 69EDTCDE(Z)
     A            B1KRS1         1Y 0O  8 75EDTCDE(Z)
     A            B1KOS2         1A  B 10  2DSPATR(CS)
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(PC)
     A            B1NYZ2         6Y 0O 10  6EDTWRD('  .  .  ')
     A            B1NBI2         1Y 0O 10 16EDTCDE(Z)
     A            B1SRY2         7Y 0O 10 19EDTCDE(2)
     A            B1OER2        10A  O 10 29
     A            B1NBA2        16A  O 10 40
     A            B1JYZ2         6Y 0O 10 57EDTWRD('  .  .  ')
     A*           B1JRY2         1A  O 10 66
     A            B1SEM2         2Y 0O 10 69EDTCDE(Z)
     A            B1KRS2         1Y 0O 10 75EDTCDE(Z)
     A            B1KOS3         1A  B 12  2DSPATR(CS)
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(PC)
     A            B1NYZ3         6Y 0O 12  6EDTWRD('  .  .  ')
     A            B1NBI3         1Y 0O 12 16EDTCDE(Z)
     A            B1SRY3         7Y 0O 12 19EDTCDE(2)
     A            B1OER3        10A  O 12 29
     A            B1NBA3        16A  O 12 40
     A            B1JYZ3         6Y 0O 12 57EDTWRD('  .  .  ')
     A*           B1JRY3         1A  O 12 66
     A            B1SEM3         2Y 0O 12 69EDTCDE(Z)
     A            B1KRS3         1Y 0O 12 75EDTCDE(Z)
     A            B1KOS4         1A  B 14  2DSPATR(CS)
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(PC)
     A            B1NYZ4         6Y 0O 14  6EDTWRD('  .  .  ')
     A            B1NBI4         1Y 0O 14 16EDTCDE(Z)
     A            B1SRY4         7Y 0O 14 19EDTCDE(2)
     A            B1OER4        10A  O 14 29
     A            B1NBA4        16A  O 14 40
     A            B1JYZ4         6Y 0O 14 57EDTWRD('  .  .  ')
     A*           B1JRY4         1A  O 14 66
     A            B1SEM4         2Y 0O 14 69EDTCDE(Z)
     A            B1KRS4         1Y 0O 14 75EDTCDE(Z)
     A            B1KOS5         1A  B 16  2DSPATR(CS)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A            B1NYZ5         6Y 0O 16  6EDTWRD('  .  .  ')
     A            B1NBI5         1Y 0O 16 16EDTCDE(Z)
     A            B1SRY5         7Y 0O 16 19EDTCDE(2)
     A            B1OER5        10A  O 16 29
     A            B1NBA5        16A  O 16 40
     A            B1JYZ5         6Y 0O 16 57EDTWRD('  .  .  ')
     A*           B1JRY5         1A  O 16 66
     A            B1SEM5         2Y 0O 16 69EDTCDE(Z)
     A            B1KRS5         1Y 0O 16 75EDTCDE(Z)
     A            B1KOS6         1A  B 18  2DSPATR(CS)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A            B1NYZ6         6Y 0O 18  6EDTWRD('  .  .  ')
     A            B1NBI6         1Y 0O 18 16EDTCDE(Z)
     A            B1SRY6         7Y 0O 18 19EDTCDE(2)
     A            B1OER6        10A  O 18 29
     A            B1NBA6        16A  O 18 40
     A            B1JYZ6         6Y 0O 18 57EDTWRD('  .  .  ')
     A*           B1JRY6         1A  O 18 66
     A            B1SEM6         2Y 0O 18 69EDTCDE(Z)
     A            B1KRS6         1Y 0O 18 75EDTCDE(Z)
     A            B1KOS7         1A  B 20  2DSPATR(CS)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A            B1NYZ7         6Y 0O 20  6EDTWRD('  .  .  ')
     A            B1NBI7         1Y 0O 20 16EDTCDE(Z)
     A            B1SRY7         7Y 0O 20 19EDTCDE(2)
     A            B1OER7        10A  O 20 29
     A            B1NBA7        16A  O 20 40
     A            B1JYZ7         6Y 0O 20 57EDTWRD('  .  .  ')
     A*           B1JRY7         1A  O 20 66
     A            B1SEM7         2Y 0O 20 69EDTCDE(Z)
     A            B1KRS7         1Y 0O 20 75EDTCDE(Z)
     A                                 21  2'|'
     A                                 22  2'+--->INPUT UPDATE INSTRUCTION (-
     A                                      M-DTL)'
     A  98        B1WTKH        11A  O 22 62DSPATR(HI)
     A                                      DSPATR(BL)
     A  99        B1EROR         5A  O 23  8DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        B1MSG         65A  O 23 16
     A                                 24  4'INQ EXIT'
     A                                 24 13'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 19', KEY INPUT'
     A                                 24 31'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 37'BACKWARD,'
     A                                 24 47'ROL-DWN'
     A                                      DSPATR(RI)
     A                                 24 55'FORWARD,'
     A                                 24 64'ENTER . ROL-UP'
     A                                      DSPATR(RI)
     A*-------------------------------------*
     A*         .....SCREEN 2.....           *
     A*-------------------------------------*
     A          R KBCPW253
     A*%%TS  SD  19961114  132340  MIKA        REL-V3R0M5  5763-PW1
     A                                      CHGINPDFT
     A                                      TEXT('SALES DATA UPDATE')
     A                                      CF03
     A            B1SNNM        15A  O  1  2
     A                                  1 25'INQUIRY BY PART NUMBE-
     A                                      R'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            B1SKNM        15A  O  1 65
     A            B1KSNA        10A  O  2  2DSPATR(HI)
     A                                      DSPATR(BL)
     A            B1KSH6         6Y 0O  2 15EDTWRD('  .  .  ')
     A                                  3  8'UPDATE'
     A                                      DSPATR(UL)
     A            B1KOSN         1A  O  3 16
     A            B1KSNM         4A  O  3 18
     A                                  3 24'SALES ADDING UP DATE'
     A                                      DSPATR(UL)
     A            B1URH6         6Y 0O  3 45EDTWRD('  .  .  ')
     A                                  3 57'RECORD NO'
     A                                      DSPATR(UL)
     A            B1RCOD         7Y 0O  3 68EDTCDE(Z)
     A                                  4  1'..................................-
     A                                      ...................................-
     A                                      ...........'
     A                                  6  3'CUSTOMER F DOCK'
     A                                      DSPATR(RI)
     A                                  6 23'DELV.CO. F DOCK'
     A                                      DSPATR(RI)
     A                                  6 41'USER PART NBR.'
     A                                      DSPATR(RI)
     A                                  6 62'INTRAL CO. PART NO.'
     A                                      DSPATR(RI)
     A            B1WTTK         4A  B  8  3DSPATR(CS)
     A  17                                  DSPATR(RI)
     A  17                                  DSPATR(PC)
     A            B1TKOJ         1A  B  8  9DSPATR(CS)
     A  18                                  DSPATR(RI)
     A  18                                  DSPATR(PC)
     A            B1TUKE         4A  B  8 13DSPATR(CS)
     A  19                                  DSPATR(RI)
     A  19                                  DSPATR(PC)
     A            B1WNNY         4A  B  8 23DSPATR(CS)
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(PC)
     A            B1NKOJ         1A  B  8 30DSPATR(CS)
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(PC)
     A            B1NUKE         4A  B  8 33DSPATR(CS)
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(PC)
     A            B1MHNB        20A  B  8 41DSPATR(CS)
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(PC)
     A            B1SHNB        12A  B  8 65DSPATR(CS)
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(PC)
     A                                 10  3'DELV.DATE  BIN'
     A                                      DSPATR(RI)
     A                                 10 19'ORDER.NO.'
     A                                      DSPATR(RI)
     A  90                             10 32'SALES UNP  INST'
     A                                      DSPATR(RI)
     A                                 10 48'UNP FORM'
     A                                      DSPATR(RI)
     A                                  9 57'STATEMENT OF'
     A                                      DSPATR(RI)
     A                                 10 57'DELV.NO.'
     A                                      DSPATR(RI)
     A                                 10 74'INST.'
     A                                      DSPATR(RI)
     A            B1NHZ2         8Y 0B 12  4DSPATR(CS)
     A                                      EDTCDE(Z)
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(PC)
     A            B1NOBI         2Y 0B 12 14DSPATR(CS)
     A                                      EDTCDE(Z)
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(PC)
     A            B1ODR1        10A  B 12 19DSPATR(CS)
     A  85                                  DSPATR(RI)
     A  85                                  DSPATR(PC)
     A  90        B1TANK        10Y 5B 12 31DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  90        B1TKBN         1A  B 12 45DSPATR(CS)
     A  90 29                               DSPATR(RI)
     A  90 29                               DSPATR(PC)
     A            B1TTAI         1A  B 12 51DSPATR(CS)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A            B1NBAN        16A  B 12 57DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A            B1NSYO         1A  B 12 75DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                 14  8'DELV QTY  UNIT'
     A                                      DSPATR(RI)
     A                                 14 28'RECT DAY  INST'
     A                                      DSPATR(RI)
     A                                 14 46'S.SEQ  PAYMENT DATE'
     A                                      DSPATR(RI)
     A                                 14 68'SIGN- OFF'
     A                                      DSPATR(RI)
     A            B1SRYO         7Y 0B 16  8DSPATR(CS)
     A                                      EDTCDE(Z)
     A*                                     CHECK(RB)
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A            B1TANI         1A  B 16 19DSPATR(CS)
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            B1JRHZ         8Y 0B 16 28DSPATR(CS)
     A                                      EDTCDE(Z)
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            B1JRYO         1A  B 16 39DSPATR(CS)
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A            B1SQES         1A  B 16 49
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A            B1SEHZ         8Y 0B 16 55DSPATR(CS) EDTCDE(Z)
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A            B1KSYU         1A  B 16 71
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A                                 18  6'MONTHLY'
     A                                      DSPATR(RI)
     A                                 19  6'HANDLING .MM'
     A                                      DSPATR(RI)
     A                                 18 20'CARRY OVER'
     A                                      DSPATR(RI)
     A                                 19 23'INST'
     A                                      DSPATR(RI)
     A                                 18 35'CHG'
     A                                      DSPATR(RI)
     A                                 19 35'REASON'
     A                                      DSPATR(RI)
     A                                 18 48'ID NO'
     A                                      DSPATR(RI)
     A                                 18 55'CARD'
     A                                      DSPATR(RI)
     A                                 18 71'PRINT'
     A                                      DSPATR(RI)
     A                                 19 71'INST'
     A                                      DSPATR(RI)
     A            B1GEMM         2Y 0B 20  8EDTCDE(Z)
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(PC)
     A            B1KRKS         1Y 0B 20 25EDTCDE(Z)
     A  27                                  DSPATR(PR)
     A  63                                  DSPATR(CS)
     A            B1RYU1         1A  B 20 37DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A            B1SBAN         4A  B 20 48DSPATR(CS)
     A*                                     CHECK(RZ)
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(PC)
     A            B1CARD         4A  B 20 55DSPATR(CS)
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(PC)
     A            B1RYU2         1A  O 20 72
     A  99        B1EROR         5A  O 22  8DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        B1MSG         65A  O 22 16
     A                                 24  2'RETURN TO KEY INPUT'
     A                                 24 22'CMD-3'
     A                                      DSPATR(RI)
