     A** KCLPW02 *****************************************
     A*...INQUIRY  OF LIMITATION  TRIAL MFG. PART PROD     ORDER SITUATION
     A*         A-IDOTA                   87.07.09       *
     A***************************************** KCLPW02 **
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A*---------------------------*
     A* ... SCREEN-1 ...          *
     A*---------------------------*
     A          R KCLPW021
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT KCLPW02'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 17'LIMITATION / TRIAL MFG PROD ORDER -
     A                                      STATUS INQUIRY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  6  9'1 INPUT PART NUMBER. --------'
     A            P5HIN1         5A  B  6 45DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  6 51'-'
     A            P5HIN2         5A  B  6 53DSPATR(CS)
     A  01                                  DSPATR(RI)
     A                                  6 59'-'
     A            P5HIN3         2A  B  6 61DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  90                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  90        ERRM          60A  O 22 20
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 61'EXECUTION'
     A                                 24 73'ENTER'
     A                                      DSPATR(RI)
     A*---------------------------*
     A* ... SCREEN-2 ...          *
     A*---------------------------*
     A          R KCLPW022
     A                                      CF03
     A                                      ROLLUP(50 'ROLL UP')
     A                                      ROLLDOWN(55 'ROLL DOWN')
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT KCLPW02'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 16'LIMITATION / TRIAL  MFG PROD ORDER-
     A                                       STATUS INQUIRY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A  95                              3  6'UNDELIVERED'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A                                  3 19'PART NO'
     A            HNBAN         14A  O  3 27
     A                                  3 48'PROD ORDER INST'
     A            @TEHI          1A  O  3 65
     A                                  3 67'-'
     A            @THNM          6A  O  3 69
     A                                  5  3'NO PROD ODR NO  RCV CO.'
     A                                  5 33'FACTORY RCV DELV DATE'
     A                                  6 46'(USER )'
     A                                  5 57'DELV'
     A                                  6 56'(NUMBER)'
     A                                  5 69'K PUBLISH'
     A                                  6 68'PUBLIC DATE'
     A                                  7  4'1'
     A                                  8  4'2'
     A                                  9  4'3'
     A                                 10  4'4'
     A                                 11  4'5'
     A                                 12  4'6'
     A                                 13  4'7'
     A                                 14  4'8'
     A                                 15  4'9'
     A                                 16  3'10'
     A                                 17  3'11'
     A                                 18  3'12'
     A                                 19  3'13'
     A                                 20  4'|---------------->'
     A            NO             2Y 0B 20 23DSPATR(CS)
     A                                      EDTCDE(Z)
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A                                 20 26'INPUT NO.'
     A            THNO1          7A  O  7  9
     A  20                                  DSPATR(RI)
     A  20                                  DSPATR(BL)
     A            THNO2          7A  O  8  9
     A  21                                  DSPATR(RI)
     A  21                                  DSPATR(BL)
     A            THNO3          7A  O  9  9
     A  22                                  DSPATR(RI)
     A  22                                  DSPATR(BL)
     A            THNO4          7A  O 10  9
     A  23                                  DSPATR(RI)
     A  23                                  DSPATR(BL)
     A            THNO5          7A  O 11  9
     A  24                                  DSPATR(RI)
     A  24                                  DSPATR(BL)
     A            THNO6          7A  O 12  9
     A  25                                  DSPATR(RI)
     A  25                                  DSPATR(BL)
     A            THNO7          7A  O 13  9
     A  26                                  DSPATR(RI)
     A  26                                  DSPATR(BL)
     A            THNO8          7A  O 14  9
     A  27                                  DSPATR(RI)
     A  27                                  DSPATR(BL)
     A            THNO9          7A  O 15  9
     A  28                                  DSPATR(RI)
     A  28                                  DSPATR(BL)
     A            THNOA          7A  O 16  9
     A  29                                  DSPATR(RI)
     A  29                                  DSPATR(BL)
     A            THNOB          7A  O 17  9
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(BL)
     A            THNOC          7A  O 18  9
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(BL)
     A            THNOD          7A  O 19  9
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(BL)
     A            NSKI1         15A  O  7 18
     A            NSKI2         15A  O  8 18
     A            NSKI3         15A  O  9 18
     A            NSKI4         15A  O 10 18
     A            NSKI5         15A  O 11 18
     A            NSKI6         15A  O 12 18
     A            NSKI7         15A  O 13 18
     A            NSKI8         15A  O 14 18
     A            NSKI9         15A  O 15 18
     A            NSKIA         15A  O 16 18
     A            NSKIB         15A  O 17 18
     A            NSKIC         15A  O 18 18
     A            NSKID         15A  O 19 18
     A            KOJ1           1A  O  7 35
     A            KOJ2           1A  O  8 35
     A            KOJ3           1A  O  9 35
     A            KOJ4           1A  O 10 35
     A            KOJ5           1A  O 11 35
     A            KOJ6           1A  O 12 35
     A            KOJ7           1A  O 13 35
     A            KOJ8           1A  O 14 35
     A            KOJ9           1A  O 15 35
     A            KOJA           1A  O 16 35
     A            KOJB           1A  O 17 35
     A            KOJC           1A  O 18 35
     A            KOJD           1A  O 19 35
     A            UKE1           4A  O  7 39
     A            UKE2           4A  O  8 39
     A            UKE3           4A  O  9 39
     A            UKE4           4A  O 10 39
     A            UKE5           4A  O 11 39
     A            UKE6           4A  O 12 39
     A            UKE7           4A  O 13 39
     A            UKE8           4A  O 14 39
     A            UKE9           4A  O 15 39
     A            UKEA           4A  O 16 39
     A            UKEB           4A  O 17 39
     A            UKEC           4A  O 18 39
     A            UKED           4A  O 19 39
     A            NUKI1          6Y 0O  7 45EDTWRD('  .  .  ')
     A            NUKI2          6Y 0O  8 45EDTWRD('  .  .  ')
     A            NUKI3          6Y 0O  9 45EDTWRD('  .  .  ')
     A            NUKI4          6Y 0O 10 45EDTWRD('  .  .  ')
     A            NUKI5          6Y 0O 11 45EDTWRD('  .  .  ')
     A            NUKI6          6Y 0O 12 45EDTWRD('  .  .  ')
     A            NUKI7          6Y 0O 13 45EDTWRD('  .  .  ')
     A            NUKI8          6Y 0O 14 45EDTWRD('  .  .  ')
     A            NUKI9          6Y 0O 15 45EDTWRD('  .  .  ')
     A            NUKIA          6Y 0O 16 45EDTWRD('  .  .  ')
     A            NUKIB          6Y 0O 17 45EDTWRD('  .  .  ')
     A            NUKIC          6Y 0O 18 45EDTWRD('  .  .  ')
     A            NUKID          6Y 0O 19 45EDTWRD('  .  .  ')
     A            NUSU1          7Y 0O  7 55EDTWRD(' ,   ,   ')
     A            NUSU2          7Y 0O  8 55EDTWRD(' ,   ,   ')
     A            NUSU3          7Y 0O  9 55EDTWRD(' ,   ,   ')
     A            NUSU4          7Y 0O 10 55EDTWRD(' ,   ,   ')
     A            NUSU5          7Y 0O 11 55EDTWRD(' ,   ,   ')
     A            NUSU6          7Y 0O 12 55EDTWRD(' ,   ,   ')
     A            NUSU7          7Y 0O 13 55EDTWRD(' ,   ,   ')
     A            NUSU8          7Y 0O 14 55EDTWRD(' ,   ,   ')
     A            NUSU9          7Y 0O 15 55EDTWRD(' ,   ,   ')
     A            NUSUA          7Y 0O 16 55EDTWRD(' ,   ,   ')
     A            NUSUB          7Y 0O 17 55EDTWRD(' ,   ,   ')
     A            NUSUC          7Y 0O 18 55EDTWRD(' ,   ,   ')
     A            NUSUD          7Y 0O 19 55EDTWRD(' ,   ,   ')
     A            HKHI1          6Y 0O  7 69EDTWRD('  .  .  ')
     A            HKHI2          6Y 0O  8 69EDTWRD('  .  .  ')
     A            HKHI3          6Y 0O  9 69EDTWRD('  .  .  ')
     A            HKHI4          6Y 0O 10 69EDTWRD('  .  .  ')
     A            HKHI5          6Y 0O 11 69EDTWRD('  .  .  ')
     A            HKHI6          6Y 0O 12 69EDTWRD('  .  .  ')
     A            HKHI7          6Y 0O 13 69EDTWRD('  .  .  ')
     A            HKHI8          6Y 0O 14 69EDTWRD('  .  .  ')
     A            HKHI9          6Y 0O 15 69EDTWRD('  .  .  ')
     A            HKHIA          6Y 0O 16 69EDTWRD('  .  .  ')
     A            HKHIB          6Y 0O 17 69EDTWRD('  .  .  ')
     A            HKHIC          6Y 0O 18 69EDTWRD('  .  .  ')
     A            HKHID          6Y 0O 19 69EDTWRD('  .  .  ')
     A  90                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  90        ERR           60A  O 22 20
     A                                 24  2'PRV SCREEN'
     A                                 24 13'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 19' NEXT SCREEN'
     A                                 24 32'ROLL-UP'
     A                                      DSPATR(RI)
     A                                 24 40'PRV DETAILS'
     A                                 24 52'ROLL-DOWN'
     A                                      DSPATR(RI)
     A                                 24 62'EXECUTION'
     A                                 24 72'ENTER'
     A                                      DSPATR(RI)
     A*---------------------------*
     A* ... SCREEN-3 ...          *
     A*---------------------------*
     A          R KCLPW023
     A                                      CF01
     A                                      CF03
     A                                  1  2'PROD ODR NO'
     A            PTHAI          7A  O  1 14
     A                                  1 26'LIMITATION / TRIAL MFG PROD ORDER -
     A                                      STATUS'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 70'FMT KCLPW02'
     A                                  2  2'PART NO'
     A            HNBAN         14A  O  2 13
     A                                  2 30'PROD ODR INST'
     A            @TEHI          1A  O  2 44
     A                                  2 46'-'
     A            @THNM          6A  O  2 48
     A                                  3  2'USER P/N'
     A            UHINB         23A  O  3 11
     A                                  4  2'LOC CODE'
     A            BANC           9A  O  4 13
     A                                  2 58'PUBLIC DAY'
     A            PPHYMD         6S 0O  2 69
     A            P5HTIM         4S 0O  2 76
     A                                  5  2'A. RECEIPT INFORMATION'
     A                                      DSPATR(RI)
     A                                  6  2'CUSTOMER'
     A            P5TOKU         4S 0O  6 11
     A            P5TMEI        15A  O  6 17
     A                                  7  2'RCV CO.'
     A            P5NONY         4S 0O  7 11
     A            P5NMEI        15A  O  7 17
     A                                  8  2'FACTORY'
     A            P5NKOJ         1A  O  8 10
     A                                  8 14'RCV'
     A            P5NUKE         4A  O  8 21
     A                                  9  2'U DELV DATE'
     A            PPNHZK         6Y 0O  9 16EDTCDE(Y)
     A                                 10  2'PROD ODR DATE'
     A            PPTHZK         6Y 0O 10 16EDTCDE(Y)
     A                                  9 25'AMOUNT'
     A            P5SRYO         7Y 0O 10 25EDTCDE(2)
     A                                 12  2'B. PRODUCTION INFORMATION'
     A                                      DSPATR(RI)
     A                                 13  2'ACCOM QTY'
     A            P5SYUY         5Y 0O 13 12EDTCDE(2)
     A                                 13 19'PLATING'
     A            P5METK         7A  O 13 27
     A                                 14  2'MATERIAL'
     A            P5ZMEI        15A  O 14 11
     A                                 15  2'K WIRE'
     A            P5KZAI         5Y 2O 15 11EDTWRD('   .  ')
     A                                 15 18'SHEETS'
     A            P5MAIS         3Y 0O 15 25EDTCDE(Z)
     A                                 16  2'PRODUCTION NBR'
     A            P5THSU         7Y 0O 16 17EDTCDE(2)
     A                                 17  2'MTRL ARV DUE DATE'
     A            PPZHIZ         6Y 0O 17 21EDTWRD('  .  .  ')
     A                                 18  2'WSHER ARV DUE DATE'
     A            PPWHIZ         6Y 0O 18 21EDTWRD('  .  .  ')
     A                                 19  2'DIE ARV DUE DATE'
     A            PPKHIZ         6Y 0O 19 21EDTWRD('  .  .  ')
     A                                 15 30'PROD'
     A                                 16 29'ORDER'
     A            KTHI1          4A  O 17 30
     A            KTHI2          4A  O 18 30
     A            KTHI3          4A  O 19 30
     A                                 20  2'REMARKS'
     A            P5VIKO        30A  O 20 13
     A            P5VIK1        30A  O 21  5
     A                                  3 35'NO'
     A                                      DSPATR(UL)
     A                                  5 35' 1'
     A                                      DSPATR(RI)
     A                                  6 35' 2'
     A                                      DSPATR(RI)
     A                                  7 35' 3'
     A                                      DSPATR(RI)
     A                                  8 35' 4'
     A                                      DSPATR(RI)
     A                                  9 35' 5'
     A                                      DSPATR(RI)
     A                                 10 35' 6'
     A                                      DSPATR(RI)
     A                                 11 35' 7'
     A                                      DSPATR(RI)
     A                                 12 35' 8'
     A                                      DSPATR(RI)
     A                                 13 35' 9'
     A                                      DSPATR(RI)
     A                                 14 35'10'
     A                                      DSPATR(RI)
     A                                 15 35'11'
     A                                      DSPATR(RI)
     A                                 16 35'12'
     A                                      DSPATR(RI)
     A                                 17 35'13'
     A                                      DSPATR(RI)
     A                                 18 35'14'
     A                                      DSPATR(RI)
     A                                 19 35'15'
     A                                      DSPATR(RI)
     A                                  3 38'PROC FACTORY NAME DIE NO DELV DATE-
     A                                         BIN  '
     A                                      DSPATR(UL)
     A            P5KTE1         3A  O  5 39
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(BL)
     A            P5KTE2         3A  O  6 39
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(BL)
     A            P5KTE3         3A  O  7 39
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(BL)
     A            P5KTE4         3A  O  8 39
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(BL)
     A            P5KTE5         3A  O  9 39
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(BL)
     A            P5KTE6         3A  O 10 39
     A  38                                  DSPATR(RI)
     A  38                                  DSPATR(BL)
     A            P5KTE7         3A  O 11 39
     A  39                                  DSPATR(RI)
     A  39                                  DSPATR(BL)
     A            P5KTE8         3A  O 12 39
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(BL)
     A            P5KTE9         3A  O 13 39
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(BL)
     A            P5KTEA         3A  O 14 39
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(BL)
     A            P5KTEB         3A  O 15 39
     A  43                                  DSPATR(RI)
     A  43                                  DSPATR(BL)
     A            P5KTEC         3A  O 16 39
     A  44                                  DSPATR(RI)
     A  44                                  DSPATR(BL)
     A            P5KTED         3A  O 17 39
     A  45                                  DSPATR(RI)
     A  45                                  DSPATR(BL)
     A            P5KTEE         3A  O 18 39
     A  46                                  DSPATR(RI)
     A  46                                  DSPATR(BL)
     A            P5KTEF         3A  O 19 39
     A  47                                  DSPATR(RI)
     A  47                                  DSPATR(BL)
     A            KMEI1         14A  O  5 43
     A  48                                  DSPATR(RI)
     A  48                                  DSPATR(BL)
     A            KMEI2         14A  O  6 43
     A  49                                  DSPATR(RI)
     A  49                                  DSPATR(BL)
     A            KMEI3         14A  O  7 43
     A  50                                  DSPATR(RI)
     A  50                                  DSPATR(BL)
     A            KMEI4         14A  O  8 43
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(BL)
     A            KMEI5         14A  O  9 43
     A  52                                  DSPATR(RI)
     A  52                                  DSPATR(BL)
     A            KMEI6         14A  O 10 43
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(BL)
     A            KMEI7         14A  O 11 43
     A  54                                  DSPATR(RI)
     A  54                                  DSPATR(BL)
     A            KMEI8         14A  O 12 43
     A  55                                  DSPATR(RI)
     A  55                                  DSPATR(BL)
     A            KMEI9         14A  O 13 43
     A  56                                  DSPATR(RI)
     A  56                                  DSPATR(BL)
     A            KMEIA         14A  O 14 43
     A  57                                  DSPATR(RI)
     A  57                                  DSPATR(BL)
     A            KMEIB         14A  O 15 43
     A  58                                  DSPATR(RI)
     A  58                                  DSPATR(BL)
     A            KMEIC         14A  O 16 43
     A  59                                  DSPATR(RI)
     A  59                                  DSPATR(BL)
     A            KMEID         14A  O 17 43
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(BL)
     A            KMEIE         14A  O 18 43
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(BL)
     A            KMEIF         14A  O 19 43
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(BL)
     A            P4KAT1         7A  O  5 58
     A            P4KAT2         7A  O  6 58
     A            P4KAT3         7A  O  7 58
     A            P4KAT4         7A  O  8 58
     A            P4KAT5         7A  O  9 58
     A            P4KAT6         7A  O 10 58
     A            P4KAT7         7A  O 11 58
     A            P4KAT8         7A  O 12 58
     A            P4KAT9         7A  O 13 58
     A            P4KATA         7A  O 14 58
     A            P4KATB         7A  O 15 58
     A            P4KATC         7A  O 16 58
     A            P4KATD         7A  O 17 58
     A            P4KATE         7A  O 18 58
     A            P4KATF         7A  O 19 58
     A            P5MD01         4Y 0O  5 67EDTCDE(Z)
     A            P5MD02         4Y 0O  6 67EDTCDE(Z)
     A            P5MD03         4Y 0O  7 67EDTCDE(Z)
     A            P5MD04         4Y 0O  8 67EDTCDE(Z)
     A            P5MD05         4Y 0O  9 67EDTCDE(Z)
     A            P5MD06         4Y 0O 10 67EDTCDE(Z)
     A            P5MD07         4Y 0O 11 67EDTCDE(Z)
     A            P5MD08         4Y 0O 12 67EDTCDE(Z)
     A            P5MD09         4Y 0O 13 67EDTCDE(Z)
     A            P5MD10         4Y 0O 14 67EDTCDE(Z)
     A            P5MD11         4Y 0O 15 67EDTCDE(Z)
     A            P5MD12         4Y 0O 16 67EDTCDE(Z)
     A            P5MD13         4Y 0O 17 67EDTCDE(Z)
     A            P5MD14         4Y 0O 18 67EDTCDE(Z)
     A            P5MD15         4Y 0O 19 67EDTCDE(Z)
     A            NOUHI1         6Y 0O  5 72EDTWRD('  .  -  ')
     A            NOUHI2         6Y 0O  6 72EDTWRD('  .  -  ')
     A            NOUHI3         6Y 0O  7 72EDTWRD('  .  -  ')
     A            NOUHI4         6Y 0O  8 72EDTWRD('  .  -  ')
     A            NOUHI5         6Y 0O  9 72EDTWRD('  .  -  ')
     A            NOUHI6         6Y 0O 10 72EDTWRD('  .  -  ')
     A            NOUHI7         6Y 0O 11 72EDTWRD('  .  -  ')
     A            NOUHI8         6Y 0O 12 72EDTWRD('  .  -  ')
     A            NOUHI9         6Y 0O 13 72EDTWRD('  .  -  ')
     A            NOUHIA         6Y 0O 14 72EDTWRD('  .  -  ')
     A            NOUHIB         6Y 0O 15 72EDTWRD('  .  -  ')
     A            NOUHIC         6Y 0O 16 72EDTWRD('  .  -  ')
     A            NOUHID         6Y 0O 17 72EDTWRD('  .  -  ')
     A            NOUHIE         6Y 0O 18 72EDTWRD('  .  -  ')
     A            NOUHIF         6Y 0O 19 72EDTWRD('  .  -  ')
     A                                 20 53'PLATING ORDER DATE'
     A            PPMHAT         6Y 0O 20 72EDTWRD('  .  -  ')
     A                                 21 39'INCOM DATE'
     A            PPNYMD         6Y 0O 21 50EDTWRD('  .  .  ')
     A                                 21 61'OUTGO DATE'
     A            PPYHIZ         6Y 0O 21 72EDTWRD('  .  .  ')
     A  90                             22 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  90        ERR3          60A  O 22 20
     A                                 24  7'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 26'PREVIOUS SCREEN'
     A                                 24 44'CMD-3'
     A                                      DSPATR(RI)
