     A*%%TS  SD  20160518  131546  I0777       REL-V7R1M0  5770-WDS
     A********************************************
     A* LOCATION SIGN ISSUE BY ALL ITEMS INPUT
     A* FILE ID. : KFAPW20. <DSPF> *
     A* CREATE DATE. :                           *
     A*                                          *
     A* TCHK1 10/15/09 CHG H@COLR LENGTH 2 --> 3 *
     A********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R DSP01
     A*%%TS  SD  20160518  131546  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT('SCREEN 1')
     A                                      CF01
     A                                      CF05
     A                                      OVERLAY
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'* ISSUE LOCATION SIGN *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            #PGM           8A  O  1 72
     A                                  4 20'LOCATION CODE'
     A                                      DSPATR(RI)
     A            BAN1           1A  B  6 19DSPATR(CS)
     A  01                                  DSPATR(PC)
     A  01                                  DSPATR(RI)
     A                                  6 21'-'
     A            BAN2           2A  B  6 23DSPATR(CS)
     A  01                                  DSPATR(RI)
     A                                  6 26'-'
     A            BAN3           2A  B  6 28DSPATR(CS)
     A  01                                  DSPATR(RI)
     A                                  6 31'-'
     A            BAN4           1A  B  6 33DSPATR(CS)
     A  01                                  DSPATR(RI)
     A                                  8 20'# OF SHEETS'
     A                                      DSPATR(RI)
     A            D@SHTS         2Y 0B 10 25EDTCDE(4)
     A                                      DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  6 37'To'
     A                                      DSPATR(RI)
     A            BAN21          1A  B  6 41DSPATR(CS)
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A                                  6 43'-'
     A            BAN22          2A  B  6 45DSPATR(CS)
     A  03                                  DSPATR(RI)
     A                                  6 48'-'
     A            BAN23          2A  B  6 50DSPATR(CS)
     A  03                                  DSPATR(RI)
     A                                  6 53'-'
     A            BAN24          1A  B  6 55DSPATR(CS)
     A  03                                  DSPATR(RI)
     A                                  8 36'WITH BARCODE'
     A                                      DSPATR(RI)
     A            BARCOD         1A  B 10 40DSPATR(CS)
     A  04                                  DSPATR(RI)
     A  04                                  DSPATR(PC)
     A                                 10 44'BLANK=YES   N=WITHOUT BARCODE'
      *-----------------------------------------------------
     A          R DSP99
     A            ERR           60A  O 23 18
     A  99                                  DSPATR(HI)
     A            D@CMD         78     24  3
     A*-----------------------------------------------
     A          R SFL01                     SFL
     A*%%TS  SD  20020918  080542  TEST        REL-V4R4M0  5769-PW1
     A            S@PRT1         5A  O  9 12
     A            S@PRT2         5A  O  9 18
     A            S@PRT3         2A  O  9 24
     A            S@MCN1         3A  B  9 27DSPATR(CS)
     A            S@MCN2         3A  B  9 31DSPATR(CS)
     A            S@MCN3         3A  B  9 35DSPATR(CS)
     A            S@LOC1         1A  O  9  2
     A            S@LOC2         2A  O  9  4
     A            S@LOC3         2A  O  9  7
     A            S@LOC4         1A  O  9 10
     A            H@ZETI         4A  H
TCHK1A*           H@COLR         2   H
TCHK1A            H@COLR         3   H
     A          R CTL01                     SFLCTL(SFL01)
     A*%%TS  SD  20020918  080542  TEST        REL-V4R4M0  5769-PW1
     A  *DS3                                SFLLIN(0004)
     A                                      SFLSIZ(0027)
     A                                      SFLPAG(0026)
     A                                      OVERLAY
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                      CF10
     A  52                                  SFLDSP
     A  52                                  SFLDSPCTL
     A  51                                  SFLCLR
     A            #RCNO          4S 0H      SFLRCDNBR
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 26'* ISSUE LOCATION SIGN *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A            #PGM           8A  O  1 72
     A                                  4  3'LOCATION CODE'
     A                                      DSPATR(RI)
     A            BAN1           1A  O  4 17
     A                                  4 19'-'
     A            BAN2           2A  O  4 21
     A                                  4 24'-'
     A            BAN3           2A  O  4 26
     A                                  4 29'-'
     A            BAN4           1A  O  4 31
     A                                  6  3'# OF SHEETS'
     A                                      DSPATR(RI)
     A            D@SHTS         2Y 0O  6 17EDTCDE(4)
     A                                  8 12'PART#'
     A                                      DSPATR(RI)
     A                                  8 27'MCN/ETC.'
     A                                      DSPATR(RI)
     A                                  8 53'PART#'
     A                                      DSPATR(RI)
     A                                  8 68'MCN/ETC.'
     A                                      DSPATR(RI)
     A                                  4 34'To'
     A                                      DSPATR(RI)
     A            BAN21          1A  O  4 38
     A                                  4 40'-'
     A            BAN22          2A  O  4 42
     A                                  4 45'-'
     A            BAN23          2A  O  4 47
     A                                  4 50'-'
     A            BAN24          1A  O  4 52
     A                                  8  2'LOCATION' DSPATR(RI)
     A                                  8 42'LOCATION' DSPATR(RI)
