     A*%%TS  SD  20170412  172841  I0777       REL-V7R1M0  5770-WDS
     A** MBDPW31 ***************************************
     A* CREATE CSV FILE FOR PAST N MONTH NO RESULT LIST*
     A* J.WATANABE 2/10/2016                           *
     A**************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A*
     A          R MBDPW311
     A*%%TS  SD  20170412  172841  I0777       REL-V7R1M0  5770-WDS
     A                                      TEXT('NO  RESULTS  PART NUMBER LIST-
     A                                      ')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                      BLINK
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 23'** PAST X MONTH NO RESULT LIST **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'MBDPW31'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  7 11'ENTER PAST MONTH:'
     A            XMONTH         2Y 0B  7 30EDTCDE(Z)
     A                                      DSPATR(UL)
     A                                  7 34'MONTHS (1 - 99)'
     A                                      COLOR(YLW)
     A                                 12 11'REPORT WILL BE SENT TO THE FOLLOWI-
     A                                      NG PATH...'
     A                                      COLOR(YLW)
     A                                 14 11'DEPT:SALES(L:)'
     A                                      COLOR(PNK)
     A                                 14 26'\\IAF-AS400-FILE\AS400-TRANS\Sales-
     A                                      \Download\'
     A                                      DSPATR(HI)
     A                                 15 26'*USER ID*\PAST NO RESULT LIST.csv'
     A                                      DSPATR(HI)
     A                                 17 11'DEPT:PC...(J:)'
     A                                      COLOR(PNK)
     A                                 17 26'\\IAF-AS400-FILE\AS400-TRANS\PC\Do-
     A                                      wnload\'
     A                                      DSPATR(HI)
     A                                 18 26'*USER ID*\PAST NO RESULT LIST.csv'
     A                                      DSPATR(HI)
     A  85                             20 10'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  85        XMSG          60A  O 20 16
     A                                 24 10'CMD1:'
     A                                      DSPATR(RI)
     A                                 24 16'EXIT'
     A                                 24 24'CMD5:'
     A                                      DSPATR(RI)
     A                                 24 30'CREATE CSV FILE'
