     A* MBDPW66 **********************************
     A*納入統計データよりパワープレイデータ作成*
     A*  C:N.HAYAKAWA       2000.8.30            *
     A********************************************
     A                                      PRINT
     A          R MBDPW661                  CF01(01) CF05(05)
     A  99                                  ALARM
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'納入統計よりパワープ+
     A                                      レイデータ作成'
     A                                      DSPATR(RI)
     A                                  1 68'FMT MBDPW661'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
     A*
     A                                  5  5'現在の納入統計データで+
     A                                      本日より過去６ヶ月+
     A                                      として作成します。'
     A                                  6 20'    納入統計Ｆ作成日＝'
     A            CRTHZ          8A  O  6 45
     A*
     A                                  7 20'今回作成するデータ名＝'
     A            FILE           9A  O  7 45
     A*
     A            TVTOK1         4A  B 10 21
     A                                      DSPATR(CS)
     A  99                                  DSPATR(RI PC)
     A            TVTOK2         4A  B 11 21
     A                                      DSPATR(CS)
     A  99                                  DSPATR(RI PC)
     A            TVTOK3         4A  B 12 21
     A                                      DSPATR(CS)
     A  99                                  DSPATR(RI PC)
     A            TVTOK4         4A  B 13 21
     A                                      DSPATR(CS)
     A  99                                  DSPATR(RI PC)
     A            TVTOK5         4A  B 14 21
     A                                      DSPATR(CS)
     A  99                                  DSPATR(RI PC)
     A                                 10 26'<==データ作成する得意先+
     A                                      を入力しなさい'
     A                                 11 29'・得意先は４桁で入力+
     A                                      して下さい。'
     A                                 12 29'・最大５得意先まで+
     A                                      入力可能です。'
     A                                 18 20'『９９９９』を入力した+
     A                                      場合は全得意先が対象です'
      *
     A  99                             22 11' d[- '
     A                                      DSPATR(BL RI)
     A  99                             22 18'得意先を正しく入力+
     A                                      して下さい。'
     A                                 24  2' 終　了 '
     A                                 24 13' CMD-1 ' DSPATR(RI)
     A                                 24 22'処理ＯＫ'
     A                                 24 33' CMD-5 ' DSPATR(RI)
