     A*%%TS  SD  20171108  160428  I0777       REL-V7R1M0  5770-WDS
     A***MBDPW82******************************************************
     A*  PRINT KAIZEN SHEET                                          *
     A*  J.WATANABE   2017.11.07                                     *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R DSP01
     A*%%TS  SD  20171108  160428  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                  1  2'MBDPW82'
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2  2USER
     A                                  2 24' ** PRINT KAIZEN SHEET ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2 70TIME
     A                                  7 10'Enter Customer Group:'
     A            XGRP           3A  B  7 32DSPATR(UL)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  7 40'(HND, TYT, FRD, etc..)'
     A                                      COLOR(YLW)
     A            XGNAM         10A  O  8 32COLOR(WHT)
     A                                 10 16'Ship Month....:'
     A            XDATE1         6Y 0B 10 32EDTWRD('    /  ')
     A                                      DSPATR(UL)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                 10 40'(YYYYMM)'
     A                                      COLOR(YLW)
     A            XMSG          77A  O 22  3DSPATR(HI)
     A                                 24 10'F1:'
     A                                      DSPATR(RI)
     A                                 24 14'Exit'
     A                                 24 22'F5:'
     A                                      DSPATR(RI)
     A                                 24 26'Print'
     A                                 24 34'F12:'
     A                                      DSPATR(RI)
     A                                 24 39'Customer Group Inq.'
