     A*** MBEPW90 *************************************
     A*     納入先・工場指定　品番工程リスト        *
     A*         H.ITO           1994.11.17            *
     A************************************* MBEPW85 ***
     A                                      PRINT
     A                                      CHGINPDFT
     A          R MBEPW901
     A  99                                  ALARM
     A                                      PUTOVR KEEP
     A                                      CF01
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'PRODUCT NUMBER PROCESS LIST +
     A                                       ACCORDING TO USER'
     A                                      DSPATR(UL RI)
     A                                  1 69'FMT MBEPW90'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  /  /  ')
     A*
     A*****                             8 20'納入先コード'
     A                                  8 20'DELIVERY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            INONY          4Y 0B  8 39DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  11                                  DSPATR(RI PC)
     A*
     A*****                            10 20'工場コード'
     A                                 10 20'FACTORY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            INKOJ          1   B 10 39DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  12                                  DSPATR(RI PC)
     A*
     A*****                            12 20'受入'
     A*****                            12 20'DOCK'
     A*****                                 DSPATR(RI)
     A*****                                 DSPATR(UL)
     A*****       INUKE          4   B 12 39DSPATR(CS)
     A*****                                 OVRDTA
     A*****                                 OVRATR
     A* 13                                  DSPATR(RI PC)
     A*
     A                                  8 52'1.' OVRATR
     A N01                                  DSPATR(ND)
     A            NONY01         4Y 0O  8 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N01                                  DSPATR(ND)
     A            NKOJ01         1   O   + 1OVRATR
     A                                      OVRDTA
     A N01                                  DSPATR(ND)
     A*****       NUKE01         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N01                                  DSPATR(ND)
     A            NONM01        16   O   + 1OVRATR
     A                                      OVRDTA
     A N01                                  DSPATR(ND)
     A*
     A                                  9 52'2.' OVRATR
     A N02                                  DSPATR(ND)
     A            NONY02         4Y 0O  9 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N02                                  DSPATR(ND)
     A            NKOJ02         1   O   + 1OVRATR
     A                                      OVRDTA
     A N02                                  DSPATR(ND)
     A*****       NUKE02         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N02                                  DSPATR(ND)
     A            NONM02        16   O   + 1OVRATR
     A                                      OVRDTA
     A N02                                  DSPATR(ND)
     A*
     A                                 10 52'3.' OVRATR
     A N03                                  DSPATR(ND)
     A            NONY03         4Y 0O 10 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N03                                  DSPATR(ND)
     A            NKOJ03         1   O   + 1OVRATR
     A                                      OVRDTA
     A N03                                  DSPATR(ND)
     A*****       NUKE03         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N03                                  DSPATR(ND)
     A            NONM03        16   O   + 1OVRATR
     A                                      OVRDTA
     A N03                                  DSPATR(ND)
     A*
     A                                 11 52'4.' OVRATR
     A N04                                  DSPATR(ND)
     A            NONY04         4Y 0O 11 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N04                                  DSPATR(ND)
     A            NKOJ04         1   O   + 1OVRATR
     A                                      OVRDTA
     A N04                                  DSPATR(ND)
     A*****       NUKE04         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N04                                  DSPATR(ND)
     A            NONM04        16   O   + 1OVRATR
     A                                      OVRDTA
     A N04                                  DSPATR(ND)
     A*
     A                                 12 52'5.' OVRATR
     A N05                                  DSPATR(ND)
     A            NONY05         4Y 0O 12 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N05                                  DSPATR(ND)
     A            NKOJ05         1   O   + 1OVRATR
     A                                      OVRDTA
     A N05                                  DSPATR(ND)
     A*****       NUKE05         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N05                                  DSPATR(ND)
     A            NONM05        16   O   + 1OVRATR
     A                                      OVRDTA
     A N05                                  DSPATR(ND)
     A*
     A                                 13 52'6.' OVRATR
     A N06                                  DSPATR(ND)
     A            NONY06         4Y 0O 13 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N06                                  DSPATR(ND)
     A            NKOJ06         1   O   + 1OVRATR
     A                                      OVRDTA
     A N06                                  DSPATR(ND)
     A*****       NUKE06         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N06                                  DSPATR(ND)
     A            NONM06        16   O   + 1OVRATR
     A                                      OVRDTA
     A N06                                  DSPATR(ND)
     A*
     A                                 14 52'7.' OVRATR
     A N07                                  DSPATR(ND)
     A            NONY07         4Y 0O 14 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N07                                  DSPATR(ND)
     A            NKOJ07         1   O   + 1OVRATR
     A                                      OVRDTA
     A N07                                  DSPATR(ND)
     A*****       NUKE07         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N07                                  DSPATR(ND)
     A            NONM07        16   O   + 1OVRATR
     A                                      OVRDTA
     A N07                                  DSPATR(ND)
     A*
     A                                 15 52'8.' OVRATR
     A N08                                  DSPATR(ND)
     A            NONY08         4Y 0O 15 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N08                                  DSPATR(ND)
     A            NKOJ08         1   O   + 1OVRATR
     A                                      OVRDTA
     A N08                                  DSPATR(ND)
     A*****       NUKE08         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N08                                  DSPATR(ND)
     A            NONM08        16   O   + 1OVRATR
     A                                      OVRDTA
     A N08                                  DSPATR(ND)
     A*
     A                                 16 52'9.' OVRATR
     A N09                                  DSPATR(ND)
     A            NONY09         4Y 0O 16 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N09                                  DSPATR(ND)
     A            NKOJ09         1   O   + 1OVRATR
     A                                      OVRDTA
     A N09                                  DSPATR(ND)
     A*****       NUKE09         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N09                                  DSPATR(ND)
     A            NONM09        16   O   + 1OVRATR
     A                                      OVRDTA
     A N09                                  DSPATR(ND)
     A*
     A                                 17 51'10.' OVRATR
     A N10                                  DSPATR(ND)
     A            NONY10         4Y 0O 17 55EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A N10                                  DSPATR(ND)
     A            NKOJ10         1   O   + 1OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A*****       NUKE10         4   O   + 1OVRATR
     A*****                                 OVRDTA
     A*N10                                  DSPATR(ND)
     A            NONM10        16   O   + 1OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
      *
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            MSG           60   O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 23  4'EXIT'
     A                                 23  9'CMD-1'
     A                                      DSPATR(RI)
     A                                 23 39'DATA INPUT'
     A                                 23 51'CMD-5'
     A                                      DSPATR(RI)
