     A****************************************************************
     A*INPUT SCREEN  OF COMPONENTS TOTALIZATION LIST PARM *
     A*                  A-SENGA         1981.09.23                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT(*LIBL/QPRINT)
     A          R MCEPW111
     A*%%TS  SD  19961118  100134  MIKA        REL-V3R0M5  5763-PW1
     A                                      CF01(01)
     A                                  1 65'FORMAT MCEPW111'
     A                                  4 24'COMPONENTS TOTALIZATION LIST'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A            HIZU           8A  B  9  9DSPATR(CS)
     A                                  9 18'---- INPUT DATA DATE OF COMPONENTS-
     A                                       TOTALIZATION LIST'
     A            JOBQ           1Y 0B 14  9EDTCDE(Z)
     A                                      DSPATR(CS)
     A                                 14 13'--------- SELECT JOB FORM ( 0 JOBQ-
     A                                      -NO . 1 JOBQ1 . 2 JOBQ2 )'
     A  99                             21 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 21 18DSPATR(HI)
     A                                 24  8'INPUT PARM THEN'
     A                                 24 26'ENTER'
     A                                      DSPATR(RI)
     A                                 24 45'JOB CANCEL'
     A                                 24 57'CMD-1'
     A                                      DSPATR(RI)
