     A** MFBPW42 *************************
     A*INPUT & UPDATE OF WORK DAILY BULLETIN DATA  *
     A*               K.YASUDA 93.10.27 *
     A************************* MFBPW42 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*** 1SCREEN
     A          R MFBPW421
     A*%%TS  SD  19961118  103028  MIKA        REL-V3R0M5  5763-PW1
     A                                      CF01(01)
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'* DAILY WORKING REPORT DATA INPUT -
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT MFBPW42'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  9 25'1 INPUT OLD DAILY WORKING REPORT D-
     A                                      ATA'
     A                                 12 25'2 INPUT NEW DAILY WORKING REPORT D-
     A                                      ATA'
     A                                 15 26'NO.'
     A            @NO            1A  B 15 30OVRDTA
     A                                      OVRATR
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A*** 2SCREEN
     A          R MFBPW422
     A*%%TS  SD  19961118  103028  MIKA        REL-V3R0M5  5763-PW1
     A                                      CF01(01)
     A  99                                  ALARM
     A                                      BLINK
     A                                      PUTOVR
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 19'** DAILY WORKING REPORT DATA UPDAT-
     A                                      E ** '
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT MFBPW42'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  9 25'1 OLD DAILY WORKING REPORT DATA UP-
     A                                      DATE'
     A                                 12 25'2 NEW DAILY WORKING REPORT DATA UP-
     A                                      DATE'
     A                                 15 26'NO.'
     A            @NO            1A  B 15 30OVRDTA
     A                                      OVRATR
     A                                      DSPATR(CS)
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
