     A**** MFBPW13 ******************************
     A* *  WORK DAILY BULLETIN DATA TOTALIZATION
     A* *      A.IDOTA         1993.02.01       *
     A******************************** MFBPW13 **
     A*%%EC
     A*                                     DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A************
     A* * SCREEN 1*
     A************
     A          R MFBPW131
     A*%%TS  SD  19961118  110402  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('WORK DAILY BULLETIN')
     A                                      CF01
     A                                      CF05
     A                                      CF12
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  1 16'* DAILY WORKING REPORT DATA TOTALI-
     A                                      ZATION LIST MAKING *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  2 68'FMT MFBPW131'
     A                                  7 28'FACTORY CODE'
     A                                      DSPATR(UL)
     A                                  7 47'TOTALIZED DATE'
     A                                      DSPATR(UL)
     A            @KJY           4A  B  9 32DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A            @HIZ           8A  B  9 50DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                 13 28'CONDITION APPOINTMENT'
     A                                      DSPATR(UL)
     A            @KBN           1A  B 15 33DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 15 40'1 BY COST CENTER'
     A                                 16 40'2 BY SHIFT'
     A                                 17 40'3 BY SECTION / TEAM'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 11'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 20'MAKING OK'
     A                                 24 32'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 41'FACTORY INQUIRY'
     A                                 24 59'CMD-12'
     A                                      DSPATR(RI)
