     A*** MFBPW01 **************************
     A*INPUT SCREEN OF WORK DAILY BULLETIN DATA
     A* A.IDOTA 89.10.23 *
     A*************************** MFBPW01 **
     A*%%EC
     A*                                     DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A************
     A* SCREEN 1*
     A************
     A          R MFBPW011
     A*%%TS  SD  19961118  103923  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('WORK DAILY BULLETIN')
     A                                      CF01
     A                                      CF12
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 24'* DAILY WORKING REPORT DATA INPUT -
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT MFBPW011'
     A                                  5 21'FACTORY CODE'
     A                                      DSPATR(RI)
     A            @KJY           4A  B  8 25DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  01                                  DSPATR(PC)
     A                                  5 40'WORK DATE / NIGHT AND DAY'
     A                                      DSPATR(RI)
     A            @HIZ           8A  B  8 46DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A                                  8 56'-'
     A            @HYC           1A  B  8 59DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A                                 19 23'NIGHT AND DAY INSTRUCTION'
     A                                 20 38'DAY(H) NIGHT(Y)'
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'INPUT EXIT'
     A                                 24 16'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 25'FACTORY INQUIRY'
     A                                 24 42'CMD-12'
     A                                      DSPATR(RI)
     A************
     A* SCREEN 2*
     A************
     A          R MFBPW012
     A*%%TS  SD  19961118  104317  SAWADAK     REL-V3R0M5  5763-PW1
     A                                      TEXT('WORK DAILY BULLETIN')
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 24'* DAILY WORKING REPORT DATA INPUT -
     A                                      *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT MFBPW012'
     A                                  4  1'FACTORY'
     A            @KJY           4A  O  4  9OVRDTA
     A            @KME          12A  O  4 14OVRDTA
     A                                  4 28'WORK DATE'
     A            @HIY           4Y 0O  4 38EDTCDE(Z)
     A                                      OVRDTA
     A                                  4 43'/'
     A            @HIM           2Y 0O  4 45EDTCDE(Z)
     A                                      OVRDTA
     A                                  4 48'/'
     A            @HID           2Y 0O  4 50EDTCDE(Z)
     A                                      OVRDTA
     A            @HYC           1A  O  4 54OVRDTA
     A            @HYK           4A  O  4 56OVRDTA
     A                                  7  2'MACHINE NO'
     A                                      DSPATR(UL)
     A            @KIBN          3A  B  9  3DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A  50                                  DSPATR(PC)
     A                                  9  7'-'
     A            @KIHS          1A  B  9  9DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI)
     A                                  6 16'MACHINE'
     A            KITNSU         6Y 0O  9 14EDTCDE(2)
     A                                      OVRDTA
     A                                  9 22'RPH'
     A                                  7 27'PROCESS'
     A                                      DSPATR(UL)
     A            @KTCD          3A  O  9 29OVRDTA
     A                                  7 36'SECTION TEAM'
     A                                      DSPATR(UL)
     A            @KACD          1A  O  9 40OVRDTA
     A            @RICD          1A  O  9 43OVRDTA
     A                                  7 50'MACHINE GROUP'
     A                                      DSPATR(UL)
     A            @KIGN          3A  O  9 55OVRDTA
     A                                 11  2'STOP ITEM'
     A                                      DSPATR(RI)
     A                                 12  2'SETUP'
     A                                 13  3'TIME'
     A                                 12  8'ADJUSTMENT'
     A                                 13 12'TIME'
     A                                 12 19'WAITING'
     A                                 13 21'TIME'
     A                                 12 27'MATERIALS'
     A                                 13 29'CHANGE'
     A                                 14 30'TIME'
     A                                 12 37'MATERIALS'
     A                                 13 37'WAITING'
     A                                 14 39'TIME'
     A                                 12 47'KANBAN'
     A                                 13 46'WAITING'
     A                                 14 48'TIME'
     A                                 12 57'DIE'
     A                                 13 55'WAITING'
     A                                 14 57'TIME'
     A                                 12 64'TROUBLE'
     A                                 13 66'STOP'
     A                                 14 66'TIME'
     A                                 12 74'SHOT'
     A                                 13 74'STOP'
     A                                 14 71'FREQUENCY'
     A            @DNTI          3Y 0B 15  4DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  02                                  DSPATR(PC)
     A  02                                  DSPATR(RI)
     A            @TYTI          3Y 0B 15 13DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  03                                  DSPATR(PC)
     A  03                                  DSPATR(RI)
     A            @DMTI          3Y 0B 15 22DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  04                                  DSPATR(PC)
     A  04                                  DSPATR(RI)
     A            @ZITI          3Y 0B 15 31DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  05                                  DSPATR(PC)
     A  05                                  DSPATR(RI)
     A            @ZMTI          3Y 0B 15 40DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  06                                  DSPATR(PC)
     A  06                                  DSPATR(RI)
     A            @KNTI          3Y 0B 15 49DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  07                                  DSPATR(PC)
     A  07                                  DSPATR(RI)
     A            @KTTI          3Y 0B 15 58DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  08                                  DSPATR(PC)
     A  08                                  DSPATR(RI)
     A            @KSTI          3Y 0B 15 67DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  09                                  DSPATR(PC)
     A  09                                  DSPATR(RI)
     A            @TSTI          3Y 0B 15 76DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  10                                  DSPATR(PC)
     A  10                                  DSPATR(RI)
     A                                 17  6'FACT VOLUME'
     A                                 18  8'NUMBER'
     A                                 17 21'SET UP'
     A                                 18 20'FREQUENCY'
     A                                 17 33'ACTUAL'
     A                                 18 33'WORKING'
     A                                 19 34'HOURS'
     A                                 17 43'UNINHABITED'
     A                                 18 43'PRODUCTION'
     A                                 19 45'BOXES'
     A                                 17 58'UNINHABITED'
     A                                 18 58'PRODUCTION'
     A                                 19 60'NUMBER'
     A                                 18 71'MULTIPLE'
     A            @DEKI          7Y 0B 20  6DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  11                                  DSPATR(PC)
     A  11                                  DSPATR(RI)
     A            @DNKI          3Y 0B 20 21DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  12                                  DSPATR(PC)
     A  12                                  DSPATR(RI)
     A                                 20 25'TIME'
     A            @KADU          3Y 1B 20 34DSPATR(CS)
     A                                      EDTCDE(2)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  13                                  DSPATR(PC)
     A  13                                  DSPATR(RI)
     A                                 20 39'H'
     A            @MUHK          3Y 0B 20 45DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  14                                  DSPATR(PC)
     A  14                                  DSPATR(RI)
     A                                 20 49'BOXES'
     A            @MUHN          7Y 0B 20 59DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  15                                  DSPATR(PC)
     A  15                                  DSPATR(RI)
     A            @BISU          1Y 0B 20 75DSPATR(CS)
     A                                      EDTCDE(Z)
     A                                      OVRDTA
     A                                      CHECK(RB)
     A                                      OVRATR
     A  16                                  DSPATR(PC)
     A  16                                  DSPATR(RI)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'PREVIOUS SCREEN'
     A                                 24 21'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 30'INPUT OK'
     A                                 24 40'CMD-5'
     A                                      DSPATR(RI)
     A                                 20 14'BOOK'
     A                                  7 14'TURN NUMBER'
     A                                      DSPATR(UL)
