     A*** MFBPW20 **************************
     A* 作業日報　統計ファイル　の　作成 *
     A*      A.IDOTA       1990.02.24      *
     A*************************** MFBPW20 **
     A                                      PRINT
     A                                      CHGINPDFT
     A************
     A* 画面１ *
     A************
     A          R MFBPW201                  TEXT('WORK DAILY REPORT')
     A                                      CF01 CF05
     A                                      BLINK
     A                                      PUTOVR
     A  99                                  ALARM
     A                                      KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME EDTWRD('  :  :  ')
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  .  .  ')
     A                                  1 18'MAKING OF WORK DAILY +
     A                                      REPORT STATISTICS FILE  '
     A                                      DSPATR(RI UL)
     A                                  1 68'FMT MFBPW201'
     A*
     A                                  6 22'FACTORY CODE'
     A            @KJY           4   B  6 37DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(RI PC)
     A                                 10 22' DATA YEARS '
     A            @HIZ           6Y 0B 10 37DSPATR(CS) EDTCDE(Z)
     A                                      OVRDTA
     A                                      OVRATR
     A  02                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                 11 36'(YYYYMM)'
     A                                 14 22'REPROCESSING DIVISION'
     A                                 14 50'0:USUALLY 1:REPROCESSING'
     A                                      DSPATR(UL)
     A            @KBN           1   B 14 45DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  03                                  DSPATR(RI PC)
     A                                 18 22'YEARS WHICH HAVE BEEN PROCESSED'
     A            WHIZK          6Y 0O 18 56EDTWRD('    .  ')
     A                                      OVRATR
     A                                 19 55'(YYYY.MM)'
     A*
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI BL)
     A            MSG           60   O 22 18
     A                                      OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'   END    '
     A                                 24 15' CMD-1 ' DSPATR(RI)
     A                                 24 24'EXECUTION '
     A                                 24 35' CMD-5 ' DSPATR(RI)
