     A** MRAPW02 *******************************************
     A* DETAIL OF NEW PRODUCTION INFORMATION               *
     A*     TRANCOM ITS.                  2012.09.11       *
     A******************************************************
     A                                      PRINT(QPRINT)
     A                                      CHGINPDFT
     A          R MRAPW021
     A                                      CF03(03)
     A                                      CF05(05)
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 22' ** DETAIL OF NEW +
     A                                       PRODUCTION INFO ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT'
     A                                  1 73'MRAPW02'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTCDE(Y)
      *
     A                                  4  2'INHOUSE PART NO=>'
     A            D1SHN         14A      + 1
      *
     A                                   + 2'PART OR COMP=>'
     A            D1SEKB         4A      + 1
     A                                   + 2'LOCATION=>'
     A            D1PRKB        10A      + 1
      *
     A                                  6  4'CUSTOMER PART NUMBER'
     A                                      DSPATR(UL)
     A                                  6 40'CUSTOMER'
     A                                      DSPATR(UL)
     A                                  6 51'CAR CODE'
     A                                      DSPATR(UL)
     A                                  6 61'E.C NO.'
     A                                      DSPATR(UL)
      *
     A            D1MHN1         5A  B  7  5DSPATR(CS)
     A  31                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1MHN2         5A  B   + 1DSPATR(CS)
     A  31                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1MHN3         5A  B   + 1DSPATR(CS)
     A  31                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1MHN4         5A  B   + 1DSPATR(CS)
     A  31                                  DSPATR(PC RI)
      *
     A            D1TMEI         8A  B  7 40DSPATR(CS)
     A  32                                  DSPATR(PC RI)
      *
     A            D1SYKI         4A  B  7 52DSPATR(CS)
     A  33                                  DSPATR(PC RI)
      *
     A            D1SENO        12A  B  7 61DSPATR(CS)
     A  34                                  DSPATR(PC RI)
      *
     A                                 09  4'MASS PRODUCTION DATE'
     A                                      DSPATR(UL)
     A                                 09 29'QUANTITY'
     A                                      DSPATR(UL)
     A                                 09 40'NEED TOOLINGS?'
     A                                      DSPATR(UL)
     A                                 09 61'TOOL ORDER DATE'
     A                                      DSPATR(UL)
      *
     A            D1STYY         4Y 0B 10  5DSPATR(CS) EDTCDE(Z)
     A  35                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1STMM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  36                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1STDD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  37                                  DSPATR(PC RI)
      *
     A            D1SRYO         8Y 0B 10 28DSPATR(CS) EDTWRD('  ,   , 0 ')
     A  38                                  DSPATR(PC RI)
      *
     A            D1KANA         1A  B 10 42DSPATR(CS)
     A  39                                  DSPATR(PC RI)
     A                                   + 1'Y:YES N:NO'
      *
     A            D1PTAY         4Y 0B 10 61DSPATR(CS) EDTCDE(Z)
     A  40                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1PTAM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  41                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1PTAD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  42                                  DSPATR(PC RI)
      *
     A                                 12  4'ORDER START DATE'
     A                                      DSPATR(UL)
     A                                 12 29'COMPLETE PART NUMBER'
     A                                      DSPATR(UL)
     A                                 12 61'TOOL ARRIVAL DATE'
     A                                      DSPATR(UL)
      * ORDER START DATE
     A            D1OSYY         4Y 0B 13  5DSPATR(CS) EDTCDE(Z)
     A  43                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1OSMM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  44                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1OSDD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  45                                  DSPATR(PC RI)
      * COMPLETE PART NO
     A            D1CHN1         5A  B 13 30DSPATR(CS)
     A  46                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1CHN2         5A  B   + 1DSPATR(CS)
     A  46                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1CHN3         2A  B   + 1DSPATR(CS)
     A  46                                  DSPATR(PC RI)
      *
     A            D1TLYY         4Y 0B 13 61DSPATR(CS) EDTCDE(Z)
     A                                   + 1'/'
     A            D1TLMM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A                                   + 1'/'
     A            D1TLDD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
      *
     A                                 15 29'BLANK PART NUMBER'
     A                                      DSPATR(UL)
     A                                 15 61'PILOT INFORMATION'
     A                                      DSPATR(UL)
     A                                 16 29'MASS PRODUCTION DATE'
     A                                      DSPATR(UL)
      *
     A            D1PIYY         4Y 0B 16 61DSPATR(CS) EDTCDE(Z)
     A                                   + 1'/'
     A            D1PIMM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A                                   + 1'/'
     A            D1PIDD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
      * BLANK PART NO
     A            D1BHN1         5A  B 17 29DSPATR(CS)
     A  47                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1BHN2         5A  B   + 1DSPATR(CS)
     A  47                                  DSPATR(PC RI)
     A                                   + 1'-'
     A            D1BHN3         2A  B   + 1DSPATR(CS)
     A  47                                  DSPATR(PC RI)
      *
     A            D1PISR         6Y 0B 18 61DSPATR(CS) EDTCDE(Z)
     A                                   + 1'PCS'
      *
     A                                 19  4' REMARKS '
     A                                      DSPATR(UL)
      *
     A            D1BTYY         4Y 0B 19 29DSPATR(CS) EDTCDE(Z)
     A  48                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1BTMM         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  49                                  DSPATR(PC RI)
     A                                   + 1'/'
     A            D1BTDD         2Y 0B   + 1DSPATR(CS) EDTCDE(Z)
     A  50                                  DSPATR(PC RI)
      *
     A            D1BIKO        72A  B 21  4DSPATR(CS)
      *
     A                                 23  2' ERR '
     A  99                                  DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1ERR         60A  O 23  8
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
      *
     A                                 24  2'BACK'
     A                                   + 1' F3 ' DSPATR(RI)
     A                                   + 2'REGISTRARION'
     A                                   + 1' F5 ' DSPATR(RI)
     A                                   + 2'CHECK'
     A                                   + 1' ENTER ' DSPATR(RI)
