     A*%%TS  SD  20240325  100120  I0777       REL-V7R4M0  5770-WDS
     A*****************************************************************
     A*  プログラム名   : PILOT KANBAN DATA CHANGE                 **
     A*  プログラムＩＤ :  MRHPW32    <DSPF>                       **
     A*  作成年月日     :  2014/02/06.                             **
     A*  作成者         :  TR-ITS                                  **
     A*--------------------------------------------------------------**
     A*  変更年月日     :  9999/99/99.                             **
     A*  変更者         :  XXXXXXXXXX.XXXXXXXXXX                   **
     A*  変更内容       : ＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸＸ **
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT(*LIBL/QPRINT)
     A*==============================================================**
     A*  画面１（ＤＳＰ０１）
     A*==============================================================**
     A*<<キーワード定義>>
     A          R MRHPW321
     A*%%TS  SD  20240325  100120  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01(01 '前画面')
     A                                      OVERLAY
     A                                      RTNCSRLOC(&D1RCD &D1FLD)
     A                                      CSRLOC(D1LIN      D1COL)
     A            D1LIN          3S 0H      TEXT('fｰﾓ制御（行）')
     A            D1COL          3S 0H      TEXT('fｰﾓ制御（桁）')
     A            D1RCD         10A  H      TEXT('ﾛﾃｰnﾞ')
     A            D1FLD         10A  H      TEXT('ﾎｧｰﾓnﾞID')
     A*<<フィールド定義>>
     A*                                 1  2'TIME'
     A                                  1  2TIME
     A                                  1 24'***  CHANGE KANBAN INFORMATION  **-
     A                                      *'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  1 69'FMT MRHPW32'
     A*
     A*                                 2  2'DATE'
     A            D1SYMD         8Y 0O  1 12EDTWRD('0 /  /    ')
     A*<<入出力項目>>
     A                                  5 27'0:DELETE'
     A            D1SELC         1A  B  5 40TEXT('更新区分')
     A                                      DSPATR(CS)
     A  31                                  DSPATR(RI)
     A  31                                  DSPATR(PC)
     A                                  6 27'1:CHANGE'
     A*
     A                                  8 21'INPUT LOT NUMBER :'
     A            D1THI1         4A  B  8 40TEXT('手配番号１')
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A                                  8 45'-'
     A            D1THI2         3A  B  8 47TEXT('手配番号２')
     A                                      DSPATR(CS)
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A*
     A*<<メッセージ>>
     A                                 22 11'ERROR'
     A                                      DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D1EMSG        53O  O 22 18TEXT('d[ｰxｮﾈｰﾆﾞ')
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A*<<ファンクション>>
     A                                 24  9'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 37'NEXT'
     A                                 24 43'CTRL '
     A                                      DSPATR(RI)
     **==============================================================**
     **  画面２（ＤＳＰ０２）
     **==============================================================**
     A          R MRHPW322
     A*<<キーワード定義>>
     A                                      CF03(03 '前画面')
     A                                      CF05(05 '更新')
     A                                      PAGEUP(28)
     A                                      PAGEDOWN(29)
     A                                      OVERLAY
     A                                      PROTECT
     A*<<カーソル制御用>>
     A                                      RTNCSRLOC(&D2RCD  &D2FLD)
     A                                      CSRLOC(D2LIN D2COL)
     A            D2LIN          3S 0H      TEXT('fｰﾓ制御（行）')
     A            D2COL          3S 0H      TEXT('fｰﾓ制御（桁）')
     A            D2RCD         10A  H      TEXT('ﾛﾃｰnﾞ')
     A            D2FLD         10A  H      TEXT('ﾎｧｰﾓnﾞID')
     A*<<フィールド定義>>
     A*                                 1  2'TIME'
     A                                  1  2TIME
     A                                  1 24'***  CHANGE KANBAN +
     A                                       INFORMATION  ***'
     A                                      DSPATR(HI RI)
     A                                  1 69'FMT MRHPW32'
     A*
     A*                                 2  2'DATE'
     A            D2SYMD         8Y 0O  1 12EDTWRD('0 /  /    ')
     A*<<入出力項目>>
     A                                  2  2'DEPARTMENT:'
     A            D2DVKB         1A  B  2 14TEXT('発行部署')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  32                                  DSPATR(RI PC)
     A            D2DVNM         9A  O  2 16TEXT('発行部署名')
     A            D2DPNM        10A  B  2 26TEXT('発行依頼者')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  55                                  DSPATR(RI PC)
     A                                  2 33'LOT #:'
     A            D2THI          8A  O  2 40TEXT('手配番号')
     A                                  2 50'LOCATION:'
     A            D2BNC          9A  O  2 60TEXT('番地')
      *
     A                                  3  2'INHOUSE PART #:'
     A            D2SHN         14A  O  3 18TEXT('社内品番')
     A                                  3 33'CUSTOMER PART #:'
     A            D2MHN1         5A  B  3 50TEXT('ユーザー品番1')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
     A                                  3 56'-'
     A            D2MHN2         5A  B  3 58TEXT('ユーザー品番2')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
     A                                  3 64'-'
     A            D2MHN3         5A  B  3 66TEXT('ユーザー品番3')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
     A                                  3 72'-'
     A            D2MHN4         5A  B  3 74TEXT('ユーザー品番4')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  33                                  DSPATR(RI PC)
      *
     A                                  4  2'CUSTOMER:'
     A            D2TOKU         4Y 0B  4 12TEXT('ユーザーコード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  34                                  DSPATR(RI PC)
     A            D2TKNM        15A  O  4 17TEXT('ユーザー名称')
     A                                  4 33'BLANK PART #   :'
     A            D2BHN1         5A  B  4 50TEXT('ブランク品番1')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  35                                  DSPATR(RI PC)
     A                                  4 56'-'
     A            D2BHN2         5A  B  4 58TEXT('ブランク品番2')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  35                                  DSPATR(RI PC)
     A                                  4 64'-'
     A            D2BHN3         2A  B  4 66TEXT('ブランク品番3')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  35                                  DSPATR(RI PC)
      *
     A                                  5  2'PRODUCTION QTY:'
     A            D2SISU         8Y 0B  5 18TEXT('総生産数量')
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  36                                  DSPATR(RI PC)
     A                                  5 29'DERIVARY QTY:'
     A            D2THSU         7Y 0B  5 43TEXT('手配数量')
     A                                      EDTCDE(1)
     A                                      CHECK(RB)
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  37                                  DSPATR(RI PC)
     A                                  5 53'DELIVERY DATE :'
     A            D2NOHZ         8Y 0B  5 69TEXT('納期')
     A                                      EDTWRD('0    /  /  ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  38                                  DSPATR(RI PC)
      *
     A                                  6  2'PURPOSE:'
     A            D2THMK        50A  B  6 11TEXT('手配目的')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  39                                  DSPATR(RI PC)
      *
     A                                  6 64'INSP DATA:'
     A            D2INSP         1A  B  6 75TEXT('データ要否')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  58                                  DSPATR(RI PC)
     A                                  7  2'DESC.:'
     A            H2VIKO        50A  B    +1TEXT('手配目的')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  39                                  DSPATR(RI PC)
      *   HN LOCATION
     A                                  7 63'HN LOC:'
     A            D2HNL1         1A  B   + 1TEXT('HN LOC1 ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  50                                  DSPATR(RI PC)
     A            D2HNL2         2A  B   + 1TEXT('HN LOC2 ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  50                                  DSPATR(RI PC)
     A            D2HNL3         2A  B   + 1TEXT('HN LOC3 ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  50                                  DSPATR(RI PC)
     A            D2HNL4         1A  B   + 1TEXT('HN LOC4 ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  50                                  DSPATR(RI PC)
      *
     A            D2BRHZ         8Y 0H      TEXT('中止日')
     A            D2BRMK        50A  H      TEXT('中止理由')
      *
     A                                  8 21'MACINE'
     A                                  8 28'BOX'
     A                                  8 36'BOX'
     A                                  8 46'DATE'
      *
     A                                  9  5'PROCESS'
     A                                  9 24'NO'
     A                                  9 28'C'
     A                                  9 30'T'
     A                                  9 32'COLOR'
     A                                  9 38'TYPE'
     A                                  9 44'YY/MM/DD'
     A                                  9 53'DESCRIPTION'
      *<<工程#1>>
     A  81        D2SEQ1         2S 0O 10  1TEXT('行№')
     A  81        D2KTE1         4A  B 10  4TEXT('工程')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 61                            DSPATR(RI PC)
     A  81        D2KBM1         4Y 0B 10  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 62                            DSPATR(RI PC)
     A  81        D2KBN1         8A  O 10 14TEXT('加工工場名')
     A  81        D2MSN1         3A  B 10 23TEXT('機番')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 63                            DSPATR(RI PC)
     A  81        D2BCC1         1A  B 10 27TEXT('箱色')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 64                            DSPATR(RI PC)
     A  81        D2BTC1         1A  B 10 36TEXT('箱種')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 65                            DSPATR(RI PC)
     A  81        D2BCN1         6A  B 10 29TEXT('箱色名称')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 66                            DSPATR(RI PC)
     A  81        D2BTN1         5A  B 10 38TEXT('箱種名称')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 67                            DSPATR(RI PC)
     A  81        D2KNH1         6Y 0B 10 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 68                            DSPATR(RI PC)
     A  81        D2KVI1        27A  B 10 53TEXT('備考')
     A  81 96                               DSPATR(CS)
     A  81N96                               DSPATR(PR)
     A  81 71 69                            DSPATR(RI PC)
      *<<工程#2>>
     A  82        D2SEQ2         2S 0O 11  1TEXT('行№')
     A  82        D2KTE2         4A  B 11  4TEXT('工程')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 61                            DSPATR(RI PC)
     A  82        D2KBM2         4Y 0B 11  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 62                            DSPATR(RI PC)
     A  82        D2KBN2         8A  O 11 14TEXT('加工工場名')
     A  82        D2MSN2         3A  B 11 23TEXT('機番')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 63                            DSPATR(RI PC)
     A  82        D2BCC2         1A  B 11 27TEXT('箱色')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 64                            DSPATR(RI PC)
     A  82        D2BTC2         1A  B 11 36TEXT('箱種')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 65                            DSPATR(RI PC)
     A  82        D2BCN2         6A  B 11 29TEXT('箱色名称')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 66                            DSPATR(RI PC)
     A  82        D2BTN2         5A  B 11 38TEXT('箱種名称')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 67                            DSPATR(RI PC)
     A  82        D2KNH2         6Y 0B 11 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 68                            DSPATR(RI PC)
     A  82        D2KVI2        27A  B 11 53TEXT('備考')
     A  82 96                               DSPATR(CS)
     A  82N96                               DSPATR(PR)
     A  82 72 69                            DSPATR(RI PC)
      *<<工程#3>>
     A  83        D2SEQ3         2S 0O 12  1TEXT('行№')
     A  83        D2KTE3         4A  B 12  4TEXT('工程')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 61                            DSPATR(RI PC)
     A  83        D2KBM3         4Y 0B 12  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 62                            DSPATR(RI PC)
     A  83        D2KBN3         8A  O 12 14TEXT('加工工場名')
     A  83        D2MSN3         3A  B 12 23TEXT('機番')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 63                            DSPATR(RI PC)
     A  83        D2BCC3         1A  B 12 27TEXT('箱色')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 64                            DSPATR(RI PC)
     A  83        D2BTC3         1A  B 12 36TEXT('箱種')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 65                            DSPATR(RI PC)
     A  83        D2BCN3         6A  B 12 29TEXT('箱色名称')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 66                            DSPATR(RI PC)
     A  83        D2BTN3         5A  B 12 38TEXT('箱種名称')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 67                            DSPATR(RI PC)
     A  83        D2KNH3         6Y 0B 12 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 68                            DSPATR(RI PC)
     A  83        D2KVI3        27A  B 12 53TEXT('備考')
     A  83 96                               DSPATR(CS)
     A  83N96                               DSPATR(PR)
     A  83 73 69                            DSPATR(RI PC)
      *<<工程#4>>
     A  84        D2SEQ4         2S 0O 13  1TEXT('行№')
     A  84        D2KTE4         4A  B 13  4TEXT('工程')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 61                            DSPATR(RI PC)
     A  84        D2KBM4         4Y 0B 13  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 62                            DSPATR(RI PC)
     A  84        D2KBN4         8A  O 13 14TEXT('加工工場名')
     A  84        D2MSN4         3A  B 13 23TEXT('機番')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 63                            DSPATR(RI PC)
     A  84        D2BCC4         1A  B 13 27TEXT('箱色')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 64                            DSPATR(RI PC)
     A  84        D2BTC4         1A  B 13 36TEXT('箱種')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 65                            DSPATR(RI PC)
     A  84        D2BCN4         6A  B 13 29TEXT('箱色名称')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 66                            DSPATR(RI PC)
     A  84        D2BTN4         5A  B 13 38TEXT('箱種名称')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 67                            DSPATR(RI PC)
     A  84        D2KNH4         6Y 0B 13 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 68                            DSPATR(RI PC)
     A  84        D2KVI4        27A  B 13 53TEXT('備考')
     A  84 96                               DSPATR(CS)
     A  84N96                               DSPATR(PR)
     A  84 74 69                            DSPATR(RI PC)
      *<<工程#5>>
     A  85        D2SEQ5         2S 0O 14  1TEXT('行№')
     A  85        D2KTE5         4A  B 14  4TEXT('工程')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 61                            DSPATR(RI PC)
     A  85        D2KBM5         4Y 0B 14  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 62                            DSPATR(RI PC)
     A  85        D2KBN5         8A  O 14 14TEXT('加工工場名')
     A  85        D2MSN5         3A  B 14 23TEXT('機番')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 63                            DSPATR(RI PC)
     A  85        D2BCC5         1A  B 14 27TEXT('箱色')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 64                            DSPATR(RI PC)
     A  85        D2BTC5         1A  B 14 36TEXT('箱種')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 65                            DSPATR(RI PC)
     A  85        D2BCN5         6A  B 14 29TEXT('箱色名称')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 66                            DSPATR(RI PC)
     A  85        D2BTN5         5A  B 14 38TEXT('箱種名称')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 67                            DSPATR(RI PC)
     A  85        D2KNH5         6Y 0B 14 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 68                            DSPATR(RI PC)
     A  85        D2KVI5        27A  B 14 53TEXT('備考')
     A  85 96                               DSPATR(CS)
     A  85N96                               DSPATR(PR)
     A  85 75 69                            DSPATR(RI PC)
      *<<工程#6>>
     A  86        D2SEQ6         2S 0O 15  1TEXT('行№')
     A  86        D2KTE6         4A  B 15  4TEXT('工程')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 61                            DSPATR(RI PC)
     A  86        D2KBM6         4Y 0B 15  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 62                            DSPATR(RI PC)
     A  86        D2KBN6         8A  O 15 14TEXT('加工工場名')
     A  86        D2MSN6         3A  B 15 23TEXT('機番')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 63                            DSPATR(RI PC)
     A  86        D2BCC6         1A  B 15 27TEXT('箱色')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 64                            DSPATR(RI PC)
     A  86        D2BTC6         1A  B 15 36TEXT('箱種')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 65                            DSPATR(RI PC)
     A  86        D2BCN6         6A  B 15 29TEXT('箱色名称')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 66                            DSPATR(RI PC)
     A  86        D2BTN6         5A  B 15 38TEXT('箱種名称')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 67                            DSPATR(RI PC)
     A  86        D2KNH6         6Y 0B 15 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 68                            DSPATR(RI PC)
     A  86        D2KVI6        27A  B 15 53TEXT('備考')
     A  86 96                               DSPATR(CS)
     A  86N96                               DSPATR(PR)
     A  86 76 69                            DSPATR(RI PC)
      *<<工程#7>>
     A  87        D2SEQ7         2S 0O 16  1TEXT('行№')
     A  87        D2KTE7         4A  B 16  4TEXT('工程')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 61                            DSPATR(RI PC)
     A  87        D2KBM7         4Y 0B 16  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 62                            DSPATR(RI PC)
     A  87        D2KBN7         8A  O 16 14TEXT('加工工場名')
     A  87        D2MSN7         3A  B 16 23TEXT('機番')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 63                            DSPATR(RI PC)
     A  87        D2BCC7         1A  B 16 27TEXT('箱色')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 64                            DSPATR(RI PC)
     A  87        D2BTC7         1A  B 16 36TEXT('箱種')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 65                            DSPATR(RI PC)
     A  87        D2BCN7         6A  B 16 29TEXT('箱色名称')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 66                            DSPATR(RI PC)
     A  87        D2BTN7         5A  B 16 38TEXT('箱種名称')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 67                            DSPATR(RI PC)
     A  87        D2KNH7         6Y 0B 16 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 68                            DSPATR(RI PC)
     A  87        D2KVI7        27A  B 16 53TEXT('備考')
     A  87 96                               DSPATR(CS)
     A  87N96                               DSPATR(PR)
     A  87 77 69                            DSPATR(RI PC)
      *<<工程#8>>
     A  88        D2SEQ8         2S 0O 17  1TEXT('行№')
     A  88        D2KTE8         4A  B 17  4TEXT('工程')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 61                            DSPATR(RI PC)
     A  88        D2KBM8         4Y 0B 17  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 62                            DSPATR(RI PC)
     A  88        D2KBN8         8A  O 17 14TEXT('加工工場名')
     A  88        D2MSN8         3A  B 17 23TEXT('機番')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 63                            DSPATR(RI PC)
     A  88        D2BCC8         1A  B 17 27TEXT('箱色')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 64                            DSPATR(RI PC)
     A  88        D2BTC8         1A  B 17 36TEXT('箱種')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 65                            DSPATR(RI PC)
     A  88        D2BCN8         6A  B 17 29TEXT('箱色名称')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 66                            DSPATR(RI PC)
     A  88        D2BTN8         5A  B 17 38TEXT('箱種名称')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 67                            DSPATR(RI PC)
     A  88        D2KNH8         6Y 0B 17 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 68                            DSPATR(RI PC)
     A  88        D2KVI8        27A  B 17 53TEXT('備考')
     A  88 96                               DSPATR(CS)
     A  88N96                               DSPATR(PR)
     A  88 78 69                            DSPATR(RI PC)
      *<<工程#9>>
     A  89        D2SEQ9         2S 0O 18  1TEXT('行№')
     A  89        D2KTE9         4A  B 18  4TEXT('工程')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 61                            DSPATR(RI PC)
     A  89        D2KBM9         4Y 0B 18  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 62                            DSPATR(RI PC)
     A  89        D2KBN9         8A  O 18 14TEXT('加工工場名')
     A  89        D2MSN9         3A  B 18 23TEXT('機番')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 63                            DSPATR(RI PC)
     A  89        D2BCC9         1A  B 18 27TEXT('箱色')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 64                            DSPATR(RI PC)
     A  89        D2BTC9         1A  B 18 36TEXT('箱種')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 65                            DSPATR(RI PC)
     A  89        D2BCN9         6A  B 18 29TEXT('箱色名称')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 66                            DSPATR(RI PC)
     A  89        D2BTN9         5A  B 18 38TEXT('箱種名称')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 67                            DSPATR(RI PC)
     A  89        D2KNH9         6Y 0B 18 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 68                            DSPATR(RI PC)
     A  89        D2KVI9        27A  B 18 53TEXT('備考')
     A  89 96                               DSPATR(CS)
     A  89N96                               DSPATR(PR)
     A  89 79 69                            DSPATR(RI PC)
      *<<工程#10>>
     A  90        D2SEQ0         2S 0O 19  1TEXT('行№')
     A  90        D2KTE0         4A  B 19  4TEXT('工程')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 61                            DSPATR(RI PC)
     A  90        D2KBM0         4Y 0B 19  9TEXT('加工工場コード')
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 62                            DSPATR(RI PC)
     A  90        D2KBN0         8A  O 19 14TEXT('加工工場名')
     A  90        D2MSN0         3A  B 19 23TEXT('機番')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 63                            DSPATR(RI PC)
     A  90        D2BCC0         1A  B 19 27TEXT('箱色')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 64                            DSPATR(RI PC)
     A  90        D2BTC0         1A  B 19 36TEXT('箱種')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 65                            DSPATR(RI PC)
     A  90        D2BCN0         6A  B 19 29TEXT('箱色名称')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 66                            DSPATR(RI PC)
     A  90        D2BTN0         5A  B 19 38TEXT('箱種名称')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 67                            DSPATR(RI PC)
     A  90        D2KNH0         6Y 0B 19 44TEXT('納期')
     A                                      EDTWRD('0  /  /  ')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 68                            DSPATR(RI PC)
     A  90        D2KVI0        27A  B 19 53TEXT('備考')
     A  90 96                               DSPATR(CS)
     A  90N96                               DSPATR(PR)
     A  90 80 69                            DSPATR(RI PC)
     A*
     A*<<入出力項目>>
     A                                 20  2'WASHER'
     A                                 20 28'YYMMDD'
     A                                 20 61'YYMMDD'
     A                                 20 74'YYMMDD'
     A*
     A            D2KH1         15A  O 21  2TEXT('構成品１')
     A            D2KB1          9A  O 21 18TEXT('構成品番地１')
     A            D2WHZ1         6Y 0B 21 28TEXT('構成品納期１')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  51                                  DSPATR(RI PC)
     A            D2KH2         15A  O 21 35TEXT('構成品２')
     A            D2KB2          9A  O 21 51TEXT('構成品番地２')
     A            D2WHZ2         6Y 0B 21 61TEXT('構成品納期２')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  52                                  DSPATR(RI PC)
     A                                 21 68'TOOL:'
     A            D2KTHZ         6Y 0B 21 74TEXT('型納期')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  40                                  DSPATR(RI PC)
     A*
     A            D2KH3         15A  O 22  2TEXT('構成品３')
     A            D2KB3          9A  O 22 18TEXT('構成品番地３')
     A            D2WHZ3         6Y 0B 22 28TEXT('構成品納期３')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  53                                  DSPATR(RI PC)
     A            D2KH4         15A  O 22 35TEXT('構成品４')
     A            D2KB4          9A  O 22 51TEXT('構成品番地４')
     A            D2WHZ4         6Y 0B 22 61TEXT('構成品納期４')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  54                                  DSPATR(RI PC)
     A                                 22 68'MATL:'
     A            D2ZRHZ         6Y 0B 22 74TEXT('材料納期')
     A                                      EDTWRD('0      ')
     A  96                                  DSPATR(CS)
     A N96                                  DSPATR(PR)
     A  41                                  DSPATR(RI PC)
     A*<<ハイド項目>>
     A            H2BAN1         1A  H      TEXT('番地１')
     A            H2BAN2         2A  H      TEXT('番地２')
     A            H2BAN3         2A  H      TEXT('番地３')
     A            H2BAN4         1A  H      TEXT('番地４')
     A            H2WHZ1         8Y 0H      TEXT('構成品納期１')
     A            H2WHZ2         8Y 0H      TEXT('構成品納期２')
     A            H2WHZ3         8Y 0H      TEXT('構成品納期３')
     A            H2WHZ4         8Y 0H      TEXT('構成品納期４')
     A            H2KTHZ         8Y 0H      TEXT('型納期')
     A            H2ZRHZ         8Y 0H      TEXT('材料納期')
     A            H2ZBN1         1A  H      TEXT('材料番地１')
     A            H2ZBN2         2A  H      TEXT('材料番地２')
     A            H2ZBN3         2A  H      TEXT('材料番地３')
     A            H2ZBN4         1A  H      TEXT('材料番地４')
     A            H2HKHZ         8Y 0H      TEXT('かんばん発行年月日')
     A            H2HKTM         6Y 0H      TEXT('かんばん発行時間')
     A            H2LPHZ         8Y 0H      TEXT('前回手配発行日')
     A            H2NKHZ         8Y 0H      TEXT('入庫日')
     A            H2FFLG         1A  H      TEXT('完了フラグ')
     A            H2PCHZ         8Y 0H      TEXT(' PCCS戻り日')
     A*<<メッセージ>>
     A                                 23 11'ERROR'
     A                                      DSPATR(RI)
     A N99                                  DSPATR(ND)
     A            D2EMSG        53O  O 23 18TEXT('d[ｰxｮﾈｰﾆﾞ')
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A N99                                  DSPATR(ND)
     A*<<ファンクション>>
     A                                 24  9'PREV'
     A                                 24 15'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 35'UPDATE'
     A                                 24 43'CMD-5'
     A                                      DSPATR(RI)
     A                                 24 62'ROLL UP/DOWN'
     A                                      DSPATR(RI)
