      ** MYAPW00 *********************
      *  FACILITIES LOAD GRAPH MENU  *
      * 設備負荷グラフメニュー     *
      *   I-HASADA      2013/03/11   *
      ********************* MYAPW00 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
      *------------*
      * 画面－１ *
      *------------*
     A          R MYAPW001                  TEXT('SCREEN-1')
     A                                      KEEP
      *
     A                                      CF01
      *
     A                                  1 26'  FACILITIES LOAD GRAPH MENU  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT MYAPW00'
      *
     A                                  3  3' DATA MAKING '
     A                                      COLOR(PNK) DSPATR(RI)
     A                                  5  3' 10 '
     A                                      DSPATR(RI)
     A                                  5  9'FACILITIES LOAD GRAPH NO1.'
     A                                  7  3' 20 '
     A                                      DSPATR(RI)
     A                                  7  9'FACILITIES LOAD GRAPH NO3.'
      *
     A                                  3 43' MASTER UPDATE '
     A                                      COLOR(BLU) DSPATR(RI)
     A                                  5 43' 51 '
     A                                      DSPATR(RI)
     A                                  5 49'PLURAL PLANES TURN RATIO MASTER'
     A                                  7 43' 52 '
     A                                      DSPATR(RI)
     A                                  7 49'NUMBER OF REVOLUTIONS MASTER'
     A                                  8 50'ACCORDING TO THE ARTIDE NUMBER'
      *
     A            IMENO          2Y 0B 20  4DSPATR(CS) EDTCDE(Z)
     A  51                                  DSPATR(RI PC)
     A                                 20  8'--> PLEASE INPUT MENU NO'
      *
     A  99                             22  2' ERROR '
     A                                      DSPATR(RI BL)
     A  99        MSG           70A  O 22 10
      *
     A                                 24  4'EXIT'
     A                                    +2' F1 ' DSPATR(RI)
