      ** MYBPW11 ********************************
      * 仕掛けﾜｮn及び出現率照会& mﾞｰj作成 *
      *  ﾃﾇnﾈ]jｰ機番別                        *
      *     I-HASADA             2013/02/28     *
      *  I-HASADA 2013/04/04                    *
      *   COPY RPG(IAFAYM):TG031D0              *
      ******************************** MYBPW11 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
      *-----------*
      * 画面-1  *
      *-----------*
     A          R MYBPW111                  TEXT('画面-1')
      *
     A                                      CF01
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  /  /  ')
     A                                  1 18'  **  ﾃﾇnﾈ]jｰ機番別仕掛けﾜｮn-
     A                                      及び出現率 **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT MYBPW11'
      *
     A                                  5  9' 1 '
     A                                      DSPATR(RI)
     A                                  5 13'工場ﾃｰnﾞ :'
     A            IKOJO          4A  B  5 27DSPATR(CS)
     A  11                                  DSPATR(RI PC)
      *
     A                                  7  9' 2 '
     A                                      DSPATR(RI)
     A                                  7 13'工程ﾃｰnﾞ :'
     A                                  8 13'【任意】'
     A            IKO01          3A  B  7 27DSPATR(CS)
     A  12                                  DSPATR(RI PC)
     A            IKO02          3A  B  7 33DSPATR(CS)
     A  13                                  DSPATR(RI PC)
     A            IKO03          3A  B  7 39DSPATR(CS)
     A  14                                  DSPATR(RI PC)
     A            IKO04          3A  B  7 45DSPATR(CS)
     A  15                                  DSPATR(RI PC)
     A            IKO05          3A  B  7 51DSPATR(CS)
     A  16                                  DSPATR(RI PC)
     A            IKO06          3A  B  7 57DSPATR(CS)
     A  17                                  DSPATR(RI PC)
     A            IKO07          3A  B  7 63DSPATR(CS)
     A  18                                  DSPATR(RI PC)
     A            IKO08          3A  B  7 69DSPATR(CS)
     A  19                                  DSPATR(RI PC)
     A            IKO09          3A  B  8 27DSPATR(CS)
     A  20                                  DSPATR(RI PC)
     A            IKO10          3A  B  8 33DSPATR(CS)
     A  21                                  DSPATR(RI PC)
      *
     A                                 10  9' 3 '
     A                                      DSPATR(RI)
     A                                 10 14'ﾃﾇnﾈ]jｰ   :'
     A                                 11 13'【任意】'
     A            ICO11          2A  B 10 27DSPATR(CS)
     A  22                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO12          2A  B    +1DSPATR(CS)
     A  22                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO13          2A  B    +1DSPATR(CS)
     A  22                                  DSPATR(RI PC)
     A            ICO21          2A  B 10 43DSPATR(CS)
     A  23                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO22          2A  B    +1DSPATR(CS)
     A  23                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO23          2A  B    +1DSPATR(CS)
     A  23                                  DSPATR(RI PC)
     A            ICO31          2A  B 10 59DSPATR(CS)
     A  24                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO32          2A  B    +1DSPATR(CS)
     A  24                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO33          2A  B    +1DSPATR(CS)
     A  24                                  DSPATR(RI PC)
     A            ICO41          2A  B 11 27DSPATR(CS)
     A  25                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO42          2A  B    +1DSPATR(CS)
     A  25                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO43          2A  B    +1DSPATR(CS)
     A  25                                  DSPATR(RI PC)
     A            ICO51          2A  B 11 43DSPATR(CS)
     A  26                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO52          2A  B    +1DSPATR(CS)
     A  26                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO53          2A  B    +1DSPATR(CS)
     A  26                                  DSPATR(RI PC)
     A            ICO61          2A  B 11 59DSPATR(CS)
     A  27                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO62          2A  B    +1DSPATR(CS)
     A  27                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO63          2A  B    +1DSPATR(CS)
     A  27                                  DSPATR(RI PC)
     A            ICO71          2A  B 12 27DSPATR(CS)
     A  28                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO72          2A  B    +1DSPATR(CS)
     A  28                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO73          2A  B    +1DSPATR(CS)
     A  28                                  DSPATR(RI PC)
     A            ICO81          2A  B 12 43DSPATR(CS)
     A  29                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO82          2A  B    +1DSPATR(CS)
     A  29                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO83          2A  B    +1DSPATR(CS)
     A  29                                  DSPATR(RI PC)
     A            ICO91          2A  B 12 59DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO92          2A  B    +1DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICO93          2A  B    +1DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A            ICOA1          2A  B 13 27DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICOA2          2A  B    +1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A                                    +1'-'
     A            ICOA3          2A  B    +1DSPATR(CS)
     A  31                                  DSPATR(RI PC)
      *
     A                                 15  9' 4 ' DSPATR(RI)
     A                                 15 13'新旧工程判断:'
     A            IKUBN          1A  B 15 30DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A                                 15 33'1.常に最新工程'
     A                                 16 33'2.工程切替日により新旧判断'
      *
     A                                 18  9' 5 ' DSPATR(RI)
     A                                 18 13'可動率年月:'
     A            IBRYM          6Y 0B 18 28DSPATR(CS) EDTCDE(Z)
     A  33                                  DSPATR(RI PC)
     A                                 19 28'YYYYMM'
      *
     A  99                             22  3' d[ｰ '
     A                                      DSPATR(RI BL)
     A  99        MSG           70A  O 22  9
      *
     A                                 24  3'終　了'
     A                                    +1' F1 ' DSPATR(RI)
      *
      *-----------*
      * 画面-2  *
      *-----------*
     A          R MYBPW112                  TEXT('画面-2')
      *
     A                                      CF03
     A                                      CF05
     A                                      ROLLUP(92)
     A                                      ROLLDOWN(91)
      *
     A                                  1 18'  **  ﾃﾇnﾈ]jｰ機番別仕掛けﾜｮn-
     A                                      及び出現率 **  '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT MYBPW11'
      *
     A                                  2  2'工場:'
     A            IKOJO          4A  O  2 10
     A            OKJNM         16O  O  2 16
      *
     A                                  3  2'工程:'
     A            IKO01          3A  O  3 10
     A            IKO02          3A  O    +2
     A            IKO03          3A  O    +2
     A            IKO04          3A  O    +2
     A            IKO05          3A  O    +2
     A            IKO06          3A  O  4 10
     A            IKO07          3A  O    +2
     A            IKO08          3A  O    +2
     A            IKO09          3A  O    +2
     A            IKO10          3A  O    +2
      *
     A                                  2 37'ﾃﾇnﾈ]jｰ :'
     A            OCO01          8A  O  2 47
     A            OCO02          8A  O    +2
     A            OCO03          8A  O    +2
     A            OCO04          8A  O  3 37
     A            OCO05          8A  O    +2
     A            OCO06          8A  O    +2
     A            OCO07          8A  O    +2
     A            OCO08          8A  O  4 37
     A            OCO09          8A  O    +2
     A            OCO10          8A  O    +2
      *
     A                                  5  3' 1 '
     A                                      DSPATR(RI)
     A                                  5  8'ﾌﾟjｰ]表'
     A                                      DSPATR(HI)
     A                                  5 18'( IF条件式は、>､<､= )'
      *
     A                                  5 43'可動率:'
     A            IBRYM          6Y 0O  5 53EDTWRD('    /  ')
      *
     A                                  6  6' ﾌﾟjｰ] '
     A                                      DSPATR(RI) COLOR(BLU)
     A                                  6 15'箱／日'
     A                                      DSPATR(RI) COLOR(BLU)
     A                                  6 25' IF条件式'
     A                                      DSPATR(RI) COLOR(BLU)
     A                                  6 40'直に回'
     A                                      DSPATR(RI) COLOR(BLU)
     A                                  6 54'箱数'
     A                                      DSPATR(RI) COLOR(BLU)
     A                                  5 62'後工程引取ﾜｮn  '
     A                                      DSPATR(RI UL) COLOR(BLU)
     A                                  6 62'加味Y-YES,N-NO '
     A                                      DSPATR(RI) COLOR(BLU)
      *
     A            HDT01          1A  B  7  3DSPATR(CS)
     A  11                                  DSPATR(RI PC)
     A            HDT02          1A  B  8  3DSPATR(CS)
     A  12                                  DSPATR(RI PC)
     A            HDT03          1A  B  9  3DSPATR(CS)
     A  13                                  DSPATR(RI PC)
     A            HDT04          1A  B 10  3DSPATR(CS)
     A  14                                  DSPATR(RI PC)
     A            HDT05          1A  B 11  3DSPATR(CS)
     A  15                                  DSPATR(RI PC)
     A            HDT06          1A  B 12  3DSPATR(CS)
     A  16                                  DSPATR(RI PC)
     A            HDT07          1A  B 13  3DSPATR(CS)
     A  17                                  DSPATR(RI PC)
     A            HDT08          1A  B 14  3DSPATR(CS)
     A  18                                  DSPATR(RI PC)
     A            HDT09          1A  B 15  3DSPATR(CS)
     A  19                                  DSPATR(RI PC)
     A            HDT10          1A  B 16  3DSPATR(CS)
     A  20                                  DSPATR(RI PC)
      *
     A            HPT01          3Y 0O  7  8EDTCDE(Z)
     A            HPT02          3Y 0O  8  8EDTCDE(Z)
     A            HPT03          3Y 0O  9  8EDTCDE(Z)
     A            HPT04          3Y 0O 10  8EDTCDE(Z)
     A            HPT05          3Y 0O 11  8EDTCDE(Z)
     A            HPT06          3Y 0O 12  8EDTCDE(Z)
     A            HPT07          3Y 0O 13  8EDTCDE(Z)
     A            HPT08          3Y 0O 14  8EDTCDE(Z)
     A            HPT09          3Y 0O 15  8EDTCDE(Z)
     A            HPT10          3Y 0O 16  8EDTCDE(Z)
      *
     A            HHS01          5Y 0B  7 17DSPATR(CS) EDTCDE(Z)
     A  21                                  DSPATR(RI PC)
     A            HHS02          5Y 0B  8 17DSPATR(CS) EDTCDE(Z)
     A  22                                  DSPATR(RI PC)
     A            HHS03          5Y 0B  9 17DSPATR(CS) EDTCDE(Z)
     A  23                                  DSPATR(RI PC)
     A            HHS04          5Y 0B 10 17DSPATR(CS) EDTCDE(Z)
     A  24                                  DSPATR(RI PC)
     A            HHS05          5Y 0B 11 17DSPATR(CS) EDTCDE(Z)
     A  25                                  DSPATR(RI PC)
     A            HHS06          5Y 0B 12 17DSPATR(CS) EDTCDE(Z)
     A  26                                  DSPATR(RI PC)
     A            HHS07          5Y 0B 13 17DSPATR(CS) EDTCDE(Z)
     A  27                                  DSPATR(RI PC)
     A            HHS08          5Y 0B 14 17DSPATR(CS) EDTCDE(Z)
     A  28                                  DSPATR(RI PC)
     A            HHS09          5Y 0B 15 17DSPATR(CS) EDTCDE(Z)
     A  29                                  DSPATR(RI PC)
     A            HHS10          5Y 0B 16 17DSPATR(CS) EDTCDE(Z)
     A  30                                  DSPATR(RI PC)
      *
     A            HJ101          1A  B  7 28DSPATR(CS)
     A  31                                  DSPATR(RI PC)
     A            HJ102          1A  B  8 28DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A            HJ103          1A  B  9 28DSPATR(CS)
     A  33                                  DSPATR(RI PC)
     A            HJ104          1A  B 10 28DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A            HJ105          1A  B 11 28DSPATR(CS)
     A  35                                  DSPATR(RI PC)
     A            HJ106          1A  B 12 28DSPATR(CS)
     A  36                                  DSPATR(RI PC)
     A            HJ107          1A  B 13 28DSPATR(CS)
     A  37                                  DSPATR(RI PC)
     A            HJ108          1A  B 14 28DSPATR(CS)
     A  38                                  DSPATR(RI PC)
     A            HJ109          1A  B 15 28DSPATR(CS)
     A  39                                  DSPATR(RI PC)
     A            HJ110          1A  B 16 28DSPATR(CS)
     A  40                                  DSPATR(RI PC)
      *
     A            HJ201          1A  B  7 32DSPATR(CS)
     A  41                                  DSPATR(RI PC)
     A            HJ202          1A  B  8 32DSPATR(CS)
     A  42                                  DSPATR(RI PC)
     A            HJ203          1A  B  9 32DSPATR(CS)
     A  43                                  DSPATR(RI PC)
     A            HJ204          1A  B 10 32DSPATR(CS)
     A  44                                  DSPATR(RI PC)
     A            HJ205          1A  B 11 32DSPATR(CS)
     A  45                                  DSPATR(RI PC)
     A            HJ206          1A  B 12 32DSPATR(CS)
     A  46                                  DSPATR(RI PC)
     A            HJ207          1A  B 13 32DSPATR(CS)
     A  47                                  DSPATR(RI PC)
     A            HJ208          1A  B 14 32DSPATR(CS)
     A  48                                  DSPATR(RI PC)
     A            HJ209          1A  B 15 32DSPATR(CS)
     A  49                                  DSPATR(RI PC)
     A            HJ210          1A  B 16 32DSPATR(CS)
     A  50                                  DSPATR(RI PC)
      *
     A                                  7 36'→'
     A                                      COLOR(BLU)
     A                                  8 36'→'
     A                                      COLOR(BLU)
     A                                  9 36'→'
     A                                      COLOR(BLU)
     A                                 10 36'→'
     A                                      COLOR(BLU)
     A                                 11 36'→'
     A                                      COLOR(BLU)
     A                                 12 36'→'
     A                                      COLOR(BLU)
     A                                 13 36'→'
     A                                      COLOR(BLU)
     A                                 14 36'→'
     A                                      COLOR(BLU)
     A                                 15 36'→'
     A                                      COLOR(BLU)
     A                                 16 36'→'
     A                                      COLOR(BLU)
      *
     A            HTK01          2Y 0B  7 41DSPATR(CS) EDTCDE(Z)
     A  51                                  DSPATR(RI PC)
     A            HTK02          2Y 0B  8 41DSPATR(CS) EDTCDE(Z)
     A  52                                  DSPATR(RI PC)
     A            HTK03          2Y 0B  9 41DSPATR(CS) EDTCDE(Z)
     A  53                                  DSPATR(RI PC)
     A            HTK04          2Y 0B 10 41DSPATR(CS) EDTCDE(Z)
     A  54                                  DSPATR(RI PC)
     A            HTK05          2Y 0B 11 41DSPATR(CS) EDTCDE(Z)
     A  55                                  DSPATR(RI PC)
     A            HTK06          2Y 0B 12 41DSPATR(CS) EDTCDE(Z)
     A  56                                  DSPATR(RI PC)
     A            HTK07          2Y 0B 13 41DSPATR(CS) EDTCDE(Z)
     A  57                                  DSPATR(RI PC)
     A            HTK08          2Y 0B 14 41DSPATR(CS) EDTCDE(Z)
     A  58                                  DSPATR(RI PC)
     A            HTK09          2Y 0B 15 41DSPATR(CS) EDTCDE(Z)
     A  59                                  DSPATR(RI PC)
     A            HTK10          2Y 0B 16 41DSPATR(CS) EDTCDE(Z)
     A  60                                  DSPATR(RI PC)
      *
     A            HKI01          2Y 0B  7 45DSPATR(CS) EDTCDE(Z)
     A  61                                  DSPATR(RI PC)
     A            HKI02          2Y 0B  8 45DSPATR(CS) EDTCDE(Z)
     A  62                                  DSPATR(RI PC)
     A            HKI03          2Y 0B  9 45DSPATR(CS) EDTCDE(Z)
     A  63                                  DSPATR(RI PC)
     A            HKI04          2Y 0B 10 45DSPATR(CS) EDTCDE(Z)
     A  64                                  DSPATR(RI PC)
     A            HKI05          2Y 0B 11 45DSPATR(CS) EDTCDE(Z)
     A  65                                  DSPATR(RI PC)
     A            HKI06          2Y 0B 12 45DSPATR(CS) EDTCDE(Z)
     A  66                                  DSPATR(RI PC)
     A            HKI07          2Y 0B 13 45DSPATR(CS) EDTCDE(Z)
     A  67                                  DSPATR(RI PC)
     A            HKI08          2Y 0B 14 45DSPATR(CS) EDTCDE(Z)
     A  68                                  DSPATR(RI PC)
     A            HKI09          2Y 0B 15 45DSPATR(CS) EDTCDE(Z)
     A  69                                  DSPATR(RI PC)
     A            HKI10          2Y 0B 16 45DSPATR(CS) EDTCDE(Z)
     A  70                                  DSPATR(RI PC)
      *
     A                                  7 48'又は'
     A                                      COLOR(BLU)
     A                                  8 48'又は'
     A                                      COLOR(BLU)
     A                                  9 48'又は'
     A                                      COLOR(BLU)
     A                                 10 48'又は'
     A                                      COLOR(BLU)
     A                                 11 48'又は'
     A                                      COLOR(BLU)
     A                                 12 48'又は'
     A                                      COLOR(BLU)
     A                                 13 48'又は'
     A                                      COLOR(BLU)
     A                                 14 48'又は'
     A                                      COLOR(BLU)
     A                                 15 48'又は'
     A                                      COLOR(BLU)
     A                                 16 48'又は'
     A                                      COLOR(BLU)
      *
     A            HKS01          5Y 0B  7 55DSPATR(CS) EDTCDE(Z)
     A  71                                  DSPATR(RI PC)
     A            HKS02          5Y 0B  8 55DSPATR(CS) EDTCDE(Z)
     A  72                                  DSPATR(RI PC)
     A            HKS03          5Y 0B  9 55DSPATR(CS) EDTCDE(Z)
     A  73                                  DSPATR(RI PC)
     A            HKS04          5Y 0B 10 55DSPATR(CS) EDTCDE(Z)
     A  74                                  DSPATR(RI PC)
     A            HKS05          5Y 0B 11 55DSPATR(CS) EDTCDE(Z)
     A  75                                  DSPATR(RI PC)
     A            HKS06          5Y 0B 12 55DSPATR(CS) EDTCDE(Z)
     A  76                                  DSPATR(RI PC)
     A            HKS07          5Y 0B 13 55DSPATR(CS) EDTCDE(Z)
     A  77                                  DSPATR(RI PC)
     A            HKS08          5Y 0B 14 55DSPATR(CS) EDTCDE(Z)
     A  78                                  DSPATR(RI PC)
     A            HKS09          5Y 0B 15 55DSPATR(CS) EDTCDE(Z)
     A  79                                  DSPATR(RI PC)
     A            HKS10          5Y 0B 16 55DSPATR(CS) EDTCDE(Z)
     A  80                                  DSPATR(RI PC)
      *
     A            HKM01          1A  B  7 63DSPATR(CS)
     A  81                                  DSPATR(RI PC)
     A            HKM02          1A  B  8 63DSPATR(CS)
     A  82                                  DSPATR(RI PC)
     A            HKM03          1A  B  9 63DSPATR(CS)
     A  83                                  DSPATR(RI PC)
     A            HKM04          1A  B 10 63DSPATR(CS)
     A  84                                  DSPATR(RI PC)
     A            HKM05          1A  B 11 63DSPATR(CS)
     A  85                                  DSPATR(RI PC)
     A            HKM06          1A  B 12 63DSPATR(CS)
     A  86                                  DSPATR(RI PC)
     A            HKM07          1A  B 13 63DSPATR(CS)
     A  87                                  DSPATR(RI PC)
     A            HKM08          1A  B 14 63DSPATR(CS)
     A  88                                  DSPATR(RI PC)
     A            HKM09          1A  B 15 63DSPATR(CS)
     A  89                                  DSPATR(RI PC)
     A            HKM10          1A  B 16 63DSPATR(CS)
     A  90                                  DSPATR(RI PC)
      *
     A                                  7 66'(Y-YES,N-NO)'
     A                                  8 66'(Y-YES,N-NO)'
     A                                  9 66'(Y-YES,N-NO)'
     A                                 10 66'(Y-YES,N-NO)'
     A                                 11 66'(Y-YES,N-NO)'
     A                                 12 66'(Y-YES,N-NO)'
     A                                 13 66'(Y-YES,N-NO)'
     A                                 14 66'(Y-YES,N-NO)'
     A                                 15 66'(Y-YES,N-NO)'
     A                                 16 66'(Y-YES,N-NO)'
      *
     A                                 17  3'､､､> ( 0=取消)'
      *
     A N93                             17 72'続く､､'
     A                                      COLOR(RED)
     A  93                             17 72'終り'
     A                                      COLOR(RED)
      *
     A                                 18  3' 2 '
     A                                      DSPATR(RI)
     A                                 18  7'出現率'
     A                                      DSPATR(HI)
     A            INATK          2Y 0B 19 20DSPATR(CS) EDTCDE(Z)
     A  09                                  DSPATR(RI PC)
     A            INAKI          2Y 0B 19 30DSPATR(CS) EDTCDE(Z)
     A  10                                  DSPATR(RI PC)
     A                                 19  7'出現率は、'
     A                                 19 23'直に'
     A                                 19 33'回。'
     A                                 20 15'《計算式=箱数／日÷２×直-
     A                                      ×回÷仕掛けﾜｮn》'
     A                                 21 15'《'
     A                                 21 26'結果、１以上は１とする。》'
      *
     A  99                             23  3' d[ｰ '
     A                                      DSPATR(RI BL)
     A  99        MSG           70A  O 23  9
      *
     A                                 24  3'前画面'
     A                                    +1' F3 ' DSPATR(RI)
     A                                    +1'照会'
     A                                    +1' F5 ' DSPATR(RI)
     A                                    +1'前明細'
     A                                    +1' PGUP ' DSPATR(RI)
     A                                    +1'次明細'
     A                                    +1' PGDN ' DSPATR(RI)
