     A** NCHPW10 *************************
     A* .. EXPLANATION MATERIAL FOR FACILITY ABILITY EXAMINATION || *.
     A* A.IDOTA 1993.05.10 *
     A************************* NCHPW10 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R NCHPW101
     A*%%TS  SD  19961118  111951  AO          REL-V3R0M5  5763-PW1
     A                                      TEXT('EXPLANATION MATERIAL FOR FACI-
     A                                      LITY ABILITY EXAMINAT')
     A                                      CF01(01)
     A                                      CF05(05)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 16'* EXPLANATION MATERIAL FOR FACILIT-
     A                                      Y ABILITY EXAMINATION *'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  2 69'FMT NCHPW10'
     A                                  4 11'1'
     A                                      DSPATR(RI)
     A                                  4 15'LIST MAKING SECTION <ALL IS 9999>'
     A                                  6 11'2'
     A                                      DSPATR(RI)
     A                                  6 15'INOUT ONLY MACHINE NO IS APPOINTED'
     A                                  8 11'3'
     A                                      DSPATR(RI)
     A                                  8 15'ACTUAL DATE <YYMM>'
     A                                 10 11'4'
     A                                      DSPATR(RI)
     A                                 10 15'SELECT PAPER. < K6H1.K6H2.K6H3 >'
     A                                 12 11'5'
     A                                      DSPATR(RI)
     A                                 12 14'INPUT A PATTERN OF THE DATE OF PRO-
     A                                      D DEMAND FORECAST'
     A                                 13 11'|'
     A                                 14 11'|'
     A                                 14 29'THIS MONTH'
     A                                 14 41'NEXT MONTH'
     A                                 14 55'NEXT TWO MONTH'
     A                                 15 11'|'
     A                                 16 11'+----------->'
     A                                 16 26'1'
     A                                      DSPATR(RI)
     A                                 18 26'2'
     A                                      DSPATR(RI)
     A            NBMON          4A  B  4 68DSPATR(CS)
     A  02                                  DSPATR(RI)
     A  02                                  DSPATR(PC)
     A            NKINO          3A  B  6 68DSPATR(CS)
     A            NJIHZ          6A  B  8 68DSPATR(CS)
     A  03                                  DSPATR(RI)
     A  03                                  DSPATR(PC)
     A            NYOSI          4A  B 10 68DSPATR(CS)
     A  06                                  DSPATR(RI)
     A  06                                  DSPATR(PC)
     A            NPATN          1A  B 12 68DSPATR(CS)
     A  07                                  DSPATR(RI)
     A  07                                  DSPATR(PC)
     A            N1HZ1          6Y 0O 16 30EDTWRD('    /  ')
     A            N1HZ2          6Y 0O 16 43EDTWRD('    /  ')
     A            N1HZ3          6Y 0O 16 59EDTWRD('    /  ')
     A            N2HZ1          6Y 0O 18 30EDTWRD('    /  ')
     A            N2HZ2          6Y 0O 18 43EDTWRD('    /  ')
     A            N2HZ3          6Y 0O 18 59EDTWRD('    /  ')
     A                                 22 11'ERROR'
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'PUBLICATION OK'
     A                                 24 41'CMD-5'
     A                                      DSPATR(RI)
