     A** NSUPW69 ************************
     A*INQUIRY  OF INVENTORY COUNTING ACCUMULATION FILE
     A* A-IDOTA 1990.01.29 *
     A************************ NSUPW69 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A**************
     A* SCREEN-1 *
     A**************
     A          R NSUPW691
     A*%%TS  SD  19961118  114128  AO          REL-V3R0M5  5763-PW1
     A                                      BLINK
     A  99                                  ALARM
     A                                      PUTOVR
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  1 69'FMT NSUPW69'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('  .  .  ')
     A                                  1 19'INVENTORY COUNTING ACCUMULATION FI-
     A                                      LE INQUIRY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  8 35'PART NUMBER'
     A                                      DSPATR(RI)
     A            HIN1           5A  B 10 32DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 10 38'-'
     A            HIN2           5A  B 10 40DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 10 46'-'
     A            HIN3           2A  B 10 48DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 22 11'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60A  O 22 18OVRDTA
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A                                 24  4'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'APPOINTMENT OK'
     A                                 24 41'ENTER'
     A                                      DSPATR(RI)
     A**************
     A* SCREEN-2 *
     A**************
     A          R NSUPW692
     A*%%TS  SD  19961118  114128  AO          REL-V3R0M5  5763-PW1
     A                                      BLINK
     A                                      PUTOVR
     A                                      CF01
     A                                      CF03
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                      EDTWRD('  :  :  ')
     A                                  1 20'INVENTORY COUNTING ACCUMULATION FI-
     A                                      LE INQUIRY'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT NSUPW69'
     A                                  4  2'PART NUMBER'
     A                                      DSPATR(UL)
     A                                  4 20'PRESENT PROC.'
     A                                      DSPATR(UL)
     A                                  4 36'LOC CODE'
     A                                      DSPATR(UL)
     A                                  4 47'ACCOM QTY'
     A                                      DSPATR(UL)
     A                                  4 64'BOXES'
     A                                      DSPATR(UL)
     A            HNB           14A  O  6  2OVRDTA
     A            BM01           4A  O  6 20OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A            BM02           4A  O  7 20OVRATR
     A                                      OVRDTA
     A N11                                  DSPATR(ND)
     A            BM03           4A  O  8 20OVRATR
     A                                      OVRDTA
     A N12                                  DSPATR(ND)
     A            BM04           4A  O  9 20OVRATR
     A                                      OVRDTA
     A N13                                  DSPATR(ND)
     A            BM05           4A  O 10 20OVRATR
     A                                      OVRDTA
     A N14                                  DSPATR(ND)
     A            BM06           4A  O 11 20OVRATR
     A                                      OVRDTA
     A N15                                  DSPATR(ND)
     A            BM07           4A  O 12 20OVRATR
     A                                      OVRDTA
     A N16                                  DSPATR(ND)
     A            BM08           4A  O 13 20OVRATR
     A                                      OVRDTA
     A N17                                  DSPATR(ND)
     A            BM09           4A  O 14 20OVRATR
     A                                      OVRDTA
     A N18                                  DSPATR(ND)
     A            BM10           4A  O 15 20OVRATR
     A                                      OVRDTA
     A N19                                  DSPATR(ND)
     A            BM11           4A  O 16 20OVRATR
     A                                      OVRDTA
     A N20                                  DSPATR(ND)
     A            BM12           4A  O 17 20OVRATR
     A                                      OVRDTA
     A N21                                  DSPATR(ND)
     A            BM13           4A  O 18 20OVRATR
     A                                      OVRDTA
     A N22                                  DSPATR(ND)
     A            BM14           4A  O 19 20OVRATR
     A                                      OVRDTA
     A N23                                  DSPATR(ND)
     A            BM15           4A  O 20 20OVRATR
     A                                      OVRDTA
     A N24                                  DSPATR(ND)
     A            KT01           3A  O  6 26OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A            KT02           3A  O  7 26OVRATR
     A                                      OVRDTA
     A N11                                  DSPATR(ND)
     A            KT03           3A  O  8 26OVRATR
     A                                      OVRDTA
     A N12                                  DSPATR(ND)
     A            KT04           3A  O  9 26OVRATR
     A                                      OVRDTA
     A N13                                  DSPATR(ND)
     A            KT05           3A  O 10 26OVRATR
     A                                      OVRDTA
     A N14                                  DSPATR(ND)
     A            KT06           3A  O 11 26OVRATR
     A                                      OVRDTA
     A N15                                  DSPATR(ND)
     A            KT07           3A  O 12 26OVRATR
     A                                      OVRDTA
     A N16                                  DSPATR(ND)
     A            KT08           3A  O 13 26OVRATR
     A                                      OVRDTA
     A N17                                  DSPATR(ND)
     A            KT09           3A  O 14 26OVRATR
     A                                      OVRDTA
     A N18                                  DSPATR(ND)
     A            KT10           3A  O 15 26OVRATR
     A                                      OVRDTA
     A N19                                  DSPATR(ND)
     A            KT11           3A  O 16 26OVRATR
     A                                      OVRDTA
     A N20                                  DSPATR(ND)
     A            KT12           3A  O 17 26OVRATR
     A                                      OVRDTA
     A N21                                  DSPATR(ND)
     A            KT13           3A  O 18 26OVRATR
     A                                      OVRDTA
     A N22                                  DSPATR(ND)
     A            KT14           3A  O 19 26OVRATR
     A                                      OVRDTA
     A N23                                  DSPATR(ND)
     A            KT15           3A  O 20 26OVRATR
     A                                      OVRDTA
     A N24                                  DSPATR(ND)
     A            TR01           9A  O  6 36OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A            TR02           9A  O  7 36OVRATR
     A                                      OVRDTA
     A N11                                  DSPATR(ND)
     A            TR03           9A  O  8 36OVRATR
     A                                      OVRDTA
     A N12                                  DSPATR(ND)
     A            TR04           9A  O  9 36OVRATR
     A                                      OVRDTA
     A N13                                  DSPATR(ND)
     A            TR05           9A  O 10 36OVRATR
     A                                      OVRDTA
     A N14                                  DSPATR(ND)
     A            TR06           9A  O 11 36OVRATR
     A                                      OVRDTA
     A N15                                  DSPATR(ND)
     A            TR07           9A  O 12 36OVRATR
     A                                      OVRDTA
     A N16                                  DSPATR(ND)
     A            TR08           9A  O 13 36OVRATR
     A                                      OVRDTA
     A N17                                  DSPATR(ND)
     A            TR09           9A  O 14 36OVRATR
     A                                      OVRDTA
     A N18                                  DSPATR(ND)
     A            TR10           9A  O 15 36OVRATR
     A                                      OVRDTA
     A N19                                  DSPATR(ND)
     A            TR11           9A  O 16 36OVRATR
     A                                      OVRDTA
     A N20                                  DSPATR(ND)
     A            TR12           9A  O 17 36OVRATR
     A                                      OVRDTA
     A N21                                  DSPATR(ND)
     A            TR13           9A  O 18 36OVRATR
     A                                      OVRDTA
     A N22                                  DSPATR(ND)
     A            TR14           9A  O 19 36OVRATR
     A                                      OVRDTA
     A N23                                  DSPATR(ND)
     A            TR15           9A  O 20 36OVRATR
     A                                      OVRDTA
     A N24                                  DSPATR(ND)
     A            SY01           5Y 0O  6 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A            SY02           5Y 0O  7 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N11                                  DSPATR(ND)
     A            SY03           5Y 0O  8 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N12                                  DSPATR(ND)
     A            SY04           5Y 0O  9 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N13                                  DSPATR(ND)
     A            SY05           5Y 0O 10 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N14                                  DSPATR(ND)
     A            SY06           5Y 0O 11 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N15                                  DSPATR(ND)
     A            SY07           5Y 0O 12 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N16                                  DSPATR(ND)
     A            SY08           5Y 0O 13 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N17                                  DSPATR(ND)
     A            SY09           5Y 0O 14 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N18                                  DSPATR(ND)
     A            SY10           5Y 0O 15 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N19                                  DSPATR(ND)
     A            SY11           5Y 0O 16 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N20                                  DSPATR(ND)
     A            SY12           5Y 0O 17 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N21                                  DSPATR(ND)
     A            SY13           5Y 0O 18 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N22                                  DSPATR(ND)
     A            SY14           5Y 0O 19 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N23                                  DSPATR(ND)
     A            SY15           5Y 0O 20 49EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N24                                  DSPATR(ND)
     A            HK01           3Y 0O  6 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N10                                  DSPATR(ND)
     A            HK02           3Y 0O  7 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N11                                  DSPATR(ND)
     A            HK03           3Y 0O  8 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N12                                  DSPATR(ND)
     A            HK04           3Y 0O  9 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N13                                  DSPATR(ND)
     A            HK05           3Y 0O 10 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N14                                  DSPATR(ND)
     A            HK06           3Y 0O 11 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N15                                  DSPATR(ND)
     A            HK07           3Y 0O 12 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N16                                  DSPATR(ND)
     A            HK08           3Y 0O 13 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N17                                  DSPATR(ND)
     A            HK09           3Y 0O 14 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N18                                  DSPATR(ND)
     A            HK10           3Y 0O 15 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N19                                  DSPATR(ND)
     A            HK11           3Y 0O 16 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N20                                  DSPATR(ND)
     A            HK12           3Y 0O 17 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N21                                  DSPATR(ND)
     A            HK13           3Y 0O 18 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N22                                  DSPATR(ND)
     A            HK14           3Y 0O 19 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N23                                  DSPATR(ND)
     A            HK15           3Y 0O 20 65EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A N24                                  DSPATR(ND)
     A                                 24  5'EXIT'
     A                                 24 15'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 24'PREVIOUS SCREEN'
     A                                 24 43'CMD-3'
     A                                      DSPATR(RI)
