     A*%%TS  SD  20151103  080117  TEST        REL-V7R1M0  5770-WDS
     A** NYUPW20 *******************************************
     A* WIP STATUS INQUIRY                                 *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*---------------------------------------*
     A*
     A          R SFL                       SFL
     A*%%TS  SD  20151027  132108  TEST        REL-V7R1M0  5770-WDS
     A*
     A            @HAYYH         4Y 0H
     A            @HAMMH         2Y 0H
     A            @HADDH         2Y 0H
     A            @HABBH         2Y 0H
     A            @ZETIH         4A  H
     A            @TEHIH         3A  H
     A            @PAGNH         2A  H
     A            @RRN           4Y 0H
     A            @55            1A  H
     A            @56            1A  H
     A            @57            1A  H
     A            @TKSI          1A  H
     A            @SKHZ          8Y 0H
     A            @SKYY          2Y 0H
     A            @SKMM          2Y 0H
     A            @SKDD          2Y 0H
     A            @SKTH          2Y 0H
     A            @SKTM          2Y 0H
     A            @SKNM          7A  H
     A            @LT1           3Y 1H
     A            @LT2           3Y 1H
     A*
     A            @HKHZ          8Y 0O  7  4EDTWRD('  .  .  -  ')
     A  58                                  DSPATR(RI)
     A            @TEHI          3A  O  7 16
     A  58                                  DSPATR(RI)
     A            @PAGE          7A  O  7 20
     A  58                                  DSPATR(RI)
     A            @NYHZ         10Y 0O  7 28EDTWRD('  .  .  -  :  ')
     A            @SYHZ         10Y 0O  7 43EDTWRD('  .  .  -  :  ')
     A            WFLD          22A  O  7 58
     A*---------------------------------------*
     A          R SFLCTL                    SFLCTL(SFL)
     A*%%TS  SD  20151103  080117  TEST        REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0015)
     A  72                                  SFLDSPCTL
     A  72                                  ERASE(SFL)
     A  70                                  SFLDSP
     A  71                                  SFLCLR
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CF03(03)
     A                                      ROLLUP(51)
     A                                      ROLLDOWN(52)
     A*
     A            @SFRC1         4S 0H      SFLRCDNBR(CURSOR)
     A            @DATE          8Y 0O  1  2EDTWRD('    /  /  ')
     A                                  1 14TIME
     A                                      EDTWRD('0  :  :  ')
     A                                  1 24'** WORK IN PROCESS STATUS INQUIRY -
     A                                      **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT NYUPW20'
     A*
     A                                  3  2'PART:'
     A                                      DSPATR(HI)
     A            @SHN          14A  O  3 13
     A                                  3 29'KANBAN'
     A                                      DSPATR(HI)
     A                                  3 36'STOCK-IN'
     A                                      DSPATR(HI)
     A                                  3 45'STOCK-OT'
     A                                      DSPATR(HI)
     A                                  3 54'INVENTORY'
     A                                      DSPATR(HI)
     A                                  3 64'REISSUE'
     A                                      DSPATR(HI)
     A                                  3 72'WK-IN-PR'
     A                                      DSPATR(HI)
     A                                  4  2'ISSUE DATE:'
     A                                      DSPATR(HI)
     A            @PHB          10Y 0O  4 14EDTWRD('    .  .  -  ')
     A            @HKSU          5Y 0O  4 29EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A            @NYSU          5Y 0O  4 38EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A            @KISU          5Y 0O  4 47EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A            @INVSU         5Y 0O  4 56EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A            @SISU          5Y 0O  4 65EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A            @SYSU          5Y 0O  4 74EDTWRD('  , 0 ')
     A                                      DSPATR(UL)
     A                                  6  4'ISSUE DATE'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 15'LOT#'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 20' PAGE  '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 28'STOCK-IN DATE'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 43'STOCK-OUT DATE'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  6 58'REISSUED DATE         '
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A*
     A          R #FOOT
     A                                      OVERLAY
     A                                      PROTECT
     A            @ERR          50A  O 23  5
     A  99                                  DSPATR(HI)
     A N99                                  DSPATR(ND)
     A                                 24  4' F3 '
     A                                      DSPATR(RI)
     A                                 24  9'BACK'
     A                                 24 16'PAGE UP/DOWN'
     A                                      DSPATR(RI)
