     A*** OAAPW40 ****************************
     A*  UPDATE OF ASSORTMENT CONDITION M/F  *
     A*  C:Y.AOYAMA          1990.10.26      *
     A**************************** OAAPW40 ***
     A                                      PRINT
     A****************************************
     A**              OAAPW40               **
     A****************************************
     A          R OAAPW401
     A  99                                  ALARM
     A                                      CF01
     A                                  1  2'TIME'
     A                                  1  7TIME EDTWRD('  :  :  ')
     A                                  1 17'* UPDATE OF ASSORTMENT +
     A                                      CONDITION M/F (60POCKETS) *'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT OAAPW40'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  5 25'UPDATE'
     A                                      DSPATR(RI)
     A                                  5 46'RG CODE'
     A                                      DSPATR(RI)
     A            @KOSN          1   B  7 28DSPATR(CS)
     A  02                                  DSPATR(RI PC)
     A            @RGCD          2   B  7 49DSPATR(CS)
     A  03                                  DSPATR(RI PC)
     A                                  9 25'0 - CANCEL'
     A                                 10 25'1 - CHANGE'
     A                                 11 25'2 - ADD'
     A                                 15 16'/// BEFORE ///'
     A                                      DSPATR(UL)
     A                                 17 25'UPDATE'
     A                                      DSPATR(UL)
     A                                 17 46'RG CODE'
     A                                      DSPATR(UL)
     A            MKOSN          8   O 19 25
     A            MRGCD          2   O 19 49
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI BL)
     A  99        @ERR          60   O 22 19
     A                                 24  4'EXIT'
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
     A***************************************
     A**OAAPW402                           **
     A***************************************
     A          R OAAPW402
     A  99                                  ALARM
     A                                      CF03
     A                                      CF07
     A                                  1  2'TIME'
     A                                  1  7TIME EDTWRD('  :  :  ')
     A                                  1 17'* UPDATE OF ASSORTMENT +
     A                                      CONDITION M/F (60POCKETS) *'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT OAAPW40'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  3 26'RG CODE'
     A            @RGCD          2   O  3 34
     A            @RGNM         30   O  3 39
     A                                  4  2'POCKET'
     A                                  5  2'  NO  '
     A                                  4 10'USE INSTRUCTION'
     A                                  4 39'POCKET'
     A                                  5 39'  NO  '
     A                                  4 47'USE INSTRUCTION'
     A*1
     A            @PK01          3Y 0O  6  3
     A            @SK01          2   B  6 10DSPATR(CS)
     A  11                                  DSPATR(RI PC )
     A            @SN01         20   O  6 15
     A*02
     A            @PK02          3Y 0O  6 40
     A            @SK02          2   B  6 47DSPATR(CS)
     A  12                                  DSPATR(RI PC )
     A            @SN02         20   O  6 52
     A*3
     A            @PK03          3Y 0O  7  3
     A            @SK03          2   B  7 10DSPATR(CS)
     A  13                                  DSPATR(RI PC )
     A            @SN03         20   O  7 15
     A*4
     A            @PK04          3Y 0O  7 40
     A            @SK04          2   B  7 47DSPATR(CS)
     A  14                                  DSPATR(RI PC )
     A            @SN04         20   O  7 52
     A*5
     A            @PK05          3Y 0O  8  3
     A            @SK05          2   B  8 10DSPATR(CS)
     A  15                                  DSPATR(RI PC )
     A            @SN05         20   O  8 15
     A*6
     A            @PK06          3Y 0O  8 40
     A            @SK06          2   B  8 47DSPATR(CS)
     A  16                                  DSPATR(RI PC )
     A            @SN06         20   O  8 52
     A*7
     A            @PK07          3Y 0O  9  3
     A            @SK07          2   B  9 10DSPATR(CS)
     A  17                                  DSPATR(RI PC )
     A            @SN07         20   O  9 15
     A*8
     A            @PK08          3Y 0O  9 40
     A            @SK08          2   B  9 47DSPATR(CS)
     A  18                                  DSPATR(RI PC )
     A            @SN08         20   O  9 52
     A*9
     A            @PK09          3Y 0O 10  3
     A            @SK09          2   B 10 10DSPATR(CS)
     A  19                                  DSPATR(RI PC )
     A            @SN09         20   O 10 15
     A*10
     A            @PK010         3Y 0O 10 40
     A            @SK010         2   B 10 47DSPATR(CS)
     A  20                                  DSPATR(RI PC)
     A            @SN010        20   O 10 52
     A*11
     A            @PK011         3Y 0O 11  3
     A            @SK011         2   B 11 10DSPATR(CS)
     A  21                                  DSPATR(RI PC )
     A            @SN011        20   O 11 15
     A*12
     A            @PK012         3Y 0O 11 40
     A            @SK012         2   B 11 47DSPATR(CS)
     A  22                                  DSPATR(RI PC)
     A            @SN012        20   O 11 52
     A*13
     A            @PK013         3Y 0O 12  3
     A            @SK013         2   B 12 10DSPATR(CS)
     A  23                                  DSPATR(RI PC )
     A            @SN013        20   O 12 15
     A*14
     A            @PK014         3Y 0O 12 40
     A            @SK014         2   B 12 47DSPATR(CS)
     A  24                                  DSPATR(RI PC)
     A            @SN014        20   O 12 52
     A*15
     A            @PK015         3Y 0O 13  3
     A            @SK015         2   B 13 10DSPATR(CS)
     A  25                                  DSPATR(RI PC )
     A            @SN015        20   O 13 15
     A*16
     A            @PK016         3Y 0O 13 40
     A            @SK016         2   B 13 47DSPATR(CS)
     A  26                                  DSPATR(RI PC)
     A            @SN016        20   O 13 52
     A*17
     A            @PK017         3Y 0O 14  3
     A            @SK017         2   B 14 10DSPATR(CS)
     A  27                                  DSPATR(RI PC )
     A            @SN017        20   O 14 15
     A*18
     A            @PK018         3Y 0O 14 40
     A            @SK018         2   B 14 47DSPATR(CS)
     A  28                                  DSPATR(RI PC)
     A            @SN018        20   O 14 52
     A*19
     A            @PK019         3Y 0O 15  3
     A            @SK019         2   B 15 10DSPATR(CS)
     A  29                                  DSPATR(RI PC )
     A            @SN019        20   O 15 15
     A*20
     A            @PK020         3Y 0O 15 40
     A            @SK020         2   B 15 47DSPATR(CS)
     A  30                                  DSPATR(RI PC)
     A            @SN020        20   O 15 52
     A*21
     A            @PK021         3Y 0O 16  3
     A            @SK021         2   B 16 10DSPATR(CS)
     A  31                                  DSPATR(RI PC )
     A            @SN021        20   O 16 15
     A*22
     A            @PK022         3Y 0O 16 40
     A            @SK022         2   B 16 47DSPATR(CS)
     A  32                                  DSPATR(RI PC)
     A            @SN022        20   O 16 52
     A*23
     A            @PK023         3Y 0O 17  3
     A            @SK023         2   B 17 10DSPATR(CS)
     A  33                                  DSPATR(RI PC )
     A            @SN023        20   O 17 15
     A*24
     A            @PK024         3Y 0O 17 40
     A            @SK024         2   B 17 47DSPATR(CS)
     A  34                                  DSPATR(RI PC)
     A            @SN024        20   O 17 52
     A*25
     A            @PK025         3Y 0O 18  3
     A            @SK025         2   B 18 10DSPATR(CS)
     A  35                                  DSPATR(RI PC )
     A            @SN025        20   O 18 15
     A*26
     A            @PK026         3Y 0O 18 40
     A            @SK026         2   B 18 47DSPATR(CS)
     A  36                                  DSPATR(RI PC)
     A            @SN026        20   O 18 52
     A*27
     A            @PK027         3Y 0O 19  3
     A            @SK027         2   B 19 10DSPATR(CS)
     A  37                                  DSPATR(RI PC )
     A            @SN027        20   O 19 15
     A*28
     A            @PK028         3Y 0O 19 40
     A            @SK028         2   B 19 47DSPATR(CS)
     A  38                                  DSPATR(RI PC)
     A            @SN028        20   O 19 52
     A*29
     A            @PK029         3Y 0O 20  3
     A            @SK029         2   B 20 10DSPATR(CS)
     A  39                                  DSPATR(RI PC )
     A            @SN029        20   O 20 15
     A*30
     A            @PK030         3Y 0O 20 40
     A            @SK030         2   B 20 47DSPATR(CS)
     A  40                                  DSPATR(RI PC)
     A            @SN030        20   O 20 52
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI BL)
     A  99        @ERR2         60     22 18
     A                                 24  4'KEY INPUT'
     A                                 24 15' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 25'NEXT POCKETS'
     A                                 24 39' CMD-7 '
     A                                      DSPATR(RI)
     A***************************************
     A**OAAPW403                           **
     A***************************************
     A          R OAAPW403
     A  99                                  ALARM
     A                                      CF03
     A                                      CF05
     A                                  1  2'TIME'
     A                                  1  7TIME EDTWRD('  :  :  ')
     A                                  1 17'* UPDATE OF ASSORTMENT +
     A                                      CONDITION M/F (60POCKETS) *'
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT OAAPW40'
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('  .  .  ')
     A                                  3 26'RG CODE'
     A            @RGCD          2   O  3 34
     A            @RGNM         30   O  3 39
     A                                  4  2'POCKET'
     A                                  5  2'  NO  '
     A                                  4 10'USE INSTRUCTION'
     A                                  4 39'POCKET'
     A                                  5 39'  NO  '
     A                                  4 47'USE INSTRUCTION'
     A*31
     A            @PK031         3Y 0O  6  3
     A            @SK031         2   B  6 10DSPATR(CS)
     A  41                                  DSPATR(RI PC )
     A            @SN031        20   O  6 15
     A*32
     A            @PK032         3Y 0O  6 40
     A            @SK032         2   B  6 47DSPATR(CS)
     A  42                                  DSPATR(RI PC )
     A            @SN032        20   O  6 52
     A*33
     A            @PK033         3Y 0O  7  3
     A            @SK033         2   B  7 10DSPATR(CS)
     A  43                                  DSPATR(RI PC )
     A            @SN033        20   O  7 15
     A*34
     A            @PK034         3Y 0O  7 40
     A            @SK034         2   B  7 47DSPATR(CS)
     A  44                                  DSPATR(RI PC )
     A            @SN034        20   O  7 52
     A*35
     A            @PK035         3Y 0O  8  3
     A            @SK035         2   B  8 10DSPATR(CS)
     A  45                                  DSPATR(RI PC )
     A            @SN035        20   O  8 15
     A*36
     A            @PK036         3Y 0O  8 40
     A            @SK036         2   B  8 47DSPATR(CS)
     A  46                                  DSPATR(RI PC )
     A            @SN036        20   O  8 52
     A*37
     A            @PK037         3Y 0O  9  3
     A            @SK037         2   B  9 10DSPATR(CS)
     A  47                                  DSPATR(RI PC )
     A            @SN037        20   O  9 15
     A*38
     A            @PK038         3Y 0O  9 40
     A            @SK038         2   B  9 47DSPATR(CS)
     A  48                                  DSPATR(RI PC )
     A            @SN038        20   O  9 52
     A*39
     A            @PK039         3Y 0O 10  3
     A            @SK039         2   B 10 10DSPATR(CS)
     A  49                                  DSPATR(RI PC )
     A            @SN039        20   O 10 15
     A*40
     A            @PK040         3Y 0O 10 40
     A            @SK040         2   B 10 47DSPATR(CS)
     A  50                                  DSPATR(RI PC)
     A            @SN040        20   O 10 52
     A*41
     A            @PK041         3Y 0O 11  3
     A            @SK041         2   B 11 10DSPATR(CS)
     A  51                                  DSPATR(RI PC )
     A            @SN041        20   O 11 15
     A*42
     A            @PK042         3Y 0O 11 40
     A            @SK042         2   B 11 47DSPATR(CS)
     A  52                                  DSPATR(RI PC)
     A            @SN042        20   O 11 52
     A*43
     A            @PK043         3Y 0O 12  3
     A            @SK043         2   B 12 10DSPATR(CS)
     A  53                                  DSPATR(RI PC )
     A            @SN043        20   O 12 15
     A*44
     A            @PK044         3Y 0O 12 40
     A            @SK044         2   B 12 47DSPATR(CS)
     A  54                                  DSPATR(RI PC)
     A            @SN044        20   O 12 52
     A*45
     A            @PK045         3Y 0O 13  3
     A            @SK045         2   B 13 10DSPATR(CS)
     A  55                                  DSPATR(RI PC )
     A            @SN045        20   O 13 15
     A*46
     A            @PK046         3Y 0O 13 40
     A            @SK046         2   B 13 47DSPATR(CS)
     A  56                                  DSPATR(RI PC)
     A            @SN046        20   O 13 52
     A*47
     A            @PK047         3Y 0O 14  3
     A            @SK047         2   B 14 10DSPATR(CS)
     A  57                                  DSPATR(RI PC )
     A            @SN047        20   O 14 15
     A*48
     A            @PK048         3Y 0O 14 40
     A            @SK048         2   B 14 47DSPATR(CS)
     A  58                                  DSPATR(RI PC)
     A            @SN048        20   O 14 52
     A*49
     A            @PK049         3Y 0O 15  3
     A            @SK049         2   B 15 10DSPATR(CS)
     A  59                                  DSPATR(RI PC )
     A            @SN049        20   O 15 15
     A*50
     A            @PK050         3Y 0O 15 40
     A            @SK050         2   B 15 47DSPATR(CS)
     A  60                                  DSPATR(RI PC)
     A            @SN050        20   O 15 52
     A*51
     A            @PK051         3Y 0O 16  3
     A            @SK051         2   B 16 10DSPATR(CS)
     A  61                                  DSPATR(RI PC )
     A            @SN051        20   O 16 15
     A*52
     A            @PK052         3Y 0O 16 40
     A            @SK052         2   B 16 47DSPATR(CS)
     A  62                                  DSPATR(RI PC)
     A            @SN052        20   O 16 52
     A*53
     A            @PK053         3Y 0O 17  3
     A            @SK053         2   B 17 10DSPATR(CS)
     A  63                                  DSPATR(RI PC )
     A            @SN053        20   O 17 15
     A*54
     A            @PK054         3Y 0O 17 40
     A            @SK054         2   B 17 47DSPATR(CS)
     A  64                                  DSPATR(RI PC)
     A            @SN054        20   O 17 52
     A*55
     A            @PK055         3Y 0O 18  3
     A            @SK055         2   B 18 10DSPATR(CS)
     A  65                                  DSPATR(RI PC )
     A            @SN055        20   O 18 15
     A*56
     A            @PK056         3Y 0O 18 40
     A            @SK056         2   B 18 47DSPATR(CS)
     A  66                                  DSPATR(RI PC)
     A            @SN056        20   O 18 52
     A*57
     A            @PK057         3Y 0O 19  3
     A            @SK057         2   B 19 10DSPATR(CS)
     A  67                                  DSPATR(RI PC )
     A            @SN057        20   O 19 15
     A*58
     A            @PK058         3Y 0O 19 40
     A            @SK058         2   B 19 47DSPATR(CS)
     A  68                                  DSPATR(RI PC)
     A            @SN058        20   O 19 52
     A*59
     A            @PK059         3Y 0O 20  3
     A            @SK059         2   B 20 10DSPATR(CS)
     A  69                                  DSPATR(RI PC )
     A            @SN059        20   O 20 15
     A*60
     A            @PK060         3Y 0O 20 40
     A            @SK060         2   B 20 47DSPATR(CS)
     A  70                                  DSPATR(RI PC)
     A            @SN060        20   O 20 52
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI BL)
     A  99        @ERR2         60     22 18
     A                                 24  4'PRV.SCREEN'
     A                                 24 16' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 24'UPDATE OK'
     A                                 24 35' CMD-5 '
     A                                      DSPATR(RI)
