      ** RATPW01 ***********************************************
      *   UPDATE OF IAF RATE FILE.                             *
      *     DISPLAY-FILE.     : RATPW01                        *
      *     CREATE DATE.      : JUL/02/1997.                   *
      *     AUTHOR.           : S.OHTAKE.                      *
      **********************************************************
     A                                      CHGINPDFT
     A                                      PRINT
      *-------------------------------------*
      *         .....SCREEN 1.....           *
      *-------------------------------------*
     A          R RATPW011
     A                                      CF01
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT RATPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 30'*** UPDATE OF IAF RATE FILE +
     A                                       ***'
     A                                      DSPATR(RI)
      *
     A                                  6 16' UPDATE '
     A                                      DSPATR(UL)
     A            KBN            1A  B  8 19DSPATR(CS)
     A                                      OVRDTA
     A                                      OVRATR
     A  01                                  DSPATR(PC RI)
     A                                 10  9'+--------------+'
     A                                 11  9'| 0- CANCEL    |'
     A                                 12  9'| 1- CHANGE    |'
     A                                 13  9'| 2- ADD       |'
     A                                 14  9'+--------------+'
      *
     A                                  6 28'CURRENCY CODE'
     A                                      DSPATR(UL)
     A            CODE           3   B  8 31DSPATR(CS) OVRDTA
     A  02                                  DSPATR(RI PC)
      *
     A                                  6 50'RANGE DATE'
     A                                      DSPATR(UL)
     A            TEYY           4Y 0B  8 50DSPATR(CS) OVRDTA
     A                                      EDTCDE(Z)
     A  03                                  DSPATR(RI PC)
     A                                  8 55'-'
     A            TEMM           2Y 0B  8 57DSPATR(CS) OVRDTA
     A                                      EDTCDE(Z)
     A  03                                  DSPATR(RI)
      *
     A                                 22 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60   O 22 20OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24  4' END '
     A                                 24 15' CMD-1 '
     A                                      DSPATR(RI)
      *-------------------------------------*
      *         .....SCREEN 2.....          *
      *-------------------------------------*
     A          R RATPW012
     A                                      CF03
     A                                      CF05
     A  99                                  ALARM
     A                                      BLINK PUTOVR KEEP
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 69'FMT RATPW01'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 30'*** UPDATE OF IAF RATE FILE +
     A                                       ***'
     A                                      DSPATR(RI)
      *
     A                                  4 17'UPDATE'
     A                                      DSPATR(UL)
     A            KBNNM          6   O  5 17DSPATR(HI)
     A                                  4 28'CURRENCY CODE'
     A                                      DSPATR(UL)
     A            CODE           3   O  5 31DSPATR(HI)
     A                                  4 45'RENGE DATE'
     A                                      DSPATR(UL)
     A            TEYY           4  0O  5 45DSPATR(HI)
     A                                  5 50'-'
     A            TEMM           2  0O  5 52DSPATR(HI)
      *
     A                                  8 35'CURRENCY RATE'
     A                                      DSPATR(UL)
     A            RATE          10Y 5B 10 36OVRDTA OVRATR
     A                                      EDTCDE(3)
     A                                      DSPATR(CS)
     A                                      AUTO(RAB)
     A  10                                  DSPATR(RI PC)
     A  50                                  DSPATR(PR)
      *
     A                                 23 10'ERROR'
     A                                      OVRATR
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A            MSG           60   O 23 20OVRATR
     A                                      OVRDTA
     A N99                                  DSPATR(ND)
     A  99                                  DSPATR(HI)
     A  99                                  DSPATR(BL)
     A                                 24 24'PRV.SCREEN'
     A                                 24 35' CMD-3 '
     A                                      DSPATR(RI)
     A                                 24 44'UPDATE OK'
     A                                 24 55' CMD-5 '
     A                                      DSPATR(RI)
