     A***RCLPW11********************************************
     A*           PRODUCT DEMAND FORECAST DATA INPUT SCREEN
     A*           '84.07.05               N.SHIBAYAMA *
     A******************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A          R RCLPW111
     A                                      TEXT('PRODUCT DEMAND FORECAST DATAI-
     A                                      NPUT')
     A                                      CF01
     A                                  1 17'PROD DEMAND FORECAST(BESIDES DELV -
     A                                      INST)DATA INPUT'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT RCLPW111'
     A                                  2  2'PROD ORDER NO'
     A                                      DSPATR(RI)
     A                                  3  2'INPUT.......COUNT'
     A                                      DSPATR(UL)
     A                                  4  2'LIMITATION..COUNT'
     A                                      DSPATR(UL)
     A                                  5  2'TRIAL MFG...COUNT'
     A                                      DSPATR(UL)
     A            TNO1           4A  O  2 20
     A            TNO2           3Y 0O  3 21EDTCDE(Z)
     A            TNO3           3Y 0O  4 21EDTCDE(Z)
     A            TNO4           3Y 0O  5 21EDTCDE(Z)
     A                                  7  9'CUSTOMER  F  RECEIVING'
     A                                      DSPATR(UL)
     A                                  7 34'DELV  F  RECEIVING'
     A                                      DSPATR(UL)
     A                                  7 54'USER PART NUMBER'
     A                                      DSPATR(UL)
     A            TSAKI          4Y 0B  9 13DSPATR(CS)
     A                                      EDTCDE(4)
     A            TF             1A  B  9 19DSPATR(CS)
     A            TUKE           4A  B  9 22DSPATR(CS)
     A            NSAKI          4Y 0B  9 34DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      DSPATR(PC)
     A            NF             1A  B  9 40DSPATR(CS)
     A            NUKE           4A  B  9 43DSPATR(CS)
     A            UHINB         15A  B  9 54DSPATR(CS)
     A  90                             22  6'ERROR'
     A                                      DSPATR(RI)
     A  90        MSG           60A  O 22 16
     A                                 24 11'INPUT EXIT'
     A                                 24 23'CMD-1'
     A                                      DSPATR(RI)
     A          R RCLPW112
     A                                      TEXT('PRODUCT DEMAND FORECAST DATAI-
     A                                      NPUT')
     A                                      CF03
     A                                      CF05
     A                                  1 13'PROD DEMAND FORECAST (BESIDES DELV-
     A                                       INST) DATA INPUT'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 68'FMT RCLPW112'
     A                                  2  2'PROD ORDER NO'
     A                                      DSPATR(RI)
     A            TNO1           4A  O  2 20
     A                                  3  2'INPUT.......COUNT'
     A                                      DSPATR(UL)
     A            TNO2           3Y 0O  3 21EDTCDE(Z)
     A                                  4  2'LIMITATION..COUNT'
     A                                      DSPATR(UL)
     A            TNO3           3Y 0O  4 21EDTCDE(Z)
     A            TYPE           7A  O  3 40DSPATR(HI)
     A            TMEI          15A  O  3 60
     A                                  5  2'TRIAL MFG...COUNT'
     A                                      DSPATR(UL)
     A            TNO4           3Y 0O  5 21EDTCDE(Z)
     A                                  7 10'CUSTOMER F  RCV'
     A                                      DSPATR(UL)
     A                                  7 28'DELIVERY F  RCV'
     A                                      DSPATR(UL)
     A                                  7 46'USER PART NUMBER'
     A                                      DSPATR(UL)
     A                                  7 64'INT CO. PART NO'
     A                                      DSPATR(UL)
     A            TSAKI          4Y 0O  9 12
     A            TF             1A  O  9 19
     A            TUKE           4A  O  9 22
     A            NSAKI          4Y 0O  9 30
     A            NF             1A  O  9 36
     A            NUKE           4A  O  9 39
     A            UHINB         15A  O  9 46
     A            USYHIN        14A  O  9 64DSPATR(HI)
     A                                 13 18'QUANTITY'
     A                                      DSPATR(UL)
     A                                 13 30'DELV DATE'
     A                                      DSPATR(UL)
     A                                 12 43'SAFEKEEPING'
     A                                 13 43'TIME LIMIT'
     A                                      DSPATR(UL)
     A                                 13 57'IN CHARGE'
     A                                      DSPATR(UL)
     A            SRY            7Y 0B 15 18DSPATR(CS)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A  95                                  DSPATR(RI)
     A            NOKI           8Y 0B 15 31DSPATR(CS)
     A                                      EDTCDE(4)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A            HOKAN          8Y 0B 15 45DSPATR(CS)
     A                                      EDTCDE(4)
     A            TAN            4A  B 15 57DSPATR(CS)
     A                                 17 19'TAG'
     A                                      DSPATR(UL)
     A                                 17 23'DATA'
     A                                      DSPATR(UL)
     A                                 17 28'STANDARD'
     A                                      DSPATR(UL)
     A                                 17 37'MANAGEMENT NO'
     A                                      DSPATR(UL)
     A                                 17 53'SPECIAL NOTICE'
     A                                      DSPATR(UL)
     A            EFU            1A  B 19 20DSPATR(CS)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A            DATA           1A  B 19 25DSPATR(CS)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A            KJYN           1A  B 19 31DSPATR(CS)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A            KBAN          10A  B 19 38DSPATR(CS)
     A            BIKO          15A  B 19 53DSPATR(CS)
     A  90                             22 11'ERROR'
     A                                      DSPATR(RI)
     A  90        MSG           60A  O 22 17
     A                                 24 11'KEY INPUT'
     A                                 24 22'CMD-3'
     A                                      DSPATR(RI)
     A                                 24 32'INPUT OK'
     A                                 24 42'CMD-5'
     A                                      DSPATR(RI)
