     A*%%TS  SD  20190509  144642  I0777       REL-V7R3M0  5770-WDS
     A** UAAPW04 ******************************************************
     A*  SORT TURN# TABLE MAINTENANCE (AAHPPS5)                       *
     A*  JW   2019.05.09
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*-------------------------------------
     A          R DSP01
     A*%%TS  SD  20190509  144642  I0777       REL-V7R3M0  5770-WDS
     A                                      CF01
     A                                      CF12
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** SORT TURN# TABLE MAINTENANCE **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT UAAPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 30'SORT LINE#'
     A                                      DSPATR(UL)
     A*
     A            D1KBN          1A  B  7 22DSPATR(CS)
     A  21                                  DSPATR(PC)
     A  21                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A*
     A            D1SRT#         2Y 0B  7 33TEXT('SORT LINE#')
     A                                      DSPATR(CS)
     A  22                                  DSPATR(PC)
     A  22                                  DSPATR(RI)
     A                                      EDTCDE(1)
     A*
     A                                 10 22'0- CANCEL '
     A                                 11 22'1- CHANGE '
     A                                 12 22'2- ADD    '
     A            XMSG          60A  O 22 18COLOR(WHT)
     A*
     A                                 24  4' F1 '
     A                                      DSPATR(RI)
     A                                 24  9'EXIT'
     A                                 24 66' F12 '
     A                                      DSPATR(RI)
     A                                 24 72'INQUIRY'
     A*-------------------------------------
     A          R DSP02
     A*%%TS  SD  20190509  144642  I0777       REL-V7R3M0  5770-WDS
     A                                      CF03
     A                                      CF05
     A                                      BLINK
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 20'** SORT TURN# TABLE MAINTENANCE **'
     A                                      DSPATR(RI)
     A                                  1 68'FMT UAAPW04'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTWRD('0  .  .  ')
     A*
     A                                  5 20'UPDATE'
     A                                      DSPATR(UL)
     A                                  5 30'SORT LINE#'
     A                                      DSPATR(UL)
     A*
     A            D2KBN          8A  O  7 20COLOR(YLW)
     A            D1SRT#         2S 0O  7 33TEXT('PLANT ID')
     A                                      COLOR(YLW)
     A                                 11 23'TURN#'
     A                                      DSPATR(UL)
     A            D2TRN#         6Y 0B 13 22TEXT('TURN#')
     A  31                                  DSPATR(PC)
     A  31                                  DSPATR(RI)
     A  30                                  DSPATR(PR)
     A                                      EDTCDE(1)
     A                                      DSPATR(UL)
     A                                      COLOR(TRQ)
     A*
     A            XMSG          60A  O 22 18COLOR(WHT)
     A*
     A                                 24  4' F3 '
     A                                      DSPATR(RI)
     A                                 24  9'PREV. SCREEN'
     A                                 24 25' F5 '
     A                                      DSPATR(RI)
     A                                 24 30'UPDATE   '
