     A                                      CHGINPDFT
     A                                      PRINT(QPRINT)
     A          R SCR1
     A                                      TEXT('HEADER SCREEN -1')
     A                                      SETOFF(99)
     A  99                                  ALARM
     A  99                                  PUTOVR
     A                                      CA01
     A                                  1 21'  COMMON PART MASTERING-
     A                                       INQUIRY  '
     A                                      DSPATR(RI)
     A                                  1 65DATE EDTCDE(Y)
     A                                 02 02'CUSTOMER'
     A                                      DSPATR(HI)
     A            WSKY01       004Y00B 03 02DSPATR(CS)
     A                                 02 12'DELIVERY'
     A                                      DSPATR(HI)
     A            WSKY02       004Y00B 03 12DSPATR(CS)
     A                                 02 23'F'
     A                                      DSPATR(HI)
     A            WSKY03       001   B 03 23DSPATR(CS)
     A                                 02 27'DOCK'
     A                                      DSPATR(HI)
     A            WSKY04       004   B 03 27DSPATR(CS)
     A                                 02 34'CUSTOMER PART NO.'
     A                                      DSPATR(HI)
     A            WSKY05       005   B 03 34DSPATR(CS)
     A            WSKY06       005   B 03 40DSPATR(CS)
     A            WSKY07       005   B 03 46DSPATR(CS)
     A            WSKY08       005   B 03 52DSPATR(CS)
     A                                 24  5'EXIT'
     A                                 24 13'CMD-1'
     A                                      DSPATR(RI)
     A  99        ERRMSG        78   M
     A  99                                  OVRDTA
     A
     A          R SCR2
     A                                      TEXT('HEADER SCREEN 1/1')
     A                                      LOCK
     A                                  1 21'  COMMON PART MASTERING-
     A                                       INQUIRY  '
     A                                      DSPATR(RI)
     A                                  1 65DATE EDTCDE(Y)
     A                                 02 02'CUSTOMER'
     A                                      DSPATR(HI)
     A            WSKY01       004Y00  03 02DSPATR(CS)
     A                                 02 12'DELIVERY'
     A                                      DSPATR(HI)
     A            WSKY02       004Y00  03 12DSPATR(CS)
     A                                 02 23'F'
     A                                      DSPATR(HI)
     A            WSKY03       001     03 23DSPATR(CS)
     A                                 02 27'DOCK'
     A                                      DSPATR(HI)
     A            WSKY04       004     03 27DSPATR(CS)
     A                                 02 34'CUSTOMER PART NO.'
     A                                      DSPATR(HI)
     A            WSKY05       005     03 34DSPATR(CS)
     A            WSKY06       005     03 40DSPATR(CS)
     A            WSKY07       005     03 46DSPATR(CS)
     A            WSKY08       005     03 52DSPATR(CS)
     A                                 04 12'CUSTOMER'
     A                                      DSPATR(HI)
     A                                 04 21'DELIVERY'
     A                                      DSPATR(HI)
     A                                 04 30'F'
     A                                      DSPATR(HI)
     A                                 04 35'DOCK'
     A                                      DSPATR(HI)
     A                                 04 41'CUSTMER PART NO.'
     A                                      DSPATR(HI)
     A                                 04 64'PART NO.'
     A                                      DSPATR(HI)
     A          R SFLREC                    SFL
     A                                      TEXT('SUB FILE RECORD')
     A            B7TOKU       004Y00O 05 14
     A            B7NONY       004Y00O 05 22
     A            B7NKJO       001   O 05 30
     A            B7NUKE       004   O 05 35
     A            B7MHN1       005   O 05 41
     A            B7MHN2       005   O 05 47
     A            B7MHN3       005   O 05 53
     A            B7MHN4       005   O 05 59
     A            B7SHN1       005   O 05 65
     A            B7SHN2       005   O 05 71
     A            B7SHN3       002   O 05 77

     A          R SFLCTL                    SFLCTL(SFLREC)
     A                                      TEXT('SUB FILE CONTROL RECORD')
     A                                      OVERLAY
     A  99                                  PUTOVR
     A  99                                  ALARM
     A                                      SETOF(94)
     A                                      SETOF(99)
     A                                      CA01 CA02
     A                                      SFLPAG(19)
     A                                      SFLSIZ(19)
     A                                      SFLRNA
     A  98                                  SFLDSPCTL
     A  97                                  SFLDSP
     A  96                                  SFLCLR
     A  95                                  SFLINZ
     A  94                                  SFLEND
     A                                      ROLLUP(91) ROLLDOWN(92)
     A                                 24  3'EXIT'
     A                                 24  8'CMD-1'
     A                                      DSPATR(RI)
     A                                 24 15'FIRST SCREEN'
     A                                 24 28'CMD-2'
     A                                      DSPATR(RI)
     A                                 24 35' NEXT PAGE'
     A                                 24 46'RL-UP'
     A                                      DSPATR(RI)
     A                                 24 54' PREVIOUS PAGE'
     A                                 24 69'RL-DN'
     A                                      DSPATR(RI)
     A  99        ERRMSG        78   M
     A  99                                  OVRDTA
