     A*%%TS  SD  20160317  120811  I0777       REL-V7R1M0  5770-WDS
     A** UAAPW00 *******************
     A* ..PARTS NUMBER REFARENCE.. *
     A*    K.YASUDA    1999.09.17  *
     A******************* UAAPW00 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A*
     A          R UAAPW001
     A*%%TS  SD  20160317  120811  I0777       REL-V7R1M0  5770-WDS
     A                                      CF01(01)
     A                                      BLINK
     A                                      KEEP
     A*
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A                                  1 23' **  PARTS NUMBER REFERENCE **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT'
     A                                  1 73'UAAPW00'
     A*
     A                                  6 31' 1 '
     A                                  6 35'CUSTOMER PART NO.'
     A                                  8 31' 2 '
     A                                  8 35'IAF PART NO.'
     A                                 10 31' 3 '
     A                                 10 35'COMMON PART MASTER'
     A*
     A            NO1            1A  B 12 31DSPATR(CS)
     A  10                                  DSPATR(RI)
     A  10                                  DSPATR(PC)
     A                                 12 33'-->INPUT NO.'
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18
     A*
     A                                 24  3'EXIT'
     A                                 24 15'CMD-1'
