     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03
     A* ----------------------------------------------------
     A          R DSP01
     A                                      OVERLAY
     A                                  1  3' Test QR to Barcode '
     A                                      DSPATR(RI)
     A            #PGM           8A  O  1 72
     A  99        MSG           60A  O 14  3
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(BL)
     A                                 17  4'F3:Back'
     A                                      DSPATR(RI)
     A                                  3  2'<< Scan Kanban QR Code >>'
     A            QR           512A  B  5  1COLOR(WHT)
