     A*%%TS  SD  20240528  113027  I0777       REL-V7R4M0  5770-WDS
     A** UTLPW962 **********************************
     A*  DISPLAY MESSAGE - 30A X 2 LINES           *
     A*  JW    2023.06.28                          *
     A**********************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R DSP01
     A*%%TS  SD  20240528  113027  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF12(12)
     A                                  1  4'UTLPW97A'
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  7  7'**********************************-
     A                                      ******************************'
     A                                  8  7'*'
     A                                  8 70'*'
     A                                  9  7'*'
     A            XLIN1         60A  O  9  9COLOR(WHT)
     A                                  9 70'*'
     A                                 10  7'*'
     A                                 10 70'*'
     A                                 11  7'*'
     A            XLIN2         60A  O 11  9COLOR(WHT)
     A                                 11 70'*'
     A                                 12  7'*'
     A                                 12 70'*'
     A                                 13  7'* Press ENTR to end job...        -
     A                                                                   *'
     A                                 14  7'**********************************-
     A                                      ******************************'
     A                                 24  8'ENTR:'
     A                                      DSPATR(RI)
     A                                 24 14'EXIT'
