     A*%%TS  SD  20250211  084902  I0777       REL-V7R4M0  5770-WDS
     A** UTLPW97B ****************************************
     A*  DISPLAY CAUTION - PRINT LABEL MORE THAN ONCE    *
     A*  JW    2025.01.21                                *
     A****************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R DSP01
     A*%%TS  SD  20250211  084902  I0777       REL-V7R4M0  5770-WDS
     A                                  1  4'UTLPW97B'
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  4  7'**********************************-
     A                                      ********************************'
     A                                  5  7'*                                 -
     A                                                                     *'
     A                                  6  7'*'
     A                                  6 10'** CAUTION **'
     A                                      COLOR(WHT)
     A                                  6 72'*'
     A                                  7  7'*                                 -
     A                                                                     *'
     A                                  8  7'*   You are attempting to select p-
     A                                      rint labels more than once.    *'
     A                                  9  7'*  This program will update the Se-
     A                                      rial#.                         *'
     A                                 10  7'*  Please discard all the old labe-
     A                                      ls you have printed previously *'
     A                                 11  7'*  and do not use them again.     -
     A                                                                     *'
     A                                 12  7'*                                 -
     A                                                                     *'
     A                                 13  7'*   Or if you intend to re-print w-
     A                                      ith the same Serial#,          *'
     A                                 14  7'*  cancel this program and use oth-
     A                                      er Reprint Program.            *'
     A                                 15  7'*                                 -
     A                                                                     *'
     A                                 16  7'*'
     A                                 16 11'Reply -->'
     A                                      COLOR(YLW)
     A            XANS           1A  B 16 21DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 16 24'(C: Cancel, P: Select labels with -
     A                                      new serial#)'
     A                                      COLOR(YLW)
     A                                 16 72'*'
     A                                 17  7'*                                 -
     A                                                                     *'
     A                                 18  7'**********************************-
     A                                      ********************************'
     A            XMSG          60A  O 22  8COLOR(WHT)
     A                                 24  8'ENTR:'
     A                                      DSPATR(RI)
     A                                 24 14'PROCESS'
