     A*%%TS  SD  20240104  110352  I0777       REL-V7R4M0  5770-WDS
     A** UTLPW69B ******************************************
     A*  UTILITY- SELECT PRINTER OPTION WITH DOWNLOAD      *
     A*  J.WATANABE  2024.01.04                            *
     A******************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A          R DSP01
     A*%%TS  SD  20240104  110352  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01
     A                                      CF05
     A                                  1  3'UTLPW69B'
     A                                  1 28'** Select Printer **'
     A                                      DSPATR(RI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  2  3USER
     A                                  6  8'Select Printer --->'
     A            XOPT           1A  B  6 28DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  8 28'1. GREEN BAR.....(QPRINTC)'
     A                                      COLOR(WHT)
     A                                  9 28'2. APICS ROOM 1..(LANPRT02)'
     A                                      COLOR(WHT)
     A                                 10 28'3. APICS ROOM 2..(LANPRT07)'
     A                                      COLOR(WHT)
     A                                 11 28'4. OFFICE........(LANPRT03)'
     A                                      COLOR(WHT)
     A                                 12 28'5. G/L ROOM......(LANPRT04)'
     A                                      COLOR(WHT)
     A                                 13 28'6. SHIPPING......(LANPRT06)'
     A                                      COLOR(WHT)
     A                                 14 28'7. COMPUTER ROOM.(QPRINT)'
     A                                      COLOR(WHT)
     A                                 17 28'X. DOWNLOAD to CSV'
     A                                      COLOR(WHT)
     A            XMSG          60A  O 19  8COLOR(YLW)
     A                                 24  8'F1:'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 24 12'CANCEL JOB'
     A                                      COLOR(BLU)
     A                                 24 30'F5:'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 24 34'RUN'
     A                                      COLOR(BLU)
