     A*%%TS  SD  20250630  094224  I0777       REL-V7R4M0  5770-WDS
     A** VJBPW63 ***********************************
     A*  FILE REFORMATION MASTER REFORM-REFERENCE  *
     A*    I-HASADA            87.11.04            *
     A*************************** VJBPW13 **********
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A*
     A          R VJBPW631
     A*%%TS  SD  20250630  094224  I0777       REL-V7R4M0  5770-WDS
     A                                      CF01(01)
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  1 18'** FILE REFORMATTING MENU **'
     A                                      DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  1 69'FMT VJBPW63'
     A                                  2  2'DATE'
     A                                  2  7DATE
     A                                      EDTCDE(Y)
     A*
     A                                  5 19' 1 '
     A                                      DSPATR(RI)
     A                                  5 23' FILE REFORMAT MASTER MAINTENANCE -
     A                                      (VJBR61)'
     A                                  7 19' 2 '
     A                                      DSPATR(RI)
     A                                  7 23' FILE REFORMATTING                -
     A                                      (VJBR62)'
     A                                  9 19' 3 '
     A                                      DSPATR(RI)
     A                                  9 23' FILE NAME TABLE MAINTENANCE      -
     A                                      (AJBC25)'
     A*
     A            WNO            1A  B 16 23DSPATR(CS)
     A  99                                  DSPATR(RI)
     A                                 16 26'<-- ENTER OPTION'
     A*
     A  99                             22 11'ERROR'
     A                                      DSPATR(RI)
     A                                      DSPATR(BL)
     A  99        MSG           60A  O 22 18
     A                                 24 11'F1:'
     A                                      DSPATR(RI)
     A                                 24 15'END'
