     A** VVVPWY1 *************************************
     A*ソースレベルアンマッチ表示                  *
     A*    T.SAKASHITA                 2012.06.01    *
     A************************************* VVVPWP1 **
     A                                      PRINT
     A                                      CHGINPDFT
      *
     A          R VVVPWY11
      *
     A                                  1  2'TIME'
     A                                  1  7TIME
     A                                  2  2'DATE'
     A                                  2  7DATE EDTWRD('0  /  /  ')
     A                                  1 17' **  PROGRAM SRC & OBJ LEVEL CHK+
     A                                      ** '
     A                                      DSPATR(RI UL)
     A                                  1 69'FMT VVVPWY1'
      *
     A            P@LIBL        10A     5 19
     A                                   + 1'/'
     A            P@FILE        10A      + 1
     A                                   + 1'/'
     A            P@MBR         10A      + 1
      *
     A                                  7 19'SRC'
     A            P@SRCD         6A      + 1
     A            P@SRCT         6A      + 1
      *
     A                                  9 19'OBJ'
     A            P#SRCD         6A      + 1
     A            P#SRCT         6A      + 1
      *
     A  99                             22 11' d[- ' DSPATR(RI BL)
     A  99        MSG           60A  O 22 18
      *
