     A*%%TS  SD  20240220  163435  I0777       REL-V7R4M0  5770-WDS
     A** AB#PW0F ******************************************************
     A*  ..CREATE ASN DATA                                            *
TCHK1A*
TCHK1A* AUG.25.05 ADD *IN55 FOR GM-SPO
     A****************************************************** AB#PW38 **
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT
     A                                      PRINT
     A                                      CF01(01)
     A                                      CF03(03)
     A                                      CF05(05)
     A                                      CF12(12)
     A          R DSP01
     A*%%TS  SD  20240220  163435  I0777       REL-V7R4M0  5770-WDS
     A                                      INVITE
     A                                  1  2'VVVPW23'
     A                                  1 17'** Copy PFs to TFILE1 by Ship Date-
     A                                       **'
     A                                      DSPATR(RI)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  6 14'Enter Ship Date:'
     A                                      COLOR(WHT)
     A            XDATE          8A  B  6 31DSPATR(CS)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                  6 40'YYYYMMDD'
     A                                      COLOR(YLW)
     A            XGEFLG         1A  B  8 31DSPATR(CS)
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A                                  8 38'(Y/N : Copy data greater than abov-
     A                                      e date)'
     A                                      COLOR(YLW)
     A                                 10 14'** Files To Be Copied **'
     A                                      COLOR(WHT)
     A                                 11 17'#1 AB#PP10'
     A                                      COLOR(YLW)
     A                                 11 30'#10 AB#PP40'
     A                                      COLOR(YLW)
     A                                 11 57'== Others =='
     A                                      COLOR(YLW)
     A                                 12 17'#2 AB#PP2A'
     A                                      COLOR(YLW)
     A                                 12 30'#11 AB#PP41'
     A                                      COLOR(YLW)
     A                                 12 57'* AB#PPCT'
     A                                      COLOR(YLW)
     A                                 13 17'#3 AB#PP2F'
     A                                      COLOR(YLW)
     A                                 13 30'#12 AB#PP42'
     A                                      COLOR(YLW)
     A                                 13 57'* AB#PP85'
     A                                      COLOR(YLW)
     A                                 14 17'#4 AB#PP70'
     A                                      COLOR(YLW)
     A                                 14 30'#13 AB#PP43'
     A                                      COLOR(YLW)
     A                                 14 57'* FCCPP11'
     A                                      COLOR(YLW)
     A                                 15 17'#5 AB#PP75'
     A                                      COLOR(YLW)
     A                                 15 30'#14 AB#PP44'
     A                                      COLOR(YLW)
     A                                 15 57'* AB#EP00'
     A                                      COLOR(YLW)
     A                                 16 17'#6 AB#PP78'
     A                                      COLOR(YLW)
     A                                 16 30'#15 AB#PP47'
     A                                      COLOR(YLW)
     A                                 16 57'* AGDPP11'
     A                                      COLOR(YLW)
     A                                 17 17'#7 AB#PPA1'
     A                                      COLOR(YLW)
     A                                 17 57'* EDIPP45'
     A                                      COLOR(YLW)
     A                                 18 17'#8 ABF4P01'
     A                                      COLOR(YLW)
     A                                 19 17'#9 ABF6P01'
     A                                      COLOR(YLW)
     A            MSG           60A  O 22 14COLOR(WHT)
     A                                 24 11'F1:'
     A                                      DSPATR(RI)
     A                                 24 15'EXIT'
     A                                 24 24'F5:'
     A                                      DSPATR(RI)
     A                                 24 28'START COPY'
