     H            Y.
     F** INQR01 ********************************************
     F*  EDI SHIPPING LEAD TIME TABLE INQ                  *
     F*  J.W     2024.07.08                                *
     F*----------------------------------------------------*
     F*  MANTENANCE PROGRAM FOR AB#EP02 IS EDIR74          *
     F******************************************************
     FINQPW01ACF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFL01
     FAB#EP02 IF  E           K        DISK
      *****************************************************
     E                    MSG     1   1 60
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  120@TODAY
     C*===============================================================
     C                     MOVE '#INIT   '@STEP   8
      *
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
      * DSPLAY SCREEN 1
     C*===============================================================
     C           #DSP1     BEGSR
      *
     C                     SETON                     70
     C           ENDRRN    IFNE 0
     C                     SETON                     71
     C                     ENDIF
      *
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     7071
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *---------*
      * F3: END *
      *---------*
     C           *INKA     IFEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '#END    '@STEP
     C                     GOTO XDSP1
     C                     ENDIF
      *--------------*
      * PAGE UP/DOWN *
      *--------------*
     C           *IN73     IFEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C                     GOTO XDSP1
     C                     ENDIF
      *-------------*
      * ENTR KEY    *
      *-------------*
     C                     EXSR #SET
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     GOTO XDSP1
      *
     C           XDSP1     ENDSR
     C*===============================================================
     C* SET SUBFILE
     C*===============================================================
     C           #SET      BEGSR
      *  SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     CLEARSFL01
      *
      *-------------------------
     C                     MOVELXNONY     @NONY
      *
     C           @NONY     SETLLAB#EP02
S1   C                     DO   *HIVAL
     C                     READ AB#EP02                  98
     C   98                LEAVE
      *
     C           P2SKJY    IFEQ 'D'
     C**         P2NOTE    OREQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           XNONY     IFNE 0
     C           XNONY     ANDGTP2NONY
     C                     ITER
     C                     ENDIF
      * DETAIL
     C                     Z-ADDP2NONY    S1NONY
     C                     MOVELP2NAME    S1NAME
     C                     Z-ADDP2LDTM    S1LDTM
     C                     MOVELP2CND1    S1CND1
     C                     MOVELP2DAY1    S1DAY1
     C                     MOVELP2DAY2    S1DAY2
     C                     MOVELP2NOTE    S1NOTE
     C                     MOVELP2FLG1    S1FLG1
     C           P2FLG1    IFEQ 'Y'
     C                     MOVE 'YES'     S1FLGX
     C                     ELSE
     C                     MOVE *BLANK    S1FLGX
     C                     ENDIF
      *
     C           P2UPHZ    IFEQ 0
     C                     Z-ADDP2CRHZ    S1KOHZ
     C                     ELSE
     C                     Z-ADDP2UPHZ    S1KOHZ
     C                     ENDIF
      *
     C                     MOVELP2PRTN    S1PRTN
      *
     C                     ADD  1         RRN
     C                     WRITESFL01
E1   C                     ENDDO
      *
     C           RRN       IFEQ 0
     C                     ADD  1         RRN
     C                     MOVELMSG,1     S1NAME
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     Z-ADDRRN       ENDRRN
      *
     C                     ENDSR
     C*===============================================================
     C* INITIAL SETTINGS
     C*===============================================================
     C           #INIT     BEGSR
      *
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           SDATE
     C                     Z-ADD0         @NONY   40
     C*-------------------------
     C                     EXSR #SET
      *
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
      *
     C                     ENDSR
** MSG (60A) ......2.........3.........4.........5.........6
 ** NO DATA EXISTS **
