     H            Y.
     F** INQR05B *******************************************
     F*  USER ID INQ BY NAME                               *
     F*  J.WATANABE  2026.02.25                            *
     F******************************************************
     FINQPW05BCF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFL01
     FRGAPL12 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1   80SBSKHZ
     I                                        1   40SBSKYY
     I                                        5   60SBSKMM
     I                                        7   80SBSKDD
     I            DS
     I                                        1   80J8KOHZ
     I                                        1   40J8KOYY
     I                                        5   60J8KOMM
     I                                        7   80J8KODD
     I            DS
     I                                        1   40J8KOTM
     I                                        1   20J8KOJI
     I                                        3   40J8KOFN
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*  INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ID     5
      *
     C                     MOVEA*ALL'0'   *IN
     C                     MOVEL$ID       K#PL12 15 P
     C                     EXSR #SET
      *
     C                     ENDSR
     C*===============================================================
      *  DISPLAY SCREEN
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTCTL01
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *
     C                     SELEC
      * F1/3/12: END
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '#END    '@STEP
      * F10: BY USER ID
     C           *INKJ     WHEQ *ON
     C                     MOVE *BLANK    PNONY
     C                     CALL 'INQR05A'
     C                     PARM           PNONY   4
      * ENTR
     C                     OTHER
      *
     C           *IN73     IFEQ *OFF
     C                     MOVELD1POS     K#PL12    P
     C                     EXSR #SET
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
     C*===============================================================
     C*  SET SFL
     C*===============================================================
     C           #SET      BEGSR
      *  SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
      *
     C                     Z-ADD0         RRN     40
     C                     MOVE *BLANK    @@UMU   1
      *
     C           K#PL12    SETLLRGAPL12
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ RGAPL12                  90
     C   90                LEAVE
 S2  C           J8SKJY    IFEQ 'D'
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELJ8PROF    S1CODE
     C                     MOVELJ8NAME    S1NAME
     C                     Z-ADDJ8KOHZ    S1KOHZ
     C                     Z-ADDJ8KOTM    S1KOTM
      *
     C                     MOVEL*BLANK    WCODE   7
     C                     MOVEL*BLANK    WNAME  15
     C                     MOVELJ8PROF    WCODE
     C                     MOVELJ8NAME    WNAME
      *
     C                     ADD  1         RRN
     C                     WRITESFL01
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
      *
     C                     ENDSR
