     H            Y.
     F** INQR06  *******************************************
     F*  PACKING LIST OPTION INQ BY DELIVERY CODE          *
     F*  J.WATANABE  2026.03.04                            *
     F******************************************************
     FINQPW06 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFL01
     FAB#PL90 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1   80YAKOHZ
     I                                        1   40YAKOYY
     I                                        5   60YAKOMM
     I                                        7   80YAKODD
     I            DS
     I                                        1   40YAKOTM
     I                                        1   20YAKOHH
     I                                        3   40YAKOSS
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*  INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ID     4
      *
     C                     MOVEA*ALL'0'   *IN
     C                     MOVEL$ID       K#PL09  4
     C                     EXSR #SET
      *
     C                     ENDSR
     C*===============================================================
      *  DISPLAY SREEN
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *-----*
      * END *
      *-----*
     C           *INKA     IFEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '#END    '@STEP
     C                     GOTO XDSP1
     C                     ENDIF
      *
     C           *IN73     IFEQ *OFF
     C                     MOVELD1POS     K#PL09
     C                     EXSR #SET
     C                     ENDIF
      *
     C           XDSP1     ENDSR
     C*===============================================================
      *  SET SFL01
     C*===============================================================
     C           #SET      BEGSR
      *  SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     MOVE *BLANK    @@UMU   1
      *
     C           K#PL09    SETLLAB#PL90
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ AB#PL90                  90
     C   90                LEAVE
 S2  C           YASKJY    IFEQ 'D'
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELYATOKU    S1NONY
      *
     C                     MOVELYATOKU    $DLV
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C                     MOVEL$NAME1    S1NAME
      *
     C                     Z-ADDYAKOHZ    S1KOHZ
     C                     Z-ADDYAKOTM    S1KOTM
     C                     MOVELYAKOME    S1KOME
      *
     C                     MOVELYATYPE    S1TYPE
     C                     Z-ADDYAMXPL    S1MAX
     C                     Z-ADDYAPICK    S1PICK
     C                     Z-ADDYA#MIX    S1MIX
     C                     Z-ADDYACUST    S1CUST
     C                     Z-ADDYA#LAB    S1#LAB
      * RETRIEVE SPLIT FLAG
     C                     CALL 'UTLR52B'
     C                     PARM           $DLV
     C                     PARM           $MIX    1
     C                     MOVEL$MIX      S1MFLG
      *
     C                     ADD  1         RRN
     C                     WRITESFL01
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
      *
     C                     ENDSR
