     H            Y.
     F** INWR04 ********************************************
     F*  WORKER CODE INQ BY NAME                           *
     F*  J.WATANABE  2025.10.23                            *
     F******************************************************
     FINQPW04 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFL01
     FAJSPLCE IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1   80SBSKHZ
     I                                        1   40SBSKYY
     I                                        5   60SBSKMM
     I                                        7   80SBSKDD
     I            DS
     I                                        1   80JAKOHZ
     I                                        1   40JAKOYY
     I                                        5   60JAKOMM
     I                                        7   80JAKODD
     I            DS
     I                                        1   40JAKOTM
     I                                        1   20JAKOHH
     I                                        3   40JAKOSS
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*  INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $ID     5
      *
     C                     MOVEA*ALL'0'   *IN
     C                     MOVEL$ID       K#PL12 20 P
     C                     EXSR #SET
      *
     C                     ENDSR
     C*===============================================================
      *  DISPLAY SCREEN
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTCTL01
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *
     C                     SELEC
      * F1/3/12: END
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C           *INKL     OREQ *ON
     C                     MOVE '#END    '@STEP
      * F10: BY CODE
     C           *INKJ     WHEQ *ON
     C                     MOVE *BLANK    PCODE
     C                     CALL 'INQR03'
     C                     PARM           PCODE   6
      * ENTR
     C                     OTHER
      *
     C           *IN73     IFEQ *OFF
     C                     MOVELXID       K#PL12    P
     C                     EXSR #SET
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
     C*===============================================================
     C*  SET SFL
     C*===============================================================
     C           #SET      BEGSR
      *  SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
      *
     C                     Z-ADD0         RRN     40
     C                     MOVE *BLANK    @@UMU   1
      *
     C           K#PL12    SETLLAJSPLCE
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ AJSPLCE                  90
     C   90                LEAVE
 S2  C           JASKJY    IFEQ 'D'
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELJAWKCD    @CODE
     C                     MOVELJAWKNM    @NAME
     C                     Z-ADDJAKOHZ    @KOHZ
     C                     Z-ADDJAKOTM    @KOTM
     C                     MOVELJAKOME    @KOUS
      *
     C                     MOVEL*BLANK    WCODE   4
     C                     MOVEL*BLANK    WNAME  15
     C                     MOVELJAWKCD    WCODE
     C                     MOVELJAWKNM    WNAME
      *
     C                     ADD  1         RRN
     C                     WRITESFL01
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
      *
     C                     ENDSR
