     H            Y.
     F** VRFR36 ****************************************
     F*  REFORMATION FOR AB#EP40S                      *
     F*  J-WATANABE  CRT 2018.10.08                    *
     F**************************************************
     FAB#EL40SUF  E           K        DISK         KINFDS INF1
     FAB#EP40BO   E           K        DISK
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80LGDATE
     I                                        1   40LGDTYY
     I                                        5   60LGDTMM
     I                                        7   80LGDTDD
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
     C                     MOVE PDATE     XDATE   80
     C           *LOVAL    SETLLAB#EL40S
      * LOOP
     C           *IN90     DOWEQ*OFF
     C                     READ AB#EL40S                 90
     C           *IN90     IFEQ *OFF
      *
     C           ECRDT     IFGT XDATE
     C                     LEAVE
     C                     ELSE
     C                     ADD  1         WDEL    90
     C                     WRITEAB#E40B1
     C                     DELETAB#E40S1
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
