     H            Y.
     F** VRFR39 ****************************************************
     F*  REFORMATION FOR AB#PP70                                   *
     F*  J-WATANABE  CRT 2019.10.08                                *
     F*  ----------------------------------                        *
     F*  * ADD VRFR39  TO UTLC20                                   *
     F*  * ADD AB#PP70 BY OPT#1 (FILE REFORMATION MASTER UPDATE)   *
     F*  * CREATE   AB#PP70O  IN BACKUP                            *
     F*  * CREATE   AB#PP70SV IN BACKUP                            *
     F**************************************************************
     FAB#PL73 UF  E           K        DISK         KINFDS INF1
     F            AB#PP701                          KRENAMEAB#PL731
     FAB#PP70BO   E           K        DISK
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80EKNOHZ
     I                                        1   40EKNOYY
     I                                        5   60EKNOMM
     I                                        7   80EKNODD
      ***************************************************
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
      *
     C                     MOVE PDATE     XDATE   80
      *
     C           *LOVAL    SETLLAB#PL73
      * LOOP
     C                     DO   *HIVAL
     C                     READ AB#PL73                  91
     C   91                LEAVE
      *
     C           EKNOHZ    IFGT XDATE
     C                     LEAVE
     C                     ELSE
     C                     ADD  1         WDEL    90
     C                     WRITEAB#PP701
     C                     DELETAB#PL731
     C                     ENDIF
      *
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
