     H            Y.
     F** VRFR32 **********************************
     F*  REFORMATION FOR AL#PPA1                 *
     F*  HFILE1/AL#PPA1 --> BACKUP/ALPPA1B       *
     F*                                          *
     F*       J-WATANABE             2018.01.17  *
     F********************************************
     FAL#PLA1 UF  E           K        DISK         KINFDS INF1
     FAL#PPA1BO   E                    DISK
     F            AL#PPA11                          KRENAMEAL#PPA1X
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
      *
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
      *
     C                     MOVE PDATE     XDATE   80
     C           *LOVAL    SETLLAL#PLA1
      * LOOP
     C           *IN90     DOWEQ*OFF
     C                     READ AL#PLA1                  90
     C           *IN90     IFEQ *OFF
     C           CRFIXD    IFLE XDATE
     C           CRKOHZ    ANDLEXDATE
     C                     WRITEAL#PPA1X
     C                     DELETAL#PLA11
     C                     ADD  1         WDEL    90
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
