     H            Y.
     F** VRFR37 ****************************************
     F*  REFORMATION FOR ADKPP01                       *
     F*  J-WATANABE  CRT 2018.12.13                    *
     F**************************************************
     FADKPL02 UF  E           K        DISK         KINFDS INF1
     FADKPP01BO   E           K        DISK
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80D0THHZ
     I                                        1   40D0THYY
     I                                        5   60D0THMM
     I                                        7   80D0THDD
      ***************************************************
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9
     C                     PARM           PREC2   9
      *
     C                     MOVE PDATE     XDATE   80
      *
     C           *LOVAL    SETLLADKPL02
      * LOOP
     C                     DO   *HIVAL
     C                     READ ADKPL02                  91
     C   91                LEAVE
      *
     C           D0THHZ    IFGT XDATE
     C                     LEAVE
     C                     ELSE
     C                     ADD  1         WDEL    90
     C                     WRITEADKPP011
     C                     DELETADKPL021
     C                     ENDIF
      *
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
