     H            Y.
     F** VRFR21 ****************************************
     F*  REFORMATION FOR AJVPPLG                       *
     F*  J-WATANABE  CRT 2016.07.15                    *
     F**************************************************
     FAJVPPLG UF  E           K        DISK         KINFDS INF1
     FAJVPPLGBO   E           K        DISK
     F            AJVPPLG1                          KRENAMEAJVPPLGX
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80LGDATE
     I                                        1   40LGDTYY
     I                                        5   60LGDTMM
     I                                        7   80LGDTDD
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC1   9        BEFORE
     C                     PARM           PREC2   9        AFTER
      *
     C                     MOVE PDATE     XDATE   80
     C           *LOVAL    SETLLAJVPPLG
      * LOOP
     C           *IN90     DOWEQ*OFF
     C                     READ AJVPPLG                  90
     C           *IN90     IFEQ *OFF
      *
     C           LGDATE    IFGT XDATE
     C                     LEAVE
     C                     ELSE
     C                     ADD  1         WDEL    90
     C                     WRITEAJVPPLGX
     C                     DELETAJVPPLG1
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC1
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PREC2
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
