     H            Y.
     F** VRFR50 **************************************************
     F*  REFORMAT AND SAVE ABF6P01                               *
     F*  J.WATANABE      2022.11.10                              *
     F*  FUNCTION: PURGE RECORD BY DESIGNATED DATE               *
     F*          : PURGED RECORD WILL BE MOVED OUT TO  ABF6P01B  *
     F*----------------------------------------------------------*
     F*  IN  $DATE: 8A DATE (YYYYMMDD) PURGE IF A6NYMD =< $DATE
     F*  OUT $BFR : 9A RECORD BEFORE RUN
     F*      $AFR : 9A RECORD AFTER  RUN
     F*  ----------------------------------                        *
     F*  * ADD VRFR50   TO UTLC20                                  *
     F*  * ADD ABF6P01  BY OPT#1 (FILE REFORMATION MASTER UPDATE)  *
     F*  * ADD ABF6P01  BY OPT#3 (UPDATE FILE NAME              )  *
     F************************************************************
     FABF6L02 UP  E           K        DISK         KINFDS INF1
     FABF6P01BO   E                    DISK
     F            ABF6P011                          KRENAMEABF6L021
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
      *
     C           *ENTRY    PLIST
     C                     PARM           PYMD    8        SHIP DATE
     C                     PARM           PREC1   9        BEFORE
     C                     PARM           PREC2   9        AFTER
     C                     MOVE PYMD      XDATE   80
      *
     C           FCSHDT    IFLE XDATE
     C                     WRITEABF6L021
     C                     DELETABF6P011
     C                     ADD  1         WDEL    90
     C                     ELSE
     C                     MOVE '1'       *INLR
     C                     END
      *
     CLR                   Z-ADDRCNT      WREC    90
     CLR                   MOVE WREC      PREC1
     CLR         WREC      SUB  WDEL      WREC
     CLR                   MOVE WREC      PREC2
