     H            Y.
     F** VRFR22 ****************************************
     F*  REFORMATION FOR GDGPP02                       *
     F*  J-WATANABE  CRT 2016.07.15                    *
     F**************************************************
     FGDGPL11 UF  E           K        DISK         KINFDS INF1
     FGDGPP02BO   E           K        DISK
     F            GDGPP021                          KRENAMEGDGPP02X
      ***************************************************
     IINF1        DS
     I                                    B 156 1590RCNT
     I            DS
     I                                        1   80TRDATE
     I                                        1   40IAKOYY
     I                                        5   60IAKOMM
     I                                        7   80IAKODD
     C           *ENTRY    PLIST
     C                     PARM           PDATE   8
     C                     PARM           PREC    9        BEFORE
     C                     PARM           PKEN    9        AFTER
      *
     C                     MOVE PDATE     XDATE   80
     C           *LOVAL    SETLLGDGPL11
      * LOOP
     C           *IN90     DOWEQ*OFF
     C                     READ GDGPL11                  90
     C           *IN90     IFEQ *OFF
      *
     C           TRDATE    IFGT XDATE
     C                     LEAVE
     C                     ELSE
     C                     ADD  1         WDEL    90
     C                     WRITEGDGPP02X
     C                     DELETGDGPP021
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C                     Z-ADDRCNT      WREC1   90
     C                     MOVE WREC1     PREC
     C           WREC1     SUB  WDEL      WREC2   90
     C                     MOVE WREC2     PKEN
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
