     A* A$AAA  *******************************************************
     A* TEST DDS SRC                                                   *
     A* JW    2025.06.23                                               *
     A******************************************************************
     A          R A$$TST1                   TEXT('TEST DDS')
     A            A$FLD1        10A         COLHDG('LTR 10')
     A            A$FLD2         8S 0       COLHDG('NUM 8')
     A            A$FLD3         1A         COLHDG('LTR 1')
     A            A$FLD4         1S 0       COLHDG('NUM 1')
