     A** AAFPP30 *******************************
     A* ...PLATING KANBAN ISSUE HISTORY       *
     A* A.HOTTA                 19.01.20       *
     A******************************* AAFPP01 **
     A          R AAFPP301                  TEXT('PLATING KANBAN HISTORY')
     A            A0SKJY         1          COLHDG('DELETE CODE')
     A            A0SKYY         4S 0       COLHDG('DELETE DUE DATE' -
     A                                             '(YEAR)')
     A            A0SKMM         2S 0       COLHDG('(MONDAY)')
     A            A0SKDD         2S 0       COLHDG('(SUNDAY )')
     A            A0KOYY         4S 0       COLHDG('UPDATE WORK DAY' -
     A                                             '(YEAR)')
     A            A0KOMM         2S 0       COLHDG('MONTH')
     A            A0KODD         2S 0       COLHDG('DAY')
     A            A0KOHH         2S 0       COLHDG('UPDATE WORK TIME')
     A            A0KOSS         2S 0       COLHDG('(MINUTES)')
     A            A0KOME        10          COLHDG('NAME OF TEAM MEMBER' -
     A                                             'WHO UPDATED')
     A            A0RECD         8A         COLHDG('RECORD NUMBER')
     A            A0HKKB         1A         COLHDG('ISSUE TYPE')
     A            A0SHIN        12A         COLHDG('REPRESENTATIVE PART' -
     A                                             'NUMBER')
     A            A0ATK1         1A         COLHDG('CURRENT LOC 1')
     A            A0ATK2         2A         COLHDG('CURRENT LOC 2')
     A            A0ATK3         2A         COLHDG('CURRENT LOC 3')
     A            A0ATK4         1A         COLHDG('CURRENT LOC 4')
     A            A0KSNK         1S 0       COLHDG('UPDATE INSTRUCTION')
     A            A0ZETI         4A         COLHDG('ID  NUMBER')
     A            A0TEHI         3A         COLHDG('ORDER NUMBER')
     A            A0PAGE         2A         COLHDG('PAGE NUMBER')
     A            A0NIJI         1A         COLHDG('NIJI')
     A            A0TAIS         1A         COLHDG('TAISYO')
     A            A0SYKO         1A         COLHDG('YUKO')
     A            A0HKSY         1A         COLHDG('BOX TYPE')
      *
     A            A0MTK1         1A         COLHDG('PRV LOCATION1')
     A            A0MTK2         2A         COLHDG('PRV LOCATION2')
     A            A0MTK3         2A         COLHDG('PRV LOCATION3')
     A            A0MTK4         1A         COLHDG('PRV LOCATION4')
     A            A0MTNM        16A         COLHDG('PRV FACTRY NAME')
     A            A0BTK1         1A         COLHDG('CURRENT LOC 1')
     A            A0BTK2         2A         COLHDG('CURRENT LOC 2')
     A            A0BTK3         2A         COLHDG('CURRENT LOC 3')
     A            A0BTK4         1A         COLHDG('CURRENT LOC 4')
     A            A0ATNM        16A         COLHDG('SECTION NAME')
     A            A0MEKI         7A         COLHDG('SURFACE TREATMENT')
     A            A0RAIN         1A         COLHDG('LINE')
     A            A0BARA         2S 0       COLHDG('PLATING BARRELA')
     A            A0BARB         2S 0       COLHDG('B')
     A            A0CBKO         2S 0       COLHDG('C BOX RATIO')
     A            A0SSYS         5S 0       COLHDG('ACCOMMODATED' -
     A                                             'QUANTITY')
     A            A0SSYT         1A         COLHDG('UNIT')
     A            A0JOK1        12A         COLHDG('CONDITION 11')
     A            A0JOK2        12A         COLHDG('21')
     A            A0NIK1        20A         COLHDG('PACKING CONDITION1')
     A            A0NIK2        20A         COLHDG('PACKING CONDITION2')
     A            A0NIK3        20A         COLHDG('PACKING CONDITION3')
     A            A0NIK4        20A         COLHDG('PACKING CONDITION4')
      *
     A            A0KALL         4S 0       COLHDG('ALL')
     A            A0KMIN         4S 0       COLHDG('MIN')
     A            A0KMAX         4S 0       COLHDG('MAX')
     A            A0SRMS         4S 0       COLHDG('NUMBER OF HANDLING')
     A            A0YOSI         2S 0       COLHDG('PAPER')
     A            A0ATOK         3A         COLHDG('CURRENT PROCESS')
     A            A0COLN         6A         COLHDG('BOX COLOR NAME')
     A            A0BCOL         1A         COLHDG('BOX COLOR CODE')
     A            A0KCOL         1A         COLHDG('KANBAN HISTRY COLOR')
     A            A0KANL         1A         COLHDG('KANBAN COLOR CODE')
     A            A0HKB2         1A         COLHDG('KANBAN ISSUE TYPE2')
     A            A0HKDT         8S 0       COLHDG('KANBAN ISSUE DATE')
     A            A0HKTM         6S 0       COLHDG('KANBAN ISSUE TIME')
     A*  ' ' = DEFAULT ,  'Y' = PERMITTED, 'N' = PAST KANBAN -NOT PERMITTED
     A            A0RDPM         1A         COLHDG('READ PERMISSION')
     A            A0QR         200A         COLHDG('QR DATA')
     A*
