     A** AAGPP01 **************************************
     A*UPDATE OF TUNNEL KANBAN M/F *
     A*                   H.ITO 86.09.05              *
     A************************************** AAGPP01 **
     A          R AAGPP011                  TEXT('TUNNEL KANBAN M/F')
     A            O4SKJY         1          COLHDG('DELETE CODE')
     A            O4SKYY         4S 0       COLHDG('DELETE DUE DATE' -
     A                                             '(YEAR)')
     A            O4SKMM         2S 0       COLHDG('MONTH')
     A            O4SKDD         2S 0       COLHDG('DAY')
     A            O4KOYY         4S 0       COLHDG('UPDATE WORK DAY' -
     A                                             '(YEAR)')
     A            O4KOMM         2S 0       COLHDG('MONTH')
     A            O4KODD         2S 0       COLHDG('DAY')
     A            O4KOHH         2S 0       COLHDG('UPDATE WORK TIME')
     A            O4KOSS         2S 0       COLHDG('(MINUTES)')
     A            O4KOME        10          COLHDG('NAME OF TEAM MEMBER')
     A            O4SHN1         5          COLHDG('REPRESENTING PART' -
     A                                             'NUMBER1')
     A            O4SHN2         5          COLHDG('2')
     A            O4SHN3         2          COLHDG('3')
     A            O4TKYY         4S 0       COLHDG('EFFECTIVE DATE' -
     A                                             'BEFORE CHANGE(YEAR))')
     A            O4TKMM         2S 0       COLHDG('MONTH')
     A            O4TKDD         2S 0       COLHDG('DAY')
     A            O4TBIN         2S 0       COLHDG('BIN')
     A            O4UKYY         4S 0       COLHDG('EFFECTIVE DATE AFTER' -
     A                                             'CHANGE(YEAR))')
     A            O4UKMM         2S 0       COLHDG('MONTH')
     A            O4UKDD         2S 0       COLHDG('DAY')
     A            O4UBIN         2S 0       COLHDG('BIN')
     A            O4STYY         4S 0       COLHDG('LAPSE DATE (YEAR)')
     A            O4STMM         2S 0       COLHDG('MONTH')
     A            O4STDD         2S 0       COLHDG('DAY')
     A            O4SBIN         2S 0       COLHDG('BIN')
     A            O4KTEI         3          COLHDG('PRESENT PROCESS' -
     A                                             'MANUFACTURING' -
     A                                             'PRACESS CODE')
     A            O4BMON         4S 0       COLHDG('DEPARTMENT CODE')
     A            O4ATYP         1          COLHDG('TYPE')
     A            O4BAN1         1          COLHDG('LOCATION CODE 1')
     A            O4BAN2         2          COLHDG('2')
     A            O4BAN3         2          COLHDG('3')
     A            O4BAN4         1          COLHDG('4')
     A            O4ATOH         2S 0       COLHDG('DEPARTMENT LIST')
     A            O4MAEK         3          COLHDG('PRECEDING PROCESS')
     A            O4MAKB         4S 0       COLHDG('DEPARMENT CODE')
     A            O4MTYP         1          COLHDG('TYPE')
     A            O4MTK1         1          COLHDG('LOCATION CODE 1')
     A            O4MTK2         2          COLHDG('2')
     A            O4MTK3         2          COLHDG('3')
     A            O4MTK4         1          COLHDG('4')
     A            O4MAEH         2S 0       COLHDG('DEPARTMENT LIST')
     A            O4KOA1         3          COLHDG('PROCESSING CONTENTS' -
     A                                             'A PROCESS-1')
     A            O4KOA2         3          COLHDG('PROCESS-2')
     A            O4KOA3         3          COLHDG('PROCESS-3')
     A            O4KOB1         3          COLHDG('PROCESSING CONTENTS' -
     A                                             'B PROCESS-1')
     A            O4KOB2         3          COLHDG('PROCESS-2')
     A            O4KOB3         3          COLHDG('PROCESS-3')
     A            O4KOCD         4S 0       COLHDG('PLATING DEPARTMENT' -
     A                                             'CODE')
     A            O4KTYP         1          COLHDG('TYPE')
     A            O4KAEH         1S 0       COLHDG('BAR CODE')
     A            O4RAIN         1          COLHDG('LINE')
     A            O4CBKO         2S 0       COLHDG('C BOX RATIO')
     A            O4BARA         2S 0       COLHDG('PLATING BARREL A')
     A            O4BARB         2S 1       COLHDG('B')
     A            O4JOK1         2          COLHDG('PLATING CONDITION 11')
     A            O4JOK2         2          COLHDG('21')
     A            O4JOK3         2          COLHDG('ASSEMBLED FORM' -
     A                                             'CONDITION 11')
     A            O4JOK4         2          COLHDG('21')
     A            O4JOK5         2          COLHDG('2')
     A            O4JOK6         2          COLHDG('3')
     A            O4KAK1         2          COLHDG('PROCESSING POINT' -
     A                                             'PROCESSING CONTENTS' -
     A                                             '1')
     A            O4KAK2         2          COLHDG('2')
     A            O4KAK3         2          COLHDG('3')
     A            O4SYOS         5S 0       COLHDG('ACCOMMODATED' -
     A                                             'QUANTITY')
     A            O4SYOT         1          COLHDG('UNIT')
     A            O4LTIM         4S 2       COLHDG('PRODUCTION L/T')
     A            O4KEIS         4S 2       COLHDG('DISPARTION' -
     A                                             'COEFFICIENT')
     A            O4STI1         2S 0       COLHDG('SETTING CODE 1')
     A            O4RIBH        14          COLHDG('RIVET  PART NUMBER')
     A            O4LOTO         3S 0       COLHDG('QUENCHING LOT')
     A            O4MAXH         3S 0       COLHDG('MAX NUMBER OF BOXES')
     A            O4YOUS         4          COLHDG('PAPER')
     A            O4KCD1         1          COLHDG('KANBAN KIND (LARGE)')
     A            O4KCD2         1          COLHDG('(SMALL)')
     A            O4MEKI         7          COLHDG('SURFACE TREATMENT' -
     A                                             'PLATING')
     A            O4ZETI         4          COLHDG('ID  NUMBER'        )
     A            O4KSKB         1S 0       COLHDG('UPDATE INSTRUCTION')
     A            O4KALL         3S 0       COLHDG('ALL NUMBER OF KSNBSN' -
     A                                             'SHEETS')
     A            O4MAIS         3S 0       COLHDG('NUMBER OF')
     A            O4KMIN         3S 0       COLHDG('MIN')
     A            O4KMAX         3S 0       COLHDG('MAX')
     A            O4SRMS         3S 0       COLHDG('NUMBER OF HANDLING' -
     A                                             'SHEETS')
     A            O4ALHK         3S 0       COLHDG('CHANGE  ALL')
     A            O4MXHK         3S 0       COLHDG('CHANGE  MAX')
     A            O4KSHK         1          COLHDG('UPDATE INSTRUCTION' -
     A                                             'CHANGE')
     A            O4KTSU         9S 0       COLHDG('FIXED SETTING NUMBER')
     A            O4KSSU         9S 0       COLHDG('CALCULATION SETTING' -
     A                                             'NUMBER')
     A            O4KOUT         1          COLHDG('KANBAN PUBLICATION' -
     A                                             'INSTRUCTION')
     A            O4DOUT         1          COLHDG('DISKETT PUBLICATION' -
     A                                             'INSTRUCTION')
     A            O4TISU         3S 0       COLHDG('NUMBER OF AJUSTMENT' -
     A                                             'SHEETS')
     A            O4DTKO         1          COLHDG('DATA UPDATE METHOD')
     A            O4DTHE         1          COLHDG('DATA CHANGE' -
     A                                             'INSTRUCTION')
     A            O4JDMS         3S 0       COLHDG('AUTOMATIC BALANCE' -
     A                                             'NUMBER OF SHEETS')
     A            O4NHH1         2S 0       COLHDG('DELIVERY TIME (ONCE' -
     A                                             '))')
     A            O4NMM1         2S 0       COLHDG('MINUTES')
     A            O4NHH2         2S 0       COLHDG('DELIVERY TIME' -
     A                                             '(TWICE)')
     A            O4NMM2         2S 0       COLHDG('MINUTES')
     A            O4SK11         2S 0       COLHDG('1 CYCLE PAR DAY')
     A            O4SK21         2S 0       COLHDG('TIME')
     A            O4SK31         2S 0       COLHDG('TIME')
     A            O4SK12         2S 0       COLHDG('2 CYCLE PAR DAY')
     A            O4SK22         2S 0       COLHDG('TIME')
     A            O4SK32         2S 0       COLHDG('TIME')
     A            O4SHIY         2S 0       COLHDG('SORT INSTRUCTION ')
     A            O4HINM         5          COLHDG('PART NAME LARGE')
     A            O4KASI         7S 2       COLHDG('COMPLETION UNIT' -
     A                                             'WEIGHT')
     A            O4ZMEN         1          COLHDG('DRAWING NECESSARY' -
     A                                             'INSTRUCTION')
