     A** AB#EP98 **********************
     A*  HOLLINGSWORTH(850) INSTRUCTION
     A*********************************
      *
     A          R AB#EP981                  TEXT('EDI850 INSTRUCTION')
     A            AEPLNT         3          COLHDG('PLANT ID')
     A            AEODRN        20A         COLHDG('ORDER NUMBER')
     A            AENOTE        30          COLHDG('NOTE')
      *
     A          K AEPLNT
     A          K AEODRN
