     A** AB#EL61B **************************************
     A**************************************************
     A          R AB#EP611                  PFILE(AB#EP61)
     A          K E2SHID
     A          K E2ORDN
