     A** AB#EL6# ***************************************
     A**************************************************
     A          R AB#EP6A1                  PFILE(AB#EP6A)
     A          K EANONY
     A          K EASHID
     A          K EADATE
     A          K EATIME
