     A* AB#EL77  **************************************
     A* EDI PROCESSING FILE FOR 856                   *
     A* JW   2021.01.19                               *
     A*************************************************
      *
     A          R AB#EP771                  PFILE(AB#EP77)
     A          K E7PRTN
     A          K E7SHID
     A          K E7ORDN
     A          K E7MAN#
     A          K E7MHIN
     A          K E7RF02
