     A** AB#EP14 *****************************************************
     A*  UNIVERSAL EDI ASN INFORMATION                               *
     A*  JW        2025.04.29                                        *
     A****************************************************************
     A          R AB#EP141
     A            E4PRTN        30A         COLHDG('PARTNER ID')
     A            E4RCHZ         8S 0       COLHDG('SENT DATE')
     A            E4RCTM         6S 0       COLHDG('SENT TIME')
     A            E4RCT4         4S 0       COLHDG('SENT TIME HH:MM')
     A            E4TOKU         4S 0       COLHDG('CUSTOMER#')
     A            E4NONY         4S 0       COLHDG('DELIVER#')
     A            E4NKOJ         1A         COLHDG('FACTORY ')
     A            E4NUKE         4A         COLHDG('DOCK    ')
     A            E4NOHZ         8S 0       COLHDG('SHIP DATE')
     A            E4NOBN         2S 0       COLHDG('BIN#    ')
     A            E4BCH#         7S 0       COLHDG('BATCH#')
     A            E4TRID         6A         COLHDG('EDI ID 856')
     A            E4REF#        20A         COLHDG('REFERENCE#')
     A            E4PLNT         5A         COLHDG('PLANT')
     A            E4SHCD        10A         COLHDG('SHIP TO')
     A            E4ASN#        10A         COLHDG('ASN# ')
     A            E4INT#        14A         COLHDG('INTERCHANGE#')
     A            E4SHID        10A         COLHDG('SHIP ID')
     A            E4PL#          9A         COLHDG('PACKING LIST#')
     A            E4ODRN        20A         COLHDG('ORDER#')
      *
      * ACKNOWLEDGEMENT
     A            E4AKHZ         8S 0       COLHDG('ACKNOWLEDGE DATE')
     A            E4AKTM         6S 0       COLHDG('ACKNOWLEDGE TIME')
     A            E4AKTP         3A         COLHDG('ACKNOWLEDGE TYPE')
      *
      * ACCEPTION
     A            E4ACHZ         8S 0       COLHDG('ACCEPT DATE')
     A            E4ACTM         6S 0       COLHDG('ACCEPT TIME')
     A            E4ACTP         3A         COLHDG('ACCEPT 997/824')
      *
     A            E4CRHZ         8S 0       COLHDG('CRT DATE')
     A            E4CRTM         6S 0       COLHDG('CRT TIME')
     A            E4CRPG        10A         COLHDG('CRT PROGRAM')
     A            E4CRUS        10A         COLHDG('CRT USER')
      * RESERVE
     A            E4FLD1         8S 0       COLHDG('ID# (SEQ#) ')
     A            E4FLD2         8S 0       COLHDG('FILLER     ')
     A            E4FLD3         8S 0       COLHDG('FILLER     ')
     A            E4FLD4         6S 0       COLHDG('FILLER     ')
     A            E4FLD5         6S 0       COLHDG('FILLER     ')
     A            E4FLD6         6S 0       COLHDG('FILLER     ')
     A            E4FLD7        20A         COLHDG('FILLER     ')
     A            E4FLD8        20A         COLHDG('FILLER     ')
     A            E4FLD9        20A         COLHDG('FILLER     ')
      *
     A          K E4RCHZ
     A          K E4RCT4
     A          K E4NONY
     A          K E4TRID
