     A** AB#EL5S ***************************************
     A* JW    08/05/16
     A**************************************************
     A          R AB#E59S1                  PFILE(AB#EP59S)
     A          K E1SHID
