     A** AB#EL93S***************************************
     A**************************************************
     A          R AB#E93S1                  PFILE(AB#EP93S)
     A          K A3ODRN
     A          K A3CRDT
     A          K A3CRTM
     A          K A3EDID
     A          K A3PLNT
     A          K A3SHCD
     A          K A3MHIN
     A          K A3RENO
