     A** AB#EP40S **************************************
     A* TCHK1 08/01/12 ADD FIELD
     A**************************************************
     A          R AB#E40S1                  PFILE(AB#EP40S)
     A          K ECRDT
     A          K ECRTM
