     A** AB#EL14A **************************************
     A*  JW   2026.01.30
     A**************************************************
     A          R AB#EP141                  PFILE(AB#EP14 )
      *
     A          K E4RCHZ
     A          K E4RCT4
     A          K E4NONY
     A          K E4TRID
     A          S E4BCH#                    COMP(EQ 0 )
