     A** AB#EL50  **************************************
     A*  EDI862 FOR FORD
     A**************************************************
     A          R AB#EP501                  PFILE(AB#EP50 )
     A          K A5SIDT
     A          K A5STID
     A          K A5EQMT
     A          K A5DOCK
     A          K A5PART
     A          K A5DLDT
