     A** AB#EL94S***************************************
     A          R AB#E90S1                  PFILE(AB#EP90S)
     A          K AECONT
     A          K AECRDT
     A          K AECRTM
     A          K AEEDID
     A          K AEPLNT
     A          K AESHCD
     A          K AEMHIN
