     A** AB#PLLG ***************************************
     A**************************************************
     A          R AB#E60S1                  PFILE(AB#EP60S)
     A          K E1PRTN
     A          K E1INVN
     A          K E1NOHZ
     A          K E1NBIN
