     A** AB#EP91 **********************
     A*  ..EDI DATA FOR HONDA
     A*
     A*
     A********************** AB#EP90 **
      *
     A          R AB#EP911                  TEXT('EDI AGAI LABEL DATA FILE')
     A            AEPLNT         3          COLHDG('PLANT ID')
     A            AEODRN        20A         COLHDG('ORDER NUMBER')
     A            AENOTE        30          COLHDG('NOTE')
     A          K AEPLNT
     A          K AEODRN
