     A** AB#EL4S4 **************************************
     A*  JW   2023.06.06
     A**************************************************
     A          R AB#E40S1                  PFILE(AB#EP40S)
      *
     A          K ENONY
     A          K EMKDO
     A          K EMHIN
     A          K ENDATE
