     A** AB#PLLG ***************************************
     A**************************************************
     A          R AB#EP701                  PFILE(AB#EP70)
     A          K ENONY
     A          K ENUKE
     A          K EODRN
     A          K EISDT
