     A** AB#EL69 ***************************************
     A**************************************************
     A          R AB#EP691                  PFILE(AB#EP69)
     A          K E3NONY
     A          K E3NUKE
