     A** AB#EL70S **************************************
     A          R AB#E70S1                  PFILE(AB#EP70S)
     A          K EINVN
     A          K E7CRDT                    DESCEND
     A          K EISDT                     DESCEND
