     A** AB#HL20 ***************************************
     A*  ASN LOG                                       *
     A*  JW   2021.10.26                               *
     A**************************************************
     A          R AB#HP201                  PFILE(AB#HP20)
      *
     A          K AHNONY
     A          K AHNOYY
     A          K AHNOMM
     A          K AHNODD
     A          K AHNOBN
     A          K AHNKOJ
     A          K AHNUKE
     A          K AHODRN
