     A** AB#NP20 **********************
     A*  ..EDI SELIAR# CONTLOR FILE.. *
     A*         K.YASUDA   2000.02.18 *
     A********************** AB#NP20 **
      *
     A          R AB#NP201                  TEXT('EDI SELIAR# CONTROL FILE')
     A            NCNONY         4S 0       COLHDG('DELIVERY')
     A            NCYEAR         4S 0       COLHDG('YEAR')
     A            NCMOTH         2S 0       COLHDG('MONTH')
     A            NCSRL1        10S 0       COLHDG('SERIAL#-1 CONTAINERS')
     A            NCSRL2        10S 0       COLHDG('SERIAL#-2 PALETTO')
     A            NCASNB        10S 0       COLHDG('ASN NUMBER')
      *
     A          K NCNONY
