     A** AB#PL73 ***************************************
     A**************************************************
     A          R AB#PP701                  PFILE(AB#PP70)
      *
     A          K EKNOYY
     A          K EKNOMM
     A          K EKNODD
