     A** AB#PL43C ***************************************
     A          R AB#PP431                  PFILE(AB#PP43)
     A*
     A          K DANONY
     A          K DADEL#
     A          K DANOYY
     A          K DANOMM
     A          K DANODD
     A          K DANOBN
