     A** AB#PL2M *********************
     A*  HONDA SPLIT FILE            *
     A*    J.WATANABE     2016.11.09 *
     A********************************
      *
     A          R AB#PP2M1                  PFILE(AB#PP2M)
     A          K M2SPDT
     A          K M2NONY
     A          K M2NOHZ
     A          K M2NOBN
     A          K M2MHIN
