     A** AB#PL19 *******************
     A*  ..EDI FIXED ORDER DATA..  *
     A*    PL                      *
     A*  T.SAKASHITA   2000.08.28  *
     A* CPY FROM AB#PL16  AB#PL19 **
      *
     A          R AB#PP101                  PFILE(AB#PP10)
      *
     A          K BATOKU
     A          K BANONY
     A          K BANUKE
     A          K BAINVN
     A          K BASKJY
