     A** AB#PL10B ******************
     A*  ..EDI FIXED ORDER DATA..  *
     A*  JW  2020.11.25            *
     A******************************
      *
     A          R AB#PP101                  PFILE(AB#PP10)
      *
     A          K BANOYY
     A          K BANONY
     A          K BAMHN1
     A          K BAMHN2
     A          K BAMHN3
     A          K BANKOJ
     A          K BANUKE
      *
     A          S BASKJY                    COMP(NE 'D')
