     A** AB#PL66 ***************************************
     A*  TMS MASTSER LABEL                           *
     A**************************************************
     A          R AB#PP6M1                  PFILE(AB#PP6M)
     A          K M6PTRN
     A          K M6DATE
     A          K M6TIME
