     A** AB#PL1U ********************************************
     A*  EDI FIXED ORDER DATA                               *
     A*  JW  2022.11.15                                     *
     A*******************************************************
     A          R AB#PP101                  PFILE(AB#PP10)
      *
     A          K BAIAF#
     A          K BACRHZ
     A          K BACRTM
     A          K BATOKU
     A          K BANONY
