     A** AB#PL7C ***************************************
     A**************************************************
     A          R AB#PP701                  PFILE(AB#PP70)
      *
     A          K EKDEYY
     A          K EKDEMM
     A          K EKDEDD
     A          K EKDETM
