     A** AB#PL42 ****************************************
     A          R AB#PP421                  PFILE(AB#PP42)
     A*
     A          K ABNONY
     A          K ABSHDT
     A          K ABBINN
     A          K ABMHN1
     A          K ABMHN2
     A          K ABMHN3
