     A** AB#PP41 ************************************************************
     A*  ..EDI (862)  ARVIN SANGO                                           *
     A*  K-KASHIWAGI     01.03.05                                           *
     A*  N.HYOTO         01.06.26                                           *
     A******************* AB#PP41 *******************************************
     A*                                     UNIQUE
     A          R AB#PP411                  TEXT('EDI862 DATA')
     A            AVSKJY         1A         COLHDG('DLT CODE D')
     A            AVSKYY         4S 0       COLHDG('DLT YY')
     A            AVSKMM         2S 0       COLHDG('DLT MM')
     A            AVSKDD         2S 0       COLHDG('DLT DD')
     A            AVKOYY         4S 0       COLHDG('UPD YY')
     A            AVKOMM         2S 0       COLHDG('UPD MM')
     A            AVKODD         2S 0       COLHDG('UPD DD')
     A            AVKOHH         2S 0       COLHDG('UPD HH')
     A            AVKOSS         2S 0       COLHDG('UPD MN')
     A            AVKOME        10A         COLHDG('UPD USER')
     A*
     A            AVSTDT         8S 0       COLHDG('START DATE')
     A            AVPTDV         2A         COLHDG('INTERNAL DIV TYPE')
     A            AVEDDT         8S 0       COLHDG('END DATE')
     A            AVCTDT         8S 0       COLHDG('CRT DATE')
     A            AVSUNM        25A         COLHDG('SUPP NAME')
     A            AVSUCD         6A         COLHDG('SUPP CODE')
     A            AVCNTP        15A         COLHDG('CONTAINER TYPE')
     A            AVCYC1         2S 0       COLHDG('CYCLE 1')
     A            AVCYC2         2S 0       COLHDG('CYCLE 2')
     A            AVCYC3         2S 0       COLHDG('CYCLE 3')
     A            AVWTDV         2A         COLHDG('WEIGHT DIVISION')
     A            AVBXWT         9S 0       COLHDG('BOX WEIGHT')
     A            AVWTUT         2A         COLHDG('WEIGHT UNIT')
     A            AVNBKB         5S 0       COLHDG('NUMBER OF KANBAN')
     A            AVPDDS        30A         COLHDG('PRODUCT DESCRIPTION')
     A            AVMAN#         8A         COLHDG('MANIFEST NUMBER')
     A            AVTRUC         2A         COLHDG('TRUCK NUMBER')
     A            AVCTPS        60A         COLHDG('CONTACT PERSON')
     A            AVTEL#        12A         COLHDG('TELEPHONE #')
     A            AVTRAN         7A         COLHDG('TRANSACTION #')
     A            AVKBSQ         4A         COLHDG('KANBAN SEQ. #')
     A            AVSHN1         5A         COLHDG('INTERNAL PART1')
     A            AVSHN2         5A         COLHDG('INTERNAL PART2')
     A            AVSHN3         2A         COLHDG('INTERNAL PART3')
     A            AVNONY         4S 0       COLHDG('DELIVERY CODE')
     A            AVSPDT         8S 0       COLHDG('SHIP DATE FROM' -
      *                                            'IAF')
     A            AVRVDT         8S 0       COLHDG('ASI RECEIVED DATE')
      *
     A          K AVSHN1
     A          K AVSHN2
     A          K AVSHN3
     A          K AVNONY
     A          K AVSPDT
     A          K AVTRAN
     A****      K AVKBSQ
