     A** AB#PL2A **********************
     A*  ..EDI HONDA                  *
     A********************** AB#PL2A **
      *
     A          R AB#PP2A1                  PFILE(AB#PP2A)
      *
     A          K ACRENO
