     A** AB#PL44B ***************************************
     A          R AB#PP441                  PFILE(AB#PP44)
     A*
     A          K DANYMD
     A          K DANOBN
     A          K DANONY
     A          K DANKOJ
     A          K DANUKE
