     A** AB#PL47A ***************************************
     A          R AB#PP471                  PFILE(AB#PP47)
     A*
     A          K ABNONY
     A          K ABSHDT
     A          K ABBINN
     A          K ABODRN
     A          K ABMHIN
