     A* AB#PL6E ***************************************
     A* ACCOUNT PAYABLE                               *
     A*************************************************
     A          R AB#PP6A1                  PFILE(AB#PP6A)
     A          K APCNAM
     A          K APPRDT
     A          K APMANI
     A          K APPAR1
     A          K APPAR2
