     A** AB#PLF1E **************************************
     A*  J.WATANABE   2022.07.07                       *
     A**************************************************
     A          R AB#PPF11                  PFILE(AB#PPF1)
      *
     A          K F5DATE
     A          K F5NOHZ
     A          K F5STID
     A          K F5NUKE
     A          K F5IPAR
