     A** AB#PL6P ***************************************
     A*  A/P FORD820 (ADJ)                           *
     A**************************************************
     A          R AB#PP6P1                  PFILE(AB#PP6P)
     A          K APRENO
     A          K AFDTM2
     A          K APREF2
