     A** AB#PL75C **************************************
     A**************************************************
     A          R AB#PP751                  PFILE(AB#PP75)
      *
     A          K PUNOYY
     A          K PUNOMM
     A          K PUNODD
     A          K PUCUST
     A          K PUNONY
     A          K PUNKOJ
     A          K PUNUKE
     A          K PUBINN
     A          K PURLYY
     A          K PURLMM
     A          K PURLDD
     A          K PUODRN
