     A** AB#PL70 ***************************************
     A*  TCH   05/10/05 FOR AH#R74
     A**************************************************
     A          R AB#PP701                  PFILE(AB#PP70)
      *
     A          K EKSHN1
     A          K EKSHN2
     A          K EKSHN3
     A          K EKDEYY
     A          K EKDEMM
     A          K EKDEDD
     A          K EKNOYY
     A          K EKNOMM
     A          K EKNODD
