     A** AB#PL2A7 ******************************************
     A*  EDI HONDA                                         *
     A* J.WATANABE 2024.07.10                              *
     A******************************************************
     A          R AB#PP2A1                  PFILE(AB#PP2A)
     A          K ACNONY
     A          K ACASDT
     A          K ACBIN
     A          K ACPLNT
     A          K ACSHCD
      *
     A          S ACUPID                    COMP(NE 'D')
