     A** AB#PL7I ***************************************
     A**************************************************
     A          R AB#PP701                  PFILE(AB#PP70)
      *
     A          K EKNONY
     A          K EKNKOJ
     A          K EKNUKE
     A          K EKNOYY
     A          K EKNOMM
     A          K EKNODD
     A          K EKNOBN
     A          K EKSERL
