     A** AB#PL6R *******************************************
     A*  FORD REMITTANCE ADVICE HEADER                     *
     A*                                                    *
     A* ACCOUNT PAYABLE                                    *
     A******************************************************
     A          R AB#PP6R1                  PFILE(AB#PP6R)
     A          K ALPRDT
     A          K ALPRTM
     A          K ALRENO
