     A** AB#PP6B **************************************
     A* WORK FILE FOR ACCOUNT PAYABLE PRINT PROCESS   *
     A*                                               *
     A************************************** AB#PP6B **
      *
     A          R AB#PP6B1                  TEXT('W/F FOR A/P')
     A            A6CNAM         5A         COLHDG('CUSTOMER NAME')
     A            A6CHEK        10A         COLHDG('CHECK NO')
     A            A6TOTL        11  2       COLHDG('CHECK AMT')
