     A** AB#PL66 ***************************************
     A*  TMS MASTSER LABEL                           *
     A**************************************************
     A          R AB#PP661                  PFILE(AB#PP66)
     A          K A6NYMD
     A          K A6NBIN
     A          K A6TOKU
     A          K A6NONY
