     A** AB#PLE2 ***************************************
     A*  J.WATANABE   2024.05.20                       *
     A**************************************************
     A          R AB#PPE11                  PFILE(AB#PPE1)
     A                                      TEXT('EDI824')
      *
     A          K M6CRDT
     A          K M6CRTM
     A          K M6SHID
