     A** AB#PLLG ***************************************
     A**************************************************
     A          R AB#PPLG1                  PFILE(AB#PPLG)
     A          K LGNONY
     A          K LGFCTY
     A          K LGSDAT
     A          K LGSTIM
