     A** AB#PL2A5 *********************
     A*  ..EDI HONDA                  *
     A*********************************
      *
     A          R AB#PP2A1                  PFILE(AB#PP2A)
      *
     A          K ACASDT
     A          K ACNONY
     A          K ACNKOJ
     A          K ACNUKE
     A          K ACBIN
     A          K ACPLNT
     A          K ACSHCD
