     A** AB#PL75D **************************************
     A          R AB#PP751                  PFILE(AB#PP75)
      *
     A          K PUNONY
     A          K PUNUKE
     A          K PUODRN
     A          K PUNOYY
     A          K PUNOMM
     A          K PUNODD
      *
