     A** AB#PL7G ***************************************
     A          R AB#PP701                  PFILE(AB#PP70)
      *
     A          K EKTOKU
     A          K EKNONY
     A          K EKODRN
     A          K EKMHN1
     A          K EKMHN2
     A          K EKMHN3
     A          K EKMHN4
     A          K EKSERL
