     A** AB#PL47B ***************************************
     A          R AB#PP471                  PFILE(AB#PP47)
     A*
     A          K ABSHDT
     A          K ABBINN
     A          K ABNONY
     A          K ABMHIN
