     A** AB#PL75B **************************************
     A**************************************************
     A          R AB#PP751                  PFILE(AB#PP75)
      *
     A          K PUCUST
     A          K PUNONY
     A          K PUODRN
     A          K PUNKOJ
     A          K PUNUKE
     A          K PUNOYY
     A          K PUNOMM
     A          K PUNODD
     A          K PUBINN
