     A** AB#PLF1B **************************************
     A*  J.WATANABE   2022.01.03                       *
     A**************************************************
     A          R AB#PPF11                  PFILE(AB#PPF1)
      *
     A          K F5NOHZ
     A          K F5NONY
     A          K F5NUKE
     A          K F5PART
     A          K F5DATE
     A          K F5TIME
