     A** AB#TL2D **********************
     A*  ..EDI HONDA  850 ONLY        *
     A********************** AB#TL2D **
      *
     A          R AB#PP2A1                  PFILE(AB#PP2A)
      *
     A          K ACTOKU
     A          K ACNONY
     A          K ACMHN1
     A          K ACMHN2
     A          K ACMHN3
     A          K ACMHN4
      *
     A          S ACEDID                    COMP(EQ '850')
