     A** AB#WL6C ***************************************
     A**************************************************
     A          R AB#WP6C1                  PFILE(AB#WP6C)
      *
     A          K ABCUST
     A          K ABFCTY
     A          K ABSHIP
