     A*  TCH   03/11/05
     A**************************************************
     A          R AB#WPGN1                  PFILE(AB#WPGN)
     A          K BATOKU
     A          K BANONY
     A          K BAMHN1
     A          K BAMHN2
     A          K BAMHN3
     A          K BAMHN4
     A          K BANOYY
     A          K BANOMM
     A          K BANODD
