     A** AB#WP43SR************************************
     A*  SUBARU SKID MANIFEST WORKFILE SPECIAL RACK  *
     A*  LEC           2017.08.30                    *
     A************************************************
     A          R AB#WP43S1                 TEXT('SUBARU SPECIAL RACK')
     A            SRSHCD         7A         COLHDG('SPEC RACK SHOP CODE')
      *
     A          K SRSHCD
