      ** AB#WLAQ ***IAF************************
      *  J.WATANABE   2021.06.16              *
      *****************************************
     A          R AB#WPAQ1                  TEXT('SHIP SCHEDULE')
     A                                      PFILE(AB#WPAQ)
      *
     A          K W#LN#
     A          K W#DT#
