     A** AB#WP02 ***********************************
     A* ORDER DATA WORK FILE                       *
     A* JW    2023.12.06                           *
     A**********************************************
     A          R AB#WP091                  TEXT('ORDER DATA')
     A            W9EDIK        10A         COLHDG('EDI     ')
     A            W9TOKU        10A         COLHDG('CUST# ')
     A            W9NONY        10A         COLHDG('DELIV#')
     A            W9NKOJ        10A         COLHDG('FACTORY')
     A            W9DOCK        10A         COLHDG('DOCK   ')
     A            W9DAT1        10A         COLHDG('SHIP DATE')
     A            W9BIN         10A         COLHDG('BIN#        ')
     A            W9MHIN        20A         COLHDG('USER PART#')
     A            W9SHIN        14A         COLHDG('IAF  PART#')
     A            W9OQTY        10A         COLHDG('QTY       ')
     A            W9BOX         10A         COLHDG('BOX       ')
     A            W9QPC         10A         COLHDG('QPC       ')
     A            W9ODRN        10A         COLHDG('ORDER#    ')
     A            W9UDAT        10A         COLHDG('BILL DATE ')
     A            W9UP          10A         COLHDG('U/PRICE   ')
     A            W9AMT         10A         COLHDG('PRICE     ')
      *
     C          K W9TOKU
     C          K W9NONY
     C          K W9NKOJ
     C          K W9DOCK
     C          K W9DAT1
     C          K W9BIN
