     A** AB#WPLG **************************************
     A* GENTRAN FRS LOG FILE                          *
     A*                                               *
     A*                                               *
     A************************************** AB#WPGN **
      *
     A          R AB#WPLG1                  TEXT('FRS LIST  WORK FILE')
     A            AWTOKU         4S 0       COLHDG('CUSTOMER')
     A            AWNONY         4S 0       COLHDG('SHIP TO')
     A            AWDAT1         8  0       COLHDG('PROCESS DATE')
     A            AWTIM1         6  0       COLHDG('TIME')
     A            AWDAT2         8  0       COLHDG('PRINT DATE')
     A            AWTIM2         6  0       COLHDG('TIME')
     A            AWPRSN        10          COLHDG('PERSON')
     A          K AWDAT1
     A          K AWTIM1
     A          K AWNONY
