     A** AB#WFIN  ******************************************
     A* FUTABA INDIANA ORDER WORK FILE                     *
     A* TCHK1 11/14/06  CREATE                             *
     A******************************************* AB#WFIN **
      *
     A          R AB#WFIN1                  TEXT('FUTABA INDIANA')
     A            AWTOKU         4S 0       COLHDG('CUSTOMER')
     A            AWNONY         4S 0       COLHDG('DELIVERY')
     A            AWNKOJ         1          COLHDG('FACTORY')
     A            AWNUKE         4          COLHDG('DOCK')
     A            AWMHN1         5          COLHDG('USER PART1')
     A            AWMHN2         5          COLHDG('USER PART2')
     A            AWMHN3         5          COLHDG('USER PART3')
     A            AWSBAN         6          COLHDG('KANBAN#')
     A            AWSYOS         5S 0       COLHDG('QTY/BOX')
     A            AWSRYO         9S 0       COLHDG('QTY')
     A            AWORDN        10          COLHDG('ORDER#')
     A            AWSHDT         8S 0       COLHDG('SHIP DATE')
     A            AWBIN#         1          COLHDG('BIN      ')
     A            AWMANI        20          COLHDG('MANIFEST#')
      *
JW   A          K AWNONY
 |   A          K AWORDN
 |   A          K AWSHDT
 |   A          K AWMHN1
 |   A          K AWMHN2
JW   A          K AWMHN3
