      ** AB#WPA4 ***IAF************************
      * SALES ACCUMULATION DATA FILE.         *
      *                                       *
      *****************************************
     A          R AB#WPA41                  TEXT('SALES ACCUMULATION DATA')
     A                                      PFILE(AB#WPA4)
     A*
     A          K B1KMEI
     A          K B1NUKE
