     A**************************************************
     A*  JW    01/12/2023
     A**************************************************
     A          R AB#WP2I1                  PFILE(AB#WP2I)
      *
     A          K I2DELY
     A          K I2DOCK
     A          K I2SHDT
     A          K I2ORDR
     A          K I2SBAN
     A          K I2PART
