     A** AB#XL01  **************************************
     A**************************************************
     A          R AB#XP1A1                  PFILE(AB#XP01A)
     A          K IXKOHZ
     A          K IXKOTM
