     A** AB#XL01  **************************************
     A**************************************************
     A          R AB#XP1A1                  PFILE(AB#XP01A)
     A          K IXKOHZ
     A          K IXWRKF
     A          K IXKOUS
     A          K SER1F
     A          K SER1T
     A          K IXMHIN
     A          K IXSERL
