     A** ABAEL20A **************************************
     A**************************************************
     A          R ABAE20S1                  PFILE(ABAEP20S)
     A          K AENONY
     A          K AEMHIN
     A          K AEDAT1
     A          K AECRDT
     A          K AECRTM
