     A** ABAWL10 ****************************************
     A* ... EDI FORECAST                                               HANGE DAT
     A*A   *.
     A*
     A**************************************** ABBNL01 **
     A          R ABAWP201                  PFILE(ABAWP20)
     A          K ABNONY
     A          K ABNKOJ
     A          K ABNUKE
     A          K ABMHN1
     A          K ABMHN2
     A          K ABMHN3
     A          K ABMHN4
     A          K ABDATE
