     A** ABAWL14 ****************************************
     A* ... EDI FORECAST
     A***************************************************
     A          R ABAWP101                  PFILE(ABAWP10)
     A          K ABSHN1
     A          K ABSHN2
     A          K ABSHN3
     A          K ABNONY
     A          K ABDATE
     A          K ABNKOJ
     A          K ABNUKE
