     A** ABAWP45 *******************************************
     A* TIER1 FORECAST WEEKLY INQUIRY                      *
     A*                                                    *
     A* TCHK1 10/13/08 CREATE                              *
     A******************************************************
      *
     A          R ABAWP451                  PFILE(ABAWP45)
      *
     A          K AWNONM
