     A** ABBPP53 **************************************************
     A*  FORD EDI862 DAILY EDI DATA                               *
     A*  JW   2024.11.04                                          *
     A*************************************************************
     A          R ABBPP531                  TEXT('FORD EDI862')
     A            BBSKJY         1          COLHDG('D: DELETE FLAG')
     A            BBRCDT         8  0       COLHDG('RCV DATE')
     A            BBTOKU         4  0       COLHDG('CUSTOMER')
     A            BBNONY         4  0       COLHDG('DELIVERY CODE')
     A            BBNKOJ         1          COLHDG('FACTORY')
     A            BBNUKE         4          COLHDG('DOCK')
     A            BBSEBN         4          COLHDG('ID#')
     A            BBMHN1         5          COLHDG('USER PART1')
     A            BBMHN2         5          COLHDG('USER PART2')
     A            BBMHN3         5          COLHDG('USER PART3')
     A            BBMHN4         5          COLHDG('USER PART4')
     A            BBSHN1         5          COLHDG('IAF PART1')
     A            BBSHN2         5          COLHDG('IAF PART2')
     A            BBSHN3         2          COLHDG('IAF PART3')
     A            BBSDAT         8  0       COLHDG('SCHEDULE DATE')
     A            BBSQTY        11  2       COLHDG('QTY')
     A            BBEDIK         1          COLHDG('ENTRY E/S/W/I')
     A            BBBFLG         1          COLHDG('BUILD OUT FLAG')
     A            BBPLNT         5          COLHDG('PLANT')
     A            BBDOCK         4          COLHDG('DOCK')
     A            BBICCD         5          COLHDG('IC DODE')
      *
     A            BBQTY2         8  0       COLHDG('       ')
     A            BBYSQY        10  0       COLHDG('       ')
     A            BBLSDT         8  0       COLHDG('       ')
     A            BBLSQY        10  0       COLHDG('       ')
     A            BBTSID         3          COLHDG('       ')
     A            BBPART        20          COLHDG('       ')
     A            BBODRN        10          COLHDG('       ')
     A            BBINVN        16          COLHDG('       ')
     A            BBTPCD        15          COLHDG('       ')
     A            BBSPCD         2          COLHDG('       ')
     A            BBREF#        12          COLHDG('       ')
     A            BBPOR#         6          COLHDG('       ')
     A            BBSIDT         8  0       COLHDG('       ')
     A            BBHSDT         8  0       COLHDG('       ')
     A            BBHEDT         8  0       COLHDG('       ')
     A            BBSTIQ         2          COLHDG('       ')
     A            BBIDCD         5          COLHDG('       ')
     A            BBALFL        10          COLHDG('       ')
     A            BBRALF        10          COLHDG('       ')
     A            BBUBM1         2          COLHDG('       ')
     A            BBIPAR        15          COLHDG('       ')
     A            BBPONO        10          COLHDG('       ')
      *
     A            BBFLG1         1          COLHDG('FLG1')
     A            BBFLG2         1          COLHDG('FLG2')
     A            BBFLG3         1          COLHDG('FLG3')
     A            BBCRHZ         8  0       COLHDG('CRT DATE')
     A            BBCRTM         6  0       COLHDG('CRT TIME')
     A            BBCRUS        10          COLHDG('CRT USER')
     A            BBCRPG        10          COLHDG('CRT PGM ')
     A            BBSKHZ         8  0       COLHDG('DLT DATE')
     A            BBSKTM         6  0       COLHDG('DLT TIME')
     A            BBSKUS        10          COLHDG('DLT USER')
     A            BBSKPG        10          COLHDG('DLT PGM ')
      *
     A          K BBRCDT
     A          K BBNONY
     A          K BBNKOJ
     A          K BBNUKE
     A          K BBMHN1
     A          K BBMHN2
     A          K BBMHN3
     A          K BBMHN4
     A          K BBSDAT
