     A** ABBPL50A **********************************
     A*  BBTOKU.MHN1/2/3/4.SDAT.RCDT               *
     A*  JW     2022.03.04                         *
     A**********************************************
     A          R ABBPP501                  PFILE(ABBPP50)
     A          K BBTOKU
     A          K BBMHN1
     A          K BBMHN2
     A          K BBMHN3
     A          K BBMHN4
     A          K BBSDAT
     A          K BBRCDT
