     A** ABBPL53B **********************************
     A*  FORD EDI862 DAILY EDI DATA
     A*  JW
     A*********************************** ABBPL50 **
     A          R ABBPP531                  PFILE(ABBPP53)
     A          K BBNONY
     A          K BBMHN1
     A          K BBMHN2
     A          K BBMHN3
     A          K BBMHN4
     A          K BBNUKE
     A          K BBRCDT
     A          K BBSDAT
