     A** ABBPL54 ***********************************
     A* ... FORECAST HISTORYORECAST DATA ACCUMULATION FILE   *.
     A*
     A*********************************** ABBPL54 **
     A          R ABBPP501                  PFILE(ABBPP50)
     A          K BBSHN1
     A          K BBSHN2
     A          K BBSHN3
     A          K BBRCDT
     A          K BBNONY
     A          K BBNKOJ
     A          K BBNUKE
