     A** ABBPL56 ***********************************
TCH56A*  TCH  03/31/05 FOR REPORT WITH +/- QTY FORCAST QTY RECEIVED
     A*********************************** ABBPL54 **
     A          R ABBPP501                  PFILE(ABBPP50)
     A          K BBTOKU
     A          K BBNONY
     A          K BBSHN1
     A          K BBSHN2
     A          K BBSHN3
     A          K BBRCDT                    DESCEND
     A          K BBSDAT                    DESCEND
