      *
     A          R ABBPP9AR                  PFILE(ABBPP9A)
      *
     A          K A9SHN1
     A          K A9SHN2
     A          K A9SHN3
     A          K A9LOC1
     A          K A9LOC2
     A          K A9LOC3
     A          K A9LOC4
