      *
     A          R ABBWP711                  PFILE(ABBWP71)
      *
     A          K W7SIZE
     A          K W7LCID
     A          K W7MCHN
     A          K W7LOC4
