      *
     A          R ABBWP771                  PFILE(ABBWP77)
      *
     A          K A7MCHN
     A          K A7PRT1
     A          K A7PRT2
     A          K A7PRT3
     A          K A7DATE
