     A** ABEWP04 *******************************
     A* .. SETTING NUMBER AUTOMATIC HANDLING *
     A* .. CHECK FILE BY COPONENTS AND PROCESS *
     A* .. WORK FILE                         *
     A* I-HASADA                93.12.15       *
     A******************************* ABEWP04 **
     A          R ABEWP041                  TEXT('CHECK FILE BY COMPONENTS AND +
     A                                            PROCESS +
     A                                      AUTOMATIC HANDLING')
     A            A#KHIN        12          COLHDG('COMPONENTS PART' -
     A                                             'NUMBER')
      *
     A          K A#KHIN
