     A** ABF2L10 *******************************************
     A*  FORD EDI862 DATA (PRE-ORDER - HEADER)             *
     A*  JW     2023.10.16                                 *
     A******************************************************
     A          R ABF2P101                  PFILE(ABF2P10)
     A          K P2CRHZ
     A          K P2CRTM
     A          K P2EQMT
