     A** ABF2L0B *******************************************
     A*  EDI FORD WORK FILE                                *
     A******************************************************
     A          R ABF2P011                  PFILE(ABF2P01)
     A*
     A          K AFDATE
     A          K AFSTID
     A          K AFPOR#
     A          K AFPART
