     A** ABF3L03 ***************************************
     A* EDI862 FORD DATA (PROCESSED)                   *
     A* J.W.   2024.07.01                              *
     A**************************************************
     A          R ABF3P011                  PFILE(ABF3P01)
      *
     A          K XNONY
     A          K AFDOCK
     A          K AFPOR#                    DESCEND
