     A** ABF3L01 ***************************************
     A* EDI862 FORD DATA (PROCESSED)                   *
     A* J.W.   2022.01.14                              *
     A**************************************************
     A          R ABF3P011                  PFILE(ABF3P01)
      *
     A          K WNYMD
     A          K AFSTID
     A          K WMHIN
