     A** ABF9L01 ***************************************
     A* FORD ADDRESS MASTER                            *
     A* N:HYOTO  2000.02.01                            *
     A**************************************************
     A          R ABF9P011                  PFILE(ABF9P01)
     A                                      TEXT('FORD ADDRESS MASTER')
      *
     A          K F9DELY
