     A**************************************************************************
     A* IAF ORDER YTD SHP QTY ADJUSTMENT FILE (FORD)                           *
     A* J.WATANABE    2023.05.01                                               *
     A**************************************************************************
     A          R ABFAP05R                  PFILE(ABFAP05)
      *
     A          K C4ADYY
     A          K C4NONY
     A          K C4MHIN
     A          K C4SEQ#
