     A**************************************************************************
     A* IAF ORDER YTD SHP QTY ADJUSTMENT FILE (FORD)                           *
     A* J.WATANABE    2022.08.04                                               *
     A**************************************************************************
     A          R ABFAP04R                  PFILE(ABFAP04)
      *
     A          K C4ADYY
     A          K C4NONY
     A          K C4MHIN
