      ** ABFPP50 ***************************
      *  FORD SATURDAY DELIVERY CODE TABLE *
      *  J.WATANABE 2016.08.17             *
      **************************************
     A          R ABFPP501                  TEXT('SATURDAY DELIVERY CODE')
     A            SDSKJY         1A         COLHDG('DELETE CODE D')
     A            SDSKHZ         8S 0       COLHDG('DELETE DATE')
     A            SDSKTM         6S 0       COLHDG('DELETE TIME')
     A            SDSKME        10A         COLHDG('DELETE USER')
     A            SDKOHZ         8S 0       COLHDG('UPDATE DATE')
     A            SDKOTM         6S 0       COLHDG('UPDATE TIME')
     A            SDKOME        10A         COLHDG('UPDATE USER')
     A            SDNONY         4S 0       COLHDG('DELIVERY CODE')
     A            SDDOCK         4A         COLHDG('DOCK')
     A            SDPLNT        10A         COLHDG('PLANT CODE')
      *
     A          K SDNONY
