     A** ABFPL14 *******************************************
     A*  FORD NOTE KEY BY PART, DOCK, SIDT, REL#, FISD     *           *
     A*  K.KASHIWAGI 2001.02.16                            *
     A******************************************************
     A          R ABFPP101                  PFILE(ABFPP10)
     A          K FBDOCK
     A          K FBSIDT
     A          K FBIPAR
