     A**************************************************************************
     A* SALES & FORECAST REPORT (WF) BY DELIVERY CODE                          *
     A* J.WATANABE 2018.07.13                                                  *
     A**************************************************************************
     A*
     A          R ABFWP811                  TEXT('SALES & FORECAST')
     A            C8FCYM         6S 0       COLHDG('FORECAST YYMM')
     A            C8NONY         4S 0       COLHDG('DELIVERY')
     A            C8SQTY         9S 0       COLHDG('SHIPPED  QTY')
     A            C8SBOX         9S 0       COLHDG('SHIPPED  BOX')
     A            C8FQTY         9S 0       COLHDG('FORECAST QTY')
     A            C8FBOX        10S 2       COLHDG('FORECAST BOX')
     A            C8RATE         6S 1       COLHDG('RATE')
     A            C8TOKU         4S 0       COLHDG('CUST#')
     A            C8CRDT         8S 0       COLHDG('CRT DATE')
     A            C8CRTM         6S 0       COLHDG('CRT TIME')
     A            C8CRUS        10A         COLHDG('CRT USER')
     A            C8CRPG        10A         COLHDG('CRT PGM')
      *
     A          K C8FCYM
     A          K C8NONY
