     A** ABFWL81 ***************************************
     A* PRINT "SALES VS FORECAST REPORT"               *
     A* N:HYOTO  2000.06.14                            *
     A**************************************************
     A          R ABFWP811                  PFILE(ABFWP81)
      *
     A          K C8FCYM
     A          K C8RATE                    DESCEND
     A          K C8NONY
