     A** ABMWPF6 *************************************
     A*副資材　工程別データ
     A*    HOTTA.                  2018.10.04        *
     A************************************************
     A          R ABMWPF61
      *
     A            W2KO           3A         COLHDG('PROCESS CODE')
     A            W2SU          11S 0       COLHDG('PROCESS SETTING#')
     A            W2HAKD         9S 2       COLHDG('BOX/DAY')
      *
     A          K W2KO
