     A** ABMWPG2 *************************************
     A*未納ＫＰＩ　工程内・A-PICS (ABBPP70)
     A*    HOTTA.                  2018.10.04        *
     A************************************************
     A          R ABMWPG21
     A            W2ZETI         4A         COLHDG('ZETI')
     A            W2TEHI         3A         COLHDG('TEHI')
     A            W2CNT          3S 0       COLHDG('COUNT')
      *
     A          K W2ZETI
     A          K W2TEHI
