     A** ABMWPF2 *************************************
     A*副資材　箱色データ
     A*    HOTTA.                  2018.10.04        *
     A************************************************
     A          R ABMWPF21
      *
     A            W2BCCD         1A         COLHDG('箱色コード')
     A            W2BCNM         6A         COLHDG('箱色名称')
     A            W2KMAX         7S 0       COLHDG('MAX')
      *
     A          K W2BCCD
