     A** ABR6L01 *******************************************
     A*  ANDROID EDI WORK FILE(ASN & PACKING LIST)         *
     A*                                                    *
     A* TCHK1 07/14/06 CREATE(COPY FROM ABF6L01)           *
     A******************************************************
     A          R ABR6P011                  PFILE(ABR6P01)
     A                                      TEXT('ANDROID ASN & PACKING W/F')
      *
     A          K FCSEQ#
