      ** ABVWP0F **************************************
      * EDI(856) WRK FILE                             *
      *                                               *
      * TCHK  12/03/13 CREATE                         *
     A*************************************************
     A          R ABVWP0F1                  TEXT('EDI856 WORK')
     A            WDATE          8  0
     A            WTIME          6  0
     A            WPICK#         9
     A            WTRCK#        10
