     A** AB#PLLG ***************************************
     A**************************************************
     A          R ABWEP601                  PFILE(ABWEP60)
     A          K E1NONY
     A          K E1NOHZ
     A          K E1NBIN
