      *
     A          R ABWP451R                  PFILE(ABWP451)
      *
     A          K WTOKU
     A          K WNONY
     A          K WMHIN
     A          K @SHIN
     A          K WCRTDT                    DESCEND
