     A** AC#PL70 ***************************************
     A**************************************************
     A          R AC#PP701                  PFILE(AC#PP70)
      *
     A          K EKSERL
