     A** ADAPP11 ***************************************
     A* DEL/EMAIL FILE                                 *
     A* TCH32 02/23/05                                 *
     A**************************************************
     A          R ADAPP121
     A            CBTOKU         4S 0       COLHDG('CUSTOMER CODE')
     A            CBNONY         4S 0       COLHDG('DELIVERY CODE')
     A            CBEMAL        20A         COLHDG('EMAIL ADDRESS')
     A          K CBTOKU
