     A**********************************************
     A* TRANSMISSION WORKING DAY INQUIRY FILE
     A**********************************************
      *
     A          R ADAPP601                  PFILE(ADAPP60)
      *
     A          K DAKUBN
     A          K DARZBI
     A          K DATOKI
     A          K DAUKEI
     A          K DAHTBB
     A          K DAHIN1
     A          K DAHIN2
     A          K DAHIN3
     A          S DASKJY                    COMP(NE 'D')
