     A** ADKPP39 ************************************************
     A*割振り順序テーブルファイル
     A*       KATOGI.               2015.12.16                  *
     A***********************************************************
     A          R ADKPP391
     A            D$SKJY         1A         COLHDG('DELETE CODE D')
     A            D$SKHZ         8S 0       COLHDG('DELETE DATE')
     A            D$KOHZ         8S 0       COLHDG('UPDATE DATE')
     A            D$KOTI         6S 0       COLHDG('UPDATE TIME')
     A            D$KOME        10A         COLHDG('UPDATE MEMBER')
     A            D$BIN          2S 0       COLHDG('BIN')
     A            D$JUN          2S 0       COLHDG('JUN')
     A          K D$BIN
