     A** AFAPL68 *******************************************
     A*  COMBINED PARTIAL CONTAINERS                       *
     A*                                                    *
     A* TCHK1 04/27/11 CREATE                              *
     A******************************************* AFAPL68 **
     A          R AFAPP601                  PFILE(AFAPP60)
     A                                      TEXT('COMBINED PARTIAL CONTAINERS')
     A          K AAPART
     A          K AANLOT
