     A          R AFAPPNO1
     A            WFZETI         4A         COLHDG('PART ID NUMBER')
     A            WFLOTN         3A         COLHDG('LAST LOT NUMBER')
      *
     A          K WFZETI
