     A** AFAPL64 ***********************
     A*  COMBINED PARTIAL CONTAINERS   *
     A*  TCH 2000.07.21                *
     A*********************** AFAPL64 **
     A          R AFAPP601                  PFILE(AFAPP60)
     A                                      TEXT('COMBINED PARTIAL CONTAINERS')
     A          K AAAPFG
     A          S AASKJY                    COMP(EQ ' ')
     A            AAAPFG                    COMP(EQ '1')
     A            AAFLAG                    COMP(EQ ' ')
