     A*****************************************************************
     A*  Data Scan(Location,LotID,ApicsKanban)                        *
     A*                                                               *
     A*  TCH  2005.09.20                                              *
     A****************** AFAPP6X***************************************
      *
     A          R AFAPP6X1                  TEXT('COMBINED PARTIAL CONTAINERS')
     A            AXSKJY         1A         COLHDG('DELETE CODE D')
     A            AXSKYY         4S 0       COLHDG('DELETE DUE DATE' -
     A                                             '(YEAR)')
     A            AXSKMM         2S 0       COLHDG('DELETE DUE DATE' -
     A                                             '(MONTH)')
     A            AXSKDD         2S 0       COLHDG('DELETE DUE DATE' -
     A                                             '(DAY)')
     A            AXSKME        10A         COLHDG('DELETE TEAM MEMBER' -
     A                                             'PROFILE')
     A            AXSKWS        10A         COLHDG('DELETE WS')
     A            AXSKPG        10A         COLHDG('DELETE PROGRAM')
     A            AXKOYY         4S 0       COLHDG('LAST UPDATE DATE' -
     A                                             '(YEAR)')
     A            AXKOMM         2S 0       COLHDG('LAST UPDATE DATE' -
     A                                             '(MONTH)')
     A            AXKODD         2S 0       COLHDG('LAST UPDATE DATE' -
     A                                             '(DAY)')
     A            AXKOHH         2S 0       COLHDG('LAST UPDATE TIME' -
     A                                             '(TIME)')
     A            AXKOSS         2S 0       COLHDG('LAST UPDATE TIME' -
     A                                             '(MINUTES)')
     A            AXKOME        10A         COLHDG('LAST UPDATE MEMBER' -
     A                                             'PROFILE')
     A            AXKOWS        10A         COLHDG('UPDATE WS')
     A            AXKOPG        10A         COLHDG('UPDATE PROGRAM')
     A*
     A            AXCDAT         8S 0       COLHDG('CREATE DATE')
     A            AXCTIM         6S 0       COLHDG('CREATE TIME')
     A            AXCSEQ         4S 0       COLHDG('CREATE BSEQ#')
     A            AXDSEQ         5S 0       COLHDG('CREATE DSEQ#')
     A            AXKANS         1A         COLHDG('KANBAN TYPE')
     A            AXZETI         4A         COLHDG('ABSOLUTE NO')
     A            AXTEHI         3A         COLHDG('TEHI NO')
     A            AXPAGE         2A         COLHDG('PAGE NO')
     A*
     A            AXDKND        10A         COLHDG('DATA KIND')
     A            AXDATA        20A         COLHDG('SCAN DATA')
     A*
