     A** AFAWL60 *****************************
     A* COMBINED PARTIAL CONTAINERS          *
     A* TCH 2000.08.28                       *
     A***************************** AFAWL60 **
      *
     A          R AFAWP601                  PFILE(AFAWP60)
     A                                      TEXT('COMBINED PARTIAL CONTAINERS')
      *
     A          K AWDATE
     A          K AWZETI
