     A** AFCNP91 ***************************************
     A* MATERIAL ORDER DETAIL FILE RECORD NO.          *
     A*       <LOCAL PARTS PROCUREMENT SYSTEM>         *
     A*                                                *
     A* N.HYOTO 2001.06.21                             *
     A*************************************** AFCNP91 **
     A          R AFCNP911                  TEXT('ORDER DATA FILE RECORD')
     A            CAREYY         4S 0       COLHDG('YEAR')
     A            CAREMM         2S 0       COLHDG('MONTH')
     A            CARENO         2S 0       COLHDG('NUMBER')
     A*
     A          K CAREYY
     A          K CAREMM
