     A** AFDPL14 ***********************
     A*  OUTGOING DETAIL               *
     A*     DEC/                       *
     A*********************** AFDPL12 **
     A          R AFDPP101                  PFILE(AFDPP10)
     A          K ADKODT
     A          K ADSUPP
     A          K ADPAR1
     A          K ADPAR2
     A          K ADPAR3
     A          K ADODNO
