     A** AFDPL30 *******************************************
     A*  OUTGOING DETAIL LOG FILE(KOSHIN DATE,TIME)        *
     A*                                                    *
     A* TCHK1 11/01/07 CREATE                              *
     A******************************************* AFDPL30 **
     A          R AFDPP301                  PFILE(AFDPP30)
     A*
     A          K ADKODT
     A          K ADKOTM
     A          K ADSUPP
     A          K ADBINN
