     A** AFDP280 *******************************************
     A*  OUTGOING DETAIL LOG FILE(KOSHIN DATE,TIME)        *
     A*                                                    *
     A* TCHK1 11/01/07 CREATE                              *
     A******************************************* AFDPL30 **
     A          R AFDPP201                  PFILE(AFDPP20)
     A*
     A          K AFKODT
     A          K AFKHMS
     A          K AFSUPP
     A          K AFBINN
