     A** AFDPL20 ***********************
     A*  OUTGOING ORDER FILE           *
     A*     DEC/                       *
     A*********************** AFDPL20 **
     A          R AFDPP201                  PFILE(AFDPP20)
     A          K AFSUPP
     A          K AFODYY
     A          K AFODMM
     A          K AFODDD
     A          K AFBINN
