     A** AFDPL21 ***********************
     A*  OUTGOING ORDER FILE           *
     A*     DEC/                       *
     A*********************** AFDPL21 **
     A          R AFDPP201                  PFILE(AFDPP20)
     A          K AFSUPP
     A          K AFBINN
     A          K AFNOYY
     A          K AFNOMM
     A          K AFNODD
     A          K AFODYY
     A          K AFODMM
     A          K AFODDD
