      ** AFDPLOS ******************************************************
      *  OUTSOURCE RACK STORE IN FILE                                 *
      *                                                               *
      *****************************************************************
     A          R AFDPPOS1                  PFILE(AFDPPOS)
      *
     A          K ARLTNO
     A          K ARPZET
