     A** AG#PP20  ******************************************
     A* SALES UNIT PRICE UPDATE DATA                       *
     A*                                                    *
     A* TCHK  03/07/12 CREATE                              *
     A******************************************************
     A          R AG#PP201                  TEXT('PRICE UPDATE')
     A            G2KODT         8S 0       COLHDG('UPDATE DATE')
     A            G2KOTM         6S 0       COLHDG('UPDATE TIME')
      *
     A            G2TOKU         4A         COLHDG('TOKU')
     A            G2NONY         4A         COLHDG('NONY')
     A            G2MHN1         5A         COLHDG('USER PART1')
     A            G2MHN2         5A         COLHDG('USER PART2')
     A            G2MHN3         5A         COLHDG('USER PART3')
     A            G2MHN4         5A         COLHDG('USER PART4')
     A            G2EFYY         4S 0       COLHDG('EFECTIVE YYYY')
     A            G2EFMM         2S 0       COLHDG('EFECTIVE MM')
     A            G2EFDD         2S 0       COLHDG('EFECTIVE DD')
     A            G2PRIC         9S 4       COLHDG('PRICE')
      *
     A            G2PROC         1A         COLHDG('PROCESS')
      * ADDED BY JW
ADD  A            G2PLID         3A         COLHDG('PLANT ID')
ADD  A            G2REF2         5A         COLHDG('PRICE REFERENCE')
ADD  A            G2REF4        10A         COLHDG('PRICE PLANT ID')
ADD  A            G2XDAT         8S 0       COLHDG('EXPIRED DATE')
