     A** AH#PL70 ***************************************
     A* ORANGE/YELLOW FLAG LIST
     A*                                                       *
     A*         TCH NOV/12/04                          *
     A**************************************************
      *
     A          R AH#PP701                  PFILE(AH#PP70)
      *
     A          K AHDATE
     A          K AHPRT1
     A          K AHPRT2
     A          K AHPRT3
