     A** AH#PL70 ***************************************
     A* ORANGE/YELLOW FLAG LIST
     A*                                                       *
     A*         TCH NOV/12/04                          *
     A**************************************************
      *
     A          R AH#PP701                  PFILE(AH#PP70)
      *
     A          K AHDATE
     A          K AHLOC1
     A          K AHLOC2
     A          K AHLOC3
     A          K AHLOC4
