     A** AH#PP79 ***************************************
     A* YLW/ORANGE FLAG                                     *.
     A*      MATERIAL
     A*
     A* TCHK1 10/06/06 CREATE
     A**************************************************
     A          R AH#WP791                  PFILE(AH#WP79)
     A*
     A          K AWSUPL
     A          K AWZAIS
     A          K AWZAIK
     A          K AWPRT1
     A          K AWPRT2
     A          K AWPRT3
