     A*** AIANP04 **********************
     A* DAILY HANDLING             *
     A* M/F CHANGE TRANSMISSION DATA *
     A* H.ITO 86.11.15 *
     A********************** AIANP04 ***
     A          R AIANP041                  TEXT('M/F CHANGE TRANSMISSION DATA')
     A            DDDTCD         2          COLHDG('DATA CLASSIFICATION')
     A            DDDATA       298          COLHDG('M/F DATA')
     A          K DDDTCD
