     A** AJ#PP40 *****************************
     A* YELLOW FLAG - LOADING LOC. /QTY      *
     A* TCH 04/29/05                         *
TCHK A* TCH 08/09/05                         *
     A***************************** INVPP20 **
      *
     A          R AJ#PP401                  TEXT('FOR YELLOW FLAG')
      *
     A            I2LOC          6A         COLHDG('LOCATION')
     A            I2QTY         11S 0       COLHDG('MINASI')
     A            I2MINO        11S 0       COLHDG('MINO')
     A            I2UNS          6S 1       COLHDG('UNS')
     A            I2SHN1         5A         COLHDG('PART NO1')
     A            I2SHN2         5A         COLHDG('2')
     A            I2SHN3         2A         COLHDG('3')
TCHK A            I2DATE         8S 0       COLHDG('DATE')
TCHK A            I2TIME         6S 0       COLHDG('TIME')
     A          K I2LOC
