     A** AJHPPTB **********************************************
     A* 2ND PROCESS CONDITION CODE TABLE                      *
     A* C:T.SAKAKI                    2020.09.21              *
     A*********************************************************
     A          R AJHPPTB1
     A            JBCODE         2A         COLHDG('CONDTION CODE')
     A*  "@" FOR ALL MACHINE
     A            JBMACH         1A         COLHDG('MACHINE # JC*')
     A            JBNOTE        20A         COLHDG('NOTE')
