     A** AJNPP05 *********************************
     A*納期遵守率の見える化TIME RANGE M/F      *
     A*   SAKAKI.               2019.10.04       *
     A********************************************
     A          R AJNPP051
     A            CNSKJY         1A         COLHDG('DELETE CODE')
     A            CNSKHZ         8S 0       COLHDG('DELETE DUE DATE')
     A            CNKOHZ         8S 0       COLHDG('UPDATE WORK DATE')
     A            CNKOTI         6S 0       COLHDG('UPDATE WORK TIME')
     A            CNKOME        10A         COLHDG('UPDATE WORKER')
     A            CNTYPE         1A         COLHDG('TYPE')
     A            CNHH           4S 0       COLHDG('TIME RANGE')
      * * KEY
     A          K CNTYPE
     A          K CNHH
