      ** AKAWP60 ***************************
      *  DOWNLOAD WORK FILE                *
      *        AUG/12/04  TCH(TANE)        *
TCH67 *  ADDED 2 FIELDS                    *
      *************************** AKAWP60 **
     A          R AKAWP601
     A            AWSUPP         4          COLHDG('Supplier')
     A            AWPART        15          COLHDG('Part#')
     A            AWZANM        15          COLHDG('Wire Grade')
     A            AWKAZI         5S 2       COLHDG('Wire Size')
     A            AWWSH1        12          COLHDG('WASHER 1')
     A            AWWLC1         9          COLHDG('Washer Location1')
     A            AWWSH2        12          COLHDG('WASHER 2')
     A            AWWLC2         9          COLHDG('Washer Location2')
     A            AWWSH3        12          COLHDG('WASHER 3')
     A            AWWLC3         9          COLHDG('Washer Location3')
     A            AWWSH4        12          COLHDG('WASHER 4')
     A            AWWLC4         9          COLHDG('Washer Location4')
     A            AWKASI         7P 2       COLHDG('Unit Weight')
     A            AWGEKN         9P 0       COLHDG('Monthly Setting')
     A            AWTNSU         9P 0       COLHDG('Actual Shipping Qty')
     A            AWQPC          7P 0       COLHDG('Qty per Container')
     A            AWCPD          7P 2       COLHDG('Container per days')
TCH67A            AWKMAX         3S 0       COLHDG('MAX')
TCH67A            AWMAXH         3S 0       COLHDG('SAFETY')
     A            AWPL01        10          COLHDG('Process Location 01')
     A            AWMC01         3          COLHDG('MACHINE 1')
     A            AWPL02        10          COLHDG('Process Location 02')
     A            AWMC02         3          COLHDG('MACHINE 2')
     A            AWPL03        10          COLHDG('Process Location 03')
     A            AWMC03         3          COLHDG('MACHINE 3')
     A            AWPL04        10          COLHDG('Process Location 04')
     A            AWMC04         3          COLHDG('MACHINE 4')
     A            AWPL05        10          COLHDG('Process Location 05')
     A            AWMC05         3          COLHDG('MACHINE 5')
     A            AWPL06        10          COLHDG('Process Location 06')
     A            AWMC06         3          COLHDG('MACHINE 6')
     A            AWPL07        10          COLHDG('Process Location 07')
     A            AWMC07         3          COLHDG('MACHINE 7')
     A            AWPL08        10          COLHDG('Process Location 08')
     A            AWMC08         3          COLHDG('MACHINE 8')
     A            AWPL09        10          COLHDG('Process Location 09')
     A            AWMC09         3          COLHDG('MACHINE 9')
     A            AWPL10        10          COLHDG('Process Location 10')
     A            AWMC10         3          COLHDG('MACHINE 10')
     A            AWPL11        10          COLHDG('Process Location 11')
     A            AWMC11         3          COLHDG('MACHINE 11')
     A            AWPL12        10          COLHDG('Process Location 12')
     A            AWMC12         3          COLHDG('MACHINE 12')
     A            AWPL13        10          COLHDG('Process Location 13')
     A            AWMC13         3          COLHDG('MACHINE 13')
     A            AWPL14        10          COLHDG('Process Location 14')
     A            AWMC14         3          COLHDG('MACHINE 14')
     A            AWPL15        10          COLHDG('Process Location 15')
     A            AWMC15         3          COLHDG('MACHINE 15')
     A*
     A          K AWSUPP
     A          K AWPART
     A          K AWZANM
     A          K AWKAZI
