     A** AKCPPN1 ***********************
     A* .. COMPONENTS PART INFORMATION M/F   *.
     A* .. ID NUMBER           *
     A* I-HASADA           92.07.29    *
     A*********************** AKCPPN1 **
     A          R AKCPPN11                  TEXT('COMPONENTS PART INFORMATION +
     A                                             M/F ID  NUMBER'     )
     A            K7ZN01         1          COLHDG('ID NO. 1' -
     A                                             'COLUMN')
     A            K7ZN24         3S 0       COLHDG('2-4 COLUMNS')
