     A** AKEPP01 *********************************
     A* .. COMPONENTS KANBAN CHANGE M/F   *.
     A* I-HASADA                    92.06.12     *
     A********************************* AKEPP01 **
     A          R AKEPP011                  TEXT('COMPONENTS KANBAN RESHUFFLE +
     A                                             M/F')
     A            M3SKJY         1          COLHDG('DELETE CODE')
     A            M3SKYY         4S 0       COLHDG('DELETE DUE DATE YEAR')
     A            M3SKMM         2S 0       COLHDG('MONTH')
     A            M3SKDD         2S 0       COLHDG('DAY')
     A            M3KOYY         4S 0       COLHDG('UPDATE WORK DATE' -
     A                                             'YEAR')
     A            M3KOMM         2S 0       COLHDG('MONTH')
     A            M3KODD         2S 0       COLHDG('DAY')
     A            M3KOHH         2S 0       COLHDG('UPDATE WORK' -
     A                                             'TIME(TIME)')
     A            M3KOSS         2S 0       COLHDG('MINUTES')
     A            M3KOME        10A         COLHDG('NAME OF TEAM MEMBER' -
     A                                             'WHO UPDATE')
     A            M3HIN1         5A         COLHDG('COMPONENTS PART' -
     A                                             'NUMBER')
     A            M3HIN2         5A         COLHDG('2')
     A            M3HIN3         2A         COLHDG('3')
     A            M3KO01         3A         COLHDG('PROCESS CODE 1')
     A            M3KO02         3A         COLHDG('2')
     A            M3KO03         3A         COLHDG('3')
     A            M3KO04         3A         COLHDG('4')
     A            M3KO05         3A         COLHDG('5')
     A            M3KO06         3A         COLHDG('6')
     A            M3KO07         3A         COLHDG('7')
     A            M3KO08         3A         COLHDG('8')
     A            M3KO09         3A         COLHDG('9')
     A            M3KO10         3A         COLHDG('10')
     A            M3KO11         3A         COLHDG('11')
     A            M3KO12         3A         COLHDG('12')
     A            M3KO13         3A         COLHDG('13')
     A            M3KO14         3A         COLHDG('14')
     A            M3KO15         3A         COLHDG('15')
     A            M3BM01         4S 0       COLHDG('DEPARTMENT CODE 1')
     A            M3BM02         4S 0       COLHDG('2')
     A            M3BM03         4S 0       COLHDG('3')
     A            M3BM04         4S 0       COLHDG('4')
     A            M3BM05         4S 0       COLHDG('5')
     A            M3BM06         4S 0       COLHDG('6')
     A            M3BM07         4S 0       COLHDG('7')
     A            M3BM08         4S 0       COLHDG('8')
     A            M3BM09         4S 0       COLHDG('9')
     A            M3BM10         4S 0       COLHDG('10')
     A            M3BM11         4S 0       COLHDG('11')
     A            M3BM12         4S 0       COLHDG('12')
     A            M3BM13         4S 0       COLHDG('13')
     A            M3BM14         4S 0       COLHDG('14')
     A            M3BM15         4S 0       COLHDG('15')
     A            M3HB01        12A         COLHDG('INTRA-PROCESS PART' -
     A                                             'NUMBER 1')
     A            M3HB02        12A         COLHDG('2')
     A            M3HB03        12A         COLHDG('3')
     A            M3HB04        12A         COLHDG('4')
     A            M3HB05        12A         COLHDG('5')
     A            M3HB06        12A         COLHDG('6')
     A            M3HB07        12A         COLHDG('7')
     A            M3HB08        12A         COLHDG('8')
     A            M3HB09        12A         COLHDG('9')
     A            M3HB10        12A         COLHDG('10')
     A            M3HB11        12A         COLHDG('11')
     A            M3HB12        12A         COLHDG('12')
     A            M3HB13        12A         COLHDG('13')
     A            M3HB14        12A         COLHDG('14')
     A            M3HB15        12A         COLHDG('15')
     A            M3NB01         6A         COLHDG('LOCATION CODE 1')
     A            M3NB02         6A         COLHDG('2')
     A            M3NB03         6A         COLHDG('3')
     A            M3NB04         6A         COLHDG('4')
     A            M3NB05         6A         COLHDG('5')
     A            M3NB06         6A         COLHDG('6')
     A            M3NB07         6A         COLHDG('7')
     A            M3NB08         6A         COLHDG('8')
     A            M3NB09         6A         COLHDG('9')
     A            M3NB10         6A         COLHDG('10')
     A            M3NB11         6A         COLHDG('11')
     A            M3NB12         6A         COLHDG('12')
     A            M3NB13         6A         COLHDG('13')
     A            M3NB14         6A         COLHDG('14')
     A            M3NB15         6A         COLHDG('15')
     A            M3TY01         1A         COLHDG('KANBAN KIND 1')
     A            M3TY02         1A         COLHDG('2')
     A            M3TY03         1A         COLHDG('3')
     A            M3TY04         1A         COLHDG('4')
     A            M3TY05         1A         COLHDG('5')
     A            M3TY06         1A         COLHDG('6')
     A            M3TY07         1A         COLHDG('7')
     A            M3TY08         1A         COLHDG('8')
     A            M3TY09         1A         COLHDG('9')
     A            M3TY10         1A         COLHDG('10')
     A            M3TY11         1A         COLHDG('11')
     A            M3TY12         1A         COLHDG('12')
     A            M3TY13         1A         COLHDG('13')
     A            M3TY14         1A         COLHDG('14')
     A            M3TY15         1A         COLHDG('15')
     A            M3HZ01        10S 0       COLHDG('KANBAN CHANGE DATE /' -
     A                                             'BIN 1')
     A            M3HZ02        10S 0       COLHDG('2')
     A            M3HZ03        10S 0       COLHDG('3')
     A            M3HZ04        10S 0       COLHDG('4')
     A            M3HZ05        10S 0       COLHDG('5')
     A            M3HZ06        10S 0       COLHDG('6')
     A            M3HZ07        10S 0       COLHDG('7')
     A            M3HZ08        10S 0       COLHDG('8')
     A            M3HZ09        10S 0       COLHDG('9')
     A            M3HZ10        10S 0       COLHDG('10')
     A            M3HZ11        10S 0       COLHDG('11')
     A            M3HZ12        10S 0       COLHDG('12')
     A            M3HZ13        10S 0       COLHDG('13')
     A            M3HZ14        10S 0       COLHDG('14')
     A            M3HZ15        10S 0       COLHDG('15')
      *
     A            M3QK01         3A         COLHDG('OLD  PROCESS CODE 1')
     A            M3QK02         3A         COLHDG('2')
     A            M3QK03         3A         COLHDG('3')
     A            M3QK04         3A         COLHDG('4')
     A            M3QK05         3A         COLHDG('5')
     A            M3QK06         3A         COLHDG('6')
     A            M3QK07         3A         COLHDG('7')
     A            M3QK08         3A         COLHDG('8')
     A            M3QK09         3A         COLHDG('9')
     A            M3QK10         3A         COLHDG('10')
     A            M3QK11         3A         COLHDG('11')
     A            M3QK12         3A         COLHDG('12')
     A            M3QK13         3A         COLHDG('13')
     A            M3QK14         3A         COLHDG('14')
     A            M3QK15         3A         COLHDG('15')
     A            M3QB01         4S 0       COLHDG('OLD DEPARTMENT CODE' -
     A                                             '1')
     A            M3QB02         4S 0       COLHDG('2')
     A            M3QB03         4S 0       COLHDG('3')
     A            M3QB04         4S 0       COLHDG('4')
     A            M3QB05         4S 0       COLHDG('5')
     A            M3QB06         4S 0       COLHDG('6')
     A            M3QB07         4S 0       COLHDG('7')
     A            M3QB08         4S 0       COLHDG('8')
     A            M3QB09         4S 0       COLHDG('9')
     A            M3QB10         4S 0       COLHDG('10')
     A            M3QB11         4S 0       COLHDG('11')
     A            M3QB12         4S 0       COLHDG('12')
     A            M3QB13         4S 0       COLHDG('13')
     A            M3QB14         4S 0       COLHDG('14')
     A            M3QB15         4S 0       COLHDG('15')
     A            M3QH01        12A         COLHDG('OLD INTRA-PROCESS' -
     A                                             'PART NUMBER 1')
     A            M3QH02        12A         COLHDG('2')
     A            M3QH03        12A         COLHDG('3')
     A            M3QH04        12A         COLHDG('4')
     A            M3QH05        12A         COLHDG('5')
     A            M3QH06        12A         COLHDG('6')
     A            M3QH07        12A         COLHDG('7')
     A            M3QH08        12A         COLHDG('8')
     A            M3QH09        12A         COLHDG('9')
     A            M3QH10        12A         COLHDG('10')
     A            M3QH11        12A         COLHDG('11')
     A            M3QH12        12A         COLHDG('12')
     A            M3QH13        12A         COLHDG('13')
     A            M3QH14        12A         COLHDG('14')
     A            M3QH15        12A         COLHDG('15')
     A            M3QT01         6A         COLHDG('OLD LOCATION CODE 1')
     A            M3QT02         6A         COLHDG('2')
     A            M3QT03         6A         COLHDG('3')
     A            M3QT04         6A         COLHDG('4')
     A            M3QT05         6A         COLHDG('5')
     A            M3QT06         6A         COLHDG('6')
     A            M3QT07         6A         COLHDG('7')
     A            M3QT08         6A         COLHDG('8')
     A            M3QT09         6A         COLHDG('9')
     A            M3QT10         6A         COLHDG('10')
     A            M3QT11         6A         COLHDG('11')
     A            M3QT12         6A         COLHDG('12')
     A            M3QT13         6A         COLHDG('13')
     A            M3QT14         6A         COLHDG('14')
     A            M3QT15         6A         COLHDG('15')
     A            M3QS01         1A         COLHDG('OLD KANBAN KIND 1')
     A            M3QS02         1A         COLHDG('2')
     A            M3QS03         1A         COLHDG('3')
     A            M3QS04         1A         COLHDG('4')
     A            M3QS05         1A         COLHDG('5')
     A            M3QS06         1A         COLHDG('6')
     A            M3QS07         1A         COLHDG('7')
     A            M3QS08         1A         COLHDG('8')
     A            M3QS09         1A         COLHDG('9')
     A            M3QS10         1A         COLHDG('10')
     A            M3QS11         1A         COLHDG('11')
     A            M3QS12         1A         COLHDG('12')
     A            M3QS13         1A         COLHDG('13')
     A            M3QS14         1A         COLHDG('14')
     A            M3QS15         1A         COLHDG('15')
     A            M3SU01         9P 0       COLHDG('SETTING NUMBER')
     A            M3SU02         9P 0       COLHDG('2')
     A            M3SU03         9P 0       COLHDG('3')
     A            M3SU04         9P 0       COLHDG('4')
     A            M3SU05         9P 0       COLHDG('5')
     A            M3SU06         9P 0       COLHDG('6')
     A            M3SU07         9P 0       COLHDG('7')
     A            M3SU08         9P 0       COLHDG('8')
     A            M3SU09         9P 0       COLHDG('9')
     A            M3SU10         9P 0       COLHDG('10')
     A            M3SU11         9P 0       COLHDG('11')
     A            M3SU12         9P 0       COLHDG('12')
     A            M3SU13         9P 0       COLHDG('13')
     A            M3SU14         9P 0       COLHDG('14')
     A            M3SU15         9P 0       COLHDG('15')
     A            M3MN01         8S 0       COLHDG('UPDATE DATE' -
     A                                             'PROCESS-1')
     A            M3MN02         8S 0       COLHDG('2')
     A            M3MN03         8S 0       COLHDG('3')
     A            M3MN04         8S 0       COLHDG('4')
     A            M3MN05         8S 0       COLHDG('5')
     A            M3MN06         8S 0       COLHDG('6')
     A            M3MN07         8S 0       COLHDG('7')
     A            M3MN08         8S 0       COLHDG('8')
     A            M3MN09         8S 0       COLHDG('9')
     A            M3MN10         8S 0       COLHDG('10')
     A            M3MN11         8S 0       COLHDG('11')
     A            M3MN12         8S 0       COLHDG('12')
     A            M3MN13         8S 0       COLHDG('13')
     A            M3MN14         8S 0       COLHDG('14')
     A            M3MN15         8S 0       COLHDG('15')
     A            M3CG01         1A         COLHDG('REVISION INSTRUCTION' -
     A                                             '(*) 1')
     A            M3CG02         1A         COLHDG('2')
     A            M3CG03         1A         COLHDG('3')
     A            M3CG04         1A         COLHDG('4')
     A            M3CG05         1A         COLHDG('5')
     A            M3CG06         1A         COLHDG('6')
     A            M3CG07         1A         COLHDG('7')
     A            M3CG08         1A         COLHDG('8')
     A            M3CG09         1A         COLHDG('9')
     A            M3CG10         1A         COLHDG('10')
     A            M3CG11         1A         COLHDG('11')
     A            M3CG12         1A         COLHDG('12')
     A            M3CG13         1A         COLHDG('13')
     A            M3CG14         1A         COLHDG('14')
     A            M3CG15         1A         COLHDG('15')
