     A** AL#PP00 ************************************
     A*  CONSTANT VALUE                             *
     A*     ITS.        2015.05.20                  *
     A***********************************************
     A          R AL#PP001
     A            C0KEY         10A         COLHDG('KEY')
     A            C0VALU         3S 0       COLHDG('CONSTANT VALUE')
     A            C0TXT         50A         COLHDG('TEXT')
     A          K C0KEY
