     A** AL#PPX1 ************************************
     A*  TOYOTA LABEL ISSUE DATA                    *
     A*     SAKAKI.     2020.02.06                  *
     A***********************************************
     A          R AL#PPX11
      *
     A            CRKOHZ         8S 0       COLHDG('UPDATE WORK DATE')
     A            CRKOTI         6S 0       COLHDG('UPDATE WORK TIME')
      *
     A            CRFIXD         8S 0       COLHDG('PALLET FIX DATE')
     A            CRFIXT         6S 0       COLHDG('PALLET FIX TIME')
     A            CRTIMS         2S 0       COLHDG('PALLET FIX TIMES')
     A            CRTRKB         2A         COLHDG('IAF TRUCK BIN#')
     A            CRIAFB         3A         COLHDG('IAF BIN#')
     A            CRIAFP         3A         COLHDG('IAF PALLET#')
     A            CRLOCA         6A         COLHDG('LOCATION')
     A            CRZONE         1A         COLHDG('IAF ZONE')
     A            CRNONY         4A         COLHDG('DELIV')
     A            CRNKOJ         1A         COLHDG('FACTORY')
     A            CRNUKE         2A         COLHDG('DOCK')
     A            CRTPUL         2A         COLHDG('TOYOTA PALLET')
     A            CRORD#        12A         COLHDG('TOYOTA ORDER')
     A            CRPPUL         1A         COLHDG('PALLET PULL')
     A            CRPAGE         3S 0       COLHDG('PAGE#')
     A            CRTPAG         3S 0       COLHDG('TOTAL PAGE#')
