     A** AL#PP02 ************************************
     A*  EDI SUPPLEMENT & EXPORT WEB ORDER DATA     *
     A*     LEC.        2019.02.27                  *
     A***********************************************
     A          R AL#PP021                  PFILE(AL#PP02)
      * KEY
     A          K CAWBRD
     A          K CAORD#
     A          K CAMHN
     A          K CASHID
