     A** AL#WP71 ************************************
     A*  ISSUE TOYOTA LABELS(KANBAN)                *
     A*     ITS.        2015.05.26                  *
     A***********************************************
     A          R AL#WP711
      *
     A            W1CADT         1A         COLHDG('CARD TYPE')
     A            W1SUPI        30A         COLHDG('SUPPLIER INFO')
     A            W1SUPC         5A         COLHDG('SUPPLIER CODE')
     A            W1DOCK         2A         COLHDG('DOCK CODE')
     A            W1KNB#         4A         COLHDG('KANBAN#')
     A            W1MHN         12A         COLHDG('PART#')
     A            W1LIAD        10A         COLHDG('LINESIDE ADDRESS')
     A            W1STAD        10A         COLHDG('STORES ADDRESS')
     A            W1QTBO         5A         COLHDG('QTY PER BOX')
     A            W1SUPN        20A         COLHDG('SUPPLIER NAME')
     A            W1MART         9A         COLHDG('MAIN ROUTE')
     A            W1SURT         9A         COLHDG('SUB ROUTE')
     A            W1ULDA         8A         COLHDG('UNLOAD DATE')
     A            W1SHID         8A         COLHDG('SHIP DATE')
     A            W1SHIT         6A         COLHDG('SHIP TIME')
     A            W1ORD#        12A         COLHDG('ORDER#')
     A            W1BOX#         4A         COLHDG('BOX#')
     A            W1BOXT         4A         COLHDG('BOX TOTAL')
     A            W1NAMC         5A         COLHDG('NAMC DESTINATION')
     A            W1INKK        17A         COLHDG('INTERNAL KANBAN KEY')
     A            W1LPOS         2A         COLHDG('LABEL POSITION' -
     A                                             'NAMC_DATA_1')
     A            W1NAM2        10A         COLHDG('NAMC_DATA_2')
     A            W1NAM3         2A         COLHDG('NAMC_DATA_3')
     A            W1PALT         2A         COLHDG('PALLET CODE' -
     A                                             'NAMC_DATA_4')
     A            W1NAD5        10A         COLHDG('NAMC_DATA_5')
     A            W1NAD6         2A         COLHDG('NAMC_DATA_6')
     A            W1FILL        45A         COLHDG('FILLER')
      *
     A            W1SEQ#         5S 0       COLHDG('KANBAN SEQ#')
     A            W1IAFB         3A         COLHDG('IAF BIN#')
     A            W1IAFP         3A         COLHDG('IAF PALLET CODE')
     A            W1TKR1         1A         COLHDG('LOC1')
     A            W1TKR2         2A         COLHDG('LOC2')
     A            W1TKR3         2A         COLHDG('LOC3')
     A            W1TKR4         1A         COLHDG('LOC4')
     A            W1PPUL         1A         COLHDG('PALLET PULLING')
     A            W1EXT          1A         COLHDG('EXTRA KANBAN')
     A            W1SAT          1A         COLHDG('SATURDAY')
     A            W1TOKU         4S 0       COLHDG('CUSTOMER CODE')
     A            W1NONY         4S 0       COLHDG('DELIVERY CODE')
     A            W1NKOJ         1A         COLHDG('DELIVERY FACTORY')
     A            W1NUKE         4A         COLHDG('DELIVERY RECEIVING')
     A            W1FIXD         8S 0       COLHDG('PALLET FIX DATE')
     A            W1FIXT         6S 0       COLHDG('PALLET FIX TIME')
     A            W1TIMS         2S 0       COLHDG('PALLET FIX TIMES')
     A            W1SHN1         5A         COLHDG('PART NO1')
     A            W1SHN2         5A         COLHDG('2')
     A            W1SHN3         2A         COLHDG('3')
     A            W1SYOT         1A         COLHDG('UNIT')
     A            W1EXTR         3S 0       COLHDG('EXTRA#')
     A            W1SECT         2A         COLHDG('SECTION')
     A            W1FLG          1A         COLHDG('FLG')
     A            W1ZONE         1A         COLHDG('ZONE CODE')
      * SORT KEY
     A            W1#K01        10A         COLHDG('SORT KEY01')
     A            W1#K02        10A         COLHDG('SORT KEY02')
     A            W1#K03        10A         COLHDG('SORT KEY03')
     A            W1#K04        10A         COLHDG('SORT KEY04')
     A            W1#K05        10A         COLHDG('SORT KEY05')
     A            W1#K06        10A         COLHDG('SORT KEY06')
     A            W1#K07        10A         COLHDG('SORT KEY07')
     A            W1#K08        10A         COLHDG('SORT KEY08')
     A            W1#K09        10A         COLHDG('SORT KEY09')
     A            W1#K10        10A         COLHDG('SORT KEY10')
     A          K W1#K01
     A          K W1#K02
     A          K W1#K03
     A          K W1#K04
     A          K W1#K05
     A          K W1#K06
     A          K W1#K07
     A          K W1#K08
     A          K W1#K09
     A          K W1#K10
