     A** AL#WPC0 ************************************
     A*  TRUCK BIN M/F                              *
     A*     ITS.        2015.06.05                  *
     A***********************************************
     A          R AL#WPC01
     A            W0KIHZ         8S 0       COLHDG('CHANGE DATE')
     A          K W0KIHZ
