      ** ALDPL6A ***************************************
      * SHIPPING SHORTAGE FILE                         *
      *                                                *
      *************************************** ALDPL6A **
     A          R ALDPP651                  PFILE(ALDPP65)
      * KEYS
     A****      K AFUKAN       250A         COLHDG('USER KANBAN')
      * KEYS
     A          K AFUKAN
