      ** ALDPL36A **************************************
      *  INTRA STORE LOCATION                          *
      *  LEC   2024.12.19                              *
      **************************************************
     A          R ALDPP361                  PFILE(ALDPP36)
      *
     A          K B9ABAR
     A          K B9CODT
     A          K B9COTM
