      ** ALDPL46 *******************************************
      *  OUT-GOING TRACK DATA FILE. <QSS KANBAN>           *
      *                                                    *
      * TCHK  02/09/11 CREATE                              *
      ******************************************************
     A          R ALDPP451                  PFILE(ALDPP45)
      * AIAG SERIAL
     A          K AESERL
