     A** ALDPP90 **********************
     A*  WORK FILE FOR 2-POINT SCAN   *
     A*                               *
     A********************** ALDPP90 **
      *
     A          R ALDWP911                  TEXT('2-POINT SCAN CHEKC LIST')
     A*
     A            INOHZ          8S 0       COLHDG('SHIPPING DATE')
     A            INOTM          2S 0       COLHDG('SHIPPING BIN')
     A            ISIRE         10A         COLHDG('SUPPLIER FOR PRINT')
     A            ISIRK          1A         COLHDG('SUPPLIER FACTORY')
     A            INUKE          4A         COLHDG('DOCK')
     A            IODRN         10A         COLHDG('ORDER NUMBER')
     A            ISBAN          4A         COLHDG('KANBAN NUMBER')
     A            IMHN          20A         COLHDG('USER PART NUMBER')
     A            ISRYO         10S 0       COLHDG('REQUESTED QTY.')
     A            ISYOS          6S 0       COLHDG('QTY./CONTAINERS')
     A            ISHN          12A         COLHDG('INTERNAL PART#')
     A            ITOKU          4S 0       COLHDG('CUSTOMER CODE')
     A            INONY          4S 0       COLHDG('DELIVERY CODE')
     A            INKOJ          1A         COLHDG('RECEIVING FACTORY')
     A            FC#BOX         9S 0       COLHDG('NUMBER OF CONTAI' -
     A                                             'NERS')
     A            ILOT           3          COLHDG('LOT')
     A            IPAG           2          COLHDG('PAGE')
     A*
     A          K INOHZ
     A          K INONY
     A          K INKOJ
     A          K INUKE
     A          K IMHN
