      ** ALDWP2Z ***************************************
      * TEMPORARY FILE                                 *
      *                                                *
      *************************************** ALDPP30 **
     A          R ALDWP2Z1                  TEXT('TEMPORARY FILE')
     A            AZNONY         4S 0       COLHDG('SHIP TO')
     A            AZNUKE         4          COLHDG('DOCK')
     A            AZNKOJ         1          COLHDG('FACTIRT')
     A          K AZNUKE
