      ** ALGPL11 *******************************************
      *  OQ INPROCESS SCAN RESULT FILE(LOTID)              *
      *                                                    *
      * TCHK  07/19/11 CREATE                              *
      ******************************************************
     A          R ALGPP111                  PFILE(ALGPP11)
     A*
     A          K ABLOT0
     A          K ABSCYY
     A          K ABSCMM
     A          K ABSCDD
     A          K ABSCTM
