     A** ALGPP31 *******************************************
     A*  OQ - NONCONFORMANCE CODE MASTER FILE              *
     A*                                                    *
      *
     A          R ALGPP311
     A            M1CODE         3A         COLHDG('N/C CODE')
     A            M1AREA        15A         COLHDG('AREA')
     A            M1MESG        50A         COLHDG('CODE DESCRIPTION')
      *
     A          K M1CODE
