      ** ALMPL11 *******************************************
      *  SB INPROCESS SCAN RESULT FILE(LOTID)              *
      *                                                    *
      * TCHK  08/01/14 CREATE(COPY FROM ALLPL11)           *
      ******************************************************
     A          R ALMPP111                  PFILE(ALMPP11)
     A*
     A          K ABLOT0
     A          K ABSCYY
     A          K ABSCMM
     A          K ABSCDD
     A          K ABSCTM
