      ** ALOPL01 *******************************************
      *  SHORTAGE KANBAN DDATA                             *
      *                                                    *
      * TCHK  10/06/14 CREATE                              *
      ******************************************************
      *
     A          R ALOPP011                  PFILE(ALOPP01)
     A*
     A          K ALDDAT
     A          K ALSHFT
     A          K ALPROC
