     A** ALPPP01 *******************************************
     A*  PARTS MOVER INTO/OUT 2-POINT SCAN RESULT FILE     *
     A*                                                    *
     A* TCHK1 08/19/14 CREATE                              *
     A******************************************************
      *
     A          R ALPPP011
     A            A8DATE         8S 0       COLHDG('DATE')
     A            A8TIME         6S 0       COLHDG('TIME')
     A            A8USER        10          COLHDG('INPUT USER')
     A            A8WSID        10          COLHDG('INPUT WS')
     A            A8PGID        10          COLHDG('INPUT PGM')
     A            A8TMCD        10          COLHDG('INPUT TM')
     A*
     A            A8ERR          1          COLHDG('ERR/OK')
     A            A8IO           1          COLHDG('INTO/OUT')
     A* PART
     A            A8PR11         5          COLHDG('PART11')
     A            A8PR12         5          COLHDG('PART12')
     A            A8PR13         2          COLHDG('PART13')
     A* LOCATION
     A            A8BRC1        15          COLHDG('BARCODE2')
     A            A8B2LZ         4          COLHDG('ZETI')
     A            A8B2L1         1          COLHDG('LOC1')
     A            A8B2L2         2          COLHDG('LOC2')
     A            A8B2L3         2          COLHDG('LOC3')
     A            A8B2L4         1          COLHDG('LOC4')
     A* APICS KANBAN
     A            A8BRC2        15          COLHDG('BARCODE1')
     A            A8KANS         1          COLHDG('KIND')
     A            A8ZETI         4          COLHDG('ID#')
     A            A8LOT#         3          COLHDG('LOT#')
     A            A8PAG#         2          COLHDG('PAGE#')
     A* ERROR MSG
     A            A8EM01        20          COLHDG('ERROR#1')
     A            A8EM02        20          COLHDG('ERROR#2')
     A            A8EM03        20          COLHDG('ERROR#3')
     A            A8EM04        20          COLHDG('ERROR#4')
     A            A8EM05        20          COLHDG('ERROR#5')
     A*
     A          K A8DATE
     A          K A8TIME
