     A** ALXWP01 *******************************************
     A*  TEMP FOR 3 POINT SCAN                             *
     A*                                                    *
     A* T.SAKAKI    05/11/2015                             *
     A******************************************************
      *
     A          R ALXWP011
     A            A8TXT1        18          COLHDG('TXT1')
     A            A8TXT2        15          COLHDG('TXT2')
