     A** AM#PL21 ************************************
     A*  LOADING DATA                               *
     A*     LEC.        2018.09.17                  *
     A***********************************************
     A          R AM#PP211
     A                                      PFILE(AM#PP21)
     A                                      TEXT('LOADING DATA')
      * KEY
     A          K R22D
