     A** AM#PL43B   *********************************
     A*  TOYOTA SP VIEW ALL POS                     *
     A*     LEC         2022.08.11                  *
     A***********************************************
     A          R AM#PP43R
     A                                      PFILE(AM#PP432)
      *
     A          K M1DDD
     A          K M1HOME
     A          K M1ODRN
     A          K M1MHN
