     A** AM#PL411   *********************************
     A*  TOYOTA SCS LOG FILE                        *
     A*     LEC         2024.10.071                 *
     A***********************************************
     A          R AM#PPLG1
     A                                      PFILE(AM#PP400LG)
      *
     A          K L1ORD#
     A          K L1NAMC
     A          K L1DOCK
     A          K L1PALT
     A          K L1SKID
     A          K L1CTID
