      ** AM#PL32 ***************************************
      *  PASSWORD UNLOCK AUDIT LOG FILE                *
      *     LEC.        2016.05.16                     *
      *************************************** AM#PL32 **
     A          R AM#PP321                  PFILE(AM#PP32)
     A                                      TEXT('PASSWORD UNLOCK AUDIT FILE')
      * KEY FIELDS
     A          K R4PGM
     A          K R4KOME
     A          K R4KOHZ
     A          K R4KOTI
