     A** AM#PP00 ************************************
     A*  CONSTANT VALUE                             *
     A*     ITS.        2015.05.20                  *
     A***********************************************
     A          R AM#PP001
     A            D0KEY         10A         COLHDG('KEY')
     A            D0VALU         5S 0       COLHDG('CONSTANT VALUE')
     A            D0TXT         50A         COLHDG('TEXT')
     A          K D0KEY
