     A** AM#PL45 ************************************
     A*  PALLET CONDITION SCAN WORKFILE             *
     A*     LEC.        2019.06.21                  *
     A***********************************************
     A          R AM#PP451
     A                                      PFILE(AM#PP45)
     A                                      TEXT('PALLET DATA')
      * KEY
     A          K D1SSHZ
     A          K D1SSTI
