     A** AM#PL23 ************************************
     A*  LOADING DATA                               *
     A*     LEC.        2018.10.08                  *
     A***********************************************
     A          R AM#PP211
     A                                      PFILE(AM#PP21)
     A                                      TEXT('LOADING DATA')
      * KEY
     A          K R2SSHZ
     A          K R2SSTI
