     A** AM#PL27 ************************************
     A*  LOADING DATA                               *
     A*     LEC.        2019.07.08                  *
     A***********************************************
     A          R AM#PP211
     A                                      PFILE(AM#PP21)
     A                                      TEXT('LOADING DATA')
      * KEY
     A          K R2SHID
     A          K R2SHIT
