     A** AM#PL403   *********************************
     A*  TOYOTA SCS LOG FILE                        *
     A*     LEC         2024.02.01                  *
     A***********************************************
     A          R AM#PPLG1
     A                                      PFILE(AM#PP400LG)
      *
     A          K L1SURT
     A          K L1SHID
     A          K L1SHIT
     A          K L1DATE
     A          K L1TIME
