     A** AM#PL43D   *********************************
     A*  TOYOTA SP VIEW ALL POS                     *
     A*     LEC         2022.11.30                  *
     A***********************************************
     A          R AM#PP43R
     A                                      PFILE(AM#PP432)
      *
     A          K M1MHN
     A          K M1ODRN
