     A** AM#PL21S ***********************************
     A*  SERVICE PARTS LOADING DATA                 *
     A*     LEC.        2021.12.22                  *
     A***********************************************
     A          R AM#PP21R
     A                                      PFILE(AM#PP21S)
     A                                      TEXT('LOADING DATA')
      * KEY
     A          K S2MLBL
