     A** AM#WP89 ************************************
     A*  PLAN START END
     A*     ITS.        2015.06.22                  *
     A***********************************************
     A          R AM#WP891
     A            W9SHID         8A         COLHDG('SHIP DATE')
     A            W9FIXD         8S 0       COLHDG('PALLET FIX DATE')
     A            W9FIXT         6S 0       COLHDG('PALLET FIX TIME')
     A          K W9SHID
