     A** AU#PL25 ************************************************
     A* A-PICS PICK OUT DATA ACCUMULATION FILE                  *
     A* J.WATANABE      2017.04.09                              *
     A***********************************************************
     A          R AU#PP211                  PFILE(AU#PP21)
      *
     A          K CQNOYY
     A          K CQNOMM
     A          K CQNODD
     A          K CQNOBB
