     A** AUAPPNM ******************************
     A* ARAKO OCR SYSTEM PURCHASE ORDER NO FILE *
     A* C:N.HAYAKAWA              89.05.17    *
     A*********************** 1 REC ONLY FILE *
     A          R AUAPPNM1
     A            MXNBAN         5S 0       COLHDG('PURCHASE ORDER NO' -
     A                                             '(NUMBER)')
