     A** AUDPPNA *****************************************************
     A*つるべ生産指示 : SALES ACCUMULATION RRN AND SHR CONTROL FILE
     A*  2020.07.22
     A****************************************************************
     A          R AUDPPNA1
     A            ACTUKI         2S 0       TEXT('SALES SHAPE MONTH')
     A            ACRENO         7S 0       TEXT('RECORD NO')
