     A** AUDREC97 ********************************
     A*  EDI AUDIT FILE
     A*  JW        2025.04.03
     A********************************************
     A          R AFDR                      PFILE(AUDREC)
     A          K AFDTYP
     A          K AFDSRS
     A          K AFDCDT
     A          K AFDIPT
     A          K AFDCTM
