     A** AWEXP01 ******************************************
     A*    UPLOAD FROM EXCEL                              *
     A*                                                   *
     A*****************************************************
     A          R AWEXP021                  TEXT('UPLOADED FILE')
     A            AWPNO         20          COLHDG('PART#')
     A            AWFLG1         1          COLHDG('CURRENT')
     A            AWFLG2         1          COLHDG('PT')
