     A*** AXXPP02 **********************************
     A* TESTFILE                                     *
     A*         T.SAKAKI       2016.07.15          *
     A********************************** AXXPP02 ***
     A          R AXXPP021                  TEXT('TEST')
     A**
     A            X2PAM1        10          COLHDG('MEMBER')
     A            X2PAM2        10          COLHDG('SRCFILE')
     A            X2PAM3         5          COLHDG('TYPE')
     A            X2PAM4         3          COLHDG('ATTR')
     A**
     A            X2CPYO         1          COLHDG('OBJ CPY')
     A            X2CPYS         1          COLHDG('SRC CPY')
     A**
