     A*** AXXPP03 **********************************
     A* TESTFILE                                     *
     A*         T.SAKAKI       2016.07.15          *
     A********************************** AXXPP01 ***
     A          R AXXPP011                  TEXT('TEST')
     A**
     A            X1KAKE         4S 0       COLHDG('SUPP')
     A**
     A            X1ZAIS        15          COLHDG('MATE')
     A            X1ZAIK         5S 2       COLHDG('DIA')
     A**
     A            X1MKJR         8S 0       COLHDG('MONTHLY CONFIRMED')
     A            X1MSJR         8S 0       COLHDG('MONTHLY SET')
     A            X1KMAL         3S 0       COLHDG('ALL')
     A            X1KMMN         3S 0       COLHDG('MIN')
     A            X1KMMX         3S 0       COLHDG('MAX')
     A            X1ALHK         3S 0       COLHDG('CHANGE  ALL')
     A            X1MXHK         3S 0       COLHDG('CHANGE  MAX')
     A            X1SRMS         3S 0       COLHDG('NUMBER OF H')
