     A** AZAPP50 ******************************************
     A*    INVENTORY OF INPORT COMPONENT PARTS            *
     A*                                                   *
     A*****************************************************
     A          R AZAPP501                  TEXT('INVENTORY FILE')
     A            Z5SKJY         1          COLHDG('DELETE CODE')
     A                                      TEXT('DELETE = D')
     A            Z5SYMD         8  0       COLHDG('DELETE DUE DATE')
     A            Z5UPDT         8  0       COLHDG('UPDATE DATE')
     A            Z5UPTM         6  0       COLHDG('UPDATE TIME')
     A            Z5UPWS        10          COLHDG('UPDATE WS')
     A            Z5USER        10          COLHDG('UPDATE PERSON')
     A            Z5UPGM        10          COLHDG('UPDATE PGM')
     A            Z5LOC1         1          COLHDG('LOCATION 1')
     A            Z5LOC2         2          COLHDG('LOCATION 2')
     A            Z5LOC3         2          COLHDG('LOCATION 3')
     A            Z5LOC4         1          COLHDG('LOCATION 4')
     A            Z5PRT1         5          COLHDG('PART# 1')
     A            Z5PRT2         5          COLHDG('PART# 2')
     A            Z5PRT3         2          COLHDG('PART# 3')
     A            Z5YYMM         6  0       COLHDG('INVENTORY YYMM')
     A            Z5BOXQ         9  2       COLHDG('BOX QTY')
     A            Z5UNIT        11  0       COLHDG('QTY/BOX')
