     A*** AZAPL50 **************************************
     A          R AZAPP501                  PFILE(AZAPP50)
     A          K Z5YYMM
     A          K Z5PRT1
     A          K Z5PRT2
     A          K Z5PRT3
