     A** BBHPL03 ***********************
     A* .. TNS SEND AND RECEIVE INFORMATION M/F   *.
     A* I-HASADA           95.11.21    *
     A*********************** BBHPL03 **
      *
     A          R BBHPL031                  PFILE(BBHPP01)
     A            BBTOKU
     A            BBGYNM
     A            BBFCOD
     A            BBWKBN
     A            BBSRKB
     A*
     A          K BBFCOD
