     A*** BTBPL05 **************************
     A* PT PLAN PUBLICATION MANAGEMENT M/F *
     A*          A-MAMIYA   2000.11.25     *
     A*************************** BTBPL05 **
     A                                      UNIQUE
     A          R BTBPP051                  PFILE(BTBPP05)
      *
     A          K BTZAIS
     A          K BTZAIK
     A          K BTKEYM
