     A*** BTDWP10 **************************
     A* PT PLAN PUBLICATION MANAGEMENT M/F *
     A*  SAKAKI.        2019.09.11         *
     A**************************************
     A          R BTDWP101
     A            W0KEHZ         8S 0       COLHDG('PLAN DUE DATE')
      *
     A          K W0KEHZ
