     A** CHKPP01 **************************************
     A*  ACTIVE JOB WATCH FILE                        *
     A*                      A.MAMIYA       99.08.30  *
     A************************************* CHKPP01 ***
     A          R CHKPP011
     A            C1SBS         10A         COLHDG('SUBSYSTEM')
     A            C1JOB         10A         COLHDG('JOB NAME')
      *
     A            C1FLG          1A         COLHDG('STATUS FLAG')
