     A** EB#PL6P ***************************************
     A*  A/P FORD820 (ADJ)                           *
     A**************************************************
     A          R EB#PP6P1                  PFILE(EB#PP6P)
     A          K APPRDT
     A          K APRENO
