     A** EDIBUF *****************************************************
     A*  MAIL BODY FILE (WORK)                                      *
     A*  J.W.    2025.10.24                                         *
     A***************************************************************
     A          R EDIBUF1                   TEXT('MAIL BODY')
     A            XBUF         200A         COLHDG('MAIL LINE')
