     A** EDIPL46 *******************************************
     A*  USER PART MASTER                                  *
     A*                                                    *
     A* JW    02/12/20 CREATE                              *
     A**********************************************
     A          R EDIPP451                  PFILE(EDIPP45)
      *
     A          K E5MHN1
     A          K E5MHN2
     A          K E5MHN3
     A          K E5MHN4
     A          K E5NONY
