     A** EDIPL31 ***********************************
     A* USER CUSTOMER CODE DELLVERY CODE DOCK CODE *
     A* TO IN-HOUSE CODE CONVERSION                *
     A* CODING : N.HYOTO 2000.06.06                *
     A**********************************************
     A          R EDIPP301                  PFILE(EDIPP30)
      *
     A          K E1NONY
