     A** EDIPL42 *******************************************
     A*  ADDRESS MASTER FILE UPDATE STATE CODE             *
     A*                                                    *
     A* TCHK1 10/16/08 CREATE                              *
     A**********************************************
     A          R EDIPP421                  PFILE(EDIPP42)
      *
     A          K E4GRP
     A          K E4NONY
