     A** EDIPL45 *******************************************
     A*  ADDRESS MASTER FILE UPDATE STATE CODE             *
     A*                                                    *
     A* JW    09/14/18 CREATE                              *
     A**********************************************
     A          R EDIPP421                  PFILE(EDIPP42)
      *
     A          K E4GRP2
     A          K E4NONY
