     A          R EDIW01A1
     A            TXTSQ          5S 0       COLHDG('SEQ#')
     A            TXT80         80A         COLHDG('TEXT')
      *
     A          K TXTSQ
