     A**** EGBWP10 *****************************************
     A*    MENU MANAGEMENT WF (USE RESULT)                 *
     A*    J.WATANABE  2019.12.20                          *
     A******************************************************
     A          R EGBWP101
     A            G1DPT          2A         COLHDG('DEPART')
     A            G1PROF        10A         COLHDG('USER')
     A            G1OPT          3S 0       COLHDG('OPTION#')
     A            G1PGM         10A         COLHDG('PGM')
     A            G1ATTR         5A         COLHDG('ATTRIBUTE')
     A            G1TMS          5S 0       COLHDG('TIMES USED')
     A            G1ULHZ         8S 0       COLHDG('USER LAST USE DATE')
     A            G1LUHZ         8S 0       COLHDG('LAST USE DATE')
     A            G1CRHZ         8S 0       COLHDG('CREATE DATE')
     A            G1TEXT        40A         COLHDG('TEXT')
      *
     A          K G1PROF
     A          K G1PGM
