     A** EJCWPNB **************************************
     A* FORD SHIP ID CONTROL                          *
     A*     T.SAKAKI                   2016.11.29     *
     A************************************* EJCWPNB ***
     A          R EJCWPNB1
     A            ENSHID        10A         COLHDG('SHIP ID')
     A            ENNONY         4S 0       COLHDG('DETAIL CODE')
     A            ENPTID         5A         COLHDG('B2B PARTNER')
     A            ENSTCD         5A         COLHDG('SHIP TO')
     A            ENICCD         5A         COLHDG('IC CODE')
     A            ENMHIN        20A         COLHDG('CUST PART#')
     A            ENSRYO         7S 0       COLHDG('SHIP QTY')
     A            ENBOX#         5S 0       COLHDG('# OF BOXES')
     A            ENCUMQ         9S 0       COLHDG('CUM QTY')
     A            ENRF02        20A         COLHDG('SERIAL NUMBER')
     A            ENPICK        15A         COLHDG('PACKING SLIP')
     A            ENSERN        10A         COLHDG('B2B FILE NAME')
     A            ENRECN         6A         COLHDG('B2B RECORD #')
     A            ENCRDT         8S 0       COLHDG('CREATE DATE')
     A            ENCRTM         6S 0       COLHDG('CREATE TIME')
      *
     A          K ENSHID
     A          K ENNONY
     A          K ENMHIN
     A          K ENRF02
