     A**FAAPL02A **************************************
     A* COMMON PART M/F
     A* JW (SRA) 2024.05.22
     A*************************************************
     A          R FAAPP021                  PFILE(FAAPP02)
      *
     A          K B7MHN1
     A          K B7MHN2
     A          K B7MHN3
     A          K B7MHN4
     A          K B7NONY
     A          K B7NKJO
     A          K B7NUKE
