     A***FAEPP01******************************************************
     A*        IN CHARGE FILE        ...PHYSICAL ...                           *
     A*                A-SENGA        1981.09.17                     *
     A****************************************************************
     A          R FAEPP011                  TEXT('IN CHARGE FILE PHYSICAL')
     A            G1TANT         4S 0       TEXT('IN CHARGE CODE')
     A            G1TMEI        10          TEXT('IN CHARGE NAME')
     A            G1AKI          6          TEXT('FILLER')
