     A** FBCPL20 ****************************************************
     A*  ..SALES EXPANSION PARTS M/F
     A*
     A**************************************************** FBCPL20 **
      *
     A          R FBCPP201                  PFILE(FBCPP20)
      *KEY
     A          K F2TOKU
     A          K F2NONY
     A          K F2NKOJ
     A          K F2NUKE
     A          K F2MHN1
     A          K F2MHN2
     A          K F2MHN3
     A          K F2MHN4
     A          K F2SLSP
