     A** FBCPL31 ****************************************************
     A*  DELIV# AND PO# TABLE                                       *
     A*  JW(SRA)    2019.04.02                                      *
     A***************************************************************
      *
     A          R FBCPP301                  PFILE(FBCPP30)
      *KEY
     A          K FSNONY
     A          K FSSHP1
     A          K FSSHP2
