     A          R FBCW80A1                  TEXT('FORD APR2')
     A            FLD1          20          COLHDG('EFFECTIVE DATE')
     A                                      ALWNULL
     A            FLD1A         20          COLHDG('EXPIRATION DATE')
     A                                      ALWNULL
     A            FLD2          20          COLHDG('PART')
     A                                      ALWNULL
     A            FLD3          30          COLHDG('PLANT')
     A                                      ALWNULL
     A            FLD4          20          COLHDG('PRICE')
     A                                      ALWNULL
