     A** FBCWP81A **************************
     A*  FORD APR                          *
     A*  JW(SRA)    2023.06.22             *
     A**************************************
     A          R FBCW81A1                  TEXT('FORD APR')
     A            F8LINE         5S 0       COLHDG('LINE#')
     A            F8TOKU         4S 0       COLHDG('CUST#')
     A            F8NONY         4S 0       COLHDG('DELIV#')
     A            F8PLNT         2A         COLHDG('PLANT CD')
     A            F8EFDT         8S 0       COLHDG('EFFECTIVE DATE')
     A            F8EXDT         8S 0       COLHDG('EXPIRATION DATE')
     A            F8MHN1         5A         COLHDG('USER PART1')
     A            F8MHN2         5A         COLHDG('USER PART2')
     A            F8MHN3         5A         COLHDG('USER PART3')
     A            F8MHN4         5A         COLHDG('USER PART4')
     A            F8SHN1         5A         COLHDG('IAF PART1')
     A            F8SHN2         5A         COLHDG('IAF PART2')
     A            F8SHN3         2A         COLHDG('IAF PART3')
     A            F8UP           8S 5       COLHDG('UNIT PRICE')
     A            F8DFLT         1A         COLHDG('*=DEFAULT U/P')
     A            F8CDAT         8S 0       COLHDG('CRT DATE')
     A            F8CTIM         6S 0       COLHDG('CRT TIME')
     A            F8USER        10A         COLHDG('CRT OPERATOR')
     A            F8PGM         10A         COLHDG('CRT PRPGRAM')
      *
     A          K F8MHN1
     A          K F8MHN2
     A          K F8MHN3
     A          K F8MHN4
     A          K F8TOKU
     A          K F8NONY
