     A          R FBEWP011                  TEXT('PRICE.CSV')
     A            FLD1          20          COLHDG('FLD1')
     A            FLD2          20          COLHDG('FLD2')
     A            FLD3          20          COLHDG('FLD3')
     A            FLD4          20          COLHDG('FLD4')
