     A** FCEPL71 *******************
      *
     A          R FCEPP701                  PFILE(FCEPP70)
      *
     A          K F7AHN1
     A          K F7AHN2
     A          K F7AHN3
