     A** FCEPL60 *******************
      *
     A          R FCEPP601                  PFILE(FCEPP60)
      *
     A          K F6PRT1
     A          K F6PRT2
     A          K F6PRT3
     A          K F6CUST
