     A** FCEPL50 *******************
      *
     A          R FCEPP501                  PFILE(FCEPP50)
      *
     A          K F5PRT1
     A          K F5PRT2
     A          K F5PRT3
     A          K F5PROC
     A          K F5MCHN
     A          K F5VLDT
