     A** FCEPL01B *******************************
     A* .. PART INFORMATION M/F                 *
     A* .. JW     2021.01.21                    *
     A*******************************************
     A          R FCEPP011                  PFILE(FCEPP01)
      *
     A          K A21HB5
     A          K A22HB5
     A          K A23HB2
     A          S A2GSKD                    COMP(NE 'D')
