     A***FCEWP481 ****************************************************
     A*   PART LIST FOR DOWNLOADING                                  *
     A*           MAY/22/2002                                        *
     A****************************************************************
     A          R FCEWP48B
     A            FBPART        20          COLHDG('PART#')
     A            FBPRCE         7  4       COLHDG('PRICE')
     A            FBFROM         8  0       COLHDG('FROM')
     A            FBTO           8  0       COLHDG('TO')
