     A** FCEWP40  ***************************
     A*  ASJ HALF PRODUCT TABLE (CSV)       *
     A*  JW  2024.09.05                     *
     A***************************************
     A          R FCEWP401                  TEXT('ASJ HALF PRODUCT')
     A            F4SHIN        20          COLHDG('IAF PART#  ')
     A            F4ASJ         20          COLHDG('ASJ PART#  ')
