     A***FCEWP481 ****************************************************
     A*   PART LIST FOR DOWNLOADING                                  *
     A*           MAY/22/2002                                        *
     A****************************************************************
     A          R FCEWP48A
     A            FAPART        20          COLHDG('PART#')
     A            FAPRCE         7  4       COLHDG('PRICE')
     A            FAFROM         8  0       COLHDG('FROM')
     A            FATO           8  0       COLHDG('TO')
