     A          R FILE1                     TEXT('TEST DATA')
     A            FLD01         30          COLHDG('FLD1')
     A            FLD02         30          COLHDG('FLD2')
     C                                      ALWNULL
     A            FLD03         30          COLHDG('FLD3')
     C                                      ALWNULL
     A            FLD04         30          COLHDG('FLD4')
     C                                      ALWNULL
     A            FLD05         30          COLHDG('FLD5')
     C                                      ALWNULL
     A            FLD06         30          COLHDG('FLD6')
     C                                      ALWNULL
     A            FLD07         30          COLHDG('FLD7')
     C                                      ALWNULL
     A            FLD08         30          COLHDG('FLD8')
     C                                      ALWNULL
     A            FLD09         30          COLHDG('FLD9')
     C                                      ALWNULL
     A            FLD10         30          COLHDG('FLD10')
     C                                      ALWNULL
