     A** FQAPL20 *****************************
     A* FQA TEST ITEM NAME M/F               *
     A*    K.OKACHI            1998.04.03    *
     A***************************** FQAPL20 **
     A          R FQAPL201                  PFILE(FQAPP20)
     A                                      TEXT('FQA TEST ITEM NAME M/F')
     A            F2SKJY                    COLHDG('DELETE CODE D')
     A            F2SKYY                    COLHDG('DELETE DUE DATE' -
     A                                             '(YEAR)')
     A            F2SKMM                    COLHDG('DELETE DUE DATE' -
     A                                             '(MONTH) ')
     A            F2SKDD                    COLHDG('DELETE DUE DATE' -
     A                                             '(DAY)')
     A            F2KOYY                    COLHDG('UPDATE WORK DATE' -
     A                                             '(YEAR)')
     A            F2KOMM                    COLHDG('UPDATE WORK DATE' -
     A                                             '(MONTH)')
     A            F2KODD                    COLHDG('UPDATE WORK DATE' -
     A                                             '(DAY)')
     A            F2KOHH                    COLHDG('UPDATE WORK (TIME)' -
     A                                             '    ')
     A            F2KOSS                    COLHDG('UPDATE WORK TIME' -
     A                                             '(MINUTES)')
     A            F2KOME                    COLHDG('UPDATE TEAM MEMBER' -
     A                                             'PROFILE')
      **********************
     A            F2CODE                    COLHDG('TEST ITEM CODE')
     A            F2ITEM                    COLHDG('TEST ITEM')
      *
     A          K F2CODE
