     A* GADPL11C **************************************
     A* SHIPMENT M/F                                  *
     A* J.WATANABE  2022.12.19                        *
     A*************************************************
     A          R GADPP111                  PFILE(GADPP11)
      *
     A          K B5NONY
     A          K B5NUKE
     A          K B5TOKU
     A          K B5NKOJ
