     A**GADPL16****************************************
     A*         CONVERSION M/F.DIRECT SHIPMENT  *
     A*         N.HYOTO  02.29.00                     *
     A************************************** GADPL15 **
     A          R GADPP111                  PFILE(GADPP11)
     A                                      TEXT('CONVERSION M/F DIRECT SHIPME+
     A                                      NT')
     A          K B5NONY
     A          O B5SKJY                    CMP(EQ 'D')
