     A** GCANP01 ***********************************************
     A*            ... RECORDE COUNT FILE ...                  *
     A* FILE ID. : GCANP01. <PF>                               *
     A* CREATE DATE. : MAY.16,'89.                             *
     A* AUTHOR.         : G.B.C.                               *
     A*********************************************** GCANP01 **
     A          R GCANP011                  TEXT('RECORDE COUNT FILE')
     A            GCCNT          8S 0       COLHDG('RECORDE COUNT')
