     A** GCGPP40 ******************************************
     A*  FLOOR OTHER PASSAGE INPUT M/F                    *
     A*                                1996.09.26         *
     A*****************************************************
     A          R GCGPP401                  TEXT('PASSAGE M/F')
     A            G4SKJY         1A         COLHDG(' DELETE CODE ')
     A            G4SKYY         4S 0       COLHDG(' DELETE DAY YEAR ')
     A            G4SKMM         2S 0       COLHDG(' DELETE DAY MONTH ')
     A            G4SKDD         2S 0       COLHDG(' DELETE DAY  DAY ')
     A            G4KOYY         4S 0       COLHDG(' UPDATE DAY YEAR ')
     A            G4KOMN         2S 0       COLHDG(' UPDATE DAY MONTH ')
     A            G4KODD         2S 0       COLHDG(' UPDATE DAY  DAY ')
     A            G4KOJI         2S 0       COLHDG(' UPDATE TIME HOUR ')
     A            G4KOFN         2S 0       COLHDG('UPDATE TIME MINUTES')
     A            G4KOME        10A         COLHDG(' UPDATE PERSON ')
     A            G4KOUJ         1A         COLHDG(' FACTORY CODE ')
     A            G4TURO         2A         COLHDG(' PASSAGE CODE ')
     A            G4FRCD         2A         COLHDG(' FLOOR CODE ')
