     A** GCRWP01 *****************************
     A*                                      *
     A* T.SAKASHITA          2013/APL/29     *
     A***************************** GCRWP01 **
     A          R GCRWP011
     A            W@RENO         4S 0
     A            W@HIN1         5A
     A            W@HIN2         5A
     A            W@HIN3         2A
     A            W@SETI         9S 0
      *
     A          K W@RENO
