     A** GCRWP02 *****************************
     A*                                      *
     A* T.SAKASHITA          2013/APL/29     *
     A***************************** GCRWP01 **
     A          R GCRWP021
     A            W#KATA        15A
     A            W#HIN1         5A
     A            W#HIN2         5A
     A            W#HIN3         2A
     A            W#KOSU         2S 0
     A            W#SETI         9S 0
      *
     A          K W#KATA
