     A*** GDAPL10 ********************************
     A* MATERIAL ORDER SUMMARY
     A*                      FEB/05/2003         *
     A********************************************
      *
     A          R GDAPP101                  PFILE(GDAPP10)
      *
     A          K IBZAIS
     A          K IBZAIK
