     A** GDGNP01 ****************************************
     A* IMPORT ORDER(SEIHIN) ORDER DATA FILE RECORD NO  *
     A*   I-HASADA                        2000.10.12    *
     A**************************************** GDGNP01 **
     A          R GDGNP011                  TEXT('ORDER DATA FILE RECORD')
     A            IBRECD         4S 0       COLHDG('RECORD NO')
      *
