     A*** GDGPL02 **************************
     A* IAF IMPORT ORDER(SEIHIN) ORDER DATA FILE L/F-2
     A* G.B.C                97.02.18      *
     A**************************************
      *
     A          R GDGPP021                  PFILE(GDGPP02)
      *
     A          K IAHIN1
     A          K IAHIN2
     A          K IAHIN3
     A          K IAKOYY
     A          K IAKOMM
     A          K IAKODD
