     A*** GDGPL05 **************************
     A*
     A* TCH 2003.06.23                     *
     A**************************************
     A          R GDGPP051                  PFILE(GDGPP05)
      *
     A          K IASYHZ
     A          K IAHIN1
     A          K IAHIN2
     A          K IAHIN3
     A          K IAKOYY
     A          K IAKOMM
     A          K IAKODD
