     A*** GDGPL80 **************************
     A*     SCRAP
     A*
     A**************************************
      *
     A          R GDGPP801                  PFILE(GDGPP80)
      *
     A          K I8ODER
     A          K I8ZETI
     A          K I8SEIH
     A          K I8RENB
