     A*** GDGPL04 **************************
     A*
     A* TCH 2004.04.26                     *
     A**************************************
     A          R GDGPP051                  PFILE(GDGPP05)
      *
     A          K IAKOYY
     A          K IAKOMM
     A          K IAKODD
     A          K IAKOHH
     A          K IAKOSS
     A          K IAZETI
     A          K IAODER
     A          K IARENB
