     A*** GDGPP70 **************************
     A* TEST                               *
     A**************************************
      *
     A          R FCEPP401                  TEXT('ASJ HALF PRODUCT')
     A            F4GSKD         1          COLHDG('DELETE CODE')
     A            F4GSDT         8S 0       COLHDG('DELETE DUE DATE')
     A            F4GKDT         8S 0       COLHDG('UPDATE DATE')
     A            F4GTIM         6S 0       COLHDG('UPDATE TIME')
     A            F4GKNM        10          COLHDG('UPDATE NAME OF TEAM' -
     A                                             'MEMBER')
     A            F4PRT1         5          COLHDG('INTRAL COMPANY PART' -
     A                                             'NO 1')
     A            F4PRT2         5          COLHDG('2')
     A            F4PRT3         2          COLHDG('3')
     A            F4HPR1         5          COLHDG('HALF PRODUCT 1')
     A            F4HPR2         5          COLHDG('2')
     A            F4HPR3         2          COLHDG('3')
