     A*** GDGPL45 ******************************************
     A*  CUME DATA FOR LOT ID TAG CREATE                   *
     A*                                                    *
     A* TCHK1 01/19/11 CRETAE                              *
     A******************************************************
     A          R GDGPP451                  PFILE(GDGPP45)
     A*
     A          K IEODER
     A          K IEITEM
     A          K IEIKBN
     A          K IEPARE
     A          K IEINVO
