     A*** GDGPPNO **************************
     A* SEQNO.FILE                         *
     A* MSK                 2004.11.09     *
     A**************************************
     A          R GDGPPNO1                  TEXT('SEQNO.FILE')
     A            IASEQN         5S 0       COLHDG('SEQNO.')
