     A*** GDGWP05 ********************************************
     A*   IAF IMPORT ORDER(SEIHIN) ORDER DATA (WORK FILE)    *
     A*   JW  2020.09.16                                     *
     A********************************************************
     A          R GDGWP051                  TEXT('ORDER DATA FILE')
     A            IASKJY         1          COLHDG('DLT FLAG')
     A            IASKYY         4S 0       COLHDG('DLT YY')
     A            IASKMM         2S 0       COLHDG('DLT MM')
     A            IASKDD         2S 0       COLHDG('DLT DD')
     A            IAKOYY         4S 0       COLHDG('UPD YY')
     A            IAKOMM         2S 0       COLHDG('UPD MM')
     A            IAKODD         2S 0       COLHDG('UPD DD')
     A            IAKOHH         2S 0       COLHDG('UPD HH')
     A            IAKOSS         2S 0       COLHDG('UPD MN')
     A            IAKOME        10          COLHDG('UPD USER')
     A            IAODER         6S 0       COLHDG('ORDER#')
     A            IAZETI         4          COLHDG('ITEM#')
     A            IASEIH         1          COLHDG('PART CODE')
     A            IARENB         4S 0       COLHDG('OUT#')
     A            IACD           1          COLHDG('C/D')
     A            IAHIN1         5          COLHDG('IAF PART1')
     A            IAHIN2         5          COLHDG('IAF PART2')
     A            IAHIN3         2          COLHDG('IAF PART3')
     A            IASYOS         7P 0       COLHDG('QTY/BOX')
     A            IAMAIS         3P 0       COLHDG('VOLUME')
     A            IASYHZ         8S 0       COLHDG('TOTALIZATION DATE')
     A            IAHAYY         4S 0       COLHDG('DUE YY')
     A            IAHAMM         2S 0       COLHDG('DUE MM')
     A            IAHADD         2S 0       COLHDG('DUE DD')
      * ADD
     A            IAABAR        20          COLHDG('APICS BARCODE')
     A            IAPBAR        20          COLHDG('P/T   BARCODE')
      * KEY
     A          K IAKOYY
     A          K IAKOMM
     A          K IAKODD
     A          K IAZETI
     A          K IAABAR
