     A** GDGWP99 ********************
     A*   TEMPORARY WORK FILE
     A*******************  GDGWP99 **
     A          R GDGWP991                  TEXT('TEMPORARY WORK FILE')
     A            L5SHN1         5          COLHDG('PART NO1')
     A            L5SHN2         5          COLHDG('PART NO2')
     A            L5SHN3         2          COLHDG('PART NO3')
     A            @@QTY          9  2       COLHDG('BOX')
     A            @@BOX          9  0       COLHDG('BOX')
