     A** GDGWL77 ****************************
     A*  WRK FILE FOR GDGR77             .. *
     A*                                     *
     A*                                     *
     A**************************** GDGWL77 **
      *
     A          R GDGWP771                  PFILE(GDGWP77)
     A          K HIN1
     A          K HIN2
     A          K HIN3
     A          K IVNO
     A          K PARE
     A          K SEQNO
