     A*** GDIPL27 ************************************
     A*  INVOICE NO. MANAGEMENT DATA FILE
     A* TCH                2002.05.02                *
     A*                                              *
     A************************************************
     A          R GDIPP251                  PFILE(GDIPP25)
      *
%0001A          K IKKAT1
%0001A          K IKKAT2
%0001A          K IKKAT3
%0001A          K IKODER
