     A*** GDJPP10 **************************
     A*    PROCESS CLASS M/F               *
     A* G.B.C                97.05.27      *
     A**************************************
     A          R GDJPP101                  TEXT('PROCESS CLASS M/F')
     A            INKOTE         3A         COLHDG('PROCESS CODES')
     A            INKKBN         1A         COLHDG('PROCESS CLASS')
     A            INKEIS         6S 5       COLHDG('COEFFICIENT')
     A**
     A**
     A          K INKOTE
