     A** GDWPP20 ************************
     A* WAREHOUSE ORDER(MATERIAL)       *
     A*                                 *
     A************************ GDWPP20 **
     A          R GDWPP201                  TEXT('WAREHOUSE ORDER')
     A            W2SKJY         1          COLHDG('DELETE CODE')
     A            W2SKDT         8  0       COLHDG('DELETE DATE')
     A            W2KODT         8  0       COLHDG('UPDATE DATE')
     A            W2KOTM         6  0       COLHDG('UPDATE TIME')
     A            W2KOME        10          COLHDG('UPDATE PERSON')
     A            W2ZAIS        15          COLHDG('WIRE')
     A            W2ZAIK         5  2       COLHDG('WIRE DIAMATER')
     A            W2LOC1         1          COLHDG('LOC 1')
     A            W2LOC2         2          COLHDG('LOC 2')
     A            W2LOC3         2          COLHDG('LOC 3')
     A            W2LOC4         1          COLHDG('LOC 4')
     A            W2MAIS         3  0       COLHDG('NUMBER OF KANBAN')
     A            W2ASJ#         6  0       COLHDG('ASJ ORDER#')
     A            W2ASDT         8  0       COLHDG('ASJ ORDER DATE')
     A            W2ORDR        10          COLHDG('ORDER #')
     A            W2MODL         2          COLHDG('MODULE#')
     A            W2ORDT         8  0       COLHDG('ORDER DATE')
     A            W2RCDT         8  0       COLHDG('RECEIVE DATE')
