     A*** GDWPL10 **************************
     A* WAREHOUSE ORDER
     A*                                    *
     A**************************************
      *
     A          R GDWPP101                  PFILE(GDWPP10)
      *
     A          K W1SEIH
     A          K W1ASDT
     A          K W1GROP
     A          K W1LOC1
     A          K W1LOC2
     A          K W1LOC3
     A          K W1LOC4
