     A*** GTBPL05 ******************************************
     A*                                                    *
     A* TCHK  10/05/12 CREATE(COPY FROM GDGPL06)           *
     A******************************************************
     A          R GTBPP051                  PFILE(GTBPP05)
      *
     A          K IASYHZ
     A          K IAHIN1
     A          K IAHIN2
     A          K IAHIN3
     A          K IAKOYY
     A          K IAKOMM
     A          K IAKODD
