     A*** GTBPP90 **************************
     A*  ACZ CONTROL FILE
     A*
     A**************************************
     A          R GTBPP901                  TEXT('CONTROL FILE')
     A*
     A            G90UPD         8  0       COLHDG('UPDATE DATE')
     A            G90TIM         6  0       COLHDG('UPDATE TIME')
     A            G90PGM        10          COLHDG('UPDATE PGM')
     A            G90WSD        10          COLHDG('UPDATE WSID')
     A            G90KEY        10          COLHDG('KEY')
     A            G90USE         1          COLHDG('USE')
     A          K G90KEY
