     A** IMPWP01******************************************
     A*  SAVE SOURCE FILE TO IMPWP02                     *
     A*  JW   2023.04.26                                 *
     A****************************************************
     A          R IMPWP021
     A            IMCRDT         8S 0       COLHDG('CRT DATE')
     A            IMCRTM         6S 0       COLHDG('CRT TIME')
     A            IMCRUS        10A         COLHDG('CRT USER')
     A            IMCRWS        10A         COLHDG('CRT WSID')
     A            IMFILE        10A         COLHDG('SAVE FILE')
     A            IMLIB         10A         COLHDG('SAVE LIB')
     A            IMCRPG        10A         COLHDG('CRT PGM ')
      *
     A            IMDATA       400A         COLHDG('SRC DATA')
      *
     A          K IMCRDT
     A          K IMCRTM
