     A** INVPL50 *******************************************
     A*  WASHER INVENTORY LOGICAL FILE                     *
     A*                                                    *
     A* TCHK1 05/01/06 CREATE(COPIED FROM INVPL10)         *
     A******************************************************
     A          R INVPP501                  PFILE(INVPP50)
      *
     A          K IVSHN1
     A          K IVSHN2
     A          K IVSHN3
     A          K IVDATE
