     A** INVPP60 *******************************************
     A*  OUTSOURCE IVENTORY FILE                           *
     A*                                                    *
     A* TCHK1 05/02/07 CREATE                              *
     A******************************************************
      *
     A          R INVPP601                  PFILE(INVPP60)
      *
     A          K IVDATE
     A          K IVTIME
     A          K IVBARC
