     A** INVPL70 *******************************************
     A*  MANUFACTURING INVENTORY FILE                      *
     A*                                                    *
     A* T.SAKAKI    07/05/2017                             *
     A******************************************************
     A          R INVPP701                  PFILE(INVPP70)
      *
     A          K IVSHN1
     A          K IVSHN2
     A          K IVSHN3
     A          K IVDATE
