     A** INVPL90 *****************************
     A* QD INVENTORY FILE                    *
     A*                                      *
     A***************************** INVPL90 **
      *
     A          R INVPP901                  PFILE(INVPP90)
      *
     A          K IVSHN1
     A          K IVSHN2
     A          K IVSHN3
     A          K IVDATE
