     A          R INVPP461
     A            @@@HN1         5
     A            @@@HN2         5
     A            @@@HN3         2
     A            W@SSSS        12  0
      *
     A          K @@@HN1
     A          K @@@HN2
     A          K @@@HN3
