     A** INVWP15 *****************************
     A* MODULE INVENTORY WORKFILE            *
     A*                                      *
     A*  CREATED  1/19/2022                  *
     A****************************************
      *
     A          R INVWP151                  TEXT('INVENTORY FILE')
      *
     A            MODULE         4          COLHDG('MODULE #')
     A          K MODULE
