      ** IWAPP7L *****************************
      * WASHER INVENTORY TRANSACTION FILE
      *   LEC                   2025.07.07
      ****************************************
      *
     A          R IWAPP7L1                  TEXT('WASHER INVENTORY LOG')
      *
     A            LGKODT         8S 0       COLHDG('UPDATE DATE')
     A            LGKOTM         6S 0       COLHDG('UPDATE TIME')
     A            LGKOPG        10          COLHDG('UPDATE PGM')
     A            LGKOUS        20          COLHDG('UPDATED BY')
      ** ASJ ｴﾁﾀﾔｲｻﾀｶﾊ ｽｲﾀｳｲﾀ
     A            LGCBCD        20          COLHDG('CONTAINER BCODE')
     A            LGZETI         4          COLHDG('WASHER ABSOLUTE')
     A            LGCHN1         5          COLHDG('COMP PART# 1')
     A            LGCHN2         5          COLHDG('COMP PART# 2')
     A            LGCHN3         5          COLHDG('COMP PART# 3')
     A            LGCORD         6          COLHDG('CONT ORDER NO')
     A            LGCLOT         4          COLHDG('CONT ORDER LOT#')
     A            LGCSTS         4          COLHDG('CONT STATUS')
      ** Oﾊｵｶﾊ ｽｲﾀｳｲﾀ
     A            LGOBCD        20          COLHDG('ORDER KANB BARCODE')
     A            LGOZET         4          COLHDG('ORDER KANB PART ID')
     A            LGOORD         6          COLHDG('ORDER KANB ORD NO')
     A            LGOLOT         4          COLHDG('ORDER KANB ORD LOT#')
     A            LGOQTY         7S 0       COLHDG('ORDER QUANTITY')
     A            LGOSTS         4          COLHDG('ORDER STATUS')
      *
     A            LGPLOC         6          COLHDG('PREVIOUS LOCATION')
     A            LGCLOC         6          COLHDG('CURRENT LOCATION')
      *
     A          K LGCBCD
