     A** JCMPL11E ***************************************************
     A* FORD J-COM DATA (HDR) ASN                                   *
     A* JW   2025.05.14                                             *
     A***************************************************************
     A          R JCMPP111                  PFILE(JCMPP11)
      * KEY
     A          K J1SHID
