     A** JCMPL11A ***************************************************
     A* FORD J-COM DATA (HDR) ASN                                   *
     A* JW   5/5/2016                                               *
     A***************************************************************
     A          R JCMPP111                  PFILE(JCMPP11)
      * KEY
     A          K J1ASN#
     A          K J1SHID
