     A** KFAWP30 ***********************************************
     A*  KANBAN LOCATION BY CSV                                *
     A*  JW     2024.08.20                                     *
     A**********************************************************
     A          R KFAWP301                  TEXT('LOCATION FILE')
      *
     A            K3PART        20A         COLHDG('IAF PART#')
     A            K3LOC         10A         COLHDG('LOCATION')
