     A*** MBDWPTA ****************************************************
     A*   PROCESS CODE TABLE                                         *
     A* J.WATANABE(SRAA)  2020.02.24                                 *
     A****************************************************************
     A          R MBDWPTA1
     A            FATYP          1A         TEXT('1:HEADER, 2:SECOND')
     A            FAPROC         3A         TEXT('PROCESS')
      *
     A          K FAPROC
