     A** MFBPP40 *****************************
     A* WORK DAILY REPORT DATA FILE <PHYSICAL> *
     A*        A-MAMIYA 1997.11.23            *
     A***************************** MFBPP40 **
     A          R MFBPP401
     A            M2SKJY         1A         COLHDG('DELETE CODE D')
     A            M2SKYY         4S 0       COLHDG('DELETE DATE YEAR')
     A            M2SKMM         2S 0       COLHDG('DELETE DATE MONTH')
     A            M2SKDD         2S 0       COLHDG('DELETE DATE DAY')
     A            M2KOYY         4S 0       COLHDG('UPDATE DATE YEAR')
     A            M2KOMM         2S 0       COLHDG('UPDATE DATE MONTH')
     A            M2KODD         2S 0       COLHDG('UPDATE DATE DAY')
     A            M2KOHH         2S 0       COLHDG('UPDATE TIME  ')
     A            M2KOSS         2S 0       COLHDG('UPDATE TIME MINUTES')
     A            M2KOME        10A         COLHDG('UPDATE PERSON')
      *
     A            M2KJCD         4S 0       COLHDG('FACTORY CODE')
     A            M2SAYY         4S 0       COLHDG('WORK DATE YEAR')
     A            M2SAMM         2S 0       COLHDG('WORK DATE MONTH')
     A            M2SADD         2S 0       COLHDG('WORK DATE DAY')
     A            M2HYKU         1A         COLHDG('NIGHT AND DAY' -
     A                                             'INSTRUCTION')
     A            M2KIBN         3A         COLHDG('MACHINE NO')
     A            M2KIHS         1A         COLHDG('SUPPORTING CODE')
     A            M2KTCD         3A         COLHDG('PROCESS CODE')
     A            M2TAG1         7A         COLHDG('MATERIAL TAG NO.1')
     A            M2TAG2         7A         COLHDG('MATERIAL TAG NO.2')
     A            M2SYOR         1A         COLHDG('RE-PROCESSING' -
     A                                             'DIVISION')
     A            M2API1         4A         COLHDG('A-PICS LOT NO.1')
     A            M2API2         3A         COLHDG('A-PICS LOT NO.2')
     A            M2PAG1         2A         COLHDG('PAGE NO.1')
     A            M2PAG2         2A         COLHDG('PAGE NO.2')
     A            M2PAG3         2A         COLHDG('PAGE NO.3')
     A            M2PAG4         2A         COLHDG('PAGE NO.4')
