     A*** MRAPPZ2 ************************************
     A* RECEIVE NETWORK FILE
     A*         TRANCOM-ITS     2012.10.09           *
     A************************************************
     A          R MRAPPZ21
     A            Z2SKJY         1A         COLHDG('DELETE CODE')
     A            Z2SKHZ         8S 0       COLHDG('DELETE DUE DATE')
     A            Z2KOHZ         8S 0       COLHDG('UPDATE WORK DATE')
     A            Z2KOTI         6S 0       COLHDG('UPDATE WORK TIME')
     A            Z2KOME        10A         COLHDG('UPDATE TEAM MEMBER')
      *
     A            Z2DFIL        10A         COLHDG('FILE NAME')
     A            Z2USR         10A         COLHDG('USER')
     A            Z2LIB         10A         COLHDG('LIBRARY')
     A            Z2PGM         10A         COLHDG('CALL PGM')
      *
     A          K Z2DFIL
