     A** MRHWP65 ***********************************************
     A* チェックリスト発行用ロット№チェックファイル         *
     A*         A.SHIBATA     2014.05.14                       *
     A**********************************************************
     A          R MRHWP651
     A            W6LNO1         4A         COLHDG('LOT NUMBER 1')
     A            W6LNO2         3A         COLHDG('LOT NUMBER 2')
      *
     A          K W6LNO1
     A          K W6LNO2
