     A** NZTPP01 *****************************************
     A* INTRA KANBAN STATUS                              *
     A*   T.SAKAKI             2019.11.22                *
     A****************************************************
     A          R NZTPP011
     A            N1SKJY         1A         COLHDG('DELETE CODE')
     A            N1SKHZ         8S 0       COLHDG('DELETE DATE')
     A            N1SKTM         6S 0       COLHDG('DELETE TIME')
     A            N1KOHZ         8S 0       COLHDG('UPDATE DATE')
     A            N1KOTI         6S 0       COLHDG('UPDATE TIME')
     A            N1KOME        10A         COLHDG('SIGNON USER')
     A            N1KOPG        10A         COLHDG('UPDATE PGM')
     A            N1TMCD        10A         COLHDG('TM CODE')
     A            N1TMNM        20A         COLHDG('TM NAME')
      *
     A            N1HKKB         1A         COLHDG('ISSUE TYPE')
     A            N1KDAI         1A         COLHDG('KANBAN TYPE1')
     A            N1KSYO         1A         COLHDG('KANBAN TYPE2')
      *
     A            N1JKOT         3A         COLHDG('PROCESS')
     A            N1LOC1         1A         COLHDG('LOCATION1')
     A            N1LOC2         2A         COLHDG('LOCATION2')
     A            N1LOC3         2A         COLHDG('LOCATION3')
     A            N1LOC4         1A         COLHDG('LOCATION4')
     A            N1SHN1         5A         COLHDG('PART NO.1')
     A            N1SHN2         5A         COLHDG('PART NO.2')
     A            N1SHN3         2A         COLHDG('PART NO.3')
     A            N1HADT         8S 0       COLHDG('KANBAN ISSUE DATE')
     A            N1HATM         2S 0       COLHDG('KANBAN ISSUE TIME')
      *---------------- KANBAN ISSUE INFO ------------------*
     A            N1BCD         20A         COLHDG('BARCODE')
     A            N1QR         512A         COLHDG('QR')
     A            N1SZET         4A         COLHDG('ABSOLUTE NO.')
     A            N1STHI         3A         COLHDG('A-PICS LOT NO.')
     A            N1SPAG         5A         COLHDG('PAGE NO.')
      *-----------------------------------------------------*
     A            N1SIHZ         8S 0       COLHDG('STORE IN DATE')
     A            N1SITI         6S 0       COLHDG('STORE IN TIME')
     A            N1SOHZ         8S 0       COLHDG('STORE OUT DATE')
     A            N1SOTI         6S 0       COLHDG('STORE OUT TIME')
