     A**RGAPP01*******************************************************
     A* AS400 USER AND MAIL ADDRESS                                  *
     A* J. WATANABE    2021.06.28                                    *
     A****************************************************************
     A          R RGAPP011
     A            R1SKJY         1A         TEXT('DLT CODE')
     A            R1USER        10A         TEXT('USER ID')
     A            R1ADDR        30A         TEXT('MAIL ADDRESS')
     A            R1OGAD        30A         TEXT('OUTGOING MAIL ADDR')
      *
     A            R1SKHZ         8S 0       TEXT('DLT DATE')
     A            R1SKTM         6S 0       TEXT('DLT TIME')
     A            R1SKUS        10A         TEXT('DLT USER')
     A            R1KOHZ         8S 0       TEXT('UPD DATE')
     A            R1KOJK         6S 0       TEXT('UPD TIME')
     A            R1KOUS        10A         TEXT('UPD USER')
      *
     A          K R1USER
