     A** TSTPP03 *******************
     A* MAMIYA TEST                *
     A* 2020.09.24                 *
     A******************* TSTPP02 **
     A          R TSTPP201
     A            T3TEHA         3A         COLHDG('TEHAI NO')
     A            T3PAGE         2S         COLHDG('PAGE')
     A            T3HAKO         8S         COLHDG('PRINT DATE')
     A            T3SERL        18A         COLHDG('SIRI')
