     A** TXT200  **************************************************
     A*  TEXT DATA 200
     A*  J.WATANABE   2021.09.01
     A*************************************************************
     A          R TXT2001
     A            FLD200       200A         COLHDG('TEXT')
