     A** TXTP200 **************************************************
     A*  TEXT DATA 200
     A*  J.WATANABE   2021.09.01
     A*************************************************************
     A          R TXTP200R
     A            FLD200       200A         COLHDG('TEXT')
