     A* UEXPP23 ***************************************
     A* MACHINE CHANGE REPORT (WF2)                   *
     A* JW      2020.03.10                            *
     A*************************************************
     A          R UEXWP231
     A            U3FILE        10A         COLHDG('FILE')
     A            U3EFHZ         8S 0       COLHDG('EFFECTIVE DATE')
     A            U3CNT          4S 0       COLHDG('COUNT')
      *
     A          K U3FILE
     A          K U3EFHZ
