     A** UPLWP12 ***********************************************
     A*  UPLOAD PF (WORK) FROM IFS.CSV                         *
     A**********************************************************
     A          R UPLWP121                  TEXT('UPLOAD FILE')
      *
     A            U1FLD1       250A         COLHDG('FIELD 1')
     A                                      ALWNULL
