     A*************************************************
     A* UTILITY - SAVE PROGRAM RUN LOG
     A*************************************************
      *
     A          R UTLWP071                  TEXT('LOG')
     A            U1WSID        10A
     A            U1USER        10A
     A            U1PGM         10A
     A            U1CRDT         8S 0
     A            U1CRTM         6S 0
     A            U1COM         30A
