     A          R RDBG                      TEXT('DEBUG USER EXIT CONTROL')
     A            TYPE           1          TEXT('{C}onst {A}ccum {H}ashttl')
     A            LOC            2 00
