     A*** VVVPLC6 ******************************
     A* PGM-PGM TABLE                          *
     A******************************************
     A          R VVVPLC61                  PFILE(VVVPPB0)
     A            VWPNAM                    COLHDG('PROGRAM')
     A            VWFNAM                    COLHDG('CALL FROM')
     A            VWTEXT                    COLHDG('TEXT')
      *
     A          K VWPNAM
     A          K VWFNAM
