     A*** VVVPL10 ******************************
     A* PGM-FILE TABLE                         *
     A******************************************
     A          R VVVPP101                  PFILE(VVVPP10)
     A          K WHFNAM
     A          K WHPNAM
     A          S WHFNAM                    COMP(NE ' ')
