     A** ZBCPL10 *************************
     A*  .MATERIAL ORDERING SIGN-OFF ACCUMULATION DATA
     A*    I-HASADA          94.09.08    *
     A************************* ZBCPL10 **
     A          R ZBCPP011                  PFILE(ZBCPP01)
      *
     A          K ZCUKER
     A          K ZCSIRE
     A          K ZCKNO2
