     H            Y.
     F** A#DR01 **********************************
     F* P/T CALENDAR                             *
     F*              Y.SAMEJIMA  2015.06.04      *
     F******************************** A#DR01 ****
     FA#DPW01 CF  E                    WORKSTN
     FA#DPL12 IF  E           K        DISK
     FAGDPL22 IF  E           K        DISK
     E                    ER      1   4 60               ｵ-ﾘ
     E                    @YBI       37  2 0             ｾｻ ｷﾘ
     E                    @HIL       37  1                ｸｴｾ
     E                    @YOL       37  1                ｸｴｾ
     E                    @ZEN       37  1               ﾕｵﾚｸ ｴｼｳ
     E                    @RIN       37  1               ｾ
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  120YYMM
     I            DS
     I                                        1   60@HIZ
     I                                        1   40WFKAY1
     I                                        5   60WFKAY2
     I            DS
     I                                        1  740@YBI
     I                                        1   20@YBI01
     I                                        3   40@YBI02
     I                                        5   60@YBI03
     I                                        7   80@YBI04
     I                                        9  100@YBI05
     I                                       11  120@YBI06
     I                                       13  140@YBI07
     I                                       15  160@YBI08
     I                                       17  180@YBI09
     I                                       19  200@YBI10
     I                                       21  220@YBI11
     I                                       23  240@YBI12
     I                                       25  260@YBI13
     I                                       27  280@YBI14
     I                                       29  300@YBI15
     I                                       31  320@YBI16
     I                                       33  340@YBI17
     I                                       35  360@YBI18
     I                                       37  380@YBI19
     I                                       39  400@YBI20
     I                                       41  420@YBI21
     I                                       43  440@YBI22
     I                                       45  460@YBI23
     I                                       47  480@YBI24
     I                                       49  500@YBI25
     I                                       51  520@YBI26
     I                                       53  540@YBI27
     I                                       55  560@YBI28
     I                                       57  580@YBI29
     I                                       59  600@YBI30
     I                                       61  620@YBI31
     I                                       63  640@YBI32
     I                                       65  660@YBI33
     I                                       67  680@YBI34
     I                                       69  700@YBI35
     I                                       71  720@YBI36
     I                                       73  740@YBI37
     I            DS
     I                                        1  37 @HIL
     I                                        1   1 @HIL01
     I                                        2   2 @HIL02
     I                                        3   3 @HIL03
     I                                        4   4 @HIL04
     I                                        5   5 @HIL05
     I                                        6   6 @HIL06
     I                                        7   7 @HIL07
     I                                        8   8 @HIL08
     I                                        9   9 @HIL09
     I                                       10  10 @HIL10
     I                                       11  11 @HIL11
     I                                       12  12 @HIL12
     I                                       13  13 @HIL13
     I                                       14  14 @HIL14
     I                                       15  15 @HIL15
     I                                       16  16 @HIL16
     I                                       17  17 @HIL17
     I                                       18  18 @HIL18
     I                                       19  19 @HIL19
     I                                       20  20 @HIL20
     I                                       21  21 @HIL21
     I                                       22  22 @HIL22
     I                                       23  23 @HIL23
     I                                       24  24 @HIL24
     I                                       25  25 @HIL25
     I                                       26  26 @HIL26
     I                                       27  27 @HIL27
     I                                       28  28 @HIL28
     I                                       29  29 @HIL29
     I                                       30  30 @HIL30
     I                                       31  31 @HIL31
     I                                       32  32 @HIL32
     I                                       33  33 @HIL33
     I                                       34  34 @HIL34
     I                                       35  35 @HIL35
     I                                       36  36 @HIL36
     I                                       37  37 @HIL37
     I            DS
     I                                        1  37 @YOL
     I                                        1   1 @YOL01
     I                                        2   2 @YOL02
     I                                        3   3 @YOL03
     I                                        4   4 @YOL04
     I                                        5   5 @YOL05
     I                                        6   6 @YOL06
     I                                        7   7 @YOL07
     I                                        8   8 @YOL08
     I                                        9   9 @YOL09
     I                                       10  10 @YOL10
     I                                       11  11 @YOL11
     I                                       12  12 @YOL12
     I                                       13  13 @YOL13
     I                                       14  14 @YOL14
     I                                       15  15 @YOL15
     I                                       16  16 @YOL16
     I                                       17  17 @YOL17
     I                                       18  18 @YOL18
     I                                       19  19 @YOL19
     I                                       20  20 @YOL20
     I                                       21  21 @YOL21
     I                                       22  22 @YOL22
     I                                       23  23 @YOL23
     I                                       24  24 @YOL24
     I                                       25  25 @YOL25
     I                                       26  26 @YOL26
     I                                       27  27 @YOL27
     I                                       28  28 @YOL28
     I                                       29  29 @YOL29
     I                                       30  30 @YOL30
     I                                       31  31 @YOL31
     I                                       32  32 @YOL32
     I                                       33  33 @YOL33
     I                                       34  34 @YOL34
     I                                       35  35 @YOL35
     I                                       36  36 @YOL36
     I                                       37  37 @YOL37
     I            DS
     I                                        1  37 @ZEN
     I                                        1   1 @ZEN01
     I                                        2   2 @ZEN02
     I                                        3   3 @ZEN03
     I                                        4   4 @ZEN04
     I                                        5   5 @ZEN05
     I                                        6   6 @ZEN06
     I                                        7   7 @ZEN07
     I                                        8   8 @ZEN08
     I                                        9   9 @ZEN09
     I                                       10  10 @ZEN10
     I                                       11  11 @ZEN11
     I                                       12  12 @ZEN12
     I                                       13  13 @ZEN13
     I                                       14  14 @ZEN14
     I                                       15  15 @ZEN15
     I                                       16  16 @ZEN16
     I                                       17  17 @ZEN17
     I                                       18  18 @ZEN18
     I                                       19  19 @ZEN19
     I                                       20  20 @ZEN20
     I                                       21  21 @ZEN21
     I                                       22  22 @ZEN22
     I                                       23  23 @ZEN23
     I                                       24  24 @ZEN24
     I                                       25  25 @ZEN25
     I                                       26  26 @ZEN26
     I                                       27  27 @ZEN27
     I                                       28  28 @ZEN28
     I                                       29  29 @ZEN29
     I                                       30  30 @ZEN30
     I                                       31  31 @ZEN31
     I                                       32  32 @ZEN32
     I                                       33  33 @ZEN33
     I                                       34  34 @ZEN34
     I                                       35  35 @ZEN35
     I                                       36  36 @ZEN36
     I                                       37  37 @ZEN37
     I            DS
     I                                        1  37 @RIN
     I                                        1   1 @RIN01
     I                                        2   2 @RIN02
     I                                        3   3 @RIN03
     I                                        4   4 @RIN04
     I                                        5   5 @RIN05
     I                                        6   6 @RIN06
     I                                        7   7 @RIN07
     I                                        8   8 @RIN08
     I                                        9   9 @RIN09
     I                                       10  10 @RIN10
     I                                       11  11 @RIN11
     I                                       12  12 @RIN12
     I                                       13  13 @RIN13
     I                                       14  14 @RIN14
     I                                       15  15 @RIN15
     I                                       16  16 @RIN16
     I                                       17  17 @RIN17
     I                                       18  18 @RIN18
     I                                       19  19 @RIN19
     I                                       20  20 @RIN20
     I                                       21  21 @RIN21
     I                                       22  22 @RIN22
     I                                       23  23 @RIN23
     I                                       24  24 @RIN24
     I                                       25  25 @RIN25
     I                                       26  26 @RIN26
     I                                       27  27 @RIN27
     I                                       28  28 @RIN28
     I                                       29  29 @RIN29
     I                                       30  30 @RIN30
     I                                       31  31 @RIN31
     I                                       32  32 @RIN32
     I                                       33  33 @RIN33
     I                                       34  34 @RIN34
     I                                       35  35 @RIN35
     I                                       36  36 @RIN36
     I                                       37  37 @RIN37
      ********
      * PARM *
      ********
     C           *ENTRY    PLIST
     C                     PARM           NO1     1
     C                     PARM           NO2     1
      *******
      * KEY *
      *******
     C           KEY1      KLIST
     C                     KFLD           WFKAY1
     C                     KFLD           WFKAY2
      *--------------------------------------*
      *             ｹﾗ ｼ-ﾀ             *
      *--------------------------------------*
     C                     TIME           SDATE
STP1 C           STP1      TAG
     C                     Z-ADDYYMM      @HIZ
     C           NO1       IFEQ '1'
     C                     SETON                     08
     C                     END
     C           NO1       IFEQ '2'
     C                     SETOF                     08
     C                     END
      *--------------------------------------*
      *            �����              *
      *--------------------------------------*
STEP1C           STEP1     TAG
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     262728
     C                     SETOF                     293031
     C                     SETOF                     323334
     C                     SETOF                     353637
     C                     SETOF                     383940
     C                     SETOF                     414243
     C                     SETOF                     444546
     C                     SETOF                     47
     C                     EXFMTA#DPW013
     C                     SETOF                     036099
      *----------*
      * CMD-1 ON *
      *----------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *----------*
      * CMD-2 ON *
      *----------*
     C           *INKB     IFEQ '1'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
      *----------*
      * ｾｻｽｹ *
      *----------*
     C           @HIZ      IFEQ 0
     C                     MOVE ER,1      MSG
     C                     SETON                     0399
     C                     GOTO STEP1
     C                     END
      *
     C           WFKAY1    IFGE 1990
     C           WFKAY2    ANDGE01
     C           WFKAY2    ANDLE12
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0399
     C                     GOTO STEP1
     C                     END
      *--------*
      * A-PICS *
      *--------*
     C           NO1       IFEQ '1'
     C           KEY1      SETLLAGDPL121                 88
     C           *IN88     IFEQ '0'
     C                     MOVE ER,04     MSG
     C                     SETON                     0399
     C                     GOTO STEP1
     C                     END
     C                     Z-ADD0         @YBI
     C                     MOVE *BLANK    @HIL
     C                     MOVE *BLANK    @YOL
     C                     MOVE *BLANK    @ZEN
     C                     MOVE *BLANK    @RIN
     C                     MOVE *BLANK    SW      1
     C                     Z-ADD0         @KAD    31
     C                     Z-ADD0         @JN1    31
     C                     Z-ADD0         @JN2    31
     C                     Z-ADD0         @JN3    31
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           KEY1      READEAGDPL121                 50
     C           *IN50     CABEQ'1'       @001
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADD1         @DD     21
     C                     ELSE
     C                     Z-ADD0.5       @DD
     C                     END
     C                     ADD  @DD       @KAD
      *
     C           F8KADD    IFGE 01
     C           F8KADD    ANDLE10
     C                     ADD  @DD       @JN1
     C                     ELSE
     C           F8KADD    IFGE 11
     C           F8KADD    ANDLE20
     C                     ADD  @DD       @JN2
     C                     ELSE
     C           F8KADD    IFGE 21
     C           F8KADD    ANDLE31
     C                     ADD  @DD       @JN3
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           SW        IFEQ *BLANK
     C                     Z-ADD0         C       20
     C                     MOVE '*'       SW
C    C                     Z-ADD0         @YBI
      * �
     C           F8YOBI    IFEQ 1
     C                     Z-ADD2         C
     C                     END
      * �
     C           F8YOBI    IFEQ 2
     C                     Z-ADD3         C
     C                     END
      * �
     C           F8YOBI    IFEQ 3
     C                     Z-ADD4         C
     C                     END
      * �
     C           F8YOBI    IFEQ 4
     C                     Z-ADD5         C
     C                     END
      * �
     C           F8YOBI    IFEQ 5
     C                     Z-ADD6         C
     C                     END
      * �
     C           F8YOBI    IFEQ 6
     C                     Z-ADD7         C
     C                     END
      * �
     C           F8YOBI    IFEQ 7
     C                     Z-ADD1         C
     C                     END
      *
     C                     END
      *
     C                     Z-ADDF8KADD    @YBI,C
     C                     Z-ADD0         B       20
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C           C         ADD  10        B
     C                     MOVE '1'       *IN,B
     C                     END
      *
     C           F8HIRU    IFEQ '*'
     C                     MOVE 'A'       @HIL,C
     C                     END
      *
     C           F8YORU    IFEQ '*'
     C                     MOVE 'B'       @YOL,C
     C                     END
      *
     C           F8MAEY    IFEQ 'S'
     C                     MOVE 'S'       @ZEN,C
     C                     END
      *
     C           F8MAEY    IFEQ 'E'
     C                     MOVE 'E'       @ZEN,C
     C                     END
      *
     C           F8MAEY    IFEQ 'M'
     C                     MOVE 'M'       @ZEN,C
     C                     END
      *
     C           NO1       IFEQ '2'
     C           F8RIKB    IFEQ 'R'
     C                     MOVE 'R'       @RIN,C
     C                     END
     C                     END
     C                     ADD  1         C
      *
     C           @001      TAG
     C  N50                END
     C                     END
      *****
      *----------------*
      * ｿｳｴﾀｴ *
      *----------------*
     C           NO1       IFEQ '2'
     C           KEY1      SETLLAGDPL221                 88
     C           *IN88     IFEQ '0'
     C                     MOVE ER,04     MSG
     C                     SETON                     0399
     C                     GOTO STEP1
     C                     END
     C                     Z-ADD0         @YBI
     C                     MOVE *BLANK    @HIL
     C                     MOVE *BLANK    @YOL
     C                     MOVE *BLANK    @ZEN
     C                     MOVE *BLANK    @RIN
     C                     MOVE *BLANK    SW      1
     C                     Z-ADD0         @KAD    31
     C                     Z-ADD0         @JN1    31
     C                     Z-ADD0         @JN2    31
     C                     Z-ADD0         @JN3    31
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           KEY1      READEAGDPL221                 50
     C           *IN50     CABEQ'1'       @002
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADD1         @DD
     C                     ELSE
     C                     Z-ADD0.5       @DD
     C                     END
     C                     ADD  @DD       @KAD
      *
     C           F8KADD    IFGE 01
     C           F8KADD    ANDLE10
     C                     ADD  @DD       @JN1
     C                     ELSE
     C           F8KADD    IFGE 11
     C           F8KADD    ANDLE20
     C                     ADD  @DD       @JN2
     C                     ELSE
     C           F8KADD    IFGE 21
     C           F8KADD    ANDLE31
     C                     ADD  @DD       @JN3
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           SW        IFEQ *BLANK
     C                     Z-ADD0         C       20
     C                     MOVE '*'       SW
C    C                     Z-ADD0         @YBI
      * �
     C           F8YOBI    IFEQ 1
     C                     Z-ADD2         C
     C                     END
      * �
     C           F8YOBI    IFEQ 2
     C                     Z-ADD3         C
     C                     END
      * �
     C           F8YOBI    IFEQ 3
     C                     Z-ADD4         C
     C                     END
      * �
     C           F8YOBI    IFEQ 4
     C                     Z-ADD5         C
     C                     END
      * �
     C           F8YOBI    IFEQ 5
     C                     Z-ADD6         C
     C                     END
      * �
     C           F8YOBI    IFEQ 6
     C                     Z-ADD7         C
     C                     END
      * �
     C           F8YOBI    IFEQ 7
     C                     Z-ADD1         C
     C                     END
      *
     C                     END
      *
     C                     Z-ADDF8KADD    @YBI,C
     C                     Z-ADD0         B       20
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C           C         ADD  10        B
     C                     MOVE '1'       *IN,B
     C                     END
      *
     C           F8HIRU    IFEQ '*'
     C                     MOVE 'A'       @HIL,C
     C                     END
      *
     C           F8YORU    IFEQ '*'
     C                     MOVE 'B'       @YOL,C
     C                     END
      *
     C           F8MAEY    IFEQ 'S'
     C                     MOVE 'S'       @ZEN,C
     C                     END
      *
     C           F8MAEY    IFEQ 'E'
     C                     MOVE 'E'       @ZEN,C
     C                     END
      *
     C           F8MAEY    IFEQ 'M'
     C                     MOVE 'M'       @ZEN,C
     C                     END
      *
     C           NO1       IFEQ '2'
     C           F8RIKB    IFEQ 'R'
     C                     MOVE 'R'       @RIN,C
     C                     END
     C                     END
     C                     ADD  1         C
     C           @002      TAG
     C  N50                END
     C                     END
      *------------------------------------*
      *            �����            *
      *------------------------------------*
     C                     EXFMTA#DPW014
      *----------*
      * CMD-1 ON *
      *----------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     GOTO STP1
**  ER (ERROR-MESSAGE)
E-01 ENTER DATE
E-02 DATE IS NOT CORRECT
E-03 CONFIRM DATE
E-04 THERE IS NOT IN THE CALENDAR MASTER
