     H            Y.
     F** A#R0646F ******************************************
     F*  TAKUMI TEXAS FORECAST PROCESSING                  *
     F*                                                    *
     F* TCHK1  11/01/06 CREATE                             *
     F* TCHK2  04/17/08 FORMAT CHANGE                      *
     F* TCHK3  04/29/08 FORMAT CHANGE                      *
     F* TCHK4  05/28/10 FORMAT CHANGE                      *
     F* TCHK5  06/27/14 FORMAT CHANGE                      *
     F* JW1  2022.01.21 FORMAT CHANGE (3 WEEKS -->12 WEEKS)*
     F******************************************************
     FTAKUMITXIP  F    3000            DISK
     FAGDPL12 IF  E           K        DISK
     FABAWTAXFO   E                    DISK
      *--------------------------------------------------------
     E                    AY       3000  1
TCHK4E*                   DT8        20  8 0
TCHK4E                    DT8        20 10 0
     E                    APT        15  1
     E                    AQT         9  1
     E                    SQT         9  1
     E                    ID         10  1
     E                    A2          2  1
      *--------------------------------------------------------
     ITAKUMITXAA  01
     I                                        1  12 SEQ
     I                                       133000 DAT1
      *
     I            DS
     I                                        1  15 #PART
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
      *
     I            DS
     I                                        1   6 W@MNDD
     I                                        1   3 W@MN
     I                                        4   4 W@DASH
     I                                        5   6 W@DD
     I            DS
     I                                        1   80YMD
     I                                        1   40YY
     I                                        1   20YY1
     I                                        3   40YY2
     I                                        5   60MM
     I                                        7   80DD
      *
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1        WRITE FLAG
      *
      * CONSTANT
     C                     CLEARABAWTAX1
     C                     Z-ADD0646      AWTOKU
     C                     Z-ADD0646      AWNONY
     C                     MOVEL'0'       AWNKOJ
     C                     MOVEL'00'      AWNUKE
     C                     MOVEL'0000'    AWSBAN
      *
     C                     CLEARAY
     C                     MOVEADAT1      AY,1
     C*
     C*======================================================
     C* (HEADER) SCHEDULE DATE
     C*======================================================
     C* *IN99=*OFF : HEADER
     C           *IN99     IFEQ *OFF
     C                     CLEARDT8
     C                     Z-ADD*ZERO     X       50
     C                     Z-ADD*ZERO     Y       50
     C                     Z-ADD*ZERO     Z       50
     C                     Z-ADD*ZERO     I       50
      *
     C                     Z-ADD1         X
     C           '/Fore'   SCAN DAT1      X              10
     C   10                GOTO @@END
      *
     C                     Z-ADD1         X
     C           'FORE'    SCAN DAT1      X              10
     C  N10                Z-ADD1         X
     C  N10      'Fore'    SCAN DAT1      X              10
     C  N10                GOTO @@END
      * SKIP A
     C                     Z-ADD1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP B
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP C
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP D
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP E
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP F
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP G
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP H
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP I
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C*
     C                     Z-ADDX         Z
     C* GET DATE
JW1  C                     DO   15                         SET FC DATE X 15
     C*
     C                     ADD  1         Z
     C           AY,Z      IFEQ ','
     C                     ADD  1         Z
     C                     END
     C           AY,Z      IFEQ *BLANK
     C                     LEAVE
     C                     END
     C                     Z-ADD*ZERO     YMD
     C                     MOVEL*BLANK    A2
     C                     Z-ADD*ZERO     Y
      * MM
     C           '/'       LOKUPAY,Z                     10
     C**N10                GOTO @@END
     C  N10                LEAVE
     C           Z         SUB  2         Y
     C                     MOVEAAY,Y      A2
     C           A2,2      IFGE '0'
     C           A2,2      ANDLE'9'
     C                     MOVE A2,2      MM
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVELA2,1      MM
     C                     END
     C                     ELSE
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVE A2,1      MM
     C                     END
     C                     END
      * DD
     C                     ADD  1         Z
     C           '/'       LOKUPAY,Z                     10
     C**N10                GOTO @@END
JW1  C  N10                LEAVE
     C           Z         SUB  2         Y
     C                     MOVEAAY,Y      A2
     C           A2,2      IFGE '0'
     C           A2,2      ANDLE'9'
     C                     MOVE A2,2      DD
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVELA2,1      DD
     C                     END
     C                     ELSE
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVE A2,1      DD
     C                     END
     C                     END
     C* YYYY
     C           Z         ADD  1         Y
     C                     MOVEAAY,Y      W@A2    2
     C                     MOVELW@A2      YY2
     C                     MOVEL'20'      YY1
     C*
     C                     ADD  1         I
     C                     Z-ADDYMD       DT8,I
     C*
     C                     ENDDO
     C*
     C           I         IFEQ *ZERO
     C                     GOTO @@END
     C                     END
     C*
     C                     MOVEL*ON       *IN99
     C                     GOTO @@END
     C                     END
     C*
     C*=====================================================
     C* (DETAIL) PART/QTY
     C*=====================================================
     C           AY,1      IFEQ ','
     C           AY,1      OREQ ' '
     C           AY,1      OREQ 'N'
     C                     GOTO @@END
     C                     END
     C* SKIP A(SEQ#)
     C                     Z-ADD1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C* -------------
     C* GET B(PART#)
     C* -------------
     C                     MOVEL*BLANK    APT
     C                     Z-ADDX         Y       50
     C                     Z-ADD*ZERO     Z       50
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C                     ADD  1         X
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFEQ '-'
     C           AY,Y      OREQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      APT,Z
     C                     ENDDO
     C                     MOVEAAPT       #PART
JW1  C* SKIP C(TYPE)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
 .   C* SKIP D(SIZE)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C* -----------
     C* GET E(QPC)
     C* -----------
     C                     MOVE *BLANKS   AQT
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      AQT,Z
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX
     C                     MOVE AWXXXX    AW5555  5
     C                     MOVELAW5555    AWSYOS
JW1  C* SKIP F(WGT)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
JW1  C* SKIP G(PRICE)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP H(TITLE)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP I(FIRM)
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP J
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
      * SKIP K
     C**                   ADD  1         X
     C**         ','       LOKUPAY,X                     10
     C**N10                GOTO @@END
      *******************
      * GET FORECAST QTY
      *******************
     C                     ADD  1         X
     C                     Z-ADD*ZERO     I
     C*
     C                     DO   *HIVAL
     C*
TCHK4C           AY,X      IFEQ *BLANK
     C                     LEAVE
     C                     END
     C                     MOVE *BLANKS   AQT
     C                     Z-ADD*ZERO     Z
     C                     Z-ADDX         Y
     C*
     C                     DO   *HIVAL
     C           AY,Y      IFEQ ','
     C           AY,Y      OREQ *BLANK
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ADD  1         Y
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      AQT,Z
     C                     ADD  1         Y
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX  9
     C                     MOVELAWXXXX    AWSRYO
     C*
     C                     ADD  1         I
     C           DT8,I     IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     Z-ADDDT8,I     AWSTRD
     C                     Z-ADDDT8,I     YMD
     C* --------
     C* END DATE
     C* --------
     C           K#AGDP    KLIST
     C                     KFLD           YY
     C                     KFLD           MM
     C                     KFLD           DD
     C           K#AGDP    SETLLAGDPL12
     C                     READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C  N41                READ AGDPL12                  41
     C                     Z-ADDF8KAYY    YY
     C                     Z-ADDF8KAMM    MM
     C                     Z-ADDF8KADD    DD
     C                     Z-ADDYMD       AWENDD
     C* ------
     C* WRITE
     C* ------
     C                     WRITEABAWTAX1
     C                     MOVE '1'       PID
     C*
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
     C                     ADD  1         X
     C*
     C                     ENDDO
     C*
     C*-------------------------------------------------
     C*
     C           @@END     TAG
     C******************************************************
     C           #QTY      BEGSR
     C******************************************************
     C                     Z-ADD9         S       20
     C                     Z-ADD9         F       20
     C                     DO   9
     C           AQT,S     IFGE '0'
     C           AQT,S     ANDLE'9'
     C                     MOVE AQT,S     SQT,F
     C           F         SUB  1         F
     C                     END
     C           S         SUB  1         S
     C                     ENDDO
      *
     C                     ENDSR
