     H            Y.
     F** A#R0556U ******************************************
     F*  FUTABA CHICAGO ORDER PROCESSING                   *
     F*  (ASSIGN BIN# BY ORDER#)                           *
     F*                                                    *
     F*  JW   2018.02.01                                   *
     F******************************************************
     FAB#WFCH UF  E           K        DISK
      *--------------------------------------------------------
     C                     MOVE 'Y'       FIRST   1
      *
     C           *LOVAL    SETLLAB#WFCH
     C           *IN95     DOWEQ*OFF
     C                     READ AB#WFCH                  95
     C           *IN95     IFEQ *OFF
      * FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDAWNONY    SVNONY  40
     C                     MOVELAWORDN    SVORDN 10
     C                     Z-ADD1         BIN#    10
     C                     ENDIF
      * BREAK?
     C           AWNONY    IFNE SVNONY
     C           AWORDN    ORNE SVORDN
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL
     C                     MOVELBIN#      AWBIN#
     C                     UPDATAB#WFCH1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *--------------------------------------------------------
      *  BREAK PROCESS
      *--------------------------------------------------------
     C           #BRK1     BEGSR
      *
     C                     ADD  1         BIN#
      * SET KEY
     C                     Z-ADDAWNONY    SVNONY
     C                     MOVELAWORDN    SVORDN
      *
     C                     ENDSR
