     H            Y.
     F** A#R0681O(A#R2E,AB#R2E) ****************************
     F*  PMO ORDER PROCESSING                              *
     F*           NOV/11/03                                *
TCH38F*    TCH 02/18/05                                    *
TCHK F*    TCH 08/26/05 RE-MAKE                            *
TCHK1F*    TCH 04/25/06 RE-MAKE                            *
TCHK2F*    TCH 10/16/06 CHG FORMAT                         *
TCHK3F*    TCH 04/25/08 CHG USER PART# FORMAT              *
TCHK4F*    TCH 11/23/09 CHG FORMAT                         *
TCHK5F*    TCH 06/07/11 CHG FORMAT                         *
TCHK6F*    TCH 10/28/11 CHG FORMAT                         *
JW1  F*    JW  09/16/19 CHG FORMAT (3 TO 5 DAYS)           *
JW2  F*    JW  12/10/19 ADD TENNESSEE (0682)               *
JW3  F*    JW  07/29/20 CHG FORMAT (5 TO 3 DAYS)           *
     F******************************************************
     FPMO     IP  F     800            DISK
     FAB#WPMO O   E                    DISK
      *--------------------------------------------------------
     E                    AY        800  1
TCHK E                    DAT        10  8 0
     E                    A2          2  1
     E                    A9          9  1
     E                    A9X         9  1
TCHK3E                    A20        20  1
      *--------------------------------------------------------
     IPMO     AA  01
     I                                        1  12 SEQ
     I                                       13 268 DAT1
     I                                      269 524 DAT2
     I                                      525 780 DAT3
     I            DS
     I                                        1   80YMD
     I                                        1   2 CNTRY
     I                                        3   4 YEAR
     I                                        5   6 MONTH
     I                                        7   8 DAY
     I            DS
     I                                        1   8 ORDR
     I                                        1   2 MM
     I                                        3   4 DD
     I                                        5   8 YY
TCHK3I            DS
TCHK3I                                        1  20 AWMHIN
TCHK3I                                        1   5 AWMHN1
TCHK3I                                        6  10 AWMHN2
TCHK3I                                       11  15 AWMHN3
TCHK3I                                       16  20 AWMHN4
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
      * HEADER
     C                     MOVEADAT1      AY,1
     C                     MOVEADAT2      AY,257
     C                     MOVEADAT3      AY,513
      * DATE
     C           *IN99     IFEQ *OFF
     C***                  Z-ADD1         IX      30
TCHK2C***        'NUMBER,' SCAN DAT1      IX             10
TCHK2C**N10                GOTO @END
TCHK2C***        'QTY,'    SCAN DAT1      IX             10
TCHK2C**N10                GOTO @END
JW2   *===============
 |    * SET SHIPTO FLAG (SFLAG=O: PMO, T: PMT)
 |    *===============
 |   C                     Z-ADD1         IX      30
 |   C           'OHIO'    SCAN DAT1      IX             10
 |   C   10                MOVE 'O'       SFLAG   1
 |   C                     Z-ADD1         IX
 |   C           'TENNE'   SCAN DAT1      IX             10
JW2  C   10                MOVE 'T'       SFLAG
      *===============
      * GET SHIP DATE
      *===============
TCHK2C           'DUE DAT' SCAN DAT1      IX             10
TCHK2C  N10                GOTO @END
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     IY      30
     C                     Z-ADD*ZERO     II      30
TCHK2C                     Z-ADD1         IX
TCHK2C           ','       LOKUPAY,IX                    10
TCHK2C  N10                GOTO @END
TCHK2C                     ADD  1         IX
TCHK2C           ','       LOKUPAY,IX                    10   11
TCHK2C  N10                GOTO @END
TCHK2C                     ADD  1         IX
TCHK2C           ','       LOKUPAY,IX                    10
TCHK2C  N10                GOTO @END
TCHK2C                     ADD  1         IX
TCHK2C           ','       LOKUPAY,IX                    10
TCHK2C  N10                GOTO @END
TCHK6C                     ADD  1         IX
TCHK6C           ','       LOKUPAY,IX                    10
TCHK6C  N10                GOTO @END
      *
TCHK4C*                    DO   2
TCHK5C*TCHK4               DO
TCHK6C*TCHK5               DO   2
JW3  C                     DO   3
JW1  C**JW3                DO   5
      *
     C                     ADD  1         IX
     C           ','       LOKUPAY,IX                    10
     C  N10                LEAVE
      *
     C                     MOVEL*ZERO     YMD
     C                     Z-ADDIX        IZ      30
     C* MM
     C                     ADD  1         IZ
     C           '/'       LOKUPAY,IZ                    10
     C  N10                LEAVE
     C           IZ        SUB  2         IY
     C                     MOVEAAY,IY     A2
     C           A2,2      IFGE '0'
     C           A2,2      ANDLE'9'
     C                     MOVE A2,2      MONTH
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVELA2,1      MONTH
     C                     END
     C                     ELSE
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVE A2,1      MONTH
     C                     END
     C                     END
     C* DD
     C                     ADD  1         IZ
     C           '/'       LOKUPAY,IZ                    10
     C  N10                LEAVE
     C           IZ        SUB  2         IY
     C                     MOVEAAY,IY     A2
     C           A2,2      IFGE '0'
     C           A2,2      ANDLE'9'
     C                     MOVE A2,2      DAY
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVELA2,1      DAY
     C                     END
     C                     ELSE
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVE A2,1      DAY
     C                     END
     C                     END
     C* YY
     C           IZ        ADD  1         IY
     C                     MOVEAAY,IY     A2
     C           A2,2      IFGE '0'
     C           A2,2      ANDLE'9'
     C                     MOVE A2,2      YEAR
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVELA2,1      YEAR
     C                     END
     C                     ELSE
     C           A2,1      IFGE '0'
     C           A2,1      ANDLE'9'
     C                     MOVE A2,1      YEAR
     C                     END
     C                     END
     C*
     C                     MOVEL'20'      CNTRY
      *
     C                     ADD  1         II
     C                     Z-ADDYMD       DAT,II
     C  N99                MOVE *ON       *IN99
      *
     C                     ENDDO
      *
     C                     GOTO @END
      *
     C                     END
      *
      * DETAIL
     C                     Z-ADD*ZERO     IW      30
     C           *IN99     IFEQ *ON
     C                     Z-ADD1         IX
     C           '-'       LOKUPAY,IX                    10
      * PART#
     C           *IN10     CABEQ*OFF      @END
      *
TCHK3C*          IX        SUB  5         IZ
TCHK3C*          5         SUBSTDAT1:Z    AWMHN1
TCHK3C*          IX        ADD  1         IZ
TCHK3C*          5         SUBSTDAT1:IZ   AWMHN2
TCHK3C                     Z-ADD*ZERO     IX
TCHK3C                     Z-ADD*ZERO     IZ
TCHK3C                     MOVEL*BLANK    A20
TCHK3C                     DO   *HIVAL
TCHK3C                     ADD  1         IX
TCHK3C           AY,IX     IFEQ ','
TCHK3C           AY,IX     OREQ *BLANK
TCHK3C                     LEAVE
TCHK3C                     END
TCHK3C           AY,IX     IFEQ '-'
TCHK3C                     ITER
TCHK3C                     END
TCHK3C                     ADD  1         IZ
TCHK3C                     MOVELAY,IX     A20,IZ
TCHK3C                     ENDDO
TCHK3C                     MOVEAA20       AWMHIN
TCHK3C           AWMHIN    IFEQ *BLANK
TCHK3C                     GOTO @END
TCHK3C                     END
      * KANBAN NUMBER
     C                     ADD  1         IX
     C           '-'       LOKUPAY,IX                    10
     C           *IN10     CABEQ*OFF      @END
      *
TCHK4C           IX        SUB  3         IZ
TCHK4C           6         SUBSTDAT1:IZ   AWSBAN
      * QTY/BOX
     C                     ADD  1         IX
     C           ','       LOKUPAY,IX                    10
     C  N10                GOTO @END
     C                     Z-ADDIX        IZ
     C                     Z-ADD*ZERO     IW
     C                     MOVEL*BLANK    A9
     C                     DO   *HIVAL
     C                     ADD  1         IZ
     C           AY,IZ     IFEQ ','
     C                     LEAVE
     C                     END
     C                     ADD  1         IW
     C                     MOVELAY,IZ     A9,IW
     C                     ENDDO
      *
     C                     MOVE '0'       A9X
     C                     Z-ADD9         IW
     C                     Z-ADD9         IV      30
     C                     DO   9
     C           A9,IW     IFNE *BLANK
     C                     MOVE A9,IW     A9X,IV
     C                     SUB  1         IV
     C                     END
     C                     SUB  1         IW
     C           IW        IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVE @9C       @9      90
     C                     Z-ADD@9        AWSYOS
      * QTY
     C                     Z-ADD*ZERO     IY
     C                     Z-ADD*ZERO     II
     C                     Z-ADD*ZERO     IW
     C                     MOVE *BLANK    A9
     C*
TCHK2C                     ADD  1         IX
TCHK2C           ','       LOKUPAY,IX                    10
TCHK2C  N10                GOTO @END
TCHK6C                     ADD  1         IX
TCHK6C           ','       LOKUPAY,IX                    10
TCHK6C  N10                GOTO @END
      *
     C**JW1                DO   3
JW1  C**JW3                DO   5
JW3  C                     DO   3
     C*
     C                     ADD  1         IX
     C           ','       LOKUPAY,IX                    10
     C  N10                LEAVE
     C*
     C                     Z-ADDIX        IZ
     C                     Z-ADD*ZERO     IW
     C                     MOVEL*BLANK    A9
      *
     C                     DO   *HIVAL
     C                     ADD  1         IZ
     C           AY,IZ     IFEQ ','
     C           AY,IZ     OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         IW
     C                     MOVELAY,IZ     A9,IW
     C                     ENDDO
      *
     C                     MOVE '0'       A9X
     C                     Z-ADD9         IW
     C                     Z-ADD9         IV      30
     C                     DO   9
     C           A9,IW     IFNE *BLANK
     C                     MOVE A9,IW     A9X,IV
     C                     SUB  1         IV
     C                     END
     C                     SUB  1         IW
     C           IW        IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVE @9C       @9      90
     C                     Z-ADD@9        AWSRYO
     C*
     C                     ADD  1         II
     C*
     C           AWSRYO    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C                     Z-ADD0681      AWTOKU
     C                     Z-ADD0681      AWNONY
JW2   * FOR PMT
 |   C           SFLAG     IFEQ 'T'
 |   C                     Z-ADD0682      AWNONY
JW2  C                     ENDIF
      *
     C                     MOVE '0'       AWNKOJ
     C                     MOVE '00  '    AWNUKE
TCHK4C           AWSBAN    IFEQ *BLANK
TCHK4C                     MOVEL'0000'    AWSBAN
TCHK4C                     END
      *
     C           DAT,II    IFGE *DATE
     C                     Z-ADDDAT,II    AWSHDT
     C                     Z-ADDDAT,II    YMD
     C                     MOVELYEAR      YY
     C                     MOVELMONTH     MM
     C                     MOVELDAY       DD
     C                     MOVELORDR      AWORDN
     C                     WRITEAB#WPMO1
     C                     MOVE '1'       PID
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDIF
      *
     C           @END      TAG
