     H            Y.
     F** AB#R2E *******************************
     F*  ABI ORDER PROCESSING              *
     F*                                       *
     F*
TCH66F* TCH   06/01/05 ABI COPIED FROM AB#R2E
TCHK1F* TCHK1 12/01/05 RE-MAKE FOR CHANGE FORMAT
TCHK2F* TCHK2 08/18/10 SEPARATE DOCK BY USER PART#
TCHK3F* TCHK3 08/04/11 ADD SEPARATE USER PART#
     F******************************* AB#R2E **
     FABI     IP  F     800            DISK
     FAB#WABI O   E                    DISK
      *--------------------------------------------------------
TCHK3E*TCHK2              UP#     1  10 15   NUK    02
TCHK3E                    UP#     1  11 15   NUK    02
     E                    AY        800  1
     E                    DAT       100  8 0
     E                    DT4         4  1
     E                    DT2         2  1
     E                    ORD       100 10
     E                    OD         10  1
     E                    A9          9  1
     E                    A9X         9  1
     E                    MHN        15  1
      *--------------------------------------------------------
     IABI     AA  01
     I                                        1  12 SEQ
     I                                       13 268 DAT1
     I                                      269 524 DAT2
     I                                      525 780 DAT3
     I            DS
     I                                        1   8 YMD
     I                                        1   4 YY
     I                                        5   6 MM
     I                                        7   8 DD
     I            DS
     I                                        1  15 AWMHNX
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
     I            DS
     I                                        1  140W@TIME
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
     C                     Z-ADD0465      AWTOKU
     C                     Z-ADD0465      AWNONY
     C                     MOVE '0'       AWNKOJ
TCHK2C*                    MOVE '00  '    AWNUKE
     C                     MOVE '000000'  AWSBAN
     C                     MOVE '1'       AWBIN#
      *
     C                     MOVEADAT1      AY,1
      *
      * ------------------------------
      * SHIP DATE & 'QTY/BOX' POSITION
      * ------------------------------
     C           *IN99     IFEQ *OFF
      *
     C                     Z-ADD1         X       30
     C                     Z-ADD*ZERO     I       30
      *
     C           'SHIPPIN' SCAN DAT1      X              10
     C  N10      'Shippin' SCAN DAT1      X              10
     C  N10                GOTO @END
     C                     Z-ADD*ZERO     J       30
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         J
     C           ','       LOKUPAY,J                     10
     C  N10                LEAVE
     C           J         ADD  1         L       30
     C           AY,L      IFGE '0'
     C           AY,L      ANDLE'9'
     C                     ELSE
     C                     ITER
     C                     END
      *
     C                     ADD  1         I
      *MM
     C                     MOVEAAY,L      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       MM
     C                     ELSE
     C                     MOVE '00'      MM
     C                     MOVE DT2,1     MM
     C                     END
      *DD
     C           '/'       LOKUPAY,L                     10
     C  N10                ITER
     C                     ADD  1         L
     C                     MOVEAAY,L      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       DD
     C                     ELSE
     C                     MOVE '00'      DD
     C                     MOVE DT2,1     DD
     C                     END
      *
     C                     MOVELMM        MM##N   20
     C           MM##N     IFLT W@DM
     C           W@DY      ADD  1         YY##N   40
     C                     ELSE
     C                     Z-ADDW@DY      YY##N
     C                     END
     C                     MOVELYY##N     YY
     C                     MOVELYMD       DAT,I
      *
     C                     ENDDO
      *
     C                     Z-ADD1         X
     C           'QTY/'    SCAN DAT1      X              10
     C  N10      'Qty/'    SCAN DAT1      X              10
     C  N10                GOTO @END
      *
     C                     Z-ADD*ZERO     X
      *
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
     C                     ADD  1         W#PQB
     C           X         ADD  1         L
     C                     MOVEAAY,L      W##A4   4
     C           W##A4     IFEQ 'QTY/'
     C           W##A4     OREQ 'Qty/'
     C                     LEAVE
     C                     ELSE
     C                     ITER
     C                     END
     C                     ENDDO
      *
     C           DAT,1     IFNE *ZERO
     C           W#PQB     ANDNE*ZERO
     C                     MOVEL*ON       *IN99
     C                     END
      *
     C                     GOTO @END
      *
     C                     END
      * ------------
      * ORDER NUMBER
      * ------------
     C           *IN98     IFEQ *OFF
      *
     C           'ORDER R' SCAN DAT1      X              10
     C  N10      'Order R' SCAN DAT1      X              10
     C  N10                GOTO @END
     C                     Z-ADD*ZERO     J
     C                     Z-ADD*ZERO     I
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         J
     C           ','       LOKUPAY,J                     10
     C  N10                LEAVE
     C           J         ADD  1         L
     C           AY,L      IFEQ ','
     C           AY,L      OREQ ' '
     C                     LEAVE
     C                     END
      *
     C                     MOVEL*BLANK    OD
     C                     Z-ADD*ZERO     K       20
     C                     DO   *HIVAL
     C           AY,L      IFEQ ','
     C           AY,L      OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         K
     C                     MOVELAY,L      OD,K
     C                     ADD  1         L
     C                     ENDDO
      *
     C                     MOVEAOD        W#A10  10
     C                     ADD  1         I
     C                     MOVELW#A10     ORD,I
      *
     C                     ENDDO
      *
     C           ORD,1     IFNE *BLANK
     C                     MOVEL*ON       *IN98
     C                     END
      *
     C                     GOTO @END
      *
     C                     END
      *
      * ------
      * DETAIL
      * ------
      *
      * PART#
      *
     C                     Z-ADD1         X
     C           '-'       SCAN DAT1      X              10
     C  N10                GOTO @END
      *
     C                     MOVEL*BLANK    MHN
     C                     Z-ADD*ZERO     J
     C                     Z-ADD*ZERO     L
      *
     C                     DO   *HIVAL
     C                     ADD  1         J
     C           AY,J      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,J      IFEQ '-'
     C                     ITER
     C                     END
     C                     ADD  1         L
     C                     MOVELAY,J      MHN,L
     C                     ENDDO
      *
     C                     MOVEAMHN       AWMHNX
TCHK2C*
TCHK2C                     Z-ADD1         H       20
TCHK2C           AWMHNX    LOKUPUP#,H                    11
TCHK2C           *IN11     IFEQ *OFF
TCHK2C                     MOVEL'00'      AWNUKE
TCHK2C                     ELSE
TCHK2C                     MOVELNUK,H     AWNUKE
TCHK2C                     END
TCHK2C*
      *
      *
      * QTY/BOX
      *   GET QTY/BOX POSITION
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     J
      *
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
     C                     ADD  1         J
     C           J         IFEQ W#PQB
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     Z-ADDX         J
     C                     MOVEL*BLANK    A9
     C                     Z-ADD*ZERO     L
     C                     DO   *HIVAL
     C                     ADD  1         J
     C           AY,J      IFEQ ','
     C           AY,J      OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         L
     C                     MOVELAY,J      A9,L
     C                     ENDDO
      *
     C                     MOVEL*ZERO     A9X
     C                     Z-ADD9         J
     C                     Z-ADD9         L
     C                     DO   9
     C           A9,J      IFNE *BLANK
     C                     MOVELA9,J      A9X,L
     C                     SUB  1         L
     C                     END
     C                     SUB  1         J
     C           J         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVEL@9C       @9      90
     C                     Z-ADD@9        AWSYOS
      *
      * QTY
     C                     Z-ADD1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
      *
     C           W#PQB     SUB  1         N       30
     C                     Z-ADD*ZERO     I
     C                     Z-ADDX         J
      *
     C                     DO   *HIVAL
      *
     C                     Z-ADD*ZERO     L
     C                     MOVE *BLANK    A9
     C                     DO   *HIVAL
     C                     ADD  1         J
     C           AY,J      IFEQ ','
     C           AY,J      OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         L
     C                     MOVE AY,J      A9,L
     C                     ENDDO
      *
     C                     MOVEL*ZERO     A9X
     C                     Z-ADD9         M       30
     C                     Z-ADD9         L
     C                     DO   9
     C           A9,M      IFNE *BLANK
     C                     MOVELA9,M      A9X,L
     C                     SUB  1         L
     C                     END
     C                     SUB  1         M
     C           M         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVE @9C       @9      90
     C                     Z-ADD@9        AWSRYO
      *
      * WRITE
     C                     ADD  1         I
     C           AWSRYO    IFNE *ZERO
     C           DAT,I     ANDNE*ZERO
     C           ORD,I     ANDNE*BLANK
     C                     Z-ADDDAT,I     AWSHDT
     C                     MOVELORD,I     AWORDN
     C                     WRITEAB#WABI1
     C                     MOVE '1'       PID
     C                     END
     C           I         IFEQ N
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C           @END      TAG
      ******************************************************
     C           *INZSR    BEGSR
      ******************************************************
      *
     C                     TIME           W@TIME
     C                     Z-ADD*ZERO     W#PQB   20
      *
     C                     ENDSR
**
15157880030CHG 01
14354214020    01
98112106013    01
98273112003    01
99141160612    01
9011906084     01
13151110540    02
13151110610    02
13151110840    02
98172108007    02
15157880030    02
