     H            Y.
     F** A#R3318F ******************************************
     F*  TBCA FORECAST PROCESSING                          *
     F*                                                    *
     F* TCHK1  10/27/08 CREATE                             *
     F******************************************************
     FTBCAF   IP  F     600            DISK
     FAGDPL12 IF  E           K        DISK
     FABAW3318O   E                    DISK
      *--------------------------------------------------------
     E                    AY        600  1
     E                    DT2         2  1
     E                    APT        15  1
     E                    AQT         9  1
     E                    SQT         9  1
     E                    ID         10  1
      *--------------------------------------------------------
     ITBCAF   AA  01
     I                                        1  12 DAT1
     I                                       13 600 DAT2
      *
     I            DS
     I                                        1  15 #PART
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
      *
     I            DS
     I                                        1   6 W@MNDD
     I                                        1   3 W@MN
     I                                        4   4 W@DASH
     I                                        5   6 W@DD
     I            DS
     I                                        1   8 YMD
     I                                        1   4 YY
     I                                        1   2 YY1
     I                                        3   4 YY2
     I                                        5   6 MM
     I                                        7   8 DD
     I            DS
     I                                        1   80AWENDD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80K#YMD
     I                                        1   40K#YY
     I                                        5   60K#MM
     I                                        7   80K#DD
      *
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
      * CONSTANT
     C                     CLEARABAWTBCA
     C                     Z-ADD3318      AWTOKU
     C                     Z-ADD3318      AWNONY
     C                     MOVE '0'       AWNKOJ
     C                     MOVE '00  '    AWNUKE
      *
     C                     CLEARAY
     C                     MOVEADAT2      AY,1
     C*
     C*=======
     C* DETAIL
     C*=======
     C*
     C* -------------
     C*   PART NUMBER
     C* -------------
     C                     MOVEL*BLANK    APT
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD*ZERO     Z       30
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFEQ '-'
     C           AY,Y      OREQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      APT,Z
     C                     ENDDO
     C                     MOVEAAPT       #PART
     C*
     C* -------------
     C*   KANBAN#
     C* -------------
     C                     MOVEL*BLANK    ID
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD*ZERO     Z       30
     C                     Z-ADD1         X       30
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C*
     C                     Z-ADDX         Y
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      ID,Z
     C                     ENDDO
     C                     MOVEAID        AWSBAN
     C*
     C* -------
     C* QTY/BOX
     C* -------
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C*
     C                     MOVE *BLANKS   AQT
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      AQT,Z
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX
     C                     MOVE AWXXXX    AW5555  5
     C                     MOVELAW5555    AWSYOS
      *
      * ---
      * QTY
      * ---
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C*
     C                     MOVE *BLANKS   AQT
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      AQT,Z
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX  9
     C                     MOVELAWXXXX    AWSRYO
     C*
     C* ----------
     C* START DATE
     C* ----------
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     Z
     C                     MOVEL*ZERO     YMD
      * MM
     C                     ADD  1         Y
     C                     MOVEAAY,Y      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       MM
     C                     ELSE
     C                     MOVE '00'      MM
     C                     MOVE DT2,1     MM
     C                     END
      * DD
     C           '/'       LOKUPAY,Y                     10
     C  N10                GOTO @@END
     C                     ADD  1         Y
     C                     MOVEAAY,Y      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       DD
     C                     ELSE
     C                     MOVE '00'      DD
     C                     MOVE DT2,1     DD
     C                     END
      * YY
     C           '/'       LOKUPAY,Y                     10
     C  N10                GOTO @@END
     C                     ADD  1         Y
     C                     MOVEAAY,Y      YY
     C                     MOVELYMD       AWSTRD
     C*
     C* --------
     C* END DATE
     C* --------
     C           K#AGDP    KLIST
     C                     KFLD           K#YY
     C                     KFLD           K#MM
     C                     KFLD           K#DD
     C                     MOVELYY        K#YY
     C                     MOVELMM        K#MM
     C                     MOVELDD        K#DD
     C           K#AGDP    SETLLAGDPL121
     C                     READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C  N44                READ AGDPL121                 44
     C*
     C*
     C* WRITE
     C*
     C                     WRITEABAWTBCA
     C                     MOVE '1'       PID
     C*
     C*-------------------------------------------------
     C*
     C           @@END     TAG
     C******************************************************
     C           #QTY      BEGSR
     C******************************************************
     C                     Z-ADD9         S       20
     C                     Z-ADD9         F       20
     C                     DO   9
     C           AQT,S     IFGE '0'
     C           AQT,S     ANDLE'9'
     C                     MOVE AQT,S     SQT,F
     C           F         SUB  1         F
     C                     END
     C           S         SUB  1         S
     C                     ENDDO
      *
     C                     ENDSR
