     H            Y.
     F** AB#R4I ********************************************
     F*  OTICS ORDER PROCESSING                            *
     F*                                                    *
     F*                                                    *
TCHK1F* TCHK1 12/13/05 Create(copy from AB#R4H)            *
TCHK2F* TCHK2 04/05/06 CHG FORMAT(DATE)                    *
     F******************************************** AB#R4I **
     FOTICS   IP  F     800            DISK
     FAB#WOTI O   E                    DISK
      *--------------------------------------------------------
     E                    AY        800  1
     E                    DT8        50  8
     E                    DT4         4  1
     E                    DT2         2  1
     E                    OD         10  1
     E                    A9          9  1
     E                    A9X         9  1
     E                    MHN        15  1
      *--------------------------------------------------------
     IOTICS   AA  01
     I                                        1  12 SEQ
     I                                       13 268 DAT1
     I                                      269 524 DAT2
     I                                      525 780 DAT3
     I            DS
     I                                        1   8 YMD
     I                                        1   4 YY
TCHK2I                                        1   2 YY1
TCHK2I                                        3   4 YY2
     I                                        5   6 MM
     I                                        7   8 DD
     I            DS
     I                                        1  15 AWMHNX
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
     I            DS
     I                                        1  140W@TIME
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
     C                     Z-ADD0740      AWTOKU
     C                     Z-ADD0740      AWNONY
     C                     MOVEL'0'       AWNKOJ
     C                     MOVEL'00  '    AWNUKE
     C                     MOVEL'000000'  AWSBAN
     C                     MOVEL'1'       AWBIN#
      *
     C                     MOVEADAT1      AY,1
      *
      * ------
      * HEADER
      * ------
     C           *IN99     IFEQ *OFF
      *
     C                     Z-ADD1         X       30
     C           ',ORDER,' SCAN DAT1      X              10
     C  N10      ',Order,' SCAN DAT1      X              10
     C  N10                GOTO @END
      *
     C                     Z-ADD1         X
     C           '-'       LOKUPAY,X                     10
     C  N10                GOTO @END
      *
     C                     Z-ADDX         I       30
     C                     Z-ADD*ZERO     J       30
     C                     MOVEL*BLANK    OD
      *
     C                     DO   *HIVAL
     C                     ADD  1         I
     C           AY,I      IFGE '0'
     C           AY,I      ANDLE'9'
     C                     ADD  1         J
     C                     MOVELAY,I      OD,J
     C                     ELSE
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAOD        AWORDN
     C           AWORDN    IFNE *BLANK
     C                     MOVEL*ON       *IN99
     C                     END
      *
     C                     GOTO @END
      *
     C                     END
      *
      * ----------
      * ORDER DATE
      * ----------
     C           *IN98     IFEQ *OFF
      *
     C                     Z-ADD1         X
     C           '/'       SCAN DAT1      X              10
     C  N10                GOTO @END
      *
      * search & set for 1st date start point
     C                     Z-ADD1         X
     C           '/'       LOKUPAY,X                     10
     C  N10                GOTO @END
     C                     Z-ADDX         I
     C                     DO   *HIVAL
     C                     SUB  1         I
     C           I         IFLE *ZERO
     C                     LEAVE
     C                     END
     C           AY,I      IFEQ ','
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C           I         IFLE *ZERO
     C                     GOTO @END
     C                     ELSE
     C                     Z-ADDI         X
     C                     END
      *
     C                     Z-ADD*ZERO     W@SDT   20
     C                     MOVEL*ZERO     DT8
     C                     Z-ADD*ZERO     I
      *
     C                     DO   *HIVAL
      *
     C                     Z-ADDX         J
     C                     MOVEL*ZERO     YMD
      * MM
     C                     ADD  1         J
     C                     MOVEAAY,J      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       MM
     C                     ELSE
     C                     MOVE DT2,1     MM
     C                     END
      * DD
     C           '/'       LOKUPAY,J                     10
     C  N10                LEAVE
     C                     ADD  1         J
     C                     MOVEAAY,J      DT2
     C           DT2,2     IFGE '0'
     C           DT2,2     ANDLE'9'
     C                     MOVEADT2       DD
     C                     ELSE
     C                     MOVE DT2,1     DD
     C                     END
      * YY
     C           '/'       LOKUPAY,J                     10
     C  N10                LEAVE
     C                     ADD  1         J
TCHK2C                     MOVEAAY,J      YY2
TCHK2C                     MOVEL'20'      YY1
     C                     ADD  1         I
     C                     MOVELYMD       DT8,I
     C                     ADD  1         W@SDT
      * search next date
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
      *
     C                     ENDDO
      *
     C           W@SDT     IFNE *ZERO
     C                     MOVEL*ON       *IN98
     C                     END
      *
     C                     GOTO @END
      *
     C                     END
      *
      * ------
      * DETAIL
      * ------
     C                     Z-ADD1         X
     C           '-'       SCAN DAT1      X              10
     C           *IN10     IFEQ *OFF
     C           *IN97     IFEQ *ON
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C                     ELSE
     C                     GOTO @END
     C                     END
     C                     END
      *
     C  N97                MOVEL*ON       *IN97
      *
      *
      * PART#
     C                     Z-ADD1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
      *
     C                     MOVEL*BLANK    MHN
     C                     Z-ADDX         I
     C                     Z-ADD*ZERO     J
      *
     C                     DO   *HIVAL
     C                     ADD  1         I
     C           AY,I      IFEQ ','
     C           AY,I      OREQ ' '
     C                     LEAVE
     C                     END
     C           AY,I      IFEQ '-'
     C                     ITER
     C                     END
     C                     ADD  1         J
     C                     MOVELAY,I      MHN,J
     C                     ENDDO
      *
     C                     MOVEAMHN       AWMHNX
      *
      *
      * QTY/BOX
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
      *
     C                     Z-ADDX         I
     C                     MOVEL*BLANK    A9
     C                     Z-ADD*ZERO     J
     C                     DO   *HIVAL
     C                     ADD  1         I
     C           AY,I      IFEQ ','
     C           AY,I      OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         J
     C                     MOVELAY,I      A9,J
     C                     ENDDO
      *
     C                     MOVEL*ZERO     A9X
     C                     Z-ADD9         I
     C                     Z-ADD9         J
     C                     DO   9
     C           A9,I      IFNE *BLANK
     C                     MOVELA9,I      A9X,J
     C                     SUB  1         J
     C                     END
     C                     SUB  1         I
     C           I         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVEL@9C       @9      90
     C                     Z-ADD@9        AWSYOS
      *
      *
      * QTY
     C                     Z-ADD*ZERO     K       30
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         K
     C           K         IFGT W@SDT
     C                     LEAVE
     C                     END
      *
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
      *
     C                     Z-ADDX         I
     C                     MOVEL*BLANK    A9
     C                     Z-ADD*ZERO     J
      *
     C                     DO   *HIVAL
     C                     ADD  1         I
     C           AY,I      IFEQ ','
     C           AY,I      OREQ ' '
     C                     LEAVE
     C                     END
     C                     ADD  1         J
     C                     MOVELAY,I      A9,J
     C                     ENDDO
      *
     C                     MOVEL*ZERO     A9X
     C                     Z-ADD9         I
     C                     Z-ADD9         J
     C                     DO   9
     C           A9,I      IFNE *BLANK
     C                     MOVELA9,I      A9X,J
     C                     SUB  1         J
     C                     END
     C                     SUB  1         I
     C           I         IFEQ *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVE @9C       @9      90
     C                     Z-ADD@9        AWSRYO
     C                     MOVELDT8,K     AWSHDT
      *
      * write
     C                     WRITEAB#WOTI1
     C                     MOVE '1'       PID
      *
     C                     ENDDO
      *
     C           @END      TAG
      ******************************************************
     C           *INZSR    BEGSR
      ******************************************************
      *
     C                     TIME           W@TIME
      *
     C                     ENDSR
