     H            Y.
     F** AB#R5J ********************************************
     F*  ARMX FORECAST PROCESSING                          *
     F*                                                    *
     F* TCHK1  02/07/06 CREATE                             *
     F* TCHK2  02/20/06 CHG FORMAT                         *
     F******************************************************
     FARMX    IP  F     600            DISK
     FABAWMXF O   E                    DISK
     FAGDPL12 IF  E           K        DISK
      *--------------------------------------------------------
     E                    MN1    12  12  3
     E                    MN2    12  12  3
      *
     E                    AY        600  1
     E                    DTS        20  8 0
     E                    DTE        20  8 0
     E                    MMS        20  2 0
     E                    DDS        20  2 0
     E                    A21         2  1
      *
     E                    APT        15  1
     E                    AQT         9  1
     E                    SQT         9  1
      *--------------------------------------------------------
     IARMX    AA  01
     I                                        1  12 DAT1
     I                                       13 600 DAT2
      *
     I            DS
     I                                        1  15 #PART
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
      *
     I            DS
     I                                        1   6 W@MNDD
     I                                        1   3 W@MN
     I                                        4   4 W@DASH
     I                                        5   6 W@DD
     I            DS
     I                                        1   80YMD
     I                                        1   40YEAR
     I                                        5   60MONTH
     I                                        7   80DAY
     I            DS
     I                                        1   80AWENDD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      *
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
      * CONSTANT
     C                     CLEARABAWMXF1
     C                     Z-ADD3316      AWTOKU
     C                     Z-ADD3316      AWNONY
     C                     MOVE '0'       AWNKOJ
     C                     MOVE '00  '    AWNUKE
      *
     C                     CLEARAY
     C                     MOVEADAT2      AY,1
     C* =====================
     C* HEADER #1(DATE.MM/DD)
     C* =====================
     C           *IN99     IFEQ *OFF
     C                     Z-ADD1         X       30
     C           'QTY PER 'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'qty per 'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'Qty Per 'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'Qty per 'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'qty Per 'SCAN DAT2      X              10
     C  N10                GOTO @@END
     C*
TCHK2C                     MOVEL*OFF      W@ERR
TCHK2C                     EXSR @SKP14
TCHK2C           W@ERR     IFEQ *ON
TCHK2C                     GOTO @@END
TCHK2C                     END
TCHK2C*
     C                     MOVEL*OFF      W@ERR   1
     C                     EXSR @DATE1
     C           W@ERR     IFEQ *OFF
     C                     MOVE *ON       *IN99
     C                     END
     C                     GOTO @@END
     C                     END
     C* =========
     C* HEADER #2(DATE.YY)
     C* =========
     C           *IN98     IFEQ *OFF
     C                     Z-ADD1         X       30
     C           'LAST CUM'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'last cum'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'Last Cum'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'Last cum'SCAN DAT2      X              10
     C  N10                Z-ADD1         X
     C  N10      'last Cum'SCAN DAT2      X              10
     C  N10                GOTO @@END
     C*
TCHK2C                     MOVEL*OFF      W@ERR
TCHK2C                     EXSR @SKP14
TCHK2C           W@ERR     IFEQ *ON
TCHK2C                     GOTO @@END
TCHK2C                     END
TCHK2C*
     C                     MOVEL*OFF      W@ERR
     C                     EXSR @DATE2
     C           W@ERR     IFEQ *OFF
     C                     MOVE *ON       *IN98
     C                     END
     C                     GOTO @@END
     C                     END
     C*
     C*=======
     C* DETAIL
     C*=======
     C                     Z-ADD1         X
     C           '-'       SCAN DAT2      X              10
     C  N10                GOTO @@END
     C*
     C                     Z-ADD1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C* -------------
     C*   PART NUMBER
     C* -------------
     C                     MOVEL*BLANK    APT
     C                     Z-ADDX         Y       30
     C                     Z-ADD*ZERO     Z       30
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFEQ '-'
     C           AY,Y      OREQ ' '
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      APT,Z
     C                     ENDDO
     C                     MOVEAAPT       #PART
     C* -------
     C* QTY/BOX
     C* -------
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @@END
     C*
     C                     MOVE *BLANKS   AQT
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ITER
     C                     END
     C                     ADD  1         Z
     C                     MOVELAY,Y      AQT,Z
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX
     C                     MOVE AWXXXX    AW5555  5
     C                     MOVELAW5555    AWSYOS
      * ---
      * QTY
      * ---
TCHK2C                     MOVEL*OFF      W@ERR
TCHK2C                     EXSR @SKP14
TCHK2C           W@ERR     IFEQ *ON
TCHK2C                     GOTO @@END
TCHK2C                     END
TCHK2C*
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C*
     C                     MOVE *BLANKS   AQT
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
     C                     Z-ADDX         Y
     C                     Z-ADD*ZERO     J       20
     C*
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C           AY,Y      IFEQ ','
     C           AY,Y      OREQ ' '
     C                     LEAVE
     C                     END
     C           AY,Y      IFLT '0'
     C           AY,Y      ORGT '9'
     C                     ITER
     C                     END
     C                     ADD  1         J
     C                     MOVELAY,Y      AQT,J
     C                     ENDDO
     C*
     C                     MOVEL*ALL'0'   SQT
     C                     EXSR #QTY
     C                     MOVEASQT       AWXXXX  9
     C                     MOVELAWXXXX    AWSRYO
     C*
     C                     ADD  1         Z
     C                     Z-ADDDTS,Z     AWSTRD
     C                     Z-ADDDTE,Z     AWENDD
     C*
     C* WRITE
     C*
     C                     WRITEABAWMXF1
     C                     MOVE '1'       PID
     C*
     C                     ENDDO
     C*-------------------------------------------------
     C*
     C*
     C           @@END     TAG
     C******************************************************
     C           @SKP14    BEGSR
     C******************************************************
     C*
     C                     Z-ADD*ZERO     X1      20
     C*
     C                     DO   *HIVAL
     C*
     C                     ADD  1         X1
     C           X1        IFGT 14
     C                     LEAVE
     C                     END
     C*
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                MOVEL*ON       W@ERR
     C  N10                LEAVE
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C           @DATE1    BEGSR
     C******************************************************
     C                     CLEARMMS
     C                     CLEARDDS
     C*
     C                     DO
     C*
TCHK2C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C           *IN10     IFEQ *OFF
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C*
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C* MMDD
     C           X         ADD  1         Y
     C                     MOVEAAY,Y      W@MNDD
     C           W@MNDD    IFEQ *BLANK
     C                     LEAVE
     C                     END
     C*
     C                     Z-ADD1         I       20
     C           W@MN      LOKUPMN1,I                    11
     C           *IN11     IFEQ *OFF
     C                     Z-ADD1         I
     C           W@MN      LOKUPMN2,I                    11
     C           *IN11     IFEQ *OFF
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C                     END
     C*
     C                     MOVEAW@DD      A21
     C           A21,1     IFLT '0'
     C           A21,1     ORGT '3'
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C           A21,2     IFLT '0'
     C           A21,2     ORGT '9'
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C*
     C                     ADD  1         Z
     C           Z         IFGT 20
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C                     Z-ADDI         MMS,Z
     C                     MOVELW@DD      DDS,Z
     C*
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C           @DATE2    BEGSR
     C******************************************************
     C                     CLEARDTS
     C                     CLEARDTE
     C*
     C                     DO
     C* YY
TCHK2C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C           *IN10     IFEQ *OFF
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C*
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   *HIVAL
     C*
     C           X         ADD  1         Y
     C                     MOVEAAY,Y      W@YY    2
     C           W@YY      IFEQ *BLANK
     C                     LEAVE
     C                     END
     C*
     C                     MOVEAW@YY      A21
     C           A21,1     IFLT '0'
     C           A21,1     ORGT '9'
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C           A21,2     IFLT '0'
     C           A21,2     ORGT '9'
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C*
     C                     ADD  1         Z
     C           Z         IFGT 20
     C                     MOVEL*ON       W@ERR
     C                     LEAVE
     C                     END
     C                     MOVELW@YY      W@YYNN  20
     C           W@YYNN    ADD  2000      YEAR
     C                     Z-ADDMMS,Z     MONTH
     C                     Z-ADDDDS,Z     DAY
     C                     Z-ADDYMD       DTS,Z
     C*
     C           KEY3      KLIST
     C                     KFLD           YEAR
     C                     KFLD           MONTH
     C                     KFLD           DAY
     C           KEY3      SETLLAGDPL121
     C                     READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C  N44                READ AGDPL121                 44
     C  N44                Z-ADDAWENDD    DTE,Z
     C*
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                LEAVE
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C           #QTY      BEGSR
     C******************************************************
     C                     Z-ADD9         S       20
     C                     Z-ADD9         F       20
     C                     DO   9
     C           AQT,S     IFGE '0'
     C           AQT,S     ANDLE'9'
     C                     MOVE AQT,S     SQT,F
     C           F         SUB  1         F
     C                     END
     C           S         SUB  1         S
     C                     ENDDO
      *
     C                     ENDSR
**
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
**
JanFebMarAprMayJunJulAugSepOctNovDec
