     H            Y.
     F** AB#ROTH *******************************************
     F*  OTHER CUSTOMAER FORECAST UPLOAD PROCESS           *
     F*                                                    *
     F* TCHK1 02/11/08 CREATE                              *
     F******************************************************
     FOTHCUST IP  F     600            DISK
     FAGDPL12 IF  E           K        DISK
     FABAWOTHFO   E                    DISK
      *--------------------------------------------------------
     E                    AY        800  1
     E                    A2          2  1
     E                    A2X         2  1
     E                    A4          4  1
     E                    A4X         4  1
     E                    A9          9  1
     E                    A9X         9  1
     E                    A15        15  1
     E                    A10        10  1
     E*
     E                    DT         12  8
      *--------------------------------------------------------
     IOTHCUST AA  01
     I                                        1   4 SEQN
     I                                        1  12 SEQ
     I                                       13 268 DAT1
     I                                      269 524 DAT2
     I                                      525 600 DAT3
     I            DS
     I                                        1   80W@SHDT
     I                                        1   40W@SHCY
     I                                        1   20W@SHCC
     I                                        3   40W@SHYY
     I                                        5   60W@SHMM
     I                                        7   80W@SHDD
     I            DS
     I                                        1   80K@SHDT
     I                                        1   40K@SHCY
     I                                        1   20K@SHCC
     I                                        3   40K@SHYY
     I                                        5   60K@SHMM
     I                                        7   80K@SHDD
     I            DS
     I                                        1   80F8KADT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1  15 AWMHIN
     I                                        1   5 AWMHN1
     I                                        6  10 AWMHN2
     I                                       11  15 AWMHN3
      *
     C                     Z-ADD1         X
     C                     MOVEADAT1      AY,X
     C                     ADD  256       X       50
     C                     MOVEADAT2      AY,X
     C                     ADD  256       X       50
     C                     MOVEADAT3      AY,X
      *
     C                     Z-ADD*ZERO     X       50
      *
      * HEADER
     C           *IN99     IFEQ *OFF
      *
     C                     MOVEL*BLANK    A4
     C                     MOVEA'0000'    A4X
     C                     Z-ADD*ZERO     Y       50
     C                     Z-ADD*ZERO     Z       50
      * TOKU
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A4,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD4         Y
     C                     Z-ADD4         Z
     C                     DO   *HIVAL
     C           A4,Y      IFNE *BLANK
     C                     MOVELA4,Y      A4X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA4X       W@TOKU  4
      *
     C                     MOVEL*BLANK    A4
     C                     MOVEA'0000'    A4X
     C                     Z-ADD*ZERO     Y       50
     C                     Z-ADD*ZERO     Z       50
      * NONY
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A4,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD4         Y
     C                     Z-ADD4         Z
     C                     DO   *HIVAL
     C           A4,Y      IFNE *BLANK
     C                     MOVELA4,Y      A4X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA4X       W@NONY  4
      *
     C                     MOVEL*BLANK    A4
     C                     MOVEL*BLANK    A4X
     C                     Z-ADD*ZERO     Y       50
     C                     Z-ADD*ZERO     Z       50
      * NUKE
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,X      IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVELAY,X      A4,Y
     C                     END
     C                     ENDDO
     C                     MOVEAA4        W@NUKE  4
      *
     C  N99                MOVE *ON       *IN99
     C                     GOTO @END
      *
     C                     END
      *
     C*
     C* DETAIL
     C                     Z-ADD*ZERO     Y       50
     C                     Z-ADD*ZERO     Z       50
     C*
     C* USER PART#
     C                     MOVEL*BLANK    A15
     C                     MOVEL*BLANK    AWMHIN
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C                     LEAVE
     C                     END
     C           AY,X      IFEQ '-'
     C                     ITER
     C                     END
     C                     ADD  1         Y
     C                     MOVELAY,X      A15,Y
     C                     ENDDO
     C                     MOVEAA15       AWMHIN
     C*
     C* SKIP WEEKLY SETTING#
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
     C*
     C* PO#
     C                     MOVEL*BLANK    A10
     C                     MOVEL*BLANK    AWORDN
     C                     Z-ADD*ZERO     Y
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C                     LEAVE
     C                     END
     C                     ADD  1         Y
     C                     MOVELAY,X      A10,Y
     C                     ENDDO
     C                     MOVEAA10       AWORDN
      *
     C* SHIP DATE
     C*  MONTH
     C                     Z-ADD*ZERO     Y
     C                     Z-ADD*ZERO     Z
     C                     MOVEL*BLANK    A2
     C                     MOVEL'00'      A2X
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C           AY,X      OREQ '/'
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A2,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD2         Y
     C                     Z-ADD2         Z
     C                     DO   *HIVAL
     C           A2,Y      IFNE *BLANK
     C                     MOVELA2,Y      A2X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA2X       W@A002  2
      *
     C                     MOVELW@A002    W@SHMM
     C*  DAY
     C                     Z-ADD*ZERO     Y
     C                     Z-ADD*ZERO     Z
     C                     MOVEL*BLANK    A2
     C                     MOVEL'00'      A2X
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C           AY,X      OREQ '/'
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A2,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD2         Y
     C                     Z-ADD2         Z
     C                     DO   *HIVAL
     C           A2,Y      IFNE *BLANK
     C                     MOVELA2,Y      A2X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA2X       W@A002  2
      *
     C                     MOVELW@A002    W@SHDD
     C*  YEAR
     C                     Z-ADD*ZERO     Y
     C                     Z-ADD*ZERO     Z
     C                     MOVEL*BLANK    A2
     C                     MOVEL'00'      A2X
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C           AY,X      OREQ '/'
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A2,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD2         Y
     C                     Z-ADD2         Z
     C                     DO   *HIVAL
     C           A2,Y      IFNE *BLANK
     C                     MOVELA2,Y      A2X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     MOVEAA2X       W@A002  2
      *
     C                     MOVELW@A002    W@SHYY
     C                     Z-ADD20        W@SHCC
     C*
     C* SKIP ORDER QTY
     C                     ADD  1         X
     C           ','       LOKUPAY,X                     10
     C  N10                GOTO @END
     C*
     C* FORECAST QTY(12 WEEK)
     C* SET DATE
     C                     Z-ADDW@SHDT    K@SHDT
     C                     Z-ADD*ZERO     I       20
     C                     MOVEL*BLANK    DT
     C           K@DT01    KLIST
     C                     KFLD           K@SHCY
     C                     KFLD           K@SHMM
     C                     KFLD           K@SHDD
     C           K@DT01    SETLLAGDPL12
     C                     DO   *HIVAL
     C                     READ AGDPL12                  91
     C           F8YOBI    IFEQ 1
     C                     ADD  1         I
     C           I         IFGT 12
     C                     LEAVE
     C                     END
     C                     MOVELF8KADT    DT,I
     C                     END
     C                     ENDDO
     C   91                GOTO @END
     C* FORECAST QTY
     C                     Z-ADD*ZERO     Y
     C                     Z-ADD*ZERO     Z
     C*
     C                     DO   12        I
     C*
     C                     MOVEL*ALL' '   A9
     C                     MOVEL*ALL'0'   A9X
     C*
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           AY,X      IFEQ ','
     C           AY,X      OREQ ' '
     C                     LEAVE
     C                     END
     C           AY,X      IFGE '0'
     C           AY,X      ANDLE'9'
     C                     ADD  1         Y
     C                     MOVELAY,X      A9,Y
     C                     END
     C                     ENDDO
     C                     Z-ADD9         Y
     C                     Z-ADD9         Z
     C                     DO   9
     C           A9,Y      IFNE *BLANK
     C                     MOVE A9,Y      A9X,Z
     C                     SUB  1         Z
     C                     END
     C                     SUB  1         Y
     C           Y         IFLE *ZERO
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVEAA9X       @9C     9
     C                     MOVE @9C       @9      90
     C                     Z-ADD@9        AWSRYO
     C*
     C                     MOVELDT,I      K@SHDT
     C           K@DT01    SETLLAGDPL12
     C                     DO   *HIVAL
     C                     READ AGDPL12                  91
     C           F8YOBI    IFEQ 5
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     MOVELDT,I      AWSTRD
     C                     MOVELF8KADT    AWENDD
      *
     C                     MOVELW@TOKU    AWTOKU
     C                     MOVELW@NONY    AWNONY
     C                     MOVEL'0'       AWNKOJ
     C                     MOVELW@NUKE    AWNUKE
     C                     MOVEL*BLANK    AWSBAN
     C                     Z-ADD*ZERO     AWSYOS
      *
     C                     WRITEABAWOHF1
     C                     MOVE '1'       PID
      *
     C                     ENDDO
     C*
      *
     C           @END      TAG
     C******************************************************
     C*  INITIAL                                           *
     C******************************************************
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PID     1
      *
     C                     ENDSR
