     H            Y.
     F** AA#R13 *********************************************
     F* SHORTAGE FOLLOW STATUS(OQ)
     F*   OSHIMA.           2021.04.04                      *
     F*******************************************************
     FAA#WP12 IF  E           K        DISK
     FABBPL75 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FAA#WP13 O   E                    DISK                      A
     E                    OKS        15  1               か種類
     E                    OTK        15  6               番地
     E                    OHB        15 12               工程品番
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  12 WKHBN
     I                                        1   5 WKOQH1
     I                                        6  10 WKOQH2
     I                                       11  12 WKOQH3
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * ENTRY                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           WTIME
      *
     C                     READ AA#WP12                  20
     C           *IN20     DOWEQ'0'
     C                     EXSR #SB400
     C           *IN29     IFEQ '1'
     C                     EXSR #SB410
     C***        P9PRE     IFGT 0
     C                     EXSR #SB500
     C***                  ENDIF
     C                     ENDIF
     C                     READ AA#WP12                  20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVELSDATE     INYMDB
     C                     MOVE '01'      INYMDB
     C                     MOVEL'1'       OPNCLS
     C                     MOVEA*BLANK    OKS
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           W2SHN1
     C                     PARM           W2SHN2
     C                     PARM           W2SHN3
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C                     CLEAROKS
     C                     CLEAROTK
     C                     CLEAROHB
     C                     MOVEAPSHR      OKS
     C                     MOVEAPTKR      OTK
     C                     MOVEAPHBN      OHB
      *
     C                     MOVEL*BLANK    WKTKR
     C                     MOVEL*BLANK    WKHBN
     C                     Z-ADD1         X       50
     C                     SETOF                     29
     C           'B'       LOKUPOKS,X                    29
     C           *IN29     IFEQ '1'
     C                     MOVELOTK,X     WKTKR
     C                     MOVELOHB,X     WKHBN
     C                     ENDIF
      *
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           W2SHN1  5
     C                     PARM           W2SHN2  5
     C                     PARM           W2SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     MOVELW2SHN1    PHSHN1
     C                     MOVELW2SHN2    PHSHN2
     C                     MOVELW2SHN3    PHSHN3
     C                     CALL 'ALOR28'
     C                     PARM           PHSHN1  5
     C                     PARM           PHSHN2  5
     C                     PARM           PHSHN3  2
     C                     PARM           P9ALD3  40       COMPLETE SHIP SCAN
     C                     PARM           P9ADA1  40       RE-ISSUED
     C                     PARM           P9NYKO  40       COMPLETE STORE IN
     C                     PARM           P9SRT   40       SRT(CONVEYANCE)
     C                     PARM           P9OUK   40       COMPLETE OUTSOURCE
     C                     PARM           P9BZK   40       COMPLETE BZ WEIGH
     C                     PARM           P9DSK   40       COMPLETE DS WEIGH
     C                     PARM           P9JCK   40       COMPLETE JC WEIGH
     C                     PARM           P9SBK   40       COMPLETE SB WEIGH
     C                     PARM           P9LOQK  40       COMPLETE LOQ
     C                     PARM           P9OUI   40       IN PROCESS (OUTSRC)
     C                     PARM           P9BZI   40       IN PROCESS (BZ)
     C                     PARM           P9DSI   40       IN PROCESS (DS)
     C                     PARM           P9JCI   40       IN PROCESS (JC)
     C                     PARM           P9SBI   40       IN PROCESS (SB)
     C                     PARM           P9LOQI  40       IN PROCESS (LOQ)
     C                     PARM           P9PLOU  40       BEFORE (OUTSOUR  )
     C                     PARM           P9PLBZ  40       BEFORE (BZ       )
     C                     PARM           P9PLDS  40       BEFORE (DS       )
     C                     PARM           P9PLJC  40       BEFORE (JC       )
     C                     PARM           P9PLSB  40       BEFORE (SB       )
     C                     PARM           P9PLLO  40       BEFORE (LOQ      )
     C                     PARM           P9PRE   40       AFTER  CV COLLECTION
     C                     PARM           P9CVS   40       BEFORE CV COLLECTION
     C                     PARM           P9LPLD  80        LAST PL DATE
     C                     PARM           P9LPLT  60        LAST PL TIME
     C                     PARM           P9ALL   40       ALL ISSUED
     C                     PARM           P9PLPD  80       PT BF OUT DATE
     C                     PARM           P9PLPS  40       PT SHIP PRELOAD
      *
     CSR         ESB410    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAA#WP131
     C                     MOVELW2SHN1    W3SHN1
     C                     MOVELW2SHN2    W3SHN2
     C                     MOVELW2SHN3    W3SHN3
     C                     Z-ADDW2INV     W3INV
     C                     Z-ADDW2DAYS    W3DAYS
     C                     Z-ADDW2UNS     W3UNS
     C                     Z-ADDW2QTY     W3QTY
     C                     Z-ADDW2TDYS    W3TDYS
     C                     MOVELW2GETP    W3GETP
     C                     Z-ADDW2PRE     W3PRE
     C                     MOVELWKTKR1    W3TKR1
     C                     MOVELWKTKR2    W3TKR2
     C                     MOVELWKTKR3    W3TKR3
     C                     MOVELWKTKR4    W3TKR4
     C                     MOVELWKOQH1    W3OQH1
     C                     MOVELWKOQH2    W3OQH2
     C                     MOVELWKOQH3    W3OQH3
      *
     C           KEYADH    KLIST
     C                     KFLD           WKTKR1
     C                     KFLD           WKTKR2
     C                     KFLD           WKTKR3
     C                     KFLD           WKTKR4
     C           KEYADH    SETLLADHPL03
     C           KEYADH    READEADHPL03                  18
     C           *IN18     DOWEQ'0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLESDATE
     C                     ELSE
     C           J6UKHZ    IFLE SDATE
     C           J6STHZ    ANDGTSDATE
     C                     MOVELJ6RONO    W3RONO
     C                     Z-ADDJ6HOJI    W3HOJI
     C                     Z-ADDJ6ONDO    W3ONDO
     C                     Z-ADDJ6CO2P    W3CO2P
     C                     Z-ADDJ6LOTO    W3LOTO
     C                     ENDIF
     C                     ENDIF
     C           KEYADH    READEADHPL03                  18
     C                     ENDDO
      *
     C                     MOVEL'0'       GET     1
     C           WKTKR     SETGTABBPL75
     C           WKTKR     REDPEABBPL75                  74
     C           *IN74     DOWEQ'0'
     C           GET       ANDEQ'0'
     C                     MOVEL'1'       GET
     C                     Z-ADDA7DATE    W3DATE
     C                     Z-ADDA7TIME    W3TIME
     C                     Z-ADDA7KQTY    W3KQTY
     C           WKTKR     REDPEABBPL75                  74
     C                     ENDDO
     C                     WRITEAA#WP131
      *
     CSR         ESB500    ENDSR
