     H            Y.
     F** AA#R12 *********************************************
     F* SHORTAGE FOLLOW STATUS(OQ)
     F*   OSHIMA.           2021.04.07                      *
     F*******************************************************
     FAA#WP11 IF  E           K        DISK
     FALCPL03 IF  E           K        DISK
     FALGPL11 IF  E           K        DISK
     FAA#WP12 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140ABSC
     I                                        1   40ABSCYY
     I                                        5   60ABSCMM
     I                                        7   80ABSCDD
     I                                        9  140ABSCTM
      *
     I            DS
     I                                        1   80ABSKHZ
     I                                        1   40ABSKYY
     I                                        5   60ABSKMM
     I                                        7   80ABSKDD
      *
     I            DS
     I                                        1  140A8SC
     I                                        1   80A8DATE
     I                                        9  140A8TIME
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * ENTRY                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           WTIME
      *
     C                     MOVELSDATE     PDATE
     C                     MOVEL'-'       PPORM
     C                     MOVEL'0002'    PDAYS
     C                     CALL 'DATR1A'
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C                     MOVE PRDAT     W@DATE  80
      *
     C                     READ AA#WP11                  20
     C           *IN20     DOWEQ'0'
     C                     EXSR #SB400
     C                     EXSR #SB500
     C                     READ AA#WP11                  20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * CV SCAN DATA                                       *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYALC    KLIST
     C                     KFLD           P7SHN1
     C                     KFLD           P7SHN2
     C                     KFLD           P7SHN3
     C                     MOVEL'0'       W@OUT   1
     C                     MOVEL'0'       GETF    1
     C                     Z-ADD0         WKPRE   50
     C           KEYALC    SETGTALCPL03
     C           KEYALC    REDPEALCPL03                  81
     C           *IN81     DOWEQ'0'
     C           A8DATE    ANDGEW@DATE
     C****       W@OUT     ANDEQ'0'
     C           A8SKJY    IFEQ 'D'
     C           A8SKDT    ANDLESDATE
     C                     ELSE
     C                     MOVELA8BRC2    B3      3
     C           B3        IFEQ 'L01'
     C                     EXSR #SB401
     C           GETF      IFEQ '0'
     C                     ADD  1         WKPRE
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C           KEYALC    REDPEALCPL03                  81
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * OQ LOAD                                            *
      *----------------------------------------------------*
     CSR         #SB401    BEGSR
      *
     C                     MOVEL'0'       GETF    1
     C           A8BRC4    SETLLALGPL11
     C           A8BRC4    READEALGPL11                  82
     C           *IN82     DOWEQ'0'
     C****       GETF      ANDEQ'0'
     C           ABSKJY    IFEQ 'D'
     C           ABSKHZ    ANDLESDATE
     C                     ELSE
     C           ABSC      IFGE A8SC
     C                     MOVEL'1'       GETF
     C****                 ADD  1         WKPRE
     C                     ENDIF
     C                     ENDIF
     C           A8BRC4    READEALGPL11                  82
     C                     ENDDO
      *
     C           GETF      IFEQ '0'
     C****                 EXSR #SB500
     C                     MOVEL'1'       W@OUT   1
     C                     ENDIF
      *
     CSR         ESB401    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAA#WP121
     C                     MOVELP7SHN1    W2SHN1
     C                     MOVELP7SHN2    W2SHN2
     C                     MOVELP7SHN3    W2SHN3
     C                     Z-ADDP7INV     W2INV
     C                     Z-ADDP7DAYS    W2DAYS
     C                     Z-ADDP7UNS     W2UNS
     C                     Z-ADDP7QTY     W2QTY
     C                     Z-ADDP7TDYS    W2TDYS
     C                     MOVELGETF      W2GETP
     C                     Z-ADDWKPRE     W2PRE
     C                     WRITEAA#WP121
      *
     CSR         ESB500    ENDSR
