     H            Y.                                    1
     H** AAAR80 *************************************************************
     H* THE NUMER OF LOCATIONS LIST                                         *
     H*                                                                     *
     H* N.HYOTO  2001.06.11                                                 *
     H*                                                                     *
     F*  *IN90=1(NOT READ FCEPP01)                                          *
     F*  *IN91=1(NOT READ MBDPL01)                                          *
     F*  *IN92=1(NOT READ GADPL11)                                          *
     F*  *IN93=1(NOT READ AGAPL31)                                          *
     F*  *IN94=1(NOT READ AAHTL01)                                          *
     F*  *IN95=1(NOT READ AAFTL01)                                          *
     F*  *IN96=1(NOT READ AB#PP90)                                          *
     F*  *IN97=1(NOT READ AAPTL01)                                          *
     H***********************************************************************
     FFCEPP01 IF  E                    DISK
     FMBDPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAAHTL01 IF  E           K        DISK
     FAAFTL01 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
     FAAAWP80 O   E           K        DISK
     I***********************************************************
     I* LAPSE DATE
     I            DS
     I                                        1   80L6STHZ
     I                                        1   40L6STYY
     I                                        5   60L6STMM
     I                                        7   80L6STDD
     I* LAPSE DATE
     I            DS
     I                                        1   80A3STHZ
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     C***********************************************************
     C* MBDPL01
     C           KEY1      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C* GADPL11
     C           KEY2      KLIST
     C                     KFLD           F3TOKU
     C                     KFLD           F3NONY
     C                     KFLD           F3NKOJ
     C                     KFLD           F3NUKE
     C***********************************************************
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C                     READ FCEPP011                 90
     C           *IN90     DOWEQ'0'
     C*
     C           A2GSKD    IFNE ' '
     C                     GOTO #READ
     C                     END
     C*
     C                     CLEARAAAWP801
     C                     MOVE A2BHB1    Z6SHN1           PART1
     C                     MOVE A2BHB2    Z6SHN2               2
     C                     MOVE A2BHB3    Z6SHN3               3
     C                     Z-ADDA2GEKN    Z6SETI           SETTING #
     C                     Z-ADDA2SSYS    Z6UNIT           QTY/CONT.
     C*
     C* GET NUMBER OF KANBAN
     C           KEY1      CHAINAGAPL31              93
     C           *IN93     IFEQ '1'
     C                     MOVE '1'       Z6ERR
     C*
     C                     ELSE
     C                     MOVE CBKDAI    Z6TYPE           KANBAN TYPE
     C                     END
     C*
     C           Z6TYPE    IFEQ 'E'
     C           KEY1      SETGTAAHTL011
     C           #READ2    TAG
     C           KEY1      REDPEAAHTL011                 94
     C*
     C           *IN94     IFEQ '0'
     C           L6STHZ    IFEQ 99999999
     C                     Z-ADDL6KALL    Z6KAN#
     C                     END
     C                     GOTO #READ2
     C                     END
     C*
     C                     END
     C*
     C*
     C           Z6TYPE    IFEQ 'C'
     C           KEY1      SETGTAAFTL011
     C           #READ3    TAG
     C           KEY1      REDPEAAFTL011                 95
     C           *IN95     IFEQ '0'
     C           A3STHZ    IFEQ 99999999
     C                     Z-ADDA3KALL    Z6KAN#
     C           Z6KAN#    DIV  40        WK#LOC  41
     C           WK#LOC    ADD  0.9       Z6#LOC
     C                     END
     C                     GOTO #READ3
     C                     END
     C                     END
     C*
     C*
     C           Z6TYPE    IFEQ ' '
     C           KEY1      SETGTAAPTL011
     C           #READ4    TAG
     C           KEY1      REDPEAAPTL011                 97
     C           *IN97     IFEQ '0'
     C           L5STHZ    IFEQ 99999999
     C                     Z-ADDL5KALL    Z6KAN#
     C           Z6KAN#    DIV  40        WK#LOC  41
     C           WK#LOC    ADD  0.9       Z6#LOC
     C                     END
     C                     GOTO #READ4
     C                     END
     C                     END
     C*
     C*
     C           KEY1      SETLLMBDPL01
     C           KEY1      READEMBDPL01                  91
     C           *IN91     DOWEQ'0'
     C*
     C* CHECK OUTGOING MASTER
     C           KEY2      CHAINGADPL111             92
     C           *IN92     IFEQ '1'
     C                     MOVE '2'       Z6ERR
     C                     WRITEAAAWP801
     C                     GOTO #READ
     C                     END
     C*
     C* CYCLE 1-1-1 : DAILY
     C           B5HIZK    IFEQ 1
     C           B5KAIS    ANDEQ1
     C           B5NBIN    ANDEQ1
     C                     ADD  1         Z6DAYL           DAILY CUSTOMER
     C                     GOTO #CYC
     C                     END
     C*
     C* CYCLE 5-1-1 : DAILY
     C           B5HIZK    IFEQ 5
     C           B5KAIS    ANDEQ1
     C           B5NBIN    ANDEQ1
     C                     ADD  1         Z6WEEK           WEEKLY CUSTOMER
     C                     GOTO #CYC
     C                     END
     C*
     C                     ADD  1         Z6OTHE           OTHERS
     C           #CYC      TAG
     C*
     C* CHECK 3 OF PALLETE,RETURNABLE OR CARTON BOX??
     C                     MOVE F3NONY    WKNONY  4
     C           WKNONY    CHAINAB#PL901             96
     C           *IN96     IFEQ '1'
     C                     MOVE '3'       Z6ERR
     C                     WRITEAAAWP801
     C                     GOTO #READ
     C                     END
     C*
     C           YAMXPL    IFEQ 120
     C                     ADD  1         Z6RETN
     C*
     C                     ELSE
     C                     ADD  1         Z6CART
     C                     END
     C*
     C                     ADD  F3TNSU    Z6ACTL           SHIPPED QTY.
     C*
     C*
     C                     ADD  F3TNSU    Z6QTY1           N  MON.QTY.
     C                     ADD  F3ANSU    Z6QTY2           N-1
     C                     ADD  F3BNSU    Z6QTY3           N-2
     C                     ADD  F3CNSU    Z6QTY4           N-3
     C                     ADD  F3DNSU    Z6QTY5           N-4
     C                     ADD  F3ENSU    Z6QTY6           N-5
     C*
     C           KEY1      READEMBDPL01                  91
     C                     END
     C*
     C                     WRITEAAAWP801
     C*
     C           #READ     TAG
     C                     READ FCEPP011                 90
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @END:
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
