     H            Y.
     F** AAAR31 *******************************
     F*  KANBAN TAG LIST                      *
     F*                                       *
     F*  TCH 2000.07.31                       *
     F* 2021.01.20 DCS. T.MITSUI
     F*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     F******************************* AAAR31 **
     FAAAWP30 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IAAAWP301    01
     I                                              Z6LOC1L1
     I* QTY. / CONTAINER
     I            DS
     I                                        1   5 Z6SYOS
     I                                        1   50W6SYOS
     I* P/LOT
     I            DS
     I                                        1   3 Z6PLOT
     I                                        1   30W6PLOT
     I* # OF KANBAN
     I            DS
     I                                        1   5 Z6#KAN
     I                                        1   50W6#KAN
     I* TOTAL PIECE QTY.
     I            DS
     I                                        1  12 Z6TQT1
     I                                        1  120W6TQT1
     I* TOTAL CONTAINER QTY.
     I            DS
     I                                        1  12 Z6TQT2
     I                                        1  120W6TQT2
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSR   10
      *
     C                     SETOF                     50
      *
     C           *IN51     IFEQ '0'
     C                     SETON                     5051
     C                     TIME           WTIME   60
     C                     END
      *
     C                     ADD  W6#KAN    T#KAN   60
     C                     ADD  W6TQT1    TTQT1  150
     C                     ADD  W6TQT2    TTQT2  150
     C                     ADD  W6#KAN    L#KAN   60
     C                     ADD  W6TQT1    LTQT1  150
     C                     ADD  W6TQT2    LTQT2  150
      *
     O*****************************************************************
     OQPRINT  H  102   50
     O       OR        OF
     O       OR        L1
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O       OR        L1
     O                                  131 '.         .         .'
     O        H  1     50
     O       OR        OF
     O       OR        L1
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  111 '.'
     O                         PUSR     121
     O                                  131 '.         .'
     O        H  2     50
     O       OR        OF
     O       OR        L1
     O                                    8 'AAAR31'
     O                                   53 '** KANBAN TAG LIST FOR'
     O                                   75 'WIP & FG INVENTORY **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O       OR        L1
     O                                   10 'LOCATION'
     O                                   26 'PART NUMBER'
     O                                   40 'PROCESS'
     O                                   49 'MACHINE'
     O                                   69 'QTY. PER CONTAINER'
     O                                   76 'P/LOT'
     O                                   90 'NO.OF KANBAN'
     O                                  111 'TOTAL PIECE QTY.'
     O                                  131 'TOTAL CONT. QTY.'
     O        D  1     01
     O                         Z6LOC1     3
     O                                    4 '-'
     O                         Z6LOC2     6
     O                                    7 '-'
     O                         Z6LOC3     9
     O                                   10 '-'
     O                         Z6LOC4    11
     O*
     O                         Z6PAR1    20
     O                                   21 '-'
     O                         Z6PAR2    26
     O                                   27 '-'
     O                         Z6PAR3    29
     O*
     O                         Z6PRC1    36
     O                         Z6PRC2    45
     O*
     O                         W6SYOSJ   70
     O                         W6PLOTJ   77
     O                         W6#KANJ   91
     O                         W6TQT1J  111
     O                         W6TQT2J  131
     O************************************************************
     O        T  2     L1
     O                                   81 'TOTAL'
     O                         T#KAN JB  91
     O                         TTQT1 JB 111
     O                         TTQT2 JB 131
     O************************************************************
     O        T  2     LR
     O                                   81 'GRAND TOTAL'
     O                         L#KAN J   91
     O                         LTQT1 J  111
     O                         LTQT2 J  131
