     H            Y.                                    1
     H** AAAR02 ****************************
     H* CREATE OF CONDITION M/F LIST
     H* A:N.HAYAKAWA            86.08.30   *
     H**************************************
     FAAAPL01 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C                     SETOF                     0102
     C  N03                TIME           WTIME   60
     C  N03                SETON                     0203
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    IFLE *DATE
     C                     GOTO STEP99
     C                     END
     C                     END
     C                     SETON                     01
     C           STEP99    TAG
     OQPRINT  H  102   02
     O       OR        OF
     O                                   10 '//4//'
     O                                  131 '+-------------------+'
     O        H  1     02
     O       OR        OF
     O                                    7 'APICS'
     O                                  131 '|         |         |'
     O        H  1     02
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '|         |         |'
     O        H  2     02
     O       OR        OF
     O                                   12 'AAAR02-1 '
     O                                   66 '**  CONDITION M/F LIST'
     O                                   70 '**'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        H  2     02
     O       OR        OF
     O                                   30 'COND.CODE'
     O                                   44 'KANBAN KIND'
     O*                                  68 'COND.NAME(FULL NAME)'
     O*                                  98 'COND.NAME(PRINT KANBAN)'
     O*                                 119 'COND.NAME(KANA)'
     O                                   57 'COND.NAME'
     O        D  1     01
     O                         A5JOKN    26
     O                         A5KANB    39
     O*                        A5JOK1    68
     O*                        A5JOK2    91
     O*                        A5JOKM   124
     O                         A5JOKM    68
