     H            Y.                                    1
     F** AABR02 ************************
     F* CREATE SETTING M/F LIST
     F* A:N.HAYAKAWA         86.08.30  *
     F**********************************
     FAABPL01 IP  E           K        DISK
     FQPRINT  O   F      80     OF     PRINTER
     C                     SETOF                     0102
     C  N03                TIME           WTIME   60
     C  N03                SETON                     0203
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    IFLE *DATE
     C                     GOTO STEP99
     C                     END
     C                     END
     C                     SETON                     01
     C           STEP99    TAG
     OQPRINT  H  102   02
     O       OR        OF
     O                                   80 '+---------+'
     O        H  1     02
     O       OR        OF
     O                                    7 'APICS'
     O                                   58 'TIME'
     O                         WTIME Y   67
     O                                   80 '|         |'
     O        H  1     02
     O       OR        OF
     O                                   12 'AABR02-1 '
     O                                   58 'DATE'
     O                         UDATE Y   67
     O                                   80 '|         |'
     O        H  2     02
     O       OR        OF
     O                                   47 '**  SETTING M/F LIST  **'
     O                                   63 'PAGE'
     O                         PAGE  Z   67
     O                                   80 '+---------+'
     O        H  2     02
     O       OR        OF
     O                                   26 'SETTING CODE'
     O*                                  48 'SETTING NAME(KANJI)'
     O*                                  70 'SETTING NAME(KANA)'
     O                                   45 'SETTING NAME'
     O        D  1     01
     O                         A4SETI    21
     O*                        A4SETK    51
     O*                        A4SETN    67
     O                         A4SETN    48
