     H            Y.
     A** AADR33 *****************************
     A*   機番別品種切替設定リスト<RPG/1> *
     A*                 K.YASUDA  94.04.29  *
     A***************************** AADR33 **
     FAADPW35 CF  E                    WORKSTN
     FFCETL03 IF  E           K        DISK
     FMFAPL32 IF  E           K        DISK
     FAADWP3A O   F      20            DISK
     E                    ER      1  16 60
     I            DS
     I                                        1   60@HIZ
     I                                        1   40@NEN
     I                                        5   60@TKI
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
      *---------*
      * ﾌﾟ[xｰjｰ *
      *---------*
     C           *ENTRY    PLIST
     C                     PARM           @PRT
     C                     PARM           @LST
     C                     PARM           @OUT
      *
     C           K#MFA     KLIST
     C                     KFLD           @KOJ
     C                     KFLD           @KOT
      *-------------*
      * ﾎｧｰﾓnﾞ hﾒaｰ *
      *-------------*
     C                     Z-ADD0         @KOJ
     C                     Z-ADD0         @HIZ
     C                     MOVE *BLANK    @PRT
     C                     MOVE *BLANK    @LST
     C                     MOVE *BLANK    @OUT
     C           STEP1     TAG
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @KOT
      *--------*
      *１画面*
      *--------*
     C           STEP2     TAG
     C                     EXFMTAADPW301
     C                     SETOF                     010203
     C                     SETOF                     040599
     C                     SETOF                     78
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *--------------*
      *画面チェック*
      *--------------*
      *工場
     C           @KOJ      IFEQ 0
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           @KOJ      IFNE 0111
     C                     SETON                     0199
     C                     MOVELER,2      MSG
     C                     GOTO STEP2
     C                     END
      *機番
     C****       @KBN      IFEQ *BLANK
     C***                  SETON                     027899
     C*****                MOVELER,3      MSG
     C*****                GOTO STEP2
     C***                  END
      *
      *工程
     C           @KOT      IFNE *BLANK
     C                     SETOF                     10
     C           @KOT      CHAINFCETL031             10
     C           *IN10     IFEQ '1'
     C                     SETON                     0399
     C                     MOVELER,4      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           A6GSKD    IFEQ 'D'
     C           A6GSHZ    IFLE *DATE
     C                     SETON                     0399
     C                     MOVELER,11     MSG
     C                     GOTO STEP2
     C                     END
     C                     END
     C                     END
     C                     END
      *実績年月
     C           @HIZ      IFEQ 0
     C                     SETON                     0499
     C                     MOVELER,5      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           @TKI      IFEQ 0
     C           @NEN      IFNE 0
     C                     SETON                     0499
     C                     MOVELER,6      MSG
     C                     GOTO STEP2
     C                     END
     C                     END
      *実績年
    !C           @NEN      IFGT 50
    !C                     Z-ADD1900      W@NEN4  40
    !C                     ELSE
    !C                     Z-ADD2000      W@NEN4  40
    !C                     ENDIF
    !C                     ADD  @NEN      W@NEN4  40
    !C*          @NEN      IFLT 93
    !C           W@NEN4    IFLT 1993
     C                     SETON                     0499
     C                     MOVELER,7      MSG
     C                     GOTO STEP2
     C                     END
      *実績月
     C           @TKI      IFLT 01
     C           @TKI      ORGT 12
     C                     SETON                     0499
     C                     MOVELER,8      MSG
     C                     GOTO STEP2
     C                     END
      *印刷順
     C           @PRT      IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVELER,9      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           @PRT      IFNE '1'
     C           @PRT      ANDNE'2'
     C                     SETON                     0599
     C                     MOVELER,10     MSG
     C                     GOTO STEP2
     C                     END
      *リストの種類
     C           @LST      IFEQ *BLANK
     C                     SETON                     0699
     C                     MOVELER,12     MSG
     C                     GOTO STEP2
     C                     END
      *
     C           @LST      IFNE 'A'
     C           @LST      ANDNE'B'
     C                     SETON                     0699
     C                     MOVELER,13     MSG
     C                     GOTO STEP2
     C                     END
      *
     C****       @LST      IFEQ 'A'
     C*          @KOT      IFEQ *BLANK
     C*                    SETON                     0399
     C*                    MOVELER,14     MSG
     C*                    GOTO STEP2
     C*                    END
     C*******              END
      *リストの用途
     C           @OUT      IFEQ *BLANK
     C                     SETON                     0799
     C                     MOVELER,15     MSG
     C                     GOTO STEP2
     C                     END
      *
     C           @OUT      IFNE 'A'
     C           @OUT      ANDNE'B'
     C                     SETON                     0799
     C                     MOVELER,16     MSG
     C                     GOTO STEP2
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STEP2
     C                     END
     C                     SETON                     7778
     C                     Z-ADD0         #HIZ    60
     C                     MOVEL@HIZ      #HIZ
      *------*
      *条件*
      *------*
     C           @KOT      IFNE *BLANK
     C           @KBN      ANDNE*BLANK
     C                     EXCPTDT
     C                     ELSE
     C                     EXSR #WRT
     C                     ENDIF
      *
     C                     SETON                     U5
     C                     GOTO STEP1
      *-----------------------------------------------------
     C           #WRT      BEGSR
      *
     C           @KOT      IFEQ *BLANK
     C           @KOJ      SETLLMFAPL32
     C                     ELSE
     C           K#MFA     SETLLMFAPL32
     C                     ENDIF
      *
     C           *IN80     DOUEQ*ON
     C           @KOT      IFEQ *BLANK
     C           @KOJ      READEMFAPL32                  80
     C                     ELSE
     C           K#MFA     READEMFAPL32                  80
     C                     ENDIF
      *
     C           *IN80     IFEQ *OFF
     C           @KBN      IFNE *BLANK
     C           M@KBN1    ANDNE@KBN
     C                     ITER
     C                     ENDIF
     C                     EXCPTDT1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
      *-----------*
      *条件用WF *
      *-----------*
     OAADWP3A E                DT
     O                         @KOJ       4
     O                         @KBN       7
     O                         @KOT      10
     O                         #HIZ      16
     OAADWP3A E                DT1
     O                         @KOJ       4
     O                         M@KBN1     7
     O                         M@KOTE    10
     O                         #HIZ      16
** MSG
E-01 ENTER FACTORY CODE
E-02 ENTER FACTOR CODE CORRECTLY
E-03 ENTER MACHINE NO.
E-04 THE ENTERED PROCESS IS NOT REGISTERED
E-05 ENTER THE YEAR AND THE MONTH FOR THE RESULT
E-06 ENTER THE YEAR AND THE MONTH FOR THE RESULT CORRECTLY
E-07 ENTER THE YEAR FOR THE RESULT AFTER 1993
E-08 ENTER THE MONTH FOR THE RESULT CORRECTLY 1-12
E-09 ENTER THE NO. IN ORDER OF PRINT
E-10 THE AVAILABLE NO. IN ORDER OF PRINT IS 1 OR 2
E-11 THE ENTERED PROCESS HAS BEEN DELETED ALREADY
E-12 ENTER THE TYPE OF LISTS A OR B
E-13 ENTER THE TYPE OF LISTS CORRECTLY A OR B
E-14 ENTER THE PROCESS WHEN THE TYPE OF LISTS IS A
E-15 ENTER THE USE OF LISTS A OR B
E-16 ENTER THE USE OF LISTS CORRECTLY A OR B
