     H            Y.
     A** AADR32 *****************************
     A*   機番別品種切替設定リスト<RPG/4> *
     A*                 K.YASUDA  94.08.26  *
     A***************************** AADR32 **
     FAADWP31 IP  F     256            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E                    PT1     1   2  1   PT2    22
     E                    TITLE   1   1 56
     E                    KOT         5  3
     E                    LOT         5  4 1
     IAADWP31 AA  01
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I                                       13  210KTSU
     I                                       22  300JISK
     I                                       31  370SYUY
     I                                       38  400LOTK
     I                                       41  430KJNK
     I                                       44  460KMAX
     I                                       47  49 AKT1
     I                                       50  52 AKT2
     I                                       53  55 AKT3
     I                                       56  58 AKT4
     I                                       59  61 AKT5
     I                                       62  62 TKR1
     I                                       63  64 TKR2
     I                                       65  66 TKR3
     I                                       67  67 TKR4
     I                                       68  70 KOT1
     I                                       71  73 KOT2
     I                                       74  76 KOT3
     I                                       77  79 KOT4
     I                                       80  82 KOT5
     I                                       83  861LOT1
     I                                       87  901LOT2
     I                                       91  941LOT3
     I                                       95  981LOT4
     I                                       99 1021LOT5
     I                                      103 1082LTIM
     I                                      109 1120@COD  L1
     I                                      113 115 @KBN  L1
     I                                      116 118 @KOT  L1
     I                                      119 1240@HIZ
     I                                      125 126 JOK1
     I                                      127 128 JOK2
     I                                      129 130 JOK3
     I                                      131 133 AKT6
     I                                      134 136 AKT7
     I                                      137 139 AKT8
     I                                      140 142 AKT9
     I                                      143 145 AKTA
     I                                      146 148 AKTB
     I                                      149 151 AKTC
     I                                      152 154 AKTD
     I                                      155 157 AKTE
     I                                      158 160 AKTF
     I                                      161 163 KBN6
     I                                      164 166 KBN7
     I                                      167 169 KBN8
     I                                      170 172 KBN9
     I                                      173 175 KBNA
     I                                      176 178 KBNB
     I                                      179 181 KBNC
     I                                      182 184 KBND
     I                                      185 187 KBNE
     I                                      188 190 KBNF
     I                                      191 191 $$KBN
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  15 KOT
     I                                        1   3 @KOT1
     I                                        4   6 @KOT2
     I                                        7   9 @KOT3
     I                                       10  12 @KOT4
     I                                       13  15 @KOT5
     I            DS
     I                                        1  20 LOT
     I                                        1   41@LOT1
     I                                        5   81@LOT2
     I                                        9  121@LOT3
     I                                       13  161@LOT4
     I                                       17  201@LOT5
     I            DS
     I                                        1   60#HIZ
     I                                        1   40YEAR
     I                                        5   60MTH
      *
     C           *ENTRY    PLIST
     C                     PARM           @PRT    1
      *
     C           *INL1     IFEQ '1'
     C                     SETOF                     0520
     C           @KOT      IFNE *BLANK
     C                     SETON                     20
     C                     END
     C                     TIME           WTIME   60
     C                     Z-ADD*YEAR     YEAR
     C                     Z-ADDUMONTH    MTH
     C           @COD      CHAINFGBPL011             05
     C           *IN05     IFEQ '0'
     C                     MOVE *BLANK    KJME   16
     C                     MOVELB2SMEI    KJME
     C                     END
     C                     Z-ADD1         A       20
     C                     SETOF                     10
     C           @PRT      LOKUPPT1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVELPT2,A     #PRT   22
     C                     END
     C                     EXCPTMDS
     C                     Z-ADD0         SET    100
     C                     Z-ADD0         KENS    40
     C                     Z-ADD0         JIS    100
     C                     Z-ADD0         #T2     62
     C                     END
      *
     C                     SETOF                     66
     C           HIN3      IFEQ *BLANK
     C                     SETON                     66
     C                     END
      *
     C                     MOVE *BLANK    TCOD    2
     C                     MOVELKOT1      @KOT1
     C                     MOVELKOT2      @KOT2
     C                     MOVELKOT3      @KOT3
     C                     MOVELKOT4      @KOT4
     C                     MOVELKOT5      @KOT5
     C                     MOVELLOT1      @LOT1
     C                     MOVELLOT2      @LOT2
     C                     MOVELLOT3      @LOT3
     C                     MOVELLOT4      @LOT4
     C                     MOVELLOT5      @LOT5
     C                     SETOF                     707172
     C                     SETOF                     7374
     C                     Z-ADD70        T       20
     C                     DO   5         S       20
     C           KOT,S     IFEQ *BLANK
     C           LOT,S     ANDEQ0
     C                     MOVE '1'       *IN,T
     C                     ENDIF
     C                     ADD  1         T
     C                     ENDDO
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTMDS
     C                     END
      *
     C           *IN01     IFEQ '1'
     C                     ADD  1         KENS
     C                     Z-ADD0         #T1     62
     C                     Z-ADD0         H1      80
     C           LTIM      IFNE 0
     C           1         DIV  LTIM      #T1
     C           SYUY      MULT #T1       H1
     C                     END
     C                     ADD  H1        HEKN
     C                     ADD  #T1       #T2
     C                     ADD  JISK      JIS
     C                     ADD  KTSU      SET
     C                     END
      *------------*
      * TCﾃｰnﾞ CHK *
      *------------*
     C           JOK1      IFEQ 'TC'
     C           JOK2      OREQ 'TC'
     C                     MOVEL'TC'      TCOD
     C                     END
      *
     C                     EXCPTDAT1
     C           $$KBN     IFEQ '*'
     C                     EXCPTDAT3
     C                     EXCPTDAT4
     C                     END
      *
     CL1                   Z-ADD#T2       TENS
     CL1         TENS      IFNE 0
     CL1         HEKN      DIV  TENS      HKIN
     CL1                   END
     CL1                   EXCPTDAT2
     CL1                   Z-ADD0         TENS    51
     CL1                   Z-ADD0         HKIN    50
     CL1                   Z-ADD0         HEKN    70
     OQPRINT  E  102           MDS
     O                                  191 '+---------------------+'
     O        E  1             MDS
     O                         #PRT      22
     O                                  147 'PGM - AADR32'
     O                                  191 '|          |          |'
     O        E  1             MDS
     O                                   12 'MACHINE NO.'
     O                         @KBN      16
     O                 20                24 'PROCESS'
     O                 20      @KOT      28
     O                                  139 'TIME'
     O                         WTIME    148 '  :  :  '
     O                                  191 '|          |          |'
     O        E  2             MDS
     O                                    8 'FACTORY'
     O                         @COD      15
     O                                   17 '-'
     O                         KJME      33
     O                         TITLE    128
     O                                  139 'DATE'
     O                         UDATE Y  148
     O                                  157 'PAGE'
     O                         PAGE  Z  161
     O                                  191 '+---------------------+'
     O        E  1             MDS
     O                         #HIZ      28 '    .  '
     O                         @HIZ      44 '    .  '
     O                                  126 '*- - - - - - - '
     O                                  140 'KANBAN'
     O                                  155 'INFORMATIO'
     O                                  185 ' - - - - - - -*'
     O        E  1             MDS
     O                                   13 'INT CO P/N'
     O                                   33 'THIS MONTH'
     O                                   45 'RESULT'
     O                                   59 'QUANTITY'
     O                                   65 'LOT'
     O                                   72 'STAND.'
     O                                   78 'ISSUE'
     O                                   88 'PROCESS'
     O                                  109 'TCCODE'
     O                                  120 'LOCATION'
     O                                  135 'FOLLOWING LOT'
     O                                  196 'L/T'
      *
     O        E  1             MDS
     O                                   80 '1'
     O                                   85 '2'
     O                                   90 '3'
     O                                   95 '4'
     O                                  100 '5'
     O                                  123 '1'
     O                                  136 '2'
     O                                  149 '3'
     O                                  162 '4'
     O                                  175 '5'
      *
     O        E  1             DAT1
     O                         HIN1       8
     O                                    9 '-'
     O                         HIN2      14
     O                N66                15 '-'
     O                         HIN3      17
     O                         KTSU      32 ' ,   ,   , 0 '
     O                         JISK      48 ' ,   ,   , 0 '
     O                         SYUY      60 ' ,   , 0 '
     O                         LOTK      65 ' 0 '
     O                         KJNK      70 ' 0 '
     O                         KMAX  N   76
     O                         AKT1      82
     O                         AKT2      87
     O                         AKT3      92
     O                         AKT4      97
     O                         AKT5     102
     O                         TCOD     107
     O                         TKR1     112
     O                                  113 '-'
     O                         TKR2     115
     O                                  116 '-'
     O                         TKR3     118
     O                                  119 '-'
     O                         TKR4     120
     O                         KOT1     125
     O                N70               127 '-'
     O                N70      LOT1     133 ' 0 . '
     O                         KOT2     138
     O                N71               140 '-'
     O                N71      LOT2     146 ' 0 . '
     O                         KOT3     151
     O                N72               153 '-'
     O                N72      LOT3     159 ' 0 . '
     O                         KOT4     164
     O                N73               166 '-'
     O                N73      LOT4     172 ' 0 . '
     O                         KOT5     177
     O                N74               179 '-'
     O                N74      LOT5     185 ' 0 . '
     O                         LTIM     195 '  0 .  '
      *
     O        E  1             DAT3
     O                         AKT6      82
     O                         AKT7      87
     O                         AKT8      92
     O                         AKT9      97
     O                         AKTA     102
      *
     O        E  1             DAT4
     O                         AKTB      82
     O                         AKTC      87
     O                         AKTD      92
     O                         AKTE      97
     O                         AKTF     102
      *
     O        E 1              DAT2
     O                                   17 'MACHINE NO. TOTAL'
     O                         SET       32 ' ,   ,   , 0 '
     O                         JIS       48 ' ,   ,   , 0 '
     O                                   92 'PART TYPE ALLOCATED'
     O                         KENS      98 '  0 '
     O                                  137 'AVERAGE QUANTITY'
     O                         HKIN     144 '  , 0 '
     O                                  185 'NO. OF CHANGE OVER'
     O                         TENS     194 '  0 . '
** PT1/PT2
1IN PART NO ORDER
2IN ACTUAL RESULT ORDER
** TITLE
* EACH MACHINE NO. PRODUCTS CHANGE OVER SETTING LIST B *
