     H            Y.
     A** AADR30 ********************************************
     A*   機番別品種切替設定リスト<RPG/2>                *
     A*                 K.YASUDA  94.04.29                 *
     A* TCHK1 06/26/09 CONVERT ASJ SOURCE                  *
     A******************************************** AADR30 **
     FAADWP3A IP  F      20            DISK
     FABHTL01 IF  E           K        DISK
     FGHCPL22 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
      *- - - - -各種かんばんマスター- - -*
     FAAFPL03 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAEAPL03 IF  E           K        DISK
     FAAXPL10 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FAAYPL03 IF  E           K        DISK
     FAAOPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
      *- - - - - - - - - - - - - - - - - - *
     FAADWP30 O   F     256            DISK
     E                    AK          5  3
     E                    SR         12  9 0
     E                    KB1         5  3
     E                    KT         15  3
     E                    BM         15  4 0
     E                    HB         15 12
     E                    KB         15  3
     E                    TK         15  6
     E                    KNB        15  1
     E                    KKT         5  3
     E                    LLT         5  4 1
     E                    #KOT    1   6  3
     E                    RL1     1   4  3
     E                    LAN1    1   2  3
TCHK1E                    #KOT2   1  11  3
     IAADWP3A AA  01
     I                                        1   40@KOJ
     I                                        5   7 @KBN
     I                                        8  10 @KOT
     I                                       11  160@HIZ  L1
     I                                       11  140@NEN
     I                                       15  160@TKI
     I            DS
     I                                        1   80M6SKHZ
     I                                        1   40M6SKYY
     I                                        5   60M6SKMM
     I                                        7   80M6SKDD
     I            DS
     I                                        1   80M6STHZ
     I                                        1   40M6STYY
     I                                        5   60M6STMM
     I                                        7   80M6STDD
     I            DS
     I                                        1   80A6GSHZ
     I                                        1   40A6GSYY
     I                                        5   60A6GSMM
     I                                        7   80A6GSDD
     I            DS
     I                                        1  15 AK
     I                                        1   3 M6AKT1
     I                                        4   6 M6AKT2
     I                                        7   9 M6AKT3
     I                                       10  12 M6AKT4
     I                                       13  15 M6AKT5
     I            DS
     I                                        1 1080SR
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  15 KB1
     I                                        1   3 M6KBN1
     I                                        4   6 M6KBN2
     I                                        7   9 M6KBN3
     I                                       10  12 M6KBN4
     I                                       13  15 M6KBN5
     I            DS
     I                                        1  12 HBN
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I            DS
     I                                        1   6 TKR
     I                                        1   1 TKR1
     I                                        2   3 TKR2
     I                                        4   5 TKR3
     I                                        6   6 TKR4
     I            DS
     I                                        1  15 KKT
     I                                        1   3 KOT1
     I                                        4   6 KOT2
     I                                        7   9 KOT3
     I                                       10  12 KOT4
     I                                       13  15 KOT5
     I            DS
     I                                        1  20 LLT
     I                                        1   41LOT1
     I                                        5   81LOT2
     I                                        9  121LOT3
     I                                       13  161LOT4
     I                                       17  201LOT5
     I            DS
     I                                        1   6 TTT
     I                                        1   1 TOKO1
     I                                        2   3 TOKO2
     I                                        4   5 TOKO3
     I                                        6   6 TOKO4
     I            DS
     I                                        1   6 BAN
     I                                        1   1 M6JBN1
     I                                        2   3 M6JBN2
     I                                        4   5 M6JBN3
     I                                        6   6 M6JBN4
     I            DS
     I                                        1  45 KT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600BM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 180 HB
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  45 KB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 TK
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 KNB
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
   #@I*
   #@I            DS
   #@I                                        1  15 #@YFC
   #@I                                        1  15 ##@
      *--------*
      * ﾌﾟ[xｰj *
      *--------*
     C           *ENTRY    PLIST
     C                     PARM           @LST    1
      *----------------*
      *キーフィールド*
      *----------------*
     C           KEY1      KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C                     KFLD           KOT     3
     C                     KFLD           BMN     40
     C                     KFLD           TKR1
     C                     KFLD           TKR2
     C                     KFLD           TKR3
     C                     KFLD           TKR4
      *
     C           KEY2      KLIST
     C                     KFLD           @JNEN   40
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEY3      KLIST
     C                     KFLD           #NEN    40
     C                     KFLD           #TKI    20
      *
     C           KEY4      KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
      *
     C           KEY5      KLIST
     C                     KFLD           TOKO1
     C                     KFLD           TOKO2
     C                     KFLD           TOKO3
     C                     KFLD           TOKO4
      *
     C           KEY6      KLIST
     C                     KFLD           CKHIN1
     C                     KFLD           CKHIN2
     C                     KFLD           CKHIN3
      *--------------*
      *青山稼働日数*
      *--------------*
     C                     EXSR CLS
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         @KAD    31
     C                     Z-ADD@NEN      #NEN
     C                     Z-ADD@TKI      #TKI
     C           KEY3      SETLLAGDPL121
     C                     DO   *HIVAL
     C           KEY3      READEAGDPL12                  30
     C           *IN30     IFEQ '0'
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @KAD
     C                     ENDIF
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ'*'
     C                     ADD  .5        @KAD
     C                     ENDIF
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  .5        @KAD
     C                     ENDIF
     C                     ENDIF
     C  N30                ENDDO
     C                     END
      *------------*
      *データ検索*
      *------------*
      *-工程機番-*
     C           @LST      IFEQ 'A'
     C           *LOVAL    SETLLABHTL01
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     READ ABHTL01                  15
     C           *IN15     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDEQ*DATE
     C                     ELSE
     C           M6STHZ    IFEQ 99999999
     C                     Z-ADD0         KTSU    90
     C           M6KSSU    DIV  20        KTSU
     C                     Z-ADD0         JISEKI 100
     C                     Z-ADD0         JISSE  100
     C                     Z-ADD0         #LTIME  62
      *
     C                     Z-ADD1         Z       20
     C                     SETOF                     3077
     C           KEY4      CHAINAAMPL111             30
     C           *IN30     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDEQ*DATE
     C                     ELSE
     C                     SETOF                     45
     C           BAN       LOKUPTK,Z                     45
      *
     C           *IN45     IFEQ '1'
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
TCHK1C           @KOT      IFEQ *BLANK
TCHK1C           KT,Z      LOKUP#KOT2                    23
TCHK1C           *IN23     IFEQ '0'
TCHK1C                     EXSR DDT
TCHK1C                     GOTO DDT2
TCHK1C                     END
TCHK1 ***
TCHK1C                     ELSE
     C                     SETOF                     20
     C           @KOT      LOKUP#KOT                     20
     C           *IN20     IFEQ '1'
     C                     SETOF                     21
     C           KT,Z      LOKUPRL1                      21
     C           *IN21     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     ELSE
     C                     SETOF                     22
     C           KT,Z      LOKUPLAN1                     22
     C           *IN22     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     END
     C                     END
     C                     ELSE
     C           KT,Z      IFEQ @KOT
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     END
     C                     END
TCHK1C                     END
     C                     END
      *
     C*          Z         IFEQ 1
     C*                    GOTO END1
     C*                    END
      *
     C           Z         IFGT 1
     C           Z         SUB  1         X       20
     C                     Z-ADD1         Y       20
      *
     C                     DO   X         Y
     C                     SUB  1         Z
     C           TK,Z      IFNE '------'
     C           TK,Z      ANDNE'++++++'
     C                     GOTO END1
     C                     ELSE
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
TCHK1C           @KOT      IFEQ *BLANK
TCHK1C           KT,Z      LOKUP#KOT2                    23
TCHK1C           *IN23     IFEQ '0'
TCHK1C                     EXSR DDT
TCHK1C                     GOTO DDT2
TCHK1C                     END
TCHK1 ***
TCHK1C                     ELSE
     C                     SETOF                     20
     C           @KOT      LOKUP#KOT                     20
     C           *IN20     IFEQ '1'
     C                     SETOF                     21
     C           KT,Z      LOKUPRL1                      21
     C           *IN21     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     ELSE
     C                     SETOF                     22
     C           KT,Z      LOKUPLAN1                     22
     C           *IN22     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     END
     C                     END
     C                     ELSE
     C           KT,Z      IFEQ @KOT
     C                     EXSR DDT
     C                     GOTO DDT2
     C                     END
     C                     END
     C                     END
TCHK1C                     END
     C                     END
     C                     ENDDO
     C                     ELSE
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
     C                     EXSR DDT
     C                     END
     C                     END
      *
     C           DDT2      TAG
     C           *IN77     IFEQ '1'
     C           KEY1      SETLLGHCPL221
     C                     DO   *HIVAL
     C           KEY1      READEGHCPL22                  20
     C           *IN20     IFEQ '0'
     C                     SETOF                     25
     C                     Z-ADD@NEN      @JNEN
     C           KEY2      CHAINMBEPL051             25
     C           *IN25     IFEQ '0'
     C                     Z-ADD@TKI      W       20
     C                     ADD  SR,W      JISSE  100
     C                     END
     C                     END
     C  N20                ENDDO
      *
     C                     Z-ADD0         #T1    120
     C                     Z-ADD0         #T2    120
     C                     Z-ADD0         #T3     92
      *
     C           JISSE     IFNE 0
     C           JISSE     DIV  @KAD      JISEKI    H
     C                     ENDIF
      *
     C                     Z-ADD0         LLT
     C           M6KRU2    IFEQ 'D'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR IKO
     C                     EXCPTDT1
     C                     EXSR CLS
     C                     ELSE
      *
     C           M6KRU2    IFEQ 'F'
     C           M6SYUY    MULT M6LOTK    #T1
     C           JISEKI    IFNE 0
     C           #T1       DIV  JISEKI    #LTIME
     C                     END
     C                     EXSR IKO
     C                     EXCPTDT1
     C                     ELSE
     C           M6KRU2    IFEQ 'R'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR IKO
     C                     EXCPTDT1
     C                     ELSE
     C           M6KRU2    IFEQ 'G'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR IKO
     C                     EXCPTDT1
     C                     ELSE
     C           M6KRU2    IFEQ 'K'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR IKO
     C                     EXCPTDT1
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C           END1      TAG
     C  N15                ENDDO
     C                     END
      *-追加-----*
      * かんばん *
      *- 94.08.27 -*
     C           @LST      IFEQ 'B'
     C           *LOVAL    SETLLABHTL01
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     READ ABHTL01                  15
     C           *IN15     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDEQ*DATE
     C                     ELSE
     C           M6STHZ    IFEQ 99999999
     C                     EXSR IKO
     C                     Z-ADD0         KTSU    90
     C           M6KSSU    DIV  20        KTSU
     C                     Z-ADD0         JISEKI 100
     C                     Z-ADD0         JISSE  100
     C                     Z-ADD0         #LTIME  62
      *
     C                     Z-ADD1         Z       20
     C                     SETOF                     3077
     C           KEY4      CHAINAAMPL111             30
     C           *IN30     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDEQ*DATE
     C                     ELSE
     C                     SETOF                     45
     C           BAN       LOKUPTK,Z                     45
     C           *IN45     IFEQ '1'
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
     C           @KOT      IFEQ *BLANK
TCHK1C           KT,Z      LOKUP#KOT2                    23
TCHK1C           *IN23     IFEQ '0'
     C                     EXSR DDT
     C                     GOTO DDT3
TCHK1C                     END
     C                     ELSE
     C                     SETOF                     20
     C           @KOT      LOKUP#KOT                     20
     C           *IN20     IFEQ '1'
     C                     SETOF                     21
     C           KT,Z      LOKUPRL1                      21
     C           *IN21     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     ELSE
     C                     SETOF                     22
     C           KT,Z      LOKUPLAN1                     22
     C           *IN22     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     END
     C                     END
     C                     ELSE
     C           KT,Z      IFEQ @KOT
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*          Z         IFEQ 1
     C*                    GOTO END2
     C*                    END
      *
     C           Z         IFGT 1
     C           Z         SUB  1         X       20
     C                     Z-ADD1         Y       20
      *
     C                     DO   X         Y
     C                     SUB  1         Z
     C           TK,Z      IFNE '------'
     C           TK,Z      ANDNE'++++++'
     C                     GOTO END2
     C                     ELSE
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
     C           @KOT      IFEQ *BLANK
TCHK1C           KT,Z      LOKUP#KOT2                    23
TCHK1C           *IN23     IFEQ '0'
     C                     EXSR DDT
     C                     GOTO DDT3
TCHK1C                     END
     C                     ELSE
     C                     SETOF                     20
     C           @KOT      LOKUP#KOT                     20
     C           *IN20     IFEQ '1'
     C                     SETOF                     21
     C           KT,Z      LOKUPRL1                      21
     C           *IN21     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     ELSE
     C                     SETOF                     22
     C           KT,Z      LOKUPLAN1                     22
     C           *IN22     IFEQ '1'
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     END
     C                     END
     C                     ELSE
     C           KT,Z      IFEQ @KOT
     C                     EXSR DDT
     C                     GOTO DDT3
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     ENDDO
     C                     ELSE
     C           BM,Z      IFEQ @KOJ
     C           KB,Z      ANDEQ@KBN
     C                     EXSR DDT
     C                     END
     C                     END
      *
     C           DDT3      TAG
     C           *IN77     IFEQ '1'
     C           KEY1      SETLLGHCPL221
     C                     DO   *HIVAL
     C           KEY1      READEGHCPL22                  20
     C           *IN20     IFEQ '0'
     C                     SETOF                     25
     C                     Z-ADD@NEN      @JNEN
     C           KEY2      CHAINMBEPL051             25
     C           *IN25     IFEQ '0'
     C                     Z-ADD@TKI      W       20
     C                     ADD  SR,W      JISSE  100
     C                     END
     C                     END
     C  N20                ENDDO
      *
     C                     Z-ADD0         #T1
     C                     Z-ADD0         #T2
     C                     Z-ADD0         #T3
     C           JISSE     IFNE 0
     C           JISSE     DIV  @KAD      JISEKI    H
     C                     ENDIF
      *
     C                     Z-ADD0         LLT
     C           M6KRU2    IFEQ 'D'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     MOVE *BLANK    KKT
     C                     EXSR DAT2
     C                     EXCPTDT2
     C                     ELSE
      *
     C           M6KRU2    IFEQ 'F'
     C           M6SYUY    MULT M6LOTK    #T1
     C           JISEKI    IFNE 0
     C           #T1       DIV  JISEKI    #LTIME
     C                     END
     C                     MOVE *BLANK    KKT
     C                     Z-ADD0         LLT
     C                     EXSR DAT2
     C                     EXCPTDT2
     C                     ELSE
     C           M6KRU2    IFEQ 'R'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR DAT2
     C                     EXCPTDT2
     C                     ELSE
     C           M6KRU2    IFEQ 'G'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR DAT2
     C                     EXCPTDT2
     C                     ELSE
     C           M6KRU2    IFEQ 'K'
     C           M6SYUY    MULT M6LOTK    #T1
     C           #T1       MULT M6KMAX    #T2
     C           M6KMAX    IFGT 1
     C***        #T2       MULT .5        #T3
     C                     Z-ADD#T2       #T3
     C           JISEKI    IFNE 0
     C           #T3       DIV  JISEKI    #LTIME
     C                     END
     C                     ELSE
     C           JISEKI    IFNE 0
     C           #T2       DIV  JISEKI    #LTIME
     C                     END
     C                     END
     C                     EXSR DAT2
     C                     EXCPTDT2
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C           END2      TAG
     C  N15                ENDDO
     C                     END
      *------------*
      *キー用SUB *
      *------------*
     C           DDT       BEGSR
     C                     SETON                     77
     C                     MOVELHB,Z      HBN
     C                     Z-ADDBM,Z      BMN
     C                     MOVELKT,Z      KOT
     C                     MOVELTK,Z      TKR
     C                     ENDSR
      *-追加-------------*
      *後工程・ロットSUB *
      *--------- 94.08.27 -*
     C           DAT2      BEGSR
     C                     Z-ADD1         O       20
     C                     SETOF                         88
     C           BAN       LOKUPTK,O                     88
     C           *IN88     IFEQ '1'
     C                     Z-ADD1         V       20
     C                     Z-ADD1         Q       20
     C           O         ADD  1         P       20
     C           P         DO   15        Q
     C           TK,Q      IFEQ *BLANK
     C                     GOTO STR3
     C                     END
     C           KNB,Q     IFNE *BLANK
     C           KNB,Q     IFEQ 'Z'
     C                     GOTO STR2
     C                     END
      *工程内かんばん
     C           KNB,Q     IFEQ 'A'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT3
     C                     GOTO STR1
     C                     END
      *完成半製品かんばん
     C           KNB,Q     IFEQ '0'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT11
     C                     GOTO STR1
     C                     END
      *購買小工程かんばん
     C           KNB,Q     IFEQ '1'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT12
     C                     GOTO STR1
     C                     END
      *購買小工程熱処理かんばん
     C           KNB,Q     IFEQ '2'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT13
     C                     GOTO STR1
     C                     END
      *構成品かんばん
     C           KNB,Q     IFEQ '6'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT14
     C                     GOTO STR1
     C                     END
      *メッキかんばん
     C           KNB,Q     IFEQ 'C'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT4
     C                     GOTO STR1
     C                     END
      *トンネルかんばん
     C           KNB,Q     IFEQ 'D'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT5
     C                     GOTO STR1
     C                     END
      *引取かんばん
     C           KNB,Q     IFEQ 'E'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT6
     C                     GOTO STR1
     C                     END
      *購買トンネルかんばん
     C           KNB,Q     IFEQ '4'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT7
     C                     GOTO STR1
     C                     END
      *購買熱処理メッキかんばん
     C           KNB,Q     IFEQ '7'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT8
     C                     GOTO STR1
     C                     END
      *焼入かんばん
     C           KNB,Q     IFEQ 'B'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT10
     C                     GOTO STR1
     C                     END
      *指示かんばん
     C           KNB,Q     IFEQ 'F'
     C                     MOVELKT,Q      KKT,V
     C                     MOVELTK,Q      TTT
     C                     EXSR DAT15
     C                     GOTO STR1
     C                     END
     C                     END
     C           STR1      TAG
     C           STR2      TAG
     C           V         IFGT 5
     C                     GOTO STR3
     C                     END
     C                     ENDDO
     C                     END
     C           STR3      TAG
     C                     ENDSR
      *各種マスター
     C           DAT3      BEGSR
     C           KEY5      SETGTABHPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEABHPL031                 40
     C           *IN40     IFEQ '0'
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDM6LOTK    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINABHPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDM6LOTK    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT11     BEGSR
      *
     C           KEY5      SETGTAAPPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAPPL031                 40
     C           *IN40     IFEQ '0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL5HKSU    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAPPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDL5HKSU    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT12     BEGSR
      *
     C           KEY5      SETGTAAOPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAOPL031                 40
     C           *IN40     IFEQ '0'
     C           T1SKJY    IFEQ 'D'
     C           T1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDT1HKSU    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAOPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDT1HKSU    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT13     BEGSR
      *
     C           KEY5      SETGTAAYPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAYPL031                 40
     C           *IN40     IFEQ '0'
     C           L8SKJY    IFEQ 'D'
     C           L8SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL8HKSU    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAYPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDL8HKSU    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT14     BEGSR
      *
     C           KEY5      SETGTAANPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAANPL031                 40
     C           *IN40     IFEQ '0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL7HKSU    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAANPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDL7HKSU    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT4      BEGSR
      *
     C           KEY5      SETGTAAFPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAFPL031                 40
     C           *IN40     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDA3BARB    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAFPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDA3BARB    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT5      BEGSR
      *
     C           KEY5      SETGTAAGPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAGPL031                 40
     C           *IN40     IFEQ '0'
     C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDO4BARB    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAGPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDO4BARB    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT6      BEGSR
      *
     C           KEY5      SETGTAAHPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAHPL031                 40
     C           *IN40     IFEQ '0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL6LOTO    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAHPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDL6LOTO    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT7      BEGSR
      *
     C           KEY5      SETGTAEAPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAEAPL031                 40
     C           *IN40     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDAELOTO    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAEAPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDAELOTO    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT8      BEGSR
      *
     C           KEY5      SETGTAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEAAXPL101                 40
     C           *IN40     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDL9BARB    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINAAXPL101             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDL9BARB    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT10     BEGSR
      *
     C           KEY5      SETGTADHPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPEADHPL031                 40
     C           *IN40     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDJ6LOTO    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINADHPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDJ6LOTO    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *
     C           DAT15     BEGSR
      *
     C           KEY5      SETGTCADPL031
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY5      REDPECADPL031                 40
     C           *IN40     IFEQ '0'
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDC2BARB    LLT,V
     C                     ADD  1         V
     C                     SETON                     40
     C                     END
     C                     END
     C  N40                ENDDO
      *
     C*                    SETOF                     40
     C*          KEY5      CHAINCADPL031             40
     C*          *IN40     IFEQ '0'
     C*                    Z-ADDC2BARB    LLT,V
     C*                    ADD  1         V
     C*                    END
     C                     ENDSR
      *------------*
      *クリアSUB *
      *------------*
     C           CLS       BEGSR
     C                     MOVE *BLANK    MHIN1   5
     C                     MOVE *BLANK    MHIN2   5
     C                     MOVE *BLANK    MHIN3   2
     C                     Z-ADD0         MSYUY   70
     C                     Z-ADD0         MLOTK   30
     C                     Z-ADD0         MKJNK   30
     C                     Z-ADD0         MKMAX   30
     C                     MOVE *BLANK    MKBN1   3
     C                     MOVE *BLANK    MKIB1   1
     C                     MOVE *BLANK    MKBN2   3
     C                     MOVE *BLANK    MKIB2   1
     C                     MOVE *BLANK    MKBN3   3
     C                     MOVE *BLANK    MKIB3   1
     C                     MOVE *BLANK    MKBN4   3
     C                     MOVE *BLANK    MKIB4   1
     C                     MOVE *BLANK    MKBN5   3
     C                     MOVE *BLANK    MKIB5   1
     C                     MOVE *BLANK    MAKT1   3
     C                     MOVE *BLANK    MAKT2   3
     C                     MOVE *BLANK    MAKT3   3
     C                     MOVE *BLANK    MAKT4   3
     C                     MOVE *BLANK    MAKT5   3
     C                     MOVE *BLANK    MJBN1   1
     C                     MOVE *BLANK    MJBN2   2
     C                     MOVE *BLANK    MJBN3   2
     C                     MOVE *BLANK    MJBN4   1
     C                     ENDSR
      *----------------*
      *データ移行SUB *
      *----------------*
     C           IKO       BEGSR
     C                     MOVE M6HIN1    MHIN1
     C                     MOVE M6HIN2    MHIN2
     C                     MOVE M6HIN3    MHIN3
     C                     Z-ADDM6SYUY    MSYUY
     C                     Z-ADDM6LOTK    MLOTK
     C                     Z-ADDM6KJNK    MKJNK
     C                     Z-ADDM6KMAX    MKMAX
     C                     MOVE M6KBN1    MKBN1
     C                     MOVE M6KIB1    MKIB1
     C                     MOVE M6KBN2    MKBN2
     C                     MOVE M6KIB2    MKIB2
     C                     MOVE M6KBN3    MKBN3
     C                     MOVE M6KIB3    MKIB3
     C                     MOVE M6KBN4    MKBN4
     C                     MOVE M6KIB4    MKIB4
     C                     MOVE M6KBN5    MKBN5
     C                     MOVE M6KIB5    MKIB5
     C                     MOVE M6AKT1    MAKT1
     C                     MOVE M6AKT2    MAKT2
     C                     MOVE M6AKT3    MAKT3
     C                     MOVE M6AKT4    MAKT4
     C                     MOVE M6AKT5    MAKT5
     C                     MOVE M6JBN1    MJBN1
     C                     MOVE M6JBN2    MJBN2
     C                     MOVE M6JBN3    MJBN3
     C                     MOVE M6JBN4    MJBN4
     C                     ENDSR
      *-変更-----*
      * A工程機番*
      *- 94.08.27 -*
     OAADWP30 E                DT1
     O                         MHIN1      5
     O                         MHIN2     10
     O                         MHIN3     12
     O                         KTSU      21
     O                         JISEKI    30
     O                         MSYUY     37
     O                         MLOTK     40
     O                         MKJNK     43
     O                         MKMAX     46
     O                         MKBN1     49
     O                         MKIB1     50
     O                         MKBN2     53
     O                         MKIB2     54
     O                         MKBN3     57
     O                         MKIB3     58
     O                         MKBN4     61
     O                         MKIB4     62
     O                         MKBN5     65
     O                         MKIB5     66
     O                         MAKT1     69
     O                         MAKT2     72
     O                         MAKT3     75
     O                         MAKT4     78
     O                         MAKT5     81
     O                         #LTIME    87
     O                         @KOJ      91
     O                         @KBN      94
     O                         @KOT      97
     O                         @HIZ     103
      *-追加-----*
      * Bかんばん*
      *- 94.08.27 -*
     O        E                DT2
     O                         MHIN1      5
     O                         MHIN2     10
     O                         MHIN3     12
     O                         KTSU      21
     O                         JISEKI    30
     O                         MSYUY     37
     O                         MLOTK     40
     O                         MKJNK     43
     O                         MKMAX     46
     O                         MAKT1     49
     O                         MAKT2     52
     O                         MAKT3     55
     O                         MAKT4     58
     O                         MAKT5     61
     O                         MJBN1     62
     O                         MJBN2     64
     O                         MJBN3     66
     O                         MJBN4     67
     O                         KOT1      70
     O                         KOT2      73
     O                         KOT3      76
     O                         KOT4      79
     O                         KOT5      82
     O                         LOT1      86
     O                         LOT2      90
     O                         LOT3      94
     O                         LOT4      98
     O                         LOT5     102
     O                         #LTIME   108
     O                         @KOJ     112
     O                         @KBN     115
     O                         @KOT     118
     O                         @HIZ     124
     O                         M6JOK1   126
     O                         M6JOK2   128
     O                         M6JOK3   130
** #KOT
RL
FRL
RT
RRL
LAN
AOQ
** RL1
RL
FRL
RT
RRL
** LAN1
LAN
AOQ
** #KOT2
LAN
AOQ
HK
SB
KRO
KW
VNL
WT
AK
SL
GRA
