     H            Y.
     F*** AAFR01 *****************************
     F* ..UPDATE OF PLATING KANBAN M/F .
     F* H.ITO                 86.08.26       *
     F* UPDATE:K.OKACHI 2000.02.22 %0001     *
     F*
     F* TCHK1 04/29/11 ADD CALL SAFETY INVENTORY UPDATE PROCESS
     F* TCHK2 11/08/11 CHG CHECK
     F* T.SAKAKI 05/04/15            %0002   *
     F* T.SAKAKI 06/24/19            %0003   *
%04  F* KIRI     04/21/20 工程数と条件コードの数のチェック
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.08|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F****************************************************** AAFR01 ***
     FAAFPW01 CF  E                    WORKSTN
     FAAFTL02 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAACPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FACAPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAQPL01 IF  E           K        DISK
     FABHPP40 IF  E           K        DISK
     FAAUPL01 UF  E           K        DISK
     FAAFPL03 UF  E           K        DISK
     FAAJPL11 UF  E           K        DISK
     FOUTPUT  O   F     300            DISK                      A    UC
TCHK1E*                   ER      1  51 60               エラーＭＳＧ
TCHK1E                    ER      1  59 60               エラーＭＳＧ
     E                    CMT1    1  13  1   CMT2    8   コメント名
     E                    WNO         7  4 0             ＳＥＱ－ＮＯ
     E                    WCM         7  8               コメント
     E                    WDI         7 14               品番
     E                    WPL         7  9               所番地
     E                    WKT         7  8               自工程
     E                    WFR         7  9               有効日－便
     E                    WTO         7  9               失効日－便
     E                    KEY         7 30               ＫＥＹ対比
     E                    JNM         6 16               条件名
     E                    JOK         6  2               条件
     E                    J1KO       15  3               工程コード
     E                    J1KH       15  1               工程変更
     E                    J1JKO       9  2               条件(OLD)
     E                    J1JCO       9  1               かんばん種類(OLD)
     E                    JJOK        6  2               条件(NEW)
     E                    JJKC        6  1               かんばん種類(NEW)
     E                    JTU        24  1 0             部署枚数計画Ｍ
     E                    OKBM       15  4 0             旧部門コードＭ
     E                    OTKR       15  6               旧所番地Ｍ
     E                    OKAB       15  1               旧かんばん種類Ｍ
     E                    NKBM       15  4 0             新部門コードＭ
     E                    NTKR       15  6               新所番地Ｍ
     E                    NKAB       15  1               新かんばん種類Ｍ
     E                    NUKH       15 10 0             かんばん切替日
     E                    HKBM       15  4 0             決定部門コード
     E                    HTKR       15  6               決定所番地
     E                    HKAB       15  1               決定かんばん種類
     E                    HMKC       15  4 0             トンネル部門コード
%0001E                    @KS        15  1               かんばん種類
%0001E                    @TK        15  6               旧所番地Ｍ
%04   *
 |   E                    @KT        15  3               工程Ｍ
 |   E                    OKOT       15  3               旧工程Ｍ
%04  E                    NKOT       15  3               新工程Ｍ
     I            DS
     I                                        1  280WNO
     I                                        1   40NO1
     I                                        5   80NO2
     I                                        9  120NO3
     I                                       13  160NO4
     I                                       17  200NO5
     I                                       21  240NO6
     I                                       25  280NO7
     I            DS
     I                                        1  56 WCM
     I                                        1   8 CM1
     I                                        9  16 CM2
     I                                       17  24 CM3
     I                                       25  32 CM4
     I                                       33  40 CM5
     I                                       41  48 CM6
     I                                       49  56 CM7
     I            DS
     I                                        1  98 WDI
     I                                        1  14 DI1
     I                                       15  28 DI2
     I                                       29  42 DI3
     I                                       43  56 DI4
     I                                       57  70 DI5
     I                                       71  84 DI6
     I                                       85  98 DI7
     I            DS
     I                                        1  63 WPL
     I                                        1   9 PL1
     I                                       10  18 PL2
     I                                       19  27 PL3
     I                                       28  36 PL4
     I                                       37  45 PL5
     I                                       46  54 PL6
     I                                       55  63 PL7
     I            DS
     I                                        1  56 WKT
     I                                        1   8 KT1
     I                                        9  16 KT2
     I                                       17  24 KT3
     I                                       25  32 KT4
     I                                       33  40 KT5
     I                                       41  48 KT6
     I                                       49  56 KT7
     I            DS
     I                                        1  63 WFR
     I                                        1   9 FR1
     I                                       10  18 FR2
     I                                       19  27 FR3
     I                                       28  36 FR4
     I                                       37  45 FR5
     I                                       46  54 FR6
     I                                       55  63 FR7
     I            DS
     I                                        1  63 WTO
     I                                        1   9 TO1
     I                                       10  18 TO2
     I                                       19  27 TO3
     I                                       28  36 TO4
     I                                       37  45 TO5
     I                                       46  54 TO6
     I                                       55  63 TO7
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  90 OTKR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 OKAB
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 NKAB
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
%04   **
 |   I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
 |   I                                       43  45 CKQK15
%04   *
     I            DS
     I                                        1  96 JNM
     I                                        1  16 JNM1
     I                                       17  32 JNM2
     I                                       33  48 JNM3
     I                                       49  64 JNM4
     I                                       65  80 JNM5
     I                                       81  96 JNM6
     I            DS
     I                                        1  14 DSDI
     I                                        1   5 WSHN1
     I                                        6   6 D1
     I                                        7  11 WSHN2
     I                                       12  12 D2
     I                                       13  14 WSHN3
     I            DS
     I                                        1   9 DSPL
     I                                        1   1 WATK1
     I                                        2   2 P1
     I                                        3   4 WATK2
     I                                        5   5 P2
     I                                        6   7 WATK3
     I                                        8   8 P3
     I                                        9   9 WATK4
     I            DS
     I                                        1   8 DSKT
     I                                        1   3 A3ATOK
     I                                        4   4 K1
     I                                        5   80A3ATOB
     I            DS
     I                                        1   9 DSFR
     I                                        1   60WAUHZ
     I                                        7   7 F1
     I                                        8   90WAUBI
     I            DS
     I                                        3  11 DSTO
     I                                        1   80A3STHZ
     I                                        3   80A3STH6
     I                                        9   9 T1
     I                                       10  110A3SBIN
     I            DS
     I                                        1  30 DSKEY
     I                                        1   1 A3DTHE
     I                                        2   2 A3KCD1
     I                                        3   7 A31HB5
     I                                        8  12 A32HB5
     I                                       13  14 A33HB2
     I                                       15  20 A3ATKR
     I                                       15  15 A3ATK1
     I                                       16  17 A3ATK2
     I                                       18  19 A3ATK3
     I                                       20  20 A3ATK4
     I                                       21  300A3UKBI
     I                                       21  280A3UKHZ
     I                                       23  280A3UKH6
     I                                       21  240A3UKYY
     I                                       25  260A3UKMM
     I                                       27  280A3UKDD
     I                                       29  300A3UBIN
     I            DS
     I                                        1  100A3TKBI
     I                                        1   40A3TKYY
     I                                        5   60A3TKMM
     I                                        7   80A3TKDD
     I                                        9  100A3TBIN
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        3   3 MEK13
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     I            DS
     I                                        1  12 JOK
     I                                        1  12 JOKXX
     I                                        1   2 A3JOK1
     I                                        3   4 A3JOK2
     I                                        5   6 A3JOK3
     I                                        7   8 A3JOK4
     I                                        9  10 A3JOK5
     I                                       11  12 A3JOK6
     I            DS
     I                                        1   8 MAEK1
     I                                        1   3 A3MAEK
     I                                        4   4 M1
     I                                        5   80A3MAKB
     I            DS
     I                                        1   9 MTKR
     I                                        1   1 A3MTK1
     I                                        2   2 MM1
     I                                        3   4 A3MTK2
     I                                        5   5 MM2
     I                                        6   7 A3MTK3
     I                                        8   8 MM3
     I                                        9   9 A3MTK4
     I            DS
     I                                        1   80A3KOHZ
     I                                        5   80A3KOMD
     I                                        1   40A3KOYY
     I                                        5   60A3KOMM
     I                                        7   80A3KODD
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
     I            DS
     I                                        1   80A3SKHZ
     I                                        1   40A3SKYY
     I                                        5   60A3SKMM
     I                                        7   80A3SKDD
     I            DS
     I                                        1   60WTIME
     I                                        1   20A3KOHH
     I                                        3   40A3KOSS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  16 NMA
     I            DS
     I                                        1  16 NMB
     I            DS
     I                                        1  16 SETNM
     I            DS
     I                                        1  45 J1KO
     I                                        1   3 J1KO01
     I                                        4   6 J1KO02
     I                                        7   9 J1KO03
     I                                       10  12 J1KO04
     I                                       13  15 J1KO05
     I                                       16  18 J1KO06
     I                                       19  21 J1KO07
     I                                       22  24 J1KO08
     I                                       25  27 J1KO09
     I                                       28  30 J1KO10
     I                                       31  33 J1KO11
     I                                       34  36 J1KO12
     I                                       37  39 J1KO13
     I                                       40  42 J1KO14
     I                                       43  45 J1KO15
     I            DS
     I                                        1  15 J1KH
     I                                        1   1 J1KH01
     I                                        2   2 J1KH02
     I                                        3   3 J1KH03
     I                                        4   4 J1KH04
     I                                        5   5 J1KH05
     I                                        6   6 J1KH06
     I                                        7   7 J1KH07
     I                                        8   8 J1KH08
     I                                        9   9 J1KH09
     I                                       10  10 J1KH10
     I                                       11  11 J1KH11
     I                                       12  12 J1KH12
     I                                       13  13 J1KH13
     I                                       14  14 J1KH14
     I                                       15  15 J1KH15
     I            DS
     I                                        1  18 J1JKO
     I                                        1  12 J1JKOX
     I                                        1   2 J1JKO1
     I                                        3   4 J1JKO2
     I                                        5   6 J1JKO3
     I                                        7   8 J1JKO4
     I                                        9  10 J1JKO5
     I                                       11  12 J1JKO6
     I                                       13  14 J1JKO7
     I                                       15  16 J1JKO8
     I                                       17  18 J1JKO9
     I            DS
     I                                        1   9 J1JCO
     I                                        1   6 J1JCOX
     I                                        1   1 J1JCO1
     I                                        2   2 J1JCO2
     I                                        3   3 J1JCO3
     I                                        4   4 J1JCO4
     I                                        5   5 J1JCO5
     I                                        6   6 J1JCO6
     I                                        7   7 J1JCO7
     I                                        8   8 J1JCO8
     I                                        9   9 J1JCO9
     I            DS
     I                                        1  18 JJOKAL
     I                                        1  12 JJOK
     I                                        1  12 JJOKXX
     I                                        1   2 J1JOK1
     I                                        3   4 J1JOK2
     I                                        5   6 J1JOK3
     I                                        7   8 J1JOK4
     I                                        9  10 J1JOK5
     I                                       11  12 J1JOK6
     I                                       13  14 J1JOK7
     I                                       15  16 J1JOK8
     I                                       17  18 J1JOK9
     I            DS
     I                                        1   9 JJKCAL
     I                                        1   6 JJKC
     I                                        1   6 JJKCXX
     I                                        1   1 J1JKC1
     I                                        2   2 J1JKC2
     I                                        3   3 J1JKC3
     I                                        4   4 J1JKC4
     I                                        5   5 J1JKC5
     I                                        6   6 J1JKC6
     I                                        7   7 J1JKC7
     I                                        8   8 J1JKC8
     I                                        9   9 J1JKC9
     I            DS
     I                                        1  240JTU
     I                                        1   10J1TUS1
     I                                        2   20J1TUS2
     I                                        3   30J1TUS3
     I                                        4   40J1TUS4
     I                                        5   50J1TUS5
     I                                        6   60J1TUS6
     I                                        7   70J1TUS7
     I                                        8   80J1TUS8
     I                                        9   90J1TUS9
     I                                       10  100J1TU10
     I                                       11  110J1TU11
     I                                       12  120J1TU12
     I                                       13  130J1TU13
     I                                       14  140J1TU14
     I                                       15  150J1TU15
     I                                       16  160J1TU16
     I                                       17  170J1TU17
     I                                       18  180J1TU18
     I                                       19  190J1TU19
     I                                       20  200J1TU20
     I                                       21  210J1TU21
     I                                       22  220J1TU22
     I                                       23  230J1TU23
     I                                       24  240J1TU24
     I            DS
     I                                        1   60ZZTIME
     I                                        1   20ZZHORS
     I                                        3   40ZZMINS
     I                                        5   60ZZSECS
     I            DS
     I                                        1  100A3HZBN
     I                                        1   40A3SYY
     I                                        5   60A3SMM
     I                                        7   80A3SDD
     I                                        9  100A3SBN
     I            DS
     I                                        1   80ZSTHZ
     I                                        1   60ZSTYM
     I                                        1   40ZSTYY
     I                                        5   60ZSTMM
     I                                        7   80ZSTDD
%0001 *
     I            DS
     I                                        1  100A3UKHB
     I                                        1   80A3UK
     I                                        9  100WUBIN
     I            DS
     I                                        1  100A3STHB
     I                                        1   80A3ST
     I                                        9  100WSBIN
TCHK1 * ANZPP01
TCHK1I            DS
TCHK1I                                        1   80Z1SKHZ
TCHK1I                                        1   40Z1SKYY
TCHK1I                                        5   60Z1SKMM
TCHK1I                                        7   80Z1SKDD
TCHK1I            DS
TCHK1I                                        1   9 ATKR
TCHK1I                                        1   1 ATKR1
TCHK1I                                        3   4 ATKR2
TCHK1I                                        6   7 ATKR3
TCHK1I                                        9   9 ATKR4
%0001 *
      *
     C                     OPEN OUTPUT
      *
     C           KEY1      KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
     C                     KFLD           A3UKYY
     C                     KFLD           A3UKMM
     C                     KFLD           A3UKDD
     C                     KFLD           A3UBIN
      *
     C           GCKEY1    KLIST
     C                     KFLD           A3KCD1
     C                     KFLD           A3KCD2
      *
     C           KEYQ      KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
      *
     C           GCKEY2    KLIST
     C                     KFLD           A3ATOB
     C                     KFLD           A3ATYP
      *
     C           GCKEY3    KLIST
     C                     KFLD           A3MAKB
     C                     KFLD           A3MTYP
      *
     C           KEYJ      KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
     C                     KFLD           A3SYY
     C                     KFLD           A3SMM
     C                     KFLD           A3SDD
     C                     KFLD           A3SBN
      *
     C           KKEY      KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
      *
     C           KEYA      KLIST
     C                     KFLD           ZMAKB
     C                     KFLD           ZKCD1
      *
     C           KEYB      KLIST
     C                     KFLD           ZMAKB
     C                     KFLD           ZKCD1
     C                     KFLD           Z1HB5
     C                     KFLD           Z2HB5
     C                     KFLD           Z3HB2
      *
     C           HAKEY2    KLIST
     C                     KFLD           A3DTHE
     C                     KFLD           A3KCD1
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
     C                     KFLD           A3UKYY
     C                     KFLD           A3UKMM
     C                     KFLD           A3UKDD
     C                     KFLD           A3UBIN
      *
     C           BKY       KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
      *
     C           AAKEY     KLIST
     C                     KFLD           WJKN
     C                     KFLD           WJKB
TCHK1C           KEYAX2    KLIST
TCHK1C                     KFLD           WSHN1
TCHK1C                     KFLD           WSHN2
TCHK1C                     KFLD           WSHN3
TCHK1C                     KFLD           A3KCD1
TCHK1C                     KFLD           A3KCD2
      *
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C                     PARM           PFILE   5
      *
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           A3KTSU
     C                     PARM           A3SSYS
     C                     PARM           A3KEIS
     C                     PARM           A3READ
     C                     PARM           A3BARA
     C                     PARM           A3CBKO
     C                     PARM           A3LOTO
     C                     PARM           A3MAXH
     C                     PARM           WMAIS
      *
     C                     MOVE '-'       D1
     C                     MOVE '-'       D2
     C                     MOVE '-'       P1
     C                     MOVE '-'       P2
     C                     MOVE '-'       P3
     C                     MOVE '-'       K1
     C                     MOVE '-'       F1
     C                     MOVE '-'       T1
     C                     MOVE '-'       M1
     C                     MOVE '-'       MM1
     C                     MOVE '-'       MM2
     C                     MOVE '-'       MM3
     C                     Z-ADD0         A3UKHZ
     C                     Z-ADD0         A3UBIN
      *
     C*--------------------------*
     C*     ...画面－１...     *
     C*--------------------------*
     C           STP1      TAG
     C                     EXFMTAAFPW011
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      ASTLR   2
      *
     C**  xｮgf]ﾌﾞ]uﾇjｰ ﾉ ibﾅ]ﾎﾟﾜhﾞ[w s  **
     C                     CALL 'ABCR05'  ACALL
     C                     GOTO END
     C                     END
      *
     C**  ﾌﾞ]ﾃﾞc ﾉ kｩｮh  **
     C           NO        IFNE '1'
     C           NO        ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------------------*
     C*     ...画面　の　セット（１）...     *
     C*----------------------------------------*
     C                     Z-ADD0         WNO              SEQ-NO
     C                     MOVE *BLANK    WCM              ﾃx]n
     C                     MOVE *BLANK    WDI              ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    WPL              nﾃﾜﾌﾞ]k
     C                     MOVE *BLANK    WKT              ﾆﾞﾃcmb
     C                     MOVE *BLANK    WFR              ﾏcﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    WTO              ﾆｮﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    KEY              KEY.jbﾍ
     C                     Z-ADD0         BANGO            ﾃcﾆ] ﾌﾞ]ﾃﾞc
     C                     Z-ADD0         I       50
     C           NO        IFEQ '2'
     C                     MOVE *BLANK    A3ATKR
     C                     GOTO STP3
     C                     END
      *
     C**  xｮgf]ﾌﾞ]uﾇjｰ ﾉ kｩｮh  **
     C           *LOVAL    SETLLAAFTL021
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AAFTL021                 30
     C   30                GOTO ST1E
     C           A3DTHE    COMP *BLANK                   30
     C  N30                GOTO ST1E
     C                     ADD  1         I
     C           I         CABGT7         ST1E
     C                     Z-ADDI         WNO,I
     C                     EXSR SUB1
     C                     END
     C           ST1E      TAG
     C           I         IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C*--------------------------*
     C*     ...画面－２...     *
     C*--------------------------*
     C           STP2      TAG
     C                     EXFMTAAFPW012
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      ASTLR
     C                     CALL 'ABCR05'  ACALL
     C                     GOTO END
     C                     END
     C           *INKB     IFEQ '1'
     C           NO        IFEQ '2'
     C                     MOVE *BLANK    A3ATKR
     C                     GOTO STP3
     C                     END
     C                     MOVE *BLANK    NO
     C                     GOTO STP1
     C                     END
      *
     C**  ﾌﾞ]kuﾇjｰ ﾉ ﾃcﾆ]  **
     C           *INKG     IFEQ '1'
     C                     CALL 'AAJR11'
     C                     PARM           USER
     C                     GOTO STP2
     C                     END
      *
     C**  ROLL-UP  **
     C           *IN91     IFEQ '1'
     C                     EXSR SUB2
     C           *IN99     IFEQ '1'
     C                     MOVE ER,4      MSG
     C                     END
     C                     GOTO STP2
     C                     END
      *
     C**  ROLL DOWN  **
     C           *IN92     IFEQ '1'
     C                     EXSR SUB3
     C           *IN99     IFEQ '1'
     C                     MOVE ER,5      MSG
     C                     END
     C                     GOTO STP2
     C                     END
     C           BANGO     IFEQ 0
     C                     EXSR SUB2
     C           *IN99     IFEQ '1'
     C                     MOVE ER,4      MSG
     C                     END
     C                     GOTO STP2
     C                     ELSE
     C                     SETOF                     30
     C                     Z-ADD1         I       50
     C           BANGO     LOKUPWNO,I                    30
     C           *IN30     IFEQ '0'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
     C                     MOVE KEY,I     DSKEY
     C                     Z-ADDI         A       20
     C                     EXSR SET2
     C                     SETOF                     81
     C           A3KCD2    IFEQ 'Z'
     C                     SETON                     81
     C                     END
     C                     GOTO STP4
     C                     END
      *
     C*--------------------------*
     C*     ...画面－３...     *
     C*--------------------------*
     C           STP3      TAG
     C                     EXFMTAAFPW013
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      ASTLR
     C                     CALL 'ABCR05'  ACALL
     C                     GOTO END
     C                     END
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO STP1
     C                     END
      *
     C**  ﾆﾞﾃcmb nﾃﾜﾌﾞ]k ﾉ kｩｮh  **
     C           A3ATKR    IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,6      MSG
     C                     GOTO STP3
     C                     END
     C                     MOVE A3ATKR    AATKR   6
     C                     Z-ADD0         I
     C                     Z-ADD0         WNO              SEQ-NO
     C                     MOVE *BLANK    WCM              ﾃx]n
     C                     MOVE *BLANK    WDI              ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    WPL              nﾃﾜﾌﾞ]k
     C                     MOVE *BLANK    WKT              ﾆﾞﾃcmb
     C                     MOVE *BLANK    WFR              ﾏcﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    WTO              ﾆｮﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    KEY              KEY.jbﾍ
      *
     C                     Z-ADD0         A3UKHZ
     C                     Z-ADD0         A3UBIN
     C           KEY1      SETLLAAFPL031
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AAFPL031                 30
     C   30                GOTO ST3E
     C           AATKR     COMP A3ATKR                   30
     C  N30                GOTO ST3E
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     GOTO ST3A
     C                     END
     C                     ADD  1         I
     C           I         CABGT7         ST3E
     C                     Z-ADDI         WNO,I
     C                     EXSR SUB1
     C           ST3A      TAG
     C                     END
     C           ST3E      TAG
     C           I         IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     MOVE AATKR     A3ATKR
     C                     GOTO STP3
     C                     END
     C                     GOTO STP2
      *
     C*--------------------------*
     C*     ...画面－４...     *
     C*--------------------------*
     C           STP4      TAG
     C                     EXFMTAAFPW014
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     080910
     C                     SETOF                     161718
     C                     SETOF                     192021
     C                     SETOF                     249911
     C                     SETOF                     404122
     C                     SETOF                     4243
     C                     SETOF                     33
     C                     MOVEL*BLANK    A3HSNM
      *
     C           *INKC     IFEQ '1'
     C                     MOVELA3ATK1    P3ATK1
     C                     MOVELA3ATK2    P3ATK2
     C                     MOVELA3ATK3    P3ATK3
     C                     MOVELA3ATK4    P3ATK4
     C                     MOVELA3UKYY    P3UKYY
     C                     MOVELA3UKMM    P3UKMM
     C                     MOVELA3UKDD    P3UKDD
     C                     MOVELA3UBIN    P3UBIN
     C                     CALL 'ANZR98'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     Z-ADD0         BANGO
     C                     GOTO STP2
     C                     END
     C           *INKF     IFEQ '1'
     C                     CALL 'ABHR41'
     C                     GOTO STP4
     C                     END
TCHK1C           *INKD     IFEQ '1'
      *
     C           ANZR05    PLIST
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     PARM           P@FPGM 10
     C                     PARM           P@MAXH  40       安全箱数
     C                     PARM           PSTS    1        *ステータス
      *
     C                     MOVELA3ATK1    P3ATK1
     C                     MOVELA3ATK2    P3ATK2
     C                     MOVELA3ATK3    P3ATK3
     C                     MOVELA3ATK4    P3ATK4
     C                     MOVELA3UKYY    P3UKYY
     C                     MOVELA3UKMM    P3UKMM
     C                     MOVELA3UKDD    P3UKDD
     C                     MOVELA3UBIN    P3UBIN
     C                     MOVEL'AAFR01'  P@FPGM
     C                     Z-ADDA3MAXH    P@MAXH  40       安全箱数
     C                     MOVE *BLANK    PSTS    1        *ステータス
      *
     C                     CALL 'ANZR05'  ANZR05
TCHK1C                     GOTO STP4
TCHK1C                     END
      *
     C*  ﾍgnﾒﾜｮn ﾉ ﾆｭcfb  *
     C                     MOVE A3UKYY    PUYY    4
     C                     MOVE A3UKMM    PUMM    2
     C                     MOVE A3UKDD    PUDD    2
     C                     MOVE A3UBIN    PUBN    2
     C           *INKB     IFEQ '1'
     C                     CALL 'AAJR16'
     C                     PARM           A3ATK1
     C                     PARM           A3ATK2
     C                     PARM           A3ATK3
     C                     PARM           A3ATK4
     C                     PARM           PUYY
     C                     PARM           PUMM
     C                     PARM           PUDD
     C                     PARM           PUBN
     C                     GOTO STP4
     C                     END
      *
     C           A3DTKO    IFNE '0'
      *
     C**  ibﾅ]ﾍajﾒﾇc  **
     C           A3KTSU    IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,10     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  ﾆｬcﾑcﾇc  **
     C           A3SSYS    IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,11     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  ﾆｬcﾑcﾇc-j]b  **
     C           A3SSYT    IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,12     MSG
     C                     GOTO STP4
     C                     END
     C**  ﾌﾃbﾜ  **
     C           A3HSYU    IFEQ *BLANK
     C                     SETON                     4399
     C                     MOVE ER,58     MSG
     C                     GOTO STP4
     C                     END
      *
     C                     SETOF                     44
     C           A3HSYU    CHAINABHPP40              44
     C           *IN44     IFEQ *OFF
     C           A4SKJY    ANDEQ' '
     C                     MOVELA4NAME    A3HSNM
     C                     ELSE
     C                     SETON                     4399
     C                     MOVE ER,58     MSG
     C                     GOTO STP4
     C                     ENDIF
TCHK1C**  MAX ﾉ kｩｮh  **
TCHK1C           A3KCD1    IFNE 'C'
TCHK1C                     GOTO @JUMP
TCHK1C                     END
TCHK1 *
TCHK1C           A3KCD2    IFEQ 'A'
TCHK1C           A3KCD2    OREQ 'Z'
TCHK1C                     ELSE
TCHK1C                     GOTO @JUMP
TCHK1C                     END
TCHK1 *
TCHK1C                     Z-ADD0         W@MAXH  40
     C                     MOVELA3ATK1    P3ATK1
     C                     MOVELA3ATK2    P3ATK2
     C                     MOVELA3ATK3    P3ATK3
     C                     MOVELA3ATK4    P3ATK4
     C                     MOVELA3UKYY    P3UKYY
     C                     MOVELA3UKMM    P3UKMM
     C                     MOVELA3UKDD    P3UKDD
     C                     MOVELA3UBIN    P3UBIN
     C                     CALL 'ANZR06'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     PARM           W@MAXH
TCHK1 *
TCHK1C           W@MAXH    IFNE A3MAXH
TCHK1C                     SETON                     3399
TCHK1C                     MOVE ER,56     MSG
TCHK1C                     GOTO STP4
TCHK1C                     END
TCHK1 *
TCHK1C           @JUMP     TAG
      *
     C**  ﾈｮmbﾃｰnﾞ ﾉ kｩｮh  **
     C                     MOVE *BLANK    SETNM
     C           WSTI1     IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,13     MSG
     C                     GOTO STP4
     C                     END
     C           WSTI1     IFLT '00'
     C                     SETON                     0499
     C                     MOVE ER,30     MSG
     C                     GOTO STP4
     C                     END
     C                     MOVE WSTI1     A3STI1
     C                     SETOF                     30
     C           A3STI1    CHAINAABPL011             30
     C           *IN30     IFEQ '1'
     C                     SETON                     0499
     C                     MOVE ER,14     MSG
     C                     GOTO STP4
     C                     END
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    IFLE *DATE
     C                     SETON                     0499
     C                     MOVE ER,14     MSG
     C                     GOTO STP4
     C                     END
     C                     END
     C                     MOVELA4SETN    SETNM
      *
     C**  ﾌﾞﾛﾓ  **
     C           A3BARA    IFEQ 0
     C                     SETON                     4099
     C                     MOVE ER,35     MSG
     C                     GOTO STP4
     C                     END
      *
     C           A3BARB    IFEQ 0
     C                     SETON                     4199
     C                     MOVE ER,36     MSG
     C                     GOTO STP4
     C                     END
      *
     C           A3BARA    IFLT A3BARB
     C                     SETON                     404199
     C                     MOVE ER,33     MSG
     C                     GOTO STP4
     C                     END
      *
     C           A3BARA    DIV  A3BARB    WBAA    50
     C                     MVR            WBAB    53
     C           WBAB      IFNE 0
     C                     SETON                     404199
     C                     MOVE ER,34     MSG
     C                     GOTO STP4
     C                     END
      *
      * %0002 KANBAN S KIND = 'Z' IS NO LINE CHECK
     C           A3KCD2    IFEQ 'A'
      *
     C                     EXSR $SB900
     C           *IN99     IFEQ '1'
     C                     MOVELER,51     MSG
     C                     GOTO STP4
     C                     END
      *
     C                     EXSR $SB901
     C           *IN99     IFEQ '1'
     C                     MOVELER,52     MSG
     C                     GOTO STP4
     C                     END
      *
     C                     EXSR $SB902
     C           *IN99     IFEQ '1'
     C                     MOVELER,57     MSG
     C                     GOTO STP4
     C                     END
      *
     C                     END
      *------------*
     C**  ﾃcﾆ]hﾎﾞ] ﾉ kｩｮh  **
     C           A3STI1    IFGE 01
     C           A3STI1    IFLE 49
     C           A3KSNK    IFEQ 6
     C                     Z-ADD7         KSKBN            ﾃcﾆ] hﾎﾞ]
     C                     ELSE
     C           A3KSNK    IFEQ 7
     C                     Z-ADD8         KSKBN
     C                     ELSE
     C           A3KSNK    IFEQ 8
     C                     Z-ADD6         KSKBN
     C                     END
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADDA3KSNK    KSKBN
     C                     END
     C                     END
      *
     C**  ﾒｰnﾞjbw ﾉ kｩｮh  **
     C           A3READ    IFEQ 0
     C                     SETON                     0599
     C                     MOVE ER,15     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  ﾌﾞ[lgibﾇc ﾉ kｩｮh  **
     C           A3KEIS    IFEQ 0
     C                     SETON                     0699
     C                     MOVE ER,16     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  f]ﾌﾞ]ﾆｬﾓbuﾇjｰ ﾉ kｩｮh  **
     C                     MOVE *BLANK    KCDNM
     C                     SETOF                     30
     C           GCKEY1    CHAINGCMPL311             30
     C           *IN30     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,17     MSG
     C                     GOTO STP4
     C                     END
     C           T3SKJY    IFEQ 'D'
     C           T3SKHZ    IFLE *DATE
     C                     SETON                     99
     C                     MOVE ER,17     MSG
     C                     GOTO STP4
     C                     END
     C                     END
     C                     MOVELT3NAMN    KCDNM
      *
     C**  ﾑcﾆ ﾉ kｩｮh  **
     C           WYOSI     IFEQ *BLANK
     C                     SETON                     0999
     C                     MOVE ER,18     MSG
     C                     GOTO STP4
     C                     END
     C           WYOSI     IFLT '00'
     C                     SETON                     0999
     C                     MOVE ER,30     MSG
     C                     GOTO STP4
     C                     END
     C                     MOVE WYOSI     A3YOSI
      *
     C**  f]ﾈbj]ﾆﾞｬc ﾉ kｩｮh  **
     C           A3KASI    IFEQ 0
     C                     SETON                     2499
     C                     MOVE ER,31     MSG
     C                     GOTO STP4
     C                     END
     C*          A3KASI    IFNE KASI
     C*                    SETON                     2499
     C*                    MOVE ER,45     MSG
     C*                    GOTO STP4
     C*                    END
      *
     C**  ﾇﾞx]ﾍlﾑchﾎﾞ]  **
     C           A3ZMEN    IFNE *BLANK
     C           A3ZMEN    ANDNE'1'
     C           A3ZMEN    ANDNE'4'
     C                     SETON                     2299
     C                     MOVE ER,37     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  nﾃﾜﾌﾞ]k gﾉc uﾇjｰ
     C                     SETOF                     30
     C           KEYQ      CHAINAAQPL011             30
     C           *IN30     IFEQ '0'
     C           DBSKJY    ANDEQ'D'
     C           DBSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     Z-ADDDBSHIY    A3SHIY
     C                     ELSE
     C                     SETON                     99
     C                     MOVE ER,32     MSG
     C                     Z-ADD0         A3SHIY
     C                     MOVE *BLANK    XYOSI
     C                     GOTO STP4
     C                     END
     C*
     C           A3KCD1    IFEQ 'C'
     C           A3KCD2    ANDEQ'A'
     C           A3RAIN    ANDEQ*BLANK
     C                     SETON                     4299
     C                     MOVELER,53     MSG
     C                     GOTO STP4
     C                     END
     C*
     C           A3KCD1    IFEQ 'C'
     C           A3KCD2    ANDEQ'Z'
     C           A3ATOB    ANDNE0111
     C           A3RAIN    ANDEQ*BLANK
     C                     SETON                     4299
     C                     MOVELER,53     MSG
     C                     GOTO STP4
     C                     END
     C*    90.09.10
     C*
     C           WYOSI     IFNE XYOSI
     C                     SETON                     0999
     C                     MOVELER,42     MSG
     C                     GOTO STP4
     C                     END
      *
     C*----------------------------------------*
     C*  ..メッキ条件・加工条件　チェック..  *
     C*----------------------------------------*
     C*------------------------------*
     C*  ..かんばん種類　Ｃ－Ｚ..  *
     C*------------------------------*
     C                     MOVE *BLANK    JNM              ﾆﾞｭci] xb
      *
     C           A3KCD1    IFEQ 'C'
     C           A3KCD2    ANDEQ'Z'
      *
     C           WMKCK     IFEQ '*'
      *
     C           A3JOK1    IFEQ *BLANK
     C****                 SETON                     1699
     C****                 MOVE ER,46     MSG
     C****                 GOTO STP4
     C                     END
     C           A3JOK2    IFEQ *BLANK
     C****                 SETON                     1799
     C****                 MOVE ER,46     MSG
     C****                 GOTO STP4
     C                     END
     C                     ELSE
      *
     C           A3JOK1    IFNE *BLANK
     C           A3JOK2    IFNE *BLANK
     C*****                SETON                     161799
     C********             MOVE ER,47     MSG
     C*********            GOTO STP4
     C                     END
     C                     ELSE
     C           A3JOK2    IFEQ *BLANK
     C*                    SETON                     161799
     C*                    MOVE ER,49     MSG
     C*                    GOTO STP4
     C                     END
     C                     END
      *
     C                     END
     C                     ELSE
      *
     C*----------------------------------*
     C*  ..かんばん種類　Ｃ－Ｚ以外..  *
     C*----------------------------------*
     C           A3ATOB    IFEQ 8923
     C           A3ATOB    OREQ 5568
     C                     GOTO @NOCHK
     C                     END
     C*
     C           WMKCK     IFEQ *BLANK
      *
     C           A3JOK1    IFNE *BLANK
     C                     SETON                     1699
     C                     MOVE ER,48     MSG
     C                     GOTO STP4
     C                     END
     C           A3JOK2    IFNE *BLANK
     C                     SETON                     1799
     C                     MOVE ER,48     MSG
     C                     GOTO STP4
     C                     END
     C                     ELSE
      *
     C                     Z-ADD1         U
     C                     Z-ADD0         WRDMK   10
     C           1         DO   2         U
     C           HMKC,U    IFEQ A3ATOB
     C                     ADD  1         WRDMK
     C                     END
     C                     END
      *
     C           WRDMK     IFEQ 0
     C           A3JOK1    IFNE *BLANK
     C**                   SETON                     1699
     C**                   MOVE ER,48     MSG
     C**                   GOTO STP4
     C                     END
     C           A3JOK2    IFNE *BLANK
     C**                   SETON                     1799
     C**                   MOVE ER,48     MSG
     C**                   GOTO STP4
     C                     END
     C                     END
      *
     C           WRDMK     IFEQ 1
     C           A3JOK1    IFNE *BLANK
     C           A3JOK2    IFNE *BLANK
     C*****                SETON                     161799
     C*******              MOVE ER,47     MSG
     C*********            GOTO STP4
     C                     END
     C                     ELSE
     C           A3JOK2    IFEQ *BLANK
     C*                    SETON                     161799
     C*                    MOVE ER,49     MSG
     C*                    GOTO STP4
     C                     END
     C                     END
     C                     END
      *
     C           WRDMK     IFEQ 2
     C           A3JOK1    IFEQ *BLANK
%0003C****                 SETON                     1699
|    C****                 MOVE ER,46     MSG
     C****                 GOTO STP4
     C                     END
     C           A3JOK2    IFEQ *BLANK
     C****                 SETON                     1799
|    C****                 MOVE ER,46     MSG
%0003C****                 GOTO STP4
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           @NOCHK    TAG
      *
     C**  ﾆﾞｭci]xb ﾉ ﾈｮn  **
     C                     Z-ADD1         I
     C           1         DO   6         I
     C           I         ADD  15        K       20
 1   C           JOK,I     IFNE *BLANK
 |   C           I         ADD  1         J       50
 |   C                     SETOF                     30
 |   C                     MOVE JOK,I     WJKN
 |   C           AAKEY     CHAINAAAPL011             30
 |2  C           *IN30     IFEQ '1'
 ||  C                     MOVE '1'       *IN,K
 ||  C                     SETON                     99
 ||  C                     MOVE ER,24     MSG
 ||  C                     GOTO STP4
 |2  C                     END
 |2  C           A5SKJY    IFEQ 'D'
 ||3 C           A5SKHZ    IFLE *DATE
 ||| C                     MOVE '1'       *IN,K
 ||| C                     SETON                     99
 ||| C                     MOVE ER,24     MSG
 ||| C                     GOTO STP4
 ||3 C                     END
 |2  C                     END
 |   C                     MOVELA5JOKM    JNM,I
 |2  C           I         IFNE 6
 ||  C           JOK,I     LOKUPJOK,J                    30
 ||3 C           *IN30     IFEQ '1'
 ||| C                     MOVE '1'       *IN,K
 ||| C           J         ADD  15        K
 ||| C                     MOVE '1'       *IN,K
 ||| C                     SETON                     99
 ||| C                     MOVE ER,25     MSG
 ||| C                     GOTO STP4
 ||3 C                     END
 |2  C                     END
 1   C                     END
     C                     END
      *
     C**  ﾌﾞｰﾃｰnﾞuﾇjｰ ﾉ kｩｮh  **
     C                     Z-ADD0         WATOH
     C                     SETOF                     30
     C           A3ATOB    CHAINAACPL011             30
     C           *IN30     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,27     MSG
     C                     GOTO STP4
     C                     END
     C           T8SKJY    IFEQ 'D'
     C           T8SKHZ    IFLE *DATE
     C                     MOVE ER,27     MSG
     C                     SETON                     99
     C                     GOTO STP4
     C                     END
     C                     END
     C                     Z-ADDT8BKO1    A3ATOH
     C                     Z-ADDT8BKO1    WATOH
     C                     MOVE *BLANK    NMA
     C           A3ATYP    IFEQ *BLANK
     C                     SETON                     1199
     C                     MOVE ER,19     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  ﾎﾞy]xbﾆｭcuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           GCKEY2    CHAINAATPL011             30
     C           *IN30     IFEQ '1'
     C                     SETON                     1199
     C                     MOVE ER,20     MSG
     C                     GOTO STP4
     C                     END
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    IFLE *DATE
     C                     SETON                     1199
     C                     MOVE ER,20     MSG
     C                     GOTO STP4
     C                     END
     C                     END
     C                     MOVELDCNAMN    NMA
      *
     C**  ﾌﾞｰﾃｰnﾞuﾇjｰ ﾉ kｩｮh  **
     C                     Z-ADD0         WMAEH
     C                     SETOF                     30
     C           A3MAKB    CHAINAACPL011             30
     C           *IN30     IFEQ '1'
     C                     MOVE ER,28     MSG
     C                     SETON                     99
     C                     GOTO STP4
     C                     END
     C           T8SKJY    IFEQ 'D'
     C           T8SKHZ    IFLE *DATE
     C                     MOVE ER,28     MSG
     C                     SETON                     99
     C                     GOTO STP4
     C                     END
     C                     END
     C                     Z-ADDT8BKO2    A3MAEH
     C                     Z-ADDT8BKO2    WMAEH
     C                     MOVE *BLANK    NMB
     C           A3MTYP    IFEQ *BLANK
     C                     SETON                     1099
     C                     MOVE ER,21     MSG
     C                     GOTO STP4
     C                     END
      *
     C**  ﾎﾞy]xbﾆｭcuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           GCKEY3    CHAINAATPL011             30
     C           *IN30     IFEQ '1'
     C                     SETON                     1099
     C                     MOVE ER,22     MSG
     C                     GOTO STP4
     C                     END
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    IFLE *DATE
     C                     SETON                     1099
     C                     MOVE ER,22     MSG
     C                     GOTO STP4
     C                     END
     C                     END
     C                     MOVELDCNAMN    NMB
      *
     C*----------------------------------------*
     C*     ...かんばん枚数　の　計算...     *
     C*----------------------------------------*
     C                     MOVE *BLANK    ASTLR            SETON LR ﾍｭcﾆg
     C                     Z-ADD0         WMAIS   50
     C                     CALL 'ABCR05'  ACALL
     C*****      WMAIS     IFGT 999
     C           WMAIS     IFGT 9999
     C                     SETON                     99
     C                     MOVE ER,38     MSG
     C                     GOTO STP4
     C                     END
     C                     Z-ADDWMAIS     A3KMAX
     C                     Z-ADDA3KMAX    WKMAX
     C           A3DTKO    IFEQ '2'
     C           A3DTKO    OREQ 'D'
     C                     GOTO CAE
     C                     END
     C           A3DOUT    IFNE *BLANK
     C                     Z-ADDWALL      A3KALL
     C                     Z-ADDWMAX      A3KMIN
     C                     END
     C           *YEAR     CABEQA3KOYY    CA2
     C           *YEAR     SUB  A3KOYY    WYY     40
     C           WYY       IFLE 01
     C                     Z-ADDUMONTH    XXMM
     C                     Z-ADDUDAY      XXDD
     C           XXMD      CABLEA3KOMD    CA2
     C                     END
     C           A3KALL    CABLTA3KMIN    CA2
     C           A3KMIN    CABGE30        CA2
     C                     SETOF                     30
     C           A3STI1    COMP 01                     30
     C  N30      A3STI1    COMP 49                   30
     C           *IN30     IFEQ '1'
     C                     SETON                     0499
     C                     MOVE ER,26     MSG
     C                     GOTO STP4
     C                     END
     C           CA2       TAG
     C                     Z-ADD0         A3SRMS
     C           A3DOUT    IFNE *BLANK
     C                     MOVE *BLANK    A3KSHK
     C                     Z-ADD0         A3ALHK
     C                     Z-ADD0         A3MXHK
     C                     END
     C           A3KSNK    IFEQ KSKBN
     C           A3DOUT    CABEQ'Y'       CAE
     C           A3KSHK    CABEQ*BLANK    CAE
     C                     Z-ADDA3ALHK    WKALL
     C                     Z-ADDA3MXHK    WMAX
     C                     ELSE
     C           A3KSHK    IFNE *BLANK
     C                     Z-ADDA3ALHK    WKALL
     C                     Z-ADDA3MXHK    WMAX
     C                     END
     C                     END
     C                     Z-ADD0         A3KALL
     C                     Z-ADD0         A3KMIN
     C           WKALL     IFGT WMAX
     C           WKALL     SUB  WMAX      A3SRMS
     C                     END
     C           CAE       TAG
%04   *
 |   C                     EXSR #SUB1
 |   C*       条件の入力数のチェック
 |   C           $LOQ      IFNE '*'                        "LOQ"なし
 |   C                     EXSR #JOK
 |   C   99                GOTO STP4
 |   C                     ENDIF
%04   *
      *
     C           A3UKHZ    IFLE *DATE
     C           A3DTKO    ANDNE'2'
     C           A3DTKO    ANDNE'6'
     C           A3DTKO    ANDNE'D'
     C           A3SSYS    IFEQ USSYS                      ﾆｬcﾑcﾇc
     C           A3SSYT    ANDEQUSSYT                      ﾆｬcﾑcﾇc j]b
     C           A3CBKO    ANDEQUCBKO                      Cﾌﾞﾃ
     C           A3BARA    ANDEQUBARA                      ﾌﾞﾛﾓ A
     C           A3BARB    ANDEQUBARB                      ﾌﾞﾛﾓ B
     C           A3RAIN    ANDEQURAIN                      [b]
     C           A3YOSI    ANDEQUYOSI                      ﾑcﾆ
     C           A3KASI    ANDEQUKASI                      f]ﾈbj]ﾆﾞｬc
     C           A3MTYP    ANDEQUMTYP                      udﾃcmb jbﾎﾟ
     C           A3ATYP    ANDEQUATYP                      ﾆﾞﾃcmb jbﾎﾟ
     C           A3JOK1    ANDEQUJOK1                      ﾆﾞｭci] 1-1
     C           A3JOK2    ANDEQUJOK2                             2-1
     C           A3JOK3    ANDEQUJOK3                      pﾇfﾞj  1-1
     C           A3JOK4    ANDEQUJOK4                             2-1
     C           A3JOK5    ANDEQUJOK5                             2-2
     C           A3JOK6    ANDEQUJOK6                             2-3
     C           A3MEKI    ANDEQA2MEKI
     C           A3STI1    ANDGE50                         ﾈｮmbﾃｰnﾞ
     C                     ELSE
     C                     SETON                     99
     C                     MOVE ER,39     MSG
     C                     GOTO STP4
     C                     END
     C                     END
      *
     C           A3ATOB    IFEQ 2151
     C           A3KCD2    IFNE 'Z'
     C                     SETON                     99
     C                     MOVELER,43     MSG
     C                     GOTO STP4
     C                     END
     C                     END
     C*          A3KCD2    IFEQ 'Z'
     C*          A3ATOB    IFNE 2151
     C*                    SETON                     99
     C*                    MOVELER,44     MSG
     C*                    GOTO STP4
     C*                    END
     C*                    END
      *
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP4
     C                     END
      *
     C                     SETOF                     51
     C                     Z-ADDA3ATOB    ZATOB   40
     C                     MOVE A31HB5    Z1HB5   5
     C                     MOVE A32HB5    Z2HB5   5
     C                     MOVE A33HB2    Z3HB2   2
     C                     Z-ADDA3TKYY    ZTKYY   40
     C                     Z-ADDA3TKMM    ZTKMM   20
     C                     Z-ADDA3TKDD    ZTKDD   20
     C                     Z-ADDA3TBIN    ZTBIN   20
     C                     Z-ADDA3STYY    ZSTYY
     C                     Z-ADDA3STMM    ZSTMM
     C                     Z-ADDA3STDD    ZSTDD
     C                     Z-ADDA3SBIN    ZSBIN   20
     C                     Z-ADDA3UKYY    ZUKYY   40
     C                     Z-ADDA3UKMM    ZUKMM   20
     C                     Z-ADDA3UKDD    ZUKDD   20
     C                     Z-ADDA3UBIN    ZUBIN   20
     C                     Z-ADDA3MAKB    ZMAKB   40
     C                     MOVE A3KCD1    ZKCD1   1
      *
     C           A3DTKO    IFNE '0'
      *
     C**  ﾜｮn  **
     C                     SETOF                     30
     C                     SETOF                     25
     C           A3STHZ    COMP *DATE                25  25
     C   25                Z-ADDA3STYY    A3SYY
     C   25                Z-ADDA3STMM    A3SMM
     C   25                Z-ADDA3STDD    A3SDD
     C   25                Z-ADDA3SBIN    A3SBN
     C  N25                Z-ADD*YEAR     A3SYY
     C  N25                Z-ADDUMONTH    A3SMM
     C  N25                Z-ADDUDAY      A3SDD
     C  N25                Z-ADD01        A3SBN
     C           KEYJ      SETLLAAJPL111
     C           KEYJ      READEAAJPL111                 30
     C           *IN30     IFEQ '0'
      *
     C           A3ATKR    IFNE CJBANC
     C                     SETON                     99
     C                     MOVE ER,41     MSG
     C                     GOTO STP4
     C                     END
      *
     C                     Z-ADDA3SSYS    CJSYUY
     C           A3BARA    MULT A3SSYS    CJSLOT
     C                     UPDATAAJPL111
     C                     END
      *
     C           A3KSNK    IFEQ KSKBN
     C           A3DOUT    CABEQ'Y'       STP5
     C           A3KSHK    CABEQ*BLANK    STP5
     C                     END
     C           A3DOUT    IFNE *BLANK
     C                     MOVE 'H'       A3KSHK
     C                     Z-ADDWKALL     A3ALHK
     C                     Z-ADDWMAX      A3MXHK
     C                     END
     C           STP5      TAG
     C           A3DTKO    IFNE '2'
     C           A3DTKO    ANDNE'D'
     C           KSKBN     IFEQ A3KSNK
     C           A3KMIN    IFEQ A3KMAX
     C                     GOTO SP1
     C                     END
     C                     END
     C                     END
     C                     MOVE *BLANK    A3DOUT
     C                     MOVE 'Y'       A3KOUT
     C           SP1       TAG
      *
     C*------------------------------------*
     C*     ...計画通知書マスター...     *
     C*------------------------------------*
     C                     SETOF                     30
     C           KKEY      CHAINAAUPL011             30
     C           *IN30     IFEQ '0'
     C           J1SKJY    ANDEQ'D'
     C           J1SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
      *
     C           J1LIST    IFEQ '#'
     C                     Z-ADD1         J1KOSN
     C                     MOVE *BLANK    J1LIST
     C                     MOVE *BLANK    J1MCDH
     C                     MOVE *BLANK    J1KUBH
     C                     MOVE *BLANK    J1MEKH
     C                     MOVE *BLANK    J1TSZH
     C                     MOVE *BLANK    J1KAZH
     C                     MOVE *BLANK    J1KATH
     C                     MOVE *BLANK    J1SOZH
     C                     MOVE *BLANK    J1ZANH
     C                     MOVE *BLANK    J1BOZH
     C                     MOVE *BLANK    J1MKLH
     C                     MOVE *BLANK    J1YKLH
     C                     MOVE *BLANK    J1GEKH
     C                     MOVE *BLANK    J1SYSH
     C                     MOVE *BLANK    J1JOKH
     C                     MOVE *BLANK    J1HBNH
     C                     MOVE *BLANK    J1KOBH
     C                     MOVE *BLANK    J1KTRH
     C                     MOVE *BLANK    J1KH
     C                     MOVE *BLANK    J1TAHH
     C                     MOVE *BLANK    J1SYHH
     C                     MOVE *BLANK    J1TRHH
     C                     MOVE *BLANK    J1GEHH
     C                     Z-ADD0         JTU
     C                     END
      *
     C           J1KOSN    IFNE 2
      *
     C           A3BARA    IFNE J1MKLT
     C                     MOVE '*'       J1MKLH
     C                     Z-ADDJ1MKLT    J1MKLO
     C           J1MKLO    IFNE 0
      *
     C                     SETOF                     25
     C           'BZ '     LOKUPJ1KO                     25
     C           *IN25     IFEQ '1'
     C*                    Z-ADD1         J1TU24
     C                     END
     C                     END
     C                     END
      *
     C           JOKXX     IFNE JJOKXX
     C                     MOVE '*'       J1JOKH
     C                     MOVE *BLANK    J1JKO
     C                     MOVE *BLANK    J1JCO
     C                     MOVE JJOKXX    J1JKOX
     C                     MOVE JJKCXX    J1JCOX
     C                     END
     C                     END
      *
     C                     Z-ADDA3BARA    J1MKLT
      *
     C                     Z-ADD1         I
     C           1         DO   6         I
     C           JOK,I     IFNE *BLANK
     C                     MOVE *BLANK    JJOKAL
     C                     MOVE *BLANK    JJKCAL
     C                     MOVE JOK,I     JJOK,I
     C                     MOVE 'C'       JJKC,I
     C                     END
     C                     END
      *
     C                     UPDATAAUPL011
     C                     END
      *
     C                     Z-ADDKSKBN     A3KSNK
     C                     END
      *
     C                     MOVELUSER      A3KOME
     C                     Z-ADD*DATE     A3KOHZ
     C                     TIME           WTIME
      *
     C           A3DTKO    IFEQ '0'
     C                     MOVE 'D'       A3SKJY
     C                     Z-ADD*DATE     A3SKHZ
     C                     Z-ADD0         ZMKSNK  10
     C                     MOVE '*'       A3DTHE
     C                     Z-ADDA3UKBI    A3TKBI
     C                     Z-ADDA3TKYY    ZTKYY
     C                     Z-ADDA3TKMM    ZTKMM
     C                     Z-ADDA3TKDD    ZTKDD
     C                     Z-ADDA3TBIN    ZTBIN
%0001C                     EXSR #SUB1
%0001C           CHK       IFEQ *BLANK
     C                     Z-ADDA3KALL    @3KALL  30
     C                     Z-ADDA3KAIS    @3KAIS  30
     C                     Z-ADDA3KMIN    @3KMIN  30
     C                     Z-ADDA3KMAX    @3KMAX  30
     C                     Z-ADDA3SRMS    @3SRMS  30
     C                     Z-ADDA3ALHK    @3ALHK  30
     C                     Z-ADDA3MXHK    @3MXHK  30
     C                     Z-ADDA3JDMS    @3JDMS  30
     C                     EXCPTDT
     C                     EXCPTDTZ
%0001C                     END
     C                     UPDATAAFPL031
TCHK1 *
TCHK1 *
     C                     EXSR SUB4
     C                     GOTO STP2
     C                     ELSE
      *
     C           A3DTKO    IFNE '6'
     C           A3DTKO    ANDNE'2'
     C           A3DTKO    ANDNE'D'
     C           A3UKHZ    ANDLE*DATE
     C           A3DTKO    IFNE 'E'
     C                     MOVE '1'       A3DTKO
     C                     END
     C                     MOVE '*'       A3DTHE
     C                     UPDATAAFPL031
     C                     EXSR #SBTYO
TCHK1 *
TCHK1 *
     C                     ELSE
      *
     C**  ﾇﾞx]ﾍlﾑchﾎﾞ]  **
     C           A3DTKO    IFEQ '2'
     C           A3DTKO    OREQ 'D'
      *
     C                     Z-ADD2         ZMKSNK
     C           A3DTKO    IFEQ 'D'
     C                     Z-ADD3         ZMKSNK
     C                     END
     C                     Z-ADD0         A3TKBI
%0001C                     EXSR #SUB1
%0001C           CHK       IFEQ *BLANK
     C                     EXCPTDTZ
%0001C                     END
     C                     ELSE
      *
     C                     SETON                     51
     C                     MOVE A3ZMEN    ZZZMEN  1
     C                     Z-ADD0         A3TKBI
     C                     END
      *
%0001C                     EXSR #SUB1
%0001C           CHK       IFEQ *BLANK
     C                     Z-ADDA3KALL    @3KALL
     C                     Z-ADDA3KAIS    @3KAIS
     C                     Z-ADDA3KMIN    @3KMIN
     C                     Z-ADDA3KMAX    @3KMAX
     C                     Z-ADDA3SRMS    @3SRMS
     C                     Z-ADDA3ALHK    @3ALHK
     C                     Z-ADDA3MXHK    @3MXHK
     C                     Z-ADDA3JDMS    @3JDMS
     C                     EXCPTDT
%0001C                     END
     C           A3DTKO    IFNE 'E'
     C           A3DTKO    IFEQ 'D'
     C                     MOVE 'E'       A3DTKO
     C                     ELSE
     C                     MOVE '1'       A3DTKO
     C                     END
     C                     END
     C                     MOVE '*'       A3DTHE
     C                     Z-ADDA3UKBI    A3TKBI
     C                     UPDATAAFPL031
     C                     EXSR #SBTYO
TCHK1 *
      *
     C           *IN51     IFEQ '1'
     C           ZZZMEN    IFEQ *BLANK
     C                     Z-ADD3         ZMKSNK
     C                     ELSE
      *
     C           ZZZMEN    IFEQ '4'
     C                     Z-ADD4         ZMKSNK
     C                     Z-ADD0         @MAKB   40
     C                     MOVE *BLANK    @KCD1   1
     C                     MOVE *BLANK    @SW1    1
      *
     C           KEYA      SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEYA      READEACAPL111                 02
     C           *IN02     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     02
     C                     MOVE '*'       @SW1
     C                     Z-ADDI1BMON    @MAKB
     C                     MOVE I1KCD1    @KCD1
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           @SW1      IFEQ *BLANK
     C                     Z-ADD8990      @MAKB
     C                     ELSE
      *
     C           KEYB      CHAINACAPL111             03
     C           *IN03     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
     C           *IN03     IFEQ '0'
     C                     Z-ADDI1BMON    @MAKB
     C                     ELSE
      *
     C           @MAKB     IFEQ 8907
     C           @KCD1     IFNE '0'
     C                     Z-ADD8990      @MAKB
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD@MAKB     ZSTYM
     C                     Z-ADD0         ZSTDD
     C                     Z-ADD0         ZSBIN
     C                     ELSE
      *
     C                     Z-ADD1         ZMKSNK
     C                     END
     C                     END
      *
%0001C                     EXSR #SUB1
%0001C           CHK       IFEQ *BLANK
     C                     EXCPTDTZ
%0001C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD0         BANGO
     C                     MOVE 'UPDATED 'WCM,A
     C                     GOTO STP2
      *
     C*------------------------------------------------------*
     C*     ...転送マスターデータファイル　の　追加...     *
     C*------------------------------------------------------*
     C           END       TAG
     C                     CLOSEOUTPUT
      *
     C                     CALL 'AAFC02'
     C                     PARM           PFILE
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C*--------------------------------------*
     C*     ...画面のセット　（１）...     *
     C*--------------------------------------*
     C           SUB1      BEGSR
     C                     SETOF                     30
     C                     Z-ADD1         J
     C           A3DTKO    LOKUPCMT1,J                   30
     C   30                MOVE CMT2,J    WCM,I
     C                     MOVE A31HB5    WSHN1
     C                     MOVE A32HB5    WSHN2
     C                     MOVE A33HB2    WSHN3
     C                     MOVE DSDI      WDI,I
     C                     MOVE A3ATK1    WATK1
     C                     MOVE A3ATK2    WATK2
     C                     MOVE A3ATK3    WATK3
     C                     MOVE A3ATK4    WATK4
     C                     MOVE DSPL      WPL,I
     C                     MOVE DSKT      WKT,I
     C                     Z-ADDA3UKHZ    WAUHZ
     C                     Z-ADDA3UBIN    WAUBI
     C                     MOVE DSFR      WFR,I
     C                     MOVE DSTO      WTO,I
     C                     MOVE DSKEY     KEY,I
     C                     ENDSR
      *
     C*--------------------------------*
     C*     ...ＲＯＬＬ－ＵＰ...     *
     C*--------------------------------*
     C           SUB2      BEGSR
     C                     Z-ADD0         BANGO
     C           KEY,7     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO RL1E
     C                     END
     C                     Z-ADD0         I
     C                     Z-ADDWNO,7     XXNO    50
     C                     MOVELKEY,7     DSKEY
     C           NO        IFEQ '1'
     C           HAKEY2    SETGTAAFTL021
     C                     ELSE
     C           KEY1      SETGTAAFPL031
     C                     END
     C                     DO   *HIVAL
     C           NO        IFEQ '1'
     C                     READ AAFTL021                 99
     C   99                GOTO RL1E
     C                     SETOF                     30
     C           A3DTHE    COMP *BLANK                   30
     C           *IN30     IFEQ '0'
     C                     SETON                     99
     C                     GOTO RL1E
     C                     END
     C                     ELSE
     C                     READ AAFPL031                 99
     C   99                GOTO RL1E
     C           AATKR     COMP A3ATKR               9999
     C   99                GOTO RL1E
     C                     END
     C                     ADD  1         I
     C           I         IFEQ 1
     C                     Z-ADD0         WNO
     C                     MOVE *BLANK    WCM
     C                     MOVE *BLANK    WDI
     C                     MOVE *BLANK    WPL
     C                     MOVE *BLANK    WKT
     C                     MOVE *BLANK    WFR
     C                     MOVE *BLANK    WTO
     C                     MOVE *BLANK    KEY
     C                     END
     C           I         CABGT7         RL1E
     C           XXNO      ADD  I         WNO,I
     C                     EXSR SUB1
     C                     END
     C           RL1E      TAG
     C                     ENDSR
      *
     C*------------------------------------*
     C*     ...ＲＯＬＬ－ＤＯＷＮ...     *
     C*------------------------------------*
     C           SUB3      BEGSR
     C                     Z-ADD0         BANGO
     C           KEY,1     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO RL2E
     C                     END
      *
     C*----------------------------------*
     C*     ...画面　の　セット...     *
     C*----------------------------------*
     C                     Z-ADD8         I
     C                     Z-ADDWNO,1     XXNO
     C                     MOVE KEY,1     DSKEY
     C           NO        IFEQ '1'
     C           HAKEY2    SETLLAAFTL021
     C                     ELSE
     C           KEY1      SETLLAAFPL031
     C                     END
     C                     DO   *HIVAL
     C           NO        IFEQ '1'
     C                     READPAAFTL021                 99
     C   99                GOTO RL2E
     C                     SETOF                     30
     C           A3DTHE    COMP *BLANK                   30
     C           *IN30     IFEQ '0'
     C                     SETON                     99
     C                     GOTO RL2E
     C                     END
     C                     ELSE
     C                     READPAAFPL031                 99
     C   99                GOTO RL2E
     C           AATKR     COMP A3ATKR               9999
     C   99                GOTO RL2E
     C                     END
     C                     SUB  1         I
     C           I         IFEQ 7
     C                     Z-ADD0         WNO
     C                     MOVE *BLANK    WCM
     C                     MOVE *BLANK    WDI
     C                     MOVE *BLANK    WPL
     C                     MOVE *BLANK    WKT
     C                     MOVE *BLANK    WFR
     C                     MOVE *BLANK    WTO
     C                     MOVE *BLANK    KEY
     C                     END
     C           I         CABLT1         RL2E
     C           XXNO      SUB  1         WNO,I
     C                     Z-ADDWNO,I     XXNO
     C                     EXSR SUB1
     C                     END
     C           RL2E      TAG
     C                     ENDSR
      *
     C*--------------------*
     C*   A3DTKO -取消   *
     C*--------------------*
     C           SUB4      BEGSR
     C                     Z-ADD0         WNO
     C                     MOVE *BLANK    WCM
     C                     MOVE *BLANK    WDI
     C                     MOVE *BLANK    WPL
     C                     MOVE *BLANK    WKT
     C                     MOVE *BLANK    WFR
     C                     MOVE *BLANK    WTO
     C                     MOVE *BLANK    KEY
     C                     Z-ADD0         BANGO
     C                     Z-ADD0         I
     C           NO        IFEQ '1'
     C           *LOVAL    SETLLAAFTL021
     C                     ELSE
     C           KEY1      SETLLAAFPL031
     C                     END
     C                     DO   *HIVAL
     C           NO        IFEQ '1'
     C                     SETOF                     30
     C                     READ AAFTL021                 30
     C   30                GOTO SB1
     C           A3DTHE    COMP *BLANK                   30
     C  N30                GOTO SB1
     C                     ELSE
     C                     SETOF                     30
     C                     READ AAFPL031                 30
     C   30                GOTO SB1
     C           AATKR     COMP A3ATKR                   30
     C  N30                GOTO SB1
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     GOTO SB1
     C                     END
     C                     END
     C                     ADD  1         I
     C           I         CABGT7         SB1
     C                     Z-ADDI         WNO,I
     C                     EXSR SUB1
     C                     END
     C           SB1       TAG
     C           I         IFEQ 0
     C                     SETON                     99
     C                     MOVE ER,40     MSG
     C                     END
     C                     ENDSR
      *
     C*--------------------------------------*
     C*     ...画面のセット　（２）...     *
     C*--------------------------------------*
     C           SET2      BEGSR
     C                     SETOF                     31
     C           KEY1      CHAINAAFPL031             31
      *
     C                     Z-ADDA3SSYS    USSYS   50
     C                     MOVE A3SSYT    USSYT   1
     C                     Z-ADDA3CBKO    UCBKO   20
     C                     Z-ADDA3BARA    UBARA   20
     C                     Z-ADDA3BARB    UBARB   21
     C                     MOVE A3RAIN    URAIN   1
     C                     Z-ADDA3YOSI    UYOSI   20
     C                     Z-ADDA3KASI    UKASI   72
     C                     MOVE A3MTYP    UMTYP   1
     C                     MOVE A3ATYP    UATYP   1
     C                     MOVE A3JOK1    UJOK1   2
     C                     MOVE A3JOK2    UJOK2   2
     C                     MOVE A3JOK3    UJOK3   2
     C                     MOVE A3JOK4    UJOK4   2
     C                     MOVE A3JOK5    UJOK5   2
     C                     MOVE A3JOK6    UJOK6   2
      *
     C           A3DOUT    IFEQ 'Y'
     C                     Z-ADDA3KMAX    A3KAIS
     C                     END
      *
     C                     Z-ADDA3KMAX    WKMAX
     C                     Z-ADDA3KSNK    KSKBN
     C                     MOVE *BLANK    WSTI1
     C                     MOVE A3STI1    WSET
     C                     MOVE WCM,I     KOSN
     C                     MOVE A31HB5    WSHN1
     C                     MOVE A32HB5    WSHN2
     C                     MOVE A33HB2    WSHN3
     C                     MOVE DSDI      SHIN
     C                     MOVE DSKT      ATOK2
     C                     MOVE A3ATK1    WATK1
     C                     MOVE A3ATK2    WATK2
     C                     MOVE A3ATK3    WATK3
     C                     MOVE A3ATK4    WATK4
     C                     MOVE DSPL      ATKR
     C                     MOVE MAEK1     MAEK2
     C                     MOVE A3ZMEN    ZMEN
     C                     MOVE *BLANK    A3ZMEN
     C                     Z-ADDA3ATOH    WATOH
     C                     Z-ADDA3MAEH    WMAEH
     C                     MOVE A3YOSI    WYOSI
      *
     C           WYOSI     IFEQ '00'
     C                     MOVE *BLANK    WYOSI
     C                     END
      *
     C*----------------------------------*
     C*  ..社内かんばん切替マスター..  *
     C*----------------------------------*
     C                     SETOF                     30
     C                     Z-ADD0         HMKC
     C                     MOVE *BLANK    WMKCK   1
     C           BKY       CHAINAAMPL111             30
     C           *IN30     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
      *
     C                     Z-ADD1         U       20
     C                     Z-ADD0         V       20
     C                     Z-ADD0         HKBM
     C                     MOVE *BLANK    HTKR
     C                     MOVE *BLANK    HKAB
     C           1         DO   15        U
     C           NUKH,U    IFNE 0
     C           NKBM,U    IFNE 0
     C                     ADD  1         V
     C                     Z-ADDNKBM,U    HKBM,V
     C                     MOVE NTKR,U    HTKR,V
     C                     MOVE NKAB,U    HKAB,V
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD1         U
     C                     Z-ADD16        V
     C                     Z-ADD0         W       20
     C                     MOVE *BLANK    WKTCK   1
     C           1         DO   15        U
     C                     SETOF                     30
     C                     SUB  1         V
     C           WKTCK     IFEQ *BLANK
     C           HKAB,V    IFEQ 'C'
     C                     MOVE '*'       WKTCK
     C                     END
     C                     ELSE
      *
     C           HTKR,V    IFEQ '------'
     C           HTKR,V    OREQ '++++++'
     C                     ADD  1         W
     C                     MOVE '*'       WMKCK
     C                     Z-ADDHKBM,V    HMKC,W
     C                     ELSE
     C                     SETON                     30
     C                     END
     C                     END
     C  N30                END
     C                     END
      *
     C*----------------------*
     C*  ..部品マスター..  *
     C*----------------------*
     C                     SETOF                     30
     C                     Z-ADD0         KASI
     C                     MOVE *BLANK    A2MEKI
     C                     MOVE *BLANK    A3ZETI
     C                     MOVE *BLANK    A3HINM
     C           BKY       CHAINFCEPL011             30
     C           *IN30     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    IFLE *DATE
     C                     GOTO BSP1
     C                     END
     C                     END
     C                     Z-ADDA2KASI    KASI
     C                     MOVE A2ZETI    A3ZETI
     C                     MOVELA2DMEI    A3HINM
     C           A3DTKO    IFEQ '2'
     C           A3DTKO    OREQ 'D'
     C                     Z-ADDA2KASI    A3KASI
     C                     END
     C           BSP1      TAG
     C                     END
      *
     C*------------------------------*
     C*     ...かんばん調整...     *
     C*------------------------------*
     C                     Z-ADDA3KALL    WKALL   50
     C                     Z-ADDA3KMIN    WMIN    50
     C                     Z-ADDA3KMAX    WMAX    50
     C           A3KALL    IFLT A3KMAX
     C                     Z-ADDA3KMAX    WALL    50
     C                     ELSE
     C                     Z-ADDA3KALL    WALL
     C                     END
     C                     MOVE *BLANK    SETNM
     C                     MOVE *BLANK    KCDNM
     C                     MOVE *BLANK    NMA
     C                     MOVE *BLANK    NMB
     C                     MOVE *BLANK    JNM
      *
     C***  ﾈｮmbuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           A3STI1    CHAINAABPL011             30
     C  N30      A4SKJY    IFEQ 'D'
     C           A4SKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELA4SETN    SETNM
      *
     C**  f]ﾌﾞ]ﾆｬﾓbuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           GCKEY1    CHAINGCMPL311             30
     C  N30      T3SKJY    IFEQ 'D'
     C           T3SKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELT3NAMN    KCDNM
      *
     C**  ﾎﾞy]xbﾆｭcuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           GCKEY2    CHAINAATPL011             30
     C  N30      DCSKJY    IFEQ 'D'
     C           DCSKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELDCNAMN    NMA
      *
     C**  ﾎﾞy]xbﾆｭcuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C           GCKEY3    CHAINAATPL011             30
     C  N30      DCSKJY    IFEQ 'D'
     C           DCSKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELDCNAMN    NMB
      *
     C**  nﾃﾜﾌﾞ]k gﾉcuﾇjｰ ﾉ kｩｮh  **
     C                     SETOF                     30
     C                     Z-ADD0         A3SHIY
     C                     MOVE *BLANK    XYOSI
     C           KEYQ      CHAINAAQPL011             30
     C  N30      DBSKJY    IFEQ 'D'
     C           DBSKHZ    COMP *DATE                  3030
     C                     END
     C           *IN30     IFEQ '0'
     C                     Z-ADDDBSHIY    A3SHIY
     C                     MOVE DBYOSI    XYOSI
     C           A3DTKO    IFEQ '2'
     C           A3DTKO    OREQ 'D'
     C                     MOVE DBYOSI    WYOSI
     C                     END
     C                     END
      *
     C**  ﾆﾞｭci]xb ﾉ ﾈｮn  **
     C                     Z-ADD1         I
     C           1         DO   6         I
     C                     MOVE 'C'       WJKB    1
     C           JOK,I     IFNE *BLANK
     C                     MOVE JOK,I     WJKN    2
     C                     SETOF                     30
     C           AAKEY     CHAINAAAPL011             30
     C           *IN30     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELA5JOKM    JNM,I
     C                     END
     C                     END
     C                     END
     C           ST2E      TAG
     C                     ENDSR
%0001C*--------------------------------------------------------------*
      *社内かんばん切替マスターより自工程後にA-PICSかんばん有りか*
      *--------------------------------------------------------------*
     CSR         #SUB1     BEGSR
     C           WKEY      KLIST
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
      *
     C                     MOVE *BLANK    KHIN1   5
     C                     MOVE *BLANK    KHIN2   5
     C                     MOVE *BLANK    KHIN3   2
      *
     C                     MOVELA31HB5    KHIN1
     C                     MOVELA32HB5    KHIN2
     C                     MOVELA33HB2    KHIN3
     C                     MOVE *BLANK    CHK     1
     C                     Z-ADDA3UKHZ    A3UK
     C                     Z-ADDA3STHZ    A3ST
%04  C                     MOVE *BLANK    @KT              工程
 |   C                     Z-ADD0         $KTSU   20
%04  C                     MOVE ' '       $LOQ    1        "LOQ"あり
      *
     C                     SETOF                     77
     C           WKEY      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         #X      20
     C                     Z-ADD0         @X      20
     C                     Z-ADDA3UBIN    WUBIN
     C                     Z-ADDA3SBIN    WSBIN
      *
     C           1         DO   15        #X
     C           NUKH,#X   IFGE A3UKHB
     C           NUKH,#X   ANDLTA3STHB
     C                     ADD  1         @X
     C                     MOVE NKAB,#X   @KS,@X
     C                     MOVE NTKR,#X   @TK,@X
%04  C                     MOVE NKOT,#X   @KT,@X           工程
     C                     ELSE
     C                     ADD  1         @X
     C                     MOVE OKAB,#X   @KS,@X
     C                     MOVE OTKR,#X   @TK,@X
%04  C                     MOVE OKOT,#X   @KT,@X           工程
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD1         $X      20
     C           A3ATKR    LOKUP@TK,$X                   88
%04  C                     Z-ADD$X        $Z      20
      *
     C                     ADD  1         $X
     C                     Z-ADD$X        #X      20
     C           @X        IFNE 0
     C           $X        DO   @X        #X
     C           @KS,#X    IFNE *BLANK
      *
     C           @KS,#X    IFEQ 'C'
     C           @KS,#X    OREQ 'D'
     C           @KS,#X    OREQ 'E'
     C           @KS,#X    OREQ '0'
     C           @KS,#X    OREQ 'F'
     C                     MOVE '*'       CHK
     C                     END
      *
     C                     END
     C                     ENDDO
     C                     END
%04   *
 |   C                     Z-ADD1         $KTSU   20
 |   C   88                DO   *HIVAL                     工程数
 |   C           @KT,$Z    IFEQ 'LOQ'                      工程
 |   C                     MOVE '*'       $LOQ             "LOQ"あり
 |   C                     ENDIF
 |   C                     SUB  1         $Z
 |   C           $Z        IFLE 0
 |   C                     LEAVE
 |   C                     ENDIF
 |   C           @TK,$Z    IFEQ '------'
 |   C                     ADD  1         $KTSU
 |   C                     ELSE
 |   C                     LEAVE
 |   C                     ENDIF
%04  C                     ENDDO
      *
     C                     END
     C                     END
%0001CSR         #ESUB1    ENDSR
%04   *----------------------------------------------------------------
 |    *         条件の入力数のチェック
 |    *----------------------------------------------------------------
 |   C           #JOK      BEGSR
 |   C                     Z-ADD0         $INSU   20       入力数
 |    *
 |   C           A3JOK1    IFNE *BLANK
 |   C                     ADD  1         $INSU
 |   C                     ENDIF
 |   C           A3JOK2    IFNE *BLANK
 |   C                     ADD  1         $INSU
 |   C                     ENDIF
 |    *
 |   C           A3KCD2    IFNE 'Z'
 |   C           $KTSU     IFGE 1
 |   C                     SUB  1         $KTSU            工程数
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
 |   C                     SELEC
 |   C           $KTSU     WHGE 2                          工程数
 |   C           $INSU     IFNE 2
 |   C                     SETON                     161799
 |   C                     MOVE ER,59     MSG
 |   C                     ENDIF
 |   C                     OTHER
 |   C           $KTSU     IFNE $INSU                      工程数
 |   C                     SETON                     161799
 |   C                     MOVE ER,59     MSG
 |   C                     ENDIF
 |   C                     ENDSL
 |    *
%04  C                     ENDSR
      *----------------------------------------------------*
      *   表面処理コードチェック   MSK 99.07.27          *
      *----------------------------------------------------*
     CSR         $SB900    BEGSR
      *
     C                     SETOF                       89
     C           BKY       CHAINFCEPL011             89
     C           *IN89     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    IFLE *DATE
     C                     SETON                     89
     C                     END
     C                     END
      *
     C           *IN89     IFEQ '0'
     C           A3RAIN    ANDEQ'C'
     C           MEK13     IFNE '.'
TCHK2C           MEK13     ANDNE'M'
     C           MEK13     ANDNE'0'
     C                     SETON                     6799
     C                     END
     C                     END
      *
     CSR         $S900E    ENDSR
      *----------------------------------------------------*
      *   表面処理コードチェック   T.SAKA 2013.03.05     *
      *----------------------------------------------------*
     CSR         $SB901    BEGSR
      *
     C                     SETOF                       89
     C           BKY       CHAINFCEPL011             89
     C           *IN89     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    IFLE *DATE
     C                     SETON                     89
     C                     END
     C                     END
      *
     C           *IN89     IFEQ '0'
     C           A3RAIN    ANDEQ'D'
     C           MEK13     IFNE '.'
     C           MEK13     ANDNE'0'
     C           MEK13     ANDNE'2'
     C                     SETON                     6799
     C                     END
     C                     END
      *
     CSR         $S901E    ENDSR
      *----------------------------------------------------*
      *   表面処理コードチェック   K.IWATA 2015.10.24    *
      *----------------------------------------------------*
     CSR         $SB902    BEGSR
      *
     C                     SETOF                       89
     C           BKY       CHAINFCEPL011             89
     C           *IN89     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    IFLE *DATE
     C                     SETON                     89
     C                     END
     C                     END
      *
     C           *IN89     IFEQ '0'
     C           A3RAIN    ANDEQ'E'
     C           MEK13     IFNE '.'
     C           MEK13     ANDNE'0'
     C           MEK13     ANDNE'2'
     C                     SETON                     6799
     C                     END
     C                     END
      *
     CSR         $S902E    ENDSR
TCHK1C* ----------------------------------------------------
      *------------------------------------*
      *安全在庫理由                      *
      *------------------------------------*
     CSR         #SBTYO    BEGSR
      *
     C                     MOVELA3ATK1    P3ATK1
     C                     MOVELA3ATK2    P3ATK2
     C                     MOVELA3ATK3    P3ATK3
     C                     MOVELA3ATK4    P3ATK4
     C                     MOVELA3UKYY    P3UKYY
     C                     MOVELA3UKMM    P3UKMM
     C                     MOVELA3UKDD    P3UKDD
     C                     MOVELA3UBIN    P3UBIN
     C                     CALL 'ANZR99'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
      *
     CSR         ESBTYO    ENDSR
TCHK1C*-----------------------------------------------------
     OOUTPUT  EADD             DT
     O                                    2 'MK'
     O                         A3SKJY     3
     O                         A3SKYY     7
     O                         A3SKMM     9
     O                         A3SKDD    11
     O                         A3KOYY    15
     O                         A3KOMM    17
     O                         A3KODD    19
     O                         A3KOHH    21
     O                         A3KOSS    23
     O                         A3KOME    33
     O                         A31HB5    38
     O                         A32HB5    43
     O                         A33HB2    45
     O                         A3TKYY    49
     O                         A3TKMM    51
     O                         A3TKDD    53
     O                         A3TBIN    55
     O                         A3UKYY    59
     O                         A3UKMM    61
     O                         A3UKDD    63
     O                         A3UBIN    65
     O                         A3STYY    69
     O                         A3STMM    71
     O                         A3STDD    73
     O                         A3SBIN    75
     O                         A3ATOK    78
     O                         A3ATOB    82
     O                         A3ATYP    83
     O                         A3ATOH    84
     O                         A3ATK1    85
     O                         A3ATK2    87
     O                         A3ATK3    89
     O                         A3ATK4    90
     O                         A3MAEK    93
     O                         A3MAKB    97
     O                         A3MTYP    98
     O                         A3MAEH   100
     O                         A3MTK1   101
     O                         A3MTK2   103
     O                         A3MTK3   105
     O                         A3MTK4   106
     O                         A3KCD1   107
     O                         A3KCD2   108
     O                         A3STI1   110
     O                         A3JOK1   112
     O                         A3JOK2   114
     O                         A3JOK3   116
     O                         A3JOK4   118
     O                         A3JOK5   120
     O                         A3JOK6   122
     O                         A3JOK7   124
     O                         A3JOK8   126
     O                         A3YOSI   128
     O                         A3MEKI   135
     O                         A3CBKO   137
     O                         A3MAXH   140
     O                         A3SSYS   145
     O                         A3SSYT   146
     O                         A3BARA   148
     O                         A3BARB   150
     O                         A3RAIN   151
     O                         A3LOTO   153
     O                         A3READ   156
     O                         A3KEIS   159
     O                         A3KASI   166
     O                         A3ZMEN   167
     O                         A3ZETI   171
     O                         A3KSNK   172
     O***                      A3KALL   175
     O***                      A3KAIS   178
     O***                      A3KMIN   181
     O***                      A3KMAX   184
     O***                      A3SRMS   187
     O***                      A3ALHK   190
     O***                      A3MXHK   193
     O                         @3KALL   175
     O                         @3KAIS   178
     O                         @3KMIN   181
     O                         @3KMAX   184
     O                         @3SRMS   187
     O                         @3ALHK   190
     O                         @3MXHK   193
     O                         A3KSHK   194
     O                         A3KTSU   203
     O                         A3KSSU   212
     O                         A3KOUT   213
     O                         A3DOUT   214
     O                         A3DTKO   215
     O                         A3DTHE   216
     O***                      A3JDMS   219
     O                         @3JDMS   219
     O                         A3SHIY   221
     O                         A3HINM   226
     O        EADD             DTZ
     O                                    2 'ZM'
     O                         ZMKSNK     3
     O                         Z1HB5      8
     O                         Z2HB5     13
     O                         Z3HB2     15
     O                         ZTKYY     19
     O                         ZTKMM     21
     O                         ZTKDD     23
     O                         ZTBIN     25
     O                         ZSTYY     29
     O                         ZSTMM     31
     O                         ZSTDD     33
     O                         ZSBIN     35
     O                         ZUKYY     39
     O                         ZUKMM     41
     O                         ZUKDD     43
     O                         ZUBIN     45
     O                         ZMAKB     50
     O                         ZKCD1    103
**  ER (ERROR-MESSAGE)
E-01 NO. IS THE FIRST - THE SECOND
E-02 THERE IS NOT DATA WHICH IS INQUIRED TO
E-03 INPUT UPDATE NUMBER DISPLAYED
E-04 THERE IS NOT DATA OF SUCCESSION
E-05 THERE IS NOT DATA WHICH GOES AHEAD OF
E-06 LOCATION ISN'T INPUT
E-07 EFFECTIVE DAY ISN'T INPUT
E-08 EFFECTIVE DAY-BIN ISN'T INPUT
E-09 IT IS NOT INPUT IN M/F
E-10 FIXED SETTING NUMBER ISN'T INPUT
E-11 ACCOMODATED QUANTITY ISN'T INPUT
E-12 ACCOMODATED QUANTITY UNIT ISN'T INPUT
E-13 SETTING CODE ISN'T INPUT
E-14 THERE IS NOT SETTING CODE IN SETTING M/F
E-15 L.T ISN'T INPUT
E-16 COEFFICIENT ISN'T INPUT
E-17 THERE ISN'T KANBAN KIND M/F
E-18 PAPER ISN'T INPUT
E-19 PRESENT PROCESS DEPARTMENT TYPE ISN'T INPUT
E-20 PRESENT PROCESS DPTM. TYPE IS NOT IN DPTM. LT M/F
E-21 PRECEDING PROCESS DEPARTMENT TYPE ISN'T INPUT
E-22 PRECEDING PROCESS DPTM. TYPE IS NOT IN DPTM. LT M/F
E-23 EFFECTIVE DAY ISN'T RIGHT
E-24 CONDITION CODE THAT REVERSING IS NOT IN M/F
E-25 CONDITION CODE THAT REVERSING REPEATS
E-26 KANBAN IS MADE ON OLD DAYS SO THAT IT REMAKE ALL
E-27 PRESENT PROCESS DEPARTMENT IS NOT IN BAR CODE M/F
E-28 PRECEDING PROCESS DEPARTMENT IS NOT IN BAR CODE M/F
E-29 SETTING CODE HAVE TO BE NUMBER
E-30 THE POINT THAT REVERSING MUST BE NUMBER
E-31 COMPLETION UNIT WEIGHT ISN'T INPUT
E-32 INPUT THE SORT INSTRUCTION IN LOCATION FUNCTION M/F
E-33 BARREL B IS BIGGER THAN BARREL A
E-34 BARREL A MUST BE A MULTIPLE OR THE SAME AS BARREL B
E-35 BARREL A ISN'T INPUT
E-36 BARREL B ISN'T INPUT
E-37 DROWING NECESSARY INSTRUCTION (BLANK 1 4)
E-38 NUMBER OF KANBAN SHEETS MUST BE LESS THAN 9999.
E-39 KANBAN CONTENTS WAS CHANGED, SO THAT CHG EFFECTIVE DAY
E-40 THE DATA WHICH IS INQUIRED TO IS CANCELLED ALREADY
E-41 LOCATION IS WRONG
E-42 PAPER CODE IS DIFFERENT FROM CODE OF THE LOWER
E-43 WHEN PRESENT PROC. IS THREE BOND, KANBAN KIND(S) IS 'Z'
E-44 WHEN KANBAN KIND(S)='Z', PRESENT PROCESS IS THREE BOND
E-45 COMPLETION UNIT WEIGHT IS DIFFERENT FROM PART M/F
E-46 THE CONDITION THAT REVERSING ISN'T INPUT
E-47 THE CONDITION THAT REVERSING CAN INPUT ONLY 1
E-48 THE CONDITION THAT REVERSING CAN'T INPUT
E-49 INPUT EITHER OF 1 THAT REVERSING CONDITION
E-50
E-51 IS NOT '.' , '0' OR 'M' THIRD COLUMN OF SURFACE TREAT. OF LINE C
E-52 IS NOT '.' , '0' OR '2' THIRD COLUMN OF SURFACE TREAT. OF LINE D
E-53 LINE ISN'T INPUT
E-54
E-55
E-56 MAX #OF BOXS DIFFERENT W SAFETY INVENTORY
E-57 IS NOT '.' , '0' OR '2' THIRD COLUMN OF SURFACE TREAT. OF LINE E
E-58 THE BOX COLOR IS WRONG.
E-59 # OF CONDITION DOES NOT MATCH WITH # OF PROCESSES.
**  CMT1/CMT2 (COMMENT NAME)
0CANCEL                                               1
1UPDATED                                              2
2ADD                                                  3
3SET NBR                                              4
4                                                     5
5CHPD.DAY                                             6
6EFCT.DAY                                             7
7LAPS.DAY                                             8
8INCREASE                                             9
9DECREASE                                            10
ALOCATION                                            11
DKIND                                                12
EKIND CHG                                            13
