     H            Y.
     F** AAFR31 *******************************************
     F* PART M/F LIST  BY CONDITION SETTING
     F*          I-HASADA         86.10.16                *
     F* CHANGES(20199) T.TODA   2021.02.16                *
     F******************************************* AAFR31 **
     FAAFWP31 IP  F     120            DISK
     FAAMPL11 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     142     OF     PRINTER
     E                    BKOT       15  3               工程ﾎﾞﾍ]uﾇjｰ
     E                    BKBM       15  4 0             部門ﾎﾞﾍ]uﾇjｰ
     E                    OKOT       15  3               旧工程
     E                    OKBM       15  4 0             旧部門
     E                    NKOT       15  3               新工程
     E                    NKBM       15  4 0             新部門
     E                    NUKH       15 10 0             かんばん切替日
     E                    KOT        15  3
     E                    KBM        15  4 0
     E                    NAM        13  8
     IAAFWP31 AA  08
     I                                        1   5 FBHB1
     I                                        6  10 FBHB2
     I                                       11  12 FBHB3           36
     I                                       62  62 FTKR1
     I                                       63  64 FTKR2           14
     I                                       65  66 FTKR3           15
     I                                       67  67 FTKR4           16
     I                                       68  741FHK
     I                                       75  801FGK
     I                                       81  831FCD
     I                                       84  920FSRYO
     I                                       93  940FMM
     I                                       95 1011FZU
     I                                      111 1150FKENS
     I                                      116 116 FKDAI
     I                                      117 117 FKSYO
     I            DS
     I                                        1  45 BKOT
     I                                        1   3 A2KOT1
     I                                        4   6 A2KOT2
     I                                        7   9 A2KOT3
     I                                       10  12 A2KOT4
     I                                       13  15 A2KOT5
     I                                       16  18 A2KOT6
     I                                       19  21 A2KOT7
     I                                       22  24 A2KOT8
     I                                       25  27 A2KOT9
     I                                       28  30 A2KO10
     I                                       31  33 A2KO11
     I                                       34  36 A2KO12
     I                                       37  39 A2KO13
     I                                       40  42 A2KO14
     I                                       43  45 A2KO15
     I            DS
     I                                        1  600BKBM
     I                                        1   40A2KBM1
     I                                        5   80A2KBM2
     I                                        9  120A2KBM3
     I                                       13  160A2KBM4
     I                                       17  200A2KBM5
     I                                       21  240A2KBM6
     I                                       25  280A2KBM7
     I                                       29  320A2KBM8
     I                                       33  360A2KBM9
     I                                       37  400A2KB10
     I                                       41  440A2KB11
     I                                       45  480A2KB12
     I                                       49  520A2KB13
     I                                       53  560A2KB14
     I                                       57  600A2KB15
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80FSKH1
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I                                       15  21 A2MEKI
     I                                       15  18 A2MEK1
     I                                       19  20 A2MEK2
     I                                       21  21 A2MEK3
     I                                       26  330B2SKHZ
     I                                       26  290B2SKYY
     I                                       30  310B2SKMM
     I                                       32  330B2SKDD
     I                                       34 274 PDATA
     I                                       34  36 FZAC1
     I                                       37  39 FZAC2
     I                                       40  42 FZAC3
     I                                       43  46 FZAC4
     I                                       47  50 FZAC5
     I                                       51  51 FZAC6
     I                                       52  53 FSKU1
     I                                       55  57 FSKU2
     I                                       58  59 FSKU3
     I                                       61  62 FSKU4
     I                                       64  65 FSKU5
     I                                       67  68 FSKU6
     I                                       70  762FSOZ1
     I                                       77  832FSOZ2
     I                                       84  902FKAZ1
     I                                       91  972FKAZ2
     I                                       98 1022FKSZ1
     I                                      103 1072FKSZ2
     I                                      108 1122FBOZ1
     I                                      113 1172FBOZ2
     I                                      118 1201FTOZ1
     I                                      121 1231FTOZ2
     I                                      124 1282FKUB1
     I                                      129 1332FKUB2
     I                                      134 1361FKIK1
     I                                      137 1391FKIK2
     I                                      140 146 FMEKI
     I                                      147 148 FHIM1
     I                                      149 149 FHIM2
     I                                      150 150 FHIM3
     I                                      151 152 FHIM4
     I                                      153 153 FHIM5
     I                                      154 154 FHIM6
     I                                      155 157 FKOT1
     I                                      158 161 FKBM1
     I                                      162 164 FKOT2
     I                                      165 168 FKBM2
     I                                      169 171 FKOT3
     I                                      172 175 FKBM3
     I                                      176 178 FKOT4
     I                                      179 182 FKBM4
     I                                      183 192 FNAM1
     I                                      193 202 FNAM2
     I                                      203 212 FNAM3
     I                                      213 222 FNAM4
     I                                      223 223 FTEHI
     I                                      224 225 FKTNO
     I                                      226 226 FSET
     I                                      227 2331FHK1
     I                                      234 2401FHK2
     I                                      241 2461FGK1
     I                                      247 2521FGK2
     I                                      253 2610FGKN1
     I                                      262 2700FGKN2
     I                                      271 271 FKD1
     I                                      272 272 FKD2
     I                                      273 274 NIJI
     C           KEY       KLIST
     C                     KFLD           FKDAI
     C                     KFLD           FKSYO
      *
     C           VKEY      KLIST
     C                     KFLD           FBHB1
     C                     KFLD           FBHB2
     C                     KFLD           FBHB3
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           PHIZK   6
     C                     PARM           PKUBN   20
     C           PDATA     PARM           WDATA 241
     C                     PARM           PMT     1
     C                     PARM           PJYU    1
     C                     MOVELPHIZK     WYM     60
      *
     C                     SETOF                     092101
     C                     SETOF                     232425
     C                     SETOF                     262728
     C                     SETOF                     293031
     C                     SETOF                     323334
     C                     SETOF                     400203
     C                     SETOF                     22
     C                     TIME           WTIME   60
     C   10                GOTO STP1
     C           US        CHAINRGAPL111             54
     C           *IN54     IFEQ '0'
     C           J8SKJY    IFEQ *BLANK
     C                     MOVELJ8NAME    WUS    15
     C                     MOVELJ8NAME    WNS     9
     C                     END
     C                     END
     C           PKUBN     COMP 01                       41
     C           PKUBN     COMP 02                       42
     C           PKUBN     COMP 03                       43
     C           PKUBN     COMP 04                       44
     C           PKUBN     COMP 05                       45
     C           PKUBN     COMP 06                       46
     C           PKUBN     COMP 07                       47
     C           PKUBN     COMP 08                       48
     C           PKUBN     COMP 09                       49
     C           PKUBN     COMP 10                       50
     C           PKUBN     COMP 11                       51
     C           PKUBN     COMP 12                       52
     C           PKUBN     COMP 13                       53
     C           PKUBN     COMP 14                       55
     C           PKUBN     COMP 15                       56
     C           PKUBN     COMP 16                       57
     C           FTEHI     COMP 'G'                      04
     C           FTEHI     COMP 'Z'                      05
     C           FTEHI     COMP 'A'                      06
     C           PMT       COMP 'M'                      90
     C                     SETON                     0910
     C           STP1      TAG
      *
     C                     SETOF                     01
     C                     MOVE *BLANK    KOT
     C                     Z-ADD0         KBM
     C           VKEY      CHAINAAMPL111             01
     C           *IN01     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLEUDATE
     C                     SETON                     01
     C                     END
     C           *IN01     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C                     MOVELNUKH,A    WUKH    60
     C           UDATE     IFLT WUKH
     C           OKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE OKOT,A    KOT,B
     C                     Z-ADDOKBM,A    KBM,B
     C                     END
     C                     ELSE
     C           NKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE NKOT,A    KOT,B
     C                     Z-ADDNKBM,A    KBM,B
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           VKEY      CHAINFCEPL011             01
     C           *IN01     IFEQ '0'
     C           A2TEHI    ANDEQ'Z'
     C                     MOVEABKOT      KOT
     C                     Z-ADDBKBM      KBM
     C                     END
      *
     C                     SETON                     21
     C                     ADD  1         RECD    40
     C                     MOVELA2ZANM    WZANM  15
     C                     Z-ADD0         WSU     90
     C                     Z-ADD0         WSYOS   50
     C                     MOVE *BLANK    WSYOT   1
     C           A2SYHZ    IFGT UDATE
     C                     Z-ADDA2KSYS    WSYOS
     C                     MOVE A2KSYT    WSYOT
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYOS
     C                     MOVE A2SSYT    WSYOT
     C                     END
      *
     C           A2BTIU    COMP *BLANK               0202
     C           A2BDAI    COMP *BLANK               0303
     C           FCD       IFNE *ZERO
     C           FSRYO     DIV  FCD       WSU
     C                     ENDIF
      *
      *   S=ﾅﾞbj]ﾆﾞｬc   K=f]ﾈbj]ﾆﾞｬc
     C                     Z-ADD0         WJYURY  72
     C           PJYU      IFEQ 'S'
     C                     SETOF                     55
     C                     Z-ADDA2SOZI    WJYURY
     C                     ELSE
     C                     SETON                     55
     C                     Z-ADDA2KASI    WJYURY
     C                     END
     C           WJYURY    MULT FSRYO     AZURY  100H
     C           AZURY     DIV  1000      AZURY1  71H
     C                     ADD  AZURY1    TZURY   81
      *
     C                     ADD  FHK       THK     81
     C                     ADD  FGK       TGK     81
     C                     ADD  FSRYO     TSRYO  100
     C                     ADD  WSU       TSU    100
      *
     C                     MOVE *BLANK    NAM
     C                     Z-ADD1         A       20
     C                     Z-ADD21        B       20
     C           1         DO   13        A
     C                     ADD  1         B
     C           KBM,A     IFNE 0
     C                     MOVE '1'       *IN,B
     C                     Z-ADDKBM,A     WBMON   40
     C                     SETOF                     11
     C           WBMON     CHAINFGBPL011             11
     C           *IN11     IFEQ '0'
     C                     MOVELB2SMEI    NAM,A
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     MOVE *BLANK    WNAMK  20
     C           KEY       CHAINGCMPL311             11
     C           *IN11     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLEUDATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
     C                     MOVELT3NAMN    WNAMK
     C                     END
      *
     C           END       TAG
     OQPRINT  H  102   09
     O                                  131 '.....................'
     O        H  1     09
     O                                  131 '.GOVERNOR .PUB PRSON.'
     O        H  1     09
     O                 41                22 'BY ODR INT CO PART NO'
     O                 42                21 'BY ODR MATERIAL CODE'
     O                 43                 7 'BY ODR'
     O                 43                32 'COMPLETION WIRE DIAMETER'
     O                 44                21 'BY ODR WIRE DIAMETER'
     O                 45                 7 'BY ODR'
     O                 45                28 'COMMONLY CALLED SIZE'
     O                 46                21 'BY ODR NOMINAL LENGTH'
     O                 47                 7 'BY ODR'
     O                 47                29 'MECHANICAL PROPERTIES'
     O                 48                 7 'BY ODR'
     O                 48                29 'PLATING HANDLING CODE'
     O                 49                22 'BY ODR PART NAME CODE'
     O                 50                 7 'BY ODR'
     O                 50                31 'MATERIAL NAME / COMPLET'
     O                 50                49 'ION WIRE DIAMETER'
     O                 51                16 'BY ODR LOCATION'
     O                 52                 7 'BY ODR'
     O                 52                29 'PER DAY SETTING BOXES'
     O                 53                 7 'BY ODR'
     O                 53                28 'PER DAY RESULT BOXES'
     O                 55                 7 'BY ODR'
     O                 55                31 'MATERIAL NAME / NOMINAL'
     O                 55                38 'LENGTH'
     O                 56                19 'BY ODR MONTHLY QTY'
     O                 57                19 'BY ODR KANBAN KIND'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O                         WNS      130
     O        H  2     09
     O                                   10 'AAFR31-1'
     O                                   50 '* PART M/F LIST BY'
     O                                   74 'CONDITION APPOINTMENT *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  2     09
     O                 04                29 'G- VOL PROD'
     O                 05                31 'Z- LIMITATION'
     O                 06                24 'A- ALL'
     O        H  2     09
     O                                   32 'MTRIAL CODE .1.'
     O                         FZAC1     36
     O                                   41 '.2.'
     O                         FZAC2     45
     O                                   50 '.3.'
     O                         FZAC3     54
     O                                   59 '.4.'
     O                         FZAC4     63
     O                                   68 '.5.'
     O                         FZAC5     72
     O                                   77 '.6.'
     O                         FZAC6     81
     O        H  3     09
     O                                   28 'MTRIAL PROV'
     O                                   32 '.1.'
     O                         FSKU1     35
     O                                   41 '.2.'
     O                         FSKU2     44
     O                                   50 '.3.'
     O                         FSKU3     53
     O                                   59 '.4.'
     O                         FSKU4     62
     O                                   68 '.5.'
     O                         FSKU5     71
     O                                   77 '.6.'
     O                         FSKU6     80
     O        H  3     09
     O                                   27 'MTRIAL UNW'
     O                         FSOZ1 4   37
     O                                   42 'FROM'
     O                         FSOZ2 4   52
     O                                   55 'TO'
     O                                   69 'CMPLET UNW'
     O                         FKAZ1 4   79
     O                                   84 'FROM'
     O                         FKAZ2 4   94
     O                                   97 'TO'
     O        H  3     09
     O                                   28 'CMPLET WIRE'
     O                         FKSZ1 4   37
     O                                   42 'FROM'
     O                         FKSZ2 4   52
     O                                   55 'TO'
     O                                   71 'WIRE DIAMETR'
     O                         FBOZ1 4   79
     O                                   84 'FROM'
     O                         FBOZ2 4   94
     O                                   97 'TO'
     O        H  3     09
     O                                   29 'CMMN CAL SIZ'
     O                         FTOZ1 4   35
     O                                   40 'FROM'
     O                         FTOZ2 4   46
     O                                   49 'TO'
     O                                   60 'NOMNL LEN'
     O                         FKUB1 4   67
     O                                   72 'FROM'
     O                         FKUB2 4   80
     O                                   83 'TO'
     O                                   99 'MCH PROPERTIES'
     O                         FKIK1 4  105
     O                                  110 'FROM'
     O                         FKIK2 4  116
     O                                  119 'TO'
     O        H  3     09
     O                                   28 'BOXES /DAY'
     O                         FHK1  4   37
     O                                   42 'FROM'
     O                         FHK2  4   52
     O                                   55 'TO'
     O                                   69 'RESULT BOXES'
     O                         FGK1  4   79
     O                                   84 'FROM'
     O                         FGK2  4   94
     O                                   97 'TO'
     O        H  3     09
     O                                   28 'MONTHLY QTY'
     O                         FGKN1 4   39
     O                                   44 'FROM'
     O                         FGKN2 4   55
     O                                   58 'TO'
     O        H  1     09
     O                                   73 'S   T   D'
     O                                   90 'S   T   D'
     O        H  3     09
     O                                   35 'PLATING HNDLING CD'
     O                         FMEKI     43
     O                                   59 'PART NAME CODE'
     O                                   62 '.1.'
     O                         FHIM1     65
     O                                   67 '-'
     O                         FHIM2     69
     O                                   71 '-'
     O                         FHIM3     73
     O                                   79 '.2.'
     O                         FHIM4     82
     O                                   84 '-'
     O                         FHIM5     86
     O                                   88 '-'
     O                         FHIM6     90
     O        H  1     09
     O                         FKTNO     31
     O                                   37 '-->NO'
     O                         FSET      42
     O                                   46 '-->'
     O                                   58 'SET PROCESS?'
     O                                   68 '( Y . N )'
     O        H  1     09
     O                                   27 'PROCESS-1'
     O                         FKOT1     31
     O                                   33 '-'
     O                         FKBM1     38
     O                                   50 'PROCESS-2'
     O                         FKOT2     54
     O                                   56 '-'
     O                         FKBM2     61
     O                                   73 'PROCESS-3'
     O                         FKOT3     77
     O                                   79 '-'
     O                         FKBM3     84
     O                                   96 'PROCESS-4'
     O                         FKOT4    100
     O                                  102 '-'
     O                         FKBM4    107
     O        H  2     09
     O                         FNAM1     38
     O                         FNAM2     61
     O                         FNAM3     84
     O                         FNAM4    107
     O        H  2     09
     O                                   31 'KANBAN KIND'
     O                         FKD1      33
     O                                   35 '-'
     O                         FKD2      37
     O                                   71 '2 HANDLING CODE'
     O                         NIJI      75
     O        H  103   09
     O       OR        OF
     O                 41                22 'BY ODR INT CO PART NO'
     O                 42                21 'BY ODR MATERIAL CODE'
     O                 43                 7 'BY ODR'
     O                 43                32 'COMPLETION WIRE DIAMETER'
     O                 44                21 'BY ODR WIRE DIAMETER'
     O                 45                 7 'BY ODR'
     O                 45                28 'COMMONLY CALLED SIZE'
     O                 46                21 'BY ODR NOMINAL LENGTH'
     O                 47                 7 'BY ODR'
     O                 47                29 'MECHANICAL PROPERTIES'
     O                 48                 7 'BY ODR'
     O                 48                29 'PLATING HANDLING CODE'
     O                 49                22 'BY ODR PART NAME CODE'
     O                 50                 7 'BY ODR'
     O                 50                31 'MATERIAL NAME / COMPLET'
     O                 50                49 'ION WIRE DIAMETER'
     O                 51                16 'BY ODR LOCATION'
     O                 52                 7 'BY ODR'
     O                 52                29 'PER DAY SETTING BOXES'
     O                 53                 7 'BY ODR'
     O                 53                28 'PER DAY RESULT BOXES'
     O                 55                 7 'BY ODR'
     O                 55                31 'MATERIAL NAME / NOMINAL'
     O                 55                38 'LENGTH'
     O                 56                19 'BY ODR MONTHLY QTY'
     O                 57                19 'BY ODR KANBAN KIND'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O        H  2     09
     O       OR        OF
     O                                   10 'AAFR31-1'
     O                                   50 '* PART M/F LIST BY'
     O                                   74 'CONDITION APPOINTMENT *'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  116 'PUB PSN'
     O                         WUS      132
     O        H  1     09
     O       OR        OF
     O                         FCD   1  114
     O                                  118 'DAY'
     O                         WYM      126 '    .  '
     O                                  132 'MONTH'
     O        H  1     09
     O       OR        OF
     O                                   10 'INT CO P/N'
     O                                   24 'MTRL NAME'
     O                                   36 'MTRL UNW'
     O                                   46 'CMPLT UNW'
     O                                   57 'CMPLT MTRL'
     O                                   62 'MTRL'
     O                                   70 'CM-NAM'
     O                                   77 'NOM LN'
     O                                   85 'MCH'
     O                                   96 'BZ CD'
     O                                  105 'PART NAM'
     O                                  117 'MONTHLY QTY'
     O                                  129 'RESULT /DAY'
     O                                  139 'RESULT'
     O        H  1     09
     O       OR        OF
     O                                    9 'PROCESS-1'
     O                                   19 'PROCESS-2'
     O                                   29 'PROCESS-3'
     O                                   39 'PROCESS-4'
     O                                   49 'PROCESS-5'
     O                                   59 'PROCESS-6'
     O                                   69 'PROCESS-7'
     O                                   79 'PROCESS-8'
     O                                   89 'PROCESS-9'
     O                                   99 'PROCESS10'
     O                                  109 'PROCESS11'
     O                                  119 'PROCESS12'
     O                                  129 'PROCESS13'
     O        H  1     09
     O       OR        OF
     O                                   10 'MTRL PROV'
     O                                   20 'ACCOM QTY'
     O                                   36 'KANBAN KIND'
     O                                   65 'SHIPMENT COUNT'
     O        H  2     09
     O       OR        OF
     O                                    8 'LOCATION'
     O                                  107 'BOXES /DAY'
     O                                  120 'RESULT BOXES'
     O                                  132 '1 BOX(W)KG'
     O        D  1     21 90
     O                         FBHB1      5
     O                                    6 '-'
     O                         FBHB2     11
     O                N36                12 '-'
     O                         FBHB3     14
     O                         WZANM     30
     O                         A2SOZI4   39
     O                         A2KASI4   48
     O                         A2KAZI4   56
     O                         A2SAIZ4   62
     O                         A2TUSZ4   69
     O                         A2KUBI4   77
     O                         A2KIKI4   86
     O                         A2MEKI    97
     O                         A2BHIN   100
     O                                  101 '-'
     O                         A2BTIU   102
     O                                  103 '-'
     O                         A2BDAI   104
     O                         A2GEKN2  116
     O                         WSU   2  128
     O                         FSRYO 2  140
     O        D  1     21 90
     O                         KOT,1      4
     O                 22                 5 '-'
     O                 22      KBM,1      9
     O                         KOT,2     14
     O                 23                15 '-'
     O                 23      KBM,2     19
     O                         KOT,3     24
     O                 24                25 '-'
     O                 24      KBM,3     29
     O                         KOT,4     34
     O                 25                35 '-'
     O                 25      KBM,4     39
     O                         KOT,5     44
     O                 26                45 '-'
     O                 26      KBM,5     49
     O                         KOT,6     54
     O                 27                55 '-'
     O                 27      KBM,6     59
     O                         KOT,7     64
     O                 28                65 '-'
     O                 28      KBM,7     69
     O                         KOT,8     74
     O                 29                75 '-'
     O                 29      KBM,8     79
     O                         KOT,9     84
     O                 30                85 '-'
     O                 30      KBM,9     89
     O                         KOT,10    94
     O                 31                95 '-'
     O                 31      KBM,10    99
     O                         KOT,11   104
     O                 32               105 '-'
     O                 32      KBM,11   109
     O                         KOT,12   114
     O                 33               115 '-'
     O                 33      KBM,12   119
     O                         KOT,13   124
     O                 34               125 '-'
     O                 34      KBM,13   129
     O        D  1     21 90
     O                         NAM,1      9
     O                         NAM,2     19
     O                         NAM,3     29
     O                         NAM,4     39
     O                         NAM,5     49
     O                         NAM,6     59
     O                         NAM,7     69
     O                         NAM,8     79
     O                         NAM,9     89
     O                         NAM,10    99
     O                         NAM,11   109
     O                         NAM,12   119
     O                         NAM,13   129
     O        D  1     21 90
     O                         A2ZAIR     6
     O                         WSYOS 1   17
     O                                   18 '-'
     O                         WSYOT     19
     O                         FKDAI     24
     O                                   25 '-'
     O                         FKSYO     26
     O                         WNAMK     47
     O                         FKENS 2   57
     O        D  1     21 90
     O                         FTKR1      2
     O                N14                 3 '-'
     O                         FTKR2      5
     O                N15                 6 '-'
     O                         FTKR3      8
     O                N16                 9 '-'
     O                         FTKR4     10
     O                         FHK   2  107
     O                         FGK   2  119
     O                         FZU   2  131
     O        D  2     21 90
     O                                   20 '--------------------'
     O                                   40 '--------------------'
     O                                   60 '--------------------'
     O                                   80 '--------------------'
     O                                  100 '--------------------'
     O                                  120 '--------------------'
     O                                  142 '----------------------'
     O        T 1      LR
     O                                   39 'TOTAL..'
     O                         FMM   Z   42
     O                                   48 'MONTH'
     O                                   55 'RESULT'
     O                         TSRYO     69 ' ,   ,   , * '
     O                                   83 'BOXES /DAY'
     O                         THK       95 ' ,   , * . '
     O*                                 104 '重量ＫＧ'
      *
     O                N55               112 'MATRAL WEIGHT KG'
     O                 55               112 'CMPLET WEIGHT KG'
     O                         TZURY    124 ' ,   , * . '
     O                                  126 'KG'
     O        T 2      LR
     O                                   55 'RESULT /DAY'
     O                         TSU       69 ' ,   ,   , * '
     O                                   83 'RESULT BOXES'
     O                         TGK       95 ' ,   , * . '
     O                                  104 'COUNT'
     O                         RECD     110 ' , * '
