     H            Y
     F********************************************
     F* : CREATE A-PICS PART INVENTORY LIST    *
     F* MAR.23,'87. T.SAWADA                     *
     F********************************************
     FADANP12 IF  E           K        DISK
     FAAFPR22 O   E             20     PRINTER                        UC
     C********************************************
     C*                                          *
     C********************************************
     C                     MOVE *BLANK    PSW     1
     C                     MOVEA'1'       *IN,20
     C                     Z-ADD0         XDDD
     C                     Z-ADD0         XHAK
     C                     Z-ADD0         REC
     C*
     C           *LOVAL    SETLLADANP121
     C                     DO   *HIVAL
     C                     READ ADANP121                 10
     C           *IN,10    IFEQ '0'
     C*
     C           PSW       IFEQ *BLANK
     C                     OPEN AAFPR22
     C                     MOVEA'1'       *IN,20
     C                     MOVEL'*'       PSW
     C                     END
     C           *IN,20    IFEQ '1'
     C                     WRITEHED
     C                     MOVEA'0'       *IN,20
     C                     END
     C*
     C                     ADD  1         REC
     C                     WRITEDET
     C                     ADD  DDD       XDDD
     C                     ADD  PER       XHAK
     C*
E002 C                     END
E001 C  N10                END
     C*
     C           PSW       IFNE *BLANK
     C           *IN,20    IFEQ '1'
     C                     WRITEHED
     C                     MOVEA'0'       *IN,20
     C                     END
     C                     WRITETOT
     C                     END
     C*
     C                     MOVEL'1'       *INLR
     C                     RETRN
