     H            Y.
     F** AAFR54 *************************************************
     F* TUNNEL KANBAN UPDATE DATA / UPDATE CHUBU RIKA DATA *
     F*                          H.ITO 86.10.20                 *
     F************************************************* AAFR54 **
     FAAGTL01 IP  E           K        DISK
     FAAFWP54 O   F     128            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    KCD1    1   8  4 0 KCD2    4 0 8982 岐阜
     E                    ECD1    1   8  4 0 ECD2    4 0 8974 恵那
     E                    NCD1    1   9  4 0 NCD2    4 0 9032 可児
     IAAGTL011    01
     I                                              O4SHN1L3
     I                                              O4SHN2L2
     I                                              O4SHN3L1        02
     I                                              O4BAN2          07
     I                                              O4BAN3          08
     I                                              O4BAN4          09
     I            DS
     I                                        7  140O4SKHZ
     I                                        7  100O4SKYY
     I                                       11  120O4SKMM
     I                                       13  140O4SKDD
     I            DS
     I                                       13  24 O4SHIN
     I                                       13  17 O4SHN1
     I                                       18  22 O4SHN2
     I                                       23  24 O4SHN3
     I            DS
     I                                       25  320A2GSHZ
     I                                       25  280A2GSYY
     I                                       29  300A2GSMM
     I                                       31  320A2GSDD
     I            DS
     I                                       31  36 WKTKR
     I                                       31  31 WKTKR1
     I                                       32  33 WKTKR2
     I                                       34  35 WKTKR3
     I                                       36  36 WKTKR4
     I                                       37  43 A2MEKI
     I                                       37  40 A2MEK1
     I                                       41  42 A2MEK2
     I                                       43  43 A2MEK3
     I                                       44  49 M7MTKR
     I                                       44  44 M7MBN1
     I                                       45  46 M7MBN2
     I                                       47  48 M7MBN3
     I                                       49  49 M7MBN4
     C                     SETOF                     030410
     C                     SETOF                     20
     C           *INL1     IFEQ '1'
     C                     SETOF                     90
     C                     END
     C           *IN90     IFEQ '0'
     C           O4SKJY    CABNE'D'       STP2
     C           O4SKHZ    CABGT*DATE     STP2
     C                     GOTO END
     C           STP2      TAG
     C           O4UKHZ    CABLT*DATE     END
     C           O4STHZ    CABGE*DATE     END
     C                     SETOF                     05
     C                     Z-ADD1         A
     C           O4BMON    LOKUPNCD1,A                   05
     C           *IN05     IFEQ '0'
     C                     GOTO END
     C                     END
     C*
     C           O4MAKB    IFEQ 8982
     C                     SETON                     03
     C                     SETOF                     30
     C                     Z-ADD1         A       20
     C           O4KOCD    LOKUPKCD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDKCD2,A    WCOD    40
     C                     END
     C                     GOTO STP7
     C                     END
     C*
     C           O4MAKB    IFEQ 8974
     C                     SETON                     04
     C                     SETOF                     30
     C                     Z-ADD1         A
     C           O4KOCD    LOKUPECD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDECD2,A    WCOD
     C                     END
     C                     GOTO STP7
     C                     END
     C*
     C           O4MAKB    IFEQ 9032
     C                     SETON                     20
     C                     SETOF                     30
     C                     Z-ADD1         A
     C           O4KOCD    LOKUPNCD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDNCD2,A    WCOD
     C                     END
     C                     GOTO STP7
     C                     END
     C*
     C                     Z-ADDO4KOCD    WCOD
     C           STP7      TAG
     C                     MOVELO4SHIN    WHIBN  20
     C           REBAN     ADD  1         REBAN   40
     C                     SETON                     1090
     C           END       TAG
     C                     END
     OAAFWP54 D        01 10
     O                                    1 '2'
     O                         O4ZETI     5
     O                         WCOD       9
     O                         O4AKRO    19
     O                         WHIBN     39
     O                         O4SYOT    55
     O                         O4SYOS    64
     O                         O4MAIS    67
     O                         O4KSKB    68
     O                         O4MEKI    75
     O        T        LR
     O                                    1 '*'
     OQPRINT  H  204   1P
     O       OR        OF
     O                                   30 '*** TUNNEL KANBAN M/F'
     O                                   42 'UPDATE DATA'
     O                                   51 'LIST ***'
     O                                   60 'DATE'
     O                         UDATE Y   69
     O                                   76 'PAGE'
     O                         PAGE  Z   80
     O        H  2     1P
     O       OR        OF
     O                                   14 'UPD  ID NO'
     O                                   35 'SUPPLIER  PART NO'
     O                                   62 'LOC         ACCOM  T'
     O                                   78 'PLATING  SHEET'
     O                                   80 'K'
     O        H  1     1P
     O       OR        OF
     O                                   59 'QTY'
     O                                   71 'HANDL'
     O        D  2     01 10
     O                                    8 '2 ADD'
     O                         O4ZETI    14
     O                 03                19 'GIFU'
     O                 04                19 'ENA'
     O                 20                19 'KANI'
     O                         WCOD      24
     O                         O4SHN1    31
     O                                   32 '-'
     O                         O4SHN2    37
     O                N02                38 '-'
     O                         O4SHN3    40
     O                         O4BAN1    43
     O                 07                44 '-'
     O                         O4BAN2    46
     O                 08                47 '-'
     O                         O4BAN3    49
     O                 09                50 '-'
     O                         O4BAN4    51
     O                         O4SYOS2   59
     O                         O4SYOT    62
     O                         O4MEKI    71
     O                         O4MAIS4   78
     O                         O4KSKB    80
     O        T  1     LR
     O                                   60 '** RECORD COUNT '
     O                         REBAN 2   66
** KCD1 KCD2
82498451
82300353
87535037
87290906
81841163
26821376
88261724
62978400
** ECD1 ECD2
82492240
82302496
87532852
87293158
81843174
26823646
88263832
62974812
**  NCD1 NCD2
26820043
82302755
81847757
87534197
87292429
88267668
82490841
62976149
56650914
