     H            Y.
      ** AAFR47 ************************************************
      * ...CREATE KANBAN M/F LIST & PROD ORDER BOOK .. *.
      * ... DATA PICK OUT...                                 *
      *         K.NAKAMURA                    91.10.11         *
      * UPDATE:K.OKACHI    2002.05.23    %0001                 *
      *                                                        *
      * TCHK1 01/29/08 ADD PRINT SEQ                           *
JW1   * JW    06/04/18 ADD PRINTER OPTION                      *
      ************************************************ AAFR47 **
     FAAFPW47 CF  E                    WORKSTN
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
%0001FFCEPL40 IF  E           K        DISK
%0001FFCEPL41 IF  E           K        DISK
%0001F            FCEPP401                          KRENAMEFCEPL411
     FAAFWP47 O   F      12            DISK
      ****************************************************************
TCHK1E**JW1               ER      1  11 60                ERROR MSG
JW1  E                    ER      1  15 60                ERROR MSG
     E                    HI        500 12                PART
     E                    HIN      5000 12                PART WORK
     E                    KBM        15  4 0              SECTION
     E                    BM         15  4 0              SECTION WORK
      ****************************************************************
     I            DS
     I                                        1  600KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1   80YYMMDD
     I                                        1   40YYY
     I                                        5   60MMM
     I                                        7   80DDD
     I            DS
     I                                        1   80A2YMD
     I                                        1   40A2GKYY
     I                                        5   60A2GKMM
     I                                        7   80A2GKDD
     I            DS
     I                                        1  12 A2SHIN
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1  12 J1SHIN
     I                                        1   5 J1SHN1
     I                                        6  10 J1SHN2
     I                                       11  12 J1SHN3
     I            DS
     I                                        1  12 HI123
     I                                        1   5 HI1
     I                                        6  10 HI2
     I                                       11  12 HI3
     I            DS
     I                                        1  12 HINB
     I                                        1   5 HIN1
     I                                        6  10 HIN2
     I                                       11  12 HIN3
     I                                       13  200A2GSHZ
     I                                       13  160A2GSYY
     I                                       17  180A2GSMM
     I                                       19  200A2GSDD
     I            DS
     I                                        1  12 KHBAN
     I                                        1   5 KHIN1
     I                                        6  10 KHIN2
     I                                       11  12 KHIN3
%0001 * FCEPL40
     I            DS
     I                                        1  12 F4HHIN
     I                                        1   5 F4HPR1
     I                                        6  10 F4HPR2
     I                                       11  12 F4HPR3
      * FCEPL41
     I            DS
     I                                        1  12 F4IHIN
     I                                        1   5 F4PRT1
     I                                        6  10 F4PRT2
     I                                       11  12 F4PRT3
      *
     I            DS
     I                                        1  12 KIHIN
     I                                        1   5 KIHN1
     I                                        6  10 KIHN2
     I                                       11  12 KIHN3
%0001 *
      ****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           NO      10
     C                     PARM           PNO     1
TCHK1C                     PARM           PLSTK   1
JW1  C                     PARM           @PRNTR  1        PRINTER OPTION
      *
     C           HINKEY    KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      *
     C           A2BKEY    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C*---------------------------------------------------------------*
     C*
     C*---------------------------------------------------------------*
     C           ST1       TAG
     C                     Z-ADD*ZERO     NO
     C                     MOVE *BLANK    MSG    60
     C                     MOVE '1'       LNO
     C                     SETOF                     011299
      *
     C           ST2       TAG
     C                     EXFMTAAFPW471
      *
     C   KA                SETON                     LR
     C   KA                RETRN
     C*---------------------------------------------------------------*
     C* AAFPW471
     C*---------------------------------------------------------------*
     C                     SETOF                     011299
TCHK1C                     SETOF                     31
JW1  C                     SETOF                     32
     C                     MOVE *BLANK    MSG
      *
     C           NO        IFNE 1
     C           NO        ANDNE2
     C           NO        ANDNE3
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO ST2
     C                     END
      *
     C           LNO       IFNE '1'
     C           LNO       ANDNE'2'
     C           LNO       ANDNE'3'
     C                     SETON                     1299
     C                     MOVE ER,10     MSG
     C                     GOTO ST2
     C                     END
      *
TCHK1C           @LSTK     IFNE *BLANK
TCHK1C           @LSTK     ANDNE'1'
TCHK1C                     SETON                     3199
TCHK1C                     MOVELER,11     MSG
TCHK1C                     GOTO ST2
TCHK1C                     END
      * CHECK PRINTER OPTION
JW1  C           @PRNTR    IFNE *BLANK
 |   C           @PRNTR    ANDNE'1'
 |   C           @PRNTR    ANDNE'2'
 |   C           @PRNTR    ANDNE'3'
 |   C           @PRNTR    ANDNE'4'
 |   C           @PRNTR    ANDNE'5'
 |   C           @PRNTR    ANDNE'6'
 |   C           @PRNTR    ANDNE'9'
 |   C                     SETON                     3299
 |   C                     MOVELER,12     MSG
 |   C                     GOTO ST2
JW1  C                     ENDIF
      *
     C                     MOVE LNO       PNO     1
TCHK1C                     MOVE @LSTK     PLSTK
     C*---------------------------------------------------------------*
     C*
     C*---------------------------------------------------------------*
     C                     MOVE *BLANK    RTSW    1
     C                     MOVE *BLANK    HIN
      *
     C           NO        CASEQ1         #TYPE2
     C           NO        CASEQ2         #TYPE3
     C           NO        CASEQ3         #TYPE4
     C                     END
      *
     C           RTSW      CABEQ'*'       ST1
      *
     C                     SETON                     LR
     C                     RETRN
     C*---------------------------------------------------------------*
     C* TYPE2
     C*---------------------------------------------------------------*
     C           #TYPE2    BEGSR
      *
     C                     Z-ADD*ZERO     YMD
     C                     Z-ADD*ZERO     HHF
     C                     Z-ADD*ZERO     HHT
     C                     MOVE *BLANK    MSG
     C                     SETOF                     010203
     C                     SETOF                     99
      *
     C           TY21      TAG
     C                     EXFMTAAFPW472
     C                     SETOF                     010203
     C                     SETOF                     99
      *
     C   KA                SETON                     LR
     C   KA                RETRN
      *
     C   KB                MOVE '*'       RTSW
     C   KB                GOTO TYPE2E
      *
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    ERSW    1
     C                     Z-ADDYMD       YYMMDD
      *
     C           MMM       IFLT 1
     C           MMM       ORGT 12
     C                     MOVE '*'       ERSW
     C                     MOVE ER,2      MSG
     C                     SETON                     01
     C                     END
      *
     C           DDD       IFLT 1
     C           DDD       ORGT 31
     C                     MOVE '*'       ERSW
     C                     MOVE ER,2      MSG
     C                     SETON                     01
     C                     END
      *
     C           HHF       IFLT 1
     C           HHF       ORGT 24
     C                     MOVE '*'       ERSW
     C                     MOVE ER,3      MSG
     C                     SETON                     02
     C                     END
      *
     C           HHT       IFLT 1
     C           HHT       ORGT 24
     C                     MOVE '*'       ERSW
     C                     MOVE ER,3      MSG
     C                     SETON                     03
     C                     END
      *
     C           HHT       IFLT HHF
     C                     MOVE '*'       ERSW
     C                     MOVE ER,4      MSG
     C                     SETON                     0203
     C                     END
      *
     C           ERSW      CABEQ'*'       TY21           99
      *
     C           TY22      TAG
     C                     SETOF                     10
     C                     READ FCEPL011                 10
     C   10                GOTO TY23
      *
     C           A2GSKD    CABEQ'D'       TY22
     C           A2TEHI    CABNE'G'       TY22
     C           YMD       CABNEA2YMD     TY22
     C           A2GKJI    CABGTHHT       TY22
     C           A2GKJI    CABLTHHF       TY22
      *
     C                     SETON                     U1
     C                     MOVE A2SHIN    HINBAN 12
     C                     EXSR #HINST
     C                     GOTO TY22
      *
     C           TY23      TAG
     C   U1                EXSR #HIOUT
      *
     C           TYPE2E    ENDSR
     C*---------------------------------------------------------------*
     C* TYPE3
     C*---------------------------------------------------------------*
     C           #TYPE3    BEGSR
      *
     C                     MOVE *BLANK    HI
      *
     C           TY30      TAG
     C                     MOVE *BLANK    HINB
     C                     MOVE *BLANK    MSG
     C                     SETOF                     01
     C                     SETOF                     99
      *
     C           TY31      TAG
     C                     EXFMTAAFPW473
     C                     MOVE *BLANK    MSG
     C                     SETOF                     0199
     C   KA                GOTO TY33
     C   KB                MOVE '*'       RTSW
     C   KB                GOTO TYPE3E
     C                     SETOF                     10
     C           HINKEY    CHAINFCEPL011             10
     C   10                GOTO VB1
      *
     C           A2GSKD    CABNE'D'       VB2
     C           A2GSHZ    CABGT*DATE     VB2
      *
     C           VB1       TAG
     C                     SETON                     0199
     C                     MOVE ER,6      MSG
     C                     GOTO TY31
      *
     C           VB2       TAG
     C           A2TEHI    IFNE 'G'
     C                     SETON                     0199
     C                     MOVE ER,7      MSG
     C                     GOTO TY31
     C                     END
      *
     C                     SETOF                     10
     C                     Z-ADD1         I       50
     C           HINB      LOKUPHI,I                     10
     C   10                SETON                     0199
     C   10                MOVE ER,5      MSG
     C   10                GOTO TY31
     C   KE                GOTO TY32
     C                     GOTO TY31
      *
     C           TY32      TAG
     C                     SETON                     U1
     C                     MOVE *BLANK    HINBAN
     C                     SETOF                     10
     C                     Z-ADD1         I
     C           HINBAN    LOKUPHI,I                     10
     C   10                MOVE HINB      HI,I
     C                     GOTO TY30
      *
     C           TY33      TAG
     C           HI,1      CABEQ*BLANK    TYPE3E
     C                     Z-ADD1         I
      *
     C           1         DO   500       I
     C           HI,I      CABEQ*BLANK    STEP03
     C                     MOVE HI,I      HINBAN
     C                     EXSR #HINST
     C                     END
      *
     C           STEP03    TAG
     C                     EXSR #HIOUT
      *
     C           TYPE3E    ENDSR
     C*---------------------------------------------------------------*
     C* TYPE4
     C*---------------------------------------------------------------*
     C           #TYPE4    BEGSR
      *
     C                     MOVE *BLANK    BMON
     C                     MOVE *BLANK    MSG
     C                     SETOF                     1199
      *
     C           CBC1      TAG
     C                     EXFMTAAFPW474
     C                     SETOF                     1199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     MOVE '*'       RTSW
     C                     GOTO TYPE4E
     C                     END
      *
     C           BMON      IFEQ *BLANK
     C                     SETON                     1199
     C                     MOVE ER,8      MSG
     C                     GOTO CBC1
     C                     END
      *
     C                     SETOF                     10
     C                     MOVE BMON      WBMON   40
     C           WBMON     CHAINFGBPL011             10
      *
     C           *IN10     IFEQ '1'
     C                     SETON                     1199
     C                     MOVE ER,9      MSG
     C                     GOTO CBC1
     C                     END
      *
     C           *INKE     CABEQ'0'       CBC1
      *
     C           CBC2      TAG
     C                     SETOF                     10
     C                     READ FCEPL011                 10
     C   10                GOTO TYPE4E
      *
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO CBC2
     C                     END
      *
     C           A2TEHI    CABNE'G'       CBC2
      *
     C                     SETOF                     10
     C                     Z-ADD*ZERO     BM
     C           A2BKEY    CHAINAAMPL111             10    gﾒfd uﾇjｰ
      *
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A       20
     C                     Z-ADD*ZERO     B       20
     C           1         DO   15        A
     C           KBM,A     IFNE *ZERO
     C                     ADD  1         B
     C                     Z-ADDKBM,A     BM,B
     C                     END
     C                     END
     C                     END
     C                     Z-ADD1         I
      *
     C           1         DO   15        I
     C           BM,I      CABEQ*ZERO     CBC2
     C           BM,I      IFEQ WBMON
     C                     SETON                     U1
     C                     MOVE A2SHIN    HINBAN
     C                     EXCPTOUT
%0001 *
     C                     MOVE *BLANK    CFLG
     C                     EXSR #SB100
     C           CFLG      IFEQ *BLANK
     C                     EXSR #SB200
     C                     END
%0001 *
     C                     GOTO CBC2
     C                     END
     C                     END
      *
     C                     GOTO CBC2
      *
     C           TYPE4E    ENDSR
     C*---------------------------------------------------------------*
     C* PART SET
     C*---------------------------------------------------------------*
     C           #HINST    BEGSR
      *
     C                     SETOF                     10
     C                     Z-ADD1         Z       40
     C           HINBAN    LOKUPHIN,Z                    10
     C   10                GOTO HINEND
     C                     MOVE *BLANK    WWW    12
     C                     SETOF                     10
     C                     Z-ADD1         Z
     C           WWW       LOKUPHIN,Z                    10
     C   10                MOVE HINBAN    HIN,Z
      *
     C           HINEND    ENDSR
     C*---------------------------------------------------------------*
     C* PART OUT
     C*---------------------------------------------------------------*
     C           #HIOUT    BEGSR
      *
     C                     Z-ADD1         Z
     C           1         DO   5000      Z
     C           HIN,Z     CABEQ*BLANK    STEP05
     C                     MOVE HIN,Z     HINBAN
     C                     EXCPTOUT
%0001 *
     C                     MOVE *BLANK    CFLG    1
     C                     EXSR #SB100
     C           CFLG      IFEQ *BLANK
     C                     EXSR #SB200
     C                     END
%0001 *
     C                     END
      *
     C           STEP05    ENDSR
%0001 *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     MOVE *BLANK    KIHIN
     C                     MOVE HINBAN    KIHIN
     C           KEY1      KLIST
     C                     KFLD           KIHN1
     C                     KFLD           KIHN2
     C                     KFLD           KIHN3
     C                     SETOF                     10
     C           KEY1      CHAINFCEPL40              10
     C           *IN10     IFEQ '0'
     C                     MOVE '*'       CFLG
     C                     MOVE F4HHIN    HINBAN
     C                     EXCPTOUT
     C                     END
     C           ESB100    ENDSR
      *-----------------------------------------------------*
     C           #SB200    BEGSR
     C                     MOVE *BLANK    KIHIN
     C                     MOVE HINBAN    KIHIN
     C                     SETOF                     10
     C           KEY1      CHAINFCEPL41              10
     C           *IN10     IFEQ '0'
     C                     MOVE '*'       CFLG
     C                     MOVE F4IHIN    HINBAN
     C                     EXCPTOUT
     C                     END
     C           ESB200    ENDSR
%0001 *-----------------------------------------------------*
     OAAFWP47 E                OUT
     O                         HINBAN    12
**
E-01 OPTION SHOULD BE 1, 2 OR 3!
E-02 DATE IS INVALID!
E-03 TIME IS INVALID!
E-04 TIME TO IS EARLIER THAN FROM!
E-05 PART ALREADY ENTERED!
E-06 PART IS NOT IN PART M/F.
E-07 PART M/F IS LIMITATION OR TRIAL MFG.
E-08 ENTER SECTION!
E-09 SECTION IS NOT IN DETAIL MASTER!
E-10 LIST CONDITION SHOULD BE 1, 2 OR 3!
E-11 PRINT SEQUENCE SHOULD BE BLANK OR 1 !
E-12 PRINTER OPTION SHOULD BE BLANK, 1, 2, 3, 4, 5 OR 6!
E-13
E-14
E-15
