     H            Y.
     F*** AAFR53 ********************************************
     F* BZ KANBAN UPDATE DATA /  UPDATE CHUBU RIKA*
     F*                      H.ITO 86.10.20                 *
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.09|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F****************************************************** AAFR53 ***
     FAAFTL01 IP  E           K        DISK
     FAAFWP53 O   F     128            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    KCD1    1   8  4 0 KCD2    4 0 8982 gﾞﾎ
     E                    ECD1    1   8  4 0 ECD2    4 0 8974 do
     E                    NCD1    1   9  4 0 NCD2    4 0 9032 fp
     IAAFTL011    01
     I                                              A31HB5L3
     I                                              A32HB5L2
     I                                              A33HB2L1        02
     I                                              A3ATK2          04
     I                                              A3ATK3          05
     I                                              A3ATK4          06
     I            DS
     I                                        1   6 A3ATKR
     I                                        1   1 A3ATK1
     I                                        2   3 A3ATK2
     I                                        4   5 A3ATK3
     I                                        6   6 A3ATK4
     I                                        7  140A3SKH1
     I                                        7  100A3SKYY
     I                                       11  120A3SKMM
     I                                       13  140A3SKDD
     I                                       15  26 A3HIBN
     I                                       15  19 A31HB5
     I                                       20  24 A32HB5
     I                                       25  26 A33HB2
     I                                       27  340A2GSHZ
     I                                       27  300A2GSYY
     I                                       31  320A2GSMM
     I                                       33  340A2GSDD
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     C                     SETOF                     030708
     C                     SETOF                     0920
     C           *INL1     IFEQ '1'
     C                     SETOF                     99
     C                     END
     C           *IN99     IFEQ '0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C           A3UKHZ    CABLT*DATE     END
     C           A3STHZ    CABGE*DATE     END
     C                     Z-ADD1         A       20
     C                     SETOF                     13
     C           A3ATOB    LOKUPNCD1,A                   13
     C           *IN13     IFEQ '0'
     C                     GOTO END
     C                     END
     C*
     C           A3MAKB    IFEQ 8982
     C                     SETON                     07
     C                     SETOF                     30
     C                     Z-ADD1         A       20
     C           A3ATOB    LOKUPKCD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDKCD2,A    WCOD    40
     C                     END
     C                     GOTO STP5
     C                     END
     C*
     C           A3MAKB    IFEQ 8974
     C                     SETON                     08
     C                     SETOF                     30
     C                     Z-ADD1         A
     C           A3ATOB    LOKUPECD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDECD2,A    WCOD
     C                     END
     C                     GOTO STP5
     C                     END
     C*
     C           A3MAKB    IFEQ 9032
     C                     SETON                     09
     C                     SETOF                     30
     C                     Z-ADD1         A
     C           A3ATOB    LOKUPNCD1,A                   30
     C           *IN30     IFEQ '1'
     C                     Z-ADDNCD2,A    WCOD
     C                     END
     C                     GOTO STP5
     C                     END
     C*
     C                     Z-ADDA3ATOB    WCOD
     C           STP5      TAG
     C                     MOVELA3HIBN    WHIBN  20
     C           REBAN     ADD  1         REBAN   40
     C                     Z-ADDA3KAIS    @@KAIS  30
     C                     SETON                     99
     C                     SETON                     03
     C           END       TAG
     C                     END
     OAAFWP53 D        01 03
     O                                    1 '2'
     O                         A3ZETI     5
     O                         WCOD       9
     O                         A3ATKR    19
     O                         WHIBN     39
     O                         A3SSYT    55
     O                         A3SSYS    64
     O***                      A3KAIS    67
     O                         @@KAIS    67
     O                         A3KSNK    68
     O                         A3MEKI    75
     O        T        LR
     O                                    1 '*'
     OQPRINT  H  204   1P
     O       OR        OF
     O                                   30 '*** KANBAN M/F'
     O                                   42 'UPDATE DATA'
     O                                   51 'LIST ***'
     O                                   60 'DATE'
     O                         UDATE Y   69
     O                                   76 'PAGE'
     O                         PAGE  Z   80
     O        H  1     1P
     O       OR        OF
     O                                   14 'UPD  ID NO'
     O                                   35 'SUPPLIER  PART NO'
     O                                   62 'LOC         ACCOM  T'
     O                                   78 'PLATING  SHEET'
     O                                   80 'K'
     O        H  1     1P
     O       OR        OF
     O                                   59 'QTY'
     O                                   71 'HANDL'
     O        D  2     01 03
     O                                    8 '2 ADD'
     O                         A3ZETI    14
     O                 07                19 'GIFU'
     O                 08                19 'ENA'
     O                 09                19 'KANI'
     O                         WCOD      24
     O                         A31HB5    31
     O                                   32 '-'
     O                         A32HB5    37
     O                N02                38 '-'
     O                         A33HB2    40
     O                         A3ATK1    43
     O                N04                44 '-'
     O                         A3ATK2    46
     O                N05                47 '-'
     O                         A3ATK3    49
     O                N06                50 '-'
     O                         A3ATK4    51
     O                         A3SSYS2   59
     O                         A3SSYT    62
     O                         A3MEKI    71
     O                         A3KAIS4   78
     O                         A3KSNK    80
     O        T  1     LR
     O                                   60 '** RECORD COUNT '
     O                         REBAN 2   66
** KCD1 KCD2
82498451
82300353
87535037
87290906
81841163
26821376
88261724
62978400
** ECD1 ECD2
82492240
82302496
87532852
87293158
81843174
26823646
88263832
62974812
** NCD1 NCD2
26820043
82302755
81847757
87534197
87292429
88267668
82490841
62976149
56650914
