     H            Y.
     F** AAFR61 **********************************
     F* ... DATA LOCATION ORDER LIST FOR AUTOMATIC WEIGHING... *
     F* PROGRAM ID. : AAFR61. <RPG> *
     F* CREATE DATE. : JUL.19,'89.               *
     F* UPDATE          : 94.08.30 N.H *
     F* AUTHOR.         : E.KAWASHIMA <G.B.C> *
     F********************************** AAFR61 **
     FAAFPW61 CF  E                    WORKSTN
     FAAFTL01 IF  E           K        DISK
     FAARTL11 IF  E           K        DISK
     FCADTL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAAGTL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAHTL01 IF  E           K        DISK
     FAEATL01 IF  E           K        DISK
     FABHTL01 IF  E           K        DISK
     FAAFWP61 O   F     100            DISK
     E                    RIN        20  1               [b]
     E                    BMN        20  4               ﾎﾞy]ﾃｰnﾞ
     E                    HBM        20  4 0             ﾎﾞy]ﾃｰnﾞ ﾌbﾛl
     E                    KOT        15  3               ﾃcmbﾃｰnﾞ ﾌbﾛl
     E                    TK         15  6               nﾃﾜﾌﾞ]k  ﾌbﾛl
     E                    ER      1   4 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80CSTAHZ
     I                                        1   40CSTAYY
     I                                        5   60CSTAMM
     I                                        7   80CSTADD
     I            DS
     I                                        1  20 RIN
     I                                        1   1 R1
     I                                        2   2 R2
     I                                        3   3 R3
     I                                        4   4 R4
     I                                        5   5 R5
     I                                        6   6 R6
     I                                        7   7 R7
     I                                        8   8 R8
     I                                        9   9 R9
     I                                       10  10 R10
     I                                       11  11 R11
     I                                       12  12 R12
     I                                       13  13 R13
     I                                       14  14 R14
     I                                       15  15 R15
     I                                       16  16 R16
     I                                       17  17 R17
     I                                       18  18 R18
     I                                       19  19 R19
     I                                       20  20 R20
     I            DS
     I                                        1  80 BMN
     I                                        1   4 B1
     I                                        5   8 B2
     I                                        9  12 B3
     I                                       13  16 B4
     I                                       17  20 B5
     I                                       21  24 B6
     I                                       25  28 B7
     I                                       29  32 B8
     I                                       33  36 B9
     I                                       37  40 B10
     I                                       41  44 B11
     I                                       45  48 B12
     I                                       49  52 B13
     I                                       53  56 B14
     I                                       57  60 B15
     I                                       61  64 B16
     I                                       65  68 B17
     I                                       69  72 B18
     I                                       73  76 B19
     I                                       77  80 B20
     I            DS
     I                                        1  45 KOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 TK
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1   6 OLD
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 NEW
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     C******************************************************
     C*  START  PROGRAM  <EL#R02>                          *
     C******************************************************
      * xｮg f]ﾌﾞ] ﾍ]ﾌﾞ]
     C           KEY1      KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
      * n]rﾓ f]ﾌﾞ] ﾍ]ﾌﾞ]
     C           KEY2      KLIST
     C                     KFLD           O4SHN1
     C                     KFLD           O4SHN2
     C                     KFLD           O4SHN3
      * ﾆﾆﾞ f]ﾌﾞ] ﾍ]ﾌﾞ]
     C           KEY3      KLIST
     C                     KFLD           C2SHN1
     C                     KFLD           C2SHN2
     C                     KFLD           C2SHN3
      * ﾃcﾌﾞb n]rﾓ f]ﾌﾞ] uﾇjｰ ﾍ]ﾌﾞ]
     C           KEY4      KLIST
     C                     KFLD           AESHN1
     C                     KFLD           AESHN2
     C                     KFLD           AESHN3
      * ﾍgnﾒ f]ﾌﾞ] uﾇjｰ ﾍ]ﾌﾞ]
     C           KEY5      KLIST
     C                     KFLD           L6SHN1
     C                     KFLD           L6SHN2
     C                     KFLD           L6SHN3
      * ﾃcmbob f]ﾌﾞ] uﾇjｰ ﾍ]ﾌﾞ]
     C           KEY6      KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
      *
     C                     MOVE 'A'       R1
     C                     MOVE 'B'       R2
     C                     MOVE 'C'       R3
     C                     MOVE 'D'       R4
     C                     MOVE 'E'       R5
     C                     MOVE 'F'       R6
     C                     MOVE 'G'       R7
     C                     MOVE '0111'    B1
      *
     C           STP1      TAG
     C                     EXFMTAAFPW611
     C                     MOVEA'0'       *IN,99
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'00000000'*IN,09
     C                     MOVEA'0000'    *IN,17
     C                     MOVEA'0'       *IN,40
     C                     MOVEA'0'       *IN,41
      *
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
     C************************
     C*   ..部門コード..   *
     C************************
     C                     Z-ADD1         A       20
     C           1         DO   20        A
     C           BMN,A     IFNE *BLANK
     C                     MOVE BMN,A     WBMN    40
     C                     SETOF                     50
     C           WBMN      CHAINFGBPL011             50
     C           *IN50     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     50
     C                     END
     C           *IN50     IFEQ '1'
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
      *  j]ﾆﾞｬc hﾎﾞ] kｩｮh
     C           TAN       IFNE '1'
     C           TAN       ANDNE'2'
     C           TAN       ANDNE'3'
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,40
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
      *  ﾃcmb hﾎﾞ] kｩｮh
     C           DSPKT     IFNE '1'
     C           DSPKT     ANDNE'2'
     C           DSPKT     ANDNE'3'
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'1'       *IN,41
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
     C                     MOVE DSPKT     @DSPKT  1
      *
     C  NKE                GOTO STP1
     C********************
     C*   ..ライン..   *
     C********************
     C                     SETOF                     303134
     C                     Z-ADD1         A
     C           1         DO   20        A
     C           RIN,A     IFNE *BLANK
     C                     SETON                     30
     C           RIN,A     IFEQ '@'
     C                     SETON                     34
     C                     END
     C                     END
     C                     END
     C************************
     C*   ..部門コード..   *
     C************************
     C                     Z-ADD1         A
     C           1         DO   20        A
     C           BMN,A     IFNE *BLANK
     C                     SETON                     31
     C                     END
     C  N31                END
     C                     Z-ADD1         A
     C                     Z-ADD0         B       20
     C           1         DO   20        A
     C           BMN,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE BMN,A     HBM,B
     C                     END
     C                     END
     C*************
     C* xｮg f]ﾌﾞ] *
     C*************
     C           *LOVAL    SETLLAAFTL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ AAFTL011                 32
     C           *IN32     IFEQ '0'
      *
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     GOTO END1
     C                     END
     C           A3UKHZ    IFLE *DATE
     C           A3STHZ    ANDGT*DATE
     C********************
     C*   ..ライン..   *
     C********************
     C           *IN30     IFEQ '1'
     C           A3RAIN    IFEQ *BLANK
     C           *IN34     IFEQ '0'
     C                     GOTO END1
     C                     ELSE
     C                     GOTO @ST1
     C                     END
     C                     END
     C                     SETOF                     33
     C           A3RAIN    LOKUPRIN                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END1
     C                     END
     C                     END
     C           @ST1      TAG
     C************************
     C*   ..部門コード..   *
     C************************
     C           *IN31     IFEQ '1'
     C                     SETOF                     33
     C           A3ATOB    LOKUPHBM                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END1
     C                     END
     C                     END
      *
     C*                    MOVELA3ATKR    WTKR    6
     C                     MOVE A3ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY1      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDA3ATOB    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END1
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY1      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD0         CNT     20
     C                     Z-ADD1         A
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     SETON                     88
     C                     Z-ADDA         CNT     20
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT     20
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT1
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT1
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      ********  END OF ADDING  1994.09.16 S.OHTAKE  ********
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY1      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR    6
     C                     GOTO END3
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END3      TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT1
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT1
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT1
     C                     END
     C                     END
      *
     C           END1      TAG
     C                     END
     C                     END
     C           EXT1      TAG
     C  N32                END
     C**************
     C* n]rﾓ f]ﾌﾞ] *
     C**************
     C           *LOVAL    SETLLAAGTL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ AAGTL011                 32
     C           *IN32     IFEQ '1'
     C                     GOTO EXIT2
     C                     END
      *
     C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    ANDLE*DATE
     C                     GOTO END2
     C                     END
     C           O4UKHZ    IFLE *DATE
     C           O4STHZ    ANDGT*DATE
     C********************
     C*   ..ライン..   *
     C********************
     C           *IN30     IFEQ '1'
     C           O4RAIN    IFEQ *BLANK
     C           *IN34     IFEQ '0'
     C                     GOTO END2
     C                     ELSE
     C                     GOTO @ST2
     C                     END
     C                     END
     C                     SETOF                     33
     C           O4RAIN    LOKUPRIN                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END2
     C                     END
     C                     END
     C           @ST2      TAG
     C************************
     C*   ..部門コード..   *
     C************************
     C           *IN31     IFEQ '1'
     C                     SETOF                     33
     C           O4KOCD    LOKUPHBM                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END2
     C                     END
     C                     END
      *
     C*                    MOVELO4AKRO    WTKR    6
     C                     MOVE O4ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY2      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDO4KOCD    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END2
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY2      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         CNT
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     SETON                     88
     C                     Z-ADDA         CNT     20
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT2
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT2
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      *********  END OF ADDING 1994.09.16 S.OHTAKE  ********
      *
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY2      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR
     C                     GOTO END4
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END4      TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT2
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT2
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT2
     C                     END
     C                     END
      *
     C           END2      TAG
     C                     END
     C           EXT2      TAG
     C                     END
     C           EXIT2     TAG
     C********************************************************
     C* 購買トンネルかんばんマスター  1994.09.14  S.OHTAKE *
     C********************************************************
     C           *LOVAL    SETLLAEATL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ AEATL011                 32
     C           *IN32     IFEQ '0'
      *
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO END10
     C                     END
     C           AEUKHZ    IFLE *DATE
     C           AESTHZ    ANDGT*DATE
      *
     C*                    MOVELA3ATKR    WTKR    6
     C*****                MOVE A3ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY4      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDAEATOB    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END10
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY4      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         CNT
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     Z-ADDA         CNT
     C                     SETON                     88
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT     20
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT3
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT3
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      ********  END OF ADDING  1994.09.16 S.OHTAKE  ********
      *
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY4      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR    6
     C                     GOTO END30
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END30     TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT10
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT10
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT10
     C                     END
     C                     END
      *
     C           END10     TAG
     C                     END
     C                     END
     C           EXT3      TAG
     C  N32                END
     C************************************************
     C* 工程かんばんマスター  1994.12.21  S.OHTAKE *
     C************************************************
     C           *LOVAL    SETLLABHTL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ ABHTL011                 32
     C           *IN32     IFEQ '0'
      *
     C           M6SKJY    IFEQ 'D'
     C           M6SKHZ    ANDLE*DATE
     C                     GOTO END99
     C                     END
     C           M6UKHZ    IFLE *DATE
     C           M6STHZ    ANDGT*DATE
      *
     C                     MOVELM6JBAN    WTKR    6
     C*****                MOVE A3ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY6      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDM6BMON    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END99
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY6      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         CNT
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     Z-ADDA         CNT
     C                     SETON                     88
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT     20
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT99
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT99
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      ********  END OF ADDING  1994.09.16 S.OHTAKE  ********
      *
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY6      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR    6
     C                     GOTO END9A
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END9A     TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT99
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT99
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT99
     C                     END
     C                     END
      *
     C           END99     TAG
     C                     END
     C                     END
     C           EXT99     TAG
     C  N32                END
     C************************************************
     C* 引取かんばんマスター  1994.09.15  S.OHTAKE *
     C************************************************
     C           *LOVAL    SETLLAAHTL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ AAHTL011                 32
     C           *IN32     IFEQ '1'
     C                     GOTO EXIT20
     C                     END
      *
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLE*DATE
     C                     GOTO END20
     C                     END
     C           L6UKHZ    IFLE *DATE
     C           L6STHZ    ANDGT*DATE
      *
     C*                    MOVELL6ATKR    WTKR    6
     C                     MOVE L6ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY5      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDL6ATOB    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END20
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY5      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         CNT
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     SETON                     88
     C                     Z-ADDA         CNT
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT     20
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT4
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT4
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      ********  END OF ADDING  1994.09.16 S.OHTAKE  ********
      *
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY5      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR
     C                     GOTO END40
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END40     TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT20
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT20
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT20
     C                     END
     C                     END
      *
     C           END20     TAG
     C                     END
     C           EXT4      TAG
     C                     END
     C           EXIT20    TAG
     C** SIJI *****************************
     C* 指示かんばん94.08.29 N.HAYAKAWA *
     C*************************************
     C           *LOVAL    SETLLCADTL011
     C                     DO   *HIVAL
     C                     SETOF                     32
     C                     READ CADTL011                 32
     C           *IN32     IFEQ '1'
     C           *INU1     IFEQ '0'
     C                     SETON                     99
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     GOTO END5
     C                     END
     C           C2UKHZ    IFLE *DATE
     C           C2STHZ    ANDGT*DATE
     C********************
     C*   ..ライン..   *
     C********************
     C           *IN30     IFEQ '1'
     C           C2RAIN    IFEQ *BLANK
     C           *IN34     IFEQ '0'
     C                     GOTO END5
     C                     ELSE
     C                     GOTO @ST3
     C                     END
     C                     END
     C                     SETOF                     33
     C           C2RAIN    LOKUPRIN                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END5
     C                     END
     C                     END
     C           @ST3      TAG
     C************************
     C*   ..部門コード..   *
     C************************
     C           *IN31     IFEQ '1'
     C                     SETOF                     33
     C           C2BMON    LOKUPHBM                      33
     C           *IN33     IFEQ '0'
     C                     GOTO END5
     C                     END
     C                     END
      *
     C*                    MOVELC2TKRO    WTKR    6
     C                     MOVE C2ZETI    WZETI   6
     C                     Z-ADD0         WTHIZ   80
     C                     Z-ADD0         WTANJ   73
     C                     Z-ADD0         WTOKU   40
     C                     Z-ADD0         WSIRE   40
     C                     SETOF                     33
     C           KEY3      CHAINAARTL111             33
     C           *IN33     IFEQ '0'
     C           CSSKJY    ANDEQ'D'
     C           CSSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     END
     C           *IN33     IFEQ '0'
     C                     Z-ADDCSTAHZ    WTHIZ
     C                     Z-ADDCSTANJ    WTANJ
     C                     Z-ADDCSTOKC    WTOKU
     C                     Z-ADDCSKACD    WSIRE
     C                     END
     C           WTOKU     IFEQ 0
     C                     Z-ADD8990      WTOKU
     C                     END
     C           WSIRE     IFEQ 0
     C                     Z-ADDC2BMON    WSIRE
     C                     END
      *
     C           WSIRE     IFEQ 8923
     C                     GOTO END5
     C                     END
      *-----------------------------*
      * 工程コード（ＢＺ）チェック*
      *------- 1994.01.31 K.YASUDA -*
     C                     SETOF                     7788
     C           KEY3      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         CNT
     C                     DO   15        A
     C           KOT,A     IFEQ 'BZ'
     C                     SETON                     88
     C                     Z-ADDA         CNT
     C                     END
     C                     ENDDO
     C                     END
      *****************************************************************
      *  ＢＺの後にＰＲＳ・ＨＫ・ＩＮＪ・ＡＫ・ＣＴＬ・ＣＯＱ・ＣＳ *
      *                が有るかどうかのチェック                     *
      *                  1994.09.16     S.OHTAKE                      *
      *****************************************************************
     C           *IN77     IFEQ '0'
     C           *IN88     ANDEQ'1'
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ aﾒ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '1'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT     20
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT5
     C                     END
     C                     END
      *----- ﾃcmb mﾞ PRS.HK.INJ.AK.CTL.COQ.CS fﾞ oﾆ ･ ﾈ]jh ﾆj ng -----*
     C           DSPKT     IFEQ '2'
     C                     MOVE '2'       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE ' '       FLG
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     GOTO EXT5
     C                     END
     C                     MOVE '2'       FLG     1
     C                     END
      *----- ﾇsﾞm ･ ﾈ]jh ﾆj ng !! -----*
     C           DSPKT     IFEQ '3'
     C                     MOVE ' '       FLG     1
     C           CNT       ADD  1         CNT
     C                     Z-ADD0         C       20
      *
     C           CNT       DO   15        C
     C           KOT,C     IFEQ 'PRS'
     C           KOT,C     OREQ 'HK'
     C           KOT,C     OREQ 'INJ'
     C           KOT,C     OREQ 'AK'
     C           KOT,C     OREQ 'CTL'
     C           KOT,C     OREQ 'COQ'
     C           KOT,C     OREQ 'CS'
     C                     MOVE '1'       FLG     1
     C                     END
     C                     ENDDO
     C           FLG       IFEQ ' '
     C                     MOVE '2'       FLG
     C                     END
     C                     END
     C                     END
      ********  END OF ADDING  1994.09.16 S.OHTAKE  ********
      *
     C           *IN88     IFEQ '1'
      *---------------- lbf  K.YASUDA  94.03.03 ----------------------*
     C                     SETOF                     02
     C           KEY3      CHAINFCEPL011             02
      *
     C           *IN02     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
      *
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C           *IN02     IFEQ '0'
     C           A2TRHZ    IFGT *DATE
     C                     MOVE OLD       WTKR
     C                     ELSE
     C                     MOVE NEW       WTKR
     C                     END
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     MOVE A2KSYT    WSYOT   1
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS   50
     C                     MOVE A2SSYT    WSYOT   1
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD1         A       20
     C                     Z-ADD15        B       20
     C                     DO   15        A
     C           TK,B      IFNE *BLANK
     C           TK,B      ANDNE'------'
     C           TK,B      ANDNE'++++++'
     C                     MOVE TK,B      WTKR
     C                     GOTO END6
     C                     END
     C                     SUB  1         B
     C                     ENDDO
     C           END6      TAG
     C                     END
     C                     END
      *---------------------------------------------------------------*
     C           TAN       IFEQ '1'
     C           WTANJ     IFNE 0
     C                     SETON                     U1
     C                     EXCPTDT3
     C                     END
     C                     END
      *
     C           TAN       IFEQ '2'
     C           WTANJ     ANDEQ0
     C                     SETON                     U1
     C                     EXCPTDT3
     C                     END
      *
     C           TAN       IFEQ '3'
     C                     SETON                     U1
     C                     EXCPTDT3
     C                     END
     C                     END
      *
     C           END5      TAG
     C                     END
     C           EXT5      TAG
     C                     END
      *
     OAAFWP61 E                DT1
     O                         WZETI      6
     O                         A3KSNK     7
     O                         A3SHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O                         A3MEKI    39
     O                         A3JOK1    41
     O                         A3JOK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
      *
     O        E                DT2
     O                         WZETI      6
     O                         O4KSKB     7
     O                         O4SHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O                         O4MEKI    39
     O                         O4JOK1    41
     O                         O4JOK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
      *
     O        E                DT3
     O                         WZETI      6
     O                         C2KSNK     7
     O                         C2SHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O                         C2MEKI    39
     O                         C2SJK1    41
     O                         C2SJK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
      *
     O        E                DT10
     O*****                    WZETI      6
     O*****                    C2KSNK     7
     O                         AESHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O*****                    C2MEKI    39
     O*****                    C2SJK1    41
     O*****                    C2SJK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
      *
     O        E                DT20
     O                         WZETI      6
     O                         L6KSNK     7
     O                         L6SHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O*****                    C2MEKI    39
     O*****                    C2SJK1    41
     O*****                    C2SJK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
      *
     O        E                DT99
     O                         WZETI      6
     O                         M6KSNK     7
     O                         M6SHIN    19
     O                         WSYOS     24
     O                         WSYOT     25
     O                         WTANJ     32
     O*****                    C2MEKI    39
     O*****                    C2SJK1    41
     O*****                    C2SJK2    43
     O                         WTOKU     47
     O                         WSIRE     51
     O                         WTKR      57
     O                         TAN       58
     O                         WTHIZ     66
     O                         A2TAHZ    74
     O                         FLG       75
     O                         @DSPKT    76
**  ER
E-01 THERE IS NOT DEPARTMENT CODE IN DETAILS M/F.
E-02 THERE IS NOT THE DATA THAT IS MADE
E-03 UNIT WEIGHT INSTRUCTION ISN'T RIGHT
E-04 PROCESS INSTRUCTION ISN'T RIGHT
