     H            Y
     F********************************************
     F* : CREATE A-PICS PART INVENTORY LIST    *
     F*         MAR.20,'87. T.SAWADA             *
     F********************************************
     FAAFPW21 CF  E                    WORKSTN
     FADANL11 IF  E           K        DISK
     FAH#PL13 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FADANP12 O   E           K        DISK                      A
     E                    MSG     1   4 60               d[ｰ xｮﾈｰﾆﾞ
     E                    CKNB       15  6               nﾃﾜﾌﾞ]k
     E                    CKTY       15  1               f]ﾌﾞ] ﾆｬﾓb
     I            DS
     I                                        1   6 F06
     I                                        1   1 F06A
     I                                        2   3 F06B
     I                                        4   5 F06C
     I                                        6   6 F06D
     I            DS
     I                                        1   9 PLC
     I                                        1   1 PLC1
     I                                        2   2 PLC2
     I                                        3   4 PLC3
     I                                        5   5 PLC4
     I                                        6   7 PLC5
     I                                        8   8 PLC6
     I                                        9   9 PLC7
     I            DS
     I                                        1  100NONUBI
     I                                        1   40NOYY
     I                                        5   60NOMM
     I                                        7   80NODD
     I                                        9  100NOBB
     I            DS
     I                                        1  90 CKNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  100CFSYXX
     I                                        1   80CFSYHZ
     I                                        9  100CFSYBB
     I            DS
     I                                        1  100CFMKXX
     I                                        1   80CFMKHZ
     I                                        9  100CFMKBB
     I            DS
     I                                        1  100CFKAXX
     I                                        1   80CFKAHZ
     I                                        9  100CFKABB
     C*
     C*/ SCR.CLR /
     C*
     C           *ENTRY    PLIST
     C                     PARM           SW      1
     C*
     C           KEY1      KLIST
     C                     KFLD           KTEI
     C                     KFLD           MEKI
     C                     KFLD           NIJI
     C*
     C           KEY2      KLIST
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
     C*
     C           KEY3      KLIST
     C                     KFLD           F06A
     C                     KFLD           F06B
     C                     KFLD           F06C
     C                     KFLD           F06D
     C*
     C                     MOVE *BLANK    SW
     C           STP00     TAG
     C                     Z-ADD0         KTEI
     C                     Z-ADD0         MEKI
     C                     Z-ADD0         NIJI
     C                     Z-ADD0         NONUBI
     C                     MOVE *BLANK    ERRMSG
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'0'       *IN,99
     C*
     C*/ SCR.DSP /
     C*
     C           STP10     TAG
     C                     EXFMTAAFPW211
     C                     MOVE *BLANK    ERRMSG
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*/ SCR.CHK /
     C                     MOVE *BLANK    ERRMSG
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'0'       *IN,99
     C*
     C                     MOVEA'000'     *IN,11
     C           KTEI      COMP 0                        11
     C           MEKI      COMP 0                        12
     C           NIJI      COMP 0                        13
     C   11 12 13          MOVEA'1'       *IN,99
     C           *IN,99    IFEQ '1'
     C                     MOVEA'111'     *IN,01
     C                     MOVE MSG,1     ERRMSG
     C                     GOTO STP10
     C                     END
     C*
     C   11N12             MOVEA'1'       *IN,99
     C           *IN,99    IFEQ '1'
     C                     MOVEA'1'       *IN,02
     C                     MOVE MSG,2     ERRMSG
     C                     GOTO STP10
     C                     END
     C   11N13             MOVEA'1'       *IN,99
     C           *IN,99    IFEQ '1'
     C                     MOVEA'1'       *IN,03
     C                     MOVE MSG,2     ERRMSG
     C                     GOTO STP10
     C                     END
     C   12N13             MOVEA'1'       *IN,99
     C           *IN,99    IFEQ '1'
     C                     MOVEA'1'       *IN,03
     C   99                MOVE MSG,2     ERRMSG
     C   99                GOTO STP10
     C                     END
     C*
     C           NONUBI    IFEQ 0
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVE MSG,3     ERRMSG
     C                     GOTO STP10
     C                     ELSE
     C           NOYY      IFLT 86
     C           NOMM      ORLT 01
     C           NOMM      ORGT 12
     C           NODD      ORLT 01
     C           NODD      ORGT 31
     C           NOBB      ORLT 01
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVE MSG,4     ERRMSG
     C                     GOTO STP10
     C                     END
     C                     END
     C*
     C*
     C*/平準化確定発注ﾎｦbﾓ /
     C                     MOVEL'*'       SW
     C           KEY1      SETLLADANL111
B001 C                     DO   *HIVAL                     // DO1
     C           KEY1      READEADANL111                 10
B002 C           *IN,10    IFEQ '0'                           R1
B003 C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     GOTO STP90
E003 C                     END
     C*
     C*/確定発注データ累積ﾎｦbﾓ /
     C                     Z-ADD0         BBB
     C           KEY2      SETLLAH#PL131
B001 C                     DO   *HIVAL                     // DO2
     C           KEY2      READEAH#PL131                 30
B002 C           *IN,30    IFEQ '0'                           R2
B003 C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLE*DATE
X003 C                     ELSE
     C                     Z-ADDCFBARL    XBARL
B004 C   12      CFSYXX    IFGE NONUBI
     C                     ADD  CFMAIS    BBB
E004 C                     END
B004 C   13      CFMKXX    IFGE NONUBI
     C                     ADD  CFMAIS    BBB
     C                     END
     C  N13      CFKAXX    IFGE NONUBI
     C                     ADD  CFMAIS    BBB
E004 C                     END
E003 C                     END                             R2
E002 C                     END                             R2
E001 C  N30                END                             // END2
     C*
     C*/社内かんばん切り替えuﾇj- /
     C           KEY2      CHAINAAMPL111             30
     C           *IN,30    IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,30
     C                     END
     C   30                GOTO STP90
     C*
     C                     MOVE *BLANK    KIND    1
     C                     MOVE *BLANK    PLC
     C                     Z-ADD1         I       50
     C           CBKDAI    LOKUPCKTY,I                   30
     C           *IN,30    IFEQ '1'
     C                     MOVELCKTY,I    KIND
     C                     MOVELCKNB,I    F06
     C                     MOVELF06A      PLC1
     C                     MOVEL'-'       PLC2
     C                     MOVELF06B      PLC3
     C                     MOVEL'-'       PLC4
     C                     MOVELF06C      PLC5
     C                     MOVEL'-'       PLC6
     C                     MOVELF06D      PLC7
     C                     END
     C*
     C*/ xｮgf]ﾌﾞ].uﾇj ﾑﾒ /
     C*
B001 C           KIND      IFEQ 'C'
     C           KEY3      SETLLAAFPL031
B002 C                     DO   *HIVAL
     C           KEY3      READEAAFPL031                 30
B003 C           *IN,30    IFEQ '0'
B004 C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
X004 C                     ELSE
B005 C           A3STHZ    IFEQ 99999999
     C*
     C*/ PRINT ROUTINE 1 /
     C*
     C                     Z-ADDA3KMAX    DDD
     C                     Z-ADD0         PER
B006 C           A3SSYS    IFNE 0
     C           A3KTSU    DIV  A3SSYS    PER       H
E006 C                     END
     C                     WRITEADANP121
     C                     MOVEA'1'       *IN,30
     C*
E005 C                     END
E004 C                     END
     C*
E003 C                     END
E002 C  N30                END
E001 C                     END
     C*
     C*/ n]rﾓf]ﾌﾞ].uﾇj ﾑﾒ /
     C*
B001 C           KIND      IFEQ 'D'
     C           KEY3      SETLLAAGPL031
B002 C                     DO   *HIVAL
     C           KEY3      READEAAGPL031                 30
B003 C           *IN,30    IFEQ '0'
B004 C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    ANDLE*DATE
X004 C                     ELSE
B005 C           O4STHZ    IFEQ 99999999
     C*
     C*/ PRINT ROUTINE 2 /
     C*
     C                     Z-ADDO4KMAX    DDD
     C                     Z-ADD0         PER
B006 C           O4SYOS    IFNE 0
     C           O4KTSU    DIV  O4SYOS    PER       H
E006 C                     END
     C                     WRITEADANP121
     C                     MOVEA'1'       *IN,30
     C*
E005 C                     END
E004 C                     END
     C*
E003 C                     END
E002 C  N30                END
E001 C                     END
     C*
     C*/ ﾍgnﾒf]ﾌﾞ].uﾇj ﾑﾒ /
     C*
B001 C           KIND      IFEQ 'E'
     C           KEY3      SETLLAAHPL031
B002 C                     DO   *HIVAL
     C           KEY3      READEAAHPL031                 30
B003 C           *IN,30    IFEQ '0'
B004 C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLE*DATE
X004 C                     ELSE
B005 C           L6STHZ    IFEQ 99999999
     C*
     C*/ PRINT ROUTINE 3 /
     C*
     C                     Z-ADDL6KMAX    DDD
     C                     Z-ADD0         PER
B006 C           L6SYOS    IFNE 0
     C           L6KTSU    DIV  L6SYOS    PER       H
E006 C                     END
     C                     WRITEADANP121
     C                     MOVEA'1'       *IN,30
     C*
E005 C                     END
E004 C                     END
     C*
E003 C                     END
E002 C  N30                END
E001 C                     END
     C*
     C           STP90     TAG
E002 C                     END
E001 C  N10                END
     C*
     C                     MOVEL'1'       *INLR
     C                     RETRN
**  MSG
E-01 INPUT PROCESSING DEPARTMENT
E-02 THE INPUT METHOD OF PROCESSING DEPARTMENT ISN'T RIGHT
E-03 INPUT DATE OF DELIVERY BIN
E-04 DATE OF DELIVERY BIN ISN'T RIGHT
