     H            Y.
     F** AAGR12 **********************************
     F* .. TUNNEL KANBAN DISKETT PUBLICATION || *.
     F* .. DATA UPDATE METHOD AUTOMATIC NUMBER OF SHEETS CHANGE *
     F* I-HASADA                   92.11.23      *
     F********************************** AAGR12 **
     FINPUT   IP  F     100            DISK
     FAAGPL03 UF  E           K        DISK
     IINPUT   AA  01
     I                                        1   1 ATKR1
     I                                        2   3 ATKR2
     I                                        4   5 ATKR3
     I                                        6   6 ATKR4
     I                                        7  100AUKYY
     I                                       11  120AUKMM
     I                                       13  140AUKDD
     I                                       15  160AUBIN
     I                                       17  17 ADTKO
     I                                       18  200AJDMS
     C           KEY       KLIST
     C                     KFLD           ATKR1
     C                     KFLD           ATKR2
     C                     KFLD           ATKR3
     C                     KFLD           ATKR4
     C                     KFLD           AUKYY
     C                     KFLD           AUKMM
     C                     KFLD           AUKDD
     C                     KFLD           AUBIN
      *
     C                     SETOF                     02
     C           KEY       CHAINAAGPL031             02
     C           *IN02     IFEQ '0'
     C                     MOVE '1'       O4DTKO
     C                     Z-ADD0         O4JDMS
     C                     UPDATAAGPL031
     C                     END
