     H            Y.
     F******************************************************
     F* LOQ/HAN
     F******************************************************
     FAAHPL03 IP  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FADHWPS1 O   F    2048            DISK
      *
     E                    TB1     1   8  2
      *
     C           L6SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
      *
     C           L6SBIN    IFNE 99
     C                     GOTO @END
     C                     END
      *
     C           L6SYOS    IFEQ 0
     C                     GOTO @END
     C                     END
      *
     C           L6KTSU    MULT 20        W@KTSU  90
     C           L6KTSU    DIV  L6SYOS    O@BXPD  51
      *
     C           AAAKEY    KLIST
     C                     KFLD           K@JOKN  2
     C                     KFLD           L6KCD1
      *
     C                     MOVE *BLANK    OOJOKM 20
     C                     Z-ADD1         @X      20
      *
     C                     MOVE *BLANK    O1JOKM 20
     C           L6JOK1    IFEQ *BLANK
     C                     MOVE '**'      L6JOK1
     C                     END
     C                     MOVE L6JOK1    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O1JOKM
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O1JOKM    OOJOKM
      *
     C                     MOVE *BLANK    O2JOKM 20
     C           L6JOK2    IFEQ *BLANK
     C                     MOVE '**'      L6JOK2
     C                     END
     C                     MOVE L6JOK2    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O2JOKM
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O2JOKM    OOJOKM
      *
     C                     MOVE *BLANK    O3JOKM 20
     C           L6JOK3    IFEQ *BLANK
     C                     MOVE '**'      L6JOK3
     C                     END
     C                     MOVE L6JOK3    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O3JOKM
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O3JOKM    OOJOKM
      *
     C                     MOVE L6SHN1    P@HIN1  5
     C                     MOVE L6SHN2    P@HIN2  5
     C                     MOVE L6SHN3    P@HIN3  2
     C                     MOVE L6ATK1    P@BAN1  1
     C                     MOVE L6ATK2    P@BAN2  2
     C                     MOVE L6ATK3    P@BAN3  2
     C                     MOVE L6ATK4    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'LOQ'     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
     C                     MOVE *BLANK    P@FLG   1
      *
     C                     CALL 'AAMRS8'  AAMRS8
      *
     C           AAMRS8    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@BAN1  1
     C                     PARM           P@BAN2  2
     C                     PARM           P@BAN3  2
     C                     PARM           P@BAN4  1
     C                     PARM           P@BMON  4
     C                     PARM           P@KOTE  3
     C                     PARM           P@KIBN  3
     C                     PARM           P@KHIN 12
     C                     PARM           P@FLG   1
      *
     C           P@BMON    IFNE *BLANK
     C                     GOTO @JUMP
     C                     END
      *
     C                     MOVE *BLANK    P@BAN1  1
     C                     MOVE *BLANK    P@BAN2  2
     C                     MOVE *BLANK    P@BAN3  2
     C                     MOVE *BLANK    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'HAN'     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
     C                     MOVE *BLANK    P@FLG   1
      *
     C                     CALL 'AAMRS8'  AAMRS8
      *
     C           P@BMON    IFNE *BLANK
     C                     GOTO @JUMP
     C                     END
      *
     C           P@BMON    IFEQ *BLANK
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE *BLANK    P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     GOTO @END
     C                     END
      *
     C           @JUMP     TAG
      *
     C           FCEKEY    KLIST
     C                     KFLD           L6SHN1
     C                     KFLD           L6SHN2
     C                     KFLD           L6SHN3
     C           FCEKEY    CHAINFCEPL01              44
     C   44                Z-ADD0         A2SOZI
     C   44                Z-ADD0         A2KASI
      *
     C                     EXCPTODAT
      *
     C           @END      TAG
      *
     OADHWPS1 E                ODAT
      *
     O                                      '="'
     O                         L6SHN1
     O                         L6SHN2
     O                         L6SHN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         L6ATK2
     O                                      '-'
     O                         L6ATK3
     O                                      '"'
     O                                      ','
     O                         A2KASI       '   0 .  '
     O                                      ','
     O                         L6KMAX
     O                                      ','
     O                         L6KTSU
     O                                      ','
     O                         L6SYOS
     O                                      ','
     O                         O@BXPD       '  0 . '
     O                                      ','
     O                                      '1'
     O                                      ','
     O                         P@BMON
     O                                      ','
     O                         P@KOTE
     O                                      ','
     O                         P@KIBN
     O                                      ','
** TB1
LC
DR
LG
M1
KW
D3
JL
TN
