     H            Y.
     F******************************************************
     F* SRT
JW1  F* JW      2017.09.12 ADD SORT 50
JW2  F* JW      2017.10.03 ADD SORT 01 - 59
JW3  F* JW      2018.03.14 ADD SORT 60 - 99
JW4  F* JW      2020.04.17 CHG APLC11 --> UTLC11
     F******************************************************
     FAAHPL03 IP  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAAFWPS3 O   F    2048            DISK
      *
      **JW4               TB1     1  12  2
JW4  E                    TB1     1 111  2
      **JW1               TB2     1  16  2
JW1   **JW2               TB2     1  17  2
JW2   **JW3               TB2     1  60  2
JW3  E                    TB2     1 100  2
     E                    JK          8  2
     E                    NM          8 20
      *工程
     I            DS
     I                                        1  16 JK
     I                                        1   2 L6JOK1
     I                                        3   4 L6JOK2
     I                                        5   6 L6JOK3
     I                                        7   8 L6JOK4
     I                                        9  10 L6JOK5
     I                                       11  12 L6JOK6
     I                                       13  14 L6JOK7
     I                                       15  16 L6JOK8
      *
     C           L6SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
      *
     C           L6SBIN    IFNE 99
     C                     GOTO @END
     C                     END
      *
     C           L6SYOS    IFEQ 0
     C                     GOTO @END
     C                     END
      *
     C           L6KTSU    MULT 20        W@KTSU  90
     C           L6KTSU    DIV  L6SYOS    O@BXPD  51
      *
     C           AAAKEY    KLIST
     C                     KFLD           K@JOKN  2
     C                     KFLD           L6KCD1
      *
     C                     MOVE *BLANK    OOJOKM 20
     C                     MOVE *BLANK    OOJOK2 20
     C                     Z-ADD1         @X      20
      * L6JOK1
     C                     MOVE *BLANK    O1JOKM 20
     C           L6JOK1    IFEQ *BLANK
     C                     MOVE '**'      L6JOK1
     C                     END
     C                     MOVE L6JOK1    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O1JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O1JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O1JOKM    OOJOK2
      * L6JOK2
     C                     MOVE *BLANK    O2JOKM 20
     C           L6JOK2    IFEQ *BLANK
     C                     MOVE '**'      L6JOK2
     C                     END
     C                     MOVE L6JOK2    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O2JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O2JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O2JOKM    OOJOK2
      * L6JOK3
     C                     MOVE *BLANK    O3JOKM 20
     C           L6JOK3    IFEQ *BLANK
     C                     MOVE '**'      L6JOK3
     C                     END
     C                     MOVE L6JOK3    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O3JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O3JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O3JOKM    OOJOK2
      * L6JOK4
     C                     MOVE *BLANK    O4JOKM 20
     C           L6JOK4    IFEQ *BLANK
     C                     MOVE '**'      L6JOK4
     C                     END
     C                     MOVE L6JOK4    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O4JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O4JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O4JOKM    OOJOK2
      * L6JOK5
      *
     C           L6JOK5    IFEQ '11'
     C                     Z-ADD0         SAKA
     C                     END
      *
     C                     MOVE *BLANK    O5JOKM 20
     C           L6JOK5    IFEQ *BLANK
     C                     MOVE '**'      L6JOK5
     C                     END
     C                     MOVE L6JOK5    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O5JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O5JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O5JOKM    OOJOK2
      * L6JOK6
     C                     MOVE *BLANK    O6JOKM 20
     C           L6JOK6    IFEQ *BLANK
     C                     MOVE '**'      L6JOK6
     C                     END
     C                     MOVE L6JOK6    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O6JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O6JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O6JOKM    OOJOK2
      * L6JOK7
     C                     MOVE *BLANK    O7JOKM 20
     C           L6JOK7    IFEQ *BLANK
     C                     MOVE '**'      L6JOK7
     C                     END
     C                     MOVE L6JOK7    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O7JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O7JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O7JOKM    OOJOK2
      * L6JOK8
     C                     MOVE *BLANK    O8JOKM 20
     C           L6JOK8    IFEQ *BLANK
     C                     MOVE '**'      L6JOK8
     C                     END
     C                     MOVE L6JOK8    K@JOKN
     C           AAAKEY    CHAINAAAPL01              88
     C  N88                MOVE A5JOKM    O8JOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB1,@X                   55
     C   55                MOVE O8JOKM    OOJOKM
     C                     Z-ADD1         @X      20
     C           K@JOKN    LOKUPTB2,@X                   55
     C   55                MOVE O8JOKM    OOJOK2
      *
     C           OOJOKM    IFEQ *BLANK
     C                     GOTO @END
     C                     END
      *
     C           OOJOK2    IFNE *BLANK
     C                     Z-ADD0         SAKA    40
     C                     END
      *
     C                     MOVE L6SHN1    P@HIN1  5
     C                     MOVE L6SHN2    P@HIN2  5
     C                     MOVE L6SHN3    P@HIN3  2
     C                     MOVE L6ATK1    P@BAN1  1
     C                     MOVE L6ATK2    P@BAN2  2
     C                     MOVE L6ATK3    P@BAN3  2
     C                     MOVE L6ATK4    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'LOQ'     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
     C                     MOVE *BLANK    P@FLG   1
      *
     C                     CALL 'AAMRS8'  AAMRS8
      *
     C           AAMRS8    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@BAN1  1
     C                     PARM           P@BAN2  2
     C                     PARM           P@BAN3  2
     C                     PARM           P@BAN4  1
     C                     PARM           P@BMON  4
     C                     PARM           P@KOTE  3
     C                     PARM           P@KIBN  3
     C                     PARM           P@KHIN 12
     C                     PARM           P@FLG   1
      *
     C           P@BMON    IFNE *BLANK
     C                     GOTO @JUMP
     C                     END
      *
     C                     MOVE *BLANK    P@BAN1  1
     C                     MOVE *BLANK    P@BAN2  2
     C                     MOVE *BLANK    P@BAN3  2
     C                     MOVE *BLANK    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'HAN'     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
     C                     MOVE *BLANK    P@FLG   1
      *
     C                     CALL 'AAMRS8'  AAMRS8
      *
     C           P@BMON    IFNE *BLANK
     C                     GOTO @JUMP
     C                     END
      *
     C           P@BMON    IFEQ *BLANK
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE *BLANK    P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C* * *                GOTO @END
     C                     END
      *
     C           @JUMP     TAG
      *
     C           FCEKEY    KLIST
     C                     KFLD           L6SHN1
     C                     KFLD           L6SHN2
     C                     KFLD           L6SHN3
     C           FCEKEY    CHAINFCEPL01              44
     C   44                Z-ADD0         A2SOZI
     C   44                Z-ADD0         A2KASI
      *
     C                     MOVELOOJOKM    U@CHR1128
     C                     MOVELOOJOK2    U@CHR2128
     C                     MOVEL*BLANK    U@CHR3128
     C*
JW4  C**                   CALL 'APLC11'
"    C                     CALL 'UTLC11'
     C                     PARM           U@CHR1
     C                     PARM           U@CHR2
     C                     PARM           U@CHR3
      *
     C                     MOVELU@CHR3    O@SRT  20
      *
     C                     EXCPTODAT
      *
     C           @END      TAG
      *
     OAAFWPS3 E                ODAT
      *
     O                                      '="'
     O                         L6SHN1
     O                         L6SHN2
     O                         L6SHN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         L6ATK2
     O                                      '-'
     O                         L6ATK3
     O                                      '"'
     O                                      ','
     O                         L6KMAX
     O                                      ','
     O                         L6KTSU
     O                                      ','
     O                         L6SYOS
     O                                      ','
     O                         O@BXPD       '  0 . '
     O                                      ','
     O* * *                    P@BMON
     O* * *                                 ','
     O* * *                    P@KOTE
     O* * *                                 ','
     O* * *                    P@KIBN
     O* * *                                 ','
     O                         O@SRT
     O                                      ','
     O* * *                    OOJOKM
     O* * *                                 ','
     O* * *                    OOJOK2
     O* * *                                 ','
     O* * *                    L6JOK1
     O* * *                                 ':'
     O* * *                    O1JOKM
     O* * *                                 ','
     O* * *                    L6JOK2
     O* * *                                 ':'
     O* * *                    O2JOKM
     O* * *                                 ','
     O* * *                    L6JOK3
     O* * *                                 ':'
     O* * *                    O3JOKM
     O* * *                                 ','
     O* * *                    L6JOK4
     O* * *                                 ':'
     O* * *                    O4JOKM
     O* * *                                 ','
     O* * *                    L6JOK5
     O* * *                                 ':'
     O* * *                    O5JOKM
     O* * *                                 ','
     O* * *                    L6JOK6
     O* * *                                 ':'
     O* * *                    O6JOKM
     O* * *                                 ','
     O* * *                    L6JOK7
     O* * *                                 ':'
     O* * *                    O7JOKM
     O* * *                                 ','
     O* * *                    L6JOK8
     O* * *                                 ':'
     O* * *                    O8JOKM
     O* * *                                 ','
** TB1
SL
SO
SZ
T1
T2
T3
T4
T5
T6
T7
T8
T9
01
02
03
04
05
06
07
08
09
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
** TB2
01
02
03
04
05
06
07
08
09
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99

