     H            Y.
     F** AAIR33 **************************************
     F* UPDATE PICKUP TIME CONTROL M/F               *
     F*        ITS.         2012.11.05               *
     F************************************************
     FAAIPW33 CF  E                    WORKSTN
     FAAIWP31 IF  E                    DISK
     FFGBPL01 IF  E           K        DISK
     E                    BI         12  2 0
     E                    TI         12  4 0
     E                    AJ         12  1 0
     E                    D1BI       12  2 0
     E                    D1TI       12  4 0
     E                    D1AJ       12  1 0
     E                    ER      1  19 65
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     IDBI         DS
     I                                        1  240D1BI
     I                                        1   20D1BI01
     I                                        3   40D1BI02
     I                                        5   60D1BI03
     I                                        7   80D1BI04
     I                                        9  100D1BI05
     I                                       11  120D1BI06
     I                                       13  140D1BI07
     I                                       15  160D1BI08
     I                                       17  180D1BI09
     I                                       19  200D1BI10
     I                                       21  220D1BI11
     I                                       23  240D1BI12
      *
     IDTI         DS
     I                                        1  480D1TI
     I                                        1   40D1TI01
     I                                        5   80D1TI02
     I                                        9  120D1TI03
     I                                       13  160D1TI04
     I                                       17  200D1TI05
     I                                       21  240D1TI06
     I                                       25  280D1TI07
     I                                       29  320D1TI08
     I                                       33  360D1TI09
     I                                       37  400D1TI10
     I                                       41  440D1TI11
     I                                       45  480D1TI12
      *
     IDAJ         DS
     I                                        1  120D1AJ
     I                                       01  010D1AJ01
     I                                       02  020D1AJ02
     I                                       03  030D1AJ03
     I                                       04  040D1AJ04
     I                                       05  050D1AJ05
     I                                       06  060D1AJ06
     I                                       07  070D1AJ07
     I                                       08  080D1AJ08
     I                                       09  090D1AJ09
     I                                       10  100D1AJ10
     I                                       11  110D1AJ11
     I                                       12  120D1AJ12
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              X'0E0F40'             C         WKCKCH
     I              ' MORE ...'           C         CMT1
     I              ' LAST ...'           C         CMT2
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1KOSN  1
     C                     PARM           P1BMON  4
     C                     PARM           PCMD    2
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
     C                     MOVELP1BMON    C1BMON
     C                     MOVEL*BLANK    C1BMNM
     C                     MOVELP1BMON    #KCODE  40
     C                     EXSR #SB800
      *
     C                     Z-ADD0         WKPAG   30
     C                     EXSR #SB110
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * SET FIELD                                          *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     CLEARBI
     C                     CLEARTI
     C                     CLEARAJ
      *
     C                     SETON                     414243
     C                     SETON                     444546
     C                     SETON                     474849
     C                     SETON                     505152
     C                     SETON                     616263
     C                     SETON                     646566
     C                     SETON                     676869
     C                     SETON                     707172
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     262728
     C                     SETOF                     293031
     C                     SETOF                     323334
      *
     C           WKPAG     MULT 12        WKRRN   40
     C                     ADD  1         WKRRN
      *
     C                     SETOF                     90
     C           P1KOSN    IFEQ '0'
     C           P1KOSN    OREQ '1'
     C                     SETON                     90
     C                     ENDIF
      *
     C                     MOVEL*BLANK    D1CMT
     C                     Z-ADD1         X       20
     C           WKRRN     SETLLAAIWP311
     C                     READ AAIWP311                 89
     C           *IN89     DOWEQ'0'
     C           X         ANDLE12
     C                     MOVE W1BIN     BI,X
     C                     MOVE W1TIME    TI,X
     C                     MOVE W1ADJS    AJ,X
     C           X         ADD  60        Y       20
     C                     MOVEL'0'       *IN,Y
      *
     C           P1KOSN    IFEQ '1'
     C           P1KOSN    OREQ '2'
     C           X         ADD  40        Y       20
     C                     MOVEL'0'       *IN,Y
     C                     ENDIF
     C                     ADD  1         X
     C                     READ AAIWP311                 89
     C                     ENDDO
      *
     C           *IN89     IFEQ '0'
     C                     MOVELCMT1      D1CMT
     C                     ELSE
     C                     MOVELCMT2      D1CMT
     C                     ENDIF
      *
     C                     MOVEABI        D1BI
     C                     MOVEATI        D1TI
     C                     MOVEAAJ        D1AJ
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      * CONTROL                                          *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * 1ST.                                             *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAAIPW331
     C                     SETOF                     313233
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     269930
     C                     SETOF                     232425
     C                     SETOF                     262728
     C                     SETOF                     293031
     C                     SETOF                     323334
     C                     MOVEL*BLANK    D1ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '03'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     EXSR #SB400
     C           *IN99     IFEQ '1'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     EXSR #SB410
     C           *IN99     IFEQ '1'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE12
     C                     EXSR #SB402
     C                     ADD  1         X
     C                     ENDDO
      *
     C           *IN91     IFEQ '1'
     C           *IN89     IFEQ '0'
     C                     ADD  1         WKPAG
     C                     EXSR #SB110
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN92     IFEQ '1'
     C           WKPAG     IFNE 0
     C                     SUB  1         WKPAG
     C                     EXSR #SB110
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ '1'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     MOVE '99'      DSPSW   2
     C                     MOVE '05'      PCMD
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     Z-ADD1         X
     C                     CLEARTI
     C                     MOVEAD1TI      TI
     C           X         DOWLE12
     C           *IN99     ANDEQ'0'
     C                     MOVE TI,X      MIN     20
     C           TI,X      IFGE 2400
     C                     MOVELER,1      D1ERR
     C                     EXSR #SB401
     C                     ENDIF
     C           MIN       IFGE 60
     C                     MOVELER,2      D1ERR
     C                     EXSR #SB401
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB401    BEGSR
      *
     C                     SETON                     99
     C           X         ADD  10        X
     C                     MOVEL'1'       *IN,X
      *
     CSR         ESB401    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     Z-ADD1         X
     C                     CLEARAJ
     C                     MOVEAD1AJ      AJ
     C           X         DOWLE12
     C           *IN99     ANDEQ'0'
     C           AJ,X      IFGT 1
     C                     MOVELER,3      D1ERR
     C                     EXSR #SB411
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB410    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB411    BEGSR
      *
     C                     SETON                     99
     C           X         ADD  22        X
     C                     MOVEL'1'       *IN,X
      *
     CSR         ESB411    ENDSR
      *----------------------------------------------------*
      * SET WORK FILE                                      *
      *----------------------------------------------------*
     CSR         #SB402    BEGSR
      *
     C                     MOVELP1BMON    P2BMON
     C                     MOVELD1BI,X    P2BIN
     C                     MOVELD1TI,X    P2TIME
     C                     MOVELD1AJ,X    P2ADJS
     C                     CALL 'AAIR34'
     C                     PARM           P2BMON  4
     C                     PARM           P2BIN   2
     C                     PARM           P2TIME  4
     C                     PARM           P2ADJS  1
      *
     CSR         ESB402    ENDSR
      *----------------------------------------------------*
      * DETAIL M/F                                         *
      *----------------------------------------------------*
     CSR         #SB800    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C           #KCODE    SETLLFGBPL011
     C           #KCODE    READEFGBPL011                 20
     C           *IN20     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET
     C                     MOVELB2SMEI    C1BMNM
     C                     ENDIF
     C           #KCODE    READEFGBPL011                 20
     C                     ENDDO
      *
     CSR         ESB800    ENDSR
**
ER-01 INPUT 00:00 - 23:59
ER-02 MINUTE ERR.INPUT 00 - 59.
ER-03 INPUT 0 OR 1.
