     H            Y.
     H*********************************************
     H* INQUIRY OF CALCULATION BIN M/F BY TIME . RPG.. *
     H* BY.GBC                          87.01.16  *
     H*********************************************
     FAAIPW13 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FAAIPL11 IF  E           K        DISK
     E                    ERR     1   3 60
     I            DS
     I                                        1   80CDSTHZ
     I                                        1   40CDSTYY
     I                                        5   60CDSTMM
     I                                        7   80CDSTDD
     I            DS
     I                                        1   80CDENHZ
     I                                        1   40CDENYY
     I                                        5   60CDENMM
     I                                        7   80CDENDD
     IFEEDBK      DS
     I                                     *STATUS  @STTS
     C**
     C** ﾌﾟ[xｰjｰ  (ﾏｰﾅﾞｰ ﾃｰnﾞ)
     C**
     C           *ENTRY    PLIST
     C                     PARM           XXUSER 10
     C**
     C** PROGRAM START fﾞx]1 (AAIPW131) ﾉ hﾒaｰ
     C**
     C           STEP01    TAG
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD0         DDBUMN
     C**
     C** fﾞx]1(AAIPW131)  ﾉ ﾍｭcﾆﾞ
     C**
     C           STEP02    TAG
     C                     WRITEAAIPW131
     C                     READ AAIPW13                0203
     C           *IN02     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE ERR,3     DDERR
     C                     GOTO STEP02
     C                     END
     C   KA                SETON                     LR
     C   KA                RETRN
     C**
     C**
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C**
     C** ﾎﾞy] ﾉ kｩｮh
     C**  96.09.25 IAF
     C           DDBUMN    COMP 0111                     90
     C  N90                SETON                     0199
     C  N90                MOVELERR,1     DDERR
     C  N90                GOTO STEP02
     C**
     C** uﾇjｰ ﾉ kｩｮh
     C**
     C           DDBUMN    CHAINAAIPL111             90
     C   90                SETON                     0199
     C   90                MOVELERR,2     DDERR
     C   90                GOTO STEP02
     C**
     C** fﾞx]2 (AAIPW132) ﾉ ﾍｭcﾆﾞ
     C**
     C           STEP03    TAG
     C                     WRITEAAIPW132
     C                     READ AAIPW13                0203
     C           *IN02     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE ERR,3     DDERR
     C                     GOTO STEP03
     C                     END
     C                     GOTO STEP01
**   ERR
E-01 DEPARTMENT CODE ISN'T RIGHT
E-02 IT IS NOT INPUT IN CALCULATION BIN M/F BY TIME
E-03 DON'T LEAVE LONG TIME. RETERN TO SCREEN OF A PASSWORD.
