     H            Y.
     F** AAIR31 **************************************
     F* UPDATE PICKUP TIME CONTROL M/F               *
     F*        ITS.         2012.11.05               *
     F************************************************
     FAAIPW31 CF  E                    WORKSTN
     FAAIPL11 IF  E           K        DISK
     FAAIPL31 IF  E           K        DISK
     E                    ER      1  19 65
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              X'0E0F40'             C         WKCKCH
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1KOSN  1
     C                     PARM           P1BMON  4
     C                     PARM           PCMD    2
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C           KEYGC1    KLIST
     C                     KFLD           #KMBMN  40
      *
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
     C                     MOVEL*BLANK    D1KOSN
     C                     Z-ADD0         D1BMON
     C                     MOVEL*BLANK    PCMD
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      *   主処理                                         *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *   終了処理                                       *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      *   第一画面表示                                   *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAAIPW311
     C                     SETOF                     313233
     C                     SETOF                     9934
     C                     MOVEL*BLANK    D1ERR
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVE '01'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1KOSN    IFEQ *BLANK
     C                     MOVELER,1      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1KOSN    IFEQ '0'
     C           D1KOSN    OREQ '1'
     C           D1KOSN    OREQ '2'
     C                     ELSE
     C                     MOVELER,2      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1BMON    IFEQ 0
     C                     MOVELER,1      D1ERR
     C                     SETON                     3299
     C                     GOTO ESB210
     C                     ENDIF
     C                     MOVELD1BMON    #KCODE  40
     C                     EXSR #SB800
     C           GET       IFEQ '0'
     C                     MOVELER,3      D1ERR
     C                     SETON                     3299
     C                     GOTO ESB210
     C                     ENDIF
      *マスター
     C           KEYG21    KLIST
     C                     KFLD           #KBMON  40
     C                     MOVELD1BMON    #KBMON
     C                     MOVEL'0'       GET
     C           KEYG21    SETGTAAIPL311             21
     C           KEYG21    REDPEAAIPL311                 21
     C           *IN21     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           G2SKJY    IFEQ 'D'
     C           G2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           KEYG21    REDPEAAIPL311                 21
     C                     ENDDO
      *
     C           GET       IFEQ '0'
     C           D1KOSN    IFEQ '0'
     C           D1KOSN    OREQ '1'
     C                     MOVELER,5      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDIF
      *
     C           GET       IFEQ '1'
     C           D1KOSN    IFEQ '2'
     C                     MOVELER,6      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELD1KOSN    P1KOSN
     C                     MOVELD1BMON    P1BMON
     C                     MOVE '05'      PCMD
     C                     MOVE '99'      DSPSW   2
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * AAIPL11                                            *
      *----------------------------------------------------*
     CSR         #SB800    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C           #KCODE    CHAINAAIPL111             20
     C           *IN20     IFEQ '0'
     C                     MOVEL'1'       GET
     C                     ENDIF
      *
     CSR         ESB800    ENDSR
**
ER-01 INPUT THIS FIELD.
ER-02 INPUT 0,1,2.
ER-03 THERE ARE NO DATA.(AAIPP11)
ER-04
ER-05 THERE ARE NO DATA.
ER-06 ALREADY INPUTED.
ER-07
ER-08
ER-09
