     H            Y.
     H** AAJR15 ********************************************
     H* INTRA PROCESS LOCATION SMALL BLOCK AUTOMATIC  RESET
     H*            M-OKUDA             86.12.08            *
     H******************************************************
     FAAJPW15 CF  E                    WORKSTN
     FAAJTL11 UF  E           K        DISK
     E                    ER      1   2 60               d[ｰ xｮﾈｰﾆﾞ
     I            DS
     I                                        1   2 BLOK
     I                                        1   1 DDDAIB
     I                                        2   2 DDCHYU
     I            DS
     I                                        1   2 DBLOK
     I                                        1   1 CJBLK1
     I                                        2   2 CJBLK2
     I            DS
     I                                        1  100CJYMDB
     I                                        1   40CJCHYY
     I                                        5   60CJCHMM
     I                                        7   80CJCHDD
     I                                        9  100CJCHBI
     I            DS
     I                                        1  100UYMDB
     I                                        1   80UHIZK
     I                                        9  100UBIN
     C                     Z-ADD*DATE     UHIZK
     C                     Z-ADD1         UBIN
     C                     Z-ADD0         DDBUMN  40
     C                     MOVE *BLANK    DDDAIB  1
     C                     MOVE *BLANK    DDCHYU  1
     C******************************************************
     C* M-NO               ﾅbﾈｮmb ﾉ ﾆﾞｭci] ･ ﾑvﾃv          *
     C******************************************************
     C           STEP01    TAG
     C                     EXFMTAAJPW151
     C           *INKA     IFEQ '1'
     C                     GOTO END
     C                     END
     C                     SETOF                     010203
     C                     SETOF                     99
     C           DDBUMN    IFNE 8990
     C           DDBUMN    IFNE 8982
     C           DDBUMN    IFNE 8974
     C           DDBUMN    IFNE 9032
     C           DDBUMN    IFNE 0111
     C                     SETON                     9901
     C                     MOVE ER,1      MSG    60
     C                     GOTO STEP01
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C           BLOK      IFEQ *BLANK
     C                     SETON                     990203
     C                     MOVE ER,2      MSG
     C                     GOTO STEP01
     C                     END
     C           BLOK      IFEQ '99'
     C                     MOVE *BLANK    BLOK1   1
     C                     MOVE *BLANK    BLOK2   1
     C                     ELSE
     C                     MOVE DDDAIB    BLOK1
     C                     MOVE DDCHYU    BLOK2
     C                     END
     C******************************************************
     C* M-NO               ﾃcmbob nﾃﾜﾌﾞ]k p fiﾞ]k ﾆmb      *
     C******************************************************
     C           BNKEY     KLIST
     C                     KFLD           DDBUMN
     C                     KFLD           BLOK1
     C                     KFLD           BLOK2
     C                     KFLD           BANH2
     C                     KFLD           BANH3
     C                     KFLD           BANH4
     C                     KFLD           ENYY
     C                     KFLD           ENMM
     C                     KFLD           ENDD
     C                     KFLD           ENBB
     C                     MOVE *BLANK    BANH2   2
     C                     MOVE *BLANK    BANH3   2
     C                     MOVE *BLANK    BANH4   1
     C                     Z-ADD0         ENYY    40
     C                     Z-ADD0         ENMM    20
     C                     Z-ADD0         ENDD    20
     C                     Z-ADD0         ENBB    20
     C           BNKEY     SETLLAAJTL111
     C           STEP02    TAG
     C                     READ AAJTL11                  11
     C           *IN11     CABEQ'1'       END
     C           CJBMON    CABNEDDBUMN    END
     C           BLOK      IFNE '99'
     C           CJBLK1    CABNEDDDAIB    END
     C           CJBLK2    CABNEDDCHYU    END
     C                     END
     C           CJYMDB    CABLTUYMDB     STEP03
     C           DBLOK     IFNE KBLOK
     C                     MOVE DBLOK     KBLOK   2
     C                     Z-ADD1         SEQ     30
     C                     ELSE
     C           SEQ       ADD  2         SEQ
     C                     END
     C                     Z-ADDSEQ       CJBLK3
     C                     UPDATAAJTL111
     C                     GOTO STEP02
     C           STEP03    TAG
     C                     Z-ADD0         CJBLK3
     C                     UPDATAAJTL111
     C                     GOTO STEP02
     C           END       TAG
     C                     SETON                     LR
**       ERROR MESSAGE
E-01 DEPARTMENT THAT RESETS SMALL BLOCK IS WRONG
E-02 IT IS NOT APPOINTED LARGE MEDIUM BLOCK THAT RESETTING
