     H            Y.
      ****************************************************************
      *     PROGRAM NAME. : CREATE INTRA-PROCESS LOCATION CODE M/F ACCOUNT BOOK
      *     PROGRAM ID.   : AAJR13.      <RPG>                       *
      *     CREATE DATE.  : SEP.18,'86.                              *
      *     AUTHOR.       : E.K                                      *
      ****************************************************************
     FAAJPW12 CF  E                    WORKSTN
     FAAJPL11 IF  E           K        DISK
     FAAJTL12 IF  E           K        DISK
     FAAJTL15 IF  E           K        DISK
     FAAJTL16 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAAJPR12 O   E             21     PRINTER                        UC
     FAAJPR13 O   E             22     PRINTER                        UC
     F*
     E                    CD      1  24  1   ME     20   f]ﾌﾞ]jﾞbxbﾆｭc
     E                    TAB1    1  35  2   TAB2    8   f]ﾌﾞ] ﾆｬﾓb xb
     E                    TAB3    1   7  1   TAB4    4   bﾜxb
     E                    COM     1   1 26               jbnﾓ
     E                    TYT     1   1 26               vjﾞﾆ
     E                    MSG     1   8 60               d[ｰ xｮﾈｰﾆﾞ
     E*
     I            DS
     I                                        1   6 FROM
     I                                        1   1 FROM1
     I                                        2   3 FROM2
     I                                        4   5 FROM3
     I                                        6   6 FROM4
     I            DS
     I                                        1   6 TO
     I                                        1   1 TO1
     I                                        2   3 TO2
     I                                        4   5 TO3
     I                                        6   6 TO4
     I            DS
     I                                        1   6 CJBAN
     I                                        1   1 CJBAN1
     I                                        2   3 CJBAN2
     I                                        4   5 CJBAN3
     I                                        6   6 CJBAN4
     I            DS
     I                                        1   2 CJSDYO
     I                                        1   10CJSDAI
     I                                        2   2 CJSSYO
     I            DS
     I                                        1   80CHHZK
     I                                        1   40CJCHYY
     I                                        3   40CJCHY2
     I                                        5   60CJCHMM
     I                                        7   80CJCHDD
     I            DS
     I                                        1   40CJAKYY
     I                                        3   40CJAKY2
     C****************************************************************
     C*  START PROGRAM  <AAJR13>                                     *
     C****************************************************************
     C                     MOVE *BLANK    TYTLE
     C                     MOVE *BLANK    MIDASI
     C                     MOVELCOM,1     TYTLE
     C                     MOVELTYT,1     MIDASI
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C*
     C*
     C           STP1      TAG
     C                     EXFMTAAJPW121
     C   KA                SETON                     LR
     C   KA                RETRN
     C*
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'0'       *IN,99
     C*
     C           CODE      IFEQ 0
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           CODE      IFNE 0111
     C                     MOVELMSG,2     ERRMSG
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C           TO        IFEQ *BLANK
     C                     MOVE *HIVAL    TO
     C                     END
     C           FROM      IFGT TO
     C                     MOVELMSG,3     ERRMSG
     C                     MOVEA'11'      *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C           KEYA      KLIST
     C                     KFLD           FROM1
     C                     KFLD           FROM2
     C                     KFLD           FROM3
     C                     KFLD           FROM4
     C           KEYA      SETLLAAJPL111             10
     C           *IN,10    IFEQ '1'
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           TYPE      IFEQ *BLANK
     C                     MOVELMSG,4     ERRMSG
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           TYPE      IFNE 'A'
     C           TYPE      IFNE 'B'
     C                     MOVELMSG,5     ERRMSG
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C                     END
     C*
     C           TYPE2     IFNE 'A'
     C           TYPE2     IFNE 'B'
     C           TYPE2     IFNE 'C'
     C                     MOVELMSG,8     ERRMSG
     C                     MOVEA'1'       *IN,05
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
     C*
     C*  LET'S PRINT OUT
     C*
     C                     MOVEA'11'      *IN,21
     C                     MOVEA'0'       *IN,80
     C                     MOVEA'00'      *IN,50
     C                     Z-ADD0         XXBMON  40
     C                     Z-ADD0         TOTAL
     C                     MOVE *BLANK    SW      1
     C                     MOVE *BLANK    RSW     1
     C                     MOVE *BLANK    OBANC   6
     C*
     C           KEYB      KLIST
     C                     KFLD           CODE
     C                     KFLD           FROM1
     C                     KFLD           FROM2
     C                     KFLD           FROM3
     C                     KFLD           FROM4
     C*
     C*   FILE SET
     C*
     C           TYPE2     IFEQ 'A'
     C           CODE      IFEQ 9999
     C                     MOVE '1'       RSW
     C           KEYA      SETLLAAJPL111
     C                     ELSE
     C                     MOVE '2'       RSW
     C           KEYB      SETLLAAJTL121
     C                     END
     C                     END
     C*
     C           TYPE2     IFEQ 'B'
     C           CODE      IFEQ 9999
     C                     MOVE '3'       RSW
     C           KEYA      SETLLAAJTL161
     C                     ELSE
     C                     MOVE '4'       RSW
     C           KEYB      SETLLAAJTL151
     C                     END
     C                     END
     C*
     C           TYPE2     IFEQ 'C'
     C                     MOVE '5'       RSW
     C           KEYA      SETLLAAJPL111
     C                     END
     C*
     C                     DO   *HIVAL
     C*
     C*   FILE READ
     C*
     C           RSW       IFEQ '1'
     C                     READ AAJPL111                 90
     C                     ELSE
     C           RSW       IFEQ '2'
     C           CODE      READEAAJTL121                 90
     C                     ELSE
     C           RSW       IFEQ '3'
     C                     READ AAJTL161                 90
     C                     ELSE
     C           RSW       IFEQ '4'
     C           CODE      READEAAJTL151                 90
     C                     ELSE
     C           RSW       IFEQ '5'
     C                     READ AAJPL111                 90
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C           *IN,90    IFEQ '0'
     C           CJBAN     IFLE TO
     C*
     C*   ﾆﾞｭci] CHEK
     C*
     C           *DATE     IFLE CHHZK
     C                     MOVEA'1'       *IN,50
     C                     END
     C           CJBANC    IFNE OBANC
     C                     MOVEA'1'       *IN,51
     C                     MOVE CJBANC    OBANC
     C                     END
     C           RSW       IFEQ '1'
     C           RSW       OREQ '2'
     C           RSW       OREQ '3'
     C           RSW       OREQ '4'
     C           *IN,50    IFEQ '0'
     C           *IN,51    OREQ '0'
     C                     GOTO STP20
     C                     END
     C                     END
     C           RSW       IFEQ '1'
     C           RSW       OREQ '2'
     C           RSW       OREQ '3'
     C           RSW       OREQ '4'
     C           *IN,50    IFEQ '1'
     C           *IN,51    ANDEQ'1'
     C                     MOVEA'00'      *IN,50
     C                     END
     C                     END
     C*
     C*   nﾌﾞﾆ & END
     C*
     C           CODE      IFNE 9999
     C           RSW       IFEQ '2'
     C           RSW       OREQ '4'
     C           CODE      IFNE CJBMON
     C                     MOVEA'1'       *IN,90
     C                     GOTO STP20
     C                     END
     C                     ELSE
     C           CODE      CABNECJBMON    STP20
     C                     END
     C                     END
     C*
     C           *IN,80    IFEQ '0'
     C                     MOVEL'*'       SW
     C                     Z-ADDCJBMON    XXBMON
     C                     MOVEA'1'       *IN,80
     C                     END
     C*
     C*   jﾞbkｭc jbﾎﾟ = 'A'
     C*
     C           TYPE      IFEQ 'A'
     C           *IN,23    IFEQ '0'
     C                     SETON                     23
     C                     OPEN AAJPR12
     C                     END
     C           CJBMON    IFNE XXBMON
     C           *IN,21    IFEQ '1'
     C           XXBMON    CHAINFGBPL011             10
     C   10                MOVEL*BLANK    B2SMEI
     C                     WRITEHED1
     C                     MOVEA'0'       *IN,21
     C                     END
     C                     WRITETOT1
     C                     Z-ADD0         TOTAL
     C                     MOVEA'1'       *IN,21
     C                     Z-ADDCJBMON    XXBMON
     C                     END
     C*
     C           *IN,21    IFEQ '1'
     C           CJBMON    CHAINFGBPL011             10
     C   10                MOVEL*BLANK    B2SMEI
     C                     WRITEHED1
     C                     MOVEA'0'       *IN,21
     C                     END
     C                     MOVE *BLANK    SYUNAM
     C           CJSDYO    LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      SYUNAM
     C                     MOVE *BLANK    IRONM
     C           CJCOCR    LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      IRONM
     C                     Z-ADD1         M       20
     C           CJKDAI    LOKUPCD,M                     11
     C           *IN11     IFEQ '1'
     C                     MOVE ME,M      T3NAMK 20
     C                     ELSE
     C                     MOVE *BLANK    T3NAMK
     C                     END
     C                     WRITEDET1
     C                     ADD  1         TOTAL
     C                     END
     C*
     C*   jﾞbkｭc jbﾎﾟ = 'B'
     C*
     C           TYPE      IFEQ 'B'
     C           *IN,23    IFEQ '0'
     C                     SETON                     23
     C                     OPEN AAJPR13
     C                     END
     C           CJBMON    IFNE XXBMON
     C                     MOVEA'1'       *IN,22
     C                     Z-ADDCJBMON    XXBMON
     C                     END
     C           *IN,22    IFEQ '1'
     C           CJBMON    CHAINFGBPL011             10
     C   10                MOVEL*BLANK    B2SMEI
     C                     WRITEHED
     C                     MOVEA'0'       *IN,22
     C                     END
     C                     Z-ADD1         M       20
     C           CJKDAI    LOKUPCD,M                     11
     C           *IN11     IFEQ '1'
     C                     MOVE ME,M      T3NAMK 20
     C                     ELSE
     C                     MOVE *BLANK    T3NAMK
     C                     END
     C                     WRITEDET
     C                     END
     C*
     C                     ELSE
     C                     MOVEA'1'       *IN,90
     C                     END
     C                     END
     C*
     C           STP20     TAG
     C  N90                END
     C*
     C           SW        IFEQ *BLANK
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C*
     C*
     C           TYPE      IFEQ 'A'
     C           *IN,21    IFEQ '1'
     C           XXBMON    CHAINFGBPL011             10
     C   10                MOVEL*BLANK    B2SMEI
     C                     WRITEHED1
     C                     MOVEA'0'       *IN,21
     C                     END
     C                     WRITETOT1
     C                     Z-ADD0         TOTAL
     C                     MOVEA'1'       *IN,21
     C                     Z-ADDCJBMON    XXBMON
     C                     CLOSEAAJPR12
     C                     ELSE
     C                     CLOSEAAJPR13
     C                     END
     C*
     C                     MOVEL'1'       *INLR
     C                     RETRN
**       KANBAN NAME
A INTRA-PROC. KANBAN
B QUENCHING KANBAN
C PLATING KANBAN
D TUNNEL KANBAN
E PICK UP KANBAN
F INSTRUCTION KANBAN
G S KANBAN
H TUNNEL KANBAN 2
J WASHING KANBAN
K SHOT KANBAN
L NP KANBAN
N WAX KANBAN
M LIMITATION KANBAN
P COMPONENTS PLATING
Q COMPONENTS TUNNEL
Z HAND MAKING KANBAN
0 COMPLET'PART KANBAN
1 SMALL PROC. KANBAN
2 S PROC.HEAT TREATM.
3 COMPONENTS KANBAN
4 FLOW KANBAN
5 FLOW HEAT TREATMENT
6 HALF-FIN.GOODS KNBN
7 HEAT TREATM.PLATING
**  TAB1 / TAB2 (KANBAN KIND NAME )
4F4FLW RCK
3F3FLW RCK
2F2FLW RCK
1K1KRKN RK
2K2KRKN RK
3K3KRKN RK
5K5KRKN RK
1PPALLET 1
2PPALLET 2
3PPALLET 3
4PPALLET 4
5PPALLET 5
6PPALLET 6
7PPALLET 7
8PPALLET 8
9PPALLET 9
1D DOLLY 1
2D DOLLY 2
3D DOLLY 3
4D DOLLY 4
5D DOLLY 5
6D DOLLY 6
7D DOLLY 7
8D DOLLY 8
9D DOLLY 9
1GCAN 1
2GCAN 2
3GCAN 3
4GCAN 4
5GCAN 5
6GCAN 6
7GCAN 7
8GCAN 8
9GCAN 9
0QIMAGNARY
**  TAB3 / TAB4 ( COLOR NAME )
WWHT
RRED
GGREN
YYELW
BBLUE
DORNG
PPINK
**  COM (TITLE )
INT.PROC.LOC.M/F ACNT BOOK
**  TYT (HEADER )
INT.PROC.LOC.M/F ACNT BOOK
**  MSG (ERROR MESSAGE )
E-01 INPUT DEPARTMENT CODE
E-02 DEPARTMENT CODE ISN'T RIGHT
E-03 LOCATION ISN'T RIGHT
E-04 INPUT  ACCOUNT BOOK TYPE
E-05 ACCOUNT BOOK TYPE ISN'T RIGHT
E-06 THERE IS NOT MORE DATA IN INTRAL PROCESS LOCATION M/F
E-07 IT IS NOT OUTPUT DATA IN INTRA PROCESS LOCATION M/F
E-08 THE INPUT OF M/F CONDITION ISN'T RIGHT
