     H            Y.
     H* AAJR11 *************************************************
     H* INTRA-PROCESS LOCATION CODE M/F UPDATE & INQUIRY       *
     H* SEP.29,'86.             GBC *                          *
     H* JW1      2021.10.28 ADD DOWNLOAD OPTION                *
     H* JW2      2024.08.19 STOP CECKING OPEN DATE             *
     H**********************************************************
     FAAJPW11 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FGCMPL31 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
     FAAJTL12 UF  E           K        DISK                      A
     E**                  MSG     1  22 60               d[ｰ xｮﾈｰﾆﾞ
JW1  E                    MSG     1  25 60               ERROR MSG
     E                    TAB1    1  41  2   TAB2    8   egﾌﾞ ﾆｬﾓb xb
     E                    TAB3    1   7  1   TAB4    8   bﾜ xb
     E                    TAB5    1  41  2   TAB6    3 0 ﾆｬcﾑc ﾌﾃﾇc
     E                    UKHZ      100 10 0             nﾃﾜﾌﾞ]kﾍﾞ] ﾉ kｩｮh
     E                    DDKB        8  1               hﾎﾞ]
     E                    DDKI        8 13               ﾆｬｮf fﾉc giﾞ]
     E                    DDOK        8  3               egﾌﾞ ﾆｬﾓb
     E                    DDSY        8  8               egﾌﾞ ﾆｬﾓb xb
     E                    DDHA        8  3 0             ﾌﾃﾇc
     E                    DDBL        8  7               ﾆｬｮf ﾎﾞﾜｮh
     E                    DDKA        8  3               f]ﾌﾞ] ﾆｬﾓb
     E                    DDNA        8 18               f]ﾌﾞ] ﾆｬﾓb xb
     E                    DDYY        8  4 0             ﾆｬｮf giﾞ] (YY)
     E                    DDMM        8  2 0             ﾆｬｮf giﾞ] (MM)
     E                    DDDD        8  2 0             ﾆｬｮf giﾞ] (DD)
     E                    DDBB        8  2 0             ﾆｬｮf giﾞ] (ﾍﾞ])
     I            DS
     I                                        1   9 DDBAN
     I                                        1   1 DDBANA
     I                                        2   2 DDBANB
     I                                        3   4 DDBANC
     I                                        5   5 DDBAND
     I                                        6   7 DDBANE
     I                                        8   8 DDBANF
     I                                        9   9 DDBANG
     I            DS
     I                                        1   8 DDKB
     I                                        1   1 DDKB01
     I                                        2   2 DDKB02
     I                                        3   3 DDKB03
     I                                        4   4 DDKB04
     I                                        5   5 DDKB05
     I                                        6   6 DDKB06
     I                                        7   7 DDKB07
     I                                        8   8 DDKB08
     I            DS
     I                                        1 104 DDKI
     I                                        3  13 DDKI01
     I                                       16  26 DDKI02
     I                                       29  39 DDKI03
     I                                       42  52 DDKI04
     I                                       55  65 DDKI05
     I                                       68  78 DDKI06
     I                                       81  91 DDKI07
     I                                       94 104 DDKI08
     I            DS
     I                                        1  24 DDOK
     I                                        1   3 DDOK01
     I                                        4   6 DDOK02
     I                                        7   9 DDOK03
     I                                       10  12 DDOK04
     I                                       13  15 DDOK05
     I                                       16  18 DDOK06
     I                                       19  21 DDOK07
     I                                       22  24 DDOK08
     I            DS
     I                                        1  64 DDSY
     I                                        1   8 DDSY01
     I                                        9  16 DDSY02
     I                                       17  24 DDSY03
     I                                       25  32 DDSY04
     I                                       33  40 DDSY05
     I                                       41  48 DDSY06
     I                                       49  56 DDSY07
     I                                       57  64 DDSY08
     I            DS
     I                                        1  240DDHA
     I                                        1   30DDHA01
     I                                        4   60DDHA02
     I                                        7   90DDHA03
     I                                       10  120DDHA04
     I                                       13  150DDHA05
     I                                       16  180DDHA06
     I                                       19  210DDHA07
     I                                       22  240DDHA08
     I            DS
     I                                        1  56 DDBL
     I                                        1   7 DDBL01
     I                                        8  14 DDBL02
     I                                       15  21 DDBL03
     I                                       22  28 DDBL04
     I                                       29  35 DDBL05
     I                                       36  42 DDBL06
     I                                       43  49 DDBL07
     I                                       50  56 DDBL08
     I            DS
     I                                        1  24 DDKA
     I                                        1   3 DDKA01
     I                                        4   6 DDKA02
     I                                        7   9 DDKA03
     I                                       10  12 DDKA04
     I                                       13  15 DDKA05
     I                                       16  18 DDKA06
     I                                       19  21 DDKA07
     I                                       22  24 DDKA08
     I            DS
     I                                        1 144 DDNA
     I                                        1  18 DDNA01
     I                                       19  36 DDNA02
     I                                       37  54 DDNA03
     I                                       55  72 DDNA04
     I                                       73  90 DDNA05
     I                                       91 108 DDNA06
     I                                      109 126 DDNA07
     I                                      127 144 DDNA08
     I            DS
     I                                        1  13 DSKI
     I                                        1   4 DSKI1
     I                                        5   5 DSKI2
     I                                        6   7 DSKI3
     I                                        8   8 DSKI4
     I                                        9  10 DSKI5
     I                                       11  11 DSKI6
     I                                       12  13 DSKI7
     I            DS
     I                                        1   3 DSOK
     I                                        1   1 DSOK1
     I                                        2   2 DSOK2
     I                                        3   3 DSOK3
     I            DS
     I                                        1   7 DSBL
     I                                        1   1 DSBL1
     I                                        2   2 DSBL2
     I                                        3   3 DSBL3
     I                                        4   4 DSBL4
     I                                        5   7 DSBL5
     I            DS
     I                                        1   3 DSKA
     I                                        1   1 DSKA1
     I                                        2   2 DSKA2
     I                                        3   3 DSKA3
     I            DS
     I                                        1   2 CHSDSS
     I                                        1   10CHSDAI
     I                                        2   2 CHSSYO
     I            DS
     I                                        1   8 DDMENT
     I                                        1   1 DDMEN1
     I                                        2   2 DDMEN2
     I                                        3   8 DDMEN3
     I            DS
     I                                        1   9 DDPLC
     I                                        1   1 DDPLC1
     I                                        2   2 DDPLC2
     I                                        3   4 DDPLC3
     I                                        5   5 DDPLC4
     I                                        6   7 DDPLC5
     I                                        8   8 DDPLC6
     I                                        9   9 DDPLC7
     I            DS
     I                                        1  11 DDKAN
     I                                        1   2 DDKAN1
     I                                        3   3 DDKAN2
     I                                        4   5 DDKAN3
     I                                        6   6 DDKAN4
     I                                        7   8 DDKAN5
     I                                        9   9 DDKAN6
     I                                       10  11 DDKAN7
     I            DS
     I                                        1  14 D3HIN
     I                                        1   5 D3HIN1
     I                                        6   6 D3HIN2
     I                                        7  11 D3HIN3
     I                                       12  12 D3HIN4
     I                                       13  14 D3HIN5
     I            DS
     I                                        1   6 CJMBAC
     I                                        1   1 CJMBN1
     I                                        2   3 CJMBN2
     I                                        4   5 CJMBN3
     I                                        6   6 CJMBN4
     I            DS
     I                                        1   2 CJSDSS
     I                                        1   10CJSDAI
     I                                        2   2 CJSSYO
     I            DS
     I                                        1   80CJAK
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1  100CJCHXX
     I                                        1   40CJCHYY
     I                                        5   60CJCHMM
     I                                        7   80CJCHDD
     I                                        9  100CJCHBI
     I            DS
     I                                        1  100CHHIZK
     I                                        1   80CHYMD
     I            DS
     I                                        1  100UYMDB
     I                                        1   80UYMD
     I                                        1   40UYY
     I                                        5   60UMM
     I                                        7   80UDD
     I                                        9  100UBB
     I            DS
     I                                        1   6 DDBANH
     I                                        1   1 DDBAN1
     I                                        2   3 DDBAN2
     I                                        4   5 DDBAN3
     I                                        6   6 DDBAN4
     I            DS
     I                                        1  13 KIGEN
     I                                        1   40KYY
     I                                        5   5 KF1
     I                                        6   70KMM
     I                                        8   8 KF2
     I                                        9  100KDD
     I                                       11  11 KF3
     I                                       12  130KBB
     I            DS
     I                                        1  100CHIZK
     I                                        1   40CYY
     I                                        5   60CMM
     I                                        7   80CDD
     I                                        9  100CBB
     I            DS
     I                                        1  12 CJHBAN
     I                                        1   5 CJHIN1
     I                                        6  10 CJHIN2
     I                                       11  12 CJHIN3
     IFEEDBK      DS
     I                                     *STATUS  @STTS
      *
     C           KEY1      KLIST
     C                     KFLD           DDBUMN
     C                     KFLD           DDBAN1
     C                     KFLD           DDBAN2
     C                     KFLD           DDBAN3
     C                     KFLD           DDBAN4
      *
     C           KEY2      KLIST
     C                     KFLD           CJKDAI
     C                     KFLD           CJKSYO
      *
     C           KEYA      KLIST
     C                     KFLD           DDBAN1
     C                     KFLD           DDBAN2
     C                     KFLD           DDBAN3
     C                     KFLD           DDBAN4
     C                     KFLD           UYY
     C                     KFLD           UMM
     C                     KFLD           UDD
     C                     KFLD           UBB
      *
     C           KEY3      KLIST
     C                     KFLD           DDBUMN
     C                     KFLD           DDBAN1
     C                     KFLD           DDBAN2
     C                     KFLD           DDBAN3
     C                     KFLD           DDBAN4
     C                     KFLD           DDYY,8
     C                     KFLD           DDMM,8
     C                     KFLD           DDDD,8
     C                     KFLD           DDBB,8
      *
     C           KEY4      KLIST
     C                     KFLD           DDBUMN
     C                     KFLD           DDBAN1
     C                     KFLD           DDBAN2
     C                     KFLD           DDBAN3
     C                     KFLD           DDBAN4
     C                     KFLD           DDYY,1
     C                     KFLD           DDMM,1
     C                     KFLD           DDDD,1
     C                     KFLD           DDBB,1
      *
     C           KEY5      KLIST
     C                     KFLD           DDBUMN
     C                     KFLD           DDBAN1
     C                     KFLD           DDBAN2
     C                     KFLD           DDBAN3
     C                     KFLD           DDBAN4
     C                     KFLD           DDYY,I
     C                     KFLD           DDMM,I
     C                     KFLD           DDDD,I
     C                     KFLD           DDBB,I
      *
     C           KEYB      KLIST
     C                     KFLD           CHKDAI
     C                     KFLD           CHKSYO
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     MOVELUS        WUS     1
     C                     MOVELUS        WUS2    2
     C                     Z-ADD0         CJCHXX
      *
     C*  ﾎﾞy] CD ﾉ ﾈｮn
     C*
     C                     MOVEA'0'       *IN,70
     C                     Z-ADD0111      DDBUMN
     C           STP00     TAG
     C                     Z-ADD0         CHHIZK
     C                     MOVE *BLANK    DDBAN1
     C                     MOVE *BLANK    DDBAN2
     C                     MOVE *BLANK    DDBAN3
     C                     MOVE *BLANK    DDBAN4
     C                     MOVE *BLANK    DDERR
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'0'       *IN,50
     C                     MOVEA'0'       *IN,99
     C****************************************************************
     C*  1ST SCREEN (ENTRY)                                          *
     C****************************************************************
     C           STP01     TAG
     C                     WRITEAAJPW111
     C                     READ AAJPW11                2930
     C           *IN29     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE MSG,20    DDERR
     C                     GOTO STP01
     C                     END
      * F1:END
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
      *
JW1   * F7:DOWNLOAD
 .   C           *INKG     IFEQ '1'
 .   C                     CALL 'AAJC17'
 .   C                     GOTO STP01
JW1  C                     ENDIF
      *
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'0'       *IN,50
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    DDERR
     C                     MOVE *BLANK    SW      1
      *
      * SECTION
     C           DDBUMN    IFEQ 0000
     C                     Z-ADD0111      DDBUMN
     C                     ENDIF
      *
     C           DDBUMN    IFNE 0111
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     DDERR
     C                     GOTO STP01
     C                     END
     C  N14                SETON                     14
      *
     C           DDBAN1    IFEQ *BLANK
     C           DDBAN2    ANDEQ*BLANK
     C           DDBAN3    ANDEQ*BLANK
     C           DDBAN4    ANDEQ*BLANK
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     DDERR
     C                     GOTO STP01
     C                     END
     C           DDBUMN    CHAINFGBPL011             99
     C  N99      B2SKJY    COMP 'D'                      99
     C           *IN99     IFEQ '1'
     C                     MOVEA'1'       *IN,01
     C                     MOVELMSG,3     DDERR
     C                     GOTO STP01
     C                     END
     C                     MOVELB2SMEI    DDBMEI 16
      *
     C*  fﾞx] 2 ﾉ ﾈｮn
     C*
     C           STP11     TAG
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     MOVEA'0'       *IN,50
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    DDERR
     C                     MOVE *BLANK    DDPLC
     C                     MOVELDDBAN1    DDPLC1
     C                     MOVEL'-'       DDPLC2
     C                     MOVELDDBAN2    DDPLC3
     C                     MOVEL'-'       DDPLC4
     C                     MOVELDDBAN3    DDPLC5
     C                     MOVEL'-'       DDPLC6
     C                     MOVELDDBAN4    DDPLC7
     C                     MOVE *BLANK    DDKB
     C                     MOVE *BLANK    DDKI
     C                     MOVE *BLANK    DDOK
     C                     MOVE *BLANK    DDSY
     C                     Z-ADD*ZERO     DDHA
     C                     MOVE *BLANK    DDBL
     C                     MOVE *BLANK    DDKA
     C                     MOVE *BLANK    DDNA
     C                     Z-ADD*ZERO     DDYY
     C                     Z-ADD*ZERO     DDMM
     C                     Z-ADD*ZERO     DDDD
     C                     Z-ADD*ZERO     DDBB
     C                     Z-ADD0         UKHZ
      *
     C                     Z-ADD0         I       50
     C           KEY1      SETLLAAJTL121
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY1      READEAAJTL121                 20
     C           *IN20     IFEQ '0'
     C                     ADD  1         I
     C                     Z-ADDCJCHXX    UKHZ,I
     C                     END
     C  N20                END
      *
     C                     Z-ADD0         I
     C           KEY1      SETLLAAJTL121
     C                     DO   *HIVAL
     C           KEY1      READEAAJTL121                 20
     C           *IN,20    IFEQ '0'
     C                     ADD  1         I
     C           I         ADD  20        J       50
     C                     MOVEA'1'       *IN,J
     C                     MOVE *BLANK    DSKI
     C                     MOVELCJCHYY    DSKI1
     C                     MOVEL'.'       DSKI2
     C                     MOVELCJCHMM    DSKI3
     C                     MOVEL'.'       DSKI4
     C                     MOVELCJCHDD    DSKI5
     C                     MOVEL'-'       DSKI6
     C                     MOVELCJCHBI    DSKI7
     C                     MOVELDSKI      DDKI,I
     C                     MOVE *BLANK    DSOK
     C                     MOVELCJSDAI    DSOK1
     C                     MOVEL'-'       DSOK2
     C                     MOVELCJSSYO    DSOK3
     C                     MOVELDSOK      DDOK,I
     C                     MOVE *BLANK    DDSY,I
     C           CJSDSS    LOKUPTAB1      TAB2           20
     C   20                MOVELTAB2      DDSY,I
     C                     Z-ADDCJAHAK    DDHA,I
     C                     MOVE *BLANK    DSBL
     C                     MOVELCJBLK1    DSBL1
     C                     MOVEL'-'       DSBL2
     C                     MOVELCJBLK2    DSBL3
     C                     MOVEL'-'       DSBL4
     C                     MOVELCJBLK3    DSBL5
     C                     MOVELDSBL      DDBL,I
     C                     MOVE *BLANK    DSKA
     C                     MOVELCJKDAI    DSKA1
     C                     MOVEL'-'       DSKA2
     C                     MOVELCJKSYO    DSKA3
     C                     MOVELDSKA      DDKA,I
     C                     MOVE *BLANK    DDNA,I
     C           KEY2      CHAINGCMPL311             20
     C           *IN,20    IFEQ '0'
     C           T3SKJY    ANDNE*BLANK
     C           T3SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
     C  N20                MOVELT3NAMN    DDNA,I
     C                     Z-ADDCJCHYY    DDYY,I
     C                     Z-ADDCJCHMM    DDMM,I
     C                     Z-ADDCJCHDD    DDDD,I
     C                     Z-ADDCJCHBI    DDBB,I
     C           I         COMP 8                    20  20
     C                     END
     C  N20                END
      *
     C                     Z-ADD*DATE     UYMD
     C                     Z-ADD1         UBB
     C           KEYA      SETLLAAJPL111
     C                     SETOF                     20
     C           STEP01    TAG
     C                     READ AAJPL11                  20
     C   20                GOTO STEP02
     C           CJBANC    IFEQ DDBANH
     C           DDBUMN    IFNE CJBMON
     C           CJCHHZ    IFGE *DATE
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,14    DDERR
     C                     GOTO STP01
     C                     END
     C                     END
     C                     ELSE
     C                     GOTO STEP02
     C                     END
     C                     GOTO STEP01
     C           STEP02    TAG
      *
     C*  mﾞｰj = 0 ﾉ ng
     C*
     C           SW        IFEQ *BLANK
     C           I         ANDEQ0
     C                     MOVE *BLANK    DDMENT
     C                     MOVEL'2'       DDMEN1
     C                     MOVEL'-'       DDMEN2
     C                     MOVEL'ADD   '  DDMEN3
     C                     MOVE *BLANK    DDKAN
     C                     MOVE 99        DDKAN1
     C                     MOVEL'.'       DDKAN2
     C                     MOVEL99        DDKAN3
     C                     MOVEL'.'       DDKAN4
     C                     MOVEL99        DDKAN5
     C                     MOVEL'-'       DDKAN6
     C                     MOVEL99        DDKAN7
     C                     Z-ADD9999999999CJCHXX
     C                     MOVE *BLANK    CJSDAI
     C                     MOVE *BLANK    CJSSYO
     C                     MOVE *BLANK    D3SNM
     C                     Z-ADD0         CJSHAK
     C                     Z-ADD0         CJBRYO
     C                     Z-ADD0         CJAHAK
     C                     MOVE *BLANK    CJCOCR
     C                     MOVE *BLANK    D3CONM
     C                     MOVE *BLANK    CJBLK1
     C                     MOVE *BLANK    CJBLK2
     C                     MOVE *BLANK    CJBLK3
     C                     MOVE *BLANK    CJKDAI
     C                     MOVE *BLANK    CJKSYO
     C                     MOVE *BLANK    D3KNM
     C                     Z-ADD0         CJAK
     C                     MOVE *BLANK    D3HIN
     C                     Z-ADD0         CJSYUY
     C                     MOVE *BLANK    CJMBAC
     C                     Z-ADD0         CJSLOT
     C                     GOTO STEP11
     C                     END
      *
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    DDERR
     C****************************************************************
     C*  2ND SCREEN (DETAILS)                                       *
     C****************************************************************
     C           STP02     TAG
     C                     WRITEAAJPW112
     C                     READ AAJPW112               2930
     C           *IN29     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE MSG,20    DDERR
     C                     GOTO STP02
     C                     END
     C   KC                GOTO STP00
      *
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'0'       *IN,50
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    DDERR
      *
     C*  PRESS ROLL-UP
     C*
     C           *IN,91    IFEQ '1'
     C                     MOVEA'0'       *IN,90
     C           DDKI,8    IFEQ *BLANK
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     DDERR
     C                     GOTO STP02
     C                     END
      *
     C           KEY3      SETGTAAJTL121
     C                     DO   *HIVAL
     C           KEY1      READEAAJTL121                 20
     C           *IN,20    IFEQ '0'
     C           *IN,90    IFEQ '0'
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     Z-ADD0         I
     C                     MOVE *BLANK    DDKB
     C                     MOVE *BLANK    DDKI
     C                     MOVE *BLANK    DDOK
     C                     MOVE *BLANK    DDSY
     C                     Z-ADD*ZERO     DDHA
     C                     MOVE *BLANK    DDBL
     C                     MOVE *BLANK    DDKA
     C                     MOVE *BLANK    DDNA
     C                     Z-ADD*ZERO     DDYY
     C                     Z-ADD*ZERO     DDMM
     C                     Z-ADD*ZERO     DDDD
     C                     Z-ADD*ZERO     DDBB
     C                     MOVEA'1'       *IN,90
     C                     END
     C                     ADD  1         I
     C           I         ADD  20        J
     C                     MOVEA'1'       *IN,J
     C                     MOVE *BLANK    DSKI
     C                     MOVELCJCHYY    DSKI1
     C                     MOVEL'.'       DSKI2
     C                     MOVELCJCHMM    DSKI3
     C                     MOVEL'.'       DSKI4
     C                     MOVELCJCHDD    DSKI5
     C                     MOVEL'-'       DSKI6
     C                     MOVELCJCHBI    DSKI7
     C                     MOVELDSKI      DDKI,I
     C                     MOVE *BLANK    DSOK
     C                     MOVELCJSDAI    DSOK1
     C                     MOVEL'-'       DSOK2
     C                     MOVELCJSSYO    DSOK3
     C                     MOVELDSOK      DDOK,I
     C                     MOVE *BLANK    DDSY,I
     C           CHSDSS    LOKUPTAB1      TAB2           20
     C   20                MOVELTAB2      DDSY,I
     C                     Z-ADDCJAHAK    DDHA,I
     C                     MOVE *BLANK    DSBL
     C                     MOVELCJBLK1    DSBL1
     C                     MOVEL'-'       DSBL2
     C                     MOVELCJBLK2    DSBL3
     C                     MOVEL'-'       DSBL4
     C                     MOVELCJBLK3    DSBL5
     C                     MOVELDSBL      DDBL,I
     C                     MOVE *BLANK    DSKA
     C                     MOVELCJKDAI    DSKA1
     C                     MOVEL'-'       DSKA2
     C                     MOVELCJKSYO    DSKA3
     C                     MOVELDSKA      DDKA,I
     C                     MOVE *BLANK    DDNA,I
     C           KEY2      CHAINGCMPL311             20
     C           *IN,20    IFEQ '0'
     C           T3SKJY    ANDNE*BLANK
     C           T3SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
     C  N20                MOVELT3NAMN    DDNA,I
     C                     Z-ADDCJCHYY    DDYY,I
     C                     Z-ADDCJCHMM    DDMM,I
     C                     Z-ADDCJCHDD    DDDD,I
     C                     Z-ADDCJCHBI    DDBB,I
     C           I         COMP 8                    20  20
     C                     END
     C  N20                END
      *
     C           *IN,90    IFEQ '0'
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     DDERR
     C                     END
     C                     GOTO STP02
     C                     END
      *
     C*  PRESS ROLL-DOWN
     C*
     C           *IN,92    IFEQ '1'
     C                     MOVEA'0'       *IN,90
     C           DDKI,1    IFEQ *BLANK
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     DDERR
     C                     GOTO STP02
     C                     END
      *
     C           KEY4      SETLLAAJTL121
     C                     DO   *HIVAL
     C                     READPAAJTL121                 20
     C           *IN,20    IFEQ '0'
     C           CJBMON    CABNEDDBUMN    STP21
     C           CJBAN1    CABNEDDBAN1    STP21
     C           CJBAN2    CABNEDDBAN2    STP21
     C           CJBAN3    CABNEDDBAN3    STP21
     C           CJBAN4    CABNEDDBAN4    STP21
     C           *IN,90    IFEQ '0'
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     Z-ADD9         I
     C                     MOVE *BLANK    DDKB
     C                     MOVE *BLANK    DDKI
     C                     MOVE *BLANK    DDOK
     C                     MOVE *BLANK    DDSY
     C                     Z-ADD*ZERO     DDHA
     C                     MOVE *BLANK    DDBL
     C                     MOVE *BLANK    DDKA
     C                     MOVE *BLANK    DDNA
     C                     Z-ADD*ZERO     DDYY
     C                     Z-ADD*ZERO     DDMM
     C                     Z-ADD*ZERO     DDDD
     C                     Z-ADD*ZERO     DDBB
     C                     MOVEA'1'       *IN,90
     C                     END
     C                     SUB  1         I
     C           I         ADD  20        J
     C                     MOVEA'1'       *IN,J
     C                     MOVE *BLANK    DSKI
     C                     MOVELCJCHYY    DSKI1
     C                     MOVEL'.'       DSKI2
     C                     MOVELCJCHMM    DSKI3
     C                     MOVEL'.'       DSKI4
     C                     MOVELCJCHDD    DSKI5
     C                     MOVEL'-'       DSKI6
     C                     MOVELCJCHBI    DSKI7
     C                     MOVELDSKI      DDKI,I
     C                     MOVE *BLANK    DSOK
     C                     MOVELCJSDAI    DSOK1
     C                     MOVEL'-'       DSOK2
     C                     MOVELCJSSYO    DSOK3
     C                     MOVELDSOK      DDOK,I
     C                     MOVE *BLANK    DDSY,I
     C           CHSDSS    LOKUPTAB1      TAB2           20
     C   20                MOVELTAB2      DDSY,I
     C                     Z-ADDCJAHAK    DDHA,I
     C                     MOVE *BLANK    DSBL
     C                     MOVELCJBLK1    DSBL1
     C                     MOVEL'-'       DSBL2
     C                     MOVELCJBLK2    DSBL3
     C                     MOVEL'-'       DSBL4
     C                     MOVELCJBLK3    DSBL5
     C                     MOVELDSBL      DDBL,I
     C                     MOVE *BLANK    DSKA
     C                     MOVELCJKDAI    DSKA1
     C                     MOVEL'-'       DSKA2
     C                     MOVELCJKSYO    DSKA3
     C                     MOVELDSKA      DDKA,I
     C                     MOVE *BLANK    DDNA,I
     C           KEY2      CHAINGCMPL311             20
     C           *IN,20    IFEQ '0'
     C           T3SKJY    ANDNE*BLANK
     C           T3SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
     C  N20                MOVELT3NAMN    DDNA,I
     C                     Z-ADDCJCHYY    DDYY,I
     C                     Z-ADDCJCHMM    DDMM,I
     C                     Z-ADDCJCHDD    DDDD,I
     C                     Z-ADDCJCHBI    DDBB,I
     C           I         COMP 1                      2020
     C                     END
     C  N20                END
      *
     C           STP21     TAG
     C           *IN,90    IFEQ '0'
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     DDERR
     C                     END
     C                     GOTO STP02
     C                     END
      *
     C*  fﾞx] 2 ﾉ kｩｮh
     C*
     C                     Z-ADD0         CNT     50
     C           1         DO   8         I
     C           DDKB,I    IFNE *BLANK
     C                     ADD  1         CNT
     C           DDKB,I    IFNE '0'
     C           DDKB,I    ANDNE'1'
     C                     MOVEA'1'       *IN,I
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     DDERR
     C                     END
     C           CNT       IFGT 1
     C           CNT       SUB  1         N       20
     C                     MOVE DDKI,N    KIGEN
     C                     Z-ADDKYY       CYY
     C                     Z-ADDKMM       CMM
     C                     Z-ADDKDD       CDD
     C                     Z-ADDKBB       CBB
     C                     ELSE
     C                     Z-ADD0         CHIZK
     C                     END
     C                     END
     C                     END
     C           DDERR     CABNE*BLANK    STP02
     C           CNT       CABEQ0         STP02
      *
     C           CNT       IFGT 1
     C           1         DO   8         I
     C           DDKB,I    IFNE *BLANK
     C                     MOVEA'1'       *IN,I
     C                     END
     C                     END
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,5     DDERR
     C                     GOTO STP02
     C                     END
      *
     C*  fﾞx] 3 ﾉ ﾈｮn
     C*
     C                     MOVEA'0'       *IN,20
     C           1         DO   8         I
     C           DDKB,I    IFNE *BLANK
     C                     MOVEA'1'       *IN,20
     C                     END
     C  N20                END
     C  N20                GOTO STP02
      *
     C           KEY5      CHAINAAJTL121             20
     C           *IN,20    IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,12    DDERR
     C                     GOTO STP02
     C                     END
      *
     C                     MOVEA'0'       *IN,50
     C                     MOVE *BLANK    DDMENT
     C                     MOVELDDKB,I    DDMEN1
     C                     MOVEL'-'       DDMEN2
     C           DDKB,I    IFEQ '0'
     C                     MOVEA'1'       *IN,50
     C                     MOVEL'CANCEL'  DDMEN3
     C                     ELSE
     C                     MOVEL'CHANGE'  DDMEN3
     C                     END
     C                     MOVE *BLANK    DDKAN
     C                     MOVE CJCHYY    DDKAN1
     C                     MOVEL'.'       DDKAN2
     C                     MOVELCJCHMM    DDKAN3
     C                     MOVEL'.'       DDKAN4
     C                     MOVELCJCHDD    DDKAN5
     C                     MOVEL'-'       DDKAN6
     C                     MOVELCJCHBI    DDKAN7
     C                     MOVE *BLANK    D3SNM
     C           CJSDSS    LOKUPTAB1      TAB2           20
     C   20                MOVELTAB2      D3SNM
     C                     MOVE *BLANK    D3CONM
     C           CJCOCR    LOKUPTAB3      TAB4           20
     C   20                MOVELTAB4      D3CONM
     C                     MOVE *BLANK    D3KNM
     C           KEY2      CHAINGCMPL311             20
     C  N20                MOVELT3NAMN    D3KNM
     C                     MOVE *BLANK    D3HIN
     C                     MOVELCJHIN1    D3HIN1
     C                     MOVEL'-'       D3HIN2
     C                     MOVELCJHIN2    D3HIN3
     C                     MOVEL'-'       D3HIN4
     C                     MOVELCJHIN3    D3HIN5
     C                     MOVE *BLANK    DDKB,I
      *
     C           STEP11    TAG
     C           DDMEN1    IFNE '2'
     C                     Z-ADDCJSDAI    CHSDAI  10
     C                     MOVE CJSSYO    CHSSYO  1
     C                     MOVE CJHAKO    CHHAKO  1
     C                     Z-ADDCJSHAK    CHSHAK  30
     C                     Z-ADDCJBRYO    CHBRYO  20
     C                     Z-ADDCJAHAK    CHAHAK  30
     C                     MOVE CJCOCR    CHCOCR  1
     C                     MOVE CJBLK1    CHBLK1  1
     C                     MOVE CJBLK2    CHBLK2  1
     C                     Z-ADDCJBLK3    CHBLK3  30
     C                     MOVE CJKDAI    CHKDAI  1
     C                     MOVE CJKSYO    CHKSYO  1
     C                     Z-ADDCJSYUY    CHSYUY  50
     C                     Z-ADDCJSLOT    CHSLOT  90
     C                     Z-ADD0         CHHIZK
     C           DDMEN1    IFEQ '0'
     C                     SETON                     15
     C                     ELSE
     C           DDMEN1    IFEQ '1'
     C                     SETOF                     15
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADD0         CHSDAI  10
     C                     MOVE *BLANK    CHSSYO  1
     C                     MOVE *BLANK    CHHAKO  1
     C                     Z-ADD0         CHSHAK  30
     C                     Z-ADD0         CHBRYO  20
     C                     Z-ADD0         CHAHAK  30
     C                     MOVE *BLANK    CHCOCR  1
     C                     MOVE *BLANK    CHBLK1  1
     C                     MOVE *BLANK    CHBLK2  1
     C                     Z-ADD0         CHBLK3  30
     C                     MOVE *BLANK    CHKDAI  1
     C                     MOVE *BLANK    CHKSYO  1
     C                     Z-ADD0         CHSYUY  50
     C                     Z-ADD0         CHSLOT  90
     C                     Z-ADD0         CHHIZK
     C                     SETOF                     15
     C                     END
     C****************************************************************
     C*  3TH SCREEN (HELP:REFERENCE)                                 *
     C****************************************************************
     C           STP03     TAG
     C                     SETOF                     17
     C                     WRITEAAJPW113
     C                     READ AAJPW11                2930
     C           *IN29     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE MSG,20    DDERR
     C                     GOTO STP03
     C                     END
      *
     C                     MOVE D3HIN1    CJHIN1
     C                     MOVE D3HIN3    CJHIN2
     C                     MOVE D3HIN5    CJHIN3
      *
     C                     SETOF                     40
     C           CHKDAI    IFEQ '3'
     C           CHKDAI    OREQ '4'
     C           CHKDAI    OREQ '5'
     C                     SETON                     40
     C                     END
      *
     C                     SETOF                     41
     C           CHKDAI    IFEQ '0'
     C           CHKDAI    OREQ '1'
     C           CHKDAI    OREQ '2'
     C           CHKDAI    OREQ '3'
     C           CHKDAI    OREQ '4'
     C           CHKDAI    OREQ '5'
     C                     SETON                     41
     C                     END
     C*
     C           *IN17     IFEQ '1'
     C           STP44     TAG
     C                     WRITEAAJPW114
     C                     READ AAJPW11                2930
     C           *IN29     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     99
     C                     MOVE MSG,20    DDERR
     C                     GOTO STP44
     C                     END
     C                     GOTO STP03
     C                     END
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'0000'    *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    DDERR
     C                     MOVE *BLANK    SW
     C           *INKC     IFEQ '1'
     C           DDMEN1    CABEQ'2'       STP00
     C                     GOTO STP02
     C                     END
      *
     C           DDMEN1    CABEQ'0'       STP031
      *
     C*  fﾞx] 3 ﾉ kｩｮh
     C*
     C                     MOVE *BLANK    D3SNM
     C           CHSDSS    LOKUPTAB1      TAB2           20
     C           *IN,20    IFEQ '1'
     C                     MOVELTAB2      D3SNM
     C                     ELSE
     C                     MOVEA'11'      *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,6     DDERR
     C                     GOTO STP03
     C                     END
      *
     C                     Z-ADD0         CHSHAK
     C           CHSDSS    LOKUPTAB5      TAB6           20
     C   20                Z-ADDTAB6      CHSHAK
      *
     C           CHHAKO    IFEQ 'D'
     C           CHSHAK    DIV  2         CHSHAK
     C                     END
     C           CHSHAK    MULT CHBRYO    CHAHAK
      *
     C*****      CHAHAK    IFNE WWSU
     C*****                MOVEA'111'     *IN,03
     C*****                MOVEA'1'       *IN,99
     C*****                MOVELMSG,7     DDERR
     C*****                GOTO STP03
     C*****                END
      *
     C                     MOVE *BLANK    D3CONM
     C           CHCOCR    LOKUPTAB3      TAB4           20
     C           *IN,20    IFEQ '1'
     C                     MOVELTAB4      D3CONM
     C                     ELSE
     C                     MOVEA'1'       *IN,06
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,8     DDERR
     C                     GOTO STP03
     C                     END
      *
     C           CHHAKO    IFNE 'C'
     C           CHHAKO    ANDNE'D'
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,22    DDERR
     C                     GOTO STP03
     C                     END
     C*
     C           CHBLK1    IFEQ *BLANK
     C           CHBLK2    ANDEQ*BLANK
     C           CHBLK3    ANDEQ0
     C                     MOVEA'111'     *IN,07
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,9     DDERR
     C                     GOTO STP03
     C                     END
      *
     C                     MOVE *BLANK    D3KNM
     C           KEYB      CHAINGCMPL311             20
     C           *IN,20    IFEQ '0'
     C                     MOVELT3NAMN    D3KNM
     C                     ELSE
     C                     MOVEA'11'      *IN,10
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,10    DDERR
     C                     GOTO STP03
     C                     END
      *
     C           CJAK      IFEQ 0
JW2  C**                   Z-ADD*DATE     CJAK
     C                     ELSE
     C           CJAKYY    IFLT 1986
     C           CJAKMM    ORLT 01
     C           CJAKMM    ORGT 12
     C           CJAKDD    ORLT 01
     C           CJAKDD    ORGT 31
     C                     MOVEA'1'       *IN,12
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,11    DDERR
     C                     GOTO STP03
     C                     END
     C                     END
     C           DDMEN1    IFEQ '1'
     C           CHKDAI    COMP CJKDAI               1515
     C  N15      CHKSYO    COMP CJKSYO               1515
     C* N15      CHSDAI    COMP CJSDAI               1515
     C* N15      CHSSYO    COMP CJSSYO               1515
     C* N15      CHSHAK    COMP CJSHAK               1515
     C* N15      CHBRYO    COMP CJBRYO               1515
     C* N15      CHAHAK    COMP CJAHAK               1515
     C* N15      CHCOCR    COMP CJCOCR               1515
     C* N15      CHBLK1    COMP CJBLK1               1515
     C* N15      CHBLK2    COMP CJBLK2               1515
     C* N15      CHBLK3    COMP CJBLK3               1515
     C* N15      CHSYUY    COMP CJSYUY               1515
     C* N15      CHSLOT    COMP CJSLOT               1515
     C           *IN15     IFEQ '1'
     C           CHHIZK    IFEQ 0
     C           CJCHXX    IFEQ 9999999999
     C                     MOVEA'1'       *IN,99
     C                     SETON                     15
     C                     MOVELMSG,15    DDERR
     C                     GOTO STP03
     C                     END
     C                     ELSE
     C           CHYMD     IFLT *DATE
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,16    DDERR
     C                     GOTO STP03
     C                     END
     C           CHHIZK    IFLE CHIZK
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,19    DDERR
     C                     GOTO STP03
     C                     END
     C                     SETOF                     20
     C                     Z-ADD1         A       50
     C           CHHIZK    LOKUPUKHZ,A                   20
     C           *IN20     IFEQ '1'
     C                     SETON                     99
     C                     MOVE MSG,21    DDERR
     C                     GOTO STP03
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           STP031    TAG
     C           DDMEN1    IFEQ '0'
     C           CHHIZK    IFEQ 0
     C                     MOVEA'1'       *IN,99
     C                     SETON                     15
     C                     MOVELMSG,15    DDERR
     C                     GOTO STP03
     C                     ELSE
     C           CHYMD     IFLT *DATE
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,16    DDERR
     C                     GOTO STP03
     C                     END
     C           CHHIZK    IFLE CHIZK
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,18    DDERR
     C                     GOTO STP03
     C                     END
     C                     SETOF                     20
     C                     Z-ADD1         A
     C           CHHIZK    LOKUPUKHZ,A                   20
     C           *IN20     IFEQ '1'
     C                     SETON                     99
     C                     MOVE MSG,21    DDERR
     C                     GOTO STP03
     C                     END
     C                     END
     C                     END
     C  NKE                GOTO STP03
      *
     C           DDMEN1    IFEQ '2'
     C           CJCHXX    ANDNE9999999999
     C                     SETON                     99
     C                     MOVE MSG,17    DDERR
     C                     GOTO STP03
     C                     END
      *
     C*  ﾎｦbﾓ ﾉ ﾃcﾆ]
     C*
     C           DDMEN1    IFEQ '2'
     C                     Z-ADDDDBUMN    CJBMON
     C                     MOVELDDBAN1    CJBAN1
     C                     MOVELDDBAN2    CJBAN2
     C                     MOVELDDBAN3    CJBAN3
     C                     MOVELDDBAN4    CJBAN4
     C                     Z-ADD9999      CJCHYY
     C                     Z-ADD99        CJCHMM
     C                     Z-ADD99        CJCHDD
     C                     Z-ADD99        CJCHBI
     C                     Z-ADDCHSDAI    CJSDAI  10
     C                     MOVE CHSSYO    CJSSYO  1
     C                     MOVE CHHAKO    CJHAKO  1
     C                     Z-ADDCHSHAK    CJSHAK  30
     C                     Z-ADDCHBRYO    CJBRYO  20
     C                     Z-ADDCHAHAK    CJAHAK  30
     C                     MOVE CHCOCR    CJCOCR  1
     C                     MOVE CHBLK1    CJBLK1  1
     C                     MOVE CHBLK2    CJBLK2  1
     C                     Z-ADDCHBLK3    CJBLK3  30
     C                     MOVE CHKDAI    CJKDAI  1
     C                     MOVE CHKSYO    CJKSYO  1
     C                     Z-ADDCHSYUY    CJSYUY  50
     C                     Z-ADDCHSLOT    CJSLOT  90
     C                     MOVE *BLANK    CJHIN1
     C                     MOVE *BLANK    CJHIN2
     C                     MOVE *BLANK    CJHIN3
     C                     WRITEAAJTL121
     C                     END
     C           DDMEN1    IFEQ '1'
     C           CJCHXX    IFEQ 9999999999
     C           CHHIZK    IFEQ 0
     C                     Z-ADDCHSDAI    CJSDAI  10
     C                     MOVE CHSSYO    CJSSYO  1
     C                     MOVE CHHAKO    CJHAKO  1
     C                     Z-ADDCHSHAK    CJSHAK  30
     C                     Z-ADDCHBRYO    CJBRYO  20
     C                     Z-ADDCHAHAK    CJAHAK  30
     C                     MOVE CHCOCR    CJCOCR  1
     C                     MOVE CHBLK1    CJBLK1  1
     C                     MOVE CHBLK2    CJBLK2  1
     C                     Z-ADDCHBLK3    CJBLK3  30
     C                     MOVE CHKDAI    CJKDAI  1
     C                     MOVE CHKSYO    CJKSYO  1
     C                     Z-ADDCHSYUY    CJSYUY  50
     C                     Z-ADDCHSLOT    CJSLOT  90
     C                     UPDATAAJTL121
     C                     GOTO STEP50
     C                     END
     C                     Z-ADDCHHIZK    CJCHXX
     C                     UPDATAAJTL121
     C                     Z-ADDCHSDAI    CJSDAI  10
     C                     MOVE CHSSYO    CJSSYO  1
     C                     MOVE CHHAKO    CJHAKO  1
     C                     Z-ADDCHSHAK    CJSHAK  30
     C                     Z-ADDCHBRYO    CJBRYO  20
     C                     Z-ADDCHAHAK    CJAHAK  30
     C                     MOVE CHCOCR    CJCOCR  1
     C                     MOVE CHBLK1    CJBLK1  1
     C                     MOVE CHBLK2    CJBLK2  1
     C                     Z-ADDCHBLK3    CJBLK3  30
     C                     MOVE CHKDAI    CJKDAI  1
     C                     MOVE CHKSYO    CJKSYO  1
     C                     Z-ADDCHSYUY    CJSYUY  50
     C                     Z-ADDCHSLOT    CJSLOT  90
     C                     Z-ADD9999      CJCHYY
     C                     Z-ADD99        CJCHMM
     C                     Z-ADD99        CJCHDD
     C                     Z-ADD99        CJCHBI
     C                     WRITEAAJTL121
     C                     ELSE
     C                     Z-ADDCHSDAI    CJSDAI  10
     C                     MOVE CHSSYO    CJSSYO  1
     C                     MOVE CHHAKO    CJHAKO  1
     C                     Z-ADDCHSHAK    CJSHAK  30
     C                     Z-ADDCHBRYO    CJBRYO  20
     C                     Z-ADDCHAHAK    CJAHAK  30
     C                     MOVE CHCOCR    CJCOCR  1
     C                     MOVE CHBLK1    CJBLK1  1
     C                     MOVE CHBLK2    CJBLK2  1
     C                     Z-ADDCHBLK3    CJBLK3  30
     C                     MOVE CHKDAI    CJKDAI  1
     C                     MOVE CHKSYO    CJKSYO  1
     C                     Z-ADDCHSYUY    CJSYUY  50
     C                     Z-ADDCHSLOT    CJSLOT  90
     C                     UPDATAAJTL121
     C                     END
     C                     END
     C           STEP50    TAG
     C           DDMEN1    IFEQ '0'
     C                     Z-ADDCHHIZK    CJCHXX
     C                     UPDATAAJTL121
     C*          CJCHXX    IFEQ *ALL'9'
     C*                    READPAAJTL121                 20
     C*          *IN,20    IFEQ '0'
     C*          CJBMON    ANDEQDDBUMN
     C*          CJBAN1    ANDEQDDBAN1
     C*          CJBAN2    ANDEQDDBAN2
     C*          CJBAN3    ANDEQDDBAN3
     C*          CJBAN4    ANDEQDDBAN4
     C*                    Z-ADD9999      CJCHYY
     C*                    Z-ADD99        CJCHMM
     C*                    Z-ADD99        CJCHDD
     C*                    Z-ADD99        CJCHBI
     C*                    UPDATAAJTL121
     C*                    END
     C*                    END
     C                     MOVEL'*'       SW
     C                     END
     C                     Z-ADD0         CHHIZK
     C                     SETOF                     15
     C                     GOTO STP11
      *
**  MSG(60A).......2.........3.........4.........5.........6
E-01 SECTION IS INCORRECT!
E-02 ENTER LOCATION!
E-03 IT'S OVER 1ST OR THE LAST RECORD BY ROL-UP & DOWN
E-04 UPDATE INSTRUCTION IS ONLY 0,1
E-05 PLURAL NUMBER APPOINTMENT IS IMPOSSIBLE
E-06 DEPOT KIND ISN'T RIGHT
E-07 SINGLE HARVEST'*LOCAT'USE NBR/=ALL HARVEST'NBR OF BOXES
E-08 SIGNAL KANBAN LOCATION COLOR ISN'T RIGHT
E-09 INPUT SHIPMENT BLOCK
E-10 KANBAN KIND IS INCORRECT!
E-11 OPEN ADDRESS DATE IS INCORRECT!
E-12 DATA IS ALREADY DELETED!.
E-13 THIS DPTM.CD DOESN'T EXIST IN DTL M/F INFORM ACCOUNTING
E-14 THIS LOCAT' IS USING OTHER DPTM. STILL BEFORE LAPSE DAY
E-15 INPUT LAPSE DAY OF LOCATION BEFORE CHANGE
E-16 LAPSE DAY WAS INPUT, BUT IT BECOMES IT ON A PAST DATE
E-17 OUTGOING TIME LIMIT MUST BE 999999.99
E-18 CANCEL LIMIT DATE IS SMALLER THAN OUTGO'LMT OF PAST RCD
E-19 CHGD OUTGO'LMT OF OLD M/F IS SMALLER THAN PAST RCD DATE
E-20 RETURN TO SCREEN OF A PASSWORD WHEN DON'T USE LONG TIME
E-21 LOCATION CHANGE DAY BIN INPUT ALREADY, CHANGE IT
E-22 BOX TYPE IS INCORREC!
M-23
  24
  25
**  TAB1 / TAB2 (STORAGE KIND NAME )
2BOUTS CNT
2F FLW RCK
2D NML RCK
2G DOL RCK
1KKRKN RK1
2KKRKN RK2
3KKRKN RK3
4KKRKN RK4
5KKRKN RK5
0B BOARD
0RRLY BORD
2PFORD RCL
0TFLR DPOT
0Q IMGNARY
0S S SHELF
**  TAB3 / TAB4 ( COLOR NAME )
W WHITE
R RED
G GREEN
Y YELLOW
B BLUE
D ORENGE
P PEACH
**  TAB5 / TAB6 ( ACCOMODATED QUANTITY)
2B004
2F010
3F012
4F006
1D016
2D032
3D048
4D064
5D080
6D096
7D112
8D128
9D144
1G020
2G032
3G060
4G080
5G100
6G120
7G140
8G160
9G180
1K011
2K022
3K033
4K044
5K055
0B000
0R000
1P072
2P024
3P216
4P288
5P360
6P432
7P504
8P576
9P648
0T000
0Q000
0S004
