     H            Y
     F*********************************************************
     F* SERVICE ROUTE M/F LIST                      AAKR22 *
     F*   M S K                                               *
     F*********************************************************
     FAAKPL21 IP  E           K        DISK
     FAAKPR22 O   E             99     PRINTER
     C           DGSKJY    CABEQ'D'       LAST
     C                     TIME           @TIME
     C                     MOVE UDATE     @DATE
     C*                    Z-ADD1         @PAGE
     C           FSW       IFEQ ' '
     C                     WRITEAAKPR221
     C                     MOVEL'*'       FSW     1
     C                     END
     C                     MOVE DGKEIR    @KEIRO
     C                     MOVE DGBNS1    @1BCDE
     C                     MOVE DGBMN1    @1CBMN
     C                     MOVE DGBNS2    @2BCDE
     C                     MOVE DGBMN2    @2CBMN
     C                     MOVE DGBNS3    @3BCDE
     C           DGBMN1    COMP 0                        10
     C           DGBMN2    COMP 0                        11
     C                     WRITEAAKPR222
     C           *IN99     IFEQ '1'
     C*                    ADD  1         @PAGE
     C                     WRITEAAKPR221
     C                     SETOF                       99
     C                     END
     C           LAST      TAG
