     H            Y.                                                      DAD000
     F** AAKR42 **********************************
     F* UPDATE OF SERVICE ROUTE CHECK M/F
     F*                 A.IDOTA 1987.11.25 *
     F********************************************
     FAAKPL41 IP  E           K        DISK
     FAAKPR41 O   E             77     PRINTER
     FFGBPL01 IF  E           K        DISK
     C  N01                TIME           WTIME   60
     C  N01                WRITEAAKPR411
     C  N01                SETON                     01
     C           FHSKJY    CABEQ'D'       END
     C           FHMBMN    CHAINFGBPL011             10
     C                     MOVE FHMBMN    BMN1    4
     C                     MOVELB2SMEI    KANA1  15
     C           FHMMKR    IFEQ *ZERO
     C                     MOVE *BLANK    KANA2  15
     C                     MOVE *BLANK    BMN2    4
     C                     ELSE
     C           FHMMKR    CHAINFGBPL011             10
     C                     MOVELB2SMEI    KANA2
     C                     MOVE FHMMKR    BMN2
     C                     END
     C           FHNEXT    IFEQ *ZERO
     C                     MOVE *BLANK    KANA3  15
     C                     MOVE *BLANK    BMN3    4
     C                     ELSE
     C           FHNEXT    CHAINFGBPL011             10
     C                     MOVELB2SMEI    KANA3
     C                     MOVE FHNEXT    BMN3
     C                     END
     C           *IN77     IFEQ '1'
     C                     SETOF                     77
     C                     WRITEAAKPR411
     C                     END
     C                     WRITEAAKPR412
     C           END       TAG
