     H            Y.
     F** AALR01 ******************************************************
     F* PROGRAM NAME. :                                             **
     F* PROGRAM ID. : AALR01. <RPG>                                 **
     F* CREATE DATE. : DEC.24,'86.                                  **
     F* AUTHOR.              : G.B.C                                **
     F****************************************************** AALR01 **
     FAALPL11 UF  E           K        DISK
      *
     C****************************************************************
     C*  START PROGRAM  <AALR01>                                     *
     C****************************************************************
      *
     C           *LOVAL    SETLLAALPL111
     C                     DO   *HIVAL
     C                     READ AALPL111                 10
     C           *IN,10    IFEQ '0'
     C           CLDTOK    COMP *BLANK                   11
     C           CLTENS    COMP *BLANK                   12
     C   11N12             SETON                     U6
     C  N11 12             SETON                     U6
     C           *INU6     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
     C                     END
     C  N10                END
      *
      *
     C           *LOVAL    SETLLAALPL111
     C                     DO   *HIVAL
     C                     READ AALPL111                 10
     C           *IN,10    IFEQ '0'
     C                     MOVE *BLANK    CLDTOK
     C                     MOVE *BLANK    CLTENS
     C                     Z-ADD0         CLDTHZ
     C                     UPDATAALPL111
     C                     END
     C  N10                END
      *
     C                     MOVEL'1'       *INLR
     C                     RETRN
