     H            Y.                                                      DAD000
     F** AAMR98 **********************************
     F* 社内かんばん切替マスター検索         *
     F*  (工程情報取得)                        *
     F*  SERACH INTRA KANBAN EXCHANGE MASTER     *
     F*  (RETRIEVE PROCESS INFO)                 *
     F*  2001.08.01                              *
     F*  MSK.KUNIEDA                             *
     F********************************************
     FAAMPL11 IF  E           K        DISK
      *
     E                    NKOT       15  3
     E                    NBMN       15  4 0
     E                    NKBN       15  3
     E                    NTKR       15  6
     E                    NSHR       15  1
     E                    NHBN       15 12
      *
     E                    OKOT       15  3
     E                    OBMN       15  4 0
     E                    OKBN       15  3
     E                    OTKR       15  6
     E                    OSHR       15  1
     E                    OHBN       15 12
      *
     E                    KHZ        15 10 0
      *
     E                    SKOT       15  3
     E                    SBMN       15  4
     E                    SKBN       15  3
     E                    STKR       15  6
     E                    SSHR       15  1
     E                    SHBN       15 12
      *
     I            DS
     I                                        1   80CKSKH8
     I                                        1   40CKSKYY
     I                                        5   60CKSKMM
     I                                        7   80CKSKDD
      *---------------------------------------*
      * INFO FOR NEW
      *---------------------------------------*
      *工程
      * PROCES
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      *部門
      * DEPARTMENT
     I            DS
     I                                        1  600NBMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      *機番
      * MACHINE
     I            DS
     I                                        1  45 NKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      *所番地
      * LOACATION
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
      *かんばん種類
      * KANBAN TYPE
     I            DS
     I                                        1  15 NSHR
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
      *---------------------------------------*
      *  INFO FOR OLD
      *---------------------------------------*
      *工程
      * PROCESS
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
      *部門
      * DEPARTMENT
     I            DS
     I                                        1  600OBMN
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
      *機番
      * MACHINE
     I            DS
     I                                        1  45 OKBN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
      *所番地
      * LOCATION
     I            DS
     I                                        1  90 OTKR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
      *かんばん種類
      * KANBAN TYPE
     I            DS
     I                                        1  15 OSHR
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
      *切替え日
      * EXCHANGE DATE
     I            DS
     I                                        1 1500KHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *品番
      * PART
     I            DS
     I                                        1 180 OHBN
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1 180 NHBN
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
      *----------------------------------------------------*
      *   PARAMETER                                        *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
      * IN
     C                     PARM           INHIN1  5
     C                     PARM           INHIN2  5
     C                     PARM           INHIN3  2
      * OUT
     C                     PARM           OUTBMN 60
     C                     PARM           OUTKBN 45
     C                     PARM           OUTTKR 90
     C                     PARM           OUTSHR 15
     C                     PARM           OUTKOT 45
     C                     PARM           OUTHBN180
     C                     PARM           STATUS  1
      *----------------------------------------------------*
      *   KEY LIST                                         *
      *----------------------------------------------------*
     C           KEYCK1    KLIST
     C                     KFLD           #KHIN1  5
     C                     KFLD           #KHIN2  5
     C                     KFLD           #KHIN3  2
      *----------------------------------------------------*
      * MAIN ROUTINE
      *----------------------------------------------------*
     C                     EXSR $SB100
     C                     EXSR $SB200
     C                     EXSR $SB300
      *----------------------------------------------------*
      * INITIAL SETTING
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
     C                     MOVE *BLANK    NKOT
     C                     MOVE *ZERO     NBMN
     C                     MOVE *BLANK    NKBN
     C                     MOVE *BLANK    NTKR
     C                     MOVE *BLANK    NSHR
     C                     MOVE *ZERO     KHZ
     C                     MOVE *BLANK    OKOT
     C                     MOVE *ZERO     OBMN
     C                     MOVE *BLANK    OKBN
     C                     MOVE *BLANK    OTKR
     C                     MOVE *BLANK    OSHR
     C                     MOVE *BLANK    SKOT
     C                     MOVE *ZERO     SBMN
     C                     MOVE *BLANK    SKBN
     C                     MOVE *BLANK    STKR
     C                     MOVE *BLANK    SSHR
     C                     MOVE *BLANK    SHBN
     C                     MOVE '0'       SHFLG   1
     C                     SETOF                       81
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *  MAIN PROCESS
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
     C                     MOVE INHIN1    #KHIN1
     C                     MOVE INHIN2    #KHIN2
     C                     MOVE INHIN3    #KHIN3
     C                     MOVE '9'       STATUS
     C           KEYCK1    CHAINAAMPL111             81
     C           *IN81     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKH8    ANDLE*DATE
     C                     SETON                     81
     C                     MOVE '9'       STATUS
     C                     MOVE '1'       SHFLG
     C                     GOTO $S200E
     C                     END
      *
     C           *IN81     IFEQ '0'
      *
     C                     Z-ADD1         X       20
     C           1         DO   15        X
     C***        KHZ,X     IFNE *ZERO
     C***                  MOVELKHZ,X     CHKDAT  80
     C***                  MOVE OKOT,X    SKOT,X
     C***                  MOVE OBMN,X    SBMN,X
     C***                  MOVE OKBN,X    SKBN,X
     C***                  MOVE OTKR,X    STKR,X
     C***                  MOVE OSHR,X    SSHR,X
     C***                  MOVE OHBN,X    SHBN,X
     C***        *DATE     IFGE CHKDAT
     C                     MOVE NKOT,X    SKOT,X
     C                     MOVE NBMN,X    SBMN,X
     C                     MOVE NKBN,X    SKBN,X
     C                     MOVE NTKR,X    STKR,X
     C                     MOVE NSHR,X    SSHR,X
     C                     MOVE NHBN,X    SHBN,X
     C***                  END
     C***                  END
     C                     END
      *
     C                     MOVE '1'       STATUS
     C                     MOVE '1'       SHFLG
     C                     END
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *  END PROCESS
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
     C           STATUS    IFEQ '1'
     C                     MOVEASBMN      OUTBMN 60
     C                     MOVEASKBN      OUTKBN 45
     C                     MOVEASTKR      OUTTKR 90
     C                     MOVEASSHR      OUTSHR 15
     C                     MOVEASKOT      OUTKOT 45
     C                     MOVEASHBN      OUTHBN180
     C                     END
     C                     SETON                     LR
     C                     RETRN
     CSR         $S300E    ENDSR
