     H            Y.
     FAAMPL11 IF  E           K        DISK
      *
     E                    NKOT       15  3
     E                    NBMN       15  4 0
      *---------------------------------------*
      *   新の情報                            *
      *---------------------------------------*
      *工程
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      *部門
     I            DS
     I                                        1  600NBMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKKM15
      *
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@KOTE  3
     C                     PARM           P@BMON  40
      *
     C                     Z-ADD0         P@BMON
      *
     C                     MOVE P@HIN1    K@HIN1  5
     C                     MOVE P@HIN2    K@HIN2  5
     C                     MOVE P@HIN3    K@HIN3  2
      *
     C           KEY       KLIST
     C                     KFLD           K@HIN1
     C                     KFLD           K@HIN2
     C                     KFLD           K@HIN3
      *
     C           KEY       CHAINAAMPL11              88
     C           *IN88     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C                     SETON                     88
     C                     END
     C                     END
     C           *IN88     IFEQ '0'
      *
     C                     Z-ADD1         @X      20
      *
     C           P@KOTE    LOKUPNKOT,@X                  77
     C           *IN77     IFEQ '1'
     C                     Z-ADDNBMN,@X   P@BMON
     C                     END
      *
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
