     H            Y.
      *
     FNZUPL06 IF  E           K        DISK
      *
     E                    SKOT       15  3
     E                    SBMN       15  4
     E                    SKBN       15  3
     E                    STKR       15  6
     E                    SSHR       15  1
     E                    SHBN       15 12
      *
     C           *ENTRY    PLIST
     C                     PARM           P@BARC 20
     C                     PARM           P@KOTE  3
     C                     PARM           P@BMON  4
     C                     PARM           P@KIBN  3
     C                     PARM           P@RTN   1
      *
     C                     MOVE *BLANK    P@RTN   1
      *
     C* * *                MOVE 'JC '     P@KOTE  3
     C* * *                MOVE '8990'    P@BMON  4
     C* * *                MOVE *BLANK    P@KIBN  3
      *
      * 90105A0359
      * A404000204M50C
     C* * *                MOVEL'A4040002'P@BARC
     C* * *                CAT  '04M50C':0P@BARC
      *
     C                     CALL 'BARR81'
     C                     PARM           P@BARC 20
     C                     PARM           P@KRKB  1
     C                     PARM           P@ZETI  4
     C                     PARM           P@TEHI  3
     C                     PARM           P@PAGN  2
     C                     PARM           P@BCKA  1
     C                     PARM           P@BCTK  1
     C                     PARM           P@BCYK  1
     C                     PARM           P@BCHK  1
     C                     PARM           P@BCKD  1
      *
     C           NZUKEY    KLIST
     C                     KFLD           P@KRKB
     C                     KFLD           P@ZETI
     C                     KFLD           P@TEHI
     C                     KFLD           P@PAGN
     C                     KFLD           P@BCKA
     C                     KFLD           P@BCTK
     C                     KFLD           P@BCYK
     C                     KFLD           P@BCHK
      *
     C           NZUKEY    SETGTNZUPL06
     C                     DO   *HIVAL
     C           NZUKEY    REDPENZUPL06                  77
     C   77                LEAVE
     C           N2SKJY    IFEQ 'D'
     C                     ITER
     C                     END
      *
     C                     LEAVE
      *
     C                     ENDDO
      *
     C   77                GOTO @END
      *
     C                     CALL 'BANR11'
     C                     PARM           N2JTK1
     C                     PARM           N2JTK2
     C                     PARM           N2JTK3
     C                     PARM           N2JTK4
     C                     PARM           N2JTKA  6
      *
     C                     CALL 'BANR11'
     C                     PARM           N2MTK1
     C                     PARM           N2MTK2
     C                     PARM           N2MTK3
     C                     PARM           N2MTK4
     C                     PARM           N2MTKA  6
      *
     C                     MOVELN2HAHZ    INYMDB
     C                     MOVE N2HABB    INYMDB
     C                     MOVEL'1'       OPNCLS
      *
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           N2SHN1  5
     C                     PARM           N2SHN2  5
     C                     PARM           N2SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           OUTBMN 60
     C                     PARM           OUTKBN 45
     C                     PARM           OUTTKR 90
     C                     PARM           OUTSHR 15
     C                     PARM           OUTKOT 45
     C                     PARM           OUTHBN180
     C                     PARM           STATUS  1
      *
     C                     MOVEAOUTBMN    SBMN
     C                     MOVEAOUTKBN    SKBN
     C                     MOVEAOUTTKR    STKR
     C                     MOVEAOUTSHR    SSHR
     C                     MOVEAOUTKOT    SKOT
     C                     MOVEAOUTHBN    SHBN
      *
     C                     SETOF                     55
      *
     C           1         DO   15        @X      20
     C           16        SUB  @X        @C      20
      *
     C           SKOT,@C   IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C           STKR,@C   IFEQ N2MTKA
     C                     LEAVE
     C                     END
      *
     C           STKR,@C   IFEQ N2JTKA
     C                     SETON                     55
     C                     END
      *
     C           *IN55     IFEQ '1'
      *
     C           P@BMON    IFNE *BLANK
     C           P@BMON    ANDNESBMN,@C
     C                     ITER
     C                     END
      *
     C           P@KOTE    IFNE *BLANK
     C           P@KOTE    ANDNESKOT,@C
     C                     ITER
     C                     END
      *
     C           P@KIBN    IFNE *BLANK
     C           P@KIBN    ANDNESKBN,@C
     C                     ITER
     C                     END
      *
     C                     MOVE '*'       P@RTN
     C                     LEAVE
      *
     C                     END
      *
     C                     ENDDO
      *
     C                     MOVEL'9'       OPNCLS
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           N2SHN1  5
     C                     PARM           N2SHN2  5
     C                     PARM           N2SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           OUTBMN 60
     C                     PARM           OUTKBN 45
     C                     PARM           OUTTKR 90
     C                     PARM           OUTSHR 15
     C                     PARM           OUTKOT 45
     C                     PARM           OUTHBN180
     C                     PARM           STATUS  1
      *
     C           @END      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
