     H            Y.
     F** AAMR87 ********************************************
     F*かんばん回転日数データ作成(AAOPP01)               *
     F*   MSK.                            2011.02.15       *
     F******************************************************
     FAAOPP01 IF  E                    DISK
     FGCKPL21 IF  E           K        DISK
   #@FAAJTL14 IF  E           K        DISK
     FAAMWP80 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80T1SKHZ
     I                                        1   40T1SKYY
     I                                        5   60T1SKMM
     I                                        7   80T1SKDD
     I            DS
     I                                        1   80T1UKH8
     I                                        1   40T1UKYY
     I                                        5   60T1UKMM
     I                                        7   80T1UKDD
      *
     I            DS
     I                                        1   80T1STHZ
     I                                        1   40T1STYY
     I                                        5   60T1STMM
     I                                        7   80T1STDD
      *
     I            DS
     I                                        1   3 T1JBN
     I                                        1   1 T1TKR1
     I                                        2   3 T1TKR2
      *
     I            DS
     I                                        1   3 WKF
     I                                        1   1 WKK1F
     I                                        2   3 WKT1F
      *
     I            DS
     I                                        1   3 WKT
     I                                        1   1 WKK1T
     I                                        2   3 WKT1T
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I            DS
     I                                        1   40@@YM
     I                                        1   20@YY
     I                                        3   40@MM
     I            DS
     I                                        1  100T1HZBN
     I                                        1   40T1UYY
     I                                        5   60T1UMM
     I                                        7   80T1UDD
     I                                        9  100T1UBN
     I            DS
     I                                        1  100CJHZBN
     I                                        1   80CJCHHZ
     I                                        9  100CJCHBI
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      *   PLIST                                            *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           PBMON   4
     C                     PARM           PKOTE   3
     C                     PARM           PK1F    1
     C                     PARM           PK1T    1
     C                     PARM           PT1F    2
     C                     PARM           PT1T    2
     C                     PARM           POUT    1
     C                     PARM           PCMD    2
     C*
     C                     Z-ADDUYEAR     @YY
     C                     Z-ADDUMONTH    @MM
     C                     MOVE @@YM      PYM     4
     C*
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           T1KSSU           fhmbﾈｮmbﾇc
     C                     PARM           T1SYOS           ﾆｬcﾑcﾇc
     C                     PARM           WLTM1            ﾆbﾛﾅgL.T
     C                     PARM           WLTM2            a]ﾈﾞ]L.T
     C                     PARM           @BLT             udﾃcmbL.T
     C                     PARM           WHITO            ﾍgnﾒﾇc
     C                     PARM           ZHITO            ﾍgnﾒﾜｮn
     C                     PARM           T1KCD1           f]ﾌﾞ] jﾞb
     C                     PARM           T1KCD2                 ﾆｭc
     C                     PARM           T1UZAR           a]ﾈﾞ]ubﾇc
     C                     PARM           WMAIS            f]ﾌﾞ]ubﾇc
     C                     PARM           T1HKSU           ﾌﾃﾇc
     C                     PARM           PYM              ﾆｭﾒﾍﾇﾞi
      *----------------------------------------------------*
      *   KLIST                                            *
      *----------------------------------------------------*
     C           #KEY2     KLIST
     C                     KFLD           T1TKR1
     C                     KFLD           T1TKR2
     C                     KFLD           T1TKR3
     C                     KFLD           T1TKR4
      ******************************************************
     C                     TIME           WTIME
     C                     MOVE PBMON     WKBMON  40
     C                     MOVE PK1F      WKK1F   1
     C                     MOVE PK1T      WKK1T   1
     C           PK1T      IFEQ *BLANK
     C                     MOVEL*HIVAL    WKK1T
     C                     ENDIF
     C                     MOVE PT1F      WKT1F   2
     C                     MOVE PT1T      WKT1T   2
     C           PT1T      IFEQ *BLANK
     C                     MOVEL*HIVAL    WKT1T
     C                     ENDIF
      *
     C                     READ AAOPP011                 81
     C           *IN81     DOWEQ'0'
     C           T1SKJY    IFEQ 'D'
     C           T1SKHZ    ANDLE*DATE
     C                     ELSE
     C           T1STHZ    IFEQ 99999999
     C                     EXSR #SB400
     C           WKOK      IFEQ '1'
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     READ AAOPP011                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------*
      *データ判定                 *
      *-----------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'1'       WKOK    1
      *部門
     C           PBMON     IFNE *BLANK
     C           T1BMON    IFNE WKBMON
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C                     ENDIF
      *工程
     C           PKOTE     IFNE *BLANK
     C           T1KTEI    IFNE PKOTE
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C                     ENDIF
      *番地
     C           T1JBN     IFLT WKF
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C           T1JBN     IFGT WKT
     C                     MOVEL'0'       WKOK
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *-----------------------------*
      *データ出力                 *
      *-----------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAAMWP801
     C                     MOVELT1BMON    W0BMON
     C                     MOVELT1SHN1    W0SHN1
     C                     MOVELT1SHN2    W0SHN2
     C                     MOVELT1SHN3    W0SHN3
     C                     MOVELT1KTEI    W0KOTE
     C                     MOVELT1TKR1    W0TKR1
     C                     MOVELT1TKR2    W0TKR2
     C                     MOVELT1TKR3    W0TKR3
     C                     MOVELT1TKR4    W0TKR4
     C                     Z-ADDT1KTSU    W0KTSU
     C                     Z-ADDT1KSSU    W0KSSU
     C           T1KSSU    DIV  20        DMY6   103
     C           T1SYOS    IFNE 0
     C           DMY6      DIV  T1SYOS    W0KHSU    H
     C                     ENDIF
     C                     Z-ADDT1SYOS    W0SYUY
     C           T1HKSU    IFEQ 0
     C                     Z-ADD1         W0LOTK
     C                     ELSE
     C                     Z-ADDT1HKSU    W0LOTK
     C                     ENDIF
     C                     Z-ADD0         W0KJNK
     C                     Z-ADD0         W0SETO
     C                     Z-ADDT1KMAX    W0KMAX
     C                     MOVELT1KCD1    W0KCD1
     C                     MOVELT1KCD2    W0KCD2
      *
     C                     MOVE *BLANK    W0KSN1
     C                     MOVE *BLANK    W0KSN3
     C                     MOVE *BLANK    W0KSN2
     C                     Z-ADDT1HITO    W0HITO
      *
     C           T1SYOS    IFNE 0
     C                     EXSR $SB600
     C                     EXSR $SB601
     C                     END
     C*
     C                     Z-ADD0         W0KEIS
     C                     Z-ADD0         W0MAXS
     C                     MOVE *BLANK    W0KKEY
     C                     Z-ADD0         W0CYOU
     C                     MOVE *BLANK    ASTLR   2        SETON LR ﾍｭcﾆg
     C                     MOVE T1HITO    WHITO   3
     C                     MOVE T1HITO    ZHITO   3
     C                     Z-ADD0         WMAIS   40
     C                     CALL 'ABCR08'  ACALL
     C                     MOVE WMAIS     W0SMAX
     C                     MOVE T1HKSU    W0SLOT
     C                     MOVE *BLANK    W0SJNK
      *
     C                     WRITEAAMWP801
      *
     C           #KEY5     KLIST
     C                     KFLD           T1BMON
     C                     KFLD           T1TAIP
      *
     C           #KEY6     KLIST
     C                     KFLD           T1SBMN
     C                     KFLD           T1STAP
      *
     CSR         ESB500    ENDSR
      *-----------------------------*
      *ＬＴ取得                 *
      *-----------------------------*
     CSR         $SB600    BEGSR
     C                     Z-ADD0         W0TYLT
      *
     C                     Z-ADD0         W0LTIM
      *
     C                     Z-ADD0         @ALT    31
     C                     Z-ADD0         WLTM1   31
     C                     Z-ADD0         WLTM2   31
     C                     SETOF                     30
     C           #KEY5     CHAINGCKPL211             30
     C           *IN30     IFEQ '0'
     C           T2SKJY    IFEQ 'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C                     END
     C           *IN30     IFEQ '0'
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
     C           T2LTM1    ADD  T2LTM2    @ALT
     C                     END
     C*
     C                     Z-ADD0         @BLT    31
     C                     SETOF                     40
     C           #KEY6     CHAINGCKPL211             40
     C           *IN40     IFEQ '0'
     C           T2SKJY    IFEQ 'D'
   #@C           T2SKHZ    ANDLE*DATE
     C                     SETON                     40
     C                     END
     C                     END
     C           *IN40     IFEQ '0'
     C           T2LTM1    ADD  T2LTM2    @BLT
     C                     END
     C*
     C           ESB600    ENDSR
      *-----------------------------*
      *後工程引き取りﾜｮn取得     *
      *-----------------------------*
     CSR         $SB601    BEGSR
     C* anﾃcmb ﾍgnﾒﾜｮn
     C*
     C                     Z-ADD0         XHITO   90
   #@C*
   #@C           T1UKH8    COMP WTIHZ                35
     C           *IN35     IFEQ '1'
     C                     Z-ADDT1UKYY    T1UYY
     C                     Z-ADDT1UKMM    T1UMM
     C                     Z-ADDT1UKDD    T1UDD
     C                     Z-ADDT1UBIN    T1UBN
     C                     ELSE
     C                     Z-ADDWTIYY     T1UYY
     C                     Z-ADDWTIMM     T1UMM
     C                     Z-ADDWTIDD     T1UDD
     C                     Z-ADD01        T1UBN
     C                     END
     C           #KEY2     SETLLAAJTL141
     C                     DO   *HIVAL
     C           #KEY2     READEAAJTL141                 30
     C           *IN30     IFEQ '0'
     C           CJAKHZ    IFNE 0
   #@C*
   #@C           CJAKHZ    CABLEWTIHZ     @001
     C                     END
     C           CJHZBN    IFGT T1HZBN
     C           CJSLOT    ANDGTXHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C           @001      TAG
     C  N30                END
     C*
     C* anﾃcmb ﾍgnﾒﾇc
     C*
     C           XHITO     DIV  T1SYOS    T1HITO
     C                     MVR            XHI     30
     C           XHI       IFNE 0
     C                     ADD  1         T1HITO
     C                     END
     C                     MOVE T1HITO    ZHITO   3
     C           T1HITO    IFEQ 0
     C                     Z-ADD1         T1HITO
     C                     END
     C*
     C           ESB601    ENDSR
