     H            Y.
     FAAMPP11 IP  E                    DISK
     FAAMWPXX O   F    1024            DISK
     E                    NKOT       15  3
     E                    NBMN       15  4 0
     E                    NKBN       15  3
     E                    NTKR       15  6
     E                    NSHR       15  1
     E                    NHBN       15 12
     E                    KHZ        15 10 0
      *---------------------------------------*
      * NEW INFORMATION
      *---------------------------------------*
      * PROCESS
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      * DEPARTMENT
     I            DS
     I                                        1  600NBMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      * MACHINE
     I            DS
     I                                        1  45 NKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      * LOCATION
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
      * KANBAN INFORMATION
     I            DS
     I                                        1  15 NSHR
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
      * SWITCH DATE
     I            DS
     I                                        1 1500KHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
      *
     C           CKSKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
      *
     C                     MOVE '*'       LAST    1
     C                     SETOF                     77
      *
     C           1         DO   15        X       20
     C           16        SUB  X         Y       20
     C           NKOT,Y    IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C           *IN77     IFEQ '1'
     C           NSHR,Y    IFNE *BLANK
     C                     MOVE *BLANK    LAST
     C                     END
     C                     END
      *
     C           NSHR,Y    IFNE *BLANK
     C                     SETON                     77
     C                     END
      *
     C                     EXCPTODAT
      *
     C                     ENDDO
      *
     C           @END      TAG
      *
     OAAMWPXX E                ODAT
     O                         CKHIN1
     O                         CKHIN2
     O                         CKHIN3
     O                                      ','
     O                         NKOT,Y
     O                                      ','
     O                         NTKR,Y
     O                                      ','
     O                         KHZ,Y
     O                                      ','
     O                         LAST
