     H            Y.
     F*** AAMRSL *******************************************
     F* MACHINE NO. MATCH
     F* 2022.AUG.01 T.SAKASHITA
     F*-----------------------------------------------------
     F* TRY "TST AAMRSL" ON COMMAND ENTRY
     F*-----------------------------------------------------
     F* JC  : JC  OK  ALL MATCH
     F* JC1 : JC2 NG  3RD DIGIT IS NOT MATCH
     F* JC1 : JC* OK  ALL MATCH WITHOUT * COLUMN
     F* JC1 : J** NG  ALL MATCH WITHOUT * COLUMN
     F* JC1 : J*  NG  3RD DIGIT IS NOT MATCH
     F* XYZ : *** OK  ALL MATCH WITHOUT * COLUMN
     F******************************************************
     I            DS
     I                                        1   3 W@KIBN
     I                                        1   1 W@KIB1
     I                                        2   2 W@KIB2
     I                                        3   3 W@KIB3
      *
     I            DS
     I                                        1   3 C@KIBN
     I                                        1   1 C@KIB1
     I                                        2   2 C@KIB2
     I                                        3   3 C@KIB3
      *
     C           *ENTRY    PLIST
     C                     PARM           P@KIBN  3
     C                     PARM           P@CHKK  3
     C                     PARM           P@RTN   1
      *
     C                     MOVE *BLANK    P@RTN
      *
     C                     MOVE P@KIBN    W@KIBN
     C                     MOVE P@CHKK    C@KIBN
      *
     C           C@KIB1    IFNE '*'
     C           C@KIB1    ANDNEW@KIB1
     C                     MOVE 'E'       P@RTN
     C                     GOTO @END
     C                     END
      *
     C           C@KIB2    IFNE '*'
     C           C@KIB2    ANDNEW@KIB2
     C                     MOVE 'E'       P@RTN
     C                     GOTO @END
     C                     END
      *
     C           C@KIB3    IFNE '*'
     C           C@KIB3    ANDNEW@KIB3
     C                     MOVE 'E'       P@RTN
     C                     GOTO @END
     C                     END
      *
     C           @END      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
