     H            Y.
     F** AAMR88 ********************************************
     F*かんばん回転日数データ作成(AAYPP01)               *
     F*   MSK.                            2011.02.15       *
     F******************************************************
     FAAYPP01 IF  E                    DISK
     FAAMWP80 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80L8SKHZ
     I                                        1   40L8SKYY
     I                                        5   60L8SKMM
     I                                        7   80L8SKDD
      *
     I            DS
     I                                        1   80L8STHZ
     I                                        1   40L8STYY
     I                                        5   60L8STMM
     I                                        7   80L8STDD
      *
     I            DS
     I                                        1   3 L8JBN
     I                                        1   1 L8TKR1
     I                                        2   3 L8TKR2
      *
     I            DS
     I                                        1   3 WKF
     I                                        1   1 WKK1F
     I                                        2   3 WKT1F
      *
     I            DS
     I                                        1   3 WKT
     I                                        1   1 WKK1T
     I                                        2   3 WKT1T
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   40@@YM
     I                                        1   20@YY
     I                                        3   40@MM
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      *   PLIST                                            *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           PBMON   4
     C                     PARM           PKOTE   3
     C                     PARM           PK1F    1
     C                     PARM           PK1T    1
     C                     PARM           PT1F    2
     C                     PARM           PT1T    2
     C                     PARM           POUT    1
     C                     PARM           PCMD    2
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           L8KSSU           確定設定数
     C                     PARM           L8SYOS           収容数
     C                     PARM           L8LTM1  31       自部門LT
     C                     PARM           L8LTM2  31       前部門LT
     C                     PARM           L8KCD1           種類（大）
     C                     PARM           L8KCD2           種類（小）
     C                     PARM           L8HKSU           箱数
     C                     PARM           L8UZAR           安全枚数
     C                     PARM           L8KEIS  32       係数
     C                     PARM           L8HITO
     C                     PARM           WMAIS            f]ﾌﾞ]ubﾇc
      *----------------------------------------------------*
      *   KLIST                                            *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     Z-ADDUYEAR     @YY
     C                     Z-ADDUMONTH    @MM
     C                     MOVE @@YM      PYM     4
     C                     MOVE PBMON     WKBMON  40
     C                     MOVE PK1F      WKK1F   1
     C                     MOVE PK1T      WKK1T   1
     C           PK1T      IFEQ *BLANK
     C                     MOVEL*HIVAL    WKK1T
     C                     ENDIF
     C                     MOVE PT1F      WKT1F   2
     C                     MOVE PT1T      WKT1T   2
     C           PT1T      IFEQ *BLANK
     C                     MOVEL*HIVAL    WKT1T
     C                     ENDIF
      *
     C                     READ AAYPP011                 81
     C           *IN81     DOWEQ'0'
     C           L8SKJY    IFEQ 'D'
     C           L8SKHZ    ANDLE*DATE
     C                     ELSE
     C           L8STHZ    IFEQ 99999999
     C                     EXSR #SB400
     C           WKOK      IFEQ '1'
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     READ AAYPP011                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------*
      *データ判定                 *
      *-----------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'1'       WKOK    1
      *部門
     C           PBMON     IFNE *BLANK
     C           L8BMON    IFNE WKBMON
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C                     ENDIF
      *工程
     C           PKOTE     IFNE *BLANK
     C           L8KTEI    IFNE PKOTE
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C                     ENDIF
      *番地
     C           L8JBN     IFLT WKF
     C                     MOVEL'0'       WKOK
     C                     ENDIF
     C           L8JBN     IFGT WKT
     C                     MOVEL'0'       WKOK
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *-----------------------------*
      *データ出力                 *
      *-----------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAAMWP801
     C                     MOVELL8BMON    W0BMON
     C                     MOVELL8SHN1    W0SHN1
     C                     MOVELL8SHN2    W0SHN2
     C                     MOVELL8SHN3    W0SHN3
     C                     MOVELL8KTEI    W0KOTE
     C                     MOVELL8TKR1    W0TKR1
     C                     MOVELL8TKR2    W0TKR2
     C                     MOVELL8TKR3    W0TKR3
     C                     MOVELL8TKR4    W0TKR4
     C           L8KTSU    MULT 20        W0KTSU
     C           L8KSSU    MULT 20        W0KSSU
     C           L8SYOS    IFNE 0
     C           L8KSSU    DIV  L8SYOS    W0KHSU    H
     C                     ENDIF
     C                     Z-ADDL8SYOS    W0SYUY
     C           L8HKSU    IFEQ 0
     C                     Z-ADD1         W0LOTK
     C                     ELSE
     C                     Z-ADDL8HKSU    W0LOTK
     C                     ENDIF
     C                     Z-ADD0         W0KJNK
     C                     Z-ADD0         W0SETO
     C                     Z-ADDL8KMAX    W0KMAX
     C                     MOVELL8KCD1    W0KCD1
     C                     MOVELL8KCD2    W0KCD2
      *
     C                     MOVE *BLANK    W0KSN1
     C                     MOVE *BLANK    W0KSN3
     C                     MOVE *BLANK    W0KSN2
     C                     Z-ADDL8HITO    W0HITO
     C                     Z-ADD0         W0TYLT
     C                     Z-ADD0         W0LTIM
     C                     Z-ADD0         W0KEIS
     C***        L8LTM1    ADD  L8LTM2    W0LTIM
     C***                  Z-ADDL8KEIS    W0KEIS
     C                     Z-ADD0         W0CYOU
     C                     Z-ADDL8UZAR    W0MAXS
     C                     MOVE *BLANK    W0KKEY
      *
     C                     MOVE *BLANK    ASTLR   2        SETON LR ﾍｭcﾆg
     C                     Z-ADD0         WMAIS   40
     C           L8SYOS    IFNE 0
     C                     CALL 'ABCR12'  ACALL
     C                     END
     C                     MOVE WMAIS     W0SMAX
     C                     MOVE L8HKSU    W0SLOT
     C                     MOVE *BLANK    W0SJNK
     C                     WRITEAAMWP801
      *
     CSR         ESB500    ENDSR
