     H            Y.
     F** AAMRU1 ********************************************
     F*                                                  *
     F*  T.SAKASHITA                        2014.08.05     *
     F******************************************** BTMRC1 **
     FAAMPWU1 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
      *
     E                    OBM        15  4               部門
     E                    OKB        15  3               機番
     E                    OTK        15  6               所番地
     E                    OSH        15  1               かんばん種類
     E                    OKO        15  3               工程
     E                    OHB        15 12               品番
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* 初期ﾈｮmb
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C*  SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVE *BLANK    @@UMU   1        データ有無
      *工程切替マスター情報
     C           AAMRSC    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVE *BLANK    PBMN   60
     C                     MOVE *BLANK    PKBN   45
     C                     MOVE *BLANK    PTKR   90
     C                     MOVE *BLANK    PSHR   15
     C                     MOVE *BLANK    PKOT   45
     C                     MOVE *BLANK    PHBN  180
     C                     MOVE *BLANK    STATUS  1
      *
     C                     MOVEA*BLANK    OBM
     C                     MOVEA*BLANK    OKB
     C                     MOVEA*BLANK    OTK
     C                     MOVEA*BLANK    OSH
     C                     MOVEA*BLANK    OKO
     C                     MOVEA*BLANK    OHB
      *
     C                     CALL 'AAMRSC'  AAMRSC
      *
     C           STATUS    IFNE '1'
     C                     GOTO @END
     C                     END
      *
     C                     MOVEAPBMN      OBM
     C                     MOVEAPKBN      OKB
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSH
     C                     MOVEAPKOT      OKO
     C                     MOVEAPHBN      OHB
      *
     C           1         DO   15        @X      20
      *
     C           OKO,@X    IFEQ *BLANK
     C                     LEAVE
     C                     END
      *
     C                     MOVE OBM,@X    S1BMON
     C                     MOVE OKO,@X    S1KOTE
     C                     MOVE OKB,@X    S1KIBN
     C                     MOVE OTK,@X    S1TKRA
      *
     C                     MOVE OBM,@X    P#BMON  4
     C                     MOVE OKO,@X    P#KOTE  3
     C                     MOVE OKB,@X    P#KIBN  3
     C                     MOVE OSH,@X    P#KCD1  1
     C                     MOVE *DATE     P#DATE  8
     C                     MOVE OHB,@X    P#HINA 12
     C                     MOVE OTK,@X    P#BANA  6
      * PRE LOAD
     C                     Z-ADD0         P#QTY   90
     C                     CALL 'ABBRS3'
     C                     PARM           P#KOTE  3
     C                     PARM           P#KIBN  3
     C                     PARM           P#DATE  8
     C                     PARM           P#HIN1  5
     C                     PARM           P#HIN2  5
     C                     PARM           P#HIN3  2
     C                     PARM           P#QTY   90
      *
     C                     ADD  1         RRN
     C                     WRITESFREC1
      *
E1   C                     ENDDO
     C*-------------------------
     C*
     C           @END      TAG
     C*
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *画面１*
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *----*
      * F3 *
      *----*
     C   KC                MOVE '#END    '@STEP
     C                     ENDSR
