     H            Y.
     F*** AANR01 *********************************
     F* WORK IN PROCESS KANBAN MASTER RENEWAL    *
     F*         H.ITO         89.11.15           *
     F* UPDATE:K.OKACHI    2002.05.28    %0001   *
     F*        K.OKACHI    2002.06.27    %0002   *
     F*        TCHK1       2006.07.13            *
     F*        TCHK2       2007.02.12            *
     F*        TCHK3       2009.08.05 CHG BOX COLOR 'GY-GREN' TO 'GLIME'
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.23|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
%0003F*2021.10.28|DCS. |N.KIM     | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F****************************************************** AANR01 ***
     FAANPW01 CF  E                    WORKSTN
     FAANPL03 UF  E           K        DISK
     FAAJPL11 UF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FAACPL01 IF  E           K        DISK
     FAAJTL14 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
%0002 *
     FAAMPL11 IF  E           K        DISK
     FFCEPL41 IF  E           K        DISK
     F            FCEPP401                          KRENAMEFCEPL411
%0002 *
     E                    ER      1  39 60               d[ｰxｮﾈｰﾆﾞ
     E                    TBL1    1   5  4               ﾑcﾍﾞxb
     E                    TBL2    1  10  4 0             cibﾛﾃcﾆﾞｭc
TCHK1E*                   CMT1    1  14  1               ﾌﾃbﾜ
TCHK1E                    CMT1    1  15  1               ﾌﾃbﾜ
     E                    CMT0    1   4  1
%0002 *
     E                    TB5     1  12  3   TB6     1   箱色
     E                    KKO        15  3               新工程
     E                    CKO        15  3               工程WORK
%0002 *
     E                    #YOB        5  4               ﾉcpｬcﾑcﾍﾞ
     E                    #YBI        5  1               ﾑcﾍﾞxb
     E                    #TTM        8  4 0             ﾉcpｬcﾆﾞf]
     E                    #TTI        8  4 0             ﾉcpｬcﾆﾞf]
     E                    #JNM        6 16               ﾆﾞｭci]xb
     E                    #JOK        6  2               ﾆﾞｭci]ﾃｰnﾞ
     I            DS
     I                                        1  96 #JNM
     I                                        1  16 @JNM1
     I                                       17  32 @JNM2
     I                                       33  48 @JNM3
     I                                       49  64 @JNM4
     I                                       65  80 @JNM5
     I                                       81  96 @JNM6
     I            DS
     I                                        1  12 #JOK
     I                                        1   2 L7JOK1
     I                                        3   4 L7JOK2
     I                                        5   6 L7JOK3
     I                                        7   8 L7JOK4
     I                                        9  10 L7JOK5
     I                                       11  12 L7JOK6
     I            DS
     I                                        1  14 @SHIN
     I                                        1   5 L7SHN1
     I                                        6   6 H1
     I                                        7  11 L7SHN2
     I                                       12  12 H2
     I                                       13  14 L7SHN3
     I            DS
     I                                        1   9 @TKRO
     I                                        1   1 L7TKR1
     I                                        2   2 T1
     I                                        3   4 L7TKR2
     I                                        5   5 T2
     I                                        6   7 L7TKR3
     I                                        8   8 T3
     I                                        9   9 L7TKR4
     I            DS
     I                                        1  23 @HIZK
     I                                        1   80L7UKHZ
     I                                        9   9 U1
     I                                       10  110L7UBIN
     I                                       12  12 U2
     I                                       13  200L7STHZ
     I                                       21  21 U3
     I                                       22  230L7SBIN
     I            DS
     I                                        1  20 #YOB
     I                                        1  12 @YOB1
     I                                       13  20 @YOB2
     I            DS
     I                                        1   60@SKRU
     I                                        1   20@SKR1
     I                                        3   40@SKR2
     I                                        5   60@SKR3
     I            DS
     I                                        1   5 #YBI
     I                                        1   1 T2MOND
     I                                        2   2 T2TUED
     I                                        3   3 T2WEND
     I                                        4   4 T2THUD
     I                                        5   5 T2FRID
     I            DS
     I                                        1  320#TTI
     I                                        1   40T2NHM1
     I                                        5   80T2NHM2
     I                                        9  120T2NHM3
     I                                       13  160T2NHM4
     I                                       17  200T2NHM5
     I                                       21  240T2NHM6
     I                                       25  280T2NHM7
     I                                       29  320T2NHM8
     I            DS
     I                                        1  320#TTM
     I                                        1   40@TIM1
     I                                        5   80@TIM2
     I                                        9  120@TIM3
     I                                       13  160@TIM4
     I                                       17  200@TIM5
     I                                       21  240@TIM6
     I                                       25  280@TIM7
     I                                       29  320@TIM8
     I            DS
     I                                        1   80L7SKHZ
     I                                        1   40L7SKYY
     I                                        5   60L7SKMM
     I                                        7   80L7SKDD
     I            DS
     I                                        1   80L7KOHZ
     I                                        1   40L7KOYY
     I                                        5   80L7KOMD
     I                                        5   60L7KOMM
     I                                        7   80L7KODD
     I            DS
     I                                        1  100L7TKBI
     I                                        1   40L7TKYY
     I                                        5   60L7TKMM
     I                                        7   80L7TKDD
     I                                        9  100L7TBIN
     I            DS
     I                                        1   80DJSKHZ
     I                                        1   40DJSKYY
     I                                        5   60DJSKMM
     I                                        7   80DJSKDD
     I            DS
     I                                        1   80A4SKHZ
     I                                        1   40A4SKYY
     I                                        5   60A4SKMM
     I                                        7   80A4SKDD
     I            DS
     I                                        1   80T8SKHZ
     I                                        1   40T8SKYY
     I                                        5   60T8SKMM
     I                                        7   80T8SKDD
     I            DS
     I                                        1   80T2SKHZ
     I                                        1   40T2SKYY
     I                                        5   60T2SKMM
     I                                        7   80T2SKDD
     I            DS
     I                                        1   80DBSKHZ
     I                                        1   40DBSKYY
     I                                        5   60DBSKMM
     I                                        7   80DBSKDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
     I            DS
     I                                        1   6 PTKR
     I                                        1   1 PTKR1
     I                                        2   3 PTKR2
     I                                        4   5 PTKR3
     I                                        6   6 PTKR4
     I            DS
     I                                        1   80PUKHZ
     I                                        1   40PUKYY
     I                                        5   60PUKMM
     I                                        7   80PUKDD
     I            DS
     I                                        1   60WTIME
     I                                        1   20L7KOHH
     I                                        3   40L7KOSS
     I            DS
     I                                        1  16 @STNM
     I            DS
     I                                        1  100L7HZBN
     I                                        1   40L7UYY
     I                                        5   60L7UMM
     I                                        7   80L7UDD
     I                                        9  100L7UBN
     I            DS
     I                                        1  100L7HIBN
     I                                        1   40L7SYY
     I                                        5   60L7SMM
     I                                        7   80L7SDD
     I                                        9  100L7SBN
     I            DS
     I                                        1  100CJHZBN
     I                                        1   80CJCHHZ
     I                                        1   40CJCHYY
     I                                        5   60CJCHMM
     I                                        7   80CJCHDD
     I                                        9  100CJCHBI
     I            DS
     I                                        1   60@@YM
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1   4 L7UKER
     I                                        1   2 @@UKER
     I            DS
     I                                        1  20 T2NAMN
     I            DS
     I                                        1  30 $SINM
     I                                        1  14 $SINM1
     I            DS
     I                                        1  12 L7KHN1
     I                                        1   5 L7KH11
     I                                        6  10 L7KH12
     I                                       11  12 L7KH13
     I            DS
     I                                        1  12 L7KHN2
     I                                        1   5 L7KH21
     I                                        6  10 L7KH22
     I                                       11  12 L7KH23
     I            DS
     I                                        1  12 L7KHN3
     I                                        1   5 L7KH31
     I                                        6  10 L7KH32
     I                                       11  12 L7KH33
     I            DS
     I                                        1  12 L7KHN4
     I                                        1   5 L7KH41
     I                                        6  10 L7KH42
     I                                       11  12 L7KH43
%0002 *
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
%0002 *
      *
     C           AKEY      KLIST
     C                     KFLD           PTKR1
     C                     KFLD           PTKR2
     C                     KFLD           PTKR3
     C                     KFLD           PTKR4
     C                     KFLD           PUKYY
     C                     KFLD           PUKMM
     C                     KFLD           PUKDD
     C                     KFLD           PUBIN
      *
     C           BKEY      KLIST
     C                     KFLD           L7SHN1
     C                     KFLD           L7SHN2
     C                     KFLD           L7SHN3
      *
     C           CKEY      KLIST
     C                     KFLD           L7TKR1
     C                     KFLD           L7TKR2
     C                     KFLD           L7TKR3
     C                     KFLD           L7TKR4
      *
     C           EKEY      KLIST
     C                     KFLD           L7TKR1
     C                     KFLD           L7TKR2
     C                     KFLD           L7TKR3
     C                     KFLD           L7TKR4
     C                     KFLD           L7SYY
     C                     KFLD           L7SMM
     C                     KFLD           L7SDD
     C                     KFLD           L7SBN
      *
     C           KEY1      KLIST
     C                     KFLD           L7KCD1
     C                     KFLD           L7KCD2
      *
     C           KEY2      KLIST
     C                     KFLD           L7BMON
     C                     KFLD           L7TAIP
      *
     C           KEY3      KLIST
     C                     KFLD           WJKN
     C                     KFLD           L7KCD1
      *
     C*****************************************************
     C* MO-NO1   ﾌﾟ[xｰjｰ  &  ﾆｭgﾆｭﾒ
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           PFILE1  5        A-PICSﾎｦbﾓ
     C                     PARM           PUSER  10        ﾏｰﾅﾞｰ
     C                     PARM           PLR     2        LR ﾆﾍｭc
     C                     PARM           PCD     1        ﾆｬcﾒｭcﾃｰnﾞ
     C                     PARM           PTKRO   6        ﾆﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PUHZ    8        ﾏcﾃcﾍﾞ
     C                     PARM           PUBN    2            ﾍﾞ]
     C                     PARM           PCM     8        ﾃcﾆ]obﾑc
     C                     MOVE PTKRO     PTKR
     C                     MOVE PUHZ      PUKHZ
     C                     MOVE PUBN      PUBIN   20
      *
     C           PLR       IFEQ 'LR'
     C           *IN50     IFEQ '1'
     C                     MOVE 'LR'      ASTLR
     C                     CALL 'ABCR10'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C* f]ﾌﾞ]ubﾇc ibﾅ]PGM s ﾌﾟ[xｰjｰﾒﾇn
     C*
     C                     Z-ADD*YEAR     @YY
     C                     Z-ADDUMONTH    @MM
     C                     MOVE @@YM      PYM     6
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           L7TKR1           nﾃﾜﾌﾞ]k 1
     C                     PARM           L7TKR2                   2
     C                     PARM           L7TKR3                   3
     C                     PARM           L7TKR4                   4
     C                     PARM           WKTSU            fhmbﾈｮmbﾇc
     C                     PARM           L7SYOS           ﾆｬcﾑcﾇc
     C                     PARM           WLTM1            ﾆbﾛﾅgL.T
     C                     PARM           WLTM2            a]ﾈﾞ]L.T
     C                     PARM           L7BMON           ﾃcpｬc ﾎﾞy]
     C                     PARM           L7SKCD           ﾈbgｬcﾅg
     C                     PARM           WHITO            ﾍgnﾒﾇc
     C                     PARM           ZHITO            ﾍgnﾒﾜｮn
     C                     PARM           L7KCD1           f]ﾌﾞ] jﾞb
     C                     PARM           L7KCD2                 ﾆｭc
     C                     PARM           L7UZAR           a]ﾈﾞ]ubﾇc
     C                     PARM           WMAIS            f]ﾌﾞ]ubﾇc
     C                     PARM           L7HKSU           ﾌﾃﾇc
     C                     PARM           PYM              ﾆｭﾒﾍﾇﾞi
      *
     C*****************************************************
     C* MO-NO2   mﾞｰj MOVE
     C*****************************************************
     C                     SETOF                     30
     C           AKEY      CHAINAANPL031             30
     C                     MOVE L7STI1    @SET2
     C                     MOVE *BLANK    @SET1
     C                     MOVE 'G001'    L7YOUS
      *
     C                     Z-ADDL7UKOJ    UUKOJ   40
     C                     MOVE L7UKER    UUKER   4
     C                     MOVE L7TAIP    UTAIP   1
     C                     MOVE L7JOK1    UJOK1   2
     C                     MOVE L7JOK2    UJOK2   2
     C                     MOVE L7JOK3    UJOK3   2
     C                     MOVE L7JOK4    UJOK4   2
     C                     MOVE L7JOK5    UJOK5   2
     C                     MOVE L7JOK6    UJOK6   2
     C                     Z-ADDL7HKSU    UHKSU   20
     C                     MOVE L7SPEN    USPEN   1
     C                     MOVE L7HAK1    UHAK1   1
     C                     MOVE L7HAK2    UHAK2   1
     C                     Z-ADDL7SYOS    USYOS   50
     C                     MOVE L7SYOT    USYOT   1
     C                     MOVE L7BIK1    UBIK1  14
     C                     MOVE L7KHN1    UKHN1  12
     C                     Z-ADDL7SIY1    USIY1   10
     C                     MOVE L7KHN2    UKHN2  12
     C                     Z-ADDL7SIY2    USIY2   10
     C                     MOVE L7KHN3    UKHN3  12
     C                     Z-ADDL7SIY3    USIY3   10
     C                     MOVE L7KHN4    UKHN4  12
     C                     Z-ADDL7SIY4    USIY4   10
      *
     C           L7DOUT    IFEQ 'Y'
     C                     Z-ADDL7KMAX    L7MAIS
     C                     END
      *
     C                     Z-ADDL7KMAX    WKMAX
     C                     Z-ADDL7KALL    WKALL   50
     C                     Z-ADDL7KMIN    WMIN    50
     C                     Z-ADDL7KMAX    WMAX    50
     C           L7KALL    IFLT L7KMAX
     C                     Z-ADDL7KMAX    WALL    50
     C                     ELSE
     C                     Z-ADDL7KALL    WALL
     C                     END
     C                     Z-ADDL7KSKB    KSKBN
      *
     C                     MOVE *BLANK    L7AKI1
     C                     Z-ADD0         L7AKI2
     C                     MOVE *BLANK    L7AKI3
     C                     Z-ADD0         L7AKI4
     C                     MOVE *BLANK    L7AKI5
      *
     C* ﾈﾞｮjbﾌﾞ]ﾃﾞc
     C*
     C                     MOVE *BLANK    L7ZETI
     C           BKEY      CHAINFCEPL011             30
     C           *IN30     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVE A2ZETI    L7ZETI
     C                     END
      *
     C* anﾃcmb ﾍgnﾒﾜｮn
     C*
     C                     Z-ADD0         XHITO   90
     C           L7UKHZ    COMP *DATE                25
     C           *IN25     IFEQ '1'
     C                     Z-ADDL7UKYY    L7UYY
     C                     Z-ADDL7UKMM    L7UMM
     C                     Z-ADDL7UKDD    L7UDD
     C                     Z-ADDL7UBIN    L7UBN
     C                     ELSE
     C                     Z-ADD*YEAR     L7UYY
     C                     Z-ADDUMONTH    L7UMM
     C                     Z-ADDUDAY      L7UDD
     C                     Z-ADD01        L7UBN
     C                     END
     C           CKEY      SETLLAAJTL141
     C                     DO   *HIVAL
     C           CKEY      READEAAJTL141                 30
     C           *IN30     IFEQ '0'
     C           CJAKHZ    IFNE 0
     C           CJAKHZ    CABLE*DATE     @001
     C                     END
     C           CJHZBN    IFGT L7HZBN
     C           CJSLOT    IFGT XHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C                     END
     C           @001      TAG
     C  N30                END
      *
     C* ﾏｰﾅﾞｰﾉcpｬcfbﾇc -> ag p s]ﾃc 90.12.17
     C*
     C                     Z-ADD0         L7KAIS
      *
     C                     MOVE '-'       H1
     C                     MOVE '-'       H2
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       U1
     C                     MOVE ':'       U2
     C                     MOVE '-'       U3
     C                     Z-ADD0         WRD     10
      *
     C                     SETON                     98
     C                     SETOF                     50
      *
     C                     EXSR #SUB1                      f]ﾌﾞ]ﾆｬﾓb
     C                     EXSR #SUB2                      BCD & L.T
     C                     EXSR #SUB3                      ﾈｮmbuﾇjｰ
     C                     EXSR #SUB4                      ﾆﾞｭci]uﾇjｰ
      *
     C*****************************************************
     C* MO-NO    fﾞx]-1
     C*****************************************************
     C           @SCR1     TAG
     C                     EXFMTAANPW011
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'00000'   *IN,16
     C                     MOVEA'0'       *IN,21
     C                     MOVEA'1'       *IN,50
     C                     MOVEA'00'      *IN,98
     C                     SETOF                     31
      *
     C           *INKC     IFEQ '1'
     C                     MOVELL7TKR1    P3ATK1
     C                     MOVELL7TKR2    P3ATK2
     C                     MOVELL7TKR3    P3ATK3
     C                     MOVELL7TKR4    P3ATK4
     C                     MOVELL7UKYY    P3UKYY
     C                     MOVELL7UKMM    P3UKMM
     C                     MOVELL7UKDD    P3UKDD
     C                     MOVELL7UBIN    P3UBIN
     C                     CALL 'ANZR98'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     MOVE '3'       PCD
     C                     RETRN
     C                     END
      *
     C           *INKD     IFEQ '1'
     C           ANZR05    PLIST
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     PARM           P@FPGM 10
     C                     PARM           P@MAXH  40       安全箱数
     C                     PARM           PSTS    1        *ステータス
      *
     C                     MOVELL7TKR1    P3ATK1
     C                     MOVELL7TKR2    P3ATK2
     C                     MOVELL7TKR3    P3ATK3
     C                     MOVELL7TKR4    P3ATK4
     C                     MOVELL7UKYY    P3UKYY
     C                     MOVELL7UKMM    P3UKMM
     C                     MOVELL7UKDD    P3UKDD
     C                     MOVELL7UBIN    P3UBIN
     C                     MOVEL'AANR01'  P@FPGM
     C                     Z-ADDL7UZAR    P@MAXH  40       安全箱数
     C                     MOVE *BLANK    PSTS    1        *ステータス
      *
     C                     CALL 'ANZR05'  ANZR05
     C                     GOTO @SCR1
     C                     ENDIF
     C* ﾍgnﾒﾜｮn ﾉ ﾆｭcfb
     C*
     C                     MOVE L7UKYY    PUYY    4
     C                     MOVE L7UKMM    PUMM    2
     C                     MOVE L7UKDD    PUDD    2
     C                     MOVE L7UBIN    PUBN    2
     C           *INKB     IFEQ '1'
     C                     CALL 'AAJR16'
     C                     PARM           L7TKR1           ﾆﾞ nﾃﾜﾌﾞ]k 1
     C                     PARM           L7TKR2                      2
     C                     PARM           L7TKR3                      3
     C                     PARM           L7TKR4                      4
     C                     PARM           PUYY             ﾏcﾃcﾍﾞ r]
     C                     PARM           PUMM                    lg
     C                     PARM           PUDD                    ﾍ
     C                     PARM           PUBN                    ﾍﾞ]
     C                     GOTO @SCR1
     C                     END
      *
     C* HELP ﾌﾃﾉbﾜﾆｭcfb
     C*
     C           *IN80     IFEQ '1'
     C                     CALL 'AAOR03'
     C                     GOTO @SCR1
     C                     END
     C*****************************************************
     C           L7DTKO    IFNE '0'
     C*****************************************************
      *
     C* fhmbobﾆﾞﾇc
     C*
     C           L7KTSU    IFEQ 0
     C                     SETON                     019899
     C                     MOVELER,01     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾈbgｬcﾅg
     C*
     C           L7SKCD    IFNE 0111
     C                     SETON                     0299
     C                     MOVELER,02     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* f]ﾌﾞ]ﾆｬﾓb ﾆｭc
     C*
     C           L7KCD2    IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVELER,03     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* f]ﾌﾞ]ﾆｬﾓbuﾇjｰ kｩｮh
     C*
     C                     EXSR #SUB1
     C           *IN99     CABEQ'1'       @SCR1
      *
     C* ﾃcpｬcﾅg jbﾎﾟ
     C*
     C           L7TAIP    IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVELER,04     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾎﾞy]sﾞlL.Tuﾇjｰ kｩｮh
     C*
     C                     EXSR #SUB2
     C           *IN99     CABEQ'1'       @SCR1
      *
     C* cibﾛﾎﾞy]
     C*
     C                     Z-ADD1         X       20
     C                     SETOF                     90
     C           L7UKOJ    LOKUPTBL2,X                   90
     C           *IN90     IFEQ '0'
     C                     SETON                     2099
     C                     MOVELER,25     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾈｮmbﾃｰnﾞ
     C*
     C                     MOVE *BLANK    @STNM
     C           @SET1     IFEQ *BLANK
     C                     SETON                     0699
     C                     MOVELER,05     MSG
     C                     GOTO @SCR1
     C                     END
     C           @SET1     IFLT '00'
     C                     SETON                     0699
     C                     MOVELER,06     MSG
     C                     GOTO @SCR1
     C                     END
     C                     MOVE @SET1     L7STI1
      *
     C* ﾈｮmbuﾇjｰ kｩｮh
     C*
     C                     EXSR #SUB3
     C           *IN99     CABEQ'1'       @SCR1
      *
     C* ﾃcﾆ]hﾎﾞ]
     C*
     C           @SET1     COMP '01'                 30  30
     C   30      @SET1     COMP '49'                   3030
     C           *IN30     IFEQ '1'
     C           L7KSKB    IFEQ 8
     C                     Z-ADD9         KSKBN
     C                     ELSE
     C           L7KSKB    IFEQ 9
     C                     Z-ADD0         KSKBN
     C                     ELSE
     C           L7KSKB    IFEQ 0
     C                     Z-ADD8         KSKBN
     C                     END
     C                     END
     C                     END
     C                     ELSE
     C                     Z-ADDL7KSKB    KSKBN
     C                     END
      *
TCHK1C                     Z-ADD0         W@MAXH  40
     C                     MOVELL7TKR1    P3ATK1
     C                     MOVELL7TKR2    P3ATK2
     C                     MOVELL7TKR3    P3ATK3
     C                     MOVELL7TKR4    P3ATK4
     C                     MOVELL7UKYY    P3UKYY
     C                     MOVELL7UKMM    P3UKMM
     C                     MOVELL7UKDD    P3UKDD
     C                     MOVELL7UBIN    P3UBIN
     C                     CALL 'ANZR06'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
     C                     PARM           W@MAXH
      *
     C           W@MAXH    IFNE L7UZAR
     C                     SETON                     3199
     C                     MOVE ER,30     MSG
     C                     GOTO @SCR1
     C                     ENDIF
      *
     C* ﾌﾃﾆﾏ1
     C*
     C           L7HAK1    IFEQ *BLANK
     C                     SETON                     0899
     C                     MOVELER,11     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C                     Z-ADD1         @Z
     C                     SETOF                     30
     C           L7HAK1    LOKUPCMT0,@Z                  30
     C           *IN30     IFEQ '0'
     C                     SETON                     0999
     C                     MOVELER,11     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾌﾃﾆﾏ2
     C*
%0001 *
      ***
     C***        L7HAK2    IFNE 'P'
     C***        L7HAK2    ANDNE'Y'
     C***        L7HAK2    ANDNE'G'
     C***        L7HAK2    ANDNE'A'
     C***        L7HAK2    ANDNE'K'
     C***        L7HAK2    ANDNE'R'
     C***        L7HAK2    ANDNE'B'
     C***        L7HAK2    ANDNE'H'
     C***        L7HAK2    ANDNE'D'
     C***        L7HAK2    ANDNE'C'
     C***        L7HAK2    ANDNE'M'
     C***                  SETON                     0999
     C***                  MOVELER,12     MSG
     C***                  GOTO @SCR1
     C***                  END
     C                     Z-ADD1         @Z      20
     C                     SETOF                     30
     C           L7HAK2    LOKUPCMT1,@Z                  30
     C           *IN30     IFEQ '0'
     C                     SETON                     0999
     C                     MOVELER,12     MSG
     C                     GOTO @SCR1
     C                     END
%0001 *
%0002 *
     C                     EXSR #SB100
TCHK2C           CFLG      IFEQ '*'
TCHK2C           WKO       ANDEQ'OQ '
TCHK2C           L7HAK2    ANDEQ'X'
TCHK2C                     ELSE
     C           CFLG      IFEQ '*'
     C           WIRO      ANDNEL7HAK2
     C                     SETON                     0999
     C                     MOVELER,12     MSG
     C                     GOTO @SCR1
     C                     END
TCHK2C                     END
%0002 *
     C* ﾆﾞｭci]xb ﾈｮn
     C*
     C                     EXSR #SUB4
     C           *IN99     CABEQ'1'       @SCR1
      *
     C* ﾌﾃﾇc
     C*
     C           L7HKSU    IFEQ 0
     C                     SETON                     1699
     C                     MOVELER,24     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾆｬcﾑcﾇc
     C*
     C           L7SYOS    IFEQ 0
     C                     SETON                     1799
     C                     MOVELER,13     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* ﾆｬcﾑcﾇc j]b
     C*
     C           L7SYOT    IFEQ *BLANK
     C                     SETON                     1899
     C                     MOVELER,14     MSG
     C                     GOTO @SCR1
     C                     END
      *
     C* anﾃcmb ﾍgnﾒﾇc
     C*
     C           XHITO     DIV  L7SYOS    L7HITO
     C                     MVR            XHI     30
     C           XHI       IFNE 0
     C                     ADD  1         L7HITO
     C                     END
     C                     MOVE L7HITO    ZHITO   3
     C                     Z-ADDL7HITO    YHITO   30
     C           L7HITO    IFEQ 0
     C                     Z-ADD1         L7HITO
     C                     END
      *
     C*****************************************************
     C*  MO-NO   f]ﾌﾞ]ubﾇc ibﾅ]
     C*****************************************************
     C                     SETON                     51
     C                     MOVE *BLANK    ASTLR   2        SETON LR ﾍｭcﾆg
     C                     MOVE L7HITO    WHITO   3
     C           L7KTSU    MULT 20        WKTSU   90
     C                     Z-ADD0         WMAIS   50
     C                     CALL 'ABCR10'  ACALL
     C***        WMAIS     IFGT 999
     C***        WMAIS     IFGT 9999
%0003C           WMAIS     IFGT 90000
     C                     SETON                       99
     C                     MOVELER,15     MSG
     C                     GOTO @SCR1
     C                     END
     C                     Z-ADDWMAIS     L7KMAX
     C                     Z-ADDL7KMAX    WKMAX
     C           L7DTKO    IFEQ '2'
     C           L7DTKO    OREQ 'D'
     C                     GOTO @002
     C                     END
     C           L7DOUT    IFNE *BLANK
     C                     Z-ADDWALL      L7KALL
     C                     Z-ADDWMAX      L7KMIN
     C                     END
     C           *YEAR     CABEQL7KOYY    @003
     C           *YEAR     SUB  L7KOYY    WYY     40
     C           WYY       IFLE 01
     C                     Z-ADDUMONTH    XXMM
     C                     Z-ADDUDAY      XXDD
     C           XXMD      CABLEL7KOMD    @003
     C                     END
     C           L7KALL    CABLTL7KMIN    @003
     C           L7KMIN    CABGE30        @003
     C                     SETOF                     30
     C           L7STI1    COMP 01                     30
     C  N30      L7STI1    COMP 49                   30
     C           *IN30     IFEQ '1'
     C*                    SETON                     0699
     C*                    MOVELER,16     MSG
     C*                    GOTO @SCR1
     C                     END
     C           @003      TAG
     C                     Z-ADD0         L7SRMS
     C           L7DOUT    IFNE *BLANK
     C                     MOVE *BLANK    L7KSHK
     C                     Z-ADD0         L7ALHK
     C                     Z-ADD0         L7MXHK
     C                     END
     C           L7KSKB    IFEQ KSKBN
     C           L7DOUT    CABEQ'Y'       @002
     C           L7KSHK    CABEQ*BLANK    @002
     C                     Z-ADDL7ALHK    WKALL            f]ﾌﾞ]ubﾇc ALL
     C                     Z-ADDL7MXHK    WMAX                       MAX
     C                     ELSE
     C           L7KSHK    IFNE *BLANK
     C                     Z-ADDL7ALHK    WKALL
     C                     Z-ADDL7MXHK    WMAX
     C                     END
     C                     END
     C                     Z-ADD0         L7KALL
     C                     Z-ADD0         L7KMIN
     C           WKALL     IFGT WMAX
     C           WKALL     SUB  WMAX      L7SRMS
     C                     END
     C           @002      TAG
      *
     C           L7UKHZ    IFLE *DATE
     C           L7DTKO    ANDNE'2'
     C           L7DTKO    ANDNE'6'
     C           L7DTKO    ANDNE'D'
     C           L7UKOJ    IFEQ UUKOJ
     C           L7UKER    ANDEQUUKER
     C**STOP     L7TAIP    ANDEQUTAIP
     C           L7JOK1    ANDEQUJOK1
     C           L7JOK2    ANDEQUJOK2
     C           L7JOK3    ANDEQUJOK3
     C           L7JOK4    ANDEQUJOK4
     C           L7JOK5    ANDEQUJOK5
     C           L7JOK6    ANDEQUJOK6
     C           L7HKSU    ANDEQUHKSU
     C           L7SPEN    ANDEQUSPEN
     C           L7HAK1    ANDEQUHAK1
     C           L7HAK2    ANDEQUHAK2
     C           L7SYOS    ANDEQUSYOS
     C           L7SYOT    ANDEQUSYOT
     C           L7STI1    ANDGE50
     C                     ELSE
     C                     SETON                     99
     C                     MOVELER,29     MSG
     C                     GOTO @SCR1
     C                     END
     C                     END
     C*****************************************************
     C                     END
     C*****************************************************
     C                     ADD  1         WRD
     C           WRD       IFEQ 1
     C                     GOTO @SCR1
     C                     END
      *
     C           *INKE     IFEQ '1'
      *
     C                     EXSR #KOSN
     C           *IN99     CABEQ'1'       @SCR2
      *
     C                     MOVE '1'       PCD
     C                     RETRN
     C                     END
      *
     C*****************************************************
     C* MO-NO    fﾞx]-2    ﾃcﾈbﾍ] ﾉ ﾃcﾆ]
     C*****************************************************
     C           @SCR2     TAG
     C                     EXFMTAANPW012
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00000'   *IN,06
     C                     MOVEA'00000'   *IN,11
     C                     MOVEA'0'       *IN,16
     C                     MOVEA'0'       *IN,99
      *
     C           *INKB     IFEQ '1'
     C                     Z-ADD0         WRD
     C                     GOTO @SCR1
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '3'       PCD
     C                     RETRN
     C                     END
     C*****************************************************
     C           L7DTKO    IFNE '0'
     C*****************************************************
      *
     C* ﾃcﾈbﾍ]1
     C*
     C           L7KHN1    IFEQ *BLANK
     C           L7SIY1    IFEQ 0
     C                     ELSE
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELER,28     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C           L7SIY1    IFEQ 0
     C           L7KHN1    IFEQ *BLANK
     C                     ELSE
     C                     SETON                     0499
     C                     MOVELER,27     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C* ﾃcﾈbﾍ]2
     C*
     C           L7KHN2    IFEQ *BLANK
     C           L7SIY2    IFEQ 0
     C                     ELSE
     C                     SETON                     050607
     C                     SETON                     99
     C                     MOVELER,28     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C           L7SIY2    IFEQ 0
     C           L7KHN2    IFEQ *BLANK
     C                     ELSE
     C                     SETON                     0899
     C                     MOVELER,27     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C* ﾃcﾈbﾍ]3
     C*
     C           L7KHN3    IFEQ *BLANK
     C           L7SIY3    IFEQ 0
     C                     ELSE
     C                     SETON                     091011
     C                     SETON                     99
     C                     MOVELER,28     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C           L7SIY3    IFEQ 0
     C           L7KHN3    IFEQ *BLANK
     C                     ELSE
     C                     SETON                     1299
     C                     MOVELER,27     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C* ﾃcﾈbﾍ]4
     C*
     C           L7KHN4    IFEQ *BLANK
     C           L7SIY4    IFEQ 0
     C                     ELSE
     C                     SETON                     131415
     C                     SETON                     99
     C                     MOVELER,28     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C           L7SIY4    IFEQ 0
     C           L7KHN4    IFEQ *BLANK
     C                     ELSE
     C                     SETON                     1699
     C                     MOVELER,27     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
      *
     C           L7UKHZ    IFLE *DATE
     C           L7DTKO    ANDNE'2'
     C           L7DTKO    ANDNE'6'
     C           L7DTKO    ANDNE'D'
     C           L7BIK1    IFEQ UBIK1
     C           L7KHN1    ANDEQUKHN1
     C           L7SIY1    ANDEQUSIY1
     C           L7KHN2    ANDEQUKHN2
     C           L7SIY2    ANDEQUSIY2
     C           L7KHN3    ANDEQUKHN3
     C           L7SIY3    ANDEQUSIY3
     C           L7KHN4    ANDEQUKHN4
     C           L7SIY4    ANDEQUSIY4
     C           L7STI1    ANDGE50
     C                     ELSE
     C                     SETON                     99
     C                     MOVELER,29     MSG
     C                     GOTO @SCR2
     C                     END
     C                     END
     C*****************************************************
     C                     END
     C*****************************************************
     C  NKE                GOTO @SCR2
      *
     C                     EXSR #KOSN
     C           *IN99     CABEQ'1'       @SCR2
      *
     C                     MOVE '1'       PCD
     C                     RETRN
      *
     C*****************************************************
     C*   MO-NO  ﾎｦbﾓ ﾃcﾆ]
     C*****************************************************
     C           #KOSN     BEGSR
      *
     C           L7DTKO    IFNE '0'                        0-nﾒiﾆ
      *
     C* ﾌﾞ]kuﾇjｰ ﾃcﾆ]
     C*
     C                     SETOF                     25
     C           L7STHZ    COMP *DATE                25
     C           *IN25     IFEQ '1'
     C                     Z-ADDL7STYY    L7SYY
     C                     Z-ADDL7STMM    L7SMM
     C                     Z-ADDL7STDD    L7SDD
     C                     Z-ADDL7SBIN    L7SBN
     C                     ELSE
     C                     Z-ADD*YEAR     L7SYY
     C                     Z-ADDUMONTH    L7SMM
     C                     Z-ADDUDAY      L7SDD
     C                     Z-ADD01        L7SBN
     C                     END
     C           EKEY      SETLLAAJPL111
     C                     SETOF                     30
     C           EKEY      READEAAJPL111                 30
     C           *IN30     IFEQ '0'
     C           L7TKRO    IFNE CJBANC
     C                     SETON                     99
     C                     MOVELER,17     MSG
     C                     GOTO @007
     C                     END
     C                     Z-ADDL7SYOS    CJSYUY
     C           YHITO     MULT L7SYOS    CJSLOT
     C                     UPDATAAJPL111
     C                     END
      *
     C* ﾌ]ﾈbﾍ]f]ﾌﾞ]uﾇjｰ ﾃcﾆ]
     C*
     C           L7KCD2    IFNE 'Z'
     C           L7KSKB    IFEQ KSKBN
     C           L7DOUT    CABEQ'Y'       @005
     C           L7KSHK    CABEQ*BLANK    @005
     C                     END
     C           L7DOUT    IFNE *BLANK
     C                     MOVE 'H'       L7KSHK
     C                     Z-ADDWKALL     L7ALHK
     C                     Z-ADDWMAX      L7MXHK
     C                     END
     C           @005      TAG
     C           L7DTKO    IFNE '2'
     C           KSKBN     IFEQ L7KSKB
     C           L7KMIN    IFEQ L7KMAX
     C                     GOTO @006
     C                     END
     C                     END
     C                     END
     C                     MOVE *BLANK    L7DOUT
     C                     MOVE 'Y'       L7KOUT
     C           @006      TAG
     C                     END
     C                     END
      *
     C                     MOVELPUSER     L7KOME
     C                     Z-ADD*DATE     L7KOHZ
     C                     TIME           WTIME
      *
     C           L7DTKO    IFEQ '0'
     C                     MOVE 'D'       L7SKJY
     C                     Z-ADD*DATE     L7SKHZ
     C                     MOVE '*'       L7DTHE
     C                     MOVELL7UKHZ    L7TKBI
     C                     MOVE L7UBIN    L7TKBI
     C                     UPDATAANPL031
     C                     ELSE
      *
     C                     Z-ADDKSKBN     L7KSKB
     C                     MOVE '1'       L7DTKO
     C                     MOVE '*'       L7DTHE
     C                     UPDATAANPL031
     C                     EXSR #SBTYO
     C                     END
     C           @007      ENDSR
      *
     C*****************************************************
     C*   MO-NO  f]ﾌﾞ]ﾆｬﾓbuﾇjｰ kｩｮh
     C*****************************************************
     C           #SUB1     BEGSR
     C                     SETOF                     30
     C                     MOVE *BLANK    @KANM
     C           KEY1      CHAINGCMPL311             30
     C           *IN30     IFEQ '1'
     C           *IN50     IFEQ '1'
     C                     SETON                     0399
     C                     MOVELER,18     MSG
     C                     END
     C                     GOTO @008
     C                     END
     C           T3SKJY    IFEQ 'D'
     C           T3SKHZ    ANDLE*DATE
     C           *IN50     IFEQ '1'
     C                     SETON                     0399
     C                     MOVELER,18     MSG
     C                     END
     C                     GOTO @008
     C                     END
     C                     MOVELT3NAMN    @KANM
     C           @008      ENDSR
      *
     C*****************************************************
     C*   MO-NO  ﾌﾞｰﾃｰnﾞ & ﾎﾞy]sﾞlL.Tuﾇjｰ kｩｮh
     C*****************************************************
     C           #SUB2     BEGSR
     C                     MOVE *BLANK    @BCOD
     C                     SETOF                     30
     C           L7BMON    CHAINAACPL011             30
     C           *IN30     IFEQ '1'
     C           *IN50     IFEQ '1'
     C                     MOVELER,19     MSG
     C                     SETON                     99
     C                     END
     C                     GOTO @0091
     C                     END
     C           T8SKJY    IFEQ 'D'
     C           T8SKHZ    ANDLE*DATE
     C           *IN50     IFEQ '1'
     C                     MOVELER,19     MSG
     C                     SETON                     99
     C                     END
     C                     GOTO @0091
     C                     END
     C                     MOVE T8BKO2    L7MBCD
     C                     MOVE T8BKO2    @BCOD
     C           @0091     TAG
      *
     C                     MOVE *BLANK    @KONM
     C                     Z-ADD0         @LTIM
     C                     MOVE *BLANK    #YOB
     C                     Z-ADD0         @SKRU
     C                     Z-ADD0         #TTM
     C                     Z-ADD0         WLTM1   31
     C                     Z-ADD0         WLTM2   31
     C                     SETOF                     30
     C           KEY2      CHAINGCKPL211             30
     C           *IN30     IFEQ '1'
     C           *IN50     IFEQ '1'
     C                     SETON                     0499
     C                     MOVELER,20     MSG
     C                     END
     C                     GOTO @009
     C                     END
     C           T2SKJY    IFEQ 'D'
     C           T2SKHZ    ANDLE*DATE
     C           *IN50     IFEQ '1'
     C                     SETON                     0499
     C                     MOVELER,20     MSG
     C                     END
     C                     GOTO @009
     C                     END
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
      *
     C                     MOVELT2NAMN    @KONM
     C           T2LTM1    ADD  T2LTM2    @LTIM
     C                     Z-ADD@LTIM     L7LTIM
     C                     Z-ADD1         A       10
     C                     Z-ADD0         B       10
     C           1         DO   5         A
     C           #YBI,A    IFEQ '1'
     C                     ADD  1         B
     C                     MOVE TBL1,A    #YOB,B
     C                     END
     C                     END
     C                     Z-ADDT2SKRU    @SKRU
     C           @SKRU     COMP 0                    5252
     C                     Z-ADD#TTI      #TTM
     C           @009      ENDSR
      *
     C*****************************************************
     C*  MO-NO   ﾈｮmbuﾇjｰ kｩｮh
     C*****************************************************
     C           #SUB3     BEGSR
     C                     SETOF                     30
     C                     MOVE *BLANK    @STNM
     C           L7STI1    CHAINAABPL011             30
     C           *IN30     IFEQ '1'
     C           *IN50     IFEQ '1'
     C                     SETON                     0699
     C                     MOVELER,21     MSG
     C                     END
     C                     GOTO @010
     C                     END
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    ANDLE*DATE
     C           *IN50     IFEQ '1'
     C                     SETON                     0699
     C                     MOVELER,21     MSG
     C                     END
     C                     GOTO @010
     C                     END
     C                     MOVELA4SETN    @STNM
     C           @010      ENDSR
      *
     C*****************************************************
     C*   MO-NO  ﾆﾞｭci] ﾈｮn
     C*****************************************************
     C           #SUB4     BEGSR
     C                     MOVE *BLANK    #JNM
     C                     Z-ADD1         I       10
     C           1         DO   6         I
     C           I         ADD  9         K       20
     C           #JOK,I    IFNE *BLANK
     C           I         ADD  1         J       20
     C                     SETOF                     30
     C                     MOVE #JOK,I    WJKN    2
     C           KEY3      CHAINAAAPL011             30
     C           *IN30     IFEQ '1'
     C                     MOVE '1'       *IN,K
     C                     SETON                     99
     C                     MOVELER,22     MSG
     C                     GOTO @011
     C                     END
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     MOVE '1'       *IN,K
     C                     SETON                     99
     C                     MOVELER,22     MSG
     C                     GOTO @011
     C                     END
     C                     MOVELA5JOKM    #JNM,I
     C           I         IFNE 6
     C           #JOK,I    LOKUP#JOK,J                   30
     C           *IN30     IFEQ '1'
     C                     MOVE '1'       *IN,K
     C           J         ADD  9         K
     C                     MOVE '1'       *IN,K
     C                     SETON                     99
     C                     MOVELER,23     MSG
     C                     GOTO @011
     C                     END
     C                     END
     C                     END
     C                     END
     C           @011      ENDSR
%0002 *-----------------------------------------------------*
     C           #SB100    BEGSR
     C                     MOVE *BLANK    HHIN1   5
     C                     MOVE *BLANK    HHIN2   5
     C                     MOVE *BLANK    HHIN3   2
     C                     SETOF                     30
     C           BKEY      CHAINFCEPL41              30
     C           *IN30     IFEQ '0'
     C                     MOVE F4PRT1    HHIN1
     C                     MOVE F4PRT2    HHIN2
     C                     MOVE F4PRT3    HHIN3
     C                     END
      *
     C           KEYA      KLIST
     C                     KFLD           HHIN1
     C                     KFLD           HHIN2
     C                     KFLD           HHIN3
     C                     SETOF                     30
     C           KEYA      CHAINAAMPL111             30
     C           *IN30     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         @A      20
     C                     Z-ADD0         @B      20
     C           1         DO   15        @A
     C           KKO,@A    IFNE *BLANK
     C                     ADD  1         @B
     C                     MOVE KKO,@A    CKO,@B
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     Z-ADD1         @A
     C                     Z-ADD0         @B
     C                     MOVE *BLANK    WKO     3
     C                     SETOF                     30
     C           'HN '     LOKUPCKO,@A                   30
     C           *IN30     IFEQ '1'
     C           @A        ADD  1         @B
     C                     MOVE CKO,@B    WKO
     C                     END
      *
     C                     MOVE *BLANK    CFLG    1
     C                     Z-ADD1         @A
     C                     MOVE *BLANK    WIRO    1
     C           WKO       IFNE *BLANK
     C                     SETOF                     30
     C           WKO       LOKUPTB5,@A                   30
     C           *IN30     IFEQ '1'
     C                     MOVE TB6,@A    WIRO
     C                     MOVE '*'       CFLG
     C                     END
     C                     END
      *
     C           ESB100    ENDSR
      *------------------------------------*
      *安全在庫理由                      *
      *------------------------------------*
     CSR         #SBTYO    BEGSR
      *
     C                     MOVELL7TKR1    P3ATK1
     C                     MOVELL7TKR2    P3ATK2
     C                     MOVELL7TKR3    P3ATK3
     C                     MOVELL7TKR4    P3ATK4
     C                     MOVELL7UKYY    P3UKYY
     C                     MOVELL7UKMM    P3UKMM
     C                     MOVELL7UKDD    P3UKDD
     C                     MOVELL7UBIN    P3UBIN
     C                     CALL 'ANZR99'
     C                     PARM           P3ATK1  1
     C                     PARM           P3ATK2  2
     C                     PARM           P3ATK3  2
     C                     PARM           P3ATK4  1
     C                     PARM           P3UKYY  40
     C                     PARM           P3UKMM  20
     C                     PARM           P3UKDD  20
     C                     PARM           P3UBIN  20
      *
     CSR         ESBTYO    ENDSR
%0002 *-----------------------------------------------------*
**  ER (ERROR-MESSAGE)
E-01 NO FINAL SETTING NUMBER ENTRY
E-02 EACH FACTORY IS BILLED.
E-03 NO K-TYPE(S) ENTRY
E-04 NO ENTRY IN REVERSING DEPARTMENT TYPE
E-05 NO SETTING CODE ENTRY
E-06 SETTING CODE MUST BE NUMERICAL
E-07 NO USER'S NUM.OF DEL.ENTRY
E-08 USER'S NUM.OF DEL.MUST BE EQUAL TO OR UNDER NUM.
E-09 K-TYPE(S) A;USER'S NUM.OF DEL. MUST BE 5 OR OVER 5.
E-10 K-TYPE(S) B;USER'S NUM.OF DEL. MUST BE 4 OR UNDER 4.
E-11 NO BOX TYPE-1 ENTRY
E-12 NO BOX TYPE-2 ENTRY
E-13 NO QUANTITY IN CONTAINER ENTRY
E-14 QUANTITY IN CONTAINER UNIT ENTRY
E-15 NUMBER OF KANBAN'S MUST BE EQUAL TO OR UNDER 90000
E-16 OBSOLETE KANBAN DATA, REMAKE REQUIRED
E-17 WRONG LOCATION
E-18 NO DATA IN KANBAN TYPE M/F
E-19 NO VENDOR DEPOARTMENT DATA IN BAR CODE M/F
E-20 NO DATA IN DEPATMENTAL LT M/F
E-21 NO DATA IN SETTING M/F
E-22 NO DATA IN CONDITION M/F
E-23 DUPLICATION OCCURRED IN REVERSING CONDITION CODE
E-24 WRONG NUMBER OF BOXES ENTRY
E-25 EACH AOYAMA FACTORY IS RECEIVING FACTORY
E-26 ENTER RECEIVING POINT.
E-27 NUMBER REQUIRED ALONG WITH COMPONENT PART NO.
E-28 COMPONENT PART NO. REQUIRED ALONG WITH NUMBER
E-29 UPDATE EFFECTIVE DATA DUE TO CHANGE IN KANBAN'S DETAILS
E-30 MAX #OF BOXS DIFFERENT W SAFETY INVENTORY
** (納入曜日)
MON.
TUE.
WED.
THU.
FRI.
**  TBL2
0111
** CMT1 ( BOX COLOR NAME)

P                                  PINK
Y                                  YELLOW
G                                  LIME
A                                  R-BRWN
K                                  BLACK
M                                  GREEN
R                                  RED
C                                  BROWN
B                                  BLUE
W                                  WHITE
O                                  ORANGE
H                                  GRAY
X                                  BR-PNK
Z                                  BR-GRN
** CMT0 ( BOX KIND)
C                                  5INCH CONTAINER
M                                  ASJ CONTAINER
G                                  CART
D                                  4INCH CONTAINER
** TB5.TB6
OQ P
LOQP
AOQY
LANG
HANG
COQA
SB R
CZ R
KN C
   C
