     H            Y.
     F*** AAOR01 **********************************
     F* PURCHASING KANBAN MASTER RENEWAL          *
     F*        H.ITO           89.03.02           *
     F* ----------------------------------------- *
     F* JW1    2024.05.02 CHG ERROR MESSAGE       *
     F*********************************************
     FAAOPW01 CF  E                    WORKSTN
     FAAPTL02 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAANTL02 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     E                    ER      1  10 60               d[ｰ､xｮﾈｰﾆﾞ
     E                    CMT1    1  15  1   CMT2    8   ﾃx]n xb
     E                    CMT3    1   6  1   CMT4   12   f]ﾌﾞ] hﾎﾞ]
     E                    ANO         7  4 0             SEQ-NO
     E                    ACM         7  8               ﾃx]n
     E                    ADI         7 14               ﾍ]ﾌﾞ]
     E                    APL         7  9               nﾃﾜ ﾌﾞ]k
     E                    AKT         7 12               f]ﾌﾞ] ﾆｬﾓbxb
     E                    AFR         7 11               ﾏcﾃcﾍﾞ､ﾍﾞ]
     E                    ATO         7 11               ﾆｮﾃcﾍﾞ､ﾍﾞ]
     E                    KEY         7 28               KEY jbﾍ
     E                    KCD         7  1               KEY f]ﾌﾞ]ﾆｬﾓb
     E                    HRT      1500 40
     I            DS
     I                                        1  280ANO
     I                                        1   40ANO1
     I                                        5   80ANO2
     I                                        9  120ANO3
     I                                       13  160ANO4
     I                                       17  200ANO5
     I                                       21  240ANO6
     I                                       25  280ANO7
     I            DS
     I                                        1  56 ACM
     I                                        1   8 ACM1
     I                                        9  16 ACM2
     I                                       17  24 ACM3
     I                                       25  32 ACM4
     I                                       33  40 ACM5
     I                                       41  48 ACM6
     I                                       49  56 ACM7
     I            DS
     I                                        1  98 ADI
     I                                        1  14 ADI1
     I                                       15  28 ADI2
     I                                       29  42 ADI3
     I                                       43  56 ADI4
     I                                       57  70 ADI5
     I                                       71  84 ADI6
     I                                       85  98 ADI7
     I            DS
     I                                        1  63 APL
     I                                        1   9 APL1
     I                                       10  18 APL2
     I                                       19  27 APL3
     I                                       28  36 APL4
     I                                       37  45 APL5
     I                                       46  54 APL6
     I                                       55  63 APL7
     I            DS
     I                                        1  84 AKT
     I                                        1  12 AKT1
     I                                       13  24 AKT2
     I                                       25  36 AKT3
     I                                       37  48 AKT4
     I                                       49  60 AKT5
     I                                       61  72 AKT6
     I                                       73  84 AKT7
     I            DS
     I                                        1  77 AFR
     I                                        1  11 AFR1
     I                                       12  22 AFR2
     I                                       23  33 AFR3
     I                                       34  44 AFR4
     I                                       45  55 AFR5
     I                                       56  66 AFR6
     I                                       67  77 AFR7
     I            DS
     I                                        1  77 ATO
     I                                        1  11 ATO1
     I                                       12  22 ATO2
     I                                       23  33 ATO3
     I                                       34  44 ATO4
     I                                       45  55 ATO5
     I                                       56  66 ATO6
     I                                       67  77 ATO7
     I            DS
     I                                        1  40 AHRT
     I                                        1  12 AHIN
     I                                        1   5 AHIN1
     I                                        6  10 AHIN2
     I                                       11  12 AHIN3
     I                                       13  200AUKHZ
     I                                       21  220AUKBN
     I                                       23  23 ADTHE
     I                                       24  29 ATKR
     I                                       24  24 ATKR1
     I                                       25  26 ATKR2
     I                                       27  28 ATKR3
     I                                       29  29 ATKR4
     I                                       30  30 AKCD1
     I                                       31  380ASTHZ
     I                                       39  400ASTBN
     I            DS
     I                                        1  40 XHRT
     I                                        1   6 XTKR
     I                                        1   1 XTKR1
     I                                        2   3 XTKR2
     I                                        4   5 XTKR3
     I                                        6   6 XTKR4
     I                                        7  140XUKHZ
     I                                       15  160XUKBN
     I                                       17  28 XHIN
     I                                       17  21 XHIN1
     I                                       22  26 XHIN2
     I                                       27  28 XHIN3
     I                                       29  29 XDTHE
     I                                       30  30 XKCD1
     I                                       31  380XSTHZ
     I                                       39  400XSTBN
     I            DS
     I                                        1  14 DSDI
     I                                        1   5 BHIN1
     I                                        6   6 H1
     I                                        7  11 BHIN2
     I                                       12  12 H2
     I                                       13  14 BHIN3
     I            DS
     I                                        1   9 DSPL
     I                                        1   1 BTKR1
     I                                        2   2 T1
     I                                        3   4 BTKR2
     I                                        5   5 T2
     I                                        6   7 BTKR3
     I                                        8   8 T3
     I                                        9   9 BTKR4
     I            DS
     I                                        1  11 DSFR
     I                                        1   80BUKHZ
     I                                        9   9 U1
     I                                       10  110BUKBN
     I            DS
     I                                        1  11 DSTO
     I                                        1   80BSTHZ
     I                                        9   9 S1
     I                                       10  110BSTBN
     I            DS
     I                                        1  16 CKEY
     I                                        1   6 CTKR
     I                                        7  140CUKHZ
     I                                       15  160CUBIN
     I            DS
     I                                        1   80WSKHZ
     I                                        1   40WSKYY
     I                                        5   60WSKMM
     I                                        7   80WSKDD
      *
     C*****************************************************
     C* MO-NO1   ﾌﾟ[xｰjｰ  &  ﾆｭgﾆｭﾒ
     C*****************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10        ﾏｰﾅﾞｰ
     C                     PARM           FILE1   5        A-PICSﾎｦbﾓ
      *
     C           ACALL     PLIST
     C                     PARM           FILE1            A-PICSﾎｦbﾓ
     C                     PARM           USER             ﾏｰﾅﾞｰ
     C                     PARM           PLR              LR ﾆﾍｭc
     C                     PARM           PCD              ﾆｬcﾒｭcﾃｰnﾞ
     C                     PARM           PTKRO            ﾆﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PUHZ             ﾏcﾃcﾍﾞ
     C                     PARM           PUBN                 ﾍﾞ]
     C                     PARM           PCM              ﾃcﾆ]obﾑc
     C*
     C                     MOVE '-'       H1
     C                     MOVE '-'       H2
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       U1
     C                     MOVE '-'       S1
      *
     C*****************************************************
     C* MO-NO0   fﾞx]-0    cibﾛﾃcﾆﾞｭc ﾆmb
     C*****************************************************
     C           @SCR0     TAG
     C                     EXFMTAAOPW010
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'                        f]ﾈbﾍ]
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'                        ﾌ]ﾈbﾍ]
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* ﾎﾞy] ﾆmb kｩｮh
     C*
     C           AAUKOJ    IFNE 0111
     C           AAUKOJ    ANDNE9999
     C                     SETON                     0199
     C                     MOVELER,08     MSG
     C                     GOTO @SCR0
     C                     END
      *
     C*****************************************************
     C* MO-NO2   fﾞx]-1
     C*****************************************************
     C           @SCR1     TAG
     C                     EXFMTAAOPW011
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'                        f]ﾈbﾍ]
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'                        ﾌ]ﾈbﾍ]
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO @SCR0
     C                     END
     C*
     C* ﾍ]ﾌﾞ]ﾆmb OR nﾃﾜﾌﾞ]kﾆmb ?
     C*
     C           NO        IFNE '1'
     C           NO        ANDNE'2'
     C                     SETON                     0199
     C                     MOVELER,01     MSG
     C                     GOTO @SCR1
     C                     END
     C*
     C* nﾃﾜﾌﾞ]kﾆmb
     C*
     C           NO        IFEQ '2'
     C                     MOVE *BLANK    ATKR
     C                     GOTO @SCR4
     C                     END
      *
     C*****************************************************
     C* MO-NO3   fﾞx]-2    ﾍ]ﾌﾞ]ﾆmb
     C*****************************************************
     C                     MOVE *BLANK    WHIN1
     C           @SCR2     TAG
     C                     EXFMTAAOPW012
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO @SCR1
     C                     END
     C*
     C           KEY0      KLIST
     C                     KFLD           WDTHE
     C                     KFLD           WKCD1
      *
     C           KEY1      KLIST
     C                     KFLD           WDTHE
     C                     KFLD           WKCD1
     C                     KFLD           AAUKOJ
     C                     KFLD           CHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
     C                     KFLD           WUKYY
     C                     KFLD           WUKMM
     C                     KFLD           WUKDD
     C                     KFLD           WUBIN
     C*
     C**JW1      AAUKOJ    IFEQ 9999
     C**         WHIN1     ANDNE*BLANK
     C**                   SETON                     0199
     C**                   MOVELER,9      MSG
     C**                   GOTO @SCR2
     C**                   END
     C*
     C* mﾞｰj qgjﾞﾆ
     C*
     C                     EXSR #SET1
     C           *IN99     IFEQ '1'
     C                     MOVELER,02     MSG
     C                     GOTO @SCR2
     C                     END
      *
     C*****************************************************
     C* MO-NO4   fﾞx]-3    ﾍ]ﾌﾞ]ﾆmb
     C*****************************************************
     C           @SCR3     TAG
     C                     EXFMTAAOPW013
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     Z-ADD0         ABNGO
     C                     MOVE *BLANK    WHIN1
     C                     GOTO @SCR2
     C                     END
     C*
     C* CMD-7 ﾃcmbobnﾃﾜﾌﾞ]kuﾇjｰ ﾃcﾆ]
     C*
     C           *INKG     IFEQ '1'
     C                     CALL 'AAJR11'
     C                     PARM           USER
     C                     GOTO @SCR3
     C                     END
     C*
     C* RULL-UP
     C*
     C           *IN91     IFEQ '1'
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,04     MSG
JW1  C                     MOVE '1'       MSG
     C                     END
     C                     GOTO @SCR3
     C                     END
     C*
     C* RULL-DOWN
     C*
     C           *IN92     IFEQ '1'
     C                     EXSR #RLDN
     C           *IN99     IFEQ '1'
     C                     MOVELER,05     MSG
     C                     END
     C                     GOTO @SCR3
     C                     END
     C*
     C* ENTER = ROLL-UP
     C*
     C           ABNGO     IFEQ 0
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,04     MSG
JW1  C                     MOVE '2'       MSG
     C                     END
     C                     GOTO @SCR3
     C                     ELSE
     C                     SETOF                     30
     C                     Z-ADD1         I       40
     C           ABNGO     LOKUPANO,I                    30
     C           *IN30     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,03     MSG
     C                     GOTO @SCR3
     C                     END
     C                     END
     C*
     C* ﾌ]ﾈb､ﾆｭcﾃcmb､zgbﾛf]ﾌﾞ]uﾇjｰ ﾌ evｮn
     C*
     C*          KCD,I     IFNE '0'
     C*          KCD,I     IFNE '6'
     C*          ACM,I     IFEQ '取消　'
     C*                    SETON                     99
     C*                    MOVELER,07     MSG
     C*                    GOTO @SCR3
     C*                    END
     C*                    END
     C*                    END
     C*
     C* ﾃcﾆ]ﾎﾟﾜhﾞ[w ﾑﾍﾞjﾞﾆ
     C*
     C                     Z-ADDABNGO     J       40
     C                     MOVE HRT,J     AHRT
     C                     MOVE *BLANK    PLR     2
     C                     MOVE *BLANK    PCD     1
     C                     MOVE ATKR      PTKRO   6
     C                     MOVE AUKHZ     PUHZ    8
     C                     MOVE AUKBN     PUBN    2
     C                     MOVE ACM,I     PCM     8
     C           AKCD1     IFEQ '6'                        ﾌ]ﾈbﾍ]
     C                     SETON                     U3
     C                     CALL 'AANR01'  ACALL
     C                     END
     C           AKCD1     IFEQ '0'                        f]ﾈbﾍ]
     C                     SETON                     U2
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           PCD       IFEQ '1'
     C                     EXSR #SET1
     C                     END
     C           *IN99     IFEQ '1'
     C                     MOVELER,02     MSG
     C                     GOTO @SCR2
     C                     END
     C*
     C* ﾃcﾆ]ﾇﾞv
     C*
     C                     Z-ADD0         ABNGO
     C                     GOTO @SCR3
      *
     C*****************************************************
     C* MO-NO5   fﾞx]-4    nﾃﾜﾌﾞ]kﾆmb
     C*****************************************************
     C           @SCR4     TAG
     C                     EXFMTAAOPW014
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO @SCR1
     C                     END
     C*
     C* nﾃﾜﾌﾞ]k
     C*
     C           ATKR      IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,06     MSG
     C                     GOTO @SCR4
     C                     END
     C*
     C           KEY2      KLIST
     C                     KFLD           ATKR1
     C                     KFLD           ATKR2
     C                     KFLD           ATKR3
     C                     KFLD           ATKR4
     C                     KFLD           VUKYY
     C                     KFLD           VUKMM
     C                     KFLD           VUKDD
     C                     KFLD           VUBIN
     C*
     C* mﾞｰj qgjﾞﾆ
     C*
     C                     EXSR #SET2
     C           *IN99     IFEQ '1'
     C**                   MOVELER,04     MSG
JW1  C                     MOVELER,02     MSG
     C                     GOTO @SCR4
     C                     END
      *
     C*****************************************************
     C* MO-NO6   fﾞx]-5    nﾃﾜﾌﾞ]kﾆmb
     C*****************************************************
     C           @SCR5     TAG
     C                     EXFMTAAOPW015
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU2     IFEQ '1'
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           *INU3     IFEQ '1'
     C                     CALL 'AANR01'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    ABNGO
     C                     MOVE *BLANK    ATKR
     C                     GOTO @SCR4
     C                     END
     C*
     C* CMD-7 ﾃcmbobnﾃﾜﾌﾞ]kuﾇjｰ ﾃcﾆ]
     C*
     C           *INKG     IFEQ '1'
     C                     CALL 'AAJR11'
     C                     PARM           USER
     C                     GOTO @SCR5
     C                     END
     C*
     C* ROLL-UP
     C*
     C           *IN91     IFEQ '1'
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,04     MSG
JW1  C                     MOVE '4'       MSG
     C                     END
     C                     GOTO @SCR5
     C                     END
     C*
     C* ROLL-DOWN
     C*
     C           *IN92     IFEQ '1'
     C                     EXSR #RLDN
     C           *IN99     IFEQ '1'
     C                     MOVELER,05     MSG
     C                     END
     C                     GOTO @SCR5
     C                     END
     C*
     C* ENTER = ROLL-UP
     C*
     C           ABNGO     IFEQ 0
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C**                   MOVELER,04     MSG
JW1  C                     MOVELER,02     MSG
     C                     END
     C                     GOTO @SCR5
     C                     ELSE
     C                     SETOF                     30
     C                     Z-ADD1         I
     C           ABNGO     LOKUPANO,I                    30
     C           *IN30     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,03     MSG
     C                     GOTO @SCR5
     C                     END
     C                     END
     C*
     C* ﾌ]ﾈb､ﾆｭcﾃcmb､zgbﾛf]ﾌﾞ]uﾇjｰ ﾌ evｮn
     C*
     C*          KCD,I     IFNE '0'
     C*          KCD,I     IFNE '6'
     C*          ACM,I     IFEQ '取消　'
     C*                    SETON                     99
     C*                    MOVELER,07     MSG
     C*                    GOTO @SCR5
     C*                    END
     C*                    END
     C*                    END
      *
     C*****************************************************
     C* MO-NO7   ﾃcﾆ]ﾎﾟﾜhﾞ[w ﾑﾍﾞjﾞﾆ
     C*****************************************************
     C                     Z-ADDABNGO     J
     C                     MOVE HRT,J     XHRT
     C                     MOVE *BLANK    PLR
     C                     MOVE *BLANK    PCD
     C                     MOVE XTKR      PTKRO
     C                     MOVE XUKHZ     PUHZ
     C                     MOVE XUKBN     PUBN
     C                     MOVE ACM,I     PCM
     C           XKCD1     IFEQ '6'                        ﾌ]ﾈbﾍ]
     C                     SETON                     U3
     C                     CALL 'AANR01'  ACALL
     C                     END
     C           XKCD1     IFEQ '0'                        f]ﾈbﾍ]
     C                     SETON                     U2
     C                     CALL 'AAPR01'  ACALL
     C                     END
     C           PCD       IFEQ '1'
     C                     EXSR #SET2
     C                     END
     C*
     C* ﾃcﾆ]ﾇﾞv
     C*
     C                     Z-ADD0         ABNGO
     C                     GOTO @SCR5
      *
     C*****************************************************
     C* MO-NO8   mﾞｰjqgjﾞﾆ <ﾍ]ﾌﾞ]ﾆﾞｬ]>
     C*****************************************************
     C           #SET1     BEGSR
     C*
     C* mﾞｰji]ﾇc MAX=1500 p ﾆmb
     C*
     C                     Z-ADD0         A       40
     C                     Z-ADD1         E       40
     C                     MOVE *BLANK    HRT
     C           1         DO   1500      E
     C                     MOVEL''       HRT,E
     C                     END
     C                     MOVE *BLANK    WDTHE   1
     C                     MOVE *BLANK    CHIN1   5
     C                     MOVE *BLANK    WHIN2   5
     C                     MOVE *BLANK    WHIN3   2
     C                     MOVE *BLANK    WTKR1   1
     C                     MOVE *BLANK    WTKR2   2
     C                     MOVE *BLANK    WTKR3   2
     C                     MOVE *BLANK    WTKR4   1
     C                     Z-ADD0         WUKYY   40
     C                     Z-ADD0         WUKMM   20
     C                     Z-ADD0         WUKDD   20
     C                     Z-ADD0         WUBIN   20
     C                     Z-ADD0         WNO
     C*
     C* f]ﾈbﾍ]f]ﾌﾞ]uﾇjｰ
     C*
     C                     MOVE '0'       WKCD1   1
     C           AAUKOJ    IFEQ 9999
     C           KEY0      SETLLAAPTL021
     C                     ELSE
     C           KEY1      SETLLAAPTL021
     C                     END
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AAPTL021                 30
     C   30                GOTO @001
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    CABLE*DATE     @002
     C                     END
     C           L5DTHE    COMP *BLANK                   30
     C  N30                GOTO @001
     C           AAUKOJ    IFNE 9999
     C           L5UKOJ    CABNEAAUKOJ    @002
     C                     END
     C           L5SHN1    CABLTWHIN1     @002
     C                     ADD  1         A
     C                     MOVE L5SHIN    AHIN
     C                     Z-ADDL5UKHZ    AUKHZ
     C                     Z-ADDL5UBIN    AUKBN
     C                     MOVE L5DTKO    ADTHE
     C                     MOVE L5TKRO    ATKR
     C                     MOVE L5KCD1    AKCD1
     C                     Z-ADDL5STHZ    ASTHZ
     C                     Z-ADDL5SBIN    ASTBN
     C                     MOVE AHRT      HRT,A
     C           @002      TAG
     C                     END
     C           @001      TAG
     C*
     C* ﾌ]ﾈbﾍ]f]ﾌﾞ]uﾇjｰ
     C*
     C                     MOVE '6'       WKCD1
     C           AAUKOJ    IFEQ 9999
     C           KEY0      SETLLAANTL021
     C                     ELSE
     C           KEY1      SETLLAANTL021
     C                     END
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AANTL021                 30
     C   30                GOTO @A00
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    CABLE*DATE     @B00
     C                     END
     C           L7DTHE    COMP *BLANK                   30
     C  N30                GOTO @A00
     C           AAUKOJ    IFNE 9999
     C           L7UKOJ    CABNEAAUKOJ    @B00
     C                     END
     C           L7SHN1    CABLTWHIN1     @B00
     C                     ADD  1         A
     C                     MOVE L7SHIN    AHIN
     C                     Z-ADDL7UKHZ    AUKHZ
     C                     Z-ADDL7UBIN    AUKBN
     C                     MOVE L7DTKO    ADTHE
     C                     MOVE L7TKRO    ATKR
     C                     MOVE L7KCD1    AKCD1
     C                     Z-ADDL7STHZ    ASTHZ
     C                     Z-ADDL7SBIN    ASTBN
     C                     MOVE AHRT      HRT,A
     C           @B00      TAG
     C                     END
     C           @A00      TAG
     C                     Z-ADDA         WNO     40
     C*
     C* mﾞｰj oﾆ
     C*
     C           A         CABEQ0         @00A           99
     C*
     C* SORT
     C*
     C                     SORTAHRT
     C                     Z-ADD0         B       40
     C                     EXSR #SUB1                      mﾞｰjﾈｮn
     C           @00A      ENDSR
      *
     C*****************************************************
     C* MO-NO9   mﾞｰjqgjﾞﾆ <nﾃﾜﾌﾞ]kﾆﾞｬ]>
     C*****************************************************
     C           #SET2     BEGSR
     C*
     C* mﾞｰji]ﾇc MAX=1500 p ﾆmb
     C*
     C                     Z-ADD0         A
     C                     Z-ADD1         E
     C                     MOVE *BLANK    HRT
     C           1         DO   1500      E
     C                     MOVEL''       HRT,E
     C                     END
     C                     Z-ADD0         VUKYY   40
     C                     Z-ADD0         VUKMM   20
     C                     Z-ADD0         VUKDD   20
     C                     Z-ADD0         VUBIN   20
     C                     Z-ADD0         WNO
     C*
     C* f]ﾈbﾍ]f]ﾌﾞ]uﾇjｰ
     C*
     C           KEY2      SETLLAAPPL031
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AAPPL031                 30
     C   30                GOTO @007
     C           ATKR      CABNEL5TKRO    @007
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    CABLE*DATE     @008
     C                     END
     C                     ADD  1         A
     C                     MOVE L5SHIN    XHIN
     C                     Z-ADDL5UKHZ    XUKHZ
     C                     Z-ADDL5UBIN    XUKBN
     C                     MOVE L5TKRO    XTKR
     C                     MOVE L5DTKO    XDTHE
     C                     MOVE L5KCD1    XKCD1
     C                     Z-ADDL5STHZ    XSTHZ
     C                     Z-ADDL5SBIN    XSTBN
     C                     MOVE XHRT      HRT,A
     C           @008      TAG
     C                     END
     C           @007      TAG
     C*
     C* ﾌ]ﾈbﾍ]f]ﾌﾞ]uﾇjｰ
     C*
     C           KEY2      SETLLAANPL031
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AANPL031                 30
     C   30                GOTO @C00
     C           ATKR      CABNEL7TKRO    @C00
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    CABLE*DATE     @D00
     C                     END
     C                     ADD  1         A
     C                     MOVE L7SHIN    XHIN
     C                     Z-ADDL7UKHZ    XUKHZ
     C                     Z-ADDL7UBIN    XUKBN
     C                     MOVE L7TKRO    XTKR
     C                     MOVE L7DTKO    XDTHE
     C                     MOVE L7KCD1    XKCD1
     C                     Z-ADDL7STHZ    XSTHZ
     C                     Z-ADDL7SBIN    XSTBN
     C                     MOVE XHRT      HRT,A
     C           @D00      TAG
     C                     END
     C           @C00      TAG
     C                     Z-ADDA         WNO
     C*
     C* mﾞｰj oﾆ
     C*
     C           A         CABEQ0         @00B           99
     C*
     C* SORT
     C*
     C                     SORTAHRT
     C                     Z-ADD0         B
     C                     EXSR #SUB1                      mﾞｰjﾈｮn
     C           @00B      ENDSR
      *
     C*****************************************************
     C* MO-NO10  mﾞｰjﾈｮn
     C*****************************************************
     C           #SUB1     BEGSR
     C                     Z-ADD1         C       10
     C*
     C                     Z-ADD0         ANO              SEQ-NO
     C                     MOVE *BLANK    ACM              ﾃx]n
     C                     MOVE *BLANK    ADI              ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    APL              nﾃﾜﾌﾞ]k
     C                     MOVE *BLANK    AKT              f]ﾌﾞ]ﾆｬﾓb
     C                     MOVE *BLANK    AFR              ﾏcﾃcﾍﾞ､ﾍﾞ]
     C                     MOVE *BLANK    ATO              ﾆｮﾃcﾍﾞ､ﾍﾞ]
     C                     MOVE *BLANK    KEY              KEY､jbﾍ
     C                     MOVE *BLANK    KCD              KEYf]ﾌﾞ]ﾆｬﾓb
     C                     Z-ADD0         ABNGO
     C*
     C           1         DO   7         C
     C                     ADD  1         B
     C           B         CABGTWNO       @012
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C                     MOVE HRT,B     AHRT
     C                     Z-ADDB         ANO,C
     C                     SETOF                     30
     C                     Z-ADD1         D       20
     C           ADTHE     LOKUPCMT1,D                   30
     C   30                MOVE CMT2,D    ACM,C
     C                     MOVE AHIN1     BHIN1
     C                     MOVE AHIN2     BHIN2
     C                     MOVE AHIN3     BHIN3
     C                     MOVE DSDI      ADI,C
     C                     MOVE ATKR1     BTKR1
     C                     MOVE ATKR2     BTKR2
     C                     MOVE ATKR3     BTKR3
     C                     MOVE ATKR4     BTKR4
     C                     MOVE DSPL      APL,C
     C                     MOVE AKCD1     KCD,C
     C                     SETOF                     30
     C                     Z-ADD1         D
     C           AKCD1     LOKUPCMT3,D                   30
     C   30                MOVE CMT4,D    AKT,C
     C                     Z-ADDAUKHZ     BUKHZ
     C                     Z-ADDAUKBN     BUKBN
     C                     MOVE DSFR      AFR,C
     C                     Z-ADDASTHZ     BSTHZ
     C                     Z-ADDASTBN     BSTBN
     C                     MOVE DSTO      ATO,C
     C                     MOVE ATKR1     CTKR
     C                     Z-ADDAUKHZ     CUKHZ
     C                     Z-ADDAUKBN     CUBIN
     C                     MOVE CKEY      KEY,C
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C                     MOVE HRT,B     XHRT
     C                     Z-ADDB         ANO,C
     C                     SETOF                     30
     C                     Z-ADD1         D
     C           XDTHE     LOKUPCMT1,D                   30
     C   30                MOVE CMT2,D    ACM,C
     C                     MOVE XHIN1     BHIN1
     C                     MOVE XHIN2     BHIN2
     C                     MOVE XHIN3     BHIN3
     C                     MOVE DSDI      ADI,C
     C                     MOVE XKCD1     KCD,C
     C                     SETOF                     30
     C                     Z-ADD1         D
     C           XKCD1     LOKUPCMT3,D                   30
     C   30                MOVE CMT4,D    AKT,C
     C                     Z-ADDXUKHZ     BUKHZ
     C                     Z-ADDXUKBN     BUKBN
     C                     MOVE DSFR      AFR,C
     C                     Z-ADDXSTHZ     BSTHZ
     C                     Z-ADDXSTBN     BSTBN
     C                     MOVE DSTO      ATO,C
     C                     MOVE XTKR1     CTKR
     C                     Z-ADDXUKHZ     CUKHZ
     C                     Z-ADDXUKBN     CUBIN
     C                     MOVE CKEY      KEY,C
     C*
     C           C         CABEQ6         @012
     C                     END
     C                     END
     C           @012      TAG
     C                     ENDSR
      *
     C*****************************************************
     C* MO-NO11  ROLL-UP
     C*****************************************************
     C           #RLUP     BEGSR
     C                     Z-ADD0         ABNGO
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C           KEY,7     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,7     XXNO    40
     C                     ADD  1         XXNO
     C           XXNO      IFGT WNO
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,7     B
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C           KEY,6     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,6     XXNO
     C                     ADD  1         XXNO
     C           XXNO      IFGT WNO
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,6     B
     C                     END
     C                     EXSR #SUB1
     C           @013      ENDSR
      *
     C*****************************************************
     C* MO-NO12  ROLL-DOWN
     C*****************************************************
     C           #RLDN     BEGSR
     C                     Z-ADD0         ABNGO
     C           ANO,1     IFEQ 1
     C                     SETON                     99
     C                     GOTO @014
     C                     END
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C                     Z-ADDANO,1     XXNO
     C                     SUB  8         XXNO
     C                     Z-ADDXXNO      B
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C                     Z-ADDANO,1     XXNO
     C                     SUB  7         XXNO
     C                     Z-ADDXXNO      B
     C                     END
     C                     EXSR #SUB1
     C           @014      ENDSR
** ER(60A) ........2.........3.........4.........5.........6
E-01 ENTER 1 OR 2
E-02 DATA NOT FOUND
E-03 ENTER SEQ# DISPLAYED IN THE CURRENT SCREEN
E-04 REACHED TO THE BOTTOM
E-05 REACHED TO THE TOP
E-06 ENTER LOCATION
E-07 SPECIFIED DATA WAS ALREADY DELETED
E-08 ENTER 0111 OR 9999
E-09 DEPARTMENT 9999: PART# IS NOT ALLOWED
E-10
**  CMT1/CMT2 (ﾃx]n NAME)
0CANCEL                                                    1
1UPDATED                                                   2
2ADD                                                       3
3SET.NO
4K-TYPE                                                    5
5CUTOFF/D                                                  6
6EFFECT/D                                                  7
7OBSOLE/D                                                  8
8K-INCR.                                                   9
9K-DECR.                                                  10
ALOCATION                                                 11
BMASS M/N                                                 12
CREISSUE                                                  13
DK-ADD                                                    14
EK-UPDATE                                                 15
**  CMT3/CMT4 (f]ﾌﾞ]ﾆｬﾓb)
0FNSHD GOODS                                               1
1PIECE WORK                                                2
2P/W QUENCH.                                               3
6HALF-FINISH
7H/T PLATING
3COMPONENT
