     H            Y.
     F*** AAOR04 **********************************
     F* CALCULATION  OF PURCHASE KANBAN PUBLICATION NUMBER OF SHEETS *
     F*         H.ITO         1990.12.18          *
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.09|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F****************************************************** AAOR04 ***
     C           *ENTRY    PLIST
     C                     PARM           PARM1   5        f]ﾌﾞ](ALL)
     C                     PARM           PARM2   5        f]ﾌﾞ](MIN)
     C                     PARM           PARM3   5        f]ﾌﾞ](MAX)
     C                     PARM           PARM4   5        f]ﾌﾞ](ﾆｭﾒ)
     C                     PARM           PARM5   1        ﾌｮﾃchﾎﾞ]
     C                     PARM           PARM6   5        ﾌｮﾃcNOﾆｭgk
     C                     PARM           PARM7   5        ﾌｮﾃcubﾇc
     C                     PARM           PARM8   5        b]ﾆﾞubﾇc
     C                     MOVE PARM1     A       50
     C                     MOVE PARM2     B       50
     C                     MOVE PARM3     C       50
     C                     MOVE PARM4     D       50
     C                     Z-ADD0         @DFLT   50
     C                     Z-ADD0         @MAIS   50
     C                     Z-ADD0         @INZI   50
     C                     Z-ADD0         WMAIS   50
     C                     Z-ADD0         XMAIS   50
     C*
     C* ﾌｮﾃcubﾇc = 0
     C*
     C           B         IFEQ C
     C                     GOTO @STOP
     C                     ELSE
     C*
     C* ALLﾅhﾈb
     C*
     C           A         IFEQ 0
     C           B         ANDEQ0
     C                     MOVE '1'       PARM5
     C                     Z-ADD1         @DFLT
     C                     MOVE @DFLT     PARM6
     C           @DFLT     SUB  1         WMAIS
     C           C         SUB  WMAIS     @MAIS
     C                     MOVE @MAIS     PARM7
     C           D         IFNE 0
     C                     Z-ADDD         @INZI
     C                     MOVE @INZI     PARM8
     C                     END
     C                     GOTO @RETRN
     C                     END
     C*
     C* jof[ﾌｮﾃc + ﾎﾟ[ﾇﾎﾞ]ﾅhﾈb
     C*
     C           A         IFGT B
     C           A         ANDLTC
     C                     MOVE '5'       PARM5
     C           A         ADD  1         @DFLT
     C                     MOVE @DFLT     PARM6
     C           @DFLT     SUB  1         WMAIS
     C           C         SUB  WMAIS     @MAIS
     C                     MOVE @MAIS     PARM7
     C           A         SUB  B         @INZI
     C                     MOVE @INZI     PARM8
     C                     GOTO @RETRN
     C                     END
     C*
     C* ﾎﾟ[ﾇﾎﾞ]ﾅhﾈb
     C*
     C           A         IFEQ B
     C           B         ANDLTC
     C                     MOVE '2'       PARM5
     C           B         ADD  1         @DFLT
     C                     MOVE @DFLT     PARM6
     C           @DFLT     SUB  1         WMAIS
     C           C         SUB  WMAIS     @MAIS
     C                     MOVE @MAIS     PARM7
     C                     MOVE @INZI     PARM8
     C                     GOTO @RETRN
     C                     END
     C*
     C* kｭcﾈbkｬc
     C*
     C           A         IFGE B
     C           B         ANDGTC
     C                     MOVE '3'       PARM5
     C                     Z-ADD1         @DFLT
     C                     MOVE @DFLT     PARM6
     C           B         SUB  C         XMAIS
     C           @DFLT     SUB  1         WMAIS
     C           XMAIS     SUB  WMAIS     @MAIS
     C                     MOVE @MAIS     PARM7
     C                     MOVE @INZI     PARM8
     C                     GOTO @RETRN
     C                     END
     C*
     C* jof[ﾌｮﾃc
     C*
     C           A         IFGT B
     C           B         ANDLTC
     C           A         ANDGEC
     C                     MOVE '4'       PARM5
     C                     Z-ADD1         @DFLT
     C                     MOVE @DFLT     PARM6
     C                     Z-ADD1         @MAIS
     C                     MOVE @MAIS     PARM7
     C           C         SUB  B         @INZI
     C                     MOVE @INZI     PARM8
     C                     END
     C*
     C           @RETRN    TAG
     C                     END
     C           @STOP     TAG
     C                     RETRN
