     H            Y.
     F** AAUR13 ********************
     F* .. PUBLICATION OF PLAN NOTICE   *.
     F*        K.YASUDA 93.11.15 *
     F******************** AAUR13 **
     FAAUWP13 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F      80     OF     PRINTER
     E                    BS1     1   1  2 0 BS2    12   ﾎﾞﾆｭ
     E                    MD      1   1 48               vjﾞﾆ
     IAAUWP13 AA  01
     I                                        1   20BSYO  L4
     I                                        3   7 HIN1  L3
     I                                        8  12 HIN2  L3
     I                                       13  14 HIN3  L3
     I                                       15  180TOKU  L2
     I                                       19  220NONY  L1
     I                                       23  23 NKOJ
     I                                       24  27 NUKE
     I                                       28  32 MHN1
     I                                       33  37 MHN2
     I                                       38  42 MHN3
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  14 HINB
     I                                        1   5 HN1
     I                                        6   6 HF1
     I                                        7  11 HN2
     I                                       12  12 HF2
     I                                       13  14 HN3
     I            DS
     I                                        1  17 MHNB
     I                                        1   5 MN1
     I                                        6   6 MF1
     I                                        7  11 MN2
     I                                       12  12 MF2
     I                                       13  17 MN3
      *
     C           *INL4     IFEQ '1'
     C                     SETOF                     10
     C                     Z-ADD1         I       20
     C                     MOVE *BLANK    BSME   12
     C           BSYO      LOKUPBS1,I                    10
     C           *IN10     IFEQ '1'
     C                     MOVELBS2,I     BSME
     C                     END
     C                     END
      *
     C           *INL3     IFEQ '1'
     C                     MOVE HIN1      HN1
     C                     MOVE HIN2      HN2
     C                     MOVE HIN3      HN3
     C                     MOVE '-'       HF1
     C                     MOVE '-'       HF2
     C                     END
      *
     C           *INL2     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    TOKME  16
     C           TOKU      CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    TOKME
     C                     END
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    NNYME  16
     C           NONY      CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    NNYME
     C                     END
     C                     END
      *
     C                     MOVE MHN1      MN1
     C                     MOVE MHN2      MN2
     C                     MOVE MHN3      MN3
     C                     MOVE '-'       MF1
     C                     MOVE '-'       MF2
      *
     OQPRINT  H  302   L3
     O       OR        OFNL3
     O                         BSME      16
     O        H  2     L3
     O       OR        OFNL3
     O                         UDATE Y   18
     O        H  3     L3
     O       OR        OFNL3
     O                         MD,1      53
     O        H  3     L3
     O       OR        OFNL3
     O                                   11 'PART NO'
     O                         HINB      26
     O        H  2     L3
     O       OR        OFNL3
     O                                   13 'CUSTOMER'
     O                                   40 'RECEIVING CO.'
     O                                   53 'FACTORY'
     O                                   57 'RCV'
     O                                   71 'USER PART NO'
     O        D  1     01
     O                         TOKU      11
     O                         TOKME     27
     O                         NONY      32
     O                         NNYME     48
     O                         NKOJ      51
     O                         NUKE      57
     O                         MHNB      75
      *
**  BS1/BS2
01SALES SECT
**  MD
CONFIRM COMMON INPUT P/N BY TOTAL ABOLITION
