     H            Y.
     F** AAVR39 ********************************
     F* RESIN KANBAN M/F KEY CHANGE *.
     F* I-HASADA                  94.08.19     *
     F******************************** AAVR39 **
     FAAMPL11 IF  E           K        DISK
     FAECPL03 UF  E           K        DISK                      A
     FAAJPL11 UF  E           K        DISK
     E                    KKO        15  3               新工程
     E                    KBM        15  4 0             新部門
     E                    KBN        15  6               新所番地
     E                    CKO        15  3               工程WORK
     E                    CBM        15  4 0             部門WORK
     E                    CBN        15  6               所番地WORK
     E                    @KT         7  3               工程WORK
     E                    @BM         7  4 0             部門WORK
     E                    HKT         7  3               工程
     E                    HBM         7  4 0             部門
     E                    TB1     1   1  4 0 TB2     4 0 受入工場
     E                    TB3     1   1  4 0 TB4     4   受入
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 KBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  100PPYOU2
     I                                        1   80PPYYMD
     I                                        1   40PPYO2Y
     I                                        5   60PPYO2M
     I                                        7   80PPYO2D
     I                                        9  100PPBIN2
     I            DS
     I                                        1   6 XXBAN
     I                                        1   1 XXBAN1
     I                                        2   3 XXBAN2
     I                                        4   5 XXBAN3
     I                                        6   6 XXBAN4
     I            DS
     I                                        1   6 AFMTK
     I                                        1   1 AFMTK1
     I                                        2   3 AFMTK2
     I                                        4   5 AFMTK3
     I                                        6   6 AFMTK4
     I            DS
     I                                        1   6 AFATKR
     I                                        1   1 AFATK1
     I                                        2   3 AFATK2
     I                                        4   5 AFATK3
     I                                        6   6 AFATK4
     I            DS
     I                                        1  12 AFSHIN
     I                                        1   5 AFSHN1
     I                                        6  10 AFSHN2
     I                                       11  12 AFSHN3
     I            DS
     I                                        1   6 POTKR
     I                                        1   1 PPBN11
     I                                        2   3 PPBN12
     I                                        4   5 PPBN13
     I                                        6   6 PPBN14
     I            DS
     I                                        1   6 PNTKR
     I                                        1   1 PPBN21
     I                                        2   3 PPBN22
     I                                        4   5 PPBN23
     I                                        6   6 PPBN24
     I            DS
     I                                        1   80AFSKHZ
     I                                        1   40AFSKYY
     I                                        5   60AFSKMM
     I                                        7   80AFSKDD
     I            DS
     I                                        1   80AFKOHZ
     I                                        1   40AFKOYY
     I                                        5   60AFKOMM
     I                                        7   80AFKODD
     I            DS
     I                                        1   60AFTIME
     I                                        1   20AFKOHH
     I                                        3   40AFKOSS
     I            DS
     I                                        1  100AFUKBI
     I                                        1   40AFUKYY
     I                                        5   60AFUKMM
     I                                        7   80AFUKDD
     I                                        9  100AFUBIN
     I            DS
     I                                        1  100AFTKBI
     I                                        1   40AFTKYY
     I                                        5   60AFTKMM
     I                                        7   80AFTKDD
     I                                        9  100AFTBIN
     I            DS
     I                                        1  100AFSTBI
     I                                        1   40AFSTYY
     I                                        5   60AFSTMM
     I                                        7   80AFSTDD
     I                                        9  100AFSBIN
     I            DS
     I                                        1  12 PPHIN
     I                                        1   5 PPHN1
     I                                        6  10 PPHN2
     I                                       11  12 PPHN3
     I            DS
     I                                        1  21 HKT
     I                                        1   3 AFKT01
     I                                        4   6 AFKT02
     I                                        7   9 AFKT03
     I                                       10  12 AFKT04
     I                                       13  15 AFKT05
     I                                       16  18 AFKT06
     I                                       19  21 AFKT07
     I            DS
     I                                        1  280HBM
     I                                        1   40AFBM01
     I                                        5   80AFBM02
     I                                        9  120AFBM03
     I                                       13  160AFBM04
     I                                       17  200AFBM05
     I                                       21  240AFBM06
     I                                       25  280AFBM07
     I            DS
     I                                        1  100WOUKBI
     I                                        1   40WOUKYY
     I                                        5   60WOUKMM
     I                                        7   80WOUKDD
     I                                        9  100WOUBIN
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1   80AFMEHZ
     I                                        1   40AFMEYY
     I                                        5   60AFMEMM
     I                                        7   80AFMEDD
     I            DS
     I                                        1   40AFMTIM
     I                                        1   20AFMEHH
     I                                        3   40AFMESS
      *
     C           FLKEY     KLIST
     C                     KFLD           PPBN11           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN12           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN13           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN14           s]ﾃc ud ﾌﾞ]k 4
      *
     C           FLKEY3    KLIST
     C                     KFLD           PPBN11
     C                     KFLD           PPBN12
     C                     KFLD           PPBN13
     C                     KFLD           PPBN14
     C                     KFLD           WOUKYY
     C                     KFLD           WOUKMM
     C                     KFLD           WOUKDD
     C                     KFLD           WOUBIN
      *
     C           FPKEY3    KLIST
     C                     KFLD           PPBN21
     C                     KFLD           PPBN22
     C                     KFLD           PPBN23
     C                     KFLD           PPBN24
     C                     KFLD           PPYO2Y
     C                     KFLD           PPYO2M
     C                     KFLD           PPYO2D
     C                     KFLD           PPBIN2
      *
     C           AMKEY     KLIST
     C                     KFLD           PPHIN1
     C                     KFLD           PPHIN2
     C                     KFLD           PPHIN3
      *
     C           VLKEY     KLIST
     C                     KFLD           PPBN21           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN22           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN23           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN24           s]ﾃc ud ﾌﾞ]k 4
      *
     C           YLKEY     KLIST
     C                     KFLD           AFATK1
     C                     KFLD           AFATK2
     C                     KFLD           AFATK3
     C                     KFLD           AFATK4
      *
     C           *ENTRY    PLIST
     C                     PARM           PPOKCD  1        s]ﾃcud f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN11  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN12  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN13  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN14  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PPNKCD  1        s]ﾃcﾃﾞ f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN21  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN22  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN23  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN24  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PAYO2Y  4        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     PARM           PAYO2M  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     PARM           PAYO2D  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     PARM           PABIN2  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     PARM           POHIN  12        s]ﾃcud ﾍ]ﾌﾞ]
     C                     PARM           PPHIN1  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 1
     C                     PARM           PPHIN2  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 2
     C                     PARM           PPHIN3  2        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 3
     C                     PARM           PASETT  9        ﾈｮmb ﾇc
     C                     PARM           PPKUB   2        ﾃcﾆ] hﾎﾞ]
     C                     PARM           PZKMS   3        ud ﾉ f]ﾌﾞ] ubﾇc
     C                     PARM           PPUSEC 10        ﾏｰﾅﾞｰxb
     C                     PARM           PTKBI  10        ud ﾉ ﾆｬｮﾃcﾍﾞ
     C                     PARM           PKSHIN 12        ﾆｫobﾍ]ﾌﾞ]
      *
     C                     MOVE PMBN11    PPBN11
     C                     MOVE PMBN12    PPBN12
     C                     MOVE PMBN13    PPBN13
     C                     MOVE PMBN14    PPBN14
     C                     MOVE PMBN21    PPBN21
     C                     MOVE PMBN22    PPBN22
     C                     MOVE PMBN23    PPBN23
     C                     MOVE PMBN24    PPBN24
     C                     MOVE PAYO2Y    PPYO2Y
     C                     MOVE PAYO2M    PPYO2M
     C                     MOVE PAYO2D    PPYO2D
     C                     MOVE PABIN2    PPBIN2
     C                     MOVE PPBN21    XXBAN1           s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     MOVE PPBN22    XXBAN2
     C                     MOVE PPBN23    XXBAN3
     C                     MOVE PPBN24    XXBAN4
     C                     MOVE PPHIN1    PPHN1
     C                     MOVE PPHIN2    PPHN2
     C                     MOVE PPHIN3    PPHN3
     C                     MOVE PASETT    PPSETT  90
      *
     C                     Z-ADD0         AFSKHZ
     C                     EXSR SBHZ
      *
      *
     C           PPYYMD    IFEQ 0
     C           PPKUB     IFNE '02'
     C           PPKUB     ANDNE'13'
     C                     Z-ADD#UKBI     PPYOU2
     C                     END
     C                     END
      *
     C           PPYYMD    IFEQ 0
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *
     C           PPKUB     IFEQ '04'
     C           PPKUB     OREQ '09'
     C                     EXSR SUBRTN
     C                     END
      *
      *
     C           PPKUB     IFEQ '10'
     C           #UKBI     IFNE 0
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '03'      PPKUB
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '02'
     C           PPKUB     OREQ '13'
      *
     C           #UKBI     IFNE 0
     C           PPYOU2    IFLT #UKBI
     C                     SETON                     LR
     C                     RETRN
     C                     ELSE
      *
     C           #STBI     IFEQ 9999999999
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '07'      PPKUB
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '03'
     C           PPKUB     OREQ '04'
     C           PPKUB     OREQ '11'
     C           PPKUB     OREQ '12'
      *
     C           #STBI     IFNE 0
     C           #STBI     ANDNE9999999999
     C           PPYOU2    IFLT #STBI
     C                     Z-ADD#STBI     PPYOU2
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     CASEQ'01'      ##1
     C           PPKUB     CASEQ'02'      ##2
     C           PPKUB     CASEQ'03'      ##3
     C           PPKUB     CASEQ'04'      ##3
     C           PPKUB     CASEQ'05'      ##5
     C           PPKUB     CASEQ'06'      ##5
     C           PPKUB     CASEQ'07'      ##7
     C           PPKUB     CASEQ'08'      ##8
     C           PPKUB     CASEQ'09'      ##5
     C           PPKUB     CASEQ'10'      ##10
     C           PPKUB     CASEQ'11'      ##3
     C           PPKUB     CASEQ'12'      ##3
     C           PPKUB     CASEQ'13'      ##2
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*---------------------------------------------------------------*
     C* 01 nﾒiﾆ                                                       *
     C*---------------------------------------------------------------*
     C           ##1       BEGSR
      *
     C* ofﾞﾛf]ﾌﾞ] uﾇjｰ ﾃcﾆ]
     C           FLKEY     SETLLAECPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     READEAECPL031                 10ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    CABLE*DATE     STP01
     C                     END
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE '0'       AFDTKO           mﾞｰj ﾃcﾆ]方法
     C           AFSTHZ    IFNE 99999999
     C                     MOVE '*'       AFDTHE
     C                     ELSE
     C                     MOVE *BLANK    AFDTHE
     C                     Z-ADDPPYO2Y    AFSTYY
     C                     Z-ADDPPYO2M    AFSTMM
     C                     Z-ADDPPYO2D    AFSTDD
     C                     Z-ADDPPBIN2    AFSBIN
     C                     END
     C                     UPDATAECPL031
     C                     END
     C           STP01     TAG
     C  N10                END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ ﾃcﾆ]
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C           PPYYMD    IFGT *DATE
     C                     Z-ADDPPYYMD    CJAKHZ
     C                     ELSE
     C                     Z-ADD*DATE     CJAKHZ
     C                     END
     C                     MOVE *BLANK    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE *BLANK    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE *BLANK    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE *BLANK    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE *BLANK    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE *BLANK    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE *BLANK    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C                     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 02  lbf                                                       *
     C* 13  f]ﾌﾞ]ﾆｬﾓb s]ﾃc lbf                                        *
     C*---------------------------------------------------------------*
     C           ##2       BEGSR
      *
     C           PNTKR     IFEQ *BLANK
     C                     GOTO ##2P1
     C                     END
      *
     C                     SETOF                     30
     C           FPKEY3    CHAINAECPL031             30
     C           *IN30     IFEQ '0'
     C           AFSKJY    ANDEQ'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##2P2
     C                     END
     C           *IN30     IFEQ '0'
     C           AFSTHZ    ANDEQ99999999
     C                     GOTO ##2P1
     C                     END
     C           ##2P2     TAG
      *
     C                     MOVE *BLANK    AFSKJY
     C                     Z-ADD0         AFSKHZ
     C                     Z-ADD0         AFKOHZ
     C                     Z-ADD0         AFTIME
     C                     MOVE *BLANK    AFKOME
     C                     MOVE *BLANK    AFSHN1
     C                     MOVE *BLANK    AFSHN2
     C                     MOVE *BLANK    AFSHN3
     C                     Z-ADD0         AFUKYY
     C                     Z-ADD0         AFUKMM
     C                     Z-ADD0         AFUKDD
     C                     Z-ADD0         AFUBIN
     C                     Z-ADD0         AFSTYY
     C                     Z-ADD0         AFSTMM
     C                     Z-ADD0         AFSTDD
     C                     Z-ADD0         AFSBIN
     C                     MOVE *BLANK    AFATOK
     C                     Z-ADD0         AFATOB
     C                     MOVE *BLANK    AFATK1
     C                     MOVE *BLANK    AFATK2
     C                     MOVE *BLANK    AFATK3
     C                     MOVE *BLANK    AFATK4
     C                     MOVE *BLANK    AFMAEK
     C                     Z-ADD0         AFMAKB
     C                     MOVE *BLANK    AFMTK1
     C                     MOVE *BLANK    AFMTK2
     C                     MOVE *BLANK    AFMTK3
     C                     MOVE *BLANK    AFMTK4
     C                     Z-ADD0         AFSTCD
     C                     Z-ADD0         AFSYOS
     C                     MOVE *BLANK    AFSYOT
     C                     Z-ADD0         AFKALL
     C                     Z-ADD0         AFKMIN
     C                     Z-ADD0         AFKMAX
     C                     Z-ADD0         AFKTSU
     C                     Z-ADD0         AFKSSU
     C                     MOVE *BLANK    AFDTKO
     C                     MOVE *BLANK    AFDTHE
     C                     Z-ADD0         AFLOTO
     C                     Z-ADD8907      AFUKOJ
     C                     MOVE '01  '    AFUKER
     C                     Z-ADD0         AFMEHZ
     C                     Z-ADD0         AFMTIM
     C                     MOVE *BLANK    AFMEME
      *
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PPHIN1    AFSHN1           ﾆﾞﾃcmb ﾍ]ﾌﾞ] 5
     C                     MOVE PPHIN2    AFSHN2                        5
     C                     MOVE PPHIN3    AFSHN3                        2
     C                     MOVE PTKBI     AFTKBI
     C                     Z-ADDPPYO2Y    AFUKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     Z-ADDPPYO2M    AFUKMM           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     Z-ADDPPYO2D    AFUKDD           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     Z-ADDPPBIN2    AFUBIN           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     Z-ADD9999      AFSTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        AFSTMM           ﾆｮﾃcﾍﾞ MM
     C                     Z-ADD99        AFSTDD           ﾆｮﾃcﾍﾞ DD
     C                     Z-ADD99        AFSBIN           ﾆｮﾃcﾍﾞ ﾍﾞ]
      *
     C                     SETOF                     10
     C                     Z-ADD8         X       10
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C           AMKEY     CHAINAAMPL111             10    gﾒfd uﾇjｰ
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11s]ﾃcﾃﾞﾌﾞ]kLOKUP
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z       20
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AFATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AFMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AFMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AFUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AFUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y       10
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    AFATK1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    AFATK2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    AFATK3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    AFATK4           ﾆﾞﾃcmb ﾌﾞ]k 4
      *
     C           AFUKOJ    IFEQ 8907
     C           AFATK1    IFNE 'G'
     C           AFATK1    ANDNE'S'
     C           AFATK1    ANDNE'7'
     C                     MOVE '03  '    AFUKER
     C                     END
     C                     END
      *
     C                     Z-ADDPPSETT    AFKSSU           ibﾅ] ﾈｮmbﾇc
     C                     Z-ADDPPSETT    AFKTSU           fhmb ﾈｮmbﾇc
      *
     C           PPKUB     IFEQ '13'
     C                     MOVE 'D'       AFDTKO           mﾞｰj ﾃcﾆ]方法
     C                     ELSE
     C                     MOVE '2'       AFDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C                     MOVE *BLANK    AFDTHE
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN30     IFEQ '1'
     C                     WRITEAECPL031                   ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C                     ELSE
     C                     UPDATAECPL031
     C                     END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY           ag ﾌﾞ]k ﾍlﾞi Y
     C                     Z-ADD0         CJAKMM           ag ﾌﾞ]k ﾍlﾞi M
     C                     Z-ADD0         CJAKDD           ag ﾌﾞ]k ﾍlﾞi D
     C                     MOVE AFSHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AFSHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AFSHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE AFMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AFMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AFMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AFMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##2P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 03 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 04 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 11 gｬc ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ uboﾇﾇﾓ                        *
     C* 12 ﾆ]  ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ ﾎﾟ[ﾇﾇﾓ                        *
     C*---------------------------------------------------------------*
     C           ##3       BEGSR
      *
     C                     Z-ADD0         WSYUY   50
     C                     Z-ADD0         WSLOT   90
     C                     Z-ADD0         WOUKBI
     C                     Z-ADD0         WNUKBI 100
     C                     Z-ADD0         WMEHZ   80
     C                     Z-ADD0         WMTIM   40
     C                     MOVE *BLANK    WMEME  10
     C           FLKEY     SETGTAECPL031
      *
     C           ##XX1     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##XX1
     C                     END
     C                     END
      *
     C           *IN10     IFEQ '0'
      *
     C           PPKUB     IFEQ '11'
     C           POHIN     IFNE AFSHIN
     C                     GOTO ##XX1
     C                     END
      *
     C                     Z-ADDAFKSSU    WKSSU   90
     C           AFKSSU    SUB  PPSETT    AFKSSU
     C           WKSSU     IFEQ AFKSSU
     C                     GOTO ##3P1
     C                     END
     C                     MOVE '3'       AFDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE *BLANK    AFDTHE
     C                     END
      *
     C           PPKUB     IFEQ '12'
     C           POHIN     IFNE AFSHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           PPSETT    IFEQ AFKSSU
     C                     GOTO ##3P1
     C                     END
     C                     Z-ADDPPSETT    AFKSSU
     C                     MOVE '3'       AFDTKO
     C                     MOVE *BLANK    AFDTHE
     C                     END
      *
     C           PPKUB     IFNE '11'
     C           PPKUB     ANDNE'12'
      *
     C           POHIN     IFNE AFSHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           AFSTHZ    IFNE 99999999
     C                     GOTO ##3X1
     C                     END
      *
     C                     Z-ADDAFMEHZ    WMEHZ
     C                     Z-ADDAFMTIM    WMTIM
     C                     MOVE AFMEME    WMEME
     C                     Z-ADDAFUKBI    WOUKBI
     C                     MOVE '7'       AFDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       AFDTHE
     C                     Z-ADDAFUKBI    AFTKBI
     C                     MOVE AFTKBI    PTKBI
     C                     Z-ADDPPYO2Y    AFSTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AFSTMM                  MM
     C                     Z-ADDPPYO2D    AFSTDD                  DD
     C                     Z-ADDPPBIN2    AFSBIN                  ﾍﾞ]
     C                     END
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAECPL031
      *
     C           PPKUB     IFEQ '11'
     C           PPKUB     OREQ '12'
     C                     GOTO ##3P1
     C                     END
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDAFSTYY    CJAKYY
     C                     Z-ADDAFSTMM    CJAKMM
     C                     Z-ADDAFSTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
     C                     END
     C           ##3X1     TAG
      *
     C           VLKEY     SETGTAECPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           VLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C           AFSTBI    IFEQ 9999999999
      *
     C           AFUKBI    IFEQ PPYOU2
     C                     GOTO ##3P1
     C                     END
      *
     C                     Z-ADDAFMEHZ    WMEHZ
     C                     Z-ADDAFMTIM    WMTIM
     C                     MOVE AFMEME    WMEME
     C                     Z-ADDAFUKBI    WNUKBI
     C                     MOVE '7'       AFDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       AFDTHE
     C                     Z-ADDAFUKBI    AFTKBI
     C                     MOVE AFTKBI    PTKBI
     C                     Z-ADDPPYO2Y    AFSTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AFSTMM                  MM
     C                     Z-ADDPPYO2D    AFSTDD                  DD
     C                     Z-ADDPPBIN2    AFSBIN                  ﾍﾞ]
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
      *
     C                     UPDATAECPL031
      *
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           WOUKBI    IFEQ 0
     C           WNUKBI    ANDEQ0
     C                     EXSR ##2
     C                     GOTO ##3P1
     C                     END
      *
     C*-------------*
     C*   gｬcﾌﾞ]k   *
     C*-------------*
     C           WNUKBI    IFEQ 0
     C                     SETOF                     30
     C           FLKEY3    CHAINAECPL031             30
     C                     END
      *
     C*-------------*
     C*   ﾆ]ﾌﾞ]k    *
     C*-------------*
     C                     SETOF                     30
     C           FPKEY3    CHAINAECPL031             30
      *
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PTKBI     AFTKBI
     C                     Z-ADDPPYO2Y    AFUKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞ Y
     C                     Z-ADDPPYO2M    AFUKMM                         M
     C                     Z-ADDPPYO2D    AFUKDD                         D
     C                     Z-ADDPPBIN2    AFUBIN                         ﾍﾞ]
     C                     Z-ADD9999      AFSTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        AFSTMM                  MM
     C                     Z-ADD99        AFSTDD                  DD
     C                     Z-ADD99        AFSBIN                  ﾍﾞ]
     C                     MOVE PPBN21    AFATK1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    AFATK2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    AFATK3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    AFATK4           ﾆﾞﾃcmb ﾌﾞ]k 4
     C                     MOVE PPHIN1    AFSHN1
     C                     MOVE PPHIN2    AFSHN2
     C                     MOVE PPHIN3    AFSHN3
     C                     Z-ADDWMEHZ     AFMEHZ
     C                     Z-ADDWMTIM     AFMTIM
     C                     MOVE WMEME     AFMEME
      *
     C                     SETOF                     10
     C                     Z-ADD8         X
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C                     MOVE *BLANK    AFATOK
     C                     Z-ADD0         AFATOB
     C                     MOVE *BLANK    AFMAEK
     C                     Z-ADD0         AFMAKB
     C                     MOVE *BLANK    AFMTK
     C                     Z-ADD8907      AFUKOJ
     C                     MOVE '01  '    AFUKER
      *
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AFATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AFMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AFMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AFUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AFUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C           AFUKOJ    IFEQ 8907
     C           AFATK1    IFNE 'G'
     C           AFATK1    ANDNE'S'
     C           AFATK1    ANDNE'7'
     C                     MOVE '03  '    AFUKER
     C                     END
     C                     END
      *
     C                     Z-ADDPPSETT    AFKSSU           ibﾅ] ﾈｮmb ﾇc
      *
     C           PPKUB     IFEQ '03'
     C                     MOVE '6'       AFDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C           PPKUB     IFEQ '04'
     C                     MOVE 'A'       AFDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
      *
     C                     MOVE *BLANK    AFDTHE
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN30     IFEQ '0'
     C                     UPDATAECPL031
     C                     ELSE
     C                     WRITEAECPL031                   ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C                     END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE AFSHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AFSHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AFSHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE AFMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AFMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AFMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AFMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##3P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 05 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 06 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 09 s]ﾃcud s]ﾃcﾃﾞ mﾞ f]ﾌﾞ] ﾆｬﾓb jﾞifﾞ fﾝｮj                     *
     C*---------------------------------------------------------------*
     C           ##5       BEGSR
      *
     C           FLKEY     SETGTAECPL031
     C           ##XX2     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##XX2
     C                     END
      *
     C           AFSTBI    IFNE 9999999999
     C           PPYOU2    IFLT AFSTBI
     C                     GOTO ##5P1
     C                     END
     C                     END
      *
     C           POHIN     IFNE PKSHIN
     C                     GOTO ##5P1
     C                     END
      *
     C                     Z-ADDAFUKBI    AFTKBI
     C                     MOVE AFTKBI    PTKBI
     C                     Z-ADDPPYO2Y    AFSTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AFSTMM                  MM
     C                     Z-ADDPPYO2D    AFSTDD                  DD
     C                     Z-ADDPPBIN2    AFSBIN                  ﾍﾞ]
     C                     MOVE '7'       AFDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE *BLANK    AFDTHE
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE AFKMAX    PZKMS            ud ﾉ f]ﾌﾞ] ubﾇc
     C                     UPDATAECPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDAFSTYY    CJAKYY
     C                     Z-ADDAFSTMM    CJAKMM
     C                     Z-ADDAFSTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##5P1     ENDSR
      *
      *
     C*-----------------------------------*
     C*   07   f]ﾌﾞ]ﾆｬﾓb eoﾆﾞ ﾉ ﾆｬcﾈb     *
     C*-----------------------------------*
     C           ##7       BEGSR
      *
     C                     Z-ADD0         WSYUY
     C                     Z-ADD0         WSLOT
     C                     Z-ADD0         WMEHZ
     C                     Z-ADD0         WMTIM
     C                     MOVE *BLANK    WMEME
     C           FLKEY     SETGTAECPL031
     C           ##XX3     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##XX3
     C                     END
      *
     C           AFSTBI    IFNE 9999999999
     C           PPYOU2    IFLT AFUKBI
     C                     GOTO ##7P1
     C                     END
     C                     END
      *
     C                     MOVE '6'       AFDTKO
     C                     MOVE *BLANK    AFDTHE
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDPPYOU2    AFUKBI
      *
     C                     SETOF                     10
     C                     Z-ADD8         X
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C                     MOVE *BLANK    AFATOK
     C                     Z-ADD0         AFATOB
     C                     MOVE *BLANK    AFMAEK
     C                     Z-ADD0         AFMAKB
     C                     MOVE *BLANK    AFMTK
     C                     Z-ADD8907      AFUKOJ
     C                     MOVE '01  '    AFUKER
      *
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AFATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AFMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AFMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AFMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AFUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AFUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    AFATK1
     C                     MOVE PPBN22    AFATK2
     C                     MOVE PPBN23    AFATK3
     C                     MOVE PPBN24    AFATK4
     C                     MOVE PPHIN1    AFSHN1
     C                     MOVE PPHIN2    AFSHN2
     C                     MOVE PPHIN3    AFSHN3
      *
     C           AFUKOJ    IFEQ 8907
     C           AFATK1    IFNE 'G'
     C           AFATK1    ANDNE'S'
     C           AFATK1    ANDNE'7'
     C                     MOVE '03  '    AFUKER
     C                     END
     C                     END
      *
     C                     UPDATAECPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDAFUKYY    CJAKYY
     C                     Z-ADDAFUKMM    CJAKMM
     C                     Z-ADDAFUKDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C           YLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           YLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE AFSHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AFSHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AFSHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE AFMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AFMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AFMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AFMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##X31     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##X31
     C                     END
     C           PPYOU2    IFNE AFSTBI
      *
     C                     MOVE '7'       AFDTKO
     C                     MOVE '*'       AFDTHE
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDAFUKBI    AFTKBI
     C                     MOVE AFTKBI    PTKBI
     C                     Z-ADDAFMEHZ    WMEHZ
     C                     Z-ADDAFMTIM    WMTIM
     C                     MOVE AFMEME    WMEME
     C                     Z-ADDPPYOU2    AFSTBI
     C                     UPDATAECPL031
     C                     END
     C                     END
      *
     C           FLKEY     SETGTAECPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           POHIN     IFEQ AFSHIN
     C                     MOVE PTKBI     AFTKBI
     C                     Z-ADDWMEHZ     AFMEHZ
     C                     Z-ADDWMTIM     AFMTIM
     C                     MOVE WMEME     AFMEME
     C                     UPDATAECPL031
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C           ##7P1     ENDSR
      *
      *
     C*----------------------------*
     C*   08   f]ﾌﾞ]ﾆｬﾓb ﾉ ﾆｬcﾈb   *
     C*----------------------------*
     C           ##8       BEGSR
      *
     C           FLKEY     SETGTAECPL031
     C           ##XX4     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     GOTO ##XX4
     C                     END
      *
     C           AFSTBI    IFNE 9999999999
     C           PPYOU2    IFLT AFSTBI
     C                     GOTO ##8P1
     C                     END
     C                     END
      *
     C                     MOVE '7'       AFDTKO
     C                     MOVE *BLANK    AFDTHE
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDAFUKBI    AFTKBI
     C                     MOVE AFTKBI    PTKBI
     C                     Z-ADDPPYOU2    AFSTBI
     C                     MOVE AFKMAX    PZKMS            ud ﾉ f]ﾌﾞ] ubﾇc
     C                     UPDATAECPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDAFSTYY    CJAKYY
     C                     Z-ADDAFSTMM    CJAKMM
     C                     Z-ADDAFSTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##8P1     ENDSR
      *
      *
     C*----------------------------------*
     C* 10 s]ﾃcud s]ﾃcﾃﾞ fﾝ[ob ng        *
     C*----------------------------------*
     C           ##10      BEGSR
      *
     C                     SETOF                     10
     C           FPKEY3    CHAINAECPL031             10
     C           *IN10     IFEQ '0'
     C           AFSKJY    ANDEQ'D'
     C           AFSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
      *
     C           #UKBI     IFEQ 0
     C                     EXSR ##2
     C                     ELSE
      *
     C           PPYOU2    IFLT #UKBI
     C                     GOTO ##10P1
     C                     END
      *
     C           PPYOU2    IFGT #UKBI
     C                     EXSR ##7
     C                     END
     C                     END
     C                     ELSE
      *
     C                     MOVE *BLANK    AFDTHE
     C           PPSETT    IFNE AFKTSU
     C                     MOVE '3'       AFDTKO
     C                     END
     C                     Z-ADDPPSETT    AFKSSU
      *
     C                     Z-ADD*DATE     AFKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AFTIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AFKOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAECPL031
     C                     END
      *
     C           ##10P1    ENDSR
      *
      *
     C*----------------------------------*
     C*     ﾏcﾃcﾍﾞ f]ﾌﾞ]ﾆｬﾓb  ﾉ  kｩｮh    *
     C*----------------------------------*
     C           SUBRTN    BEGSR
      *
     C           FLKEY     SETGTAECPL031
     C                     SETOF                     10
     C                     READPAECPL031                 10
     C           *IN10     IFEQ '0'
     C                     UPDATAECPL031
     C           POTKR     IFEQ AFATKR
     C           PPYOU2    ANDNEAFUKBI
     C                     MOVE '03'      PPKUB
     C           PPOKCD    IFNE PPNKCD
     C                     MOVE '05'      PPKUB
     C                     END
     C                     END
     C                     END
      *
     C                     ENDSR
      *
     C*------------------------------------*
     C*     ﾏcﾃcﾍﾞﾍﾇﾞi 0 ﾆﾞﾉ ﾏcﾃcﾍﾞﾈｮn     *
     C*------------------------------------*
     C           SBHZ      BEGSR
      *
     C                     Z-ADD0         #UKBI  100
     C                     Z-ADD0         #STBI  100
      *
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     SETGTAECPL031
     C                     ELSE
     C           FLKEY     SETGTAECPL031
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     REDPEAECPL031                 10
     C                     ELSE
     C           FLKEY     REDPEAECPL031                 10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     Z-ADDAFUKBI    #UKBI
     C                     Z-ADDAFSTBI    #STBI
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     ENDSR
      *
** TB1.TB2
01110111
** TB3.TB4
011101
