     H            Y.
     F** AAVR05 ************************************
     F* ..CHECK NEW LOCATION WITH LOCATION M/F || *.
     F* I-HASADA                     86.12.05      *
     F************************************ AAVR05 **
     FFCEPL03 IF  E           K        DISK
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PTKR1   1
     C                     PARM           PTKR2   2
     C                     PARM           PTKR3   2
     C                     PARM           PTKR4   1
     C                     PARM           PSHN1   5
     C                     PARM           PSHN2   5
     C                     PARM           PSHN3   2
     C                     PARM           PTER    1
      *
     C           KEY       KLIST
     C                     KFLD           PTKR1
     C                     KFLD           PTKR2
     C                     KFLD           PTKR3
     C                     KFLD           PTKR4
      *
     C           KEY       SETLLFCEPL031
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY       READEFCEPL031                 01
     C           *IN01     IFEQ '0'
      *
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO STP1
     C                     END
      *
     C                     MOVE A2BHB1    PSHN1
     C                     MOVE A2BHB2    PSHN2
     C                     MOVE A2BHB3    PSHN3
     C                     MOVE '*'       PTER
     C                     RETRN
      *
     C           STP1      TAG
     C                     END
     C  N01                END
      *
     C                     RETRN
