     H            Y.
     F** AAVR43 **********************************
     F*INTRA-PROCESS KANBAN M/F KEY CHANGE *.
     F* I-HASADA                   95.02.01      *
     F********************************** AAVR43 **
     FAAMPL11 IF  E           K        DISK
     FABHPL03 UF  E           K        DISK
     F**AAJPL11 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     E                    KKO        15  3               新工程
     E                    KBM        15  4 0             新部門
     E                    KBN        15  6               新所番地
     E                    KHN        15 12               新工程内品番
     E                    KKI        15  3               新機番
     E                    CKO        15  3               工程WORK
     E                    CBM        15  4 0             部門WORK
     E                    CBN        15  6               所番地WORK
     E                    CHN        15 12               ﾍ]ﾌﾞ] WORK
     E                    CKI        15  3               gNO. WORK
     E                    TKT         4  3               fﾃcobﾑc ﾃcmb
     E                    TBN         4  3               gNO. ﾃcmb
     E                    TKI         4  1               gNO. djﾞﾌﾞ]
     E                    HKT         4  3               fﾃcobﾑc ﾃcmb WORK
     E                    HBN         4  3               gNO. ﾃcmb WORK
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 KBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 KHN
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  45 KKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  12 TKT
     I                                        1   3 M6AKT1
     I                                        4   6 M6AKT2
     I                                        7   9 M6AKT3
     I                                       10  12 M6AKT4
     I            DS
     I                                        1  12 TBN
     I                                        1   3 M6KBN1
     I                                        4   6 M6KBN2
     I                                        7   9 M6KBN3
     I                                       10  12 M6KBN4
     I            DS
     I                                        1   4 TKI
     I                                        1   1 M6KIB1
     I                                        2   2 M6KIB2
     I                                        3   3 M6KIB3
     I                                        4   4 M6KIB4
     I            DS
     I                                        1  12 M6MHIN
     I                                        1   5 M6MHN1
     I                                        6  10 M6MHN2
     I                                       11  12 M6MHN3
     I            DS
     I                                        1  100PPYOU2
     I                                        1   80PPYYMD
     I                                        1   40PPYO2Y
     I                                        5   60PPYO2M
     I                                        7   80PPYO2D
     I                                        9  100PPBIN2
     I            DS
     I                                        1   6 XXBAN
     I                                        1   1 X6JBN1
     I                                        2   3 X6JBN2
     I                                        4   5 X6JBN3
     I                                        6   6 X6JBN4
     I            DS
     I                                        1   6 M6MTKR
     I                                        1   1 M6MTK1
     I                                        2   3 M6MTK2
     I                                        4   5 M6MTK3
     I                                        6   6 M6MTK4
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   6 POTKR
     I                                        1   1 PPBN11
     I                                        2   3 PPBN12
     I                                        4   5 PPBN13
     I                                        6   6 PPBN14
     I            DS
     I                                        1   6 PNTKR
     I                                        1   1 PPBN21
     I                                        2   3 PPBN22
     I                                        4   5 PPBN23
     I                                        6   6 PPBN24
     I            DS
     I                                        1   80M6SKHZ
     I                                        1   40M6SKYY
     I                                        5   60M6SKMM
     I                                        7   80M6SKDD
     I            DS
     I                                        1   80M6KOHZ
     I                                        1   40M6KOYY
     I                                        5   60M6KOMM
     I                                        7   80M6KODD
     I            DS
     I                                        1   60M6TIME
     I                                        1   20M6KOJJ
     I                                        3   40M6KOFF
     I            DS
     I                                        1  100M6UKBI
     I                                        1   40M6UKYY
     I                                        5   60M6UKMM
     I                                        7   80M6UKDD
     I                                        9  100M6UBIN
     I            DS
     I                                        1  100M6TKBI
     I                                        1   40M6TKYY
     I                                        5   60M6TKMM
     I                                        7   80M6TKDD
     I                                        9  100M6TBIN
     I            DS
     I                                        1  100M6STBI
     I                                        1   40M6STYY
     I                                        5   60M6STMM
     I                                        7   80M6STDD
     I                                        9  100M6SBIN
     I            DS
     I                                        1   6 M6JBAN
     I                                        1   1 M6JBN1
     I                                        2   3 M6JBN2
     I                                        4   5 M6JBN3
     I                                        6   6 M6JBN4
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1  12 PPHIN
     I                                        1   5 PPHN1
     I                                        6  10 PPHN2
     I                                       11  12 PPHN3
     I            DS
     I                                        1  100WOUKBI
     I                                        1   40WOUKYY
     I                                        5   60WOUKMM
     I                                        7   80WOUKDD
     I                                        9  100WOUBIN
      *
     C           FLKEY     KLIST
     C                     KFLD           PPBN11           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN12           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN13           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN14           s]ﾃc ud ﾌﾞ]k 4
      *
     C           FLKEY3    KLIST
     C                     KFLD           PPBN11
     C                     KFLD           PPBN12
     C                     KFLD           PPBN13
     C                     KFLD           PPBN14
     C                     KFLD           WOUKYY
     C                     KFLD           WOUKMM
     C                     KFLD           WOUKDD
     C                     KFLD           WOUBIN
      *
     C           FPKEY3    KLIST
     C                     KFLD           PPBN21
     C                     KFLD           PPBN22
     C                     KFLD           PPBN23
     C                     KFLD           PPBN24
     C                     KFLD           PPYO2Y
     C                     KFLD           PPYO2M
     C                     KFLD           PPYO2D
     C                     KFLD           PPBIN2
      *
     C           AMKEY     KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
      *
     C           VLKEY     KLIST
     C                     KFLD           PPBN21           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN22           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN23           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN24           s]ﾃc ud ﾌﾞ]k 4
      *
     C           YLKEY     KLIST
     C                     KFLD           M6JBN1
     C                     KFLD           M6JBN2
     C                     KFLD           M6JBN3
     C                     KFLD           M6JBN4
      *
     C                     EXSR ##2
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*---------------------------------------------------------------*
     C* 02  lbf                                                       *
     C* 13  f]ﾌﾞ]ﾆｬﾓb s]ﾃc lbf                                        *
     C*---------------------------------------------------------------*
     C           ##2       BEGSR
      *
     C                     MOVEL'1'       PPBN21
     C                     MOVEL'D1'      PPBN22
     C                     MOVEL'09'      PPBN23
     C                     MOVEL'0'       PPBN24
     C                     Z-ADD2020      PPYO2Y
     C                     Z-ADD11        PPYO2M
     C                     Z-ADD14        PPYO2D
     C                     Z-ADD01        PPBIN2
      *
     C                     SETOF                     30
     C           FPKEY3    CHAINABHPL031             30
     C           ##2P2     TAG
      *
     C                     SETOF                     10
     C           AMKEY     CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C                     MOVE A2ZETI    M6ZETI
     C                     MOVELA2ZANM    M6ZAI1
     C                     Z-ADDA2KAZI    M6ZAI2
     C                     END
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    HKT
     C                     MOVE *BLANK    HBN
     C                     MOVE *BLANK    TKT
     C                     MOVE *BLANK    TBN
     C                     MOVE *BLANK    TKI
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    CHN
     C                     MOVE *BLANK    CKI
     C           AMKEY     CHAINAAMPL111             10    gﾒfd uﾇjｰ
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     MOVE KHN,A     CHN,B
     C                     MOVE KKI,A     CKI,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         A
     C                     Z-ADD1         I       20
     C           M6JBAN    LOKUPCBN,I                    11s]ﾃcﾃﾞﾌﾞ]kLOKUP
     C           *IN11     IFEQ '1'
     C                     Z-ADDCBM,I     M6BMON           ﾆﾞﾃcmb ﾎﾞy]
     C                     MOVE CKO,I     HKT,1
     C                     MOVE CKI,I     HBN,1
      *
     C           I         ADD  1         U       20
     C           U         IFLE 15
     C                     MOVE CKO,U     M6AKT5
     C                     MOVE CKI,U     M6KBN5
     C                     END
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     M6MKOT           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     M6MBMN           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     M6MTKR           udﾃcmb ﾌﾞ]k
     C                     MOVE CHN,I     M6MHIN
     C                     SETON                     11
     C                     ELSE
     C                     ADD  1         A
     C           A         IFLE 4
     C                     MOVE CKO,I     HKT,A
     C                     MOVE CKI,I     HBN,A
     C                     END
     C                     END
     C                     END
     C  N11                END
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD5         B
     C                     Z-ADD0         C       20
     C           1         DO   4         A
     C                     SUB  1         B
     C           HKT,B     IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HKT,B     TKT,C
     C                     MOVE HBN,B     TBN,C
     C                     MOVE *BLANK    TKI,C
     C                     END
     C                     END
      *
     C*****                MOVE PPBN21    M6JBN1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C*****                MOVE PPBN22    M6JBN2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C*****                MOVE PPBN23    M6JBN3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C*****                MOVE PPBN24    M6JBN4           ﾆﾞﾃcmb ﾌﾞ]k 4
     C*****                Z-ADDPPSETT    M6KSSU           ibﾅ] ﾈｮmbﾇc
     C*****                Z-ADDPPSETT    M6KTSU           fhmb ﾈｮmbﾇc
      *
     C*****      PPKUB     IFEQ '13'
     C*****                MOVE 'D'       M6DTKO           mﾞｰj ﾃcﾆ]方法
     C*****                ELSE
     C*****                MOVE '2'       M6DTKO           mﾞｰj ﾃcﾆ]方法
     C*****                END
     C*****                MOVE *BLANK    M6DTHE           mﾞｰj s]ﾃc hﾎﾞ]
      *
     C*****                Z-ADD0111      M6NKOJ
      *
     C*****      VLKEY     SETGTAAJPL111
     C*****                SETOF                     10
     C*****      VLKEY     REDPEAAJPL111                 10
     C*****      *IN10     IFEQ '0'
     C*****                MOVE CJKDAI    M6KRU1           f]ﾌﾞ] ﾆｬﾓb jﾞb
     C*****                MOVE CJKSYO    M6KRU2           f]ﾌﾞ] ﾆｬﾓb ﾆｭc
     C*****                END
      ******************
     C                     UPDATABHPL031
      *
     C*****      *IN10     IFEQ '0'
     C*****                Z-ADD0         CJAKYY           ag ﾌﾞ]k ﾍlﾞi Y
     C*****                Z-ADD0         CJAKMM           ag ﾌﾞ]k ﾍlﾞi M
     C*****                Z-ADD0         CJAKDD           ag ﾌﾞ]k ﾍlﾞi D
     C*****                MOVE M6HIN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C*****                MOVE M6HIN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C*****                MOVE M6HIN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C*****                Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C*****                MOVE M6MTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C*****                MOVE M6MTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C*****                MOVE M6MTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C*****                MOVE M6MTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C*****                Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C*****                UPDATAAJPL111
     C*****                END
      *
     C           ##2P1     ENDSR
      *
