     H            Y.
     F** AAVR02 **********************************************
     F* .. | MONTHLY NUMBER FIX FROM PART M/F MONTHLY CAREER FILES || *.
     F* I-HASADA                              96.09.14       *
     F********************************************** AAVR02 **
     FFCEPL11 IF  E           K        DISK
     E                    HGK        10  9 0             月間必要数
     E                    HGH        10  8 0             切替日
     E                    HCD        10  3 1             稼動日数
     I            DS
     I                                        1  900HGK
     I                                        1   90FCGK10
     I                                       10  180FCGK09
     I                                       19  270FCGK08
     I                                       28  360FCGK07
     I                                       37  450FCGK06
     I                                       46  540FCGK05
     I                                       55  630FCGK04
     I                                       64  720FCGK03
     I                                       73  810FCGK02
     I                                       82  900FCGK01
     I            DS
     I                                        1  800HGH
     I                                        1   80FCGH10
     I                                        9  160FCGH09
     I                                       17  240FCGH08
     I                                       25  320FCGH07
     I                                       33  400FCGH06
     I                                       41  480FCGH05
     I                                       49  560FCGH04
     I                                       57  640FCGH03
     I                                       65  720FCGH02
     I                                       73  800FCGH01
     I            DS
     I                                        1  301HCD
     I                                        1   31FCCD10
     I                                        4   61FCCD09
     I                                        7   91FCCD08
     I                                       10  121FCCD07
     I                                       13  151FCCD06
     I                                       16  181FCCD05
     I                                       19  211FCCD04
     I                                       22  241FCCD03
     I                                       25  271FCCD02
     I                                       28  301FCCD01
     I            DS
     I                                        1   80FCSKHZ
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
      *
     C           KEY1      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PSHIN  12        社内品番
     C                     PARM           PGSRY   9        月間数
     C                     PARM           PHSRY   9        日当数
     C                     MOVE PSHIN     WSHIN
      *
     C                     Z-ADD0         WGSRY   90
     C                     Z-ADD0         WHSRY   90
      *
     C                     SETOF                     1011
     C           KEY1      CHAINFCEPL111             10
     C           *IN10     IFEQ '0'
     C           FCSKJY    ANDEQ'D'
     C           FCSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
      *
     C                     Z-ADD1         A       20
     C           1         DO   10        A
     C           HGK,A     IFNE 0
      *
     C           HGH,A     IFGT *DATE
     C                     SETON                     11
     C                     ELSE
      *
     C                     Z-ADDHGK,A     WGSRY
     C           HGK,A     DIV  HCD,A     WHSRY   90
      *
     C                     END
     C                     END
     C  N11                END
     C                     END
      *
     C                     MOVE WGSRY     PGSRY
     C                     MOVE WHSRY     PHSRY
      *
     C                     RETRN
