     H            Y.
     F** AAVR37 ****************************************
     F* HEAT-TREATMENT PLATING KANBAN M/F KEY CHANGE *
     F*         A.IDOTA          1992.04.28            *
     F**************************************** AAVR37 **
     FAAMPL11 IF  E           K        DISK
     FAAXPL10 UF  E           K        DISK                      A
     FAAJPL11 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     E                    KKO        15  3               新工程
     E                    KBM        15  4 0             新部門
     E                    KBN        15  6               新所番地
     E                    CKO        15  3               工程WORK
     E                    CBM        15  4 0             部門WORK
     E                    CBN        15  6               所番地WORK
     E                    HSKT        4  3               ﾆｭﾒﾃcmb  WORK
     E                    TSKT        4  3               ﾆｭﾒﾃcmb
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 KBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  100PPYOU2
     I                                        1   80PPYYMD
     I                                        1   40PPYO2Y
     I                                        5   60PPYO2M
     I                                        7   80PPYO2D
     I                                        9  100PPBIN2
     I            DS
     I                                        1   6 XXBAN
     I                                        1   1 XXBAN1
     I                                        2   3 XXBAN2
     I                                        4   5 XXBAN3
     I                                        6   6 XXBAN4
     I            DS
     I                                        1   6 L9KTR
     I                                        1   1 L9KTR1
     I                                        2   3 L9KTR2
     I                                        4   5 L9KTR3
     I                                        6   6 L9KTR4
     I            DS
     I                                        1  12 TSKT
     I                                        1   3 L9SKT1
     I                                        4   6 L9SKT2
     I                                        7   9 L9SKT3
     I                                       10  12 L9SKT4
     I            DS
     I                                        1   6 POTKR
     I                                        1   1 PPBN11
     I                                        2   3 PPBN12
     I                                        4   5 PPBN13
     I                                        6   6 PPBN14
     I            DS
     I                                        1   6 PNTKR
     I                                        1   1 PPBN21
     I                                        2   3 PPBN22
     I                                        4   5 PPBN23
     I                                        6   6 PPBN24
     I            DS
     I                                        1   80L9SKHZ
     I                                        1   40L9SKYY
     I                                        5   60L9SKMM
     I                                        7   80L9SKDD
     I            DS
     I                                        1   80L9KOHZ
     I                                        1   40L9KOYY
     I                                        5   60L9KOMM
     I                                        7   80L9KODD
     I            DS
     I                                        1   60L9TIME
     I                                        1   20L9KOHH
     I                                        3   40L9KOSS
     I            DS
     I                                        1  100L9UKBI
     I                                        1   40L9UKYY
     I                                        5   60L9UKMM
     I                                        7   80L9UKDD
     I                                        9  100L9UBIN
     I            DS
     I                                        1  100L9TKBI
     I                                        1   40L9TKYY
     I                                        5   60L9TKMM
     I                                        7   80L9TKDD
     I                                        9  100L9TBIN
     I            DS
     I                                        1  100L9STBI
     I                                        1   40L9STYY
     I                                        5   60L9STMM
     I                                        7   80L9STDD
     I                                        9  100L9SBIN
     I            DS
     I                                        1   6 L9TKRO
     I                                        1   1 L9TKR1
     I                                        2   3 L9TKR2
     I                                        4   5 L9TKR3
     I                                        6   6 L9TKR4
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1  12 PPHIN
     I                                        1   5 PPHN1
     I                                        6  10 PPHN2
     I                                       11  12 PPHN3
     I            DS
     I                                        1   7 A2MEKI
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
     I            DS
     I                                        1  100WOUKBI
     I                                        1   40WOUKYY
     I                                        5   60WOUKMM
     I                                        7   80WOUKDD
     I                                        9  100WOUBIN
      *
     C           FLKEY     KLIST
     C                     KFLD           PPBN11           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN12           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN13           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN14           s]ﾃc ud ﾌﾞ]k 4
      *
     C           FLKEY3    KLIST
     C                     KFLD           PPBN11
     C                     KFLD           PPBN12
     C                     KFLD           PPBN13
     C                     KFLD           PPBN14
     C                     KFLD           WOUKYY
     C                     KFLD           WOUKMM
     C                     KFLD           WOUKDD
     C                     KFLD           WOUBIN
      *
     C           FPKEY3    KLIST
     C                     KFLD           PPBN21
     C                     KFLD           PPBN22
     C                     KFLD           PPBN23
     C                     KFLD           PPBN24
     C                     KFLD           PPYO2Y
     C                     KFLD           PPYO2M
     C                     KFLD           PPYO2D
     C                     KFLD           PPBIN2
      *
     C           AMKEY     KLIST
     C                     KFLD           PPHIN1
     C                     KFLD           PPHIN2
     C                     KFLD           PPHIN3
      *
     C           VLKEY     KLIST
     C                     KFLD           PPBN21           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN22           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN23           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN24           s]ﾃc ud ﾌﾞ]k 4
      *
     C           YLKEY     KLIST
     C                     KFLD           L9TKR1
     C                     KFLD           L9TKR2
     C                     KFLD           L9TKR3
     C                     KFLD           L9TKR4
      *
     C           *ENTRY    PLIST
     C                     PARM           PPOKCD  1        s]ﾃcud f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN11  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN12  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN13  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN14  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PPNKCD  1        s]ﾃcﾃﾞ f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN21  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN22  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN23  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN24  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PAYO2Y  4        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     PARM           PAYO2M  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     PARM           PAYO2D  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     PARM           PABIN2  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     PARM           POHIN  12        s]ﾃcud ﾍ]ﾌﾞ]
     C                     PARM           PPHIN1  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 1
     C                     PARM           PPHIN2  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 2
     C                     PARM           PPHIN3  2        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 3
     C                     PARM           PASETT  9        ﾈｮmb ﾇc
     C                     PARM           PPKUB   2        ﾃcﾆ] hﾎﾞ]
     C                     PARM           PZKMS   3        ud ﾉ f]ﾌﾞ] ubﾇc
     C                     PARM           PPUSEC 10        ﾏｰﾅﾞｰxb
     C                     PARM           PTKBI  10        ud ﾉ ﾆｬｮﾃcﾍﾞ
     C                     PARM           PKSHIN 12        ﾆｫobﾍ]ﾌﾞ]
      *
     C                     MOVE PMBN11    PPBN11
     C                     MOVE PMBN12    PPBN12
     C                     MOVE PMBN13    PPBN13
     C                     MOVE PMBN14    PPBN14
     C                     MOVE PMBN21    PPBN21
     C                     MOVE PMBN22    PPBN22
     C                     MOVE PMBN23    PPBN23
     C                     MOVE PMBN24    PPBN24
     C                     MOVE PAYO2Y    PPYO2Y
     C                     MOVE PAYO2M    PPYO2M
     C                     MOVE PAYO2D    PPYO2D
     C                     MOVE PABIN2    PPBIN2
     C                     MOVE PPBN21    XXBAN1           s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     MOVE PPBN22    XXBAN2
     C                     MOVE PPBN23    XXBAN3
     C                     MOVE PPBN24    XXBAN4
     C                     MOVE PPHIN1    PPHN1
     C                     MOVE PPHIN2    PPHN2
     C                     MOVE PPHIN3    PPHN3
     C                     MOVE PASETT    PPSETT  90
      *
     C                     Z-ADD0         L9SKHZ
     C                     EXSR SBHZ
      *
      *
     C           PPYYMD    IFEQ 0
     C           PPKUB     IFNE '02'
     C           PPKUB     ANDNE'13'
     C                     Z-ADD#UKBI     PPYOU2
     C                     END
     C                     END
      *
     C           PPYYMD    IFEQ 0
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *
     C           PPKUB     IFEQ '04'
     C           PPKUB     OREQ '09'
     C                     EXSR SUBRTN
     C                     END
      *
      *
     C           PPKUB     IFEQ '10'
     C           #UKBI     IFNE 0
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '03'      PPKUB
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '02'
     C           PPKUB     OREQ '13'
      *
     C           #UKBI     IFNE 0
     C           PPYOU2    IFLT #UKBI
     C                     SETON                     LR
     C                     RETRN
     C                     ELSE
      *
     C           #STBI     IFEQ 9999999999
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '07'      PPKUB
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '03'
     C           PPKUB     OREQ '04'
     C           PPKUB     OREQ '11'
     C           PPKUB     OREQ '12'
      *
     C           #STBI     IFNE 0
     C           #STBI     ANDNE9999999999
     C           PPYOU2    IFLT #STBI
     C                     Z-ADD#STBI     PPYOU2
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     CASEQ'01'      ##1
     C           PPKUB     CASEQ'02'      ##2
     C           PPKUB     CASEQ'03'      ##3
     C           PPKUB     CASEQ'04'      ##3
     C           PPKUB     CASEQ'05'      ##5
     C           PPKUB     CASEQ'06'      ##5
     C           PPKUB     CASEQ'07'      ##7
     C           PPKUB     CASEQ'08'      ##8
     C           PPKUB     CASEQ'09'      ##5
     C           PPKUB     CASEQ'10'      ##10
     C           PPKUB     CASEQ'11'      ##3
     C           PPKUB     CASEQ'12'      ##3
     C           PPKUB     CASEQ'13'      ##2
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*---------------------------------------------------------------*
     C* 01 取消                                                     *
     C*---------------------------------------------------------------*
     C           ##1       BEGSR
      *
     C* 熱処理メッキかんばんマスター更新
     C           FLKEY     SETLLAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     READEAAXPL101                 10rlﾆｭﾒxｮg f]ﾌﾞ] ﾇjｰ
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    CABLE*DATE     STP01
     C                     END
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     MOVE '0'       L9DTKO           mﾞｰj ﾃcﾆ]方法
     C           L9STHZ    IFNE 99999999
     C                     MOVE '*'       L9DTHE
     C                     ELSE
     C                     MOVE *BLANK    L9DTHE           mﾞｰj s]ﾃc hﾎﾞ]
     C                     Z-ADDPPYO2Y    L9STYY
     C                     Z-ADDPPYO2M    L9STMM
     C                     Z-ADDPPYO2D    L9STDD
     C                     Z-ADDPPBIN2    L9SBIN
     C                     END
     C                     UPDATAAXPL101
     C                     END
     C           STP01     TAG
     C  N10                END
      *
     C* 工程内番地マスター更新
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C           PPYYMD    IFGT *DATE
     C                     Z-ADDPPYYMD    CJAKHZ
     C                     ELSE
     C                     Z-ADD*DATE     CJAKHZ
     C                     END
     C                     MOVE *BLANK    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE *BLANK    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE *BLANK    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE *BLANK    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE *BLANK    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE *BLANK    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE *BLANK    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C                     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 02  追加                                                    *
     C* 13  かんばん種類　変更　追加                                *
     C*---------------------------------------------------------------*
     C           ##2       BEGSR
      *
     C           PNTKR     IFEQ *BLANK
     C                     GOTO ##2P1
     C                     END
      *
     C                     SETOF                     30
     C           FPKEY3    CHAINAAXPL101             30
     C           *IN30     IFEQ '0'
     C           L9SKJY    ANDEQ'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##2P2
     C                     END
     C           *IN30     IFEQ '0'
     C           L9STHZ    ANDEQ99999999
     C                     GOTO ##2P1
     C                     END
     C           ##2P2     TAG
      *
     C                     MOVE *BLANK    L9SKJY
     C                     Z-ADD0         L9SKHZ
     C                     Z-ADD0         L9KOHZ
     C                     Z-ADD0         L9TIME
     C                     MOVE *BLANK    L9KOME
     C                     MOVE *BLANK    L9SHN1
     C                     MOVE *BLANK    L9SHN2
     C                     MOVE *BLANK    L9SHN3
     C                     Z-ADD0         L9TKYY
     C                     Z-ADD0         L9TKMM
     C                     Z-ADD0         L9TKDD
     C                     Z-ADD0         L9TBIN
     C                     Z-ADD0         L9UKYY
     C                     Z-ADD0         L9UKMM
     C                     Z-ADD0         L9UKDD
     C                     Z-ADD0         L9UBIN
     C                     Z-ADD0         L9STYY
     C                     Z-ADD0         L9STMM
     C                     Z-ADD0         L9STDD
     C                     Z-ADD0         L9SBIN
     C                     MOVE *BLANK    L9KTEI
     C                     Z-ADD0         L9BMON
     C                     MOVE *BLANK    L9TAIP
     C                     MOVE *BLANK    L9MBCD
     C                     MOVE *BLANK    L9TKR1
     C                     MOVE *BLANK    L9TKR2
     C                     MOVE *BLANK    L9TKR3
     C                     MOVE *BLANK    L9TKR4
     C                     MOVE *BLANK    L9MAEK
     C                     Z-ADD0         L9SBMN
     C                     MOVE *BLANK    L9STAP
     C                     MOVE *BLANK    L9KTR1
     C                     MOVE *BLANK    L9KTR2
     C                     MOVE *BLANK    L9KTR3
     C                     MOVE *BLANK    L9KTR4
     C                     MOVE *BLANK    L9KCD1
     C                     MOVE *BLANK    L9KCD2
     C                     Z-ADD0         L9STI1
     C                     MOVE *BLANK    L9ROBN
     C                     MOVE *BLANK    L9JOK1
     C                     MOVE *BLANK    L9JOK2
     C                     Z-ADD0         L9LOTO
     C                     MOVE *BLANK    L9BIK1
     C                     MOVE *BLANK    L9BIK2
     C                     MOVE *BLANK    L9YOUS
     C                     Z-ADD0         L9UZAR
     C                     Z-ADD0         L9HRC1
     C                     Z-ADD0         L9HRC2
     C                     Z-ADD0         L9NHV1
     C                     Z-ADD0         L9NHV2
     C                     Z-ADD0         L9SIT1
     C                     Z-ADD0         L9SIT2
     C                     Z-ADD0         L9HOJI
     C                     Z-ADD0         L9ONDO
     C                     Z-ADD0         L9MOJI
     C                     Z-ADD0         L9SYOS
     C                     MOVE *BLANK    L9SYOT
     C                     Z-ADD0         L9KSKB
     C                     Z-ADD0         L9KALL
     C                     Z-ADD0         L9MAIS
     C                     Z-ADD0         L9KMIN
     C                     Z-ADD0         L9KMAX
     C                     Z-ADD0         L9SRMS
     C                     Z-ADD0         L9ALHK
     C                     Z-ADD0         L9MXHK
     C                     MOVE *BLANK    L9KSHK
     C                     Z-ADD0         L9KTSU
     C                     Z-ADD0         L9KSSU
     C                     MOVE *BLANK    L9KOUT
     C                     MOVE *BLANK    L9DOUT
     C                     MOVE *BLANK    L9DTKO
     C                     MOVE *BLANK    L9DTHE
     C                     Z-ADD0         L9JDMS
     C                     Z-ADD0         L9KAIS
     C                     MOVE *BLANK    L9ZETI
     C                     MOVE *BLANK    L9MHN1
     C                     MOVE *BLANK    L9MHN2
     C                     MOVE *BLANK    L9MHN3
     C                     Z-ADD0         L9SKCD
     C                     Z-ADD0         L9JURO
     C                     MOVE *BLANK    L9SPEN
     C                     MOVE *BLANK    L9YKOT
     C                     Z-ADD0         L9MBMN
     C                     MOVE *BLANK    L9MTYP
     C                     MOVE *BLANK    L9YBCD
     C                     MOVE *BLANK    L9RAIN
     C                     Z-ADD0         L9CBKO
     C                     MOVE *BLANK    L9MEKI
     C                     Z-ADD0         L9BARA
     C                     Z-ADD0         L9BARB
     C                     MOVE *BLANK    L9JOK3
     C                     MOVE *BLANK    L9JOK4
     C                     MOVE *BLANK    L9JOK5
     C                     MOVE *BLANK    L9JOK6
     C                     Z-ADD0         L9SINS
     C                     Z-ADD0         L9SSYS
     C                     MOVE *BLANK    L9SSYT
     C                     Z-ADD0         L9KISU
     C                     Z-ADD0         L9YKLT
     C                     Z-ADD0         L9MKLT
     C                     Z-ADD0         L9KNTN
      *
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PPHIN1    L9SHN1           ﾆﾞﾃcmb ﾍ]ﾌﾞ] 5
     C                     MOVE PPHIN2    L9SHN2                        5
     C                     MOVE PPHIN3    L9SHN3                        2
     C                     MOVE PTKBI     L9TKBI
     C                     Z-ADDPPYO2Y    L9UKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     Z-ADDPPYO2M    L9UKMM           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     Z-ADDPPYO2D    L9UKDD           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     Z-ADDPPBIN2    L9UBIN           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     Z-ADD9999      L9STYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        L9STMM           ﾆｮﾃcﾍﾞ MM
     C                     Z-ADD99        L9STDD           ﾆｮﾃcﾍﾞ DD
     C                     Z-ADD99        L9SBIN           ﾆｮﾃcﾍﾞ ﾍﾞ]
      *
     C                     SETOF                     10
     C           AMKEY     CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C                     MOVE A2ZETI    L9ZETI
     C                     Z-ADDA2KASI    L9KNTN
     C                     MOVELA2MEKI    L9MEKI
     C                     END
      *
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     SETOF                     10
     C           AMKEY     CHAINAAMPL111             10    gﾒfd uﾇjｰ
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
      *
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     Z-ADD1         I       20
     C                     Z-ADD1         A
     C                     MOVE *BLANK    HSKT
     C                     MOVE *BLANK    TSKT
     C                     SETOF                     11
     C           XXBAN     LOKUPCBN,I                    11s]ﾃcﾃﾞﾌﾞ]kLOKUP
     C           *IN11     IFEQ '1'
     C                     Z-ADDI         Z       20
     C                     MOVE CKO,I     L9KTEI           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9BMON           ﾆﾞﾃcmb ﾎﾞy]
     C                     MOVE CKO,I     HSKT,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     L9MAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9SBMN           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     L9KTR            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C           CKO,I     IFEQ 'OQ '
     C                     MOVE CKO,I     L9YKOT           zgbﾛ ﾃemb
     C                     Z-ADDCBM,I     L9MBMN           zgbﾛ ﾎﾞy]
     C                     END
     C                     ADD  1         A
     C           A         IFLE 4
     C                     MOVE CKO,I     HSKT,A
     C                     END
     C                     END
     C                     END
     C  N11                END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD5         B
     C                     Z-ADD0         C       20
     C           1         DO   4         A
     C                     SUB  1         B
     C           HSKT,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HSKT,B    TSKT,C
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    L9TKR1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    L9TKR2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    L9TKR3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    L9TKR4           ﾆﾞﾃcmb ﾌﾞ]k 4
     C                     Z-ADDPPSETT    L9KSSU           ibﾅ] ﾈｮmbﾇc
     C                     Z-ADDPPSETT    L9KTSU           fhmb ﾈｮmbﾇc
      *
     C           PPKUB     IFEQ '13'
     C                     MOVE 'D'       L9DTKO           mﾞｰj ﾃcﾆ]方法
     C                     ELSE
     C                     MOVE '2'       L9DTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C                     MOVE *BLANK    L9DTHE           mﾞｰj s]ﾃc hﾎﾞ]
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     MOVE CJKDAI    L9KCD1           f]ﾌﾞ] ﾆｬﾓb jﾞb
     C                     MOVE CJKSYO    L9KCD2           f]ﾌﾞ] ﾆｬﾓb ﾆｭc
     C                     END
     C           *IN30     IFEQ '1'
     C                     WRITEAAXPL101                   rlﾆｭﾒxｮg f]ﾌﾞ] ﾇjｰ
     C                     ELSE
     C                     UPDATAAXPL101
     C                     END
      *
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY           ag ﾌﾞ]k ﾍlﾞi Y
     C                     Z-ADD0         CJAKMM           ag ﾌﾞ]k ﾍlﾞi M
     C                     Z-ADD0         CJAKDD           ag ﾌﾞ]k ﾍlﾞi D
     C                     MOVE L9SHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE L9SHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE L9SHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE L9KTR1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE L9KTR2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE L9KTR3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE L9KTR4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##2P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 03 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 04 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 11 gｬc ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ uboﾇﾇﾓ                        *
     C* 12 ﾆ]  ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ ﾎﾟ[ﾇﾇﾓ                        *
     C*---------------------------------------------------------------*
     C           ##3       BEGSR
      *
     C                     Z-ADD0         WSYUY   50
     C                     Z-ADD0         WSLOT   90
     C                     Z-ADD0         WOUKBI
     C                     Z-ADD0         WNUKBI 100
     C           FLKEY     SETGTAAXPL101
      *
     C           ##XX1     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##XX1
     C                     END
     C                     END
      *
     C           *IN10     IFEQ '0'
      *
     C           PPKUB     IFEQ '11'
     C           POHIN     IFNE L9SHIN
     C                     GOTO ##XX1
     C                     END
      *
     C                     Z-ADDL9KSSU    WKSSU   90
     C           L9KSSU    SUB  PPSETT    L9KSSU
     C           WKSSU     IFEQ L9KSSU
     C                     GOTO ##3P1
     C                     END
     C                     MOVE '3'       L9DTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE *BLANK    L9DTHE            mﾞｰj s]ﾃc hﾎﾞ]
     C                     END
      *
     C           PPKUB     IFEQ '12'
     C           POHIN     IFNE L9SHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           PPSETT    IFEQ L9KSSU
     C                     GOTO ##3P1
     C                     END
     C                     Z-ADDPPSETT    L9KSSU
     C                     MOVE '3'       L9DTKO
     C                     MOVE *BLANK    L9DTHE
     C                     END
      *
     C           PPKUB     IFNE '11'
     C           PPKUB     ANDNE'12'
      *
     C           POHIN     IFNE L9SHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           L9STHZ    IFNE 99999999
     C                     GOTO ##3X1
     C                     END
      *
     C                     Z-ADDL9UKBI    WOUKBI
     C                     MOVE '7'       L9DTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       L9DTHE            mﾞｰj s]ﾃc hﾎﾞ]
     C                     Z-ADDL9UKBI    L9TKBI
     C                     MOVE L9TKBI    PTKBI
     C                     Z-ADDPPYO2Y    L9STYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    L9STMM                  MM
     C                     Z-ADDPPYO2D    L9STDD                  DD
     C                     Z-ADDPPBIN2    L9SBIN                  ﾍﾞ]
     C                     END
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAAXPL101
      *
     C           PPKUB     IFEQ '11'
     C           PPKUB     OREQ '12'
     C                     GOTO ##3P1
     C                     END
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDL9STYY    CJAKYY
     C                     Z-ADDL9STMM    CJAKMM
     C                     Z-ADDL9STDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
     C                     END
     C           ##3X1     TAG
      *
     C           VLKEY     SETGTAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           VLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C           L9STBI    IFEQ 9999999999
      *
     C           L9UKBI    IFEQ PPYOU2
     C                     GOTO ##3P1
     C                     END
      *
     C                     Z-ADDL9UKBI    WNUKBI
     C                     MOVE '7'       L9DTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       L9DTHE            mﾞｰj s]ﾃc hﾎﾞ]
     C                     Z-ADDL9UKBI    L9TKBI
     C                     MOVE L9TKBI    PTKBI
     C                     Z-ADDPPYO2Y    L9STYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    L9STMM                  MM
     C                     Z-ADDPPYO2D    L9STDD                  DD
     C                     Z-ADDPPBIN2    L9SBIN                  ﾍﾞ]
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
      *
     C                     UPDATAAXPL101
      *
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           WOUKBI    IFEQ 0
     C           WNUKBI    ANDEQ0
     C                     EXSR ##2
     C                     GOTO ##3P1
     C                     END
      *
     C*-------------*
     C*   gｬcﾌﾞ]k   *
     C*-------------*
     C           WNUKBI    IFEQ 0
     C                     SETOF                     30
     C           FLKEY3    CHAINAAXPL101             30
     C                     END
      *
     C*-------------*
     C*   ﾆ]ﾌﾞ]k    *
     C*-------------*
     C                     SETOF                     30
     C           FPKEY3    CHAINAAXPL101             30
      *
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PTKBI     L9TKBI
     C                     Z-ADDPPYO2Y    L9UKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞ Y
     C                     Z-ADDPPYO2M    L9UKMM                         M
     C                     Z-ADDPPYO2D    L9UKDD                         D
     C                     Z-ADDPPBIN2    L9UBIN                         ﾍﾞ]
     C                     Z-ADD9999      L9STYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        L9STMM                  MM
     C                     Z-ADD99        L9STDD                  DD
     C                     Z-ADD99        L9SBIN                  ﾍﾞ]
     C                     MOVE PPBN21    L9TKR1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    L9TKR2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    L9TKR3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    L9TKR4           ﾆﾞﾃcmb ﾌﾞ]k 4
     C                     MOVE PPHIN1    L9SHN1           ﾆﾞﾃcmb ﾍ]ﾌﾞ] 5
     C                     MOVE PPHIN2    L9SHN2                        5
     C                     MOVE PPHIN3    L9SHN3                        2
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    L9ZETI
     C           AMKEY     CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C                     MOVE A2ZETI    L9ZETI
     C                     Z-ADDA2KASI    L9KNTN
     C                     MOVELA2MEKI    L9MEKI
     C                     END
      *
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    L9KTEI
     C                     Z-ADD0         L9BMON
     C                     MOVE *BLANK    L9MAEK
     C                     Z-ADD0         L9SBMN
     C                     MOVE *BLANK    L9KTR
     C                     SETOF                     10
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
      *
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     Z-ADD1         I
     C                     Z-ADD1         A
     C                     MOVE *BLANK    HSKT
     C                     MOVE *BLANK    TSKT
     C                     SETOF                     11
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     L9KTEI           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9BMON           ﾆﾞﾃcmb ﾎﾞy]
     C                     MOVE CKO,I     HSKT,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     L9MAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9SBMN           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     L9KTR            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C           CKO,I     IFEQ 'OQ '
     C                     MOVE CKO,I     L9YKOT           zgbﾛ ﾃcmb
     C                     Z-ADDCBM,I     L9MBMN           zgbﾛ ﾎﾞy]
     C                     END
     C                     ADD  1         A
     C           A         IFLE 4
     C                     MOVE CKO,I     HSKT,A
     C                     END
     C                     END
     C                     END
     C  N11                END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD5         B
     C                     Z-ADD0         C
     C           1         DO   4         A
     C                     SUB  1         B
     C           HSKT,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HSKT,B    TSKT,C
     C                     END
     C                     END
      *
     C                     Z-ADDPPSETT    L9KSSU           ibﾅ] ﾈｮmb ﾇc
      *
     C           PPKUB     IFEQ '03'
     C                     MOVE '6'       L9DTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C           PPKUB     IFEQ '04'
     C                     MOVE 'A'       L9DTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
      *
     C                     MOVE *BLANK    L9DTHE           mﾞｰj s]ﾃc hﾎﾞ]
     C                     MOVE *BLANK    L9KCD1           mﾞｰj s]ﾃc hﾎﾞ]
     C                     MOVE *BLANK    L9KCD2           mﾞｰj s]ﾃc hﾎﾞ]
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     MOVE CJKDAI    L9KCD1           f]ﾌﾞ] ﾆｬﾓb jﾞb
     C                     MOVE CJKSYO    L9KCD2           f]ﾌﾞ] ﾆｬﾓb ﾆｭc
     C                     END
     C           *IN30     IFEQ '0'
     C                     UPDATAAXPL101
     C                     ELSE
     C                     WRITEAAXPL101                   rlﾆｭﾒxｮg f]ﾌﾞ] ﾇjｰ
     C                     END
      *
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE L9SHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE L9SHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE L9SHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE L9KTR1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE L9KTR2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE L9KTR3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE L9KTR4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##3P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 05 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 06 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 09 s]ﾃcud s]ﾃcﾃﾞ mﾞ f]ﾌﾞ] ﾆｬﾓb jﾞifﾞ fﾝｮj                     *
     C*---------------------------------------------------------------*
     C           ##5       BEGSR
      *
     C           FLKEY     SETGTAAXPL101
     C           ##XX2     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##XX2
     C                     END
      *
     C           L9STBI    IFNE 9999999999
     C           PPYOU2    IFLT L9STBI
     C                     GOTO ##5P1
     C                     END
     C                     END
      *
     C           POHIN     IFNE PKSHIN
     C                     GOTO ##5P1
     C                     END
      *
     C                     Z-ADDL9UKBI    L9TKBI
     C                     MOVE L9TKBI    PTKBI
     C                     Z-ADDPPYO2Y    L9STYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    L9STMM                  MM
     C                     Z-ADDPPYO2D    L9STDD                  DD
     C                     Z-ADDPPBIN2    L9SBIN                  ﾍﾞ]
     C                     MOVE '7'       L9DTKO
     C                     MOVE *BLANK    L9DTHE            mﾞｰj s]ﾃc hﾎﾞ]
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAAXPL101
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDL9STYY    CJAKYY
     C                     Z-ADDL9STMM    CJAKMM
     C                     Z-ADDL9STDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##5P1     ENDSR
      *
      *
     C*-------------------------*
     C*   07   ﾏcﾃcﾍﾞ ﾉ ﾆｬcﾈb   *
     C*-------------------------*
     C           ##7       BEGSR
      *
     C                     Z-ADD0         WSYUY
     C                     Z-ADD0         WSLOT
     C           FLKEY     SETGTAAXPL101
     C           ##XX3     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##XX3
     C                     END
      *
     C           L9STBI    IFNE 9999999999
     C           PPYOU2    IFLT L9UKBI
     C                     GOTO ##7P1
     C                     END
     C                     END
      *
     C                     MOVE '6'       L9DTKO
     C                     MOVE *BLANK    L9DTHE
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDPPYOU2    L9UKBI
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    L9ZETI
     C           AMKEY     CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C                     MOVE A2ZETI    L9ZETI
     C                     Z-ADDA2KASI    L9KNTN
     C                     MOVELA2MEKI    L9MEKI
     C                     END
      *
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    L9KTEI
     C                     Z-ADD0         L9BMON
     C                     MOVE *BLANK    L9MAEK
     C                     Z-ADD0         L9SBMN
     C                     MOVE *BLANK    L9KTR
     C                     SETOF                     10
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
      *
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     Z-ADD1         I
     C                     Z-ADD1         A
     C                     MOVE *BLANK    HSKT
     C                     MOVE *BLANK    TSKT
     C                     SETOF                     11
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     L9KTEI           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9BMON           ﾆﾞﾃcmb ﾎﾞy]
     C                     MOVE CKO,I     HSKT,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     L9MAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     L9SBMN           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     L9KTR            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C           CKO,I     IFEQ 'OQ '
     C                     MOVE CKO,I     L9YKOT           zgbﾛ ﾃcmb
     C                     Z-ADDCBM,I     L9MBMN           zgbﾛ ﾎﾞy]
     C                     END
     C                     ADD  1         A
     C           A         IFLE 4
     C                     MOVE CKO,I     HSKT,A
     C                     END
     C                     END
     C                     END
     C  N11                END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD5         B
     C                     Z-ADD0         C
     C           1         DO   4         A
     C                     SUB  1         B
     C           HSKT,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HSKT,B    TSKT,C
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    L9TKR1
     C                     MOVE PPBN22    L9TKR2
     C                     MOVE PPBN23    L9TKR3
     C                     MOVE PPBN24    L9TKR4
     C                     MOVE PPHIN1    L9SHN1
     C                     MOVE PPHIN2    L9SHN2
     C                     MOVE PPHIN3    L9SHN3
     C                     UPDATAAXPL101
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDL9UKYY    CJAKYY
     C                     Z-ADDL9UKMM    CJAKMM
     C                     Z-ADDL9UKDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C           YLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           YLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE L9SHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE L9SHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE L9SHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE L9KTR1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE L9KTR2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE L9KTR3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE L9KTR4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##X31     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##X31
     C                     END
     C           PPYOU2    IFNE L9STBI
      *
     C                     MOVE '7'       L9DTKO
     C                     MOVE '*'       L9DTHE
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDL9UKBI    L9TKBI
     C                     MOVE L9TKBI    PTKBI
     C                     Z-ADDPPYOU2    L9STBI
     C                     UPDATAAXPL101
     C                     END
     C                     END
      *
     C           FLKEY     SETGTAAXPL101
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           POHIN     IFEQ L9SHIN
     C                     MOVE PTKBI     L9TKBI
     C                     UPDATAAXPL101
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C           ##7P1     ENDSR
      *
      *
     C*----------------------------------*
     C* 08 f]ﾌﾞ]ﾆｬﾓb ﾉ ﾆｬcﾈb             *
     C*----------------------------------*
     C           ##8       BEGSR
      *
     C           FLKEY     SETGTAAXPL101
     C           ##XX4     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     GOTO ##XX4
     C                     END
      *
     C           L9STBI    IFNE 9999999999
     C           PPYOU2    IFLT L9STBI
     C                     GOTO ##8P1
     C                     END
     C                     END
      *
     C                     MOVE '7'       L9DTKO
     C                     MOVE *BLANK    L9DTHE
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDL9UKBI    L9TKBI
     C                     MOVE L9TKBI    PTKBI
     C                     Z-ADDPPYOU2    L9STBI
     C                     UPDATAAXPL101
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDL9STYY    CJAKYY
     C                     Z-ADDL9STMM    CJAKMM
     C                     Z-ADDL9STDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##8P1     ENDSR
      *
      *
     C*----------------------------------*
     C* 10 s]ﾃcud s]ﾃcﾃﾞ fﾝ[ob ng        *
     C*----------------------------------*
     C           ##10      BEGSR
      *
     C                     SETOF                     10
     C           FPKEY3    CHAINAAXPL101             10
     C           *IN10     IFEQ '0'
     C           L9SKJY    ANDEQ'D'
     C           L9SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
      *
     C           #UKBI     IFEQ 0
     C                     EXSR ##2
     C                     ELSE
      *
     C           PPYOU2    IFLT #UKBI
     C                     GOTO ##10P1
     C                     END
      *
     C           PPYOU2    IFGT #UKBI
     C                     EXSR ##7
     C                     END
     C                     END
     C                     ELSE
      *
     C                     MOVE *BLANK    L9DTHE           mﾞｰj s]ﾃc hﾎﾞ]
     C           PPSETT    IFNE L9KTSU
     C                     MOVE '3'       L9DTKO
     C                     END
     C                     Z-ADDPPSETT    L9KSSU
      *
     C                     Z-ADD*DATE     L9KOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           L9TIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    L9KOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAAXPL101
     C                     END
      *
     C           ##10P1    ENDSR
      *
      *
     C*----------------------------------*
     C* ﾏcﾃcﾍﾞ f]ﾌﾞ]ﾆｬﾓb ﾉ kｩｮh          *
     C*----------------------------------*
     C           SUBRTN    BEGSR
      *
     C           FLKEY     SETGTAAXPL101
     C                     SETOF                     10
     C                     READPAAXPL101                 10
     C           *IN10     IFEQ '0'
     C                     UPDATAAXPL101
     C           POTKR     IFEQ L9TKRO
     C           PPYOU2    ANDNEL9UKBI
     C                     MOVE '03'      PPKUB
     C           PPOKCD    IFNE PPNKCD
     C                     MOVE '05'      PPKUB
     C                     END
     C                     END
     C                     END
      *
     C                     ENDSR
      *
     C*------------------------------------*
     C*     ﾏcﾃcﾍﾞﾍﾇﾞi 0 ﾆﾞﾉ ﾏcﾃcﾍﾞﾈｮn     *
     C*------------------------------------*
     C           SBHZ      BEGSR
      *
     C                     Z-ADD0         #UKBI  100
     C                     Z-ADD0         #STBI  100
      *
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     SETGTAAXPL101
     C                     ELSE
     C           FLKEY     SETGTAAXPL101
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     REDPEAAXPL101                 10
     C                     ELSE
     C           FLKEY     REDPEAAXPL101                 10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           L9SKJY    IFEQ 'D'
     C           L9SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     Z-ADDL9UKBI    #UKBI
     C                     Z-ADDL9STBI    #STBI
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     ENDSR
