     H            Y.
     F** AAVR36 *****************************************
     F* .. PURCHASING TUNNEL KANBAN M/F KEY CHANGE .. *.
     F* I-HASADA                        92.03.03        *
     F***************************************** AAVR36 **
     FAAMPL11 IF  E           K        DISK
     FAEAPL03 UF  E           K        DISK                      A
     FAAJPL11 UF  E           K        DISK
     E                    KKO        15  3               新工程
     E                    KBM        15  4 0             新部門
     E                    KBN        15  6               新所番地
     E                    CKO        15  3               工程WORK
     E                    CBM        15  4 0             部門WORK
     E                    CBN        15  6               所番地WORK
     E                    @KT         7  3               工程WORK
     E                    @BM         7  4 0             部門WORK
     E                    HKT         7  3               工程
     E                    HBM         7  4 0             部門
     E                    TB1     1   1  4 0 TB2     4 0 受入工場
     E                    TB3     1   1  4 0 TB4     4   受入
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 KBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  100PPYOU2
     I                                        1   80PPYYMD
     I                                        1   40PPYO2Y
     I                                        5   60PPYO2M
     I                                        7   80PPYO2D
     I                                        9  100PPBIN2
     I            DS
     I                                        1   6 XXBAN
     I                                        1   1 XXBAN1
     I                                        2   3 XXBAN2
     I                                        4   5 XXBAN3
     I                                        6   6 XXBAN4
     I            DS
     I                                        1   6 AEMTK
     I                                        1   1 AEMTK1
     I                                        2   3 AEMTK2
     I                                        4   5 AEMTK3
     I                                        6   6 AEMTK4
     I            DS
     I                                        1   6 AEATKR
     I                                        1   1 AEATK1
     I                                        2   3 AEATK2
     I                                        4   5 AEATK3
     I                                        6   6 AEATK4
     I            DS
     I                                        1  12 AESHIN
     I                                        1   5 AESHN1
     I                                        6  10 AESHN2
     I                                       11  12 AESHN3
     I            DS
     I                                        1   6 POTKR
     I                                        1   1 PPBN11
     I                                        2   3 PPBN12
     I                                        4   5 PPBN13
     I                                        6   6 PPBN14
     I            DS
     I                                        1   6 PNTKR
     I                                        1   1 PPBN21
     I                                        2   3 PPBN22
     I                                        4   5 PPBN23
     I                                        6   6 PPBN24
     I            DS
     I                                        1   80AESKHZ
     I                                        1   40AESKYY
     I                                        5   60AESKMM
     I                                        7   80AESKDD
     I            DS
     I                                        1   80AEKOHZ
     I                                        1   40AEKOYY
     I                                        5   60AEKOMM
     I                                        7   80AEKODD
     I            DS
     I                                        1   60AETIME
     I                                        1   20AEKOHH
     I                                        3   40AEKOSS
     I            DS
     I                                        1  100AEUKBI
     I                                        1   40AEUKYY
     I                                        5   60AEUKMM
     I                                        7   80AEUKDD
     I                                        9  100AEUBIN
     I            DS
     I                                        1  100AETKBI
     I                                        1   40AETKYY
     I                                        5   60AETKMM
     I                                        7   80AETKDD
     I                                        9  100AETBIN
     I            DS
     I                                        1  100AESTBI
     I                                        1   40AESTYY
     I                                        5   60AESTMM
     I                                        7   80AESTDD
     I                                        9  100AESBIN
     I            DS
     I                                        1  12 PPHIN
     I                                        1   5 PPHN1
     I                                        6  10 PPHN2
     I                                       11  12 PPHN3
     I            DS
     I                                        1  21 HKT
     I                                        1   3 AEKT01
     I                                        4   6 AEKT02
     I                                        7   9 AEKT03
     I                                       10  12 AEKT04
     I                                       13  15 AEKT05
     I                                       16  18 AEKT06
     I                                       19  21 AEKT07
     I            DS
     I                                        1  280HBM
     I                                        1   40AEBM01
     I                                        5   80AEBM02
     I                                        9  120AEBM03
     I                                       13  160AEBM04
     I                                       17  200AEBM05
     I                                       21  240AEBM06
     I                                       25  280AEBM07
     I            DS
     I                                        1  100WOUKBI
     I                                        1   40WOUKYY
     I                                        5   60WOUKMM
     I                                        7   80WOUKDD
     I                                        9  100WOUBIN
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
      *
     C           FLKEY     KLIST
     C                     KFLD           PPBN11           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN12           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN13           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN14           s]ﾃc ud ﾌﾞ]k 4
      *
     C           FLKEY3    KLIST
     C                     KFLD           PPBN11
     C                     KFLD           PPBN12
     C                     KFLD           PPBN13
     C                     KFLD           PPBN14
     C                     KFLD           WOUKYY
     C                     KFLD           WOUKMM
     C                     KFLD           WOUKDD
     C                     KFLD           WOUBIN
      *
     C           FPKEY3    KLIST
     C                     KFLD           PPBN21
     C                     KFLD           PPBN22
     C                     KFLD           PPBN23
     C                     KFLD           PPBN24
     C                     KFLD           PPYO2Y
     C                     KFLD           PPYO2M
     C                     KFLD           PPYO2D
     C                     KFLD           PPBIN2
      *
     C           AMKEY     KLIST
     C                     KFLD           PPHIN1
     C                     KFLD           PPHIN2
     C                     KFLD           PPHIN3
      *
     C           VLKEY     KLIST
     C                     KFLD           PPBN21           s]ﾃc ud ﾌﾞ]k 1
     C                     KFLD           PPBN22           s]ﾃc ud ﾌﾞ]k 2
     C                     KFLD           PPBN23           s]ﾃc ud ﾌﾞ]k 3
     C                     KFLD           PPBN24           s]ﾃc ud ﾌﾞ]k 4
      *
     C           YLKEY     KLIST
     C                     KFLD           AEATK1
     C                     KFLD           AEATK2
     C                     KFLD           AEATK3
     C                     KFLD           AEATK4
      *
     C           *ENTRY    PLIST
     C                     PARM           PPOKCD  1        s]ﾃcud f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN11  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN12  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN13  2        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PMBN14  1        s]ﾃcud nﾃﾜﾌﾞ]k
     C                     PARM           PPNKCD  1        s]ﾃcﾃﾞ f]ﾌﾞ]ﾆｬﾓb
     C                     PARM           PMBN21  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN22  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN23  2        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PMBN24  1        s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PAYO2Y  4        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     PARM           PAYO2M  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     PARM           PAYO2D  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     PARM           PABIN2  2        s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     PARM           POHIN  12        s]ﾃcud ﾍ]ﾌﾞ]
     C                     PARM           PPHIN1  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 1
     C                     PARM           PPHIN2  5        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 2
     C                     PARM           PPHIN3  2        s]ﾃcﾃﾞ ﾍ]ﾌﾞ] 3
     C                     PARM           PASETT  9        ﾈｮmb ﾇc
     C                     PARM           PPKUB   2        ﾃcﾆ] hﾎﾞ]
     C                     PARM           PZKMS   3        ud ﾉ f]ﾌﾞ] ubﾇc
     C                     PARM           PPUSEC 10        ﾏｰﾅﾞｰxb
     C                     PARM           PTKBI  10        ud ﾉ ﾆｬｮﾃcﾍﾞ
     C                     PARM           PKSHIN 12        ﾆｫobﾍ]ﾌﾞ]
      *
     C                     MOVE PMBN11    PPBN11
     C                     MOVE PMBN12    PPBN12
     C                     MOVE PMBN13    PPBN13
     C                     MOVE PMBN14    PPBN14
     C                     MOVE PMBN21    PPBN21
     C                     MOVE PMBN22    PPBN22
     C                     MOVE PMBN23    PPBN23
     C                     MOVE PMBN24    PPBN24
     C                     MOVE PAYO2Y    PPYO2Y
     C                     MOVE PAYO2M    PPYO2M
     C                     MOVE PAYO2D    PPYO2D
     C                     MOVE PABIN2    PPBIN2
     C                     MOVE PPBN21    XXBAN1           s]ﾃcﾃﾞ nﾃﾜﾌﾞ]k
     C                     MOVE PPBN22    XXBAN2
     C                     MOVE PPBN23    XXBAN3
     C                     MOVE PPBN24    XXBAN4
     C                     MOVE PPHIN1    PPHN1
     C                     MOVE PPHIN2    PPHN2
     C                     MOVE PPHIN3    PPHN3
     C                     MOVE PASETT    PPSETT  90
      *
     C                     Z-ADD0         AESKHZ
     C                     EXSR SBHZ
      *
      *
     C           PPYYMD    IFEQ 0
     C           PPKUB     IFNE '02'
     C           PPKUB     ANDNE'13'
     C                     Z-ADD#UKBI     PPYOU2
     C                     END
     C                     END
      *
     C           PPYYMD    IFEQ 0
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *
     C           PPKUB     IFEQ '04'
     C           PPKUB     OREQ '09'
     C                     EXSR SUBRTN
     C                     END
      *
      *
     C           PPKUB     IFEQ '10'
     C           #UKBI     IFNE 0
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '03'      PPKUB
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '02'
     C           PPKUB     OREQ '13'
      *
     C           #UKBI     IFNE 0
     C           PPYOU2    IFLT #UKBI
     C                     SETON                     LR
     C                     RETRN
     C                     ELSE
      *
     C           #STBI     IFEQ 9999999999
     C           PPYOU2    IFGT #UKBI
     C                     MOVE '07'      PPKUB
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     IFEQ '03'
     C           PPKUB     OREQ '04'
     C           PPKUB     OREQ '11'
     C           PPKUB     OREQ '12'
      *
     C           #STBI     IFNE 0
     C           #STBI     ANDNE9999999999
     C           PPYOU2    IFLT #STBI
     C                     Z-ADD#STBI     PPYOU2
     C                     END
     C                     END
     C                     END
      *
      *
     C           PPKUB     CASEQ'01'      ##1
     C           PPKUB     CASEQ'02'      ##2
     C           PPKUB     CASEQ'03'      ##3
     C           PPKUB     CASEQ'04'      ##3
     C           PPKUB     CASEQ'05'      ##5
     C           PPKUB     CASEQ'06'      ##5
     C           PPKUB     CASEQ'07'      ##7
     C           PPKUB     CASEQ'08'      ##8
     C           PPKUB     CASEQ'09'      ##5
     C           PPKUB     CASEQ'10'      ##10
     C           PPKUB     CASEQ'11'      ##3
     C           PPKUB     CASEQ'12'      ##3
     C           PPKUB     CASEQ'13'      ##2
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*---------------------------------------------------------------*
     C* 01 nﾒiﾆ                                                       *
     C*---------------------------------------------------------------*
     C           ##1       BEGSR
      *
     C* ofﾞﾛf]ﾌﾞ] uﾇjｰ ﾃcﾆ]
     C           FLKEY     SETLLAEAPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     READEAEAPL031                 10ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    CABLE*DATE     STP01
     C                     END
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE '0'       AEDTKO           mﾞｰj ﾃcﾆ]方法
     C           AESTHZ    IFNE 99999999
     C                     MOVE '*'       AEDTHE
     C                     ELSE
     C                     MOVE *BLANK    AEDTHE
     C                     Z-ADDPPYO2Y    AESTYY
     C                     Z-ADDPPYO2M    AESTMM
     C                     Z-ADDPPYO2D    AESTDD
     C                     Z-ADDPPBIN2    AESBIN
     C                     END
     C                     UPDATAEAPL031
     C                     END
     C           STP01     TAG
     C  N10                END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ ﾃcﾆ]
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C           PPYYMD    IFGT *DATE
     C                     Z-ADDPPYYMD    CJAKHZ
     C                     ELSE
     C                     Z-ADD*DATE     CJAKHZ
     C                     END
     C                     MOVE *BLANK    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE *BLANK    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE *BLANK    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE *BLANK    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE *BLANK    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE *BLANK    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE *BLANK    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C                     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 02  lbf                                                       *
     C* 13  f]ﾌﾞ]ﾆｬﾓb s]ﾃc lbf                                        *
     C*---------------------------------------------------------------*
     C           ##2       BEGSR
      *
     C           PNTKR     IFEQ *BLANK
     C                     GOTO ##2P1
     C                     END
      *
     C                     SETOF                     30
     C           FPKEY3    CHAINAEAPL031             30
     C           *IN30     IFEQ '0'
     C           AESKJY    ANDEQ'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##2P2
     C                     END
     C           *IN30     IFEQ '0'
     C           AESTHZ    ANDEQ99999999
     C                     GOTO ##2P1
     C                     END
     C           ##2P2     TAG
      *
     C                     MOVE *BLANK    AESKJY
     C                     Z-ADD0         AESKHZ
     C                     Z-ADD0         AEKOHZ
     C                     Z-ADD0         AETIME
     C                     MOVE *BLANK    AEKOME
     C                     MOVE *BLANK    AESHN1
     C                     MOVE *BLANK    AESHN2
     C                     MOVE *BLANK    AESHN3
     C                     Z-ADD0         AEUKYY
     C                     Z-ADD0         AEUKMM
     C                     Z-ADD0         AEUKDD
     C                     Z-ADD0         AEUBIN
     C                     Z-ADD0         AESTYY
     C                     Z-ADD0         AESTMM
     C                     Z-ADD0         AESTDD
     C                     Z-ADD0         AESBIN
     C                     MOVE *BLANK    AEATOK
     C                     Z-ADD0         AEATOB
     C                     MOVE *BLANK    AEATK1
     C                     MOVE *BLANK    AEATK2
     C                     MOVE *BLANK    AEATK3
     C                     MOVE *BLANK    AEATK4
     C                     MOVE *BLANK    AEMAEK
     C                     Z-ADD0         AEMAKB
     C                     MOVE *BLANK    AEMTK1
     C                     MOVE *BLANK    AEMTK2
     C                     MOVE *BLANK    AEMTK3
     C                     MOVE *BLANK    AEMTK4
     C                     Z-ADD0         AESTCD
     C                     Z-ADD0         AESYOS
     C                     MOVE *BLANK    AESYOT
     C                     Z-ADD0         AEKALL
     C                     Z-ADD0         AEKMIN
     C                     Z-ADD0         AEKMAX
     C                     Z-ADD0         AEKTSU
     C                     Z-ADD0         AEKSSU
     C                     MOVE *BLANK    AEDTKO
     C                     MOVE *BLANK    AEDTHE
     C                     Z-ADD0         AELOTO
     C                     Z-ADD0111      AEUKOJ
     C                     MOVE '01  '    AEUKER
      *
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PPHIN1    AESHN1           ﾆﾞﾃcmb ﾍ]ﾌﾞ] 5
     C                     MOVE PPHIN2    AESHN2                        5
     C                     MOVE PPHIN3    AESHN3                        2
     C                     MOVE PTKBI     AETKBI
     C                     Z-ADDPPYO2Y    AEUKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞY
     C                     Z-ADDPPYO2M    AEUKMM           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞM
     C                     Z-ADDPPYO2D    AEUKDD           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞD
     C                     Z-ADDPPBIN2    AEUBIN           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞﾍﾞ]
     C                     Z-ADD9999      AESTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        AESTMM           ﾆｮﾃcﾍﾞ MM
     C                     Z-ADD99        AESTDD           ﾆｮﾃcﾍﾞ DD
     C                     Z-ADD99        AESBIN           ﾆｮﾃcﾍﾞ ﾍﾞ]
      *
     C                     SETOF                     10
     C                     Z-ADD8         X       10
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C           AMKEY     CHAINAAMPL111             10    gﾒfd uﾇjｰ
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11s]ﾃcﾃﾞﾌﾞ]kLOKUP
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z       20
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AEATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AEMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AEMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AEUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AEUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y       10
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    AEATK1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    AEATK2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    AEATK3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    AEATK4           ﾆﾞﾃcmb ﾌﾞ]k 4
      *
     C           AEUKOJ    IFEQ 8907
     C           AEATK1    IFNE 'G'
     C           AEATK1    ANDNE'S'
     C           AEATK1    ANDNE'7'
     C                     MOVE '03  '    AEUKER
     C                     END
     C                     END
      *
     C                     Z-ADDPPSETT    AEKSSU           ibﾅ] ﾈｮmbﾇc
     C                     Z-ADDPPSETT    AEKTSU           fhmb ﾈｮmbﾇc
      *
     C           PPKUB     IFEQ '13'
     C                     MOVE 'D'       AEDTKO           mﾞｰj ﾃcﾆ]方法
     C                     ELSE
     C                     MOVE '2'       AEDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C                     MOVE *BLANK    AEDTHE
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN30     IFEQ '1'
     C                     WRITEAEAPL031                   ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C                     ELSE
     C                     UPDATAEAPL031
     C                     END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY           ag ﾌﾞ]k ﾍlﾞi Y
     C                     Z-ADD0         CJAKMM           ag ﾌﾞ]k ﾍlﾞi M
     C                     Z-ADD0         CJAKDD           ag ﾌﾞ]k ﾍlﾞi D
     C                     MOVE AESHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AESHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AESHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     Z-ADD0         CJSYUY           ﾆｬcﾑc ﾇc
     C                     MOVE AEMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AEMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AEMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AEMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     Z-ADD0         CJSLOT           ﾈbﾅ] ﾜｮn
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##2P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 03 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 04 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb eoﾆﾞ)                       *
     C* 11 gｬc ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ uboﾇﾇﾓ                        *
     C* 12 ﾆ]  ezﾍ]ﾌﾞ] ﾉ s]ﾃc  ﾈｮmbﾇc ﾌ ﾎﾟ[ﾇﾇﾓ                        *
     C*---------------------------------------------------------------*
     C           ##3       BEGSR
      *
     C                     Z-ADD0         WSYUY   50
     C                     Z-ADD0         WSLOT   90
     C                     Z-ADD0         WOUKBI
     C                     Z-ADD0         WNUKBI 100
     C           FLKEY     SETGTAEAPL031
      *
     C           ##XX1     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##XX1
     C                     END
     C                     END
      *
     C           *IN10     IFEQ '0'
      *
     C           PPKUB     IFEQ '11'
     C           POHIN     IFNE AESHIN
     C                     GOTO ##XX1
     C                     END
      *
     C                     Z-ADDAEKSSU    WKSSU   90
     C           AEKSSU    SUB  PPSETT    AEKSSU
     C           WKSSU     IFEQ AEKSSU
     C                     GOTO ##3P1
     C                     END
     C                     MOVE '3'       AEDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE *BLANK    AEDTHE
     C                     END
      *
     C           PPKUB     IFEQ '12'
     C           POHIN     IFNE AESHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           PPSETT    IFEQ AEKSSU
     C                     GOTO ##3P1
     C                     END
     C                     Z-ADDPPSETT    AEKSSU
     C                     MOVE '3'       AEDTKO
     C                     MOVE *BLANK    AEDTHE
     C                     END
      *
     C           PPKUB     IFNE '11'
     C           PPKUB     ANDNE'12'
      *
     C           POHIN     IFNE AESHIN
     C                     GOTO ##XX1
     C                     END
      *
     C           AESTHZ    IFNE 99999999
     C                     GOTO ##3X1
     C                     END
      *
     C                     Z-ADDAEUKBI    WOUKBI
     C                     MOVE '7'       AEDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       AEDTHE
     C                     Z-ADDAEUKBI    AETKBI
     C                     MOVE AETKBI    PTKBI
     C                     Z-ADDPPYO2Y    AESTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AESTMM                  MM
     C                     Z-ADDPPYO2D    AESTDD                  DD
     C                     Z-ADDPPBIN2    AESBIN                  ﾍﾞ]
     C                     END
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAEAPL031
      *
     C           PPKUB     IFEQ '11'
     C           PPKUB     OREQ '12'
     C                     GOTO ##3P1
     C                     END
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDAESTYY    CJAKYY
     C                     Z-ADDAESTMM    CJAKMM
     C                     Z-ADDAESTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
     C                     END
     C           ##3X1     TAG
      *
     C           VLKEY     SETGTAEAPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           VLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C           AESTBI    IFEQ 9999999999
      *
     C           AEUKBI    IFEQ PPYOU2
     C                     GOTO ##3P1
     C                     END
      *
     C                     Z-ADDAEUKBI    WNUKBI
     C                     MOVE '7'       AEDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE '*'       AEDTHE
     C                     Z-ADDAEUKBI    AETKBI
     C                     MOVE AETKBI    PTKBI
     C                     Z-ADDPPYO2Y    AESTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AESTMM                  MM
     C                     Z-ADDPPYO2D    AESTDD                  DD
     C                     Z-ADDPPBIN2    AESBIN                  ﾍﾞ]
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
      *
     C                     UPDATAEAPL031
      *
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           WOUKBI    IFEQ 0
     C           WNUKBI    ANDEQ0
     C                     EXSR ##2
     C                     GOTO ##3P1
     C                     END
      *
     C*-------------*
     C*   gｬcﾌﾞ]k   *
     C*-------------*
     C           WNUKBI    IFEQ 0
     C                     SETOF                     30
     C           FLKEY3    CHAINAEAPL031             30
     C                     END
      *
     C*-------------*
     C*   ﾆ]ﾌﾞ]k    *
     C*-------------*
     C                     SETOF                     30
     C           FPKEY3    CHAINAEAPL031             30
      *
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE PTKBI     AETKBI
     C                     Z-ADDPPYO2Y    AEUKYY           s]ﾃcﾃﾞ ﾏcﾃcﾍﾞ Y
     C                     Z-ADDPPYO2M    AEUKMM                         M
     C                     Z-ADDPPYO2D    AEUKDD                         D
     C                     Z-ADDPPBIN2    AEUBIN                         ﾍﾞ]
     C                     Z-ADD9999      AESTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADD99        AESTMM                  MM
     C                     Z-ADD99        AESTDD                  DD
     C                     Z-ADD99        AESBIN                  ﾍﾞ]
     C                     MOVE PPBN21    AEATK1           ﾆﾞﾃcmb ﾌﾞ]k 1
     C                     MOVE PPBN22    AEATK2           ﾆﾞﾃcmb ﾌﾞ]k 2
     C                     MOVE PPBN23    AEATK3           ﾆﾞﾃcmb ﾌﾞ]k 3
     C                     MOVE PPBN24    AEATK4           ﾆﾞﾃcmb ﾌﾞ]k 4
     C                     MOVE PPHIN1    AESHN1
     C                     MOVE PPHIN2    AESHN2
     C                     MOVE PPHIN3    AESHN3
      *
     C                     SETOF                     10
     C                     Z-ADD8         X
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C                     MOVE *BLANK    AEATOK
     C                     Z-ADD0         AEATOB
     C                     MOVE *BLANK    AEMAEK
     C                     Z-ADD0         AEMAKB
     C                     MOVE *BLANK    AEMTK
     C                     Z-ADD0111      AEUKOJ
     C                     MOVE '01  '    AEUKER
      *
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AEATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AEMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AEMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AEUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AEUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C           AEUKOJ    IFEQ 8907
     C           AEATK1    IFNE 'G'
     C           AEATK1    ANDNE'S'
     C           AEATK1    ANDNE'7'
     C                     MOVE '03  '    AEUKER
     C                     END
     C                     END
      *
     C                     Z-ADDPPSETT    AEKSSU           ibﾅ] ﾈｮmb ﾇc
      *
     C           PPKUB     IFEQ '03'
     C                     MOVE '6'       AEDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
     C           PPKUB     IFEQ '04'
     C                     MOVE 'A'       AEDTKO           mﾞｰj ﾃcﾆ]方法
     C                     END
      *
     C                     MOVE *BLANK    AEDTHE
      *
     C           VLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           VLKEY     REDPEAAJPL111                 10
     C           *IN30     IFEQ '0'
     C                     UPDATAEAPL031
     C                     ELSE
     C                     WRITEAEAPL031                   ofﾞﾛf]ﾌﾞ] uﾇjｰ
     C                     END
      *
     C* ﾃcmb ob ﾌﾞ]k uﾇjｰ
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE AESHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AESHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AESHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE AEMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AEMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AEMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AEMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##3P1     ENDSR
      *
      *
     C*---------------------------------------------------------------*
     C* 05 ﾏcﾃcﾍﾞ.ﾍﾞ] ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 06 nﾃﾜﾌﾞ]k    ﾉ s]ﾃc  (f]ﾌﾞ] ﾆｬﾓb kfﾞc)                       *
     C* 09 s]ﾃcud s]ﾃcﾃﾞ mﾞ f]ﾌﾞ] ﾆｬﾓb jﾞifﾞ fﾝｮj                     *
     C*---------------------------------------------------------------*
     C           ##5       BEGSR
      *
     C           FLKEY     SETGTAEAPL031
     C           ##XX2     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##XX2
     C                     END
      *
     C           AESTBI    IFNE 9999999999
     C           PPYOU2    IFLT AESTBI
     C                     GOTO ##5P1
     C                     END
     C                     END
      *
     C           POHIN     IFNE PKSHIN
     C                     GOTO ##5P1
     C                     END
      *
     C                     Z-ADDAEUKBI    AETKBI
     C                     MOVE AETKBI    PTKBI
     C                     Z-ADDPPYO2Y    AESTYY           ﾆｮﾃcﾍﾞ YY
     C                     Z-ADDPPYO2M    AESTMM                  MM
     C                     Z-ADDPPYO2D    AESTDD                  DD
     C                     Z-ADDPPBIN2    AESBIN                  ﾍﾞ]
     C                     MOVE '7'       AEDTKO            mﾞｰj ﾃcﾆ]方法
     C                     MOVE *BLANK    AEDTHE
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     MOVE AEKMAX    PZKMS            ud ﾉ f]ﾌﾞ] ubﾇc
     C                     UPDATAEAPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDAESTYY    CJAKYY
     C                     Z-ADDAESTMM    CJAKMM
     C                     Z-ADDAESTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##5P1     ENDSR
      *
      *
     C*-----------------------------------*
     C*   07   f]ﾌﾞ]ﾆｬﾓb eoﾆﾞ ﾉ ﾆｬcﾈb     *
     C*-----------------------------------*
     C           ##7       BEGSR
      *
     C                     Z-ADD0         WSYUY
     C                     Z-ADD0         WSLOT
     C           FLKEY     SETGTAEAPL031
     C           ##XX3     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##XX3
     C                     END
      *
     C           AESTBI    IFNE 9999999999
     C           PPYOU2    IFLT AEUKBI
     C                     GOTO ##7P1
     C                     END
     C                     END
      *
     C                     MOVE '6'       AEDTKO
     C                     MOVE *BLANK    AEDTHE
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDPPYOU2    AEUKBI
      *
     C                     SETOF                     10
     C                     Z-ADD8         X
     C                     MOVE *BLANK    CKO
     C                     Z-ADD0         CBM
     C                     MOVE *BLANK    CBN
     C                     MOVE *BLANK    @KT
     C                     Z-ADD0         @BM
     C                     MOVE *BLANK    AEATOK
     C                     Z-ADD0         AEATOB
     C                     MOVE *BLANK    AEMAEK
     C                     Z-ADD0         AEMAKB
     C                     MOVE *BLANK    AEMTK
     C                     Z-ADD0111      AEUKOJ
     C                     MOVE '01  '    AEUKER
      *
     C           AMKEY     CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           KKO,A     IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE KKO,A     CKO,B
     C                     Z-ADDKBM,A     CBM,B
     C                     MOVE KBN,A     CBN,B
     C                     END
     C                     END
      *
     C                     SETOF                     11
     C                     Z-ADD1         I       20
     C           XXBAN     LOKUPCBN,I                    11
     C           *IN11     IFEQ '1'
     C                     SUB  1         X
     C                     Z-ADDI         Z
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     MOVE CKO,I     AEATOK           ﾆﾞﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEATOB           ﾆﾞﾃcmb ﾎﾞy]
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
     C           CBN,I     IFNE '------'
     C           CBN,I     ANDNE'++++++'
     C                     MOVE CKO,I     AEMAEK           udﾃcmb ﾃcmb
     C                     Z-ADDCBM,I     AEMAKB           udﾃcmb ﾎﾞy]
     C                     MOVE CBN,I     AEMTK            udﾃcmb ﾌﾞ]k
     C                     SETON                     11
     C                     ELSE
     C                     SUB  1         X
     C                     MOVE CKO,I     @KT,X
     C                     Z-ADDCBM,I     @BM,X
     C                     END
     C                     END
     C  N11                END
      *
     C                     ADD  1         Z
     C           Z         IFLE 15
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB1,A                    11
     C           *IN11     IFEQ '1'
     C                     Z-ADDTB2,A     AEUKOJ           cibﾛ ﾃcﾆﾞｭc
     C                     END
     C                     SETOF                     11
     C                     Z-ADD1         A
     C           CBM,Z     LOKUPTB3,A                    11
     C           *IN11     IFEQ '1'
     C                     MOVE TB4,A     AEUKER           cibﾛ
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C                     Z-ADD0         Y
     C                     MOVE *BLANK    HKT
     C                     Z-ADD0         HBM
     C           1         DO   7         X
     C           @KT,X     IFNE *BLANK
     C                     ADD  1         Y
     C                     MOVE @KT,X     HKT,Y
     C                     Z-ADD@BM,X     HBM,Y
     C                     END
     C                     END
      *
     C                     MOVE PPBN21    AEATK1
     C                     MOVE PPBN22    AEATK2
     C                     MOVE PPBN23    AEATK3
     C                     MOVE PPBN24    AEATK4
     C                     MOVE PPHIN1    AESHN1
     C                     MOVE PPHIN2    AESHN2
     C                     MOVE PPHIN3    AESHN3
      *
     C           AEUKOJ    IFEQ 8907
     C           AEATK1    IFNE 'G'
     C           AEATK1    ANDNE'S'
     C           AEATK1    ANDNE'7'
     C                     MOVE '03  '    AEUKER
     C                     END
     C                     END
      *
     C                     UPDATAEAPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDCJSYUY    WSYUY
     C                     Z-ADDCJSLOT    WSLOT
     C                     Z-ADDAEUKYY    CJAKYY
     C                     Z-ADDAEUKMM    CJAKMM
     C                     Z-ADDAEUKDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C           YLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           YLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     Z-ADDWSYUY     CJSYUY
     C                     Z-ADDWSLOT     CJSLOT
     C                     MOVE AESHN1    CJHIN1           ﾈｮmb ﾍ]ﾌﾞ] 1
     C                     MOVE AESHN2    CJHIN2           ﾈｮmb ﾍ]ﾌﾞ] 2
     C                     MOVE AESHN3    CJHIN3           ﾈｮmb ﾍ]ﾌﾞ] 3
     C                     MOVE AEMTK1    CJMBN1           ﾈｮmb ud ﾌﾞ]k 1
     C                     MOVE AEMTK2    CJMBN2           ﾈｮmb ud ﾌﾞ]k 2
     C                     MOVE AEMTK3    CJMBN3           ﾈｮmb ud ﾌﾞ]k 3
     C                     MOVE AEMTK4    CJMBN4           ﾈｮmb ud ﾌﾞ]k 4
     C                     UPDATAAJPL111
     C                     END
      *
     C           ##X31     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##X31
     C                     END
     C           PPYOU2    IFNE AESTBI
      *
     C                     MOVE '7'       AEDTKO
     C                     MOVE '*'       AEDTHE
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDAEUKBI    AETKBI
     C                     MOVE AETKBI    PTKBI
     C                     Z-ADDPPYOU2    AESTBI
     C                     UPDATAEAPL031
     C                     END
     C                     END
      *
     C           FLKEY     SETGTAEAPL031
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           POHIN     IFEQ AESHIN
     C                     MOVE PTKBI     AETKBI
     C                     UPDATAEAPL031
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C           ##7P1     ENDSR
      *
      *
     C*----------------------------*
     C*   08   f]ﾌﾞ]ﾆｬﾓb ﾉ ﾆｬcﾈb   *
     C*----------------------------*
     C           ##8       BEGSR
      *
     C           FLKEY     SETGTAEAPL031
     C           ##XX4     TAG
     C                     SETOF                     10
     C           FLKEY     REDPEAEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     GOTO ##XX4
     C                     END
      *
     C           AESTBI    IFNE 9999999999
     C           PPYOU2    IFLT AESTBI
     C                     GOTO ##8P1
     C                     END
     C                     END
      *
     C                     MOVE '7'       AEDTKO
     C                     MOVE *BLANK    AEDTHE
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     Z-ADDAEUKBI    AETKBI
     C                     MOVE AETKBI    PTKBI
     C                     Z-ADDPPYOU2    AESTBI
     C                     MOVE AEKMAX    PZKMS            ud ﾉ f]ﾌﾞ] ubﾇc
     C                     UPDATAEAPL031
      *
     C           FLKEY     SETGTAAJPL111
     C                     SETOF                     10
     C           FLKEY     REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
     C                     Z-ADDAESTYY    CJAKYY
     C                     Z-ADDAESTMM    CJAKMM
     C                     Z-ADDAESTDD    CJAKDD
     C                     UPDATAAJPL111
     C                     END
      *
     C                     END
     C           ##8P1     ENDSR
      *
      *
     C*----------------------------------*
     C* 10 s]ﾃcud s]ﾃcﾃﾞ fﾝ[ob ng        *
     C*----------------------------------*
     C           ##10      BEGSR
      *
     C                     SETOF                     10
     C           FPKEY3    CHAINAEAPL031             10
     C           *IN10     IFEQ '0'
     C           AESKJY    ANDEQ'D'
     C           AESKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
      *
     C           #UKBI     IFEQ 0
     C                     EXSR ##2
     C                     ELSE
      *
     C           PPYOU2    IFLT #UKBI
     C                     GOTO ##10P1
     C                     END
      *
     C           PPYOU2    IFGT #UKBI
     C                     EXSR ##7
     C                     END
     C                     END
     C                     ELSE
      *
     C                     MOVE *BLANK    AEDTHE
     C           PPSETT    IFNE AEKTSU
     C                     MOVE '3'       AEDTKO
     C                     END
     C                     Z-ADDPPSETT    AEKSSU
      *
     C                     Z-ADD*DATE     AEKOHZ           ﾃcﾆ]ﾍﾞ
     C                     TIME           AETIME           ﾃcﾆ]ﾆﾞf]
     C                     MOVE PPUSEC    AEKOME           ﾅgﾞｭcﾆｫ
     C                     UPDATAEAPL031
     C                     END
      *
     C           ##10P1    ENDSR
      *
      *
     C*----------------------------------*
     C*     ﾏcﾃcﾍﾞ f]ﾌﾞ]ﾆｬﾓb  ﾉ  kｩｮh    *
     C*----------------------------------*
     C           SUBRTN    BEGSR
      *
     C           FLKEY     SETGTAEAPL031
     C                     SETOF                     10
     C                     READPAEAPL031                 10
     C           *IN10     IFEQ '0'
     C                     UPDATAEAPL031
     C           POTKR     IFEQ AEATKR
     C           PPYOU2    ANDNEAEUKBI
     C                     MOVE '03'      PPKUB
     C           PPOKCD    IFNE PPNKCD
     C                     MOVE '05'      PPKUB
     C                     END
     C                     END
     C                     END
      *
     C                     ENDSR
      *
     C*------------------------------------*
     C*     ﾏcﾃcﾍﾞﾍﾇﾞi 0 ﾆﾞﾉ ﾏcﾃcﾍﾞﾈｮn     *
     C*------------------------------------*
     C           SBHZ      BEGSR
      *
     C                     Z-ADD0         #UKBI  100
     C                     Z-ADD0         #STBI  100
      *
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     SETGTAEAPL031
     C                     ELSE
     C           FLKEY     SETGTAEAPL031
     C                     END
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           PPKUB     IFEQ '10'
     C           PPKUB     OREQ '02'
     C           PPKUB     OREQ '13'
     C           VLKEY     REDPEAEAPL031                 10
     C                     ELSE
     C           FLKEY     REDPEAEAPL031                 10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           AESKJY    IFEQ 'D'
     C           AESKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     Z-ADDAEUKBI    #UKBI
     C                     Z-ADDAESTBI    #STBI
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     ENDSR
      *
** TB1.TB2
01110111
** TB3.TB4
011101
