     H            Y.
     F** AAVR42 ******************
     F*   在庫推移調査リスト   *
     F*      リストの印刷      *
     F*  A-IDOTA     1990.01.19  *
     F****************** AAVR42 **
     FAAVWP42 IP  F     100            DISK
     FAAVWP42TO   F     100            DISK                      A
     FAAMPL11 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     E                    NTKR       15  6                    LOCATION
     E                    NCKQ       15  1                KANABA TYPE
      *-----------------------------------------------------
     IAAVWP42 AA  01
     I                                        1  14 HNBN
     I                                       15  23 BNCH
     I                                       15  18 TUR
     I                                       24  280MISU
     I                                       29  31 @ASJ
     I                                       32  340@MAX
     I                                       35  381@SBX
     I                                       39  421@ACT
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 NCKQ
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1   9 @@TKR
     I                                        1   1 K@LOC1
     I                                        2   2 L
     I                                        3   4 K@LOC2
     I                                        5   5 LL
     I                                        6   7 K@LOC3
     I                                        8   8 LL1
     I                                        9   9 K@LOC4
     I            DS
     I                                        1  14 @@H
     I                                        1   5 H1
     I                                        6   6 H
     I                                        7  11 H2
     I                                       12  12 HH
     I                                       13  14 H3
     I            DS
     I                                        1  12 A2SHN
     I                                        1   5 H11
     I                                        6  10 H12
     I                                       11  12 H13
     C           K#KEY     KLIST
     C                     KFLD           H1
     C                     KFLD           H2
     C                     KFLD           H3
     C           K#LOC     KLIST
     C                     KFLD           K@LOC1
     C                     KFLD           K@LOC2
     C                     KFLD           K@LOC3
     C                     KFLD           K@LOC4
     C           K#LOCX    KLIST
     C                     KFLD           K@LOC1  1
     C                     KFLD           K@LOC2  2
      **************
      * 初期設定 *
      **************
     C                     MOVE HNBN      @@H
     C                     MOVE H1        H11
     C                     MOVE H2        H12
     C                     MOVE H3        H13
     C                     MOVE BNCH      @@TKR
     C                     Z-ADD*ZERO     W@ROW   70
     C*
     C           K#KEY     CHAINAAMPL111             95
      *
     C                     MOVE *BLANK    KAN
     C           1         DO   15        A       20
     C           NCKQ,A    IFEQ 'C'
     C           NCKQ,A    OREQ 'D'
     C           NCKQ,A    OREQ 'E'
     C           NCKQ,A    OREQ '0'
     C                     MOVELNCKQ,A    KAN     1
     C                     ENDIF
     C                     ENDDO
      * IAF
     C           KAN       IFNE *BLANK
     C                     EXSR #KAN
     C                     ENDIF
      *
     C           W@ROW     IFNE *ZERO
     C                     DO   W@ROW
     C                     EXCPT@DTL
     C                     ENDDO
     C                     ENDIF
      *----------------------------------------------------------
     C           #KAN      BEGSR
      *----------------------------------------------------------
     C                     MOVE *OFF      W@PT    1
     C                     SELEC
     C           KAN       WHEQ 'C'
     C           K#LOC     SETLLAAFPL031
     C           *IN91     DOUEQ*ON
     C           K#LOC     READEAAFPL031                 91
     C           *IN91     IFEQ *OFF
     C           A3SKJY    ANDEQ*BLANK
     C           A3SHIN    ANDEQA2SHN
     C           A3STYY    ANDEQ9999
      *
     C                     Z-ADDA3KMAX    @MAXS   50
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ 'D'
     C           K#LOC     SETLLAAGPL031
     C           *IN91     DOUEQ*ON
     C           K#LOC     READEAAGPL031                 91
     C           *IN91     IFEQ '0'
     C           O4SKJY    ANDEQ*BLANK
     C           O4SHIN    ANDEQA2SHN
     C           O4STYY    ANDEQ9999
     C                     Z-ADDO4KMAX    @MAXS
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ 'E'
     C           K#LOC     SETLLAAHPL031
     C           *IN91     DOUEQ*ON
     C           K#LOC     READEAAHPL031                 91
     C           *IN91     IFEQ *OFF
     C           L6SKJY    ANDEQ*BLANK
     C           L6SHIN    ANDEQA2SHN
     C           L6STYY    ANDEQ9999
      *
     C                     Z-ADDL6KMAX    @MAXS
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KAN       WHEQ '0'
     C           K#LOC     SETLLAAPPL031
     C           *IN91     DOUEQ*ON
     C           K#LOC     READEAAPPL031                 91
     C           *IN91     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5SHIN    ANDEQA2SHN
     C           L5STYY    ANDEQ9999
      *
     C                     MOVE '1'       W@PT    1
     C           L5KSSU    DIV  L5SYOS    @@DAYQ 112
     C           @@DAYQ    IFLE 31
     C           L5KSSU    MULT 5         @@QTY  110
     C                     ELSE
     C           L5KSSU    MULT 5         @@QTY
     C                     ENDIF
      *
     C           @@QTY     DIV  L5SYOS    @MAXS
     C                     MVR            @MVR
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXS
     C                     ENDIF
      *
     C           @MAXS     DIV  32        @@ROW   30
     C                     MVR            @@MVR   30
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         @@ROW
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*-------------------*
     C           KAN       WHEQ '6'
     C           K#LOC     SETLLAANPL031
     C           *IN91     DOUEQ*ON
     C           K#LOC     READEAANPL031                 91
     C           *IN91     IFEQ *OFF
     C           L7SKJY    ANDEQ*BLANK
     C           L7SHIN    ANDEQA2SHN
     C           L7STYY    ANDEQ9999
     C           L7BMON    IFEQ 0111
     C                     ITER
     C                     END
      *
     C                     MOVE '1'       W@PT    1
     C           L7KSSU    DIV  L7SYOS    @@DAYQ 112
     C           @@DAYQ    IFLE 31
     C           L7KSSU    MULT 13        @@QTY  110
     C                     ELSE
     C           L7KSSU    MULT 5         @@QTY  110
     C                     ENDIF
      *
     C           @@QTY     DIV  L7SYOS    @MAXS
     C                     MVR            @MVR    90
     C           @MVR      IFGT *ZERO
     C                     ADD  1         @MAXS
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C           @ASJ      IFNE *BLANK
     C           @MAXS     DIV  32        @@ROW   30
     C                     MVR            @@MVR   30
     C                     ELSE
     C           @MAXS     DIV  40        @@ROW
     C                     MVR            @@MVR   30
     C                     ENDIF
      *
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         @@ROW
     C                     ENDIF
     C                     ADD  @@ROW     W@ROW
      *
     C                     ENDSR
     OAAVWP42TEADD             @DTL
     O                         BNCH
     O                                      ','
     O                         HNBN
     O                                      ','
     O                         MISU  Z
     O                                      ','
     O                         @SBX  4
     O                                      ','
     O                         W@ROW 4
