     H            Y.
     F** AAVR10 **********************************************
     F* ASJ HALF PRODUCT KANBAN # UPDATE BASED ON THE IAF PART#.       .
     F* THIS IS CALLED FROM AAVR01.
     F*   TCH      FEB/15/02
     F*
     F********************************************** AAVR10 **
     FFCEPL40 IF  E           K        DISK
     FFCEPL01 UF  E           K        DISK
     FFCEPL11 UF  E           K        DISK
     FAAUPL01 UF  E           K        DISK
     FGHCPL21 UF  E           K        DISK
     FAAMPL11 UF  E           K        DISK
     FAAPPL03 UF  E           K        DISK
      *------------------------------------------------------
     E                    FKH        10  8 0             UPDATE DATE
     E                    FKM        10 10               UPDATE TIME
     E                    FGK        10  9 0             MONTHLY QTY
     E                    FGH        10  8 0             CHANGE DATE
     E                    FCD        10  3 1             WORK DAYS
      *------------------------------------------------------
     I            DS
     I                                        1  800FKH
     I                                        1   80FCKH01
     I                                        9  160FCKH02
     I                                       17  240FCKH03
     I                                       25  320FCKH04
     I                                       33  400FCKH05
     I                                       41  480FCKH06
     I                                       49  560FCKH07
     I                                       57  640FCKH08
     I                                       65  720FCKH09
     I                                       73  800FCKH10
     I            DS
     I                                        1 100 FKM
     I                                        1  10 FCKM01
     I                                       11  20 FCKM02
     I                                       21  30 FCKM03
     I                                       31  40 FCKM04
     I                                       41  50 FCKM05
     I                                       51  60 FCKM06
     I                                       61  70 FCKM07
     I                                       71  80 FCKM08
     I                                       81  90 FCKM09
     I                                       91 100 FCKM10
     I            DS
     I                                        1  900FGK
     I                                        1   90FCGK01
     I                                       10  180FCGK02
     I                                       19  270FCGK03
     I                                       28  360FCGK04
     I                                       37  450FCGK05
     I                                       46  540FCGK06
     I                                       55  630FCGK07
     I                                       64  720FCGK08
     I                                       73  810FCGK09
     I                                       82  900FCGK10
     I            DS
     I                                        1  800FGH
     I                                        1   80FCGH01
     I                                        9  160FCGH02
     I                                       17  240FCGH03
     I                                       25  320FCGH04
     I                                       33  400FCGH05
     I                                       41  480FCGH06
     I                                       49  560FCGH07
     I                                       57  640FCGH08
     I                                       65  720FCGH09
     I                                       73  800FCGH10
     I            DS
     I                                        1  301FCD
     I                                        1   31FCCD01
     I                                        4   61FCCD02
     I                                        7   91FCCD03
     I                                       10  121FCCD04
     I                                       13  151FCCD05
     I                                       16  181FCCD06
     I                                       19  211FCCD07
     I                                       22  241FCCD08
     I                                       25  271FCCD09
     I                                       28  301FCCD10
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   60@TIME
     I                                        1   20@HH
     I                                        4   60@MM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PHIN1   5
     C                     PARM           PHIN2   5
     C                     PARM           PHIN3   2
     C                     PARM           PGEKN   90
     C                     PARM           PGEHZ   80
     C                     PARM           PKCD    30
      *
     C           K#KEY     KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
      *
     C           K#APP     KLIST
     C                     KFLD           A2STRK
     C                     KFLD           A2STRT
     C                     KFLD           A2STRR
     C                     KFLD           A2STRD
      *
     C                     MOVE PHIN1     K@PRT1
     C                     MOVE PHIN2     K@PRT2
     C                     MOVE PHIN3     K@PRT3
     C                     Z-ADDPGEHZ     W@YMD
      *
     C           K#KEY     SETLLFCEPL40
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEFCEPL40                  90
     C           *IN90     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C                     EXSR #UPD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C           #UPD      BEGSR
      *------------------------------------------------------
     C                     MOVE F4HPR1    K@PRT1
     C                     MOVE F4HPR2    K@PRT2
     C                     MOVE F4HPR3    K@PRT3
      * FCEPL01
     C           K#KEY     CHAINFCEPL01              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDPGEKN     A2GEKN
     C                     Z-ADDW@YY      A2GEYY
     C                     Z-ADDW@MM      A2GEMM
     C                     Z-ADDW@DD      A2GEDD
     C                     Z-ADD*YEAR     A2GKYY
     C                     Z-ADD*MONTH    A2GKMM
     C                     Z-ADD*DAY      A2GKDD
     C                     MOVEL#USER     A2GKNM
     C                     TIME           @TIME
     C                     Z-ADD@HH       A2GKJI
     C                     Z-ADD@MM       A2GKHU
     C                     UPDATFCEPL011
     C                     ENDIF
      * FCEPL11
     C           K#KEY     CHAINFCEPL11              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADD10        O       20
     C                     Z-ADD11        P       20
     C           1         DO   9         N       20
     C                     SUB  1         O
     C                     SUB  1         P
     C                     Z-ADDFKH,O     FKH,P
     C                     MOVE FKM,O     FKM,P
     C                     Z-ADDFGK,O     FGK,P
     C                     Z-ADDFGH,O     FGH,P
     C                     Z-ADDFCD,O     FCD,P
     C                     END
      *
     C                     Z-ADD*DATE     FCKH01
     C                     MOVEL#USER     FCKM01
     C                     Z-ADDPGEKN     FCGK01
     C                     Z-ADDW@YMD     FCGH01
     C                     Z-ADDPKCD      FCCD01
     C                     UPDATFCEPL111
     C                     ENDIF
      * AAUPL01
     C           K#KEY     CHAINAAUPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVE '*'       J1GEKH
     C                     Z-ADDJ1NGEK    J1OGEK
     C                     Z-ADDW@YY      J1GEYY
     C                     Z-ADDW@MM      J1GEMM
     C                     Z-ADDW@DD      J1GEDD
     C                     Z-ADDPGEKN     J1NGEK
     C                     Z-ADD*YEAR     J1KOYY
     C                     Z-ADD*MONTH    J1KOMM
     C                     Z-ADD*DAY      J1KODD
     C                     MOVEL#USER     J1KOME
     C                     TIME           @TIME
     C                     Z-ADD@HH       J1KOHH
     C                     Z-ADD@MM       J1KOSS
     C                     UPDATAAUPL011
     C                     ENDIF
      * AAMPL11
     C           K#KEY     CHAINAAMPL11              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDPGEKN     CKSU01
     C                     Z-ADDW@YMD     CKMN01
     C                     Z-ADD*YEAR     CKKOYY
     C                     Z-ADD*MONTH    CKKOMM
     C                     Z-ADD*DAY      CKKODD
     C                     MOVEL#USER     CKKOME
     C                     TIME           @TIME
     C                     Z-ADD@HH       CKKOHH
     C                     Z-ADD@MM       CKKOSS
     C                     UPDATAAMPL111
     C                     ENDIF
      * GHCPL21
     C           K#KEY     CHAINGHCPL21              91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDPGEKN     M7SETI
     C                     Z-ADDPGEKN     M7SRYO
     C                     UPDATGHCPL211
     C                     ENDIF
      * AAPPL03
     C           K#APP     SETLLAAPPL03
     C           *IN91     DOUEQ*ON
     C           K#APP     READEAAPPL03                  91
     C           *IN91     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ*ALL'9'
     C           L5SHN1    ANDEQK@PRT1
     C           L5SHN2    ANDEQK@PRT2
     C           L5SHN3    ANDEQK@PRT3
     C                     Z-ADD*DATE     L5KOHZ
     C                     TIME           L5TIME
     C                     MOVEL#USER     L5USER
     C           PGEKN     DIV  PKCD      L5KSSU
     C                     MVR            @@MVR   50
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         L5KSSU
     C                     ENDIF
     C                     Z-ADDL5KSSU    L5KTSU
     C                     MOVE '3'       L5DTKO
     C                     UPDATAAPPL031
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
