     H            Y.
     F** AB#R6N **********************************
     F*     PRINT EDI REMITANCE ADVICE           *
     F*                   FROM FORD              *
     F*                                          *
     F********************************** AB#R6N **
     FAB#PP6R IF  E           K        DISK
     FAB#PP6Q IF  E           K        DISK
     FAB#PP6P IF  E           K        DISK
     FABF9P01 IF  E           K        DISK
     FAB#PL1C IF  E           K        DISK
     FAB#PL76 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
      **********************************************************
     E                    AR1        20  1
     E                    AR2        10  1
      **********************************************************
     I            DS
     I                                        1   80BADATE
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80PUDATE
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C****************************************************
     C           K#KEY1    SETLLAB#PP6R
     C           *IN80     DOUEQ*ON
     C           K#KEY1    READEAB#PP6R                  80
     C           *IN80     IFEQ *OFF
     C*          ALPRDT    IFGT W@END
     C*                    LEAVE
     C*                    ENDIF
      *
     C                     EXCPT@HED
      *
     C           K#KEY     SETLLAB#PP6P
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PP6P                  90
     C           *IN90     IFEQ *OFF
     C                     MOVELAPREFN    @REFNO 10
     C   OF                EXCPT@HED
     C                     EXCPT@DTL1
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @@AMT  154
     C           K#KEY     SETLLAB#PP6Q
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PP6Q                  90
     C           *IN90     IFEQ *OFF
     C           APNTE2    IFNE *BLANK
     C           APIQTY    ORNE *ZERO
     C           APRM02    IFNE *BLANK
     C                     MOVEAAPRM02    AR1
     C                     MOVE *BLANK    AR2
     C                     Z-ADD*ZERO     X       20
     C           1         DO   20        Y       20
     C           AR1,Y     IFNE *BLANK
     C                     ADD  1         X
     C                     MOVE AR1,Y     AR2,X
     C           X         IFEQ 10
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     MOVEAAR2       @REFNO 10
     C                     ELSE
     C                     MOVELAPREF2    @REFNO 10
     C                     ENDIF
     C           APPART    IFNE *BLANK
     C                     MOVELAPPART    @@PART 60 P
     C                     ELSE
     C                     MOVELAPNTE2    @@PART    P
     C                     ENDIF
      *
     C           APPLNT    CAT  'A':0     W@5     5
     C           W@5       IFEQ 'AP19A'
     C                     MOVE 'AP10A'   W@5
     C                     ENDIF
     C           W@5       CHAINABF9P01              95
     C           APRM04    COMP @@AMT                    88
     C                     Z-ADDAPRM04    @@AMT
     C                     MOVELAPPLNT    @PLNT   5
     C                     MOVELAPPONO    @PONO  10
      *
     C           *IN95     IFEQ *ON
     C                     MOVE *BLANK    @SHIP   4
     C                     Z-ADD*ZERO     @SHDT   80
     C           @PONO     IFNE '11111'
     C           @PONO     SETLLAB#PL1C
     C           *IN96     DOUEQ*ON
     C           @PONO     READEAB#PL1C                  96
     C           *IN96     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     MOVE BANONY    @SHIP
     C                     Z-ADDBADATE    @SHDT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           @SHIP     IFEQ *BLANK
     C                     MOVEL@REFNO    @9      9
     C           @9        CHAINAB#PL76              96
     C           *IN96     IFEQ *OFF
     C                     MOVE PUNONY    @SHIP
     C                     Z-ADDPUDATE    @SHDT
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C   OF                EXCPT@HED
     C                     EXCPT@DTL2
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@YMD   80
     C                     PARM           P@TIM   60
      *
     C                     Z-ADDP@YMD     K@DATE  80
     C                     Z-ADDP@TIM     K@TIME  60
     C*          P@YYMM    MULT 100       K@DATE  80
     C*          K@DATE    ADD  99        W@END   80
     C                     TIME           @TIME   60
     C           K#KEY1    KLIST
     C                     KFLD           K@DATE
     C                     KFLD           K@TIME
     C           K#KEY     KLIST
     C                     KFLD           ALPRDT
     C                     KFLD           ALPRTM
     C                     KFLD           ALRENO
     C                     KFLD           ALCNM1
      *
     C                     MOVE *ALL'-'   @@LINE160
      *
     C                     ENDSR
     C**************************************************************************
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  128
     O                         @TIME    137 '  :  :  '
     O                                  142 'PAGE'
     O                         PAGE  Z  146
     O*
     O        E   02           @HED
     O                                   50 'ACCOUNT PAYABLE'
     O                                   67 'DETAIL LIST FROM'
     O                                   82 'GENTRAN AS/400'
     O*
     O        E   03           @HED
     O                                   12 'REFERENCE#:'
     O                         ALRENO    33
     O                                   50 'TOTAL AMOUNT:'
     O                         ALMAMTJ   67
     O        E   04           @HED
     O                                   12 'PAYER:'
     O                         ALCNM1    33
     O                         ALCNM2    54
     O        E   05           @HED
     O                                    7 'DATE'
     O                                   76 'REF#'
     O                                   88 'PLANT'
     O                                  102 'INV#/ORD#'
     O                                  121 'QTY'
     O                                  131 'UNIT P.'
     O                                  151 'REF# AMT'
     O        E   06           @HED
     O                         @@LINE   160
     O*
     O        E 1              @DTL1
     O                         APADAT    10 '    /  /  '
     O                         APADSC    71
     O                         @REFNO    82
     O                         APAJSTJ  111
     O        E 1              @DTL2
     O                         AFDTM2    10 '    /  /  '
     O                         @@PART    71
     O                         @REFNO    82
     O                         @PLNT     88
     O                      N95F9DELY    93
     O                       95@SHIP     93
     O                         @PONO    104
     O                         APIQTYJ  122
     O                         APUNITJ  132
     O                      N88APRM04J  152
     O                       95@SHDT    164 '    /  /  '
