     H*           Y
     F** AB#RFG ****************************************************************
     F*     REORGANIZE FILE(ABF6P01,ABF2P01)                                   *
     F*     N.HYOTO 200.06.21                                                  *
     F*                                                                        *
     F*  *IN90=1 NOT READ(ABF2L01)                                             *
     F*  *IN91=1 NOT READ(ABF6P01)                                             *
     F*  *IN92=1 NOT READ(ABFPP10)                                             *
     F*  *IN93=1 NOT READ(ABFPP20)                                             *
     F*                                                                        *
     F* TCHK1 08/26/13 CHG WW8DAT 3MM --> 6MM                                  *
JW1  F* JW    11/15/16 CHG WW8DAT 3MM --> 6MM                                  *
     F********************************** AB#RFG ********************************
     FABF4P01 UF  E           K        DISK
     FABF6P01 UF  E           K        DISK
     FABF2L01 UF  E           K        DISK
     FABFPP10 UF  E           K        DISK
     FABFPP20 UF  E           K        DISK
     I*
     I* UPDATE DATE(ABF4P01)
     I            DS
     I                                        1   80W4ODAT
     I                                        1   40YBKOYY
     I                                        5   60YBKOMM
     I                                        7   80YBKODD
     I* UPDATE DATE(ABF6P01)
     I            DS
     I                                        1   80WKODAT
     I                                        1   40FCKOYY
     I                                        5   60FCKOMM
     I                                        7   80FCKODD
     I* SYSTEM DATE(8 DIGITS)
     I            DS
     I                                        3   80WW6DAT
     I                                        1   80WW8DAT
     I                                        3   40WWYY
     I                                        5   60WWMM
     I                                        7   80WWDD
     I                                        1   40WWYYYY
     I* SYSTEM DATE
     I            DS
     I                                        1  140WTMDT
     I                                        1   60WTIME
     I                                        7  140WDATE
     C**************************************************************************
     C* 6 DIGITS --> 8 DIGITS
     C* 8 DIGITS  -  2 MONTHS
     C* SET 01 TO DAY
     C                     TIME           WTMDT
     C                     Z-ADDWDATE     WW8DAT
     C*JW1                 SUB  3         WWMM
JW1  C                     SUB  6         WWMM
     C           WWMM      IFLT 1
     C                     ADD  12        WWMM
     C                     SUB  1         WWYYYY
     C                     END
     C***************      Z-ADD1         WWDD
     C*
     C           *LOVAL    SETLLABF2P011
     C                     READ ABF2P011                 90
     C*
     C           *IN90     DOWEQ'0'
     C           AFSIDT    IFLT WW8DAT
     C           AFSIDT    ANDNE*ZERO
     C                     DELETABF2P011
     C                     END
     C*
     C                     READ ABF2P011                 90
     C                     END
     C*
     C**************************************************************************
     C*
     C           *LOVAL    SETLLABF4P011
     C                     READ ABF4P011                 91
     C*
     C           *IN91     DOWEQ'0'
     C           W4ODAT    IFLT WW8DAT
     C           W4ODAT    ANDNE*ZERO
     C                     DELETABF4P011
     C                     END
     C*
     C                     READ ABF4P011                 91
     C                     END
     C*
     C**************************************************************************
     C*
     C           *LOVAL    SETLLABF6P011
     C                     READ ABF6P011                 91
     C*
     C           *IN91     DOWEQ'0'
     C           WKODAT    IFLT WW8DAT
     C           WKODAT    ANDNE*ZERO
     C                     DELETABF6P011
     C                     END
     C*
     C                     READ ABF6P011                 91
     C                     END
     C*
     C**************************************************************************
     C*
     C           *LOVAL    SETLLABFPP101
     C                     READ ABFPP101                 92
     C*
     C           *IN92     DOWEQ'0'
     C           FBDATE    IFLT WW6DAT
     C           FBDATE    ANDNE*ZERO
     C                     DELETABFPP101
     C                     END
     C*
     C                     READ ABFPP101                 92
     C                     END
     C*
     C**************************************************************************
     C*
     C           *LOVAL    SETLLABFPP201
     C                     READ ABFPP201                 93
     C*
     C           *IN93     DOWEQ'0'
     C           FDDATE    IFLT WW6DAT
     C           FDDATE    ANDNE*ZERO
     C                     DELETABFPP201
     C                     END
     C*
     C                     READ ABFPP201                 93
     C                     END
     C*
     C**************************************************************************
     C                     SETON                     LR
     C                     RETRN
