     H            Y.
     FAB#PL67 UF  E           K        DISK
     C           KEY1      KLIST
     C                     KFLD           K1      40
     C                     KFLD           K2      40
     C                     KFLD           K3      1
     C                     KFLD           K4      4
     C                     KFLD           K5      80
     C                     KFLD           K6      20
      *
     C                     Z-ADD0         CNT     50
     C                     Z-ADD3411      K1
     C                     Z-ADD0323      K2
     C                     MOVEL'C'       K3
     C                     MOVEL'00  '    K4
     C                     Z-ADD20150502  K5
     C                     Z-ADD01        K6
     C                     SETOF                     31
     C           KEY1      SETLLAB#PP661
     C                     DO   *HIVAL
     C           KEY1      READEAB#PP661                 31
     C   31                LEAVE
     C                     MOVEL'90179'   A6SHN1
     C                     MOVEL'06246'   A6SHN2
     C                     MOVEL'  '      A6SHN3
     C                     Z-ADD10        A6SRYO
     C                     Z-ADD10        A6QTYB
     C                     MOVEL'90080'   A6MHN1
     C                     MOVEL'17258'   A6MHN2
     C                     MOVEL'  '      A6MHN3
     C*                    MOVEL'MAEDA'   A6MHN4
     C                     UPDATAB#PP661
     C                     ADD  1         CNT
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
