     H            Y/
     FAB#PWL2 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FAB#PLLG IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      *
     E                    CMD     1   2 78
     E                    ERR     1   2 78
     E                    CMT     1   1 12
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8DATE
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1  10 LGUUSR
     I                                        1   3 LG1
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*DAY      K@DD
      *
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    IFNE *BLANK
     C                     ITER
     C                     ENDIF
     C                     Z-ADDF8DATE    D@DATE
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     #CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@ID
     C                     ELSE
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     MOVE '02'      @@ID
     C                     EXSR #SET
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     9961
     C                     MOVE *BLANK    #MSG
     C           D@DATE    ADD  20000000  W@DATE
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,1     #MSG
     C                     ELSE
     C           W@DATE    CHAINAB#PLLG              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,2     #MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     MOVE *OFF      *IN11
     C           W@DATE    SETLLAB#PLLG
      *
     C           *IN90     DOUEQ*ON
     C           W@DATE    READEAB#PLLG                  90
     C           *IN90     IFEQ *OFF
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C           LGFLG2    IFEQ *BLANK
     C                     MOVE *ON       *IN11
     C                     ELSE
     C                     MOVE *OFF      *IN11
     C                     ENDIF
     C                     Z-ADDLGSTIM    S@STM
     C                     Z-ADDLGETIM    S@ETM
     C                     MOVE LGNONY    S@DLV
     C                     MOVE LGFCTY    S@FCT
     C           LGFLG1    IFNE *BLANK
     C                     MOVE '*'       S@FLG1
     C                     ENDIF
     C           LGFLG2    IFNE *BLANK
     C                     MOVE '*'       S@FLG2
     C                     ENDIF
     C           LGNONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    S@NAME
     C                     ENDIF
      *
     C           LG1       IFEQ 'EDI'
     C                     MOVE CMT,1     S@CMNT
     C                     ENDIF
     C                     WRITESFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     #CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
** CMD
   F3:END
   F3:END     F12:GO BACK
** ERR
  DATE ERROR.
  NO DATA FOR THE DATE.
** CMT
EDI GENTRAN
