     H            Y.
     F** AB#R4F ****************************************************
     F*  CANADA CUSTOM SHEET REISSURANCE (FORD) ONTARIO & MEXICO   *
     F*      N-HYOTO                                 00.01.11      *
     F* TCHK1 08/29/06 ADD 5139 TO CANADA            00.01.11      *
     F* TCHK2 09/10/08 CHG PRICE DECIMAL             00.01.11      *
     F* TCHK3 09/10/08 CHG COUNTORY NAME FROM PARM                 *
     F* TCHK4 03/31/14 BUG FIX                                     *
JW1  F*  JW   12.07.16 CHG PALLET UNIT WGT (23.675 --> 6.5) KG (SMALL PALLET)
     F**************************************************************
     FAB#WP3K2IP  F     100            DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FABF6L02 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1  12  2 0 TB2     9
     IAB#WP3K2AA  01
     I                                        1   40ITOKU
     I                                        5   80INONY
     I                                        9   9 INKOJ
     I                                       10  13 ICUKE
     I                                       14  20 IMHN1 L1
     I                                       21  27 IMHN2 L1
     I                                       34  410INOHZ
     I                                       34  370INOYY
     I                                       38  390INOMM
     I                                       40  410INODD
     I                                       46  510ISRYO
TCHK2I*                                      55  624ITANK
TCHK2I                                       55  625ITANK
     I                                       63  67 ISHN1
     I                                       68  72 ISHN2
     I                                       73  74 ISHN3
     I                                       75  800ISYOS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80FCSKHZ
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
     I            DS
     I                                        1   80WDEHZ
     I                                        1   40WDEYY
     I                                        5   60WDEMM
     I                                        7   80WDEDD
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           KEY2      KLIST
     C                     KFLD           WNOHZ   80
     C                     KFLD           WNOBN   20
     C                     KFLD           WDEYY   40
     C                     KFLD           WDEMM   20
     C                     KFLD           WDEDD   20
     C                     KFLD           WSIRE   40
     C                     KFLD           WDOCK   4
      *
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PSIRK   1
     C                     PARM           PDOCK   4
     C                     PARM           PNOHZ   8
     C                     PARM           PNOBN   20
     C                     PARM           PREHZ   8
TCHK3C                     PARM           PCNAM  10
TCHK3C                     PARM           PTRAN  30
      *
     C                     MOVE PSIRE     WSIRE
     C                     MOVELPDOCK     WDOCK
     C                     MOVE PNOHZ     WNOHZ
     C                     Z-ADDPNOBN     WNOBN
     C                     MOVE PREHZ     WDEHZ
      *
     C                     SETOF                     10
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     1011
      *
     C* SET THE NAME OF MONTH
     C                     SETOF                     20
     C                     Z-ADD1         A       20
     C           INOMM     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVELTB2,A     WMNAM   9
     C                     END
      * SHIP TP = 5154(ONTARIO),TRANSPORTATION IS CENTRAL
      * SET LOCATION(COUNTRY)
TCHK3C*          INONY     IFEQ 5154
TCHK3C*          INONY     OREQ 5192
TCHK3C*          INONY     OREQ 5193
TCHK3C*TCHK1     INONY     OREQ 5139
TCHK3C*                    SETON                     30
TCHK3C*                    MOVE 'CANADA'  WLOCA
TCHK3C*
TCHK3C*                    ELSE
TCHK3C*                    SETOF                     30
TCHK3C*                    MOVE 'MEXICO'  WLOCA   6
TCHK3C*                    END
TCHK3C*
TCHK3C                     MOVELPCNAM     WLOCA   6
TCHK3C*
TCHK3C                     MOVELPTRAN     WTRAN  30
      *
     C                     SETOF                     20
     C                     MOVE *BLANK    WSMEI  15
     C           INONY     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WSRYO   60
     C                     END
      *
     C                     EXSR #SUB1
     C*
     C                     SETOF                     20
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WDMEI  13
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C                     MOVELA2DMEI    WDMEI
     C           ISYOS     IFEQ 0
     C           *DATE     IFGE A2SYHZ
     C                     Z-ADDA2SSYS    ISYOS
     C                     ELSE
     C                     Z-ADDA2KSYS    ISYOS
     C                     END
     C                     END
     C                     END
      *
     C           *IN20     IFEQ '1'
     C           ISYOS     IFEQ 0
     C                     Z-ADDISRYO     ISYOS
     C                     END
     C                     END
      *
     C                     ADD  ISRYO     WSRYO
      *
     CL1                   EXSR SUBR
     CLR                   EXSR #GROS
TCHK4C*LR        TNET      MULT 2.2046    PNET    93H
TCHK4C*LR        TGROS     MULT 2.2046    PGROS   82H
TCHK4CLR         TNET      MULT 2.2046    PNET    93
TCHK4CLR         TGROS     MULT 2.2046    PGROS   82
     C****************************************************************
     C           SUBR      BEGSR
     C****************************************************************
     C                     Z-ADD0         WHAKO   30
     C                     Z-ADD0         WHAKO1  20
     C                     Z-ADD0         WKING   72
     C                     Z-ADD0         WNET1  102
     C                     Z-ADD0         WNET2   83
     C                     Z-ADD0         WTARE   83
     C*
     C           WSRYO     DIV  ISYOS     WHAKO
     C                     MVR            WHAKO1
     C           WHAKO1    IFNE 0
     C                     ADD  1         WHAKO
     C                     END
     C*
     C           WSRYO     MULT ITANK     WKING
     C                     ADD  WKING     TKING   72
     C* NET
     C           WSRYO     MULT WKASI     WNET1
TCHK4C*          WNET1     DIV  1000      WNET2
TCHK4C           WNET1     DIV  1000      WNET2
     C                     ADD  WNET2     TNET    83
     C* TARE
     C           WHAKO     MULT 0.7       WTARE
     C                     ADD  WTARE     TTARE   83
     C*
     C                     ENDSR
     C****************************************************************
     C           #SUB1     BEGSR
     C****************************************************************
     C                     MOVELINONY     WNONY   4
     C                     MOVE *BLANK    WADD1  30
     C                     MOVE *BLANK    WADD2  30
     C                     MOVE *BLANK    WADD3  30
     C                     MOVE *BLANK    WADD4  30
     C                     MOVE *BLANK    WADD5  30
     C                     MOVE *BLANK    WADD6  30
     C           WNONY     CHAINEDIPL401             77
     C           *IN77     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C                     ELSE
     C                     MOVELE4ADD1    WADD1
     C                     MOVELE4ADD2    WADD2
     C                     MOVELE4ADD3    WADD3
     C                     MOVELE4ADD4    WADD4
     C                     MOVELE4ADD5    WADD5
     C                     MOVELE4ADD6    WADD6
     C                     END
     C                     END
     C                     ENDSR
     C****************************************************************
     C           #GROS     BEGSR
     C****************************************************************
     C                     Z-ADD0         WPASU   30
     C                     SETOF                     40
     C           KEY2      SETLLABF6P011
     C                     DO   *HIVAL
     C           KEY2      READEABF6L02                  40
     C           *IN40     IFEQ '0'
     C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
     C           FCPBCD    IFEQ 'M'
TCHK4C*                    ADD  FC#PLT    WPASU
TCHK4C           FC#PLT    ANDGTWPASU
TCHK4C                     Z-ADDFC#PLT    WPASU
     C                     END
     C                     END
     C                     END
     C  N40                ENDDO
     C* TOTAL TARE
     C                     Z-ADD0         WPARE   83
     C**JW1      WPASU     MULT 23.675    WPARE
JW1  C           WPASU     MULT 6.5       WPARE
     C                     ADD  WPARE     TTARE
     C* TOTAL GROSS
     C                     Z-ADD0         TGROS   82
     C           TTARE     ADD  TNET      TGROS
     C*
     C                     ENDSR
      *
     OQPRINT  H  202   10
     O                         WSMEI     29
     O        H  2     10
     O                                   17 'IAF'
     O                         WLOCA     25
     O                                   33 'CUSTOM'
     O                                   46 'INFORMATION'
     O                                   71 'PAGE'
     O                         PAGE  Z   75
     O        H  2     10
     O                                   11 '1.VENDOR'
     O                                   56 '2.DATE OF DIRECT'
     O                                   68 'SHIPMENT TO'
     O                         WLOCA     75
     O        H  1     10
     O                                    8 'IAF'
     O                         WMNAM     51
     O                         INODD Z   54
     O                                   56 ','
     O                         INOYY     61
     O        H  1     10
     O                                   26 '1300 W. ANDERSON BLVD'
     O        H  2     10
     O                                   25 'GREENFIELD, IN 46140'
     O                                   58 '3.OTHER REFERENCES'
     O        H  2     10
     O                                   14 '4.CONSIGNEE'
     O                                   58 'PRODUCTION PARTS'
     O        H  1     10
     O                         WADD1     35
     O                                   57 '5.RELATED COMPANY'
     O                                   70 'TRANSACTION'
     O        H  1     10
     O                         WADD2     35
     O        H  1     10
     O                         WADD3     35
     O                                   49 'NO-NONE'
     O        H  2     10
     O                         WADD4     35
     O        H  2     10
     O                                   22 '6.COUNTRY OF ORIGIN'
     O                                   56 '7.TRANSPORTATION'
     O        H  2     10
     O                                    8 'USA'
TCHK3O*                30                59 'CENTRAL TRANSPORT'
TCHK3O*               N30                56 'LIONS DELIVERY'
TCHK3O                         WTRAN     72
     O        H  1     10
     O                                   18 '8.CONDITIONS OF'
     O                                   33 'SALE AND TERMS'
     O                                   50 '9.CURRENCY'
     O        H  1     10
     O                                   16 'OF PAYMENT'
     O        H  1     10
     O                                   52 'U.S. FUNDS'
     O        H  2     10
     O                                   11 'NET 25'
     O        H  2     10
     O                                   15 '10.ORIGINATOR'
     O                                   56 '11.FIELDS 23 TO 25'
     O                                   76 'ARE NOT APPLICABLE'
     O        H  3     10
     O                                   22 'SAME AS NUMBER 1.'
     O                                   43 'X'
     O        H  2     10
     O                                   13 'NO. OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES QUANTITY'
     O                                   62 'UNIT PRICE'
     O                                   71 'TOTAL'
     O        H  202   OF
     O                                   10 ' '
     O        H  2     OF
     O                                   13 'NO. OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES QUANTITY'
     O                                   62 'UNIT PRICE'
     O                                   72 'TOTAL'
     O        T  1     L1
     O                         WHAKO Z    8
     O                         IMHN1     19
     O                                   20 '-'
     O                         IMHN2     27
     O                         WDMEI     42
     O                         WSRYO 1   51
     O                         ITANK 1   62
     O                         WKING 1   72
     O        T 11     LR
     O                                   23 'TOTAL...'
     O                                   49 'WEIGHT NET---------'
     O                                   61 'GROSS------'
     O                                   72 'INVOICE'
     O        T  1     LR
     O                         TNET  1   47
     O                                   48 'K'
     O                         TGROS 1   59
     O                                   60 'K'
     O                         TKING 1   72
     O        T  1     LR
     O                         PNET  1   47
     O                                   49 'LB'
     O                         PGROS 1   59
     O                                   61 'LB'
      *
** TB1.TB2
01JANUARY
02FEBRUARY
03MARCH
04APRIL
05MAY
06JUNE
07JULY
08AUGUST
09SEPTEMBER
10OCTOBER
11NOVEMBER
12DECEMBER
