     H            Y.
     F** AB#R63 *******************************
     F*  ..ACCOUNTS RECEIVABLE DETAIL LIST..  *
     F*  ..TMMK                               *
     F*    I-HASADA               97.08.12    *
     F*    MSK.KUNIEDA            02.19.1999  *
     F*
     F*    H.AMANO                06.12.2002
     F******************************* AB#R63 **
     FAB#WP63 IP  F     100            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IAB#WP63 AA  01
     I                                        1   40ITOKU
     I                                        5   80INONY
     I                                        9   9 INKOJ
     I                                       10  13 INUKE
     I                                       14  18 IMHN1
     I                                       19  23 IMHN2
     I                                       24  28 IMHN3           10
     I                                       34  43 IODR1 L1
     I                                       44  510INOHZ
     I                                       46  470INOYY
     I                                       48  490INOMM
     I                                       50  510INODD
     I                                       52  560ISYUY
     I                                       57  630ISRYO
     I*                                      64  724ITANK
     I                                       73  76 ICARD
     I                                       78  875ITANK
      *
     C           *ENTRY    PLIST
     C                     PARM           PNONY   4
     C                     MOVE PNONY     WNONY   40
      *
     C                     SETOF                     50
      *
     C           *IN51     IFEQ '0'
     C                     SETON                     5051
     C                     TIME           WTIME   60
      *
     C                     SETOF                     20
     C           WNONY     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI  15
     C                     END
     C                     END
      *
     C           *INL1     IFEQ '1'
     C*******              Z-ADD0         TKING  102
     C                     Z-ADD0         TKING  134
      * 02.19.99 MSK
     C                     Z-ADD0         TKEN    50
     C                     ADD  1         L1CNT   40
      *----
     C                     END
      *
     C                     SETOF                     60
     C           ITANK     IFEQ 0
     C                     SETON                     60
     C                     END
      *
     C********   ITANK     MULT ISRYO     WKING   92
     C           ITANK     MULT ISRYO     WKING  114
     C                     Z-ADDWKING     @WKING  92H
     C                     ADD  WKING     TKING
     C*********            ADD  WKING     LKING  102
     C                     ADD  WKING     LKING  134
      * 02.19.99 MSK
     C                     ADD  1         TKEN    50
     C                     ADD  1         LKEN    50
     CL1                   Z-ADDTKING     @TKING 102H
     CLR                   Z-ADDLKING     @LKING 102H
      *-----
      *
     OQPRINT  H  102   50
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O                                  131 '.         .         .'
     O        H  1     50
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        H  2     50
     O       OR        OF
     O                                   10 'AB#R63-1'
     O                         WSMEI     29
     O                                   57 '** ACCOUNTS RECEIVABLE'
     O                                   73 'DETAIL LIST  **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O                                   34 'CARD'
     O                                   63 'MANIFEST'
     O                                  111 'SHIPPING'
     O        H  2     50
     O       OR        OF
     O                                    9 'COSTOMER'
     O                                   19 'DELIVERY'
     O                                   28 'FACTORY'
     O                                   34 'NO.'
     O                                   47 'PART NUMBER'
     O                                   59 'NO'
     O                                   75 'QTY'
     O                                   87 'PRICE'
     O                                  101 'TOTAL AMOUNT'
     O                                  109 'DATE'
     O                                  117 'DOCK'
     O        D  1     01
     O                         ITOKU      7
     O                         INONY     17
     O                         INKOJ     25
     O                         ICARD     34
     O                         IMHN1     41
     O                                   42 '-'
     O                         IMHN2     47
     O                N10                48 '-'
     O                         IMHN3     53
     O                         IODR1     65
     O                         ISRYO 1   75
     O                         ITANK 1   87
     O                         @WKING1  101
     O                         INOMM    105
     O                                  106 '/'
     O                         INODD    108
     O                                  109 '/'
     O                         INOYY    111
     O                         INUKE    117
     O                 60               126 'NO @M/F'
     O        T  2     L1
     O                                   76 '** TOTAL AMOUNT'
     O                                   87 '- MANIFEST'
     O*********                TKING 1  101
     O                         @TKING1  101
      * 02.19.99 MSK
     O                                  121 'SUB'
     O                                  131 '(XX,XXX)'
     O                         TKEN     130 '  ,   '
      *---
     O        T  2     LR
      * 02.19.99 MSK
     O                                   48 '** MANIFEST NO COUNT'
     O                                   56 '(X,XXX)'
     O                         L1CNT     55 ' ,   '
      *---
     O                                   80 '** TOTAL AMOUNT-IAF'
     O***********              LKING 1  101
     O                         @LKING1  101
      * 02.19.99 MSK
     O                                  122 'DATA NO COUNT'
     O                                  131 '(XX,XXX)'
     O                         LKEN     130 '  ,   '
      *---
