     H            Y.
     F** AB#R432FX  *****************************************
     F* SERVICE PARTS - COMPARE AM#PP432 TO AB#PP10, AB#PP44*
     F*                 AND FIX PP10, PP44                  *
     F*******************************************************
     FAB#PL1L UF  E           K        DISK
     FAB#PL44CUF  E           K        DISK                      A
     FAM#PL43BUF  E           K        DISK
     FAM#PL43CUF  E           K        DISK
     F            AM#PP43R                          KRENAMEAM#PL43R
     FALDWP27 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        7  100SDYY
     I                                       11  120SDMM
     I                                       13  140SDDD
     I                                        1   60STIME
     I                                        1   20STHH
     I                                        3   40STMM
      *
     I            DS
     I                                        1   8 ##NYMD
     I                                        1   40P#NOYY
     I                                        5   60P#NOMM
     I                                        7   80P#NODD
      *
     I            DS
     I                                        1   80BANYMD
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *
     I            DS
     I                                        1   80DDDYMD
     I                                        1   4 DDDYY
     I                                        5   6 DDDMM
     I                                        7   8 DDDDD
      *
     I            DS
     I                                        1   80ODDYMD
     I                                        1   4 ODDDYY
     I                                        5   6 ODDDMM
     I                                        7   8 ODDDDD
      *
     I            DS
     I                                        1  10 DDD
     I                                        1   4 M1YY
     I                                        5   5 DSH1
     I                                        6   7 M1MM
     I                                        8   8 DSH2
     I                                        9  10 M1DD
      *
     I            DS
     I                                        1  10 ODDD
     I                                        1   4 M1OYY
     I                                        5   5 ODSH1
     I                                        6   7 M1OMM
     I                                        8   8 ODSH2
     I                                        9  10 M1ODD
      *
     I            DS
     I                                        1  14 M1PART
     I                                        1   5 M1MHN1
     I                                        6   6 M1DSH1
     I                                        7  11 M1MHN2
     I                                       12  12 M1DSH2
     I                                       13  14 M1MHN3
      *
     I            DS
     I                                        1  14 BAPART
     I                                        1   5 BAMHN1
     I                                        6   6 BADSH1
     I                                        7  11 BAMHN2
     I                                       12  12 BADSH2
     I                                       13  17 BAMHN3
      *
     I            DS
     I                                        1  12 MHN
     I                                        1   5 MHN1
     I                                        6  10 MHN2
     I                                       11  12 MHN3
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P#NYMD  8
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
      *
     C           K#1L      SETLLAB#PL1L
     C           K#1L      READEAB#PL1L                  50
      *
     C           *IN50     DOWEQ*OFF
      *
     C           BASKJY    IFEQ *BLANK
      *
     C                     MOVELBAODRN    ORDTYP  2
     C           ORDTYP    IFEQ 'TX'
     C                     EXSR CHK44P
     C                     EXSR CHK432
     C           QTY432    IFNE BASRYO
     C           QTY432    ANDNE*ZERO
     C                     Z-ADDQTY432    BASRYO
     C                     Z-ADDQTY432    BAODER
     C                     UPDATAB#PL1L1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           K#1L      READEAB#PL1L                  50
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVELP#NYMD    ##NYMD
      *
     C           K#1L      KLIST
     C                     KFLD           NONY    40
     C                     KFLD           P#NOYY
     C                     KFLD           P#NOMM
     C                     KFLD           P#NODD
      *
     C           K#44C     KLIST
     C                     KFLD           NONY
     C                     KFLD           BANYMD
     C                     KFLD           ODRN15
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
      *
     C           K#432B    KLIST
     C                     KFLD           DDD
      *
     C           K#432C    KLIST
     C                     KFLD           ODRN12 12
     C                     KFLD           MHN
      *
     C                     Z-ADD323       NONY
      *
     C                     MOVELP#NOYY    M1YY
     C                     MOVE '-'       DSH1
     C                     MOVELP#NOMM    M1MM
     C                     MOVE '-'       DSH2
     C                     MOVELP#NODD    M1DD
      *
     C                     EXSR SETFLG
      *
     CSR         ESB100    ENDSR
      *------------------------------------------------------------------*
      * Set Found Flag to Zero for all records for ShipDt in Open PO file*
      *
     C           SETFLG    BEGSR
      *
     C           K#432B    SETLLAM#PL43B
      *
     C                     DO   *HIVAL
     C           K#432B    READEAM#PL43B                 50
      *
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     M1PGNO             0=NOT FOUND
     C                     UPDATAM#PP43R
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      * Get Orig PO Line Number from EDI file.             *
      *
     C           CHK44P    BEGSR
      *
     C                     MOVELBAODRN    ODRN15 15
     C                     MOVE *BLANKS   #LINE#  5
     C                     MOVELBAHPOS    HPOS    1
      *
     C           K#44C     SETLLAB#PL44C
      *
     C                     DO   *HIVAL
     C           K#44C     READEAB#PL44C                 50
      *
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           DANUKE    IFNE BANUKE
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELDALINE    #LINE#
     C                     LEAVE
      *
     C                     ENDDO
      *
      * not found in ab#pp44, so write record...
     C           #LINE#    IFEQ *BLANKS
     C                     Z-ADDBATOKU    DATOKU
     C                     Z-ADDBANONY    DANONY
     C                     Z-ADDBANYMD    DANYMD
     C                     MOVELBAODRN    DAORDN
     C                     MOVELBAMHN1    DAMHN1
     C                     MOVELBAMHN2    DAMHN2
     C                     MOVELBAMHN3    DAMHN3
     C                     MOVELBAMHN4    DAMHN4
     C                     Z-ADDBANOBN    DANOBN
     C                     MOVELBANUKE    DAHOME
     C                     MOVELBANKOJ    DANKOJ
      *
      * get line# from open po file...
     C                     MOVELBAODRN    ODRN12
     C                     MOVELBAMHN1    MHN1
     C                     MOVELBAMHN2    MHN2
     C                     MOVELBAMHN3    MHN3
      *
     C           K#432C    CHAINAM#PL43C            N61
     C           *IN61     IFEQ *OFF
     C                     MOVELM1LINO    DALINE
     C                     WRITEAB#PP441
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      * Check AM#PP432 (Open PO file from SCS) for a match *
      *
     C           CHK432    BEGSR
      *
     C                     Z-ADD*ZERO     QTY432  50
      *
     C                     MOVELBAODRN    ODRN12
     C                     MOVELBAMHN1    MHN1
     C                     MOVELBAMHN2    MHN2
     C                     MOVELBAMHN3    MHN3
      *
     C           K#432C    CHAINAM#PL43C             61
     C           *IN61     IFEQ *OFF
      *
     C                     MOVELM1DDD     DDD
     C                     MOVELM1YY      DDDYY
     C                     MOVELM1MM      DDDMM
     C                     MOVELM1DD      DDDDD
     C           BANYMD    IFNE DDDYMD
     C                     MOVELM1ODDD    ODDD
     C                     MOVELM1OYY     ODDDYY
     C                     MOVELM1OMM     ODDDMM
     C                     MOVELM1ODD     ODDDDD
     C                     EXSR WRTWF
     C                     ENDIF
      *
     C                     Z-ADD1         M1PGNO           FLAG IT AS FOUND
     C                     UPDATAM#PL43R
     C                     Z-ADDM1UQTY    QTY432
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------*
      * Write to Shortage Workfile - ALDWP27               *
      *
     C           WRTWF     BEGSR
      *
     C                     CLEARALDWP271
     C                     MOVEL'QFIXR'   W1KOME
     C                     MOVELW#PGM     W1KPGM
     C                     Z-ADDSDATE     W1SSHZ
     C                     Z-ADDSTIME     W1SSTI
      *
     C                     MOVELODDYMD    W1SHID
     C                     Z-ADDBANYMD    W1RDA
     C                     Z-ADDBANONY    W1NONY
     C                     MOVELBANUKE    W1NUKE
     C                     MOVELBAHPOS    W1HPOS
     C                     MOVELBAODRN    W1ORD#
     C                     MOVELMHN       W1MHN
     C                     MOVELM1LINO    W1LINE
     C                     MOVELBALIN#    W1LIN#
     C                     Z-ADDBASRYO    W1ODER
     C                     WRITEALDWP271
      *
     C                     ENDSR
      *----------------------------------------------------*
