     H            Y.
     F** AB#R89 *******************************************
     F*    EDIT ADF PART #                                *
     F*    K.KASHIWAGI 2000.11.27                         *
     F******************************************* AB#R89 **
     FAB#PL88 IF  E           K        DISK
     E                    HCD        10  2 0
     E                    HPTI       20  1
     E                    HPTO       30  1
     I            DS
     I                                        1  200HCD
     I                                        1   20ABCD1
     I                                        3   40ABCD2
     I                                        5   60ABCD3
     I                                        7   80ABCD4
     I                                        9  100ABCD5
     I                                       11  120ABCD6
     I                                       13  140ABCD7
     I                                       15  160ABCD8
     I                                       17  180ABCD9
     I                                       19  200ABCD10
     C**********
     C*
     C           *ENTRY    PLIST
     C                     PARM           PCUST   40       CUSTOMER CODE
     C                     PARM           PPARTI 20        INPUT PART
     C                     PARM           PPARTO 30        OUTPUT PART
      *------*
      * KEY1 *
      *------*
     C*
     C           KEY1      KLIST
     C                     KFLD           ABCUST  40
     C*
     C                     MOVEAPPARTI    HPTI
     C*
     C                     Z-ADDPCUST     ABCUST
     C           KEY1      CHAINAB#PP881             80
     C           *IN80     IFEQ '0'
     C                     EXSR @EDIT
     C                     ELSE
     C                     MOVELPPARTI    PPARTO
     C                     SETON                         LR
     C                     RETRN
     C                     ENDIF
     C*
     C                     SETON                         LR
     C                     RETRN
     C*
     CSR         @EDIT     BEGSR
     C                     Z-ADD0         X       20
     C                     Z-ADD0         Y       20
     C                     Z-ADD0         Z       20
     C                     Z-ADD0         W       20
     C*
     C                     DO   10
     C                     ADD  1         X
     C           HCD,X     IFEQ 0
     C                     LEAVE
     C                     ENDIF
     C*
     C                     Z-ADDHCD,X     Y
     C                     DO   Y
     C                     ADD  1         Z       20
     C                     ADD  1         W
     C                     MOVEAHPTI,Z    HPTO,W
     C                     ENDDO
     C*
     C                     ADD  1         W
     C                     MOVEL'-'       HPTO,W
     C                     ENDDO
     C*
     C                     Z-ADD30        C       20
     C                     DO   30
     C           HPTO,C    IFNE '-'
     C           HPTO,C    ANDNE*BLANKS
     C                     LEAVE
     C                     ENDIF
     C                     MOVEL*BLANK    HPTO,C
     C           C         SUB  1         C
     C                     ENDDO
     C*
     C                     MOVEAHPTO      PPARTO
     C*
     C                     ENDSR
