     H            Y.
      ** AB#R2V ********************************************************
      *  .. CREATE TOYOTA EXPORT MASTER LABEL W/F                      *
      *        LEC        2017.07.28                                   *
      ******************************************************** AB#R2V **
     FAB#PL15 IF  E           K        DISK
     FAB#PL40 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK
     FAB#WP2IEO   E           K        DISK                      A
      *
     I            DS
     I                                        1   80NOHZ
     I                                        1   40NOYY
     I                                        5   60NOMM
     I                                        7   80NODD
     I            DS
     I                                        1  20 MHN
     I                                        1   5 MHN1
     I                                        6  10 MHN2
     I                                       11  15 MHN3
     I                                       16  20 MHN4
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           NONY    40
     C                     PARM           NKOJ    1
     C                     PARM           NUKE    4
     C                     PARM           INOHZ   80
     C                     PARM           NOBN    20
     C                     PARM           ODRN   10
     C                     PARM           IMHN   20
     C                     PARM           RTN     1
      *
      * AB#R2K
     C           P2        PLIST
     C                     PARM           PIQTY  300       NUMERIC QTY
     C                     PARM           POQTY  30        CHAR    QTY
      *
      *-----*
      * KEY *
      *-----*
     C           KEY1      KLIST
     C                     KFLD           TOKU
     C                     KFLD           NONY
     C                     KFLD           NKOJ
     C                     KFLD           NUKE
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     KFLD           MHN3
     C                     KFLD           MHN4
     C                     KFLD           ODRN
     C                     KFLD           NOYY
     C                     KFLD           NOMM
     C                     KFLD           NODD
     C                     KFLD           NOBN
      *
     C           KEY2      KLIST
     C                     KFLD           KWRD1   8        keyword 1
     C                     KFLD           KWRD2   8        keyword 2
      *
     C           KEY3      KLIST
     C                     KFLD           NONY
     C                     KFLD           NOYY
     C                     KFLD           NOMM
     C                     KFLD           NODD
     C                     KFLD           NUKE
     C                     KFLD           MHN1
     C                     KFLD           MHN2
     C                     KFLD           MHN3
     C                     KFLD           MHN4
     C                     KFLD           NOBN
     C                     KFLD           ODRN15
      *
     C                     MOVELINOHZ     NOHZ
     C                     MOVELIMHN      MHN
      *
     C                     MOVE '1'       RTN
     C                     Z-ADD3411      TOKU    40
     C                     MOVEL'TOYEXP'  KWRD1
      *
      *----------------*
      * TOYOTA EXPORT  *
      *----------------*
      * AB#PP10 --------------------------------
     C           KEY1      SETLLAB#PL15
     C           *IN80     DOUEQ*ON
     C           KEY1      READEAB#PL15                  80
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     EXSR GETSEQ
     C                     EXSR WRT2IE
     C                     MOVE '0'       RTN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C*****************************************************************
      * WRT2IE:  WRITE TO TOYOTA EXPORT MASTER LABEL W/F
     C*****************************************************************
     C           WRT2IE    BEGSR
      *
     C                     MOVELBAINVN    ODRN15 15
      *
      * get plant code from edi file AB#PP40.
     C           KEY3      SETLLAB#PL40
     C           *IN52     DOUEQ*ON
     C           KEY3      READEAB#PL40                  52
     C           *IN52     IFEQ *OFF
     C           DASKJY    ANDEQ*BLANK
     C                     MOVELDAMANC    E2FACT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELBAMHIN    E2PART
     C                     MOVELBASBAN    E2SBAN
      *
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     E2QTY
      *
     C                     MOVELBANOHZ    E2SHDT
     C                     MOVEL'14060'   E2SBN5
     C                     MOVELBANUKE    E2DOCK
     C                     MOVELBANONY    E2DELY
      *
     C                     WRITEAB#WP2I1
      *
     C                     ENDSR
     C*****************************************************************
      * GETSEQ:  RETRIEVE AND UPDATE THE SEQUENCE NUM.
     C*****************************************************************
     C           GETSEQ    BEGSR
      *
     C           KEY2      CHAINAB#PPCT              51
     C           *IN51     IFEQ *OFF
      *
     C           CTNBR1    IFLT 999999
     C           CTNBR1    ADD  1         CTNBR1
     C                     ELSE
     C                     Z-ADD1         CTNBR1
     C                     ENDIF
      *
     C                     UPDATAB#PPCT1
     C                     ENDIF
      *
     C                     Z-ADDCTNBR1    #SEQNO  60
     C                     MOVEL#SEQNO    E2SEQ#
      *
     C                     ENDSR
     C*****************************************************************
