     H            Y.
     F** AB#RHE *********************************************
     F*  HONDA PRE-ORDER SHIP DATE INQUIRY                  *
     F*  J.WATANABE   2020.12.09                            *
JW1  F*  J.WATANABE   2020.12.21 ADD TOTAL                  *
     F*******************************************************
     FAB#PWHE CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAB#PL2R IF  E           K        DISK
     FAB#WPHE UF  E           K        DISK                      A
     F*******************************************************
     E                    MSG     1  10 70
     E                    DAT        20  8 0
     E                    #DT        20  4 0
     E                    #DY        20  3
     E                    WBX        20  5 0
      * DISPLAY
     E                    HTL        10  4 0
     E                    HDT        10  4 0
     E                    HDY        10  3
     E                    SBX        10  4 0
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
      *
     I            DS
     I                                        1  400SBX
     I                                        1   40SBOX01
     I                                        5   80SBOX02
     I                                        9  120SBOX03
     I                                       13  160SBOX04
     I                                       17  200SBOX05
     I                                       21  240SBOX06
     I                                       25  280SBOX07
     I                                       29  320SBOX08
     I                                       33  360SBOX09
     I                                       37  400SBOX10
     I            DS
     I                                        1  400HTL
     I                                        1   40HTL01
     I                                        5   80HTL02
     I                                        9  120HTL03
     I                                       13  160HTL04
     I                                       17  200HTL05
     I                                       21  240HTL06
     I                                       25  280HTL07
     I                                       29  320HTL08
     I                                       33  360HTL09
     I                                       37  400HTL10
     I            DS
     I                                        1  400HDT
     I                                        1   40HDT01
     I                                        5   80HDT02
     I                                        9  120HDT03
     I                                       13  160HDT04
     I                                       17  200HDT05
     I                                       21  240HDT06
     I                                       25  280HDT07
     I                                       29  320HDT08
     I                                       33  360HDT09
     I                                       37  400HDT10
     I            DS
     I                                        1  30 HDY
     I                                        1   3 HDY01
     I                                        4   6 HDY02
     I                                        7   9 HDY03
     I                                       10  12 HDY04
     I                                       13  15 HDY05
     I                                       16  18 HDY06
     I                                       19  21 HDY07
     I                                       22  24 HDY08
     I                                       25  27 HDY09
     I                                       28  30 HDY10
     I            DS
     I                                        1 1000WBX
     I                                        1   50W1BX01
     I                                        6  100W1BX02
     I                                       11  150W1BX03
     I                                       16  200W1BX04
     I                                       21  250W1BX05
     I                                       26  300W1BX06
     I                                       31  350W1BX07
     I                                       36  400W1BX08
     I                                       41  450W1BX09
     I                                       46  500W1BX10
     I                                       51  550W1BX11
     I                                       56  600W1BX12
     I                                       61  650W1BX13
     I                                       66  700W1BX14
     I                                       71  750W1BX15
     I                                       76  800W1BX16
     I                                       81  850W1BX17
     I                                       86  900W1BX18
     I                                       91  950W1BX19
     I                                       96 1000W1BX20
      *
     I            DS
     I                                        1  140@SDAT
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     SELEC
     C           SCRN#     WHEQ '01'
     C                     EXSR #DSP01
      *
     C           SCRN#     WHEQ '02'
     C                     EXSR #DSP02
      *
     C                     OTHER
     C                     LEAVE
     C                     ENDSL
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *====================================================*
      * 1ST SCREEN                                         *
      *====================================================*
     C           #DSP01    BEGSR
      *
     C           SCRN#     DOWEQ'01'
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    XMSG
     C                     SETOF                     414285
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      SCRN#
     C                     LEAVE
      *
     C                     OTHER
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
      * IF NO ERROR
     C                     MOVE '02'      SCRN#
     C                     LEAVE
     C                     ENDSL
     C                     ENDDO
      *
     C                     ENDSR
      *====================================================*
      * CHECK 1ST SCREEN ENTRY DATA                        *
      *====================================================*
     C           #CHK1     BEGSR
      * CHECK DATE FROM
     C           XFROM     IFEQ *BLANK
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVELMSG,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELXFROM     $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ '1'
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVELMSG,3     XMSG
     C                     GOTO XCHK1
     C                     ELSE
     C                     MOVEL$TRUE1    HFROM
     C                     MOVEL$TRUE2    XFROM
     C                     ENDIF
      * CHECK DATE TO
     C           XTO       IFEQ *BLANK
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN42
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XTO       IFEQ '99999999'
     C                     MOVEL'99999999'HTO
     C                     ELSE
     C                     MOVELXTO       $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN    1
     C           $RTN      IFEQ '1'
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN42
     C                     MOVELMSG,4     XMSG
     C                     GOTO XCHK1
     C                     ELSE
     C                     MOVEL$TRUE1    HTO
     C                     MOVEL$TRUE2    XTO
     C                     ENDIF
     C                     ENDIF
      *
     C           HFROM     IFGT HTO
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN42
     C                     MOVELMSG,5     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR...
     C                     EXSR #CLR
     C                     EXSR #DSET
      *
     C           *IN85     IFEQ *ON
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELMSG,6     XMSG
      *
     C           XCHK1     ENDSR
      *====================================================*
      * SET WORK FILE (AB#WPHE)                            *
      *====================================================*
     C           #DSET     BEGSR
      *
     C                     Z-ADD0         RCNT    50
      *
     C                     MOVE 'Y'       FIRST   1
     C                     Z-ADD0         @BOX    50
     C                     Z-ADDHFROM     KEY01   80
     C           KEY01     SETLLAB#PL2R
      *
     C                     DO   *HIVAL
     C                     READ AB#PL2R                  98
     C   98                LEAVE
      * IGNORE
     C           ACPLSH    IFGT @LAST
     C                     ITER
     C                     ENDIF
     C           ACUPID    IFNE ' '
     C                     ITER
     C                     ENDIF
     C           ACQNTY    IFEQ 0
     C                     ITER
     C                     ENDIF
      * FIRST ?
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     Z-ADDACPLSH    SVPLSH  80
     C                     Z-ADDACNONY    SVNONY  40
     C                     ENDIF
      * BREAK ?
     C           ACPLSH    IFNE SVPLSH
     C           ACNONY    ORNE SVNONY
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL PROCESS
     C           ACCQTY    IFEQ 0
     C                     Z-ADDACQNTY    @QPC    50
     C                     ELSE
     C                     Z-ADDACCQTY    @QPC
     C                     ENDIF
      *
     C           ACQNTY    DIV  @QPC      XBOX    50
     C                     MVR            RMT     50
     C           RMT       IFGT 0
     C                     ADD  1         XBOX
     C                     ENDIF
     C                     ADD  XBOX      @BOX
      *
     C                     ENDDO
      * LAST BRAEK
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C           RCNT      IFEQ 0
     C                     MOVE *ON       *IN85
     C                     MOVE *ON       *IN41
     C                     MOVELMSG,7     XMSG
     C                     ENDIF
      *
     C                     ENDSR
      *===================================*
      * BREAK FOR OPTION 1                *
      *===================================*
     C           #BRK1     BEGSR
      *
     C                     Z-ADD1         IX      20
     C           SVPLSH    LOKUPDAT,IX                   20
     C           *IN20     IFEQ *OFF
     C                     GOTO RESET
     C                     ENDIF
      *
     C           SVNONY    CHAINAB#WPHE              88
     C           *IN88     IFEQ *OFF
     C                     ADD  @BOX      WBX,IX
     C                     UPDATAB#WPHE1
     C                     ELSE
     C                     CLEARAB#WPHE1
     C                     Z-ADDSVNONY    W1NONY
     C                     Z-ADDHFROM     W1SDAT
     C                     ADD  @BOX      WBX,IX
      *
     C                     MOVELSVNONY    $DLV
     C                     CALL 'UTLR62'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C                     MOVEL$NAME1    W1NAME
      *
     C                     WRITEAB#WPHE1
     C                     ADD  1         RCNT
     C                     ENDIF
      *
     C           RESET     TAG
     C                     Z-ADDACPLSH    SVPLSH
     C                     Z-ADDACNONY    SVNONY
     C                     Z-ADD0         @BOX
      *
     C                     ENDSR
      *====================================================*
      * 2ND SCREEN                                         *
      *====================================================*
     C           #DSP02    BEGSR
      *
     C                     Z-ADD1         W@PAGE
     C                     EXSR #DSET1
      *
     C           SCRN#     DOWEQ'02'
      *
     C                     MOVE *ON       *IN56
     C                     MOVELMSG,10    XCMD
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN56
     C                     MOVEL*BLANK    XMSG
     C                     SETOF                     414285
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      SCRN#
     C                     LEAVE
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      SCRN#
     C                     LEAVE
      * F8: LEFT (<--)
     C           *INKH     WHEQ *ON
     C           W@PAGE    IFEQ 2
     C                     Z-ADD1         W@PAGE
     C                     EXSR #DSET1
     C                     ENDIF
      * F9: RIGHT (-->)
     C           *INKI     WHEQ *ON
     C           W@PAGE    IFEQ 1
     C                     Z-ADD2         W@PAGE  10
     C                     EXSR #DSET2
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C           XDSP02    ENDSR
      *====================================================*
      * CLEAR WORK FILE                                    *
      *====================================================*
     C           #CLR      BEGSR
      *
     C           *LOVAL    SETLLAB#WPHE
     C                     DO   *HIVAL
     C                     READ AB#WPHE                  97
     C   97                LEAVE
     C                     DELETAB#WPHE1
     C                     ENDDO
      * SET DATE TABLE
     C                     EXSR #SETDT
      *
      *
     C                     ENDSR
      *====================================================*
      * SET DATE TABLE                                     *
      *====================================================*
     C           #SETDT    BEGSR
      *
     C                     Z-ADD-1        IY      40
     C                     MOVELHFROM     $DT8
     C                     MOVE '+'       $SIGN
     C                     MOVE 'N'       $IAF
     C           1         DO   20        IX
     C                     ADD  1         IY
     C                     MOVELIY        $DAYS
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
     C                     MOVEL$TGT8     DAT,IX
     C                     MOVE $TGT8     #DT,IX
      * GET DAY
     C                     CALL 'UTLR02'
     C                     PARM           $TGT8
     C                     PARM           $DAY    1
     C                     PARM           $WEEK#  1
     C                     PARM           $RTN    1
      *
     C                     SELEC
     C           $DAY      WHEQ '1'
     C                     MOVEL'MON'     #DY,IX
     C           $DAY      WHEQ '2'
     C                     MOVEL'TUE'     #DY,IX
     C           $DAY      WHEQ '3'
     C                     MOVEL'WED'     #DY,IX
     C           $DAY      WHEQ '4'
     C                     MOVEL'THU'     #DY,IX
     C           $DAY      WHEQ '5'
     C                     MOVEL'FRI'     #DY,IX
     C           $DAY      WHEQ '6'
     C                     MOVEL'SAT'     #DY,IX
     C           $DAY      WHEQ '7 '
     C                     MOVEL'SUN'     #DY,IX
     C                     OTHER
     C                     MOVEL'   '     #DY,IX
     C                     ENDSL
      *
     C                     ENDDO
     C                     MOVEL$TGT8     @LAST   80
      *
     C                     ENDSR
      *====================================================*
      * SET SUBFILE FOR 1ST PAGE                           *
      *====================================================*
     C           #DSET1    BEGSR
      * SET HEADER
     C           1         DO   10        IX
     C                     Z-ADD0         HTL,IX
     C                     MOVEL#DT,IX    HDT,IX
     C                     MOVEL#DY,IX    HDY,IX
     C                     ENDDO
      * CLEAR SFL
     C                     MOVE *ON       *IN57
     C                     WRITECTL01
     C                     MOVE *OFF      *IN57
     C                     Z-ADD0         RRN1
      * GET DATA
     C           *LOVAL    SETLLAB#WPHE
     C                     DO   *HIVAL
     C                     READ AB#WPHE             N    97
     C   97                LEAVE
      *
     C                     CLEARSFL01
     C                     Z-ADDW1NONY    SNONY
     C                     MOVELW1NAME    SNAME
     C           1         DO   10        IX
     C                     Z-ADDWBX,IX    SBX,IX
     C                     ENDDO
      * SET TOTAL
JW1  C                     ADD  SBX       HTL
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      * DEFAULT LINE
     C           RRN1      IFEQ 0
     C                     CLEARSFL01
     C                     Z-ADD1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     Z-ADD1         RRN1
      *
     C                     ENDSR
      *====================================================*
      * SET SUBFILE FOR 2ND PAGE                           *
      *====================================================*
     C           #DSET2    BEGSR
      * SET HEADER
     C                     Z-ADD10        IY
     C           1         DO   10        IX
     C                     ADD  1         IY
     C                     Z-ADD0         HTL,IX
     C                     MOVEL#DT,IY    HDT,IX
     C                     MOVEL#DY,IY    HDY,IX
     C                     ENDDO
      * CLEAR SFL
     C                     MOVE *ON       *IN57
     C                     WRITECTL01
     C                     MOVE *OFF      *IN57
     C                     Z-ADD0         RRN1
      * GET DATA
     C           *LOVAL    SETLLAB#WPHE
     C                     DO   *HIVAL
     C                     READ AB#WPHE             N    97
     C   97                LEAVE
      *
     C                     CLEARSFL01
     C                     Z-ADDW1NONY    SNONY
     C                     MOVELW1NAME    SNAME
     C                     Z-ADD10        IY
     C           1         DO   10        IX
     C                     ADD  1         IY
     C                     Z-ADDWBX,IY    SBX,IX
     C                     ENDDO
      * SET TOTAL
JW1  C                     ADD  SBX       HTL
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      * DEFAULT LINE
     C           RRN1      IFEQ 0
     C                     CLEARSFL01
     C                     Z-ADD1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     Z-ADD1         RRN1
      *
     C                     ENDSR
      *====================================================*
      * SET INITIAL VALUE                                  *
      *====================================================*
     C           #INIT     BEGSR
      *
     C                     TIME           @SDAT
     C                     MOVELTODAY     XFROM
     C                     MOVEL'99999999'XTO
     C                     MOVEL'01'      SCRN#   2
      * CLEAR TOTAL
     C           1         DO   10        IX
     C                     Z-ADD0         HTL,IX
     C                     ENDDO
      *
     C                     ENDSR
** MSG(70A) .......2.........3.........4.........5.........6.........7
ENTER DATE_FROM !                                                       1
ENTER DATE_TO !                                                         2
DATE_FROM IS INVALID !                                                  3
DATE_TO IS INVALID !                                                    4
FROM_DATE > TO_DATE !                                                   5
PRESS F12 TO GO BACK TO FIRST SCREEN...                                 6
NO DATA !                                                               7
                                                                        8
                                                                        9
F1:EXIT     F12:GO BACK     F8:LEFT(<--)     F9:RIGHT(-->)             10
