     H            Y.
     F** AB#R2CH ********************************************
     F* CHECK SERVICE PART FOR LARGE BAG
     F*                     2020.05.14                      *
     F*******************************************************
     FALDPP55 IF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           PART1   5
     C                     PARM           PART2   5
     C                     PARM           BAGFLG  1
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C           KEY       KLIST
     C                     KFLD           PART1
     C                     KFLD           PART2
      *
     C                     MOVE *BLANK    BAGFLG
     C           KEY       CHAINALDPP55              50
      *
     C           *IN50     IFEQ *OFF
     C                     MOVE '*'       BAGFLG
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
