     H            Y.
     FABBPL50 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAB#XP01 UF  E           K        DISK                      A
     E                    HSU        31  7 0
     E                    HYM         7  8 0
     I            DS
     I                                        1   80@NYMD
     I                                        1   60@NYM
     I                                        7   80D
     I            DS
     I                                        1 2170HSU
     I                                        1   70X1NN01
     I                                        8  140X1NN02
     I                                       15  210X1NN03
     I                                       22  280X1NN04
     I                                       29  350X1NN05
     I                                       36  420X1NN06
     I                                       43  490X1NN07
     I                                       50  560X1NN08
     I                                       57  630X1NN09
     I                                       64  700X1NN10
     I                                       71  770X1NN11
     I                                       78  840X1NN12
     I                                       85  910X1NN13
     I                                       92  980X1NN14
     I                                       99 1050X1NN15
     I                                      106 1120X1NN16
     I                                      113 1190X1NN17
     I                                      120 1260X1NN18
     I                                      127 1330X1NN19
     I                                      134 1400X1NN20
     I                                      141 1470X1NN21
     I                                      148 1540X1NN22
     I                                      155 1610X1NN23
     I                                      162 1680X1NN24
     I                                      169 1750X1NN25
     I                                      176 1820X1NN26
     I                                      183 1890X1NN27
     I                                      190 1960X1NN28
     I                                      197 2030X1NN29
     I                                      204 2100X1NN30
     I                                      211 2170X1NN31
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80WNYMD
     I                                        1   60WNYM
     I                                        1   40WNYY
     I                                        5   60WNMM
     I                                        7   80WNDD
      *---------------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           W1RCDT  80
     C                     KFLD           W1TOKU  40
     C           KEY2      KLIST
     C                     KFLD           W1RCDT
     C                     KFLD           W1TOKU
     C                     KFLD           BBNONY
     C                     KFLD           BBNKOJ
     C                     KFLD           BBNUKE
     C                     KFLD           BBSEBN
     C                     KFLD           BBMHN1
     C                     KFLD           BBMHN2
     C                     KFLD           BBMHN3
     C                     KFLD           BBMHN4
     C                     KFLD           W1DATE  60
     C           KEY3      KLIST
     C                     KFLD           WNYY
     C                     KFLD           WNMM
     C                     KFLD           WNDD
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
      * A MONTH AGO
     C                     Z-ADD20161003  W1RCDT
      *
     C                     Z-ADD0294      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0295      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0296      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0390      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0391      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0400      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD03135     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD01602     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD05382     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD05379     W1TOKU
     C                     EXSR #SB500
      *-----------------------------------------------------
      * THE LATEST
     C                     Z-ADD20161031  W1RCDT
      *
     C                     Z-ADD0294      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0295      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0296      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0390      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0391      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD0400      W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD03135     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD01602     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD05382     W1TOKU
     C                     EXSR #SB500
     C                     Z-ADD05379     W1TOKU
     C                     EXSR #SB500
      *---------------------------------------------------------
      *  END
      *---------------------------------------------------------
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
      *  READ ABBPP50
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY1      SETLLABBPL50
     C           *IN90     DOUEQ*ON
     C           KEY1      READEABBPL50                  90
     C           *IN90     IFEQ *OFF
      *
     C                     EXSR #SB511
      *
     C                     ENDIF
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      *  GET DATA
      *-----------------------------------------------------
     CSR         #SB511    BEGSR
      *
     C                     Z-ADD0         B       20
     C                     Z-ADD0         HYM
     C                     Z-ADD0         WKAD    20
     C                     Z-ADD0         CNT1    50
     C                     Z-ADDBBSDAT    WNYMD
      *
     C           KEY3      SETLLAGDPL121
B01  C                     DO   7
     C                     SETOF                     10
     C                     READ AGDPL121                 10
B02  C           *IN10     IFEQ '0'
      * DAILY
B03  C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C           F8YOBI    IFNE 1
     C           B         ANDEQ0
     C           CNT1      ANDEQ0
     C                     ADD  1         B
     C                     ADD  1         CNT1
     C                     Z-ADD1         WKAD
     C                     Z-ADDF8KAHZ    HYM,B
     C                     LEAVE
     C                     END
B03  C                     END
      *
B03  C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         B
     C                     ADD  1         CNT1
     C                     ADD  1         WKAD
     C                     Z-ADDF8KAHZ    HYM,B
E03  C                     END
      *
E02  C                     END
      *
     C                     ADD  1         CNT1
      *
E01  C  N10                ENDDO
      *
     C           WKAD      IFNE *ZERO
     C           BBSQTY    DIV  WKAD      WKSUR   70
     C                     MVR            WKSURX  73
     C                     END
      *
     C                     EXSR #SB512
      *
     CSR         ESB511    ENDSR
      *-----------------------------------------------------
     C           #SB512    BEGSR
      *-----------------------------------------------------
      *
     C                     SETOF                     12
     C                     Z-ADDWKSUR     WKSURS  70
     C                     Z-ADD1         A       20
      *
B01  C           1         DO   7         A
B02  C           HYM,A     IFNE 0
     C                     Z-ADDHYM,A     @NYMD
     C                     Z-ADD@NYM      W1DATE
     C** %0001 ADD REMAINDER TO FIRST FORECAST
     C           *IN12     IFEQ *OFF
     C                     SETON                     12
     C                     ADD  WKSURX    WKSUR
     C                     ELSE
     C                     Z-ADDWKSURS    WKSUR
     C                     ENDIF
     C**
     C                     SETOF                     11
     C           KEY2      CHAINAB#XP01              11
B03  C           *IN11     IFEQ '1'
     C                     CLEARAB#XP011
     C                     Z-ADDW1RCDT    X1RCDT
     C                     Z-ADDBBTOKU    X1TOKU
     C                     Z-ADDBBNONY    X1NONY
     C                     MOVELBBNKOJ    X1NKOJ
     C                     MOVELBBNUKE    X1NUKE
     C                     MOVELBBSEBN    X1SEBN
     C                     MOVELBBMHN1    X1MHN1
     C                     MOVELBBMHN2    X1MHN2
     C                     MOVELBBMHN3    X1MHN3
     C                     MOVELBBMHN4    X1MHN4
     C                     MOVELBBSHN1    X1SHN1
     C                     MOVELBBSHN2    X1SHN2
     C                     MOVELBBSHN3    X1SHN3
     C                     Z-ADD@NYM      X1DATE
     C                     Z-ADD0         HSU
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       X1NNSU
     C                     WRITEAB#XP011
     C                     ELSE
      *
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       X1NNSU
     C                     UPDATAB#XP011
      *
E03  C                     ENDIF
      *
E02  C                     ENDIF
E01  C                     ENDDO
      *
     CSR         ESB512    ENDSR
