     H            Y.
     ** AB#R0I1 **********************************
     *  ..EDI(850)  GENTRAN HONDA DUPLICATE CHECK
     *
     *   TCHK1  07/31/08  CREATE
     ********************************** AB#R0I1 **
     FAB#TL2C IF  E           K        DISK
      *---------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@EDID
     C                     PARM           P@PLNT
     C                     PARM           P@SHCD
     C                     PARM           P@ODRN
     C                     PARM           P@PLSH
     C                     PARM           P@MHN1
     C                     PARM           P@MHN2
     C                     PARM           P@MHN3
     C                     PARM           P@MHN4
     C                     PARM           P@SHTM
     C                     PARM           P@DLTM
     C                     PARM           P@UPID
     C                     PARM           P@DERR  1
     C           *LIKE     DEFN ACEDID    P@EDID
     C           *LIKE     DEFN ACPLNT    P@PLNT
     C           *LIKE     DEFN ACSHCD    P@SHCD
     C           *LIKE     DEFN ACODRN    P@ODRN
     C           *LIKE     DEFN ACPLSH    P@PLSH
     C           *LIKE     DEFN ACMHN1    P@MHN1
     C           *LIKE     DEFN ACMHN2    P@MHN2
     C           *LIKE     DEFN ACMHN3    P@MHN3
     C           *LIKE     DEFN ACMHN4    P@MHN4
     C           *LIKE     DEFN ACSHTM    P@SHTM
     C           *LIKE     DEFN ACDLTM    P@DLTM
     C           *LIKE     DEFN ACUPID    P@UPID
     C           K#KEY     KLIST
     C                     KFLD           P@EDID
     C                     KFLD           P@PLNT
     C                     KFLD           P@SHCD
     C                     KFLD           P@ODRN
     C                     KFLD           P@PLSH
     C                     KFLD           P@MHN1
     C                     KFLD           P@MHN2
     C                     KFLD           P@MHN3
     C                     KFLD           P@MHN4
     C                     KFLD           P@SHTM
     C                     KFLD           P@DLTM
     C                     KFLD           P@UPID
     C*
     C                     MOVEL*BLANK    P@DERR
     C*
     C           K#KEY     SETLLAB#TL2C
     C*
     C                     DO   *HIVAL
     C*
     C           K#KEY     READEAB#TL2C                  99
     C   99                LEAVE
     C           *IN99     IFEQ *OFF
     C                     MOVEL*ON       P@DERR
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
