     H            Y.
      ** AB#R50 ***********************************
      *  SALES PROCESSINGS FROM SALES VOTES       *
      *  PROGRAM ID.    :  AB#R50.      <RPG>     *
      *  CREATE DATE.   :  JUL/07/1997.           *
      *  AUTHOR.        :  S.OHTAKE               *
      *********************************** AB#R50 **
     FAB#PW50 CF  E                    WORKSTN
     FAB#PP50 UF  E           K        DISK                      A
     FDA#PL12 IF  E           K        DISK
     E                    CHK         7  1               BARCODE
     E                    ER      1   3 60               ERROR MESSAGE
     E                    TABX1  11  43  1   TABY1   2 0 CHR->NUMERI
     E                    TABX2  11  43  2 0 TABY2   1   NUMERIC->CH
      *---------*
      * BARCODE *
      *---------*
     I            DS
     I                                        1   8 NBAR
     I                                        1   7 JY
     I                                        1   20JYMM
     I                                        3   70JYNO
     I                                        8   8 CHKD
     C           KEY1      KLIST
     C                     KFLD           JYMM
     C                     KFLD           JYNO
      *----------------------------*
      *  START  PROGRAM  <AB#R50>  *
      *----------------------------*
     C                     MOVE *BLANK    NBAR
     C                     MOVE *BLANK    OBAR
     C                     Z-ADD0         KENS    50
      *
     C           STP1      TAG
     C                     EXFMTAB#PW501
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C           KENS      IFEQ 0
     C                     SETON                     U1
     C                     ENDIF
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C           NBAR      IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C                     EXSR EXTSUB
     C           ERRF      IFEQ '*'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C                     EXSR CHKSUB
     C           CHKD      IFNE PCHKD
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C                     Z-ADDJYMM      ABJYMM
     C                     Z-ADDJYNO      ABJYNO
     C                     WRITEAB#PP501
      *
     C           KENS      ADD  1         KENS
     C                     MOVE NBAR      OBAR
     C                     MOVE *BLANK    NBAR
     C                     GOTO STP1
      *=================*
      * EXISTENCE CHECK *
      *=================*
     C           EXTSUB    BEGSR
     C                     MOVE *BLANK    ERRF    1
     C                     SETOF                     70
     C           KEY1      CHAINAB#PP50              70
     C           *IN70     IFEQ '0'
     C                     MOVE '*'       ERRF
     C                     ENDIF
      *
     C                     SETOF                     70
     C           KEY1      CHAINDA#PL121             70
     C           *IN70     IFEQ '0'
     C           B8UKHZ    IFNE 0
     C                     MOVE '*'       ERRF
     C                     END
     C                     END
     C                     ENDSR
      *============*
      * CHECKDIGIT *
      *============*
     C           CHKSUB    BEGSR
     C                     MOVEAJY        CHK
     C                     Z-ADD7         XX      20
     C                     Z-ADD0         I       20
     C                     Z-ADD0         WKKEI   50
     C           1         DO   XX        I
     C                     SETOF                     75
     C           CHK,I     LOKUPTABX1     TABY1          75
     C           *IN75     IFEQ '1'
     C                     ADD  TABY1     WKKEI
     C                     END
     C                     END
      *
     C           WKKEI     DIV  43        WKSHO   20
     C                     MVR            WAMARI  20
      *
     C                     SETOF                     75
     C           WAMARI    LOKUPTABX2     TABY2          75
     C           *IN75     IFEQ '1'
     C                     MOVE TABY2     PCHKD   1
     C                     END
     C                     ENDSR
**  ER
E-01 PLEASE READ THE BARCODE
E-02 IT'S A BARCODE READING ERROR
E-03 IT'S ALREADY A READ BARCODE
**     TABX1,TABY1
000101202303404505606707808909A10
B11C12D13E14F15G16H17I18J19K20L21
M22N23O24P25Q26R27S28T29U30V31W32
X33Y34Z35-36.37 38\39/40+41%42
**     TABX2,TABY2
00001102203304405506607708809910A
11B12C13D14E15F16G17H18I19J20K21L
22M23N24O25P26Q27R28S29T30U31V32W
33X34Y35Z36-37.38 39\40/41+42%
