     H            Y/
     F***************************************************
     F*  RE-PRINT FORD PICKUP LIST/PALLETIZED LIST      *
     F*                                                 *
     F*                                                 *
     F*     CHECK QTY/CONT.    08/21/2003               *
%0001F*     CHECK PRINTER TYPE 07/01/2018   T.SAKAKI    *
     F***************************************************
     FAB#PWG1 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FABF6L02 IF  E           K        DISK
      *------------------------------------------------------------
     E                    ERR     1   2 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@REYY
     I                                        5   60K@REMM
     I                                        7   80K@REDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           P#CALL    PLIST
     C                     PARM           P@SIRE  4
     C                     PARM           D@FACT
     C                     PARM           D@SHDT
     C                     PARM           D@RLDT
     C                     PARM           D@BIN
     C                     PARM           D@DOCK
     C                     PARM           D@OPTN
     C                     PARM           D@ACDT
     C                     PARM           D@PRT
     C           P#FR03    PLIST
     C                     PARM           P@SIRE
     C                     PARM           D@DOCK
     C                     PARM           D@SHDT
     C                     PARM           D@BIN
     C                     PARM           D@RLDT
     C                     PARM           P@FLG   1
      *
     C           K#ABF     KLIST
     C                     KFLD           D@SHDT
     C                     KFLD           D@BIN
     C                     KFLD           K@REYY
     C                     KFLD           K@REMM
     C                     KFLD           K@REDD
     C                     KFLD           D@DELV
     C                     KFLD           D@DOCK
      *
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
      *
     C                     MOVE *BLANK    P@FLG
     C                     CALL 'ABFR03'  P#FR03
     C           P@FLG     IFEQ *BLANK
     C                     EXSR #CALL
     C                     ENDIF
     C                     MOVEL'99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C           D@OPTN    IFLT '1'
     C           D@OPTN    ORGT '3'
     C                     MOVE ERR,2     D@MSG
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     Z-ADDD@RLDT    K@YMD
     C           K#ABF     CHAINABF6L02              90
     C           *IN90     IFEQ *ON
     C  N99                MOVE ERR,1     D@MSG
     C  N99                MOVEA'11111'   *IN,62
     C  N99                SETON                     99
     C                     ENDIF
      *%0001
     C           D@PRT     IFEQ '1'
     C           D@PRT     OREQ '2'
     C           D@PRT     OREQ '3'
     C           D@PRT     OREQ '4'
     C           D@PRT     OREQ '5'
     C           D@PRT     OREQ '6'
     C           D@PRT     OREQ '7'
     C           D@PRT     OREQ '8'
     C           D@PRT     OREQ '9'
     C                     ELSE
     C  N99                MOVE ERR,2     D@MSG
     C  N99                SETON                     6899
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVEA'0'       *IN,68
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CALL
      *------------------------------------------------------
     C           #CALL     BEGSR
      *
     C                     MOVE D@DELV    P@SIRE
     C                     CALL 'AB#CG1'  P#CALL
      *
     C                     ENDSR
      *------------------------------------------------------
**  ERR
   NO DATA
 OPTION ERROR
