     H            Y.
     F** AB#R2F *******************************
     F*  PMO/ARJ ORDER PROCESSING             *
     F*                                       *
     F*           NOV/12/03                   *
     F*
     F******************************* AB#R2F **
     FAB#PW2Y CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
%0001FAB#WP452IF  F     256            DISK
     FAAHTL06 IF  E           K        DISK
     FAAFTL06 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *--------------------------------------------------------
     E                    CMD     1   1 78
     E                    MSG     1   4 78
      *--------------------------------------------------------
     IAB#WP452AA  01
     I                                        1   4 ISIRE
     I                                        5   5 ISIRK
     I                                        6   90ITOKU
     I                                       10  130INONY
     I                                       14  14 INKOJ
     I                                       15  18 INUKE
     I                                       19  22 ISBAN
     I                                       23  42 IMHIN
     I                                       23  27 IMHN1
     I                                       28  32 IMHN2
     I                                       33  37 IMHN3
     I                                       38  42 IMHN4
     I                                       43  500INOHZ
     I                                       43  460INOYY
     I                                       47  480INOMM
     I                                       49  500INODD
     I                                       51  60 IODRN
     I                                       61  670ISRYO
     I                                       68  730ISYOS
     I                                       74  770INOTM
     I                                       78  89 ISHIN
     I                                       78  82 ISHN1
     I                                       83  87 ISHN2
     I                                       88  89 ISHN3
     I                                       90  93 ICARD
     I                                       94  97 IALFL
%0001I                                       98  990INOBN
%0001I                                      100 1050IUSYS
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80A2SSHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------------
      * INITIALIZE
      *------------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@CHK   1
      *
     C                     MOVE *ALL'-'   @@LIN 125
     C                     TIME           @@TIME  60
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     MOVE *OFF      *IN98
      *
     C           KEY1      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     Z-ADD*ZERO     RRN1    40
     C           *IN90     DOUEQ*ON
     C                     READ AB#WP452                 90
     C           *IN90     IFEQ *OFF
     C                     MOVEA'00'      *IN,61
     C                     CLEARSFL01
      *
     C                     MOVE ISRYO     S@SRYO
     C                     MOVELIMHIN     S@MHIN
     C                     Z-ADDISYOS     S@ISYS
     C                     Z-ADDIUSYS     S@USYS
      *
     C                     MOVELIMHIN     WMHIN
     C                     MOVELITOKU     PTOKU   4
     C                     MOVELINONY     PNONY   4
      *
     C                     MOVELINKOJ     PNKOJ   1
     C                     MOVELINUKE     PNUKE   4
     C                     MOVELWMHIN     @MHIN  20 P
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C                     Z-ADD*ZERO     WSYOS   90
     C           KEY1      CHAINFCEPL011             77
     C           *IN77     IFEQ '0'
     C           A2GSKD    ANDEQ*BLANK
     C           A2SSHZ    IFLE *DATE
     C                     Z-ADDA2SSYS    WSYOS
     C                     ELSE
     C                     Z-ADDA2KSYS    WSYOS
     C                     ENDIF
     C                     Z-ADDWSYOS     S@ISYS
     C                     ELSE
     C                     ADD  1         RRN1
     C                     MOVELMSG,3     S@ERR
     C                     MOVELIMHIN     S@MHIN
     C                     Z-ADDWSYOS     S@ISYS
     C                     Z-ADDIUSYS     S@USYS
     C                     WRITESFL01
     C                     EXSR #ERR
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     S@SETQ
     C           KEY1      SETLLAAHTL06
     C           *IN77     DOUEQ*ON
     C           KEY1      READEAAHTL06                  77
     C           *IN77     IFEQ *OFF
     C           L6SKJY    ANDEQ*BLANK
     C           L6STHZ    ANDEQ99999999
     C                     Z-ADDL6KMAX    S@SETQ
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN77     IFEQ *ON
     C           KEY1      SETLLAAFTL06
     C           *IN77     DOUEQ*ON
     C           KEY1      READEAAFTL06                  77
     C           *IN77     IFEQ *OFF
     C           A3SKJY    ANDEQ*BLANK
     C           A3STHZ    ANDEQ99999999
     C                     Z-ADDA3KMAX    S@SETQ
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     @@CON
     C           WSYOS     IFNE *ZERO
     C           ISRYO     DIV  WSYOS     @@CON   50
     C                     ENDIF
      *
     C           S@ISYS    IFNE S@USYS
     C           S@USYS    ANDNE*ZERO
     C           S@ISYS    ANDNE*ZERO
     C                     ADD  1         RRN1
     C                     MOVE *ON       *IN61
     C                     MOVELMSG,1     S@ERR
     C                     MOVELMSG,4     D@MSG
     C                     MOVE '1'       P@CHK
     C                     WRITESFL01
     C                     EXSR #ERR
     C                     ENDIF
      *
     C           @@CON     IFNE *ZERO
     C           @@CON     ANDGTS@SETQ
     C           S@SETQ    ANDGT*ZERO
     C                     MOVE *ON       *IN62
     C                     ADD  1         RRN1
     C                     Z-ADDWSYOS     S@ISYS
     C                     Z-ADDIUSYS     S@USYS
     C                     MOVELMSG,2     S@ERR
     C                     WRITESFL01
     C                     EXSR #ERR
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     MOVE '99'      @@ID
     C                     ELSE
     C                     MOVE '01'      @@ID    2
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------
     C           #SCRN1    BEGSR
      *----------------------------------------------------
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     MOVE '99'      @@ID
      *
     C                     ENDSR
      *----------------------------------------------------
     C           #ERR      BEGSR
      *----------------------------------------------------
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  110
     O                         @@TIME   119 '  :  :  '
     O                                  122 'P.'
     O                         PAGE  Z  126
     O        E   02           @HED
     O                                   60 'WARNING ERROR REPORT'
     O        E   04           @HED
     O                                   60 '# OF'
     O                                   67 'CUST'
     O                                   75 'IAF'
     O                                   84 '# OF'
     O        E   05           @HED
     O                                    5 'CUST'
     O                                   10 'DELV'
     O                                   21 'SHIP DATE'
     O                                   38 'CUST PART NUMBER'
     O                                   54 'ORER QTY'
     O                                   60 'BOX'
     O                                   68 'QTY/BOX'
     O                                   76 'QTY/BOX'
     O                                   84 'KANBNS'
     O        E   06           @HED
     O                         @@LIN    125
     O        E 1              @DTL
     O                         ITOKU      5
     O                         INONY     10
     O                         INOHZ     21 '    /  /  '
     O                         IMHN1     27
     O                                   28 '-'
     O                         IMHN2     33
     O                                   34 '-'
     O                         IMHN3     39
     O                                   40 '-'
     O                         IMHN4     45
     O                         ISRYO 1   54
     O                         @@CON 1   60
     O                         IUSYS 1   68
     O                         ISYOS 1   76
     O                         S@SETQ1   84
     O                         S@ERR    109
** CMD
 ENTER:END
** MSG
QTY/BOX DIFFERENCE
# OF CNT.> # OF KANBN
NO PART MASTER
PLEASE CHANGE THE QTY/CONT OF THE ORIGINAL DATA AND UPLOAD IT AGAIN.
