     H*           Y
     H** AB#RFQ  PRINT WEEKLY ORDER SHEET (EXPORT MENU) ************************
     H*                                                                        *
     H*  TCH 02.19.00                                                          *
     H*  TCH 08.07.01                                                          *
TCH20H*  TCH 01.27.05  CHANGE BIN# TO '02'                                     *
TCH73H*  TCH 06.20.05  IFA PART# FOR W7071-93S90-0                             *
TCHK1H*TCHK1 01.12.06  CHG GENERATE BILL OF LADING#(INVOICE#)
TCHK2H*TCHK2 03.12.08  CHG 5111(AUSTRALIA) BIN#:05
TCHK3H*TCHK3 04.30.08  RMV 5111(AUSTRALIA) BIN#:05
TCHK4H*TCHK4 07.24.08  CHG BBHR50 PARM
TCHK5H*TCHK5 10.18.12  ADD 6653A(0001:FIRST AQUITAINE) EXPORT
TCHK6H*TCHK6 10.19.12  RMV 6653A(0001:FIRST AQUITAINE) EXPORT
TCHK7H*TCHK7 02.12.13  CHG CFDOCK LENGTH(4 --> 5)
     H**************************************************************************
     H*
     H* *IN03 = (CF03) EXIT
     H* *IN05 = (CF03):PRINT
     H* *IN89 = 0(FIRST PRINT DATA)
     H* *IN90 = 1(NOT READ AGDPL12:CALENDER FILE)
     H* *IN91 = 1(NOT READ AFAPP30:FORECAST KEY FILE(FORD)
     H* *IN92 = 1(NOT READ ABFDP01:ROUTE CODE MASTER(NIRVANA)
     H* *IN93 = 1(NOT READ ABFPL10:FORECAST DATA
     H* *IN94 = 1(NOT READ FCEPL01:PART MASTER
     H* *IN95 = 1(NOT READ ABFAL01:EDI862 KEY FILE)
     H* *IN96 = 1(NOT READ ABF9P01:FORD ADDRESS MASTER)
     H* *IN98 = 1(DISPLAY MSG)
     H* *IN99 = INPUT ERROR
     H*
     H**************************************************************************
     FAB#PWF11CF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK
     FABFPP30 IF  E           K        DISK
     FABFDP01 IF  E           K        DISK
     FABFPL10 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FABFAL01 IF  E           K        DISK
     FABF9P01 IF  E           K        DISK
     FABFDL01 IF  E           K        DISK
     FABFEP01 IF  E           K        DISK
     F*BFDL01 IF  E           K        DISK
     F*BF2L02 IF  E           K        DISK
     FAB#WP451O   F     256            DISK
     F*PRINT  O   F     132     OF     PRINTER
     F**************************************************************************
     E                    MES     1   2 78
     I**************************************************************************
     I* SCHEDULE ISSUE DATE ABFPP30
     I            DS
     I                                        3   80WGSIDT
     I                                        1   80CGSIDT
     I* INPUT DATE(DISPLAY)
     I            DS
     I                                        3   80W@DATE
     I                                        1   40@YY
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   80WSDAT
     I                                        1   40PSYYY
     I                                        5   60PSMMM
     I                                        7   80PSDDD
     I            DS
     I                                        1   80WR@DAT
     I                                        1   40PRYYY
     I                                        5   60PRMMM
     I                                        7   80PRDDD
     I            DS
     I                                        1   80A2SSHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I* PART(KEY FILE)
     I            DS
     I*                                       1  12 CGPART
     I                                        1  12 FBIPAR
     I                                        1   5 WPART1
     I                                        6  10 WPART2
     I                                       11  12 WPART3
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
     I            DS
     I                                        1   5 CGDOCK
     I                                        1   2 CG2
     I            DS
     I                                        1   6 WINV#
     I                                        1   3 WINV1
     I                                        4   60WINV2
     I* ROUTE CODE(RIGHT 3 DIGITS)
     I            DS
     I                                        1   4 QAROUT
     I                                        2   4 WROUT
     I* CHECK DATE
     I            DS
     I                                        1   80C@DATE
     I                                        1   40@YYC
     I                                        5   60@MMC
     I                                        7   80@DDC
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           USER   10
     C**************************************************************************
     C*
     C* AGDPL12 CALENDER
     C           KEY1      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
     C                     KFLD           @DD
     C*
     C* AGFPP10 FORD FORECAST DATA
     C           KEY2      KLIST
     C                     KFLD           CGDOCK
     C                     KFLD           CGPART
     C                     KFLD           W@DATE
     C                     KFLD           WGSIDT
     C*
     C* FCEPL01 PART MASTER
     C           KEY3      KLIST
     C                     KFLD           WPART1
     C                     KFLD           WPART2
     C                     KFLD           WPART3
     C*
     C* ABFAL01 FORD 862 KEY FILE
     C           KEY4      KLIST
     C                     KFLD           WKDOCK
     C                     KFLD           CGPART
     C           K#ADF     KLIST
     C                     KFLD           WKDELN
     C                     KFLD           WNUKE
     C* ABFEP01
     C           KEY8      KLIST
TCHK1C*                    KFLD           PRYYY            RELEASE YY
TCHK1C*                    KFLD           PRMMM                    MM
TCHK1C                     KFLD           PSYYY            RELEASE YY
TCHK1C                     KFLD           PSMMM                    MM
     C* AGDPL12 CALENDER
     C           KEY9      KLIST
     C                     KFLD           @YYC
     C                     KFLD           @MMC
     C                     KFLD           @DDC
     C**************************************************************************
     C*                   MAIN LOGIC
     C**************************************************************************
     C*
     C*
     C                     TIME           WTIME   60
     C                     MOVELUSER      WUSER   7
     C                     EXSR @INIT
     C           *INKC     DOWEQ'0'
     C                     EXFMTAB#PWFQ1
     C                     MOVE *BLANK    MSG
     C                     SETOF                     9998
     C*
     C           *INKE     IFEQ '1'
     C                     Z-ADDWR@DAT    C@DATE
     C                     EXSR @CHK
     C                     Z-ADDWSDAT     C@DATE
     C                     EXSR @CHK
     C           *IN99     IFEQ '0'
     C                     EXSR @PRNT
     C                     END
     C*
     C                     ELSE
     C                     Z-ADDWR@DAT    C@DATE
     C                     EXSR @CHK
     C                     Z-ADDWSDAT     C@DATE
     C                     EXSR @CHK
     C                     END
     C*
     C                     END
     C*
     C                     EXSR @END
     C**************************************************************************
     C*  @END SUBROUTINE: END OF JOB PROCESS
     C**************************************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C**************************************************************************
     C*  @CHK  SUBROUTINE: CHECK DATE
     C**************************************************************************
     C           @CHK      BEGSR
     C*
     C           KEY9      CHAINAGDPL12              90
     C           *IN90     IFEQ '1'
     C                     SETON                     990198
     C                     MOVEAMES,1     MSG
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*  @INIT SUBROUTINE: CLEAR FILDS
     C**************************************************************************
     C           @INIT     BEGSR
     C*
     C                     MOVE *BLANKS   MSG
     C                     MOVE '00  '    WNUKE
     C                     MOVE *BLANKS   WGSIDT
TCHK7C*                    MOVE *BLANKS   WKDOCK  4
TCHK7C                     MOVE *BLANKS   WKDOCK  5
     C                     MOVE *BLANK    WKDELY  4
     C                     MOVE *BLANK    WK862   3
     C                     Z-ADD*ZERO     W@DATE
     C                     Z-ADD*ZERO     WKAMT   60       ORDER QTY.
     C                     Z-ADD*ZERO     WKCAMT  90       IAF CUM.
     C                     Z-ADD*ZERO     WKUNIT  50       QTY/CONT.
     C                     Z-ADD*ZERO     PRYYY
     C                     Z-ADD*ZERO     PRMMM
     C                     Z-ADD*ZERO     PRDDD
     C                     Z-ADD*ZERO     PSYYY
     C                     Z-ADD*ZERO     PSMMM
     C                     Z-ADD*ZERO     PSDDD
     C                     SETOF                     89
     C*
     C                     ENDSR
     C**************************************************************************
     C*  @PRNT SUBROUTINE: PRINT WEEKLY OPRDER SHEET
     C**************************************************************************
     C           @PRNT     BEGSR
     C*
     C           *LOVAL    SETLLABFPP301
     C                     READ ABFPP301                 91
      *  ----------------------------------------------- *
B0   C           *IN91     DOWEQ'0'
     C           CGDLCD    CABNE*BLANK    #READ
      *
     C           CGDOCK    SETLLABFDP01R
B1   C           *IN92     DOUEQ*ON
     C           CGDOCK    READEABFDP01R                 92
B2   C           *IN92     IFEQ *OFF
B3   C           QASKJY    IFEQ 'D'
     C           QASKHZ    ANDLE*DATE
     C                     ITER                            DOCK CODE
E3   C                     ENDIF
B3   C           QAEFHZ    IFGT *DATE
     C                     ITER                            DOCK CODE
E3   C                     ENDIF
      *
     C                     LEAVE
E2   C                     ENDIF
E1   C                     ENDDO
      *
B1   C           *IN92     IFEQ '0'
     C                     GOTO #READ
E1   C                     END
     C*
     C                     CLEARFBQTY1
     C           KEY2      CHAINABFPP101             93
B1   C           *IN93     IFEQ '0'
     C* N89                EXCPTHEADS
     C  N89                SETON                     89
     C*  89 OF             EXCPTHEADS
     C   89 OF             SETOF                     OF
     C*
     C* FORD 862 KEY FILE
     C                     MOVELCGDOCK    WKDOCK
     C           KEY4      CHAINABFAL01              95
B2   C           *IN95     IFEQ '0'
     C                     Z-ADDCFCAMT    WKCAMT
B3   C           CFPOR#    IFEQ *BLANK
     C                     MOVE 'YES'     WK862
     C*
     C                     ELSE
     C                     MOVE 'NO '     WK862
E3   C                     END
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     WKCAMT
     C                     MOVE 'NO '     WK862
E2   C                     END
     C*
     C* FORD ADDRESS MASTER
     C           CGDOCK    CHAINABF9P011             96
B2   C           *IN96     IFEQ '0'
     C                     MOVE F9DELY    WKDELY
     C*
     C                     ELSE
     C                     MOVE *BLANK    WKDELY
E2   C                     END
     C           FBQTY1    SUB  WKCAMT    WKAMT
     C*
     C*
     C           KEY3      CHAINFCEPL01              94
B2   C           *IN94     IFEQ '0'
     C                     Z-ADDA2SSYS    WKUNIT           QTY./CONT.
E2   C                     END
     C*                    EXCPTDETAIL
TCHK5C*          CG2       IFEQ 'IE'
TCHK5C*          WKAMT     ANDGT*ZERO
TCHK5C           CG2       IFEQ 'IE'
TCHK6C*TCHK5     CGDOCK    OREQ '6653A'
TCHK5C           WKAMT     IFGT *ZERO
     C                     EXSR @SET
     C                     EXCPTDT
     C                     ENDIF
TCHK5C                     END
E1   C                     END
     C*
     C           #READ     TAG
     C                     READ ABFPP301                 91
E0   C                     END
      *  ----------------------------------------------- *
     C*
     C                     SETON                     98
     C                     MOVEAMES,2     MSG
     C*
     C                     ENDSR
     C**************************************************************************
     C           @SET      BEGSR
OK   C                     MOVE 'AVRT'    WSIRE   4        SUPPLIER CODE
OK   C                     MOVE 'A'       WSIRK   1        FACTORY  CODE
OK   C                     MOVE '5149'    WTOKU   4        CUSTOMER CODE
     C                     MOVE WKDELY    WNONY   4        DELIVERY CODE
OK   C                     MOVE '0'       WNKOJ   1        FACTORY  CODE
     C                     MOVEL'00  '    WNUKE   4        RECEIVING DOC
OK   C                     MOVE '0000'    WSBAN   4        RER NO      E
     C                     MOVELCGPART    WMHIN  20        USER PART #
     C                     Z-ADDWSDAT     WNYMD   80       DELIVERY DATE
OK   C                     MOVEL'11111'   WODRN  10        ORDER #     E
     C                     Z-ADDWKAMT     WSURY   70       ORDER QTY
     C                     Z-ADDWKUNIT    WSYOS   60       QTY/BOX
OK   C                     Z-ADD*ZERO     WNOTM   40       INVOICE TIME
     C                     MOVE '5149'    PTOKU   4
     C                     MOVELWKDELY    PNONY   4
     C                     MOVEL'0'       PNKOJ   1
     C                     MOVEL'00'      PNUKE   4
     C                     MOVEL*BLANK    @MHIN  20
TCHK4C                     MOVELCGPART    @MHIN
     C*                    MOVEL*BLANK    WMHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU
     C                     PARM           PNONY
     C                     PARM           PNKOJ
     C                     PARM           PNUKE
     C                     PARM           @MHIN
     C                     PARM           @SHIN
     C                     PARM           @FLG
     C*                    MOVELCGPART    @SHIN            IAF PART#
TCHK4C*                    MOVELFBIPAR    @SHIN            IAF PART#
TCH73C           WPART1    IFEQ 'S7071'
     C           WPART2    ANDEQ'93S90'
     C           WPART3    ANDEQ'0'
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVELCGPART    @MHIN  20
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU
     C                     PARM           PNONY
     C                     PARM           PNKOJ
     C                     PARM           PNUKE
     C                     PARM           @MHIN
     C                     PARM           @SHIN
     C                     PARM           @FLG
TCH73C                     ENDIF
     C                     MOVEL'-   '    WALFL   4        FEED LINE
TCH20C*                    MOVE '01'      WBIN    2        BIN
TCH20C                     MOVE '02'      WBIN    2        BIN
TCHK3C*TCHK2     WKDELY    IFEQ '5111'
TCHK3C*TCHK2               MOVE '05'      WBIN
TCHK3C*TCHK2               END
OK   C                     Z-ADD*ZERO     WUSYS   60       USER QTY/CONT.
     C                     CLEARWINV#                      INV#        T.
     C                     MOVE WKDELY    WKDELN  40
     C           K#ADF     CHAINABFDL01R             88
     C           *IN88     IFEQ '0'
     C                     MOVE WROUT     WINV1
     C                     ENDIF
     C* GET INVOICE NUMBER(ROUTE + JULIAN DATE)
     C           KEY8      CHAINABFEP01              95
B04  C           *IN95     IFEQ '0'
TCHK1C*          QB#DAY    ADD  PRDDD     WINV2
TCHK1C           QB#DAY    ADD  PSDDD     WINV2
     C                     ELSE
     C                     Z-ADD*ZERO     WINV2
E04  C                     END
     C                     MOVE *BLANK    WRLOC   4
     C                     Z-ADDWR@DAT    WRDATE  80       RELEASE DAE
     C                     ENDSR
     C**************************************************************************
     O*PRINT  E    2           HEADS
     O*                                 131 '.....................'
     O*       E 1              HEADS
     O*                                 131 '.         .         .'
     O*       E 1              HEADS
     O*                                   8 'AB#RFQ'
     O*                                  89 'TIME'
     O*                        WTIME     98 '  :  :  '
     O*                                 131 '.         .         .'
     O*                        WUSER    119
     O*       E 1              HEADS
     O*                                  16 'SELECTED DATE:'
     O*                        W@DATE    28 '    /  /  '
     O*                                  61 'WEEKLY ORDER SHEET'
     O*                                  89 'DATE'
     O*                        UDATE Y   98
     O*                                 104 'PAGE'
     O*                        PAGE  Z  108
     O*                                 131 '.....................'
     O*
     O*       E 2              HEADS
     O*                                   7 'PLANT'
     O*                                  19 'PART'
     O*                                  50 'FORD REQUESTED CUM.'
     O*                                  68 'IAF SHIPPED CUM.'
     O*                                  80 'ORDER QTY.'
     O*                                  92 'QTY./CONT.'
     O*                                 100 'R-CODE'
     O*                                 111 'LINE FEED'
     O*                                 122 'LAST SHIP'
     O*                                 131 'EDI862'
     O*
     O*       E 1              DETAIL
     O*                        CGDOCK     7
     O*                        WKDELY    13
     O*                        WPART1    20
     O*                        WPART2    26
     O*                        WPART3    29
     O*                        FBQTY1    49 ' ,   ,   ,   '
     O*                        WKCAMT    67 '   ,   ,   '
     O*                        WKAMT N   79
     O*                        WKUNIT    91 '  ,   '
     O*                        FBSHLD   121 '    /  /  '
     O*                        WK862    128
     C***********************************************************
     OAB#WP451E                DT
     O                         WSIRE      4
     O                         WSIRK      5
     O                         WTOKU      9
     O                         WNONY     13
     O                         WNKOJ     14
     O                         WNUKE     18
     O                         WSBAN     22
     O                         WMHIN     42
     O                         WNYMD     50
     O                         WODRN     60
     O                         WSURY     67
     O                         WSYOS     73
     O                         WNOTM     77
     O                         @SHIN     89
     O                         WALFL     97
     O                         WBIN      99
     O                         WUSYS    105
     O                         WINV#    111
     O                         WRLOC    125
     O                         WRDATE   133
     C**************************************************************************
** MES
DATE DOESN'T EXIST
COMPLETED SUCESSFULLY
