     H            Y.
     F** AB#RSO *************************************************************
     F*  SERVICE PARTS                                                      *
     F*       CREATE KANBAN DATA                                            *
     F*  10/15/01 (TCH)                                                     *
     F****************************************** AB#R2C *********************
     FAB#PWSO CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFCEPL30 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#WP9S O   E                    DISK                           UC
     FAB#PPCT UF  E           K        DISK                      A
     E*****************************************************************
     E                    ER      1   3 78
     E                    CMD     1   1 70
     E                    KEY     1   2 78
     I*****************************************************************
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I* LOCATION(FCEPL30)
     I            DS
     I                                        1   6 F3STKR
     I                                        1   1 F3STRK
     I                                        2   3 F3STRT
     I                                        4   5 F3STRR
     I                                        6   6 F3STRD
     I* LOCATION(FCEPL30)
     I            DS
     I                                        1   6 F3KTKR
     I                                        1   1 F3KTRK
     I                                        2   3 F3KTRT
     I                                        4   5 F3KTRR
     I                                        6   6 F3KTRD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-------------------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C           K@KEY     CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C           CTCHR1    ANDEQ#USER
     C                     MOVE *BLANK    CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           @ENDID  1
      *
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C           K#FC30    KLIST
     C                     KFLD           D@PRT1
     C                     KFLD           D@PRT2
     C                     KFLD           D@PRT3
     C           K#FC3X    KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#FC01    KLIST
     C                     KFLD           F3BHB1
     C                     KFLD           F3BHB2
     C                     KFLD           F3BHB3
      *
     C                     MOVE *BLANK    @ENDID
     C                     MOVE '01'      @@ID    2
      *
     C                     MOVEL'AB#RSO'  K@KEY   8 P
     C           K@KEY     CHAINAB#PPCT              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVELK@KEY     CTKEY1
     C                     MOVEL#USER     CTCHR1
     C                     WRITEAB#PPCT1
     C                     ELSE
     C           CTCHR1    IFNE *BLANK
     C           CTCHR1    CAT  ER,1:1    D@MSG     P
     C                     MOVE *ON       *IN99
     C                     MOVE *ON       *IN77
     C                     ELSE
     C                     MOVEL#USER     CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------------
     C                     MOVE KEY,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     MOVE '1'       @ENDID
     C                     OTHER
      *
     C           *IN77     IFEQ *OFF
     C                     EXSR #CHK1
     C           *IN99     IFEQ *ON
     C                     EXSR #SET1
     C           RRN1      IFEQ *ZERO
     C                     MOVE ER,2      D@MSG
     C                     MOVE *ON       *IN61
     C                     ELSE
     C                     MOVE '02'      @@ID
     C                     ENDIF
      *
     C                     ELSE
     C           *INKE     IFEQ *ON
      *
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AB#WP9S
      *
     C                     EXSR #WRT1
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------------
     C                     MOVE *OFF      *IN99
     C                     MOVE *OFF      *IN61
     C                     MOVE *BLANK    D@MSG
     C           K#FC30    SETLLFCEPL30
     C           *IN90     DOUEQ*ON
     C           K#FC30    READEFCEPL30             N    90
     C           *IN90     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #WRT1     BEGSR
      *-----------------------------------------------------------
      *
     C                     CLEARAB#WP9S1
     C                     MOVELF3BHB1    S9SHN1
     C                     MOVELF3BHB2    S9SHN2
     C                     MOVELF3BHB3    S9SHN3
     C                     MOVELF3ZETI    S9ZETI
     C           F3TYMD    IFGT *DATE
     C                     MOVE F3KTRK    S9LOC1
     C                     MOVE F3KTRT    S9LOC2
     C                     MOVE F3KTRR    S9LOC3
     C                     MOVE F3KTRD    S9LOC4
     C                     ELSE
     C                     MOVE F3STRK    S9LOC1
     C                     MOVE F3STRT    S9LOC2
     C                     MOVE F3STRR    S9LOC3
     C                     MOVE F3STRD    S9LOC4
     C                     ENDIF
      *
     C           K#FC01    CHAINFCEPL01              90
     C           *IN90     IFEQ *OFF
     C           A2STRK    IFNE F3PTRK
     C           A2STRT    ORNE F3PTRT
     C           A2STRR    ORNE F3PTRR
     C           A2STRD    ORNE F3PTRD
     C           K#FC30    SETLLFCEPL30
     C           *IN90     DOUEQ*ON
     C           K#FC30    READEFCEPL30                  90
     C           *IN90     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     Z-ADD*DATE     F3GKDT
     C                     TIME           F3GTIM
     C                     MOVEL#USER     F3GKNM
     C                     MOVE A2STRK    F3PTRK
     C                     MOVE A2STRT    F3PTRT
     C                     MOVE A2STRR    F3PTRR
     C                     MOVE A2STRD    F3PTRD
     C                     UPDATFCEPP301
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE F3PTRK    S9LCP1
     C                     MOVE F3PTRT    S9LCP2
     C                     MOVE F3PTRR    S9LCP3
     C                     MOVE F3PTRD    S9LCP4
     C           A2GSKD    IFNE *BLANK
     C                     MOVE *ALL'*'   S9LCP1
     C                     MOVE *ALL'*'   S9LCP2
     C                     MOVE *ALL'*'   S9LCP3
     C                     MOVE *ALL'*'   S9LCP4
     C                     ENDIF
      *
     C           F3SYMD    IFGT *DATE
     C                     Z-ADDF3KSYS    P11
     C                     ELSE
     C                     Z-ADDF3SSYS    P11
     C                     ENDIF
%0001C                     MOVE *BLANK    P12
%0001C                     CALL 'AB#R2K'
     C                     PARM           P11    300
     C                     PARM           P12    30
     C                     MOVELP12       S9SYOS
     C                     Z-ADD*ZERO     Z
     C                     MOVE *BLANK    A1
     C                     MOVE *BLANK    A2
     C           ' '       CHEKRS9SYOS    Z       20
     C           Z         IFNE *ZERO
     C           Z         ANDGT3
     C           Z         SUB  3         ZZ      20
     C           ZZ        SUBSTS9SYOS:1  A1      5
     C                     ADD  1         ZZ
     C           3         SUBSTS9SYOS:ZZ A2      3
     C           A1        CAT  ',':0     A1        P
     C           A1        CAT  A2:0      S9SYOS    P
     C                     ENDIF
      *
     C                     WRITEAB#WP9S1
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #SET1     BEGSR
      *-----------------------------------------------------------
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C                     CLEARSFL01
      *
     C           K#FC30    SETLLFCEPL30
     C           *IN90     DOUEQ*ON
     C                     READ FCEPL30             N    90
     C           *IN90     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVE F3BHB1    S@PRT1
     C                     MOVELF3BHB2    S@PRT2
     C                     MOVELF3BHB3    S@PRT3
     C           F3TYMD    IFGT *DATE
     C                     MOVE F3KTRT    S@SLC1
     C                     MOVE F3KTRR    S@SLC2
     C                     ELSE
     C                     MOVE F3STRT    S@SLC1
     C                     MOVE F3STRR    S@SLC2
     C                     ENDIF
      *
     C                     MOVE F3PTRT    S@OLC1
     C                     MOVE F3PTRR    S@OLC2
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #SCRN2    BEGSR
      *-----------------------------------------------------------
     C                     MOVE KEY,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     MOVE '1'       @ENDID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     OTHER
      *
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
      *
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AB#WP9S
      *
     C                     EXSR #WRT2
     C                     MOVE '99'      @@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #CHK2     BEGSR
      *-----------------------------------------------------------
     C                     MOVE *OFF      *IN99
     C                     MOVE *OFF      *IN88
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     RRN1
     C           *IN90     DOUEQ*ON
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    ANDNE*BLANK
     C                     MOVE *ON       *IN88
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN88     IFEQ *OFF
     C                     MOVE *ON       *IN99
     C                     MOVE ER,3      D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #WRT2     BEGSR
      *-----------------------------------------------------------
     C                     Z-ADD*ZERO     RRN1
     C           *IN77     DOUEQ*ON
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL01                77
     C           *IN77     IFEQ *OFF
     C           S@SLCT    ANDNE*BLANK
     C           K#FC3X    SETLLFCEPL30
     C           *IN91     DOUEQ*ON
     C           K#FC3X    READEFCEPL30                  91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     EXSR #WRT1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *
** ER
IS USING THE SAME PROGRAM. TRY AGAIN LATER.
NO DATA
PLEASE SELECT SOME PART NUMBERS.
** CMD
CLRPFM AB#WP9S
** KEY
 F1:END     F5:CREATE     ENTER:SELECTION
 F1:END     F5:CREATE     F12:GO BACK
