     H            Y.
     F** AB#RSL *******************************************************
     F*  SERVICE PARTS CUSTOMS SHEET                                  *
     F*    10/09/01  TCH
     F*  TCHK1 09/10/08 CHG PRICE DECIMAL
     F******************************************************* AB#R39 **
     FAB#WP39 IP  F     100            DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL30 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1  12  2 0 TB2     9
     IAB#WP39 AA  01
     I                                        1   40ITOKU
     I                                        5   80INONY
     I                                        9   9 INKOJ
     I                                       10  13 INUKE
     I                                       14  18 IMHN1 L1
     I                                       19  23 IMHN2 L1
     I                                       24  25 IMHN3 L1
     I                                       29  33 IMHN4
     I                                       34  410INOHZ
     I                                       34  370INOYY
     I                                       38  390INOMM
     I                                       40  410INODD
     I                                       46  510ISRYO
TCHK1I*                                      55  624ITANK
TCHK1I                                       55  625ITANK
     I                                       63  67 ISHN1
     I                                       68  72 ISHN2
     I                                       73  74 ISHN3
     I                                       75  800ISYOS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
%0001I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
%0001I                                        7   80E4SKDD
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PWEIG   52
     C                     PARM           PTRAN  30
     C                     PARM           PCNAM  10        COUNTRY
      *
     C                     SETOF                     10
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     1011
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       20
     C           INOMM     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVELTB2,A     WMNAM   9
     C                     END
      *
     C                     SETOF                     20
     C                     MOVE *BLANK    WSMEI  15
     C*
     C           #READ     TAG
     C           INONY     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     GOTO #READ
     C                     END
     C*
     C           *IN20     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WSRYO   60
     C                     END
      *
%0001C                     EXSR #SUB1
      *
     C                     SETOF                     20
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WDMEI  13
     C           KEY1      CHAINFCEPL30              20
     C           *IN20     IFEQ '0'
     C           F3GSKD    ANDEQ*BLANK
     C                     Z-ADDF3KASI    WKASI
     C                     MOVELF3DMEI    WDMEI
     C                     ELSE
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C                     MOVELA2DMEI    WDMEI
     C                     END
     C                     ENDIF
      *
     C                     ADD  ISRYO     WSRYO
      *
     CL1                   EXSR SUBR
     CLR         TEIGH     ADD  26.76     TGROS   72
      *
     C           SUBR      BEGSR
      *
     C           WSRYO     DIV  ISYOS     WHAKO   30
      *
     C           WSRYO     MULT ITANK     WKING   62
     C                     ADD  WKING     TKING   62
      *
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   62H
      *
     C           WSRYO     DIV  ISYOS     WKT1    30
     C                     MVR            WKT2    30
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     END
     C           WGROS     MULT WKT1      WEIGH   73
     C                     ADD  WEIGH     TEIGH   73
      *
     C                     ENDSR
      *
     C           #SUB1     BEGSR
     C                     MOVELINONY     WNONY   4
     C                     MOVE *BLANK    WADD1  30
     C                     MOVE *BLANK    WADD2  30
     C                     MOVE *BLANK    WADD3  30
     C                     MOVE *BLANK    WADD4  30
     C                     MOVE *BLANK    WADD5  30
     C                     MOVE *BLANK    WADD6  30
     C           WNONY     CHAINEDIPL401             77
     C           *IN77     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELE4ADD1    WADD1
     C                     MOVELE4ADD2    WADD2
     C                     MOVELE4ADD3    WADD3
     C                     MOVELE4ADD4    WADD4
     C                     MOVELE4ADD5    WADD5
     C                     MOVELE4ADD6    WADD6
     C                     END
     C                     END
     C                     ENDSR
      *
     OQPRINT  H  202   10
     O                         WSMEI     29
     O        H  2     10
     O                                   17 'IAF'
     O                         PCNAM     29
     O                                   50 'CUSTOM  INFORMATION'
     O                                   71 'PAGE'
     O                         PAGE  Z   75
     O        H  1     10
     O                                   11 '1.VENDOR'
     O                                   56 '2.DATE OF DIRECT'
     O                                   68 'SHIPMENT TO'
     O                         PCNAM     79
     O        H  1     10
     O                                    8 'IAF'
     O                         WMNAM     51
     O                         INODD Z   54
     O                                   56 ','
     O                         INOYY     61
     O        H  1     10
     O                                   26 '1300 W. ANDERSON BLVD'
     O        H  1     10
     O                                   25 'GREENFIELD, IN 46140'
     O                                   58 '3.OTHER REFERENCES'
     O        H  1     10
     O                                   58 'PRODUCTION PARTS'
     O        H  1     10
     O                                   14 '4.CONSIGNEE'
     O        H  1     10
     O                         WADD1     35
     O                                   57 '5.RELATED COMPANY'
     O                                   69 'TRANSACTION'
     O        H  1     10
     O                         WADD2     35
     O                                   49 'NO-NONE'
     O        H  1     10
     O                         WADD3     35
     O        H  1     10
     O                         WADD4     35
     O                                   59 '6.COUNTRY OF ORIGIN'
     O        H  1     10
     O                         WADD5     35
     O                                   45 'USA'
     O        H  1     10
     O                         WADD6     35
     O        H  1     10
     O                                   56 '7.TRANSPORTATION'
     O        H  1     10
     O                                   18 '8.CONDITIONS OF'
     O                                   33 'SALE AND TERMS'
     O                         PTRAN     72
     O        H  1     10
     O                                   20 'OF PAYMENT'
     O        H  1     10
     O                                   11 'NET 25'
     O                                   50 '9.CURRENCY'
     O        H  2     10
     O                                   52 'U.S. FUNDS'
     O        H  1     10
     O                                   15 '10.ORIGINATOR'
     O                                   57 '11.FIELDS 23 TO 25'
     O                                   75 'ARE NOT APPLICABLE'
     O        H  3     10
     O                                   22 'SAME AS NUMBER 1.'
     O                                   43 'X'
     O        H  1     10
     O                                   11 '# OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES     QTY.'
     O                                   62 'UNIT PRICE'
     O                                   75 'TOTAL'
     O        H  202   OF
     O                                   10 ' '
     O        H  2     OF
     O                                   11 '# OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES     QTY.'
     O                                   62 'UNIT PRICE'
     O                                   75 'TOTAL'
     O        T  1     L1
     O                         WHAKO Z    9
     O                         IMHN1     19
     O                                   20 '-'
     O                         IMHN2     25
     O                                   26 '-'
     O                         IMHN3     28
     O                         WDMEI     42
     O                         WSRYO 1   51
     O                         ITANK 1   62
     O                         WKING 1   75
     O        T 11     LR
     O                                   13 'TOTAL WEIGHT'
     O                                   75 'INVOICE TOTAL'
     O        T  2     LR
     O                                    6 'NET :'
     O                         TEIGH 1   20
     O                                   21 'K'
     O                                   35 'GROSS :'
     O                         TGROS 1   49
     O                                   50 'K'
     O                         TKING 1   75
      *
** TB1.TB2
01JANUARY
02FEBRUARY
03MARCH
04APRIL
05MAY
06JUNE
07JULY
08AUGUST
09SEPTEMBER
10OCTOBER
11NOVEMBER
12DECEMBER
