     H            Y.
     F** AB#R6J **********************************
     F*     PRINT EDI REMITANCE ADVICE           *
     F*     N.HYOTO 2000.11.30                   *
     F*     H.AMANO 2002.04.09                   *
     F*     -------------------------            *
     F*     J.W     2019.10.01                   *
     F********************************** AB#R6B **
     FAB#PL6B IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      **********************************************************
     I            DS
     I                                        1  120#TIME
     I                                        1   60WTIME
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C****************************************************
     C                     EXSR #OUT
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DATE  8
     C                     PARM           P@TIME  6
     C                     PARM           P@CNAM  5
      *
     C**                   Z-ADD*DATE     K@DATE  80
     C                     MOVELP@DATE    K@DATE  80
     C                     MOVELP@TIME    K@TIME  60
      *
     C           K#KEY     KLIST
     C                     KFLD           K@DATE
     C                     KFLD           K@TIME
      *
     C                     TIME           #TIME
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #OUT      BEGSR
      *--------------------------------------------------
     C                     MOVEA'00'      *IN,97
     C                     MOVE *BLANK    @@MANI 16
     C                     Z-ADD*ZERO     TSAMT  122
     C                     Z-ADD*ZERO     TMAMT  122
     C                     Z-ADD*ZERO     WCNT    60
     C                     MOVE *BLANK    @@NAME  5
     C           K#KEY     SETLLAB#PL6B
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PL6B                  90
     C           *IN90     IFEQ *OFF
      * SELECT NAME
     C           APCNAM    IFNE P@CNAM
     C                     ITER
     C                     ENDIF
      *
     C           @@NAME    IFNE *BLANK
     C           @@NAME    ANDNEAPCNAM
     C                     EXCPT@STOT
     C                     Z-ADD0         TMAMT
     C                     EXCPT@GTOT
     C                     MOVE *OFF      *IN97
     C                     ENDIF
      *
     C           @@NAME    IFNE APCNAM
     C           *IN98     OREQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C                     MOVE APCNAM    @@NAME
     C                     Z-ADDAPMAMT    @@MAMT 122
      *
     C  N98                MOVE *ON       *IN98
      *
     C           APMANI    IFNE @@MANI
     C           *IN97     ANDEQ*ON
     C                     EXCPT@STOT
     C                     Z-ADD0         TMAMT
     C                     ENDIF
     C  N97                MOVE *ON       *IN97
     C**         APIQTY    MULT APUNIT    @@AMNT 122
     C                     Z-ADDAPTAMT    @@AMNT 122
     C                     EXCPT@DTL
      *
     C                     MOVELAPMANI    @@MANI
     C                     ADD  @@AMNT    TSAMT  122
     C                     ADD  @@AMNT    TMAMT  122
     C                     ADD  1         WCNT    60
     C                     ENDIF
     C                     ENDDO
      *
     C   97                EXCPT@STOT
     C   97                EXCPT@GTOT
      *
     C                     ENDSR
     C**************************************************************************
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  105 'TIME'
     O                         WTIME    114 '  :  :  '
     O                                  120 'PAGE'
     O                         PAGE  Z  124
     O*
     O        E   02           @HED
     O                         APCNAM    15
     O                                   50 'ACCOUNT PAYABLE'
     O                                   67 'DETAIL LIST FROM'
     O                                   82 'GENTRAN AS/400'
     O*
     O        E   04           @HED
     O                                    9 'CARD'
     O                                   25 'PART NUMBER'
     O                                   32 'COLOR'
     O                                   42 'MANIFEST'
     O                                   63 'QUANTITY'
     O                                   75 'PRICE'
     O                                   94 'TOTAL AMOUNT'
     O                                  109 'RECEIVING'
     O                                  119 'DOCK'
     O*
     O        E 1              @HED
     O                                    9 'NO.'
     O                                   31 'CODE'
     O                                   40 'NUMBER'
     O                                  106 'DATE'
     O                                  119 'CODE'
     O*
     O        E 11             @STOT
     O                                   47 '***'
     O                                   60 'TOTAL AMOUNT'
     O                                   71 'MANIFEST'
     O                         TMAMT J   94
     O                                  121 'SUB('
     O                         WCNT  JB 128
     O                                  129 ')'
     O*
     O        E 1              @GTOT
     O                                   47 '***'
     O                                   60 'TOTAL AMOUNT'
     O                                   71 'SUPPLIER'
     O                         TSAMT JB  94
     O                                  111 '('
     O                         @@MAMTJB 128
     O                                  129 ')'
     O*
     O        E 1              @DTL
     O                         APCARD     9
     O                         APPAR1    19
     O                                   20 '-'
     O                         APPAR2    25
     O                         APCLRC    30
     O                         APMANI    50
     O                         APIQTY1   63
     O                         APUNIT1   75
     O                         @@AMNTJ   94
     O                         APRCYY   102
     O                                  103 '/'
     O                         APRCMM   105
     O                                  106 '/'
     O                         APRCDD   108
     O                         APDOCK   119
