     H            Y/
     FAB#PW0T CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FAB#WPLG IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
      *
     E                    CMD     1   2 78
     E                    MSG     1   1 78
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      *--------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET
     C                     MOVE '02'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     9961
     C                     MOVE *BLANK    D@MSG
     C           D@DATE    CHAINAB#WPLG              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           D@DATE    SETLLAB#WPLG
     C           *IN90     DOUEQ*ON
     C           D@DATE    READEAB#WPLG                  90
     C           *IN90     IFEQ *OFF
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     MOVE AWNONY    S@NONY
     C                     Z-ADDAWTIM1    S@TIM1
     C           AWNONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    S@NAME
     C                     ENDIF
     C                     Z-ADDAWDAT2    S@DAT2
     C                     Z-ADDAWTIM2    S@TIM2
     C                     MOVELAWPRSN    S@PRSN
     C           AWPRSN    SETLLRGAPL111
     C           *IN91     DOUEQ*ON
     C           AWPRSN    READERGAPL111                 91
     C           *IN91     IFEQ '0'
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    S@PRNM
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     WRITESFL01
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
** CMD
   F1:END
   F1:END     F12:GO BACK
** MSG
  NO DATA
