     H            Y.
     F** AB#R3X1 ***********************************************
     F*  ..TEST SAKAKI                                         *
     F*     T.SAKAKI    2018.03.25                             *
     F*********************************************** AB#R3X1 **
     FRGAPL11 IF  E           K        DISK
      *---------------------------------------------------------
     I*
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     PARM           PNAME  15
     I*
     C           PUSER     CHAINRGAPL11              90
     C           *IN90     IFEQ *OFF
     C                     MOVELJ8NAME    PNAME
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
