     H            Y.
     F** AB#R1S *********************************************************
     F*  HONDA DESIGN CHG LEVEL MAINTENANCE                             *
     F*  J.WATANABE 2021.10.13                                          *
     F*******************************************************************
     FAB#PW1S CF  E                    WORKSTN
     FAB#PL55AUF  E           K        DISK                      A
      *----------------------------------------------------
     E                    MSG     1  15 60
      *----------------------------------------------------
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  12 D@SHIN
     I                                        1   5 D@SHN1
     I                                        6  10 D@SHN2
     I                                       11  12 D@SHN3
     I            DS
     I                                        1  20 W@PART
     I                                        1   5 D@PRT1
     I                                        6  10 D@PRT2
     I                                       11  15 D@PRT3
     I                                       16  20 D@PRT4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------
      * MAIN ROUTINE
      *----------------------------------------------------
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F1: END -----------------------------
     C           *INKA     WHEQ *ON
     C                     LEAVE
      * F10: ORDER INQ ----------------------
     C           *INKJ     WHEQ *ON
     C**TEMP               CALL 'AB#R1F'
     C**                   PARM           D@PRT1
     C**                   PARM           D@PRT2
     C**                   PARM           D@PRT3
     C**                   PARM           D@PRT4
     C**                   PARM           $RTN    1
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR #DSP2
     C                     ELSE
     C                     MOVELMSG,1     D@MSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------
      * CHECK SCREEN1 DATA
      *----------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN85
     C                     SETOF                     616263
     C                     SETOF                     64
      * CHECK OPTION
     C           D@OPT     IFEQ ' '
     C                     MOVE MSG,2     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           D@OPT     IFNE '0'
     C           D@OPT     ANDNE'1'
     C           D@OPT     ANDNE'2'
     C                     MOVE MSG,3     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK PART
     C           D@PRT1    IFEQ *BLANK
     C           D@PRT2    OREQ *BLANK
     C                     MOVE MSG,4     D@MSG
     C                     SETON                     62  85
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK DCL
     C           D@DCL     IFEQ *BLANK
     C                     MOVE MSG,5     D@MSG
     C                     SETON                     63  85
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK DELIVERY#
     C           D@NONY    IFEQ 0
     C                     MOVE MSG,12    D@MSG
     C                     SETON                     64  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           D@NONY    IFNE 0
     C                     MOVELD@NONY    PMNONY
     C                     MOVE ' '       PMOPT
     C                     CALL 'UTLR16'
     C                     PARM           PMNONY  4
     C                     PARM           PMOPT   1
     C                     PARM           PMNAME 20
     C                     PARM           PTOKU   4
     C                     PARM           PMRTN   1
     C           PMRTN     IFNE ' '
     C                     MOVE MSG,6     D@MSG
     C                     SETON                     63  85
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * KEY - OPTION
     C                     MOVELD@PRT1    K#MHN1
     C                     MOVELD@PRT2    K#MHN2
     C                     MOVELD@PRT3    K#MHN3
     C                     MOVELD@PRT4    K#MHN4
     C                     MOVELD@DCL     K#DCLV
     C                     MOVELD@NONY    K#NONY
     C           K#55A     SETLLAB#PL55A
     C                     DO   *HIVAL
     C           K#55A     READEAB#PL55A            N    99
     C   99                LEAVE
     C           A5SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     LEAVE
     C                     ENDDO
      *
     C                     SELEC
     C           *IN99     WHEQ *ON
     C           D@OPT     ANDEQ'0'
     C                     MOVE MSG,7     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
      *
     C           *IN99     WHEQ *ON
     C           D@OPT     ANDEQ'1'
     C                     MOVE MSG,7     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
      *
     C           *IN99     WHEQ *OFF
     C           D@OPT     ANDEQ'2'
     C                     MOVE MSG,8     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDSL
      * IF NO ERROR...
     C                     SELEC
     C           D@OPT     WHEQ '0'
     C                     MOVEL'DELETE  'D@OPTN
     C           D@OPT     WHEQ '1'
     C                     MOVEL'CHANGE  'D@OPTN
     C           D@OPT     WHEQ '2'
     C                     MOVEL'ADD     'D@OPTN
     C                     ENDSL
      *
     C           D@OPT     IFEQ '0'
     C           D@OPT     OREQ '1'
     C                     MOVELA5SHN1    D@SHN1
     C                     MOVELA5SHN2    D@SHN2
     C                     MOVELA5SHN3    D@SHN3
     C                     MOVELA5SHDT    D@FROM    P
     C                     ELSE
     C                     MOVE *BLANK    D@SHN1
     C                     MOVE *BLANK    D@SHN2
     C                     MOVE *BLANK    D@SHN3
     C                     MOVELXTODAY    D@FROM
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *----------------------------------------------------
      * SCREEN 2
      *----------------------------------------------------
     C           #DSP2     BEGSR
      *----------------------------------------------------
      *
     C                     DO   *HIVAL
     C                     EXFMTDSP02
      *
     C                     SELEC
      * F1 : BACK
     C           *INKA     WHEQ *ON
     C           *INKL     OREQ *ON
     C                     LEAVE
      *
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN86     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR #UPD
     C                     LEAVE
     C                     ELSE
     C                     MOVE MSG,13    D@MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------
      * CHECK SCREEN2 DATA
      *----------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN86
     C                     SETOF                     6566
      *
     C           D@OPT     IFEQ '0'
     C                     GOTO XCHK2
     C                     ENDIF
      * CHECK PART
     C           D@SHN1    IFEQ *BLANK
     C                     MOVE MSG,9     D@MSG
     C                     SETON                     65  86
     C                     GOTO XCHK2
     C                     ENDIF
      * CHECK MASTER
     C                     MOVELD@SHIN    $SHIN
     C                     MOVELTODAY     $DATE
     C                     MOVE 'Y'       $SRV
     C                     CALL 'UTLR35B'
     C                     PARM           $SHIN  12
     C                     PARM           $DATE   8
     C                     PARM           $SRV    1
     C                     PARM           $SYOS   6
     C                     PARM           $RTN3   1
     C           $RTN3     IFEQ '*'
     C                     MOVE MSG,14    D@MSG
     C                     SETON                     65  86
     C                     GOTO XCHK2
     C                     ENDIF
      * CHECK EFFECTIVE DATE
     C           D@FROM    IFEQ *BLANK
     C                     SETON                     66  86
     C                     MOVE MSG,10    D@MSG
     C                     GOTO XCHK2
     C                     ENDIF
      * CHECK EFFECTIVE DATE
     C           D@FROM    IFNE *BLANK
     C                     MOVELD@FROM    $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC
     C                     PARM           $TRUE1
     C                     PARM           $TRUE2
     C                     PARM           $RTN1
     C           $RTN1     IFEQ *BLANK
     C                     MOVEL$TRUE2    D@FROM    P
     C                     ELSE
     C                     SETON                     66  86
     C                     MOVE MSG,11    D@MSG
     C                     GOTO XCHK2
     C                     ENDIF
     C                     ENDIF
      * IF NOEERROR...
      *
     C           XCHK2     ENDSR
      *----------------------------------------------------
      * UPDATE DATA
      *----------------------------------------------------
     C           #UPD      BEGSR
      *
     C                     TIME           SDATE
     C                     SELEC
      * DELETE
     C           D@OPT     WHEQ '0'
     C           K#55A     CHAINAB#PL55A             99
     C           *IN99     IFEQ *OFF
     C                     MOVE 'D'       A5SKJY
     C                     Z-ADDTODAY     A5SKDT
     C                     UPDATAB#PP551
     C                     ENDIF
      * UPDATE
     C           D@OPT     WHEQ '1'
     C           K#55A     CHAINAB#PL55A             99
     C           *IN99     IFEQ *OFF
     C                     Z-ADDTODAY     A5KODT
     C                     Z-ADDNOW       A5KOTN
     C                     MOVEL#USER     A5KOME
     C                     MOVELD@SHN1    A5SHN1
     C                     MOVELD@SHN2    A5SHN2
     C                     MOVELD@SHN3    A5SHN3
     C                     MOVEL$TRUE1    A5SHDT
     C                     UPDATAB#PP551
     C                     ENDIF
      * ADD
     C           D@OPT     WHEQ '2'
     C                     EXSR #SET1
     C                     WRITEAB#PP551
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------
      * SET DATA
      *----------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     CLEARAB#PP551
     C                     MOVELD@SHN1    A5SHN1
     C                     MOVELD@SHN2    A5SHN2
     C                     MOVELD@SHN3    A5SHN3
     C                     MOVELD@NONY    A5NONY
     C                     MOVELD@PRT1    A5MHN1
     C                     MOVELD@PRT2    A5MHN2
     C                     MOVELD@PRT3    A5MHN3
     C                     MOVELD@PRT4    A5MHN4
     C                     MOVELD@DCL     A5DCLV
     C                     MOVELD@FROM    A5SHDT
      * GROUP
     C                     MOVELD@NONY    $DLV
     C                     CALL 'UTLR62B'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN2   1
     C                     MOVEL$GRP      A5CGRP
      *
     C                     Z-ADDTODAY     A5CRHZ
     C                     Z-ADDNOW       A5CRTM
     C                     MOVEL#USER     A5CRME
     C                     MOVEL#PGM      A5CRPG
      *
     C                     ENDSR
      *----------------------------------------------------
      * INITIAL SET
      *----------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K#55A     KLIST
     C                     KFLD           K#MHN1  5
     C                     KFLD           K#MHN2  5
     C                     KFLD           K#MHN3  5
     C                     KFLD           K#MHN4  5
     C                     KFLD           K#DCLV  6
     C                     KFLD           K#NONY  40
      *
     C                     TIME           SDATE
     C                     MOVELTODAY     $SRC
     C                     CALL 'UTLR01A'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $TRUE2 10
     C                     PARM           $RTN1   1
     C                     MOVEL$TRUE2    XTODAY 10
      *
     C                     ENDSR
      *----------------------------------------------------
** MSG(60A) .......2.........3.........4.........5.........6
PRESS F5 TO RUN...                                            1
ENTER OPTION!                                                 2
OPTION SHOULD BE 0, 1, OR 2!                                  3
ENTER CUSTOMER PART#                                          4
ENTER DESIGN CHG LEVEL!                                       5
DELEIVERY CODE NOT FOUND IN MASTER!                           6
TARGET PART NOT FOUND! CHECK OPTION...                        7
TARGET PART ALREADY EXIST! CHECK OPTION...                    8
ENTER IAF PART!                                               9
ENTER EFFECTIVE DATE!                                        10
EFFECTIVE DATE IS INVALID!                                   11
ENTER DELIVERY CODE!                                         12
PRESS F5 TO UPDATE...                                        13
IAF PART DOES NOT EXIST IN MASTER FILE!                      14
                                                             15
