     H            Y.
     F** AB#R2M *************************************************************
     F*  ..HINO SKID LABEL                                                  *
     F*                                                                     *
     F* TCHK1 04/13/06 BUG FIX                                              *
     F****************************************** AB#R2C *********************
     FAB#PW2M CF  E                    WORKSTN
     FAB#PL76 IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     F            AB#PP751                          KRENAMEAB75R
     FAB#PL14 IF  E           K        DISK
     FAB#PL1A IF  E           K        DISK
     F            AB#PL141                          KRENAMEAB1AR
     FAB#PP47 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#AL01 UF  E           K        DISK                      A
     FAB#WP2C IF  E           K        DISK                      A
     FAB#WP2D O   E                    DISK
     E*****************************************************************
     E                    ERR     1   2 78
     E                    CMD     1   2 78
     E                    CMT     1   1 78
     E                    CAL     1   1 15
     E                    PRT        15 20
     E                    KAN        15  5
     E                    BOX        15  5
     E                    BQT        15  7
     E                    QTY        15  9
     E                    MANI       50 20
     I*****************************************************************
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1  10 MDY
     I                                        1   2 WMM
     I I            '/'                       3   3 HFN1
     I                                        4   5 WDD
     I I            '/'                       6   6 HFN2
     I                                        7  10 WYY
     I            DS
     I                                        1 300 PRT
     I                                        1  20 W2PR01
     I                                       21  40 W2PR02
     I                                       41  60 W2PR03
     I                                       61  80 W2PR04
     I                                       81 100 W2PR05
     I                                      101 120 W2PR06
     I                                      121 140 W2PR07
     I                                      141 160 W2PR08
     I                                      161 180 W2PR09
     I                                      181 200 W2PR10
     I                                      201 220 W2PR11
     I                                      221 240 W2PR12
     I                                      241 260 W2PR13
     I                                      261 280 W2PR14
     I                                      281 300 W2PR15
     I            DS
     I                                        1  75 KAN
     I                                        1   5 W2KN01
     I                                        6  10 W2KN02
     I                                       11  15 W2KN03
     I                                       16  20 W2KN04
     I                                       21  25 W2KN05
     I                                       26  30 W2KN06
     I                                       31  35 W2KN07
     I                                       36  40 W2KN08
     I                                       41  45 W2KN09
     I                                       46  50 W2KN10
     I                                       51  55 W2KN11
     I                                       56  60 W2KN12
     I                                       61  65 W2KN13
     I                                       66  70 W2KN14
     I                                       71  75 W2KN15
     I            DS
     I                                        1  75 BOX
     I                                        1   5 W2BX01
     I                                        6  10 W2BX02
     I                                       11  15 W2BX03
     I                                       16  20 W2BX04
     I                                       21  25 W2BX05
     I                                       26  30 W2BX06
     I                                       31  35 W2BX07
     I                                       36  40 W2BX08
     I                                       41  45 W2BX09
     I                                       46  50 W2BX10
     I                                       51  55 W2BX11
     I                                       56  60 W2BX12
     I                                       61  65 W2BX13
     I                                       66  70 W2BX14
     I                                       71  75 W2BX15
     I            DS
     I                                        1 105 BQT
     I                                        1   7 W2BQ01
     I                                        8  14 W2BQ02
     I                                       15  21 W2BQ03
     I                                       22  28 W2BQ04
     I                                       29  35 W2BQ05
     I                                       36  42 W2BQ06
     I                                       43  49 W2BQ07
     I                                       50  56 W2BQ08
     I                                       57  63 W2BQ09
     I                                       64  70 W2BQ10
     I                                       71  77 W2BQ11
     I                                       78  84 W2BQ12
     I                                       85  91 W2BQ13
     I                                       92  98 W2BQ14
     I                                       99 105 W2BQ15
     I            DS
     I                                        1 135 QTY
     I                                        1   9 W2QT01
     I                                       10  18 W2QT02
     I                                       19  27 W2QT03
     I                                       28  36 W2QT04
     I                                       37  45 W2QT05
     I                                       46  54 W2QT06
     I                                       55  63 W2QT07
     I                                       64  72 W2QT08
     I                                       73  81 W2QT09
     I                                       82  90 W2QT10
     I                                       91  99 W2QT11
     I                                      100 108 W2QT12
     I                                      109 117 W2QT13
     I                                      118 126 W2QT14
     I                                      127 135 W2QT15
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *  MAIN
      *------------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           *INZSR    BEGSR
      *
     C           K#14      KLIST
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C                     KFLD           K@NOBN  20
     C                     KFLD           K@DEYY  40
     C                     KFLD           K@DEMM  20
     C                     KFLD           K@DEDD  20
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C           K#1A      KLIST
     C                     KFLD           K@YMD
     C                     KFLD           K@NOBN
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C           K#47      KLIST
     C                     KFLD           BANONY
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BANOHZ
     C                     KFLD           BANOBN
     C                     KFLD           BAODRN
     C           K#75      KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
      *
     C           K#FCE     KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C* AB#R2K
     C           P2        PLIST
     C                     PARM           PIQTY  300       NUMERIC QTY
     C                     PARM           POQTY  30        CHAR    QTY
     C           P#2O      PLIST
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
     C***********************************************************
     C* 1ST SCREEN
     C***********************************************************
     C           #SCRN1    BEGSR
      *
B01  C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      W@ID
     C           *INKI     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT1
     C                     EXSR #WRT2
     C                     MOVE CMT,1     D@OK
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C***********************************************************
     C* 1ST SCREEN CHECK
     C***********************************************************
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C           D@BARC    CHAINAB#PL76              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVE ERR,1     D@MSG
     C                     ELSE
     C                     Z-ADDPUNOYY    K@NOYY
     C                     Z-ADDPUNOMM    K@NOMM
     C                     Z-ADDPUNODD    K@NODD
     C                     Z-ADDPUBINN    K@NOBN  20
     C                     Z-ADDPURLYY    K@DEYY  40
     C                     Z-ADDPURLMM    K@DEMM  20
     C                     Z-ADDPURLDD    K@DEDD  20
     C                     Z-ADDPUNONY    K@NONY  40
     C                     MOVELPUNKOJ    K@NKOJ  1
     C                     MOVELPUNUKE    K@NUKE  4
     C                     MOVELPUODRN    W@ODRN 10
     C                     Z-ADDPUCUST    W@CUST  40
     C                     ENDIF
      *
     C                     MOVE D@BARC    @@SERL
      *
     C                     ENDSR
     C***********************************************************
     C* 2ND SCREEN
     C***********************************************************
     C           #SCRN2    BEGSR
      *
B01  C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP02
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      W@ID
     C           *INKL     WHEQ *ON
TCHK1C*                    MOVE '12'      W@ID
TCHK1C                     MOVE '01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT1
     C                     EXSR #WRT2
     C                     MOVE CMT,1     D@OK
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C***********************************************************
     C* 2ND SCREEN CHECK
     C***********************************************************
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     Z-ADDD@SHDT    K@YMD
     C                     Z-ADDD@BIN     K@NOBN
     C                     Z-ADDD@NONY    K@NONY
     C                     MOVE D@FACT    K@NKOJ
     C                     MOVE D@NUKE    K@NUKE
     C           K#1A      CHAINAB#PL1A              90
     C           *IN90     IFEQ *ON
     C                     SETON                     99
     C                     MOVEA'111111'  *IN,61
     C                     MOVE ERR,2     D@MSG
     C                     ELSE
     C                     Z-ADDBADEYY    K@DEYY  40
     C                     Z-ADDBADEMM    K@DEMM  20
     C                     Z-ADDBADEDD    K@DEDD  20
     C                     MOVEL*BLANK    W@ODRN 10
     C                     Z-ADDD@CUST    W@CUST  40
      *
     C           K#75      CHAINAB#PL75              91
     C           *IN91     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C                     MOVELPUSERL    @@SERL  9
     C                     ELSE
     C                     MOVE *BLANK    @@SERL
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
     C***********************************************************
     C* CLEAR
     C***********************************************************
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,61
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *BLANK    D@OK
      *
     C                     ENDSR
     C***********************************************************
     C* WRITE RECORDS
     C***********************************************************
     C           #WRT1     BEGSR
      *
     C                     MOVE *BLANK    MANI
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     @TWGHT 132
     C                     Z-ADD*ZERO     @TBOX   90
      *
     C           K#14      SETLLAB#PL14
     C           *IN90     DOUEQ*ON
     C           K#14      READEAB#PL14                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           W@ODRN    IFNE *BLANK
     C           W@ODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARAB#WP2C1
      *
     C           K#47      CHAINAB#PP47              95
     C           *IN95     IFEQ *OFF
     C                     MOVELABMANI    WCMANI
     C                     MOVELABSPCD    @@SPNM 10
     C                     ELSE
     C                     MOVELBAINVN    WCMANI
     C                     MOVEL'H1491'   @@SPNM
     C                     ENDIF
      *
     C           WCMANI    LOKUPMANI                     10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C                     MOVELWCMANI    MANI,X
     C                     ENDIF
      *
     C                     MOVELBAMHIN    WCPART
     C                     Z-ADDBASRYO    WCQTY
     C                     MOVELBASBAN    WCSBAN
     C                     Z-ADDBASYOS    WCBOX
     C           BASYOS    IFEQ *ZERO
     C                     Z-ADDBAUSYS    WCBOX
     C                     ENDIF
      *
     C           K#FCE     CHAINFCEPL01              91
     C           *IN91     IFEQ *OFF
     C           A2KASI    MULT BASRYO    @@WGHT 112
     C                     ADD  @@WGHT    @TWGHT
     C                     ENDIF
      *
     C           WCBOX     IFEQ *ZERO
     C                     ADD  1         @TBOX
     C                     ELSE
     C           BASRYO    DIV  WCBOX     @@BOX   50
     C                     ADD  @@BOX     @TBOX
     C                     ENDIF
      *
     C                     WRITEAB#WP2C1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* WRITE RECORDS
     C***********************************************************
     C           #WRT2     BEGSR
      *
     C                     Z-ADDX         PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     @MT     3                    R
      *
     C                     MOVE K@NOYY    WYY
     C                     MOVE K@NOMM    WMM
     C                     MOVE K@NODD    WDD
     C                     CLOSEAB#WP2C
     C                     OPEN AB#WP2C
      *
     C           @@SERL    IFNE *BLANK
     C           @@SERL    CHAINAB#AL01              90
     C   90                CLEARAB#AP011
     C                     MOVE K@NONY    APNONY
     C                     MOVE K@NUKE    APNUKE
     C                     Z-ADDK@YMD     APSHDT
     C                     Z-ADDK@NOBN    APBIN
     C                     MOVEL@@SERL    APSERL
     C                     Z-ADDX         APPLNO
     C           X         MULT 37        APTARE
     C                     Z-ADD@TBOX     APCTNO
     C           @TWGHT    DIV  1000      @@KG   112H
     C           @@KG      MULT 2.2046    APWEIT
     C                     MOVE K@YMD     @6      6
     C                     MOVE K@NOBN    @1      1
     C           @6        CAT  @1:0      APBLNO    P
     C  N90                UPDATAB#AP011
     C   90                WRITEAB#AP011
     C                     ENDIF
      *
     C                     MOVE *BLANK    @@MANI 20
     C                     CLEARAB#WP2D1
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     M       30
     C                     Z-ADD*ZERO     @BTOT   70
      *
     C           *LOVAL    SETLLAB#WP2C
     C           *IN90     DOUEQ*ON
     C                     READ AB#WP2C                  90
     C           *IN90     IFEQ *OFF
     C           *IN90     OREQ *ON
     C           X         ANDGT*ZERO
     C           WCMANI    IFNE @@MANI
     C           *IN90     OREQ *ON
     C           X         IFNE *ZERO
     C                     MOVEL@MT       W2SKDT
     C                     ADD  1         M
     C                     Z-ADDM         PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     W2SKD#                       R
      *
     C                     Z-ADD@BTOT     PIN
     C                     MOVE *BLANK    POUT
     C                     Z-ADD*ZERO     PLEN
     C                     CALL 'AB#R2O'  P#2O
     C                     MOVE POUT      W2TOTQ                       R
      *
     C                     WRITEAB#WP2D1
     C   90                LEAVE
     C                     ENDIF
      *
     C                     CLEARAB#WP2D1
     C                     MOVELWCMANI    W2MANI
     C                     MOVEL@@SPNM    W2SUPL
     C                     MOVELMDY       W2SHDT
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     @BTOT   70
     C                     MOVELWCMANI    @@MANI
     C                     ENDIF
      *
     C                     ADD  1         X
     C                     MOVELWCPART    PRT,X
     C                     MOVELWCSBAN    KAN,X
      *
     C                     Z-ADDWCBOX     PIN
     C                     MOVE *BLANK    POUT
     C                     Z-ADD*ZERO     PLEN
     C                     CALL 'AB#R2O'  P#2O
     C                     MOVE POUT      BQT,X                        R
      *
     C                     Z-ADDWCQTY     PIN
     C                     MOVE *BLANK    POUT
     C                     Z-ADD*ZERO     PLEN
     C                     CALL 'AB#R2O'  P#2O
     C                     MOVE POUT      QTY,X                        R
      *
     C           WCBOX     IFEQ *ZERO
     C                     Z-ADD1         W@BOX   50
     C                     ELSE
     C           WCQTY     DIV  WCBOX     W@BOX
     C                     ENDIF
     C                     ADD  W@BOX     @BTOT
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLOSEAB#WP2C
     C                     MOVELCAL,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AB#WP2C
      *
     C                     ENDSR
     C***********************************************************
** ERR
E-01 BARCODE ERROR.
E-02 NO ORDER.
** CMD
 F3:END    F5:WRITE     F9:MANUAL ENTRY
 F3:END    F5:WRITE     F12:GO BACK
** CMT
   LABEL DATA HAS BEEN CREATED. CLICK THE SKID LABEL ICON ON YOUR DESK TOP.
** CAL
CLRPFM AB#WP2C
