     H            Y/
     H* AB#R9H ********************************************************
     H* SHIPPED BOX INQUIRY
     H*
     H* TCHK1 03/19/10 CREATE(COPY FROM AB#R9D)
     H* TCHK2 05/12/10 ADD NONY
     H* TCHK3 03/11/11 ADD NONY
     H* TCHK4 03/25/11 ADD NONY
JW1  H* JW    03/03/16 ADD NONY 1620 HONDA TRADING
JW2  H* JW    08/18/16 ADD NONY 1630 HONDA TRADING
JW3  H* JW    10/05/16 ADD NONY 0396 HONDA GDL
JW4  H* JW    03/15/17 ADD NONY 0397 HONDA HSP
JW5  H* JW    01/18/18 ADD NONY 0405 HONDA SUPPLY
JW6  H* JW    06/18/18 ADD NONY 0398 HONDA SUPPLY (FLEETWOOD METAL)
"    H* JW    09/21/18 ADD NONY 0399 HONDA SUPPLY (PLASMAN)
"    H* JW    02/27/20 ADD NONY 1012 HONDA SUPPLY (TI FLUID)
"    H* JW    06/26/20 ADD NONY 3131 HONDA SUPPLY (TOPRE WORLD)
"    H* JW    11/16/20 ADD NONY 1013 HONDA SUPPLY (US FARATHANE)
"    H* JW    06/16/21 ADD NONY 2050 HONDA (STANLEY)
"    H* JW    03/11/22 ADD NONY 1622 HONDA (TRADING)
JW7  H* JW    04/29/21 CHK W@SCNT=0 (SCANNED QTY)
JW8  H* JW    09/01/23 CHG BANONY --> BATOKU
     H*****************************************************************
     FAB#PW9H CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                        RRN3  KSFILE SFL03
     F                                              KINFDS @INFDS
     FAB#PL1K IF  E           K        DISK
     FAB#PL12 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FGADPL13 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FABP9H   UF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER                        UC
      *
     E                    CMX     1   4 78
     E                    CMD     1   1 80
     E                    ARY        80  1
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  20 PART#
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1  20 IPT#
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      * ----------------------------------------------------
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C*
     C           KEY1      KLIST
     C                     KFLD           D@YYYY                       G)
     C                     KFLD           D@MM                         G)
     C                     KFLD           D@DD                         G)
     C           KEYF      KLIST
     C                     KFLD           W@IPT1
     C                     KFLD           W@IPT2                       G)
     C                     KFLD           W@IPT3                       G)
     C           KEY2      KLIST
     C                     KFLD           D@YYYY                       G)
     C                     KFLD           D@MM                         G)
     C                     KFLD           D@DD                         G)
     C                     KFLD           S@PAR1                       G)
     C                     KFLD           S@PAR2                       G)
     C                     KFLD           S@PAR3                       G)
     C                     KFLD           S@PAR4                       G)
      *--------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRNT
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE '1'       P@PRT
     C           *LIKE     DEFN S@TCNT    W@TCNT
     C           *LIKE     DEFN S@PAR1    W@PAR1
     C           *LIKE     DEFN S@PAR2    W@PAR2
     C           *LIKE     DEFN S@PAR3    W@PAR3
     C           *LIKE     DEFN S@PAR4    W@PAR4
     C           *LIKE     DEFN S@IPT1    W@IPT1
     C           *LIKE     DEFN S@IPT2    W@IPT2
     C           *LIKE     DEFN S@IPT3    W@IPT3
     C           *LIKE     DEFN S@LOC1    W@LOC1
     C           *LIKE     DEFN S@LOC2    W@LOC2
     C           *LIKE     DEFN S@LOC3    W@LOC3
     C           *LIKE     DEFN S@LOC4    W@LOC4
     C                     CLEARW@TCNT
     C                     CLEARW@PAR1
     C                     CLEARW@PAR2
     C                     CLEARW@PAR3
     C                     CLEARW@PAR4
     C                     CLEARW@IPT1
     C                     CLEARW@IPT2
     C                     CLEARW@IPT3
     C                     CLEARW@LOC1
     C                     CLEARW@LOC2
     C                     CLEARW@LOC3
     C                     CLEARW@LOC4
      *
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    D@YYYY
     C                     Z-ADDWSSMMM    D@MM
     C                     Z-ADDWSSDDD    D@DD
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMX,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
     C                     MOVE '0'       *IN98
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #SETT
     C                     MOVE '02'      @@ID
     C           *IN98     IFEQ '1'
     C                     MOVE '01'      @@ID
     C                     ELSE
     C                     Z-ADD1         W@REC3
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SETT     BEGSR
      *
     C                     MOVE *ON       *IN61
     C                     WRITECTL03
     C                     MOVE *OFF      *IN61
     C                     MOVE *OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
     C                     Z-ADD*ZERO     D@BOXS
     C                     Z-ADD*ZERO     D@NBOX
     C                     Z-ADD*ZERO     W@CCNT  50
     C                     Z-ADD*ZERO     W@NCNT  50
     C                     Z-ADD*ZERO     W@TOKU  40
     C                     Z-ADD*ZERO     W@NONY  40
      *
     C                     Z-ADDD@YYYY    W@YYYY  40
     C                     Z-ADDD@MM      W@MM    20
     C                     Z-ADDD@DD      W@DD    20
     C*
     C           KEY1      SETLLAB#PL12
      *
     C                     DO   *HIVAL
      *
     C           KEY1      READEAB#PL12                  92
     C   92                LEAVE
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C**JW8      BANONY    IFEQ 0391                       HDM
     C**         BANONY    OREQ 3128                       ELP
     C**         BANONY    OREQ 3135                       HMIN
     C**         BANONY    OREQ 4126                       MAP
     C**         BANONY    OREQ 2020                       SHOWA CANADA
     C**         BANONY    OREQ 2021                       HCM PLANT1
     C**         BANONY    OREQ 2022                       HCM PLANT2
     C**         BANONY    OREQ 0294                       HMA
TCHK2C**         BANONY    OREQ 3127                       GLA ELP
TCHK2C**         BANONY    OREQ 4127                       GLA MAP
TCHK2C**         BANONY    OREQ 0290                       GLA HMA
TCHK3C**         BANONY    OREQ 0293                       HMA GUARD HOUSE...END
TCHK3C**         BANONY    OREQ 0289                       GULFSHORE
TCHK3C**         BANONY    OREQ 2024                       F & P
TCHK3C**         BANONY    OREQ 0296                       HTM...END
TCHK3C**         BANONY    OREQ 0402                       HDM(IPS)...END
TCHK3C**         BANONY    OREQ 2418                       AEP...END
TCHK3C**         BANONY    OREQ 3126                       MIDWEST EXPRESS
TCHK4C**         BANONY    OREQ 2025                       HCM MARION IND
TCHK4C**         BANONY    OREQ 3134                       HMIN MARION IND
JW1  C**         BANONY    OREQ 1620                       TOH TRADING
JW2  C**         BANONY    OREQ 1630                       TOH TRADING
JW3  C**         BANONY    OREQ 0396                       GDL
JW4  C**         BANONY    OREQ 0397                       HSP
JW5  C**         BANONY    OREQ 0405                       HSP
JW6  C**         BANONY    OREQ 0398                       HSP
JW6  C**         BANONY    OREQ 0399                       HSP
JW6  C**         BANONY    OREQ 1012                       HSP
JW6  C**         BANONY    OREQ 3131                       HSP
JW6  C**         BANONY    OREQ 1013                       HSP
JW6  C**         BANONY    OREQ 1014                       HSP
JW6  C**         BANONY    OREQ 2050                       HSP STANLEY
JW6  C**         BANONY    OREQ 2044                       HCM CELINA
JW6  C**         BANONY    OREQ 2037                       HCM EG TRANSPIRE
JW6  C**         BANONY    OREQ 1622                       HONDA TRADING
JW6  C**         BANONY    OREQ 1015                       HONDA EG TRANSPIRE
JW6  C**         BANONY    OREQ 2030                       HONDA LISTOWEL
JW6  C**         BANONY    OREQ 2083                       HCM NISSIN PLANT2
JW6  C**         BANONY    OREQ 0300                       HSP KIRCHHOFF, OH
JW6  C**         BANONY    OREQ 1057                       HSP KIRCHHOFF, GA
JW6  C**         BANONY    OREQ 1059                       HSP PLASMAN  , CANADA
     C**                   ELSE
     C**                   ITER
     C**                   END
      *
JW8  C           BATOKU    IFEQ 0294                       HMA
     C           BATOKU    OREQ 0295                       HCM
     C           BATOKU    OREQ 0296                       HTM
     C           BATOKU    OREQ 0390                       HAM
     C           BATOKU    OREQ 0391                       HDM
     C           BATOKU    OREQ 0400                       AHP
     C           BATOKU    OREQ 1602                       HT
     C           BATOKU    OREQ 3135                       HMIN
     C                     ELSE
     C                     ITER
JW8  C                     ENDIF
      *
     C           W@TOKU    IFEQ *ZERO
     C           W@NONY    ANDEQ*ZERO
     C                     Z-ADDBATOKU    W@TOKU
     C                     Z-ADDBANONY    W@NONY
     C                     END
     C*
     C           BATOKU    IFNE W@TOKU
     C           BANONY    ORNE W@NONY
     C                     CLEARSFL03
     C                     Z-ADDW@NONY    S3DLCD
     C           W@NONY    CHAINGADPL13              93
     C  N93                MOVELB5KMEI    S3DLNM
     C   93                MOVEL*BLANK    S3DLNM
     C                     Z-ADDW@CCNT    S3BOXS
     C                     Z-ADDW@NCNT    S3NCNT
     C                     ADD  1         RRN3
     C                     WRITESFL03
     C                     Z-ADD*ZERO     W@CCNT
     C                     Z-ADD*ZERO     W@NCNT
     C                     Z-ADDBATOKU    W@TOKU
     C                     Z-ADDBANONY    W@NONY
     C                     END
      *
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    W#RST
     C                     ELSE
     C           BASYOS    IFNE 0
     C           BASRYO    DIV  BASYOS    W#RST   50
     C                     ELSE
     C                     Z-ADD1         W#RST
     C                     END
     C                     END
     C                     ADD  W#RST     D@BOXS
     C                     ADD  W#RST     W@CCNT
     C*
     C                     Z-ADD*ZERO     W@SCNT  50
     C                     EXSR #SCNT
     C           W@SCNT    IFLT W#RST
     C           W#RST     SUB  W@SCNT    W@@CNT  50
     C                     ADD  W@@CNT    W@NCNT
     C                     ADD  W@@CNT    D@NBOX
     C                     END
      *
     C                     ENDDO
      *
     C           W@CCNT    IFNE *ZERO
     C                     CLEARSFL03
     C                     Z-ADDW@NONY    S3DLCD
     C           W@NONY    CHAINGADPL13              93
     C  N93                MOVELB5KMEI    S3DLNM
     C   93                MOVEL*BLANK    S3DLNM
     C                     Z-ADDW@CCNT    S3BOXS
     C                     Z-ADDW@NCNT    S3NCNT
     C                     ADD  1         RRN3
     C                     WRITESFL03
     C                     END
      *
     C           RRN3      IFEQ *ZERO
     C                     MOVEL*ON       *IN98
     C                     END
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRNT    BEGSR
      *
     C                     MOVE CMX,3     D@CMD
     C                     WRITEDSP99
     C                     Z-ADDW@REC3    #RCNO3
     C                     EXFMTCTL03
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@REC3  40
     C                     ELSE
     C                     Z-ADD1         W@REC3
     C                     END
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     OTHER
     C                     EXSR #CHKT
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #CHKT     BEGSR
     C*
     C                     DO
     C*
     C           D@YYYY    IFNE W@YYYY
     C           D@MM      ORNE W@MM
     C           D@DD      ORNE W@DD
     C                     EXSR #SETT
     C                     MOVE '02'      @@ID
     C           *IN98     IFEQ '1'
     C                     MOVE '01'      @@ID
     C                     ELSE
     C                     Z-ADD1         W@REC3
     C                     END
     C                     LEAVE
     C                     END
      *
     C                     MOVEL*ON       W@ALL   1
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     RRN3
     C           *IN97     DOUEQ*ON
     C                     ADD  1         RRN3
     C           RRN3      CHAINSFL03                97
     C   97                LEAVE
     C           S3SLCT    IFNE *BLANK
     C                     MOVEL*OFF      W@ALL
     C                     END
     C                     ENDDO
     C*
     C           W@ALL     IFEQ *OFF
     C                     Z-ADD*ZERO     RRN3
     C           *IN97     DOUEQ*ON
     C                     ADD  1         RRN3
     C           RRN3      CHAINSFL03                97
     C   97                LEAVE
     C           S3SLCT    IFNE *BLANK
     C                     MOVEL*BLANK    S3SLCT
     C                     Z-ADDS3DLCD    W3DLCD  40
     C                     MOVELS3DLNM    W3DLNM 15
     C                     UPDATSFL03
     C                     EXSR #SET
     C                     Z-ADD1         W@REC#
     C                     EXSR #SCRN2
     C   KA                LEAVE
     C                     END
     C                     ENDDO
     C                     ELSE
     C                     EXSR #SET
     C                     Z-ADD1         W@REC#
     C                     EXSR #SCRN2
     C                     END
      *
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C           *LOVAL    SETLLABP9H
     C                     DO   *HIVAL
     C                     READ ABP9H                    91
     C   91                LEAVE
     C                     DELETABP9H1
     C                     ENDDO
      *
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     MOVE *OFF      *IN51
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     W@TCNT
     C                     Z-ADD*ZERO     W@NCNT
     C                     CLEARW@PAR1
     C                     CLEARW@PAR2
     C                     CLEARW@PAR3
     C                     CLEARW@PAR4
     C                     CLEARW@IPT1
     C                     CLEARW@IPT2
     C                     CLEARW@IPT3
     C                     CLEARW@LOC1
     C                     CLEARW@LOC2
     C                     CLEARW@LOC3
     C                     CLEARW@LOC4
     C                     MOVE ' '       @FIRST  1
      *
     C           KEY1      SETLLAB#PP101
      *
     C           *IN90     DOUEQ*ON
      *
     C           KEY1      READEAB#PP101                 90
     C   90                LEAVE
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           BANONY    IFEQ 0391                       HDM
     C           BANONY    OREQ 3128                       ELP
     C           BANONY    OREQ 3135                       HMI
     C           BANONY    OREQ 4126                       MAP
     C           BANONY    OREQ 2020                       SHOWA CANADA
     C           BANONY    OREQ 2021                       HCM PLANT1
     C           BANONY    OREQ 2022                       HCM PLANT2
     C           BANONY    OREQ 0294                       HMA
TCHK2C           BANONY    OREQ 3127                       GLA ELP
TCHK2C           BANONY    OREQ 4127                       GLA MAP
TCHK2C           BANONY    OREQ 0290                       GLA HMA
TCHK3C           BANONY    OREQ 0293                       HMA GUARD HOUSE...END
TCHK3C           BANONY    OREQ 0289                       GULFSHORE
TCHK3C           BANONY    OREQ 2024                       F & P
TCHK3C           BANONY    OREQ 0296                       HTM...END
TCHK3C           BANONY    OREQ 0402                       HDM(IPS)...END
TCHK3C           BANONY    OREQ 2418                       AEP...END
TCHK3C           BANONY    OREQ 3126                       MIDWEST EXPRESS
TCHK4C           BANONY    OREQ 2025                       HCM MARION IND
TCHK4C           BANONY    OREQ 3134                       HMIN MARION IND
JW1  C           BANONY    OREQ 1620                       TOH TRADING
JW2  C           BANONY    OREQ 1630                       TOH TRADING
JW3  C           BANONY    OREQ 0396                       GDL
JW4  C           BANONY    OREQ 0397                       HSP
JW5  C           BANONY    OREQ 0405                       HSP
JW6  C           BANONY    OREQ 0398                       HSP
JW6  C           BANONY    OREQ 0399                       HSP
JW6  C           BANONY    OREQ 1012                       HSP
JW6  C           BANONY    OREQ 3131                       HSP
JW6  C           BANONY    OREQ 1013                       HSP
JW6  C           BANONY    OREQ 1014                       HSP
JW6  C           BANONY    OREQ 2050                       HSP STANLEY
JW6  C           BANONY    OREQ 2044                       HCM CELINA
JW6  C           BANONY    OREQ 2037                       HCM EG TRANSPIRE
JW6  C           BANONY    OREQ 1622                       HONDA TRADING
JW6  C           BANONY    OREQ 1015                       HONDA EG TRANSPIRE
JW6  C           BANONY    OREQ 2030                       HONDA LISTOWEL
JW6  C           BANONY    OREQ 2083                       HCM NISSIN PLANT2
JW6  C           BANONY    OREQ 0300                       HSP KIRCHHOFF, OH
JW6  C           BANONY    OREQ 1507                       HSP KIRCHHOFF, GA
     C                     ELSE
     C                     ITER
     C                     END
     C*
     C           W@ALL     IFEQ *OFF
     C           BANONY    IFNE W3DLCD
     C                     ITER
     C                     END
     C                     END
     C*
     C           @FIRST    IFEQ ' '
     C                     MOVELPART#     PARTSV 20
     C                     MOVELIPT#      IPTSV  12
     C                     MOVE BAMHN1    W@PAR1
     C                     MOVE BAMHN2    W@PAR2
     C                     MOVE BAMHN3    W@PAR3
     C                     MOVE BAMHN4    W@PAR4
     C                     MOVE BASHN1    W@IPT1
     C                     MOVE BASHN2    W@IPT2
     C                     MOVE BASHN3    W@IPT3
     C                     MOVE 'X'       @FIRST
     C           W@ALL     IFEQ *ON
     C                     MOVEL'ALL'     D@DLIF    P
     C                     ELSE
     C                     MOVELW3DLCD    D@DLIF
     C                     MOVE W3DLNM    D@DLIF
     C                     END
     C                     END
     C*
     C           PART#     IFEQ PARTSV
     C           IPT#      ANDEQIPTSV
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    WRST
     C                     ELSE
     C           BASYOS    IFNE 0
     C           BASRYO    DIV  BASYOS    WRST    90
     C                     ELSE
     C                     Z-ADD1         WRST
     C                     END
     C                     END
     C                     ADD  WRST      W@TCNT
     C*
     C                     Z-ADD*ZERO     W@SCNT  50
     C                     EXSR #SCNT
     C           W@SCNT    IFLT WRST
     C           WRST      SUB  W@SCNT    W@@CNT
     C                     ADD  W@@CNT    W@NCNT
     C                     END
      *
     C                     ELSE
      *
     C           KEYF      CHAINFCEPL011             77
     C           *IN77     IFEQ '0'
     C           A2GSKD    ANDEQ' '
     C                     MOVE A2STRK    W@LOC1
     C                     MOVE A2STRT    W@LOC2
     C                     MOVE A2STRR    W@LOC3
     C                     MOVE A2STRD    W@LOC4
     C                     ELSE
     C                     CLEARW@LOC1
     C                     CLEARW@LOC2
     C                     CLEARW@LOC3
     C                     CLEARW@LOC4
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     CLEARSFL01
     C                     Z-ADDW@TCNT    S@TCNT
     C                     Z-ADDW@NCNT    S1NCNT
     C                     MOVELW@PAR1    S@PAR1
     C                     MOVELW@PAR2    S@PAR2
     C                     MOVELW@PAR3    S@PAR3
     C                     MOVELW@PAR4    S@PAR4
     C                     MOVELW@IPT1    S@IPT1
     C                     MOVELW@IPT2    S@IPT2
     C                     MOVELW@IPT3    S@IPT3
     C                     MOVELW@LOC1    S@LOC1
     C                     MOVELW@LOC2    S@LOC2
     C                     MOVELW@LOC3    S@LOC3
     C                     MOVELW@LOC4    S@LOC4
     C                     WRITESFL01
      *WRITE TO  ABP9H
     C                     WRITEABP9H1
      *
     C                     MOVELPART#     PARTSV
     C                     MOVELIPT#      IPTSV
     C                     CLEARW@TCNT
     C                     CLEARW@NCNT
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    WRST
     C                     ELSE
     C           BASYOS    IFNE 0
     C           BASRYO    DIV  BASYOS    WRST    90
     C                     ELSE
     C                     Z-ADD1         WRST
     C                     END
     C                     END
     C                     ADD  WRST      W@TCNT
     C*
     C                     Z-ADD*ZERO     W@SCNT  50
     C                     EXSR #SCNT
     C           W@SCNT    IFLT WRST
     C           WRST      SUB  W@SCNT    W@@CNT
     C                     ADD  W@@CNT    W@NCNT
     C                     END
     C*
     C                     MOVE BAMHN1    W@PAR1
     C                     MOVE BAMHN2    W@PAR2
     C                     MOVE BAMHN3    W@PAR3
     C                     MOVE BAMHN4    W@PAR4
     C                     MOVE BASHN1    W@IPT1
     C                     MOVE BASHN2    W@IPT2
     C                     MOVE BASHN3    W@IPT3
     C                     END
     C*
     C                     ENDDO
      * LAST RECORD
     C           KEYF      CHAINFCEPL011             77
     C           *IN77     IFEQ '0'
     C           A2GSKD    ANDEQ' '
     C                     MOVE A2STRK    W@LOC1
     C                     MOVE A2STRT    W@LOC2
     C                     MOVE A2STRR    W@LOC3
     C                     MOVE A2STRD    W@LOC4
     C                     ELSE
     C                     CLEARW@LOC1
     C                     CLEARW@LOC2
     C                     CLEARW@LOC3
     C                     CLEARW@LOC4
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     CLEARSFL01
     C                     Z-ADDW@TCNT    S@TCNT
     C                     Z-ADDW@NCNT    S1NCNT
     C                     MOVELW@PAR1    S@PAR1
     C                     MOVELW@PAR2    S@PAR2
     C                     MOVELW@PAR3    S@PAR3
     C                     MOVELW@PAR4    S@PAR4
     C                     MOVELW@IPT1    S@IPT1
     C                     MOVELW@IPT2    S@IPT2
     C                     MOVELW@IPT3    S@IPT3
     C                     MOVELW@LOC1    S@LOC1
     C                     MOVELW@LOC2    S@LOC2
     C                     MOVELW@LOC3    S@LOC3
     C                     MOVELW@LOC4    S@LOC4
     C                     WRITESFL01
      *WRITE TO  ABP9H
     C                     WRITEABP9H1
      * LAST RECORD
     C*
     C           RRN1      IFEQ 0
     C                     MOVE '1'       *IN98
     C                     END
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     DO   *HIVAL
      *
     C                     MOVE CMX,2     D@CMD
     C                     WRITEDSP99
     C                     Z-ADDW@REC#    #RCNO
     C                     EXFMTCTL01
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@REC#  40
     C                     ELSE
     C                     Z-ADD1         W@REC#
     C                     END
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      @@ID
     C                     LEAVE
     C           *INKE     WHEQ *ON
     C           P@PRT     IFEQ '1'
     C           P@PRT     OREQ '2'
     C           P@PRT     OREQ '3'
     C           P@PRT     OREQ '4'
     C           P@PRT     OREQ '5'
     C           P@PRT     OREQ '6'
     C           P@PRT     OREQ '7'
     C           P@PRT     OREQ '8'
     C           P@PRT     OREQ '9'
     C                     ELSE
     C                     MOVEL'1'       P@PRT
     C                     END
     C           P@PRT     IFEQ '1'
     C                     MOVEL'LANPRT02'@PRT    8
     C                     ENDIF
     C           P@PRT     IFEQ '2'
     C                     MOVEL'LANPRT07'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '3'
     C                     MOVEL'LANPRT08'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '4'
     C                     MOVEL'LANPRT03'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '5'
     C                     MOVEL'QPRINTA '@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '6'
     C                     MOVEL'LANPRT09'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '7'
     C                     MOVEL'LANPRT10'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '8'
     C                     MOVEL'LANPRT05'@PRT
     C                     ENDIF
     C           P@PRT     IFEQ '9'
     C                     MOVEL'QDKT    '@PRT
     C                     ENDIF
     C                     MOVEACMD,1     ARY
     C                     MOVEA@PRT      ARY,27
     C                     MOVEL*BLANK    P@CMD
     C                     MOVEAARY       P@CMD
     C                     Z-ADD80        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT
     C                     EXSR #PRINT
     C                     CLOSEQPRINT
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     SETON                     99
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN97     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                97
     C           *IN97     IFEQ *OFF
     C           S@SELC    ANDNE*BLANK
     C                     MOVE *OFF      *IN99
     C                     MOVEL*BLANK    S@SELC
     C                     UPDATSFL01
     C                     EXSR #SET1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     MOVE *ON       *IN33
     C                     WRITECTL02
     C                     MOVE *OFF      *IN33
     C                     MOVE *OFF      *IN34
     C                     Z-ADD*ZERO     RRN2    40
     C                     CLEARS@DELV
     C                     CLEARS@DCNT
     C                     CLEARS2NCNT
      *
     C                     MOVELS@PAR1    D2MHN1
     C                     MOVELS@PAR2    D2MHN2
     C                     MOVELS@PAR3    D2MHN3
     C                     MOVELS@PAR4    D2MHN4
     C                     MOVELS@LOC1    D2TKR1
     C                     MOVELS@LOC2    D2TKR2
     C                     MOVELS@LOC3    D2TKR3
     C                     MOVELS@LOC4    D2TKR4
     C                     MOVELS@IPT1    D2SHN1
     C                     MOVELS@IPT2    D2SHN2
     C                     MOVELS@IPT3    D2SHN3
      *
     C           KEY2      SETLLAB#PP101
     C           *IN91     DOUEQ*ON
     C           KEY2      READEAB#PP101                 91
     C   91                LEAVE
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           BANONY    IFEQ 0391                       HDM
     C           BANONY    OREQ 3128                       ELP
     C           BANONY    OREQ 3135                       HMI
     C           BANONY    OREQ 4126                       MAP
     C           BANONY    OREQ 2020                       SHOWA CANADA
     C           BANONY    OREQ 2021                       HCM PLANT1
     C           BANONY    OREQ 2022                       HCM PLANT2
     C           BANONY    OREQ 0294                       HMA
TCHK2C           BANONY    OREQ 3127                       GLA ELP
TCHK2C           BANONY    OREQ 4127                       GLA MAP
TCHK2C           BANONY    OREQ 0290                       GLA HMA
TCHK3C           BANONY    OREQ 0293                       HMA GUARD HOUSE...END
TCHK3C           BANONY    OREQ 0289                       GULFSHORE
TCHK3C           BANONY    OREQ 2024                       F & P
TCHK3C           BANONY    OREQ 0296                       HTM...END
TCHK3C           BANONY    OREQ 0402                       HDM(IPS)...END
TCHK3C           BANONY    OREQ 2418                       AEP...END
TCHK3C           BANONY    OREQ 3126                       MIDWEST EXPRESS
TCHK4C           BANONY    OREQ 2025                       HCM MARION IND
TCHK4C           BANONY    OREQ 3134                       HMIN MARION IND
JW1  C           BANONY    OREQ 1620                       TOH TRADING
JW2  C           BANONY    OREQ 1630                       TOH TRADING
JW3  C           BANONY    OREQ 0396                       GDL
JW4  C           BANONY    OREQ 0397                       HSP
JW5  C           BANONY    OREQ 0405                       HSP
JW6  C           BANONY    OREQ 0398                       HSP
JW6  C           BANONY    OREQ 0399                       HSP
JW6  C           BANONY    OREQ 1012                       HSP
JW6  C           BANONY    OREQ 3131                       HSP
JW6  C           BANONY    OREQ 1013                       HSP
JW6  C           BANONY    OREQ 1014                       HSP
JW6  C           BANONY    OREQ 2050                       HSP STALEY
JW6  C           BANONY    OREQ 2044                       HCM CELINA
JW6  C           BANONY    OREQ 2037                       HCM EG TRANSPIRE
JW6  C           BANONY    OREQ 1622                       HONDA TRADING
JW6  C           BANONY    OREQ 1015                       HONDA EG TRANSPIRE
JW6  C           BANONY    OREQ 2030                       HONDA LISTOWEL
JW6  C           BANONY    OREQ 2083                       HCM NISSIN PLANT2
JW6  C           BANONY    OREQ 0300                       HSP KIRCHHOFF, OH
JW6  C           BANONY    OREQ 1507                       HSP KIRCHHOFF, GA
     C                     ELSE
     C                     ITER
     C                     END
     C*
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    S@DCNT
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C           BASRYO    DIV  BASYOS    S@DCNT
     C                     ELSE
     C*                    Z-ADD*ZERO     S@DCNT
     C                     Z-ADD1         S@DCNT
     C                     END
     C                     END
     C*
     C                     Z-ADD*ZERO     W@SCNT  50
     C                     EXSR #SCNT
     C           W@SCNT    IFLT S@DCNT
     C           S@DCNT    SUB  W@SCNT    S2NCNT
     C                     ELSE
     C                     Z-ADD*ZERO     S2NCNT
     C                     END
     C*
     C                     MOVE BANONY    S@DELV
     C           BANONY    CHAINGADPL13              93
     C  N93                MOVELB5KMEI    S@DLNM
     C   93                MOVEL*BLANK    S@DLNM
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     ENDDO
      *
     C           RRN2      IFGT *ZERO
     C                     Z-ADD1         W@REC2  40
     C                     EXSR #SCRN3
     C                     END
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN3    BEGSR
      *
     C                     MOVE CMX,4     D@CMD
     C                     WRITEDSP99
     C                     Z-ADDW@REC2    #RCNO2
     C                     EXFMTCTL02
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #PRINT    BEGSR
      *
     C                     EXCPT@HED
      *
     C                     MOVE *BLANKS   P#LOC1  1
     C                     MOVE *BLANKS   P#LOC2  2
     C                     MOVE *BLANKS   P#LOC3  2
     C                     MOVE *BLANKS   P#LOC4  1
     C                     Z-ADD0         P#TBOX  70
     C                     MOVE *BLANKS   P#MHN1  5
     C                     MOVE *BLANKS   P#MHN2  5
     C                     MOVE *BLANKS   P#MHN3  5
     C                     MOVE *BLANKS   P#MHN4  5
     C                     MOVE *BLANKS   P#SHN1  5
     C                     MOVE *BLANKS   P#SHN2  5
     C                     MOVE *BLANKS   P#SHN3  2
      *
     C           *LOVAL    SETLLABP9H1
     C           *IN90     DOUEQ*ON
     C           *INOF     IFEQ *ON
     C                     EXCPT@HED
     C                     ENDIF
     C                     READ ABP9H1                   90
     C           *IN90     IFEQ *OFF
     C                     MOVE S@LOC1    P#LOC1
     C                     MOVE S@LOC2    P#LOC2
     C                     MOVE S@LOC3    P#LOC3
     C                     MOVE S@LOC4    P#LOC4
     C                     Z-ADDS@TCNT    P#TBOX
     C                     MOVE S@PAR1    P#MHN1
     C                     MOVE S@PAR2    P#MHN2
     C                     MOVE S@PAR3    P#MHN3
     C                     MOVE S@PAR4    P#MHN4
     C                     MOVE S@IPT1    P#SHN1
     C                     MOVE S@IPT2    P#SHN2
     C                     MOVE S@IPT3    P#SHN3
      *
     C                     EXCPT@DTL
     C                     ENDIF
     C                     ENDDO
     C                     ENDSR
      *---------------------------------------------------
     C           #SCNT     BEGSR
     C*
     C           K#PL70    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           K@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C**                   KFLD           BAODRN
JW7  C                     KFLD           XXODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C                     MOVELBANONY    K@NONY
     C                     MOVELBANOBN    K@NOBN
JW7  C                     MOVELBAODRN    XXODRN
     C           K#PL70    SETLLAB#PL70
     C*
     C                     DO   *HIVAL
     C           K#PL70    READEAB#PL70                  96
     C   96                LEAVE
     C           EKSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           EKSRYO    IFNE *ZERO
     C                     ADD  1         W@SCNT
     C                     END
     C                     ENDDO
     C*
JW7  C           W@SCNT    IFEQ 0
 .   C                     MOVELBAINVN    XXODRN
 .   C           K#PL70    SETLLAB#PL70
 .   C*
 .   C                     DO   *HIVAL
 .   C           K#PL70    READEAB#PL70                  96
 .   C   96                LEAVE
     C           EKSKJY    IFNE *BLANK
 .   C                     ITER
 .   C                     END
 .   C           EKSRYO    IFNE *ZERO
 .   C                     ADD  1         W@SCNT
 .   C                     END
 .   C                     ENDDO
JW7  C                     ENDIF
     C*
     C                     ENDSR
      *---------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM      10
     O                                   31 'HONDA'
     O                                   50 'CONTAINER SHIPMENT'
     O                         UDATE Y   70
     O                                   80 'PAGE'
     O                         PAGE  Z   85
     O        E   03           @HED
     O                                   12 'SHIP DATE:'
     O                         D@MM      14
     O                                   15 '/'
     O                         D@DD      17
     O                                   18 '/'
     O                         D@YYYY    22
     O        E   05           @HED
     O                                   11 'LOCATION'
     O                                   23 '# OF BOXES'
     O                                   36 'USER PART#'
     O                                   61 'INTR PART#'
     O        E 11             @DTL
     O                         P#LOC1     4
     O                         P#LOC2     7
     O                         P#LOC3    10
     O                         P#LOC4    12
     O                         P#TBOXZ   23
     O                         P#MHN1    31
     O                         P#MHN2    37
     O                         P#MHN3    43
     O                         P#MHN4    49
     O                         P#SHN1    56
     O                         P#SHN2    62
     O                         P#SHN3    65
** CMX
   F1:END
   F1:END     F12:GO BACK   F5:PRINT
   F1:END     F12:GO BACK   ENTER:NEXT PRCESS   NEXT/PREV PAGE:PAGE UP/DOWN
   ENTER:RETURN PREVIOUS SCREEN
**
OVRPRTF FILE(QPRINT) OUTQ(LANPRT03)
