     H            Y.
     F** AB#RSN *************************************************************
     F*  SERVICE PARTS LABEL PRINT                                          *
     F*       TCH OCT/10/01                                                 *
     F*                                                                     *
     F*  TCH NOV/21/01     ADD SERIAL NUMBER                                *
     F*  TCH APR/22/02     ADD BARCODE SCAN                                 *
     F*  TCH JAN/30/03     ADD 0323 OPTION                                  *
     F*  TCH(H.AMANO) 2003.07.15 ADD SBAN = 10                              *
     F*  TCH(H.AMANO) 2004.02.05 ADD GM 2D                                  *
     F*  TCH(H.AMANO) 2004.04.01 ADD FORD VANBORN                           *
     F*                                                                     *
     F* TCHK1 12/21/06 ADD AB#PL79                                          *
     F* TCHK2 02.09.07 RMV AB#PL79 & ADD UPDATE AB#PL75,AB#PL78             *
     F* TCHK3 05.24.07 BUG FIX                                              *
     F* TCHK4 09.14.07 ADD GM-SPO NEW PLANT                                 *
     F* TCHK5 01.31.08 ADD TTC(ELK GROVE)                                   *
     F* TCHK6 05.20.08 ADD TTC(3554) KANBAN# PRINT                          *
     F* TCHK4 05.22.08 ADD GM-SPO NEW PLANT                                 *
     F* TCHK4 05.29.08 ADD GM-SPO NEW PLANT                                 *
     F* TCHK4 07.22.08 ADD GM-SPO NEW PLANT                                 *
     F* TCHK4 11.04.08 ADD GM-SPO NEW PLANT                                 *
     F* TCHK4 11.12.08 ADD GM-SPO NEW PLANT                                 *
     F* TCHK4 04.01.09 ADD GM-SPO NEW PLANT(2399)                           *
     F* TCHK7 10.19.10 BUG FIX FOR TMS DATE CODE                            *
     F* TCHK8 10.11.12 CHG Q LENGTH                                         *
JW1  F* JW    01.26.17 ADD FORD 5288                                        *
JW2  F* JW    04.25.17 ADD FORD 5211 HOLLINGSWORTH                          *
JW3  F* JW    09.29.17 ADD 5532 (GENERAL FASTNERS)                          *
JW4  F* JW    02.20.19 ADD 0878 (ARVIN SANGO CANADA)                        *
     F* LEC   06.02.20 CHECK PART#, SET LARGE BAG FLAG FOR WORKFILE         *
JW5  F* JW  2023.06.05 CHECK HONDA PART                                     *
JW5  F*                ADD AB#XP01 (LOG)  AB#XP01A(V.2)                     *
     F*  JW  2023/09/05 ADD AB#PP78L (LOG FILE)
     F*---------------------------------------------------------------------*
     F*  *IN87=1(COMPLETE CREATE DATA)                                      *
     F*  *IN88=1(MARKED OPTION FOR WRITE)                                   *
     F*  *IN89=0(NO MARKED OPTION FOR CHECK)                                *
     F*  *IN90=1(NOT READ AB#PL2C)                                          *
     F*  *IN91=1(NOT READ FCEPL01)                                          *
     F*  *IN92=1(NOT READ ALAPL01)                                          *
     F*  *IN93=1(NOT READ AB#PL13)                                          *
     F*  *IN94=1(NOT READ SUB FILE)                                         *
     F*  *IN95=1(NOT READ FCCTL12)                                          *
     F*  *IN96=1(NOT READ AB#PL90)                                          *
     F*  *IN97=1(NOT READ AB#PP40)                                          *
     F*  *IN98=1(NOT READ AB#PP41)                                          *
     F*  *IN99=0(FIRST READ FOR 0291)                                       *
     F****************************************** AB#R2C *********************
     FAB#PWSN CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FAB#PL2C IF  E           K        DISK
     FALAPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL30 IF  E           K        DISK
     FFCCTL12 IF  E           K        DISK
     FAB#PP40 IF  E           K        DISK
     FAB#PP41 IF  E           K        DISK
     FAB#PP85 IF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
     FAB#PL13 IF  E           K        DISK
     F                                              KINFDS @INFDA
     FAB#PL2E IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     F* ISUZU ,SIA
     FAB#WP2L O   E           K        DISK
     A*
     F* TRW-KOYO
     FAB#WP2H O   E           K        DISK
     FAB#WP2K O   E           K        DISK
     A*
     F* NIFAST
     FAB#WP2M O   E           K        DISK
     A*
     F* COMMON
     FAB#WP2I O   E           K        DISK
     A*
     F* E-KANBAN
     FAB#WP2N O   E           K        DISK
     A*
     F* ARVIN SANGO
     FAB#WP2P O   E           K        DISK
     A*
     FAB#WP2Q O   E           K        DISK                           UC
     F* GENERAL FASTERNERS,HOLLINGSWORTH
     FAB#WP2T O   E           K        DISK
      * SERIAL NUMBER FILE
     FAB#PP70 O   E                    DISK                      A
     FAB#NP30 UF  E           K        DISK                      A
TCHK2F*AB#PL76 UF  E           K        DISK
TCHK2FAB#PL76 IF  E           K        DISK
TCHK2FAB#PL75 UF  E           K        DISK
TCHK2F            AB#PP751                          KRENAMEAB#PL75R
TCHK2FAB#PL78 UF  E           K        DISK
TCHK2F*TCHK1 AB#PL79 UF  E           K        DISK
      * MASTER FILE
     FAB#WP2O O   E           K        DISK
     FAB#WP2E O   E                    DISK
     FAB#WP2F O   E                    DISK
      *
JW5  FAB#PL2A6IF  E           K        DISK
JW5  FAB#XP01AO   E                    DISK
JW   FAB#PP78LO   E                    DISK
     E*****************************************************************
     E**                  ER      1  15 60
JW5  E                    ER      1  20 60
     E                    NAM     1   1 20
     E                    CMD     1   1 30
     E                    MST     1   1 20
     E                    DC     12  12  1
     E                    MON     1  12  3
     E                    MHN         8 20
     E                    TQY         8  7
     E                    PAC         8  3
     E                    PQY         8  5
     E                    MH@        16 20
     E                    TQ@        16  7
     E                    PA@        16  3
     E                    PQ@        16  5
     I*****************************************************************
     I@INFDA      DS
     I                                    B 397 4000@@RCD
     I            DS
     I                                        1   60@@TIM
     I                                        1   20@@HH
     I                                        3   40@@MM
JW5  I            DS
 .   I                                        1  140SDATE
 .   I                                        1   60NOW
 .   I                                        7  140TODAY
     I* SERIAL NUMBER(OTHERS)
     I            DS
     I                                        1   6 I2SEQ#
     I                                        1   40WSEQ##
     I* SERIAL NUMBER(TRW-KOYO)
     I            DS
     I                                        1   9 WSEQ
     I                                        1   7 H2RAN#
     I                                        8   90WKSEQ#
     I                                        8   9 WSEQ#
     I* SERIAL NUMBER(SIA,DMAX W/F)
     I            DS
     I                                        1  10 L2SERI
     I                                        1  100W2SERI
     I* INTERNAL PART NUMBER
     I            DS
     I                                        1  12 WIPAR
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I* USER PART(AB#PP10)
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I                                        1   7 WPA1
     I                                        8  20 WPA2
     I* GENERAL FASTNERS, HOLLINGSWORTH PART
     I            DS
     I                                        1  13 W#PA1
     I                                        2   8 WKPA1
     I* USER PART(AB#PP10) EDITED FOR DISPLAY
     I            DS
     I                                        1  23 @PART
     I                                        1   5 WAMHN1
     I                                        6   6 @P1
     I                                        7  11 WAMHN2
     I                                       12  12 @P2
     I                                       13  17 WAMHN3
     I                                       18  18 @P3
     I                                       19  23 WAMHN4
     I* SHIPPING DATE(DISPLAY)
     I            DS
     I                                        1   80PNOHZ
     I                                        1   40PNOYY
     I                                        3   40PNOY
     I                                        4   40PY
     I                                        5   60PNOMM
     I                                        7   80PNODD
     I            DS
     I                                        1   9 DMDAT
     I                                        1   2 DMXD
     I                                        3   5 DMXM
     I                                        6   9 DMXY
     I* SHIPPING DATE(AB#WP2N MMDDYY)
     I            DS
     I                                        1   6 WKMDY
     I                                        1   20WKMDYM
     I                                        3   40WKMDYD
     I                                        5   60WKMDYY
      *
     I* DUE DATE(AB#WP2P)
     I            DS
     I                                        1   80AVRVDT
     I                                        3   8 WKRVDT
      *
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 @SHN1
     I                                        6  10 @SHN2
     I                                       11  12 @SHN3
     I* CHANGE DATE(FCEPL01)
     I            DS
     I                                        1   80A2DATE
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2SSHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I* LOCATION(FCEPL01)
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I* LOCATION(FCEPL01)
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I* LOCATION(FCEPL30)
     I            DS
     I                                        1   6 F3STKR
     I                                        1   1 F3STRK
     I                                        2   3 F3STRT
     I                                        4   5 F3STRR
     I                                        6   6 F3STRD
     I* LOCATION(FCEPL30)
     I            DS
     I                                        1   6 F3KTKR
     I                                        1   1 F3KTRK
     I                                        2   3 F3KTRT
     I                                        4   5 F3KTRR
     I                                        6   6 F3KTRD
     I* LCYCLE(AB#PP41)
     I            DS
     I                                        1   8 AVCYC
     I                                        1   20AVCYC1
     I                                        3   3 W1
     I                                        4   50AVCYC2
     I                                        6   6 W2
     I                                        7   80AVCYC3
     I            DS
     I                                        1   80PUDAT
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1  22 @DUN
     I                                        1   2 @DUN1
     I I            'UN946955648D'            3  14 @DUN2
     I                                       15  22 @DUN3
     I            DS
     I                                        1 256 @DX
     I                                        1   1 @DX1
     I                                        2   2 @DX2
     I                                        3   3 @DX3
     I                                        4   4 @DX4
     I I            '06'                      5   6 @DX5
     I                                        7   7 @DX6
     I                                        8 256 @DX7
     I            DS
     I                                        1 160 MHN
     I                                        1  20 E2MHN1
     I                                       21  40 E2MHN2
     I                                       41  60 E2MHN3
     I                                       61  80 E2MHN4
     I                                       81 100 E2MHN5
     I                                      101 120 E2MHN6
     I                                      121 140 E2MHN7
     I                                      141 160 E2MHN8
     I            DS
     I                                        1  56 TQY
     I                                        1   7 E2TQY1
     I                                        8  14 E2TQY2
     I                                       15  21 E2TQY3
     I                                       22  28 E2TQY4
     I                                       29  35 E2TQY5
     I                                       36  42 E2TQY6
     I                                       43  49 E2TQY7
     I                                       50  56 E2TQY8
     I            DS
     I                                        1  24 PAC
     I                                        1   3 E2PAC1
     I                                        4   6 E2PAC2
     I                                        7   9 E2PAC3
     I                                       10  12 E2PAC4
     I                                       13  15 E2PAC5
     I                                       16  18 E2PAC6
     I                                       19  21 E2PAC7
     I                                       22  24 E2PAC8
     I            DS
     I                                        1  40 PQY
     I                                        1   5 E2PQY1
     I                                        6  10 E2PQY2
     I                                       11  15 E2PQY3
     I                                       16  20 E2PQY4
     I                                       21  25 E2PQY5
     I                                       26  30 E2PQY6
     I                                       31  35 E2PQY7
     I                                       36  40 E2PQY8
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C***********************************************************************
     C* PARM                                                                *
     C***********************************************************************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           SRVF    1
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C* AB#R2K
     C           P2        PLIST
     C                     PARM           PIQTY  300       NUMERIC QTY
     C                     PARM           POQTY  30        CHAR    QTY
     C***********************************************************************
     C* KEY1                                                                *
     C***********************************************************************
     C* FIXED ORDER FILE(AB#PL13)
     C           KEY1      KLIST
     C                     KFLD           WNONY
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C                     KFLD           PNUKE
     C* FIXED ORDER FILE(AB#PL13)
     C           KEY6      KLIST
     C                     KFLD           WNONY
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C                     KFLD           PNUKE
     C                     KFLD           WAMHN1
     C                     KFLD           WAMHN2
     C                     KFLD           WAMHN3
     C                     KFLD           WAMHN4
     C                     KFLD           WORDN
     C* PART MASTER(FCEPL01)
     C           KEY2      KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C* TOPICS CUSTOMER MASTER(ALAPL01)
     C           KEY3      KLIST
     C                     KFLD           K31     40
     C                     KFLD           K32     40
     C* KANBAN MASTER
     C           KEY4      KLIST
     C                     KFLD           KEY12   20       MONTH
     C                     KFLD           BASHN1           PART 1
     C                     KFLD           BASHN2                2
     C                     KFLD           BASHN3                3
     C                     KFLD           BATOKU           CUSTOMER
     C                     KFLD           BANONY           DELIVERY
     C                     KFLD           PNKOJ            FACTORY
     C                     KFLD           PNUKE            DOCK
     C*
     C           KEY5      KLIST
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C                     KFLD           BIN
     C                     KFLD           BATOKU
     C                     KFLD           WNONY
     C                     KFLD           PNKOJ
     C                     KFLD           PNUKE
     C                     KFLD           L2SIRE
     C                     KFLD           L2SIRK
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           K5ODRN 10
     C*
     C* EDI DATA FILE(AB#PP40)TMMK
     C           KEY7      KLIST
     C                     KFLD           WNONY
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C                     KFLD           PNUKE
     C                     KFLD           WAMHN1
     C                     KFLD           WAMHN2
     C                     KFLD           WAMHN3
     C                     KFLD           WAMHN4
     C*
     C* EDI DATA FILE(AB#PP41)ARVIN SANGO(IN)
     C           KEY8      KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C                     KFLD           BANONY
     C                     KFLD           PNOHZ
      *
     C           K#85      KLIST
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           PNOHZ
      *
     C           K#85X     KLIST
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
      *
     C           K#2E      KLIST
     C                     KFLD           @TOKU   4
     C                     KFLD           @NONY   4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           PNOHZ
      *
     C***********************************************************
     C*
     C                     EXSR @INZ
B01  C           WKDSP     DOWNE'9'
     C           WKDSP     CASEQ'0'       @STRT
     C           WKDSP     CASEQ'1'       @MAIN
     C           WKDSP     CASEQ'2'       @DETL
     C                     ENDCS
     C                     ENDDO
      *
     C                     EXSR @END
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
JW5  C                     TIME           SDATE
     C                     MOVE '0'       WKDSP   1
     C                     MOVE *BLANK    XMSG
     C                     MOVE *ALL'0'   WKBLAK 10
     C                     Z-ADD1         BIN
     C                     MOVEL'0000'    I2SEQ#
     C                     MOVE '-'       W1
     C                     MOVE '-'       W2
     C                     Z-ADD*ZERO     W1RRN   40
     C                     Z-ADD*ZERO     G       40
TCHK8C*                    Z-ADD*ZERO     Q       40
TCHK8C                     Z-ADD*ZERO     Q       50
     C                     Z-ADD*ZERO     W#LAB   40
     C                     MOVE *BLANK    W#PA1
     C*
     C                     MOVE *BLANK    PNONY
     C                     MOVE *BLANK    PNKOJ
     C                     MOVE *BLANK    PNUKE
     C                     Z-ADD*ZERO     PNOHZ
     C                     MOVE *BLANK    PORD#
     C*                    MOVE *BLANK    SER1F
     C*                    MOVE *BLANK    SER1T
     C*                    MOVE *BLANK    SER2F
     C*                    MOVE *BLANK    SER2T
     C*                    Z-ADD*ZERO     SER3F
     C*                    Z-ADD*ZERO     SER3T
JW   C                     Z-ADD0         SVKODT  80
 .   C                     Z-ADD0         SVKOTM  60
     C*
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     MOVE *OFF      *IN22
     C*
     C                     ENDSR
     C***********************************************************
     C* BARCODE ENTRY
     C***********************************************************
     C           @STRT     BEGSR
      *
     C                     EXFMTAB#PWSN0
      *
     C                     SELEC
      * F1: BACK
     C           *INKI     WHEQ *ON
     C                     MOVE '1'       WKDSP
      * F3: END
     C           *INKC     WHEQ *ON
     C                     MOVE '9'       WKDSP
      * ENTR KEY
     C                     OTHER
     C                     EXSR @CHK0
     C* CHECK OK?
     C           *IN30     IFEQ '0'
     C           *INKE     ANDEQ*ON
     C                     EXSR @ITEM
     C                     EXSR @WRT1
TCHK2C*TCHK1               EXSR @UPD0
     C                     MOVE *ON       *IN87
     C                     MOVE *BLANK    D@BAR
     C                     ENDIF
JW5  C* F5
 .   C           *IN30     IFEQ '0'
 .   C           *INKE     ANDEQ*OFF
 .   C                     MOVELER,17     XMSG
JW5  C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
     C***********************************************************
     C* BARCODE ENTRY
     C***********************************************************
     C           @CHK0     BEGSR
      *
JW5  C           D@BAR     IFEQ *BLANK
 .   C                     SETON                     3031
 .   C                     MOVELER,18     XMSG
 .   C                     GOTO #CHK0
JW5  C                     ENDIF
      *
     C                     MOVEAWKBLAK    *IN,30
     C                     SETOF                     87
     C           D@BAR     CHAINAB#PL76              90
      *
     C           *IN90     IFEQ *ON
     C                     SETON                     3031
JW5  C                     MOVELER,16     XMSG
     C                     GOTO #CHK0
     C                     ENDIF
JW5   * CHECK HONDA
 .   C           PUNONY    CHAINAB#PL2A6             86
 .   C           *IN86     IFEQ *OFF
     C                     SETON                     3031
 .   C                     MOVELER,15     XMSG
 .   C                     GOTO #CHK0
JW5  C                     ENDIF
      * IF NO ERROR ...
     C                     MOVELPUNONY    PNONY
     C                     MOVELPUNKOJ    PNKOJ
     C                     MOVELPUNUKE    PNUKE
     C                     Z-ADDPUBINN    BIN
     C                     Z-ADDPUDAT     PNOHZ
     C                     MOVELPUODRN    PORD#
      *
TCHK2C*                    Z-ADD*DATE     PULPDT
TCHK2C*                    Z-ADD*DATE     PUKODT
TCHK2C*                    TIME           PUKOTN
TCHK2C*                    MOVEL#USER     PUKOME
TCHK2C*                    UPDATAB#PP751
     C**                   ENDIF
     C*
     C           #CHK0     ENDSR
TCHK1C***********************************************************
TCHK1C* CHECK SHEET UPDATE
TCHK1C***********************************************************
TCHK2C*TCHK1     @UPD0     BEGSR
TCHK2C*TCHK1
TCHK2C*TCHK1     D@BAR     CHAINAB#PL79              90
TCHK2C*TCHK1     *IN90     IFEQ *OFF
TCHK2C*TCHK1     P8SKJY    ANDEQ*BLANK
TCHK2C*TCHK1               Z-ADD*DATE     P8KODT
TCHK2C*TCHK1               TIME           P8KOTM
TCHK2C*TCHK1               MOVEL#USER     P8KONM
TCHK2C*TCHK1     P8LPDT    IFEQ *ZERO
TCHK2C*TCHK1               Z-ADD*DATE     P8LPDT
TCHK2C*TCHK1               TIME           P8LPTM
TCHK2C*TCHK1               MOVEL#USER     P8LPNM
TCHK2C*TCHK1               END
TCHK2C*TCHK1               UPDATAB#PP781
TCHK2C*TCHK1               END
TCHK2C*TCHK1
TCHK2C*TCHK1               ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C                     EXFMTAB#PWSN2
     C* CLEAR MSG
     C                     MOVEAWKBLAK    *IN,30
     C                     SETOF                     87
     C*
     C                     SELEC
     C* F3: END
B02  C           *INKC     WHEQ '1'
     C                     MOVE '9'       WKDSP
     C* F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '0'       WKDSP
     C                     MOVE *BLANK    XMSG
      * F7:
B04  C           *INKG     WHEQ '1'
     C                     EXSR @CHK1
     C           *IN30     IFEQ '0'
     C                     EXSR @SFL
     C                     END
      * ENTR KEY
     C                     OTHER
     C                     EXSR @CHK1
      * F5: PROCESS
B03  C           *INKE     IFEQ '1'
     C* CHECK OK?
     C           *IN30     ANDEQ'0'
     C**JW5                EXSR @ITEM
     C                     EXSR @WRT1
     C                     END
      *
     C                     ENDSL
     C*
     C                     ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @DETL     BEGSR
     C*
     C                     WRITEAB#PWSN1
     C                     SETON                     70
     C                     EXFMTCTL01
     C                     SETOF                     70
     C* CLEAR MSG
     C                     MOVEAWKBLAK    *IN,30
     C                     SETOF                     87
     C*
     C                     SELEC
B02  C           *INKC     WHEQ '1'
     C                     MOVE '9'       WKDSP
     C* F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '1'       WKDSP
      * ENTR KEY
     C                     OTHER
     C                     EXSR @CHK2
     C* F5: PROCESS
B03  C           *INKE     IFEQ '1'
     C*
     C* CHECK OK?
     C           *IN30     ANDEQ'0'
     C                     EXSR @WRT2
     C                     EXSR @CLRS
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C***********************************************************
     C* # OF PARTS
     C***********************************************************
     C           @ITEM     BEGSR
      *
     C                     Z-ADD*ZERO     @ITM    30
     C                     MOVE PNONY     WNONY   40
      *
     C           KEY1      SETLLAB#PL13
     C           *IN93     DOUEQ*ON
     C           KEY1      READEAB#PL131                 93
     C           *IN93     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           PORD#     IFNE *BLANK
     C           PORD#     ANDNEBAODRN
     C                     ITER
     C                     ENDIF
     C           BIN       IFNE *ZERO
     C           BANOBN    ANDNEBIN
     C                     ITER
     C                     ENDIF
     C           PNUKE     IFNE *BLANK
     C           BANUKE    ANDNEPNUKE
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         @ITM
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* @CHK1:CHECK ITEMS ON 1ST. SCREEN
     C***********************************************************
     C           @CHK1     BEGSR
     C*
     C* DELIVERY CODE BLANK ?
     C           PNONY     IFEQ *BLANK
     C                     SETON                     3031
     C                     MOVELER,1      MSG
     C                     GOTO #CHK1
     C                     END
JW5   * CHECK HONDA
 .   C                     MOVELPNONY     NUM4    40
 .   C           NUM4      CHAINAB#PL2A6             86
 .   C           *IN86     IFEQ *OFF
     C                     SETON                     3031
 .   C                     MOVELER,15     MSG
 .   C                     GOTO #CHK1
JW5  C                     ENDIF
     C*
     C* FACTORY CODE BLANK ?
     C           PNKOJ     IFEQ *BLANK
     C                     SETON                     3032
     C                     MOVELER,2      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* DOCK CODE BLANK ?
     C           PNUKE     IFEQ *BLANK
     C                     SETON                     3033
     C                     MOVELER,3      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* SHIPPING DATE
     C           PNOHZ     IFEQ 0
     C                     SETON                     3034
     C                     MOVELER,4      MSG
     C                     GOTO #CHK1
     C                     END
      *
     C           PNOMM     IFLT 1
     C           PNOMM     ORGT 12
     C                     SETON                     3034
     C                     MOVELER,5      MSG
     C                     GOTO #CHK1
     C                     END
      *
     C           PNODD     IFLT 1
     C           PNODD     ORGT 31
     C                     SETON                     3034
     C                     MOVELER,5      MSG
     C                     GOTO #CHK1
     C                     END
     C* BIN
     C           BIN       IFEQ 0
     C                     SETON                     3035
     C                     MOVELER,6      MSG
     C                     GOTO #CHK1
     C                     END
JW5   * CHECK ORDER
 .   C                     EXSR @ITEM
 .   C           @ITM      IFEQ 0
 .   C                     SETON                     3031
 .   C                     MOVELER,16     MSG
 .   C                     GOTO #CHK1
JW5  C                     ENDIF
     C*
     C           #CHK1     ENDSR
     C***********************************************************
     C* @CHK2:CHECK SFL
     C***********************************************************
     C           @CHK2     BEGSR
     C*
     C                     SETOF                     89
     C                     Z-ADD1         RRN
     C                     DO   W1RRN
     C           RRN       CHAINSFL01                94
     C*
     C           *IN94     IFEQ '0'
     C           @FLAG     IFNE *BLANK
     C           @#LAB     ORNE *ZERO
     C                     SETON                     89
     C                     END
     C                     END
     C*
     C* NOT USE # OF LABELS FOR ASI
     C           PNONY     IFEQ '0871'
JW4  C           PNONY     OREQ '0873'
"    C           PNONY     OREQ '0876'
"    C           PNONY     OREQ '0878'
"    C           PNONY     OREQ '0879'
"    C           PNONY     OREQ '0880'
"    C           PNONY     OREQ '0881'
     C           @#LAB     ANDNE*ZERO
     C                     SETON                     30
     C                     MOVELER,14     MSG
     C                     END
     C*
     C                     ADD  1         RRN
     C                     END
     C*
     C           *IN89     IFEQ '0'
     C                     SETON                     30
     C                     MOVELER,8      MSG
     C                     END
     C*
     C                     Z-ADD1         RRN
     C*
     C                     ENDSR
     C***********************************************************
     C* @WRT1:WRITE LABEL DATA
     C***********************************************************
     C           @WRT1     BEGSR
     C*
     C                     Z-ADD*ZERO     @@CNT   50
     C                     MOVE PNONY     WNONY   40
     C                     SETON                     87
     C* GET THE NUMBER OF LABEL
     C           PNONY     CHAINAB#PL90              96
     C           *IN96     IFEQ '0'
     C                     Z-ADDYA#LAB    W#LAB
     C                     ELSE
     C                     Z-ADD1         W#LAB
     C                     END
     C*
     C* SIA,D-MAX
     C           PNONY     IFEQ '0437'
     C           PNONY     OREQ '0590'
     C           PNONY     OREQ '0521'
     C           PNONY     OREQ '2389'
TCHK4C           PNONY     OREQ '2390'
TCHK4C           PNONY     OREQ '2391'
TCHK4C           PNONY     OREQ '2392'
TCHK4C           PNONY     OREQ '2394'
TCHK4C           PNONY     OREQ '2395'
TCHK4C           PNONY     OREQ '2396'
TCHK4C           PNONY     OREQ '2397'
TCHK4C           PNONY     OREQ '2398'
TCHK4C           PNONY     OREQ '2399'
     C                     EXSR @0590
     C                     GOTO #WRT1
     C                     END
     C*
     C* TRW-KOYO
     C           PNONY     IFEQ '3892'
     C                     EXSR @3892
     C                     GOTO #WRT1
     C                     END
     C*
     C* NIFAST CANADA
     C           PNONY     IFEQ '1431'
     C                     EXSR @1431
     C                     GOTO #WRT1
     C                     END
     C*
     C* TMMK
     C           PNONY     IFEQ '3347'
     C                     EXSR @3347
     C                     GOTO #WRT1
     C                     END
     C*
     C* ARVIN SANGO(IN)
     C           PNONY     IFEQ '0871'
JW4  C           PNONY     OREQ '0873'
"    C           PNONY     OREQ '0876'
"    C           PNONY     OREQ '0878'
"    C           PNONY     OREQ '0879'
"    C           PNONY     OREQ '0880'
"    C           PNONY     OREQ '0881'
     C                     EXSR @0873
     C                     EXSR @OTHER
     C                     GOTO #WRT1
     C                     END
     C*
     C* GENERAL FASTNERS, HOLLINGSWORTH
     C           PNONY     IFEQ '5530'
     C           PNONY     OREQ '5211'
JW3  C           PNONY     OREQ '5531'
JW3  C           PNONY     OREQ '5532'
JW3  C           PNONY     OREQ '5533'
     C                     EXSR @5530
     C                     GOTO #WRT1
     C                     END
     C*
     C* AMBRAKE
     C           PNONY     IFEQ '0291'
     C                     EXSR @0291
     C                     GOTO #WRT1
     C                     END
     C* OTHERS
     C                     EXSR @OTHER
     C*
     C           #WRT1     ENDSR
     C***********************************************************
     C* @0503:SIA,D-MAX LABEL
     C***********************************************************
     C           @0503     BEGSR                           NOT USE?
     C*
     C                     SETOF                     93
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C*
B01  C           *IN93     DOWEQ'0'
     C*
     C           BASKJY    IFNE ' '
     C                     GOTO #READ0
     C                     END
     C*
     C* ORDER NUMBER SELECTED ?
B02  C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ0
     C                     END
E02  C                     END
     C*
     C* BIN SELECTED ?
     C           BIN       IFNE BANOBN
     C                     GOTO #READ0
     C                     END
      *
     C                     CLEARAB#WP2L1
B02  C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVE *BLANK    L2TYPE           LABEL TYPE
B03  C           PNONY     IFEQ '0437'
     C                     MOVEL'C742'    L2SIRE           SUPPLIER
     C                     MOVEL'SIA'     H2CNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVEL'D742'    L2SIRE
     C                     MOVEL'DMAX'    H2CNAM           CUSTOMER NAME
E03  C                     END
     C*
     C                     MOVE '01'      L2SIRK           FACTORY
     C                     MOVE BATOKU    L2SIRD           CUSTOMER
     C                     MOVE PNOHZ     L2NYMD           SHIP DATE
     C                     MOVELWMHIN     L2MHIN           PART
     C                     MOVE *ALL'*'   L2ODRN
     C                     MOVE *ALL'*'   L2SERI
     C                     MOVE *ALL'*'   L2SBAN
     C                     MOVE *ALL'*'   L2MNAM
     C                     MOVE *ALL'*'   L2WHLC
     C                     MOVE *ALL'*'   L2FTLC
     C                     MOVE *ALL'*'   L2TOKU
     C                     MOVE *ALL'*'   H2NONY
     C                     MOVE *ALL'*'   H2NKOJ
     C                     MOVE *ALL'*'   H2NUKE
     C                     MOVE *ALL'*'   H2ZETI
     C                     MOVE *ALL'*'   H2LOC1
     C                     MOVE *ALL'*'   H2LOC2
     C                     MOVE *ALL'*'   H2LOC3
     C                     MOVE *ALL'*'   H2LOC4
     C                     MOVE *ALL'*'   H2SYOS
     C                     WRITEAB#WP2L1
      *
JW5  C                     MOVEL'AB#WP2L 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ0
E02  C                     END
      *
     C                     CLEARAB#PP701
     C*
     C                     MOVE 'M'       H2FLAG           LABEL FLAG
     C           PNONY     IFEQ '0437'
     C                     MOVEL'C742'    L2SIRE           SUPPLIER
     C                     MOVEL'SIA'     H2CNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVEL'D742'    L2SIRE
     C                     MOVEL'DMAX'    H2CNAM           CUSTOMER NAME
     C                     END
     C*
     C                     MOVE '01'      L2SIRK           FACTORY
     C                     MOVE BATOKU    L2SIRD           CUSTOMER
     C                     MOVE PNOHZ     L2NYMD           SHIP DATE
     C                     MOVELWMHIN     L2MHIN           PART
     C                     MOVELBAODRN    L2ODRN           ORDER NUMBER
     C*
     C                     MOVELBAODRN    K5ODRN
     C           KEY5      CHAINAB#PL2C1             90
     C  N90                MOVELBBSERI    L2SERI           SERIAL #
     C  N90                MOVELBBNAME    L2MNAM           PART NAME
     C  N90                MOVELBBWHLC    L2WHLC           WH LOCATION
     C  N90                MOVELBBFTLC    L2FTLC           FT LOCATION
     C                     MOVE BATOKU    L2TOKU           CUSTOMER COD
     C                     MOVE WNONY     H2NONY           DELIVERY
     C                     MOVE PNKOJ     H2NKOJ           FACTORY
     C                     MOVE PNUKE     H2NUKE           DOCK
     C*
     C* GET ABSOLUTE NUMBER
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C*
     C                     MOVE F3ZETI    H2ZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    H2LOC1           NEW
     C                     MOVE F3STRT    H2LOC2
     C                     MOVE F3STRR    H2LOC3
     C                     MOVE F3STRD    H2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    H2LOC1           OLD
     C                     MOVE F3KTRT    H2LOC2
     C                     MOVE F3KTRR    H2LOC3
     C                     MOVE F3KTRD    H2LOC4
     C                     END
     C*
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    H2LOC1
     C                     MOVE *BLANK    H2LOC2
     C                     MOVE *BLANK    H2LOC3
     C                     MOVE *BLANK    H2LOC4
     C           KEY2      SETLLFCEPL011
     C           #PART1    TAG
     C           KEY2      READEFCEPL011                 91
B02  C           *IN91     IFEQ '0'
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART1
     C*                    END
     C*
     C                     MOVE A2ZETI    H2ZETI           ABSOLUTE #
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    H2LOC1           NEW
     C                     MOVE A2STRT    H2LOC2
     C                     MOVE A2STRR    H2LOC3
     C                     MOVE A2STRD    H2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    H2LOC1           OLD
     C                     MOVE A2KTRT    H2LOC2
     C                     MOVE A2KTRR    H2LOC3
     C                     MOVE A2KTRD    H2LOC4
     C                     END
     C*
B02  C                     END
      *
     C                     ENDIF
     C                     ENDIF
      *
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
      *
     C                     Z-ADDBASRYO    @@SRYO  90
     C                     MOVE H2LOC1    EKLOC1
     C                     MOVE H2LOC2    EKLOC2
     C                     MOVE H2LOC3    EKLOC3
     C                     MOVE H2LOC4    EKLOC4
     C*
B1   C           *IN88     IFEQ '1'
     C* USER SELECTED NUMBER OF LABEL
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C                     MOVE WSYS      H2SYOS           QTY
     C*
     C           1         DO   Q
     C           @@SRYO    IFGE WSYS
     C                     MOVE WSYS      H2SYOS
     C                     ELSE
     C                     MOVE @@SRYO    H2SYOS
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    H2SERL
     C                     MOVELPNONY     H2SERL
      *
     C                     EXSR #PP70
     C                     DO   W#LAB
     C                     WRITEAB#WP2L1
      *
JW5  C                     MOVEL'AB#WP2L 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     END
     C                     GOTO #READ0
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ0
     C                     END
     C*
E2   C                     END
E1   C                     END
     C*
     C* USER ONLY MARKED
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST    40
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C                     Z-ADDBASRYO    @@SRYO  90
     C*
     C           1         DO   Q
     C******               MOVE WSYS      H2SYOS           QTY
     C           @@SRYO    IFGE WSYS
     C                     MOVE WSYS      H2SYOS
     C                     ELSE
     C                     MOVE @@SRYO    H2SYOS
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    H2SERL
     C                     MOVELPNONY     H2SERL
     C                     EXSR #PP70
     C                     DO   W#LAB
     C                     WRITEAB#WP2L1
      *
JW5  C                     MOVEL'AB#WP2L 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     END
      *
     C           #READ0    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
E01  C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @3892:TRW KOYO LABEL
     C***********************************************************
     C           @3892     BEGSR
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
B01  C           *IN93     DOWEQ'0'
     C*
B02  C           BASKJY    IFNE ' '
     C                     GOTO #READ1
E02  C                     END
     C*
B02  C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ1
     C                     END
E02  C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ1
     C                     END
      *
     C                     CLEARAB#WP2H1
B02  C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVE 'M'       H2FLAG           LABEL FLAG
     C                     MOVELWMHIN     H2PART           PART
     C                     MOVE *ALL'*'   H2QTY
     C                     MOVE *ALL'*'   H2RAN#
     C                     MOVE *ALL'*'   H2SEQ#
     C                     MOVE *ALL'*'   H2PNAM
     C                     MOVE *ALL'*'   H2LOC1
     C                     MOVE *ALL'*'   H2LOC2
     C                     MOVE *ALL'*'   H2LOC3
     C                     MOVE *ALL'*'   H2LOC4
     C                     MOVE *ALL'*'   H2DELY
     C                     MOVE *ALL'*'   H2DOCK
     C                     MOVE *ALL'*'   H2ZETI
     C                     MOVE *ALL'*'   H2UNIT
     C                     WRITEAB#WP2H1
      *
JW5  C                     MOVEL'AB#WP2H 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ1
E02  C                     END
      *
     C                     CLEARAB#PP701
      *
     C                     Z-ADDBASRYO    @@SRYO  90
     C*
     C* CREATE MASTER LABEL
     C                     MOVE 'M'       H2FLAG           LABEL FLAG
     C                     MOVELWMHIN     H2PART           PART
     C*
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C*
     C                     MOVELPOQTY     H2QTY            QTY
     C                     MOVELBAODRN    H2RAN#           RAN #
     C                     Z-ADD*ZERO     WKSEQ#
     C                     MOVE WSEQ      H2SEQ#           SEQ #
     C*
     C* GET PART NAME
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C*
     C                     MOVELF3SMEI    H2PNAM           PART NAME
     C                     MOVE F3ZETI    H2ZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    H2LOC1           NEW
     C                     MOVE F3STRT    H2LOC2
     C                     MOVE F3STRR    H2LOC3
     C                     MOVE F3STRD    H2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    H2LOC1           OLD
     C                     MOVE F3KTRT    H2LOC2
     C                     MOVE F3KTRR    H2LOC3
     C                     MOVE F3KTRD    H2LOC4
     C                     END
     C*
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    H2LOC1
     C                     MOVE *BLANK    H2LOC2
     C                     MOVE *BLANK    H2LOC3
     C                     MOVE *BLANK    H2LOC4
     C           KEY2      SETLLFCEPL011
     C           #PART2    TAG
     C           KEY2      READEFCEPL011                 91
B02  C           *IN91     IFEQ '0'
     C                     MOVELA2SMEI    H2PNAM           PART NAME
     C                     MOVE A2ZETI    H2ZETI           ABSOLUTE #
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART2
     C*                    END
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    H2LOC1           NEW
     C                     MOVE A2STRT    H2LOC2
     C                     MOVE A2STRR    H2LOC3
     C                     MOVE A2STRD    H2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    H2LOC1           OLD
     C                     MOVE A2KTRT    H2LOC2
     C                     MOVE A2KTRR    H2LOC3
     C                     MOVE A2KTRD    H2LOC4
     C                     END
     C*
E02  C                     END
E02  C                     ENDIF
E02  C                     ENDIF
      *
     C                     MOVE PNONY     H2DELY           DELIVERY
     C                     MOVE PNKOJ     H2FACT           FACTORY
     C                     MOVE PNUKE     H2DOCK           DOCK
      *
     C*******              Z-ADDBASYOS    PIQTY
     C                     Z-ADDBAUSYS    PIQTY
     C           BAUSYS    IFEQ *ZERO
     C                     Z-ADDBASYOS    PIQTY
     C                     ENDIF
      *
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     H2UNIT           QTY/CONTAINER
     C                     WRITEAB#WP2K1
      *
JW5  C                     MOVEL'AB#WP2K 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C*
     C* CREATE BOX LABEL
     C                     MOVE H2LOC1    EKLOC1
     C                     MOVE H2LOC2    EKLOC2
     C                     MOVE H2LOC3    EKLOC3
     C                     MOVE H2LOC4    EKLOC4
     C*
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
B02  C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C                     Z-ADD*ZERO     G
     C*
B02  C           1         DO   Q         G
     C*
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
      *
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     H2UNIT           QTY/CONTAINER
      *
     C                     SUB  WSYS      @@SRYO
      *
     C                     MOVE 'P'       H2FLAG           LABEL FLAG
     C                     MOVE H2UNIT    H2QTY            QTY
     C                     ADD  1         WKSEQ#
     C           G         IFEQ 100
     C                     Z-ADD1         WKSEQ#
     C                     END
     C*
     C                     MOVE WSEQ      H2SEQ#           SEQ #
     C                     MOVE WSEQ#     H2PAGE           PAGE
     C*
     C* # OF PAGE (NUM --> CHAR)
     C                     Z-ADDQ         PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C*
     C                     MOVELPOQTY     H2#PAG           # OF PAGE
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    H2SERL
     C                     MOVELPNONY     H2SERL
      *
     C                     WRITEAB#WP2H1
      *
JW5  C                     MOVEL'AB#WP2H 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     EXSR #PP70
     C*
     C                     END
      *
     C           #READ1    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @1431:NIFAST CANADA LABEL
     C***********************************************************
     C           @1431     BEGSR
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ2
     C                     END
     C*
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ2
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ2
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     M2PART           PART
     C                     MOVE *ALL'*'   M2QTY            QTY
     C                     MOVE *ALL'*'   M2SHDT           SHIP DATE
     C                     MOVE *ALL'*'   M2ORDR           ORDER #
     C*
     C                     WRITEAB#WP2M1
      *
JW5  C                     MOVEL'AB#WP2M 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ2
     C                     END
      *
     C                     CLEARAB#PP701
     C* GET PART LOCATION
     C*
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVE F3ZETI    M2ZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    M2LOC1           NEW
     C                     MOVE F3STRT    M2LOC2
     C                     MOVE F3STRR    M2LOC3
     C                     MOVE F3STRD    M2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    M2LOC1           OLD
     C                     MOVE F3KTRT    M2LOC2
     C                     MOVE F3KTRR    M2LOC3
     C                     MOVE F3KTRD    M2LOC4
     C                     END
     C                     ELSE
      *
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    M2LOC1
     C                     MOVE *BLANK    M2LOC2
     C                     MOVE *BLANK    M2LOC3
     C                     MOVE *BLANK    M2LOC4
     C           KEY2      SETLLFCEPL011
     C           #PART3    TAG
     C           KEY2      READEFCEPL011                 91
     C           *IN91     IFEQ '0'
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART3
     C*                    END
     C                     MOVE A2ZETI    M2ZETI           ABSOLUTE #
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    M2LOC1           NEW
     C                     MOVE A2STRT    M2LOC2
     C                     MOVE A2STRR    M2LOC3
     C                     MOVE A2STRD    M2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    M2LOC1           OLD
     C                     MOVE A2KTRT    M2LOC2
     C                     MOVE A2KTRR    M2LOC3
     C                     MOVE A2KTRD    M2LOC4
     C                     END
     C*
     C                     END
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELWMHIN     M2PART           PART
     C*
     C           BAUSYS    IFNE *ZERO                      QTY/CONT.
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
     C*
     C                     Z-ADDBASRYO    @@SRYO
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     M2QTY            QTY
     C                     MOVELPOQTY     M2UNIT           QTY
     C*
     C                     MOVE BAODRN    M2ORDR           ORDER #
     C                     MOVE PNOHZ     M2SHDT           SHIP DATE
     C                     MOVE PNONY     M2DELY           DELIVERY
     C                     MOVE PNKOJ     M2FACT           FACTORY
     C                     MOVE PNUKE     M2DOCK           DOCK
     C                     MOVE M2LOC1    EKLOC1
     C                     MOVE M2LOC2    EKLOC2
     C                     MOVE M2LOC3    EKLOC3
     C                     MOVE M2LOC4    EKLOC4
     C*
     C           *IN88     IFEQ '1'
     C*
     C* USER SELECTED NUMBER OF LABEL
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C*
     C           1         DO   Q
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    M2SERL
     C                     MOVELPNONY     M2SERL
      *
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     M2UNIT           QTY
      *
     C                     SUB  WSYS      @@SRYO
      *
     C                     EXSR #PP70
     C                     DO   W#LAB
     C                     WRITEAB#WP2M1
      *
JW5  C                     MOVEL'AB#WP2M 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     END
     C                     GOTO #READ2
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ2
     C                     END
     C*
E2   C                     END
E1   C                     END
     C* USER ONLY MARKED
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
     C*
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     M2UNIT           QTY
      *
     C                     SUB  WSYS      @@SRYO
     C*
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    M2SERL
     C                     MOVELPNONY     M2SERL
     C                     EXSR #PP70
      *
     C                     DO   W#LAB
     C                     WRITEAB#WP2M1
      *
JW5  C                     MOVEL'AB#WP2M 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C*
     C                     END
      *
     C           #READ2    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @3347:TMMK LABEL
     C***********************************************************
     C           @3347     BEGSR
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ5
     C                     END
     C*
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ5
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ5
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     EKPART           PART
     C                     MOVE *ALL'*'   EKQTYC           QTY/CONT
     C                     MOVE *ALL'*'   EKSHDT           SHIP DATE
     C                     MOVE *ALL'*'   EKORDR           ORDER #
     C*
     C                     WRITEAB#WP2N1
      *
JW5  C                     MOVEL'AB#WP2N 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ5
     C                     END
     C*
     C                     CLEARAB#PP701
     C*
     C* READ EDI DATA FILE(TMMK)
     C                     MOVE BAMHN1    WAMHN1
     C                     MOVE BAMHN2    WAMHN2
     C                     MOVE BAMHN3    WAMHN3
     C                     MOVE BAMHN4    WAMHN4
     C                     MOVE BAODRN    WORDN
     C*
     C           KEY7      CHAINAB#PP401             97
     C           *IN97     IFEQ '0'
     C                     MOVELDASTAD    EKSTAD           STORE ADDRESS
     C                     MOVE DASUNM    EKSUNM           SUPPLIER NAME
     C                     MOVE DACUNM    EKCUNM           CUSTOMER NAME
     C                     MOVE DAMANC    EKMANC           MAIN ROUTE
     C                     MOVE DALIAD    EKLIAD           LINESIDE ADDRESS
     C                     MOVELDAPANM    EKPANM           PART DESCRIPTION
     C                     MOVE DASUB#    EKSUB#           SUB ROUTE
     C                     MOVE DAMAN#    EKMAN#           MAIN ROUTE NUMBER
     C                     MOVELDACUNM    EKCNAM           CUSTOMER NAME
     C*
     C                     ELSE
     C                     MOVE *BLANK    EKSTAD           STORE ADDRESS
     C                     MOVE *BLANK    EKSUNM           SUPPLIER NAME
     C                     MOVE *BLANK    EKCUNM           CUSTOMER NAME
     C                     MOVE *BLANK    EKMANC           MAIN ROUTE
     C                     MOVE *BLANK    EKLIAD           LINESIDE ADDRESS
     C                     MOVE *BLANK    EKPANM           PART DESCRIPTION
     C                     MOVE *BLANK    EKSUB#           SUB ROUTE
     C                     MOVE *BLANK    EKMAN#           MAIN ROUTE NUMBER
     C                     MOVE *BLANK    EKCNAM           CUSTOMER NAME
     C                     END
     C*
     C* TEMPORARY UNTIL STARTING REAL E-KANBAN
     C* SUPPLIER NAME
     C                     MOVEANAM       EKSUNM           SUPPLIER NAME
     C* READ KANBAN MASTER
     C                     Z-ADDBANOMM    KEY12
     C           KEY4      CHAINFCCTL121             95
     C           *IN95     IFEQ '0'
     C                     MOVELB4UTKR    EKSTAD           STORE ADDRESS
     C*
     C                     ELSE                                      1
     C                     MOVE *BLANK    EKSTAD           STORE ADDRESS
     C                     END
     C*
     C*
     C* GET PART LOCATION
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVE F3ZETI    EKZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    EKLOC1           NEW
     C                     MOVE F3STRT    EKLOC2
     C                     MOVE F3STRR    EKLOC3
     C                     MOVE F3STRD    EKLOC4
     C                     ELSE
     C                     MOVE F3KTRK    EKLOC1           OLD
     C                     MOVE F3KTRT    EKLOC2
     C                     MOVE F3KTRR    EKLOC3
     C                     MOVE F3KTRD    EKLOC4
     C                     END
      *
     C                     ELSE
      *
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    EKLOC1
     C                     MOVE *BLANK    EKLOC2
     C                     MOVE *BLANK    EKLOC3
     C                     MOVE *BLANK    EKLOC4
     C           KEY2      SETLLFCEPL011
     C           #PART4    TAG
     C           KEY2      READEFCEPL011                 91
     C           *IN91     IFEQ '0'
     C                     MOVE A2ZETI    EKZETI           ABSOLUTE #
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART4
     C*                    END
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    EKLOC1           NEW
     C                     MOVE A2STRT    EKLOC2
     C                     MOVE A2STRR    EKLOC3
     C                     MOVE A2STRD    EKLOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    EKLOC1           OLD
     C                     MOVE A2KTRT    EKLOC2
     C                     MOVE A2KTRR    EKLOC3
     C                     MOVE A2KTRD    EKLOC4
     C                     END
     C                     END
     C*
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVELWMHIN     EKPART           PART
     C                     MOVE BASBAN    EKSBAN           KANBAN NUMBER
     C                     MOVE BASIRE    EKSIRE           SUPPLIER
     C                     MOVE BASIRK    EKSIRK           FACTORY
     C                     MOVE BANOTM    EKNOTM           SHIP TIME
     C                     MOVE WIPAR     EKIPAR           INTERNAL PART
     C                     MOVE BANOBN    EKNOBN           BIN
     C*
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
     C*
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     EKQTYC           QTY/CONT.
     C                     MOVELPOQTY     EKUNIT           QTY/CONT.
     C*
     C                     MOVE BAODRN    EKORDR           ORDER #
     C                     Z-ADDPNOY      WKMDYY           SHIP DATE
     C                     Z-ADDPNOMM     WKMDYM
     C                     Z-ADDPNODD     WKMDYD
     C                     MOVE WKMDY     EKSHDT
     C                     MOVE PNONY     EKDELY           DELIVERY
     C                     MOVE PNKOJ     EKFACT           FACTORY
     C                     MOVE PNUKE     EKNUKE           DOCK
      *
     C                     Z-ADDBASRYO    @@SRYO
     C*
B1   C           *IN88     IFEQ '1'
     C*
     C* USER SELECTED NUMBER OF LABEL
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C*
     C           1         DO   Q
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     EKUNIT           QTY/CONT.
     C                     SUB  WSYS      @@SRYO
      *
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELPNONY     EKSERL
     C                     MOVELEKSERL    @@SERL
     C                     WRITEAB#PP701
     C                     DO   W#LAB
     C                     WRITEAB#WP2N1
      *
JW5  C                     MOVEL'AB#WP2N 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     END
     C                     GOTO #READ5
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ5
     C                     END
     C*
E2   C                     END
E1   C                     END
     C* USER ONLY MARKED
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
     C*
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     EKUNIT           QTY/CONT.
     C                     SUB  WSYS      @@SRYO
      *
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELPNONY     EKSERL
     C                     MOVELEKSERL    @@SERL
     C                     WRITEAB#PP701
     C*
     C                     DO   W#LAB
     C                     WRITEAB#WP2N1
      *
JW5  C                     MOVEL'AB#WP2N 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C*
     C                     END
      *
     C           #READ5    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C           @NMBR     BEGSR
     C***********************************************************
      *
     C                     MOVE *ALL'9'   @@14   140
     C           WNONY     CHAINAB#NP30              97
     C                     Z-ADD*DATE     N3UDAT
     C                     TIME           N3UTIM
     C                     MOVEL#PGM      N3UPGM
     C                     MOVEL#USER     N3UUSR
     C                     MOVEL#WSID     N3UWIS
     C                     Z-ADDWNONY     N3NONY
     C           *IN97     IFEQ *ON
     C                     Z-ADD1         N3NMBR
     C                     WRITEAB#NP301
     C                     ELSE
     C                     ADD  1         N3NMBR
     C           N3NMBR    IFEQ @@14
     C                     Z-ADD1         N3NMBR
     C                     ENDIF
     C                     UPDATAB#NP301
     C                     ENDIF
      *
     C                     ENDSR
     C***********************************************************
     C* @0873:ARVIN SANGO(IN)
     C***********************************************************
     C           @0873     BEGSR
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ6
     C                     END
     C*
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ6
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ6
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELBASBAN    ASSBAN           KANBAN
     C                     MOVE *ALL'*'   ASQTYC           QTY/CONT
     C                     MOVE *ALL'*'   ASSHDT           SHIP DATE
     C                     MOVE *ALL'*'   ASMANI           MANIFEST
     C*
     C                     WRITEAB#WP2P1
      *
JW5  C                     MOVEL'AB#WP2P 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ6
     C                     END
      *
     C                     CLEARAB#PP701
     C*
     C                     MOVE BASBAN    ASSBAN           KANBAN NUMBER
     C                     MOVELBAINVN    ASMANI           MANIFEST #
     C                     MOVE PNOHZ     ASNODT           SHIPPING DATE
     C                     MOVE BANONY    ASNONY           DELIVERY
     C                     MOVE BANUKE    ASNUKE           DOCK
     C                     MOVE BANKOJ    ASNKOJ           FACTORY
     C*
     C*
     C* GET PART LOCATION
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVE F3ZETI    ASZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    ASLOC1           NEW
     C                     MOVE F3STRT    ASLOC2
     C                     MOVE F3STRR    ASLOC3
     C                     MOVE F3STRD    ASLOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    ASLOC1           OLD
     C                     MOVE F3KTRT    ASLOC2
     C                     MOVE F3KTRR    ASLOC3
     C                     MOVE F3KTRD    ASLOC4
     C                     END
      *
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    ASLOC1
     C                     MOVE *BLANK    ASLOC2
     C                     MOVE *BLANK    ASLOC3
     C                     MOVE *BLANK    ASLOC4
     C           KEY2      SETLLFCEPL011
     C           #PART5    TAG
     C           KEY2      READEFCEPL011                 91
     C           *IN91     IFEQ '0'
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART5
     C*                    END
     C                     MOVE A2ZETI    ASZETI           ABSOLUTE #
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    ASLOC1           NEW
     C                     MOVE A2STRT    ASLOC2
     C                     MOVE A2STRR    ASLOC3
     C                     MOVE A2STRD    ASLOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    ASLOC1           OLD
     C                     MOVE A2KTRT    ASLOC2
     C                     MOVE A2KTRR    ASLOC3
     C                     MOVE A2KTRD    ASLOC4
     C                     END
     C*
     C                     ENDIF
     C                     END
     C                     ENDIF
     C*
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
     C*
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     ASQTYC           QTY/CONT.
     C                     MOVELPOQTY     ASUNIT           QTY/CONT.
     C*
     C                     Z-ADDBASRYO    @@SRYO
     C*
     C* TOPICS CUSTOMER MASTER
     C                     MOVE BATOKU    K31
     C                     MOVE BANONY    K32
     C           KEY3      CHAINALAPL01              92
     C           *IN92     IFEQ '0'
     C                     MOVELTPTPKN    ASCNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVE *BLANK    ASCNAM
     C                     END
     C*
     C* READ EDI DATA FILE(SRVIN SANGO)
     C           KEY8      SETLLAB#PP411
     C           KEY8      READEAB#PP411                 98
     C           *IN98     DOWEQ'0'
     C           AVSKJY    IFNE ' '
     C                     GOTO #ASI
     C                     END
     C*
     C* SERIAL# SELECTED ?
     C*
     C                     MOVE WKRVDT    ASSHDT           DUE DATE
     C                     MOVE AVTRAN    ASTRAN           TRANSACTION
     C                     MOVE AVTRUC    ASTRUC           TRUCK #
     C                     MOVE AVSUNM    ASSUPN           SUPPLIER NAME
     C                     MOVE AVKBSQ    ASSEQN           SEQ. #
     C                     MOVE AVSUCD    ASSIRE           SUPPLIER CODE
     C           AVBXWT    IFEQ 0
     C                     MOVE *BLANK    ASWEGH
     C*
     C                     ELSE
     C                     Z-ADDAVBXWT    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     ASWEGH           QWEIGHT
     C                     END
     C*
     C                     MOVE AVCYC     ASCYCL           SUPPLIER CODE
     C                     MOVE AVCNTP    ASCONT           CONTAINER TYPE
     C                     MOVE AVPDDS    ASDESC           DESCRIPTION
     C                     MOVELWIPAR     ASIPAR           INTERNAL PART
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    ASSERL
     C                     MOVELPNONY     ASSERL
     C                     MOVE ASLOC1    EKLOC1
     C                     MOVE ASLOC2    EKLOC2
     C                     MOVE ASLOC3    EKLOC3
     C                     MOVE ASLOC4    EKLOC4
      *
     C                     EXSR #PP70
     C                     WRITEAB#WP2P1
      *
JW5  C                     MOVEL'AB#WP2P 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C           #ASI      TAG
     C           KEY8      READEAB#PP411                 98
     C                     END
     C* USER ONLY MARKED
     C           #READ6    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @5530:GENERAL FASTNERS,HOLLINGSWORTH
     C***********************************************************
     C           @5530     BEGSR
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ7
     C                     END
     C*
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ7
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ7
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     F8PA1R           PART
     C                     MOVE *ALL'*'   F8SYOS           QTY/CONT
     C                     MOVE *ALL'*'   F8SHDT           SHIP DATE
     C*
     C                     WRITEAB#WP2T1
      *
JW5  C                     MOVEL'AB#WP2T 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ7
     C                     END
      *
     C                     CLEARAB#PP701
     C*
     C                     MOVELWPA1      WKPA1            EDIT BLANK
     C                     MOVELW#PA1     F8PA1R           PART1
     C                     MOVELWPA2      F8PA2R           PART2
     C                     MOVE *BLANK    F8RCOD           RESERVE CODE
     C                     MOVE *BLANK    F8LINE           LINE FEED
     C                     MOVE *BLANK    F8SEQR           SERIAL NUMBER
     C                     MOVE 'S'       F8LCOD           LABEL CODE
     C                     MOVE *BLANK    F8SHIP           SHIP TO NAME
     C                     MOVE *BLANK    F8PLID           PLANT ID
     C                     MOVE *BLANK    F8ADD1           ADDRESS1
     C                     MOVE *BLANK    F8ADD2           ADDRESS2
     C                     MOVE PNOHZ     F8SHDT           SHIPPING DATE
     C                     MOVE BANONY    F8NONY           DELIVERY
     C                     MOVE BANUKE    F8NUKE           DOCK
     C                     MOVE BANKOJ    F8NKOJ           FACTORY
     C                     MOVE *BLANK    F8DOCK           DOCK CODE
     C                     MOVE *BLANK    F8YOBI           YOUBI
     C                     MOVE *BLANK    F8MNAM           'MASTER'
     C*
     C           PNONY     IFEQ '5530'
JW3  C           PNONY     OREQ '5531'
JW3  C           PNONY     OREQ '5532'
JW3  C           PNONY     OREQ '5533'
     C                     MOVE *BLANK    F8SUPP           SUPPLIER CODE
     C                     ELSE
     C                     MOVE 'INDAV1'  F8SUPP
     C                     END
     C*
     C* GET PART LOCATION
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVE F3ZETI    F8ZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    F8TKR1           NEW
     C                     MOVE F3STRT    F8TKR2
     C                     MOVE F3STRR    F8TKR3
     C                     MOVE F3STRD    F8TKR4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    F8TKR1           OLD
     C                     MOVE F3KTRT    F8TKR2
     C                     MOVE F3KTRR    F8TKR3
     C                     MOVE F3KTRD    F8TKR4
     C                     END
      *
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    F8TKR1
     C                     MOVE *BLANK    F8TKR2
     C                     MOVE *BLANK    F8TKR3
     C                     MOVE *BLANK    F8TKR4
     C           KEY2      SETLLFCEPL011
     C           #PART6    TAG
     C           KEY2      READEFCEPL011                 91
     C           *IN91     IFEQ '0'
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART6
     C*                    END
     C*
     C                     MOVE A2ZETI    F8ZETI           ABSOLUTE #
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    F8TKR1           NEW
     C                     MOVE A2STRT    F8TKR2
     C                     MOVE A2STRR    F8TKR3
     C                     MOVE A2STRD    F8TKR4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    F8TKR1           OLD
     C                     MOVE A2KTRT    F8TKR2
     C                     MOVE A2KTRR    F8TKR3
     C                     MOVE A2KTRD    F8TKR4
     C                     END
     C*
     C                     ENDIF
     C                     END
     C                     ENDIF
     C*
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
     C*
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     F8QTYR           QTY/CONT.
     C                     MOVELPOQTY     F8SYOS           QTY/CONT.
     C*
     C                     Z-ADDBASRYO    @@SRYO
     C*
     C* TOPICS CUSTOMER MASTER
     C                     MOVE BATOKU    K31
     C                     MOVE BANONY    K32
     C           KEY3      CHAINALAPL01              92
     C           *IN92     IFEQ '0'
     C                     MOVELTPTPKN    F8CNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVE *BLANK    F8CNAM
     C                     END
     C*
B1   C           *IN88     IFEQ '1'
     C*
     C* USER SELECTED NUMBER OF LABEL
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C*
     C           1         DO   Q
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
      *
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     F8QTYR           QTY/CONT.
     C                     MOVELPOQTY     F8SYOS           QTY/CONT.
      *
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    F8SERL
     C                     MOVELPNONY     F8SERL
     C                     MOVE F8TKR1    EKLOC1
     C                     MOVE F8TKR2    EKLOC2
     C                     MOVE F8TKR3    EKLOC3
     C                     MOVE F8TKR4    EKLOC4
      *
     C                     EXSR #PP70
     C                     DO   W#LAB
     C                     WRITEAB#WP2T1
      *
JW5  C                     MOVEL'AB#WP2T 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     END
     C                     GOTO #READ7
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ7
     C                     END
     C*
E2   C                     END
E1   C                     END
     C* USER ONLY MARKED
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
      *
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     F8QTYR           QTY/CONT.
     C                     MOVELPOQTY     F8SYOS           QTY/CONT.
     C*
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    F8SERL
     C                     MOVELPNONY     F8SERL
     C                     EXSR #PP70
      *
     C                     DO   W#LAB
     C                     WRITEAB#WP2T1
      *
JW5  C                     MOVEL'AB#WP2T 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C*
     C                     END
      *
     C           #READ7    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @OTHER:OTHER DELIVERY LABEL
     C***********************************************************
     C           @OTHER    BEGSR
     C*
     C* SERVICE PART?
     C                     MOVE *OFF      *IN55
     C                     MOVE *BLANK    SRVF
     C           WNONY     IFEQ 0323
     C                     MOVE '1'       SRVF
     C           *IN22     IFEQ *OFF
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD30        P@LEN
     C                     CALL 'QCMDEXC' P#CMD          99
     C                     MOVE *ON       *IN22
     C                     ENDIF
     C                     OPEN AB#WP2Q
     C                     END
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
B01  C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ3
     C                     END
     C*
     C* ORDER# SELECTED ?
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ3
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ3
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     I2PART           PART
     C                     MOVE *ALL'*'   I2SBAN           KANBAN #
     C                     MOVE *ALL'*'   I2QTY            QTY
     C                     MOVE *ALL'*'   I2DOCK           DOCK CODE
     C                     MOVE *ALL'*'   I2ADDR           STORE ADDRESS
     C                     MOVE *ALL'*'   I2SIRE           CUSTOMER CODE
     C                     MOVE *ALL'*'   I2PNAM           PART NAME
     C                     MOVE *ALL'*'   I2IPAR           INTERNAL PART
     C                     MOVE *ALL'*'   I2SHDT           SHIP DATE
     C                     MOVE *ALL'*'   I2SEQ#           SERIAL #
     C                     MOVE *ALL'*'   I2ORDR           ORDER #
     C                     MOVE *ALL'*'   I2DUMY           DUMMY
     C*
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ3
     C                     END
      *
TCHK5C           SRVF      IFEQ *BLANK
TCHK5C           BATOKU    IFEQ 3411
TCHK5C                     MOVE 'T'       SRVF
TCHK5C                     END
TCHK5C                     END
      *
     C                     CLEARAB#PP701
TCHK6C                     CLEARAB#WP2I1
TCHK6C                     Z-ADD*ZERO     WSEQ##
     C* SUPPLIER CODE
     C                     MOVELBASIRE    I2SIRE
     C* GET PART NAME
     C*
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVELF3SMEI    I2PNAM           PART NAME
     C                     MOVE F3ZETI    I2ZETI           ABSOLUTE #
     C                     Z-ADDF3KASI    @@KASI  72
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    I2LOC1           NEW
     C                     MOVE F3STRT    I2LOC2
     C                     MOVE F3STRR    I2LOC3
     C                     MOVE F3STRD    I2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    I2LOC1           OLD
     C                     MOVE F3KTRT    I2LOC2
     C                     MOVE F3KTRR    I2LOC3
     C                     MOVE F3KTRD    I2LOC4
     C                     END
      *
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    I2PNAM
     C                     MOVE *BLANK    I2LOC1
     C                     MOVE *BLANK    I2LOC2
     C                     MOVE *BLANK    I2LOC3
     C                     MOVE *BLANK    I2LOC4
     C           KEY2      SETLLFCEPL011
     C           #PART7    TAG
     C           KEY2      READEFCEPL011                 91
B02  C           *IN91     IFEQ '0'
     C                     MOVELA2SMEI    I2PNAM           PART NAME
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART7
     C*                    END
     C                     MOVE A2ZETI    I2ZETI           ABSOLUTE #
     C                     Z-ADDA2KASI    @@KASI  72
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    I2LOC1           NEW
     C                     MOVE A2STRT    I2LOC2
     C                     MOVE A2STRR    I2LOC3
     C                     MOVE A2STRD    I2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    I2LOC1           OLD
     C                     MOVE A2KTRT    I2LOC2
     C                     MOVE A2KTRR    I2LOC3
     C                     MOVE A2KTRD    I2LOC4
     C                     END
     C*
     C                     ENDIF
E02  C                     END
E02  C                     ENDIF
     C*
     C           BANONY    IFEQ 5125
JW1  C           BANONY    OREQ 5288
JW2  C           BANONY    OREQ 5211
     C                     MOVELWPA1      I2PART    P
     C                     MOVELWPA2      I2PNAM    P      PART NAME
     C                     ELSE
     C                     MOVELWMHIN     I2PART           PART
     C                     MOVE BASBAN    I2SBAN           KANBAN #
     C                     ENDIF
     C*
     C           K#85      SETGTAB#PP85
     C           K#85X     REDPEAB#PP85                  97
     C           *IN97     IFEQ *OFF
     C                     MOVELA5SBAN    I2SB10
     C                     MOVELA5RELS    I2RELS
     C                     ENDIF
TCHK6C*
TCHK6C           BANONY    IFEQ 3554
TCHK6C           I2SB10    IFEQ *BLANK
TCHK6C                     MOVELBASBAN    I2SB10
TCHK6C                     END
TCHK6C                     END
TCHK6C*
      * TG(KENTUCKY)
     C           PNONY     IFEQ '0902'
     C           PNONY     OREQ '0905'
     C                     CLEARAB#WP2O1
      *
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     O2QTY            QTY
     C                     MOVELMST,1     O2PNAM           PART NAME
     C                     EXSR @NMBR
      *
     C                     MOVE N3NMBR    O2SERL
     C                     MOVELPNONY     O2SERL
     C                     MOVE BASBAN    O2SBAN           ABSOLUTE #
     C                     MOVE PNONY     O2DELY           DELIVERY
     C                     MOVELBASIRE    O2SIRE
     C                     MOVELWMHIN     O2PART           PART
     C                     MOVE BASBAN    O2SBAN           KANBAN #
     C                     MOVE BANUKE    O2DOCK           DOCK CODE
     C                     MOVE PNKOJ     O2FACT           FACTORY
     C                     MOVE PNUKE     O2DOCK           DOCK
     C                     MOVE BAODRN    O2ORDR           ORDER #
     C                     MOVE PNOHZ     O2SHDT           SHIP DATE
     C                     MOVELI2CNAM    O2CNAM
     C                     MOVELI2ADDR    O2ADDR
     C                     MOVELI2SB10    O2FILR
      *
     C                     EXSR #PP70
     C                     WRITEAB#WP2O1
      *
JW5  C                     MOVEL'AB#WP2O 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     ENDIF
     C*
     C* QTY/CONTAINERS
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
      *
     C                     Z-ADDBASRYO    @@SRYO
     C*
     C* CALUCULATE THE TOTAL WEIGHT PAR PART
     C* (QTY/CONTAINER) * (FINISHED WEIGHT) = NET WEIGHT PER BOX(G)
     C* (NET WEIGHT PER BOX) / 1000      = TOTAL WEIGHT / PART(KG)
     C           WSYS      MULT @@KASI    WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   92
     C           WKOT2     MULT 2.2046    WKOT2
     C                     Z-ADDWKOT2     PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2WEIT           QTY
     C*
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C*
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
     C                     MOVE BANUKE    I2DOCK           DOCK CODE
     C                     MOVE *BLANK    I2DUMY           DUMMY
     C                     MOVE PNONY     I2DELY           DELIVERY
     C                     MOVE PNKOJ     I2FACT           FACTORY
     C                     MOVE PNUKE     I2DOCK           DOCK
     C*
     C* TOPICS CUSTOMER MASTER
     C                     MOVE BATOKU    K31
     C                     MOVE BANONY    K32
     C           KEY3      CHAINALAPL01              92
     C           *IN92     IFEQ '0'
     C                     MOVELTPTPKN    I2CNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVE *BLANK    I2CNAM
     C                     END
     C*
     C* READ KANBAN MASTER
     C                     Z-ADDBANOMM    KEY12
     C           KEY4      CHAINFCCTL121             95
     C           *IN95     IFEQ '0'
     C                     MOVELB4UTKR    I2ADDR           STORE ADDRESS
     C*
     C                     ELSE                                      1
     C                     MOVE *BLANK    I2ADDR           STORE ADDRESS
     C                     END
     C*
     C                     MOVE BAODRN    I2ORDR           ORDER #
     C                     MOVE BAODRN    I2ODRN           ORDER #
     C                     MOVE #PGM      I2PGM            PROGRAM NAME
     C           PNONY     IFEQ '0323'
TCHK7C                     MOVEL*BLANK    @5
     C                     MOVELPNODD     @5      5
     C                     MOVE DC,PNOMM  @1      1
     C           @5        CAT  @1:0      @5        P
     C                     MOVE PY        @1
     C           @5        CAT  @1:0      @5        P
     C                     MOVEL@5        I2FLD1
     C                     ENDIF
     C*
     C           PNONY     IFEQ '5125'
JW1  C           PNONY     OREQ '5288'
JW2  C           PNONY     OREQ '5211'
     C                     MOVELBAPGID    I2FLD1
     C                     MOVELBAALFL    I2TTL1
     C                     ENDIF
      *
     C                     MOVE WIPAR     I2IPAR           INTERNAL PART
     C                     MOVE PNOHZ     I2SHDT           SHIP DATE
     C                     MOVE I2LOC1    EKLOC1
     C                     MOVE I2LOC2    EKLOC2
     C                     MOVE I2LOC3    EKLOC3
     C                     MOVE I2LOC4    EKLOC4
      *
     C                     MOVE *OFF      *IN55
     C*
B1   C           *IN88     IFEQ '1'
     C*
     C* USER SELECTED NUMBER OF LABEL
B2   C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
B3   C           1         DO   Q
     C                     ADD  1         WSEQ##
     C                     EXSR @NMBR
      *
     C                     MOVE N3NMBR    I2SERL
     C                     MOVELPNONY     I2SERL
      *
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C*
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
      *
     C                     EXSR #PP70
      *
     C           PNONY     IFEQ '5125'
JW1  C           PNONY     OREQ '5288'
JW2  C           PNONY     OREQ '5211'
     C                     MOVEL'AVRTA'   I2DUMY
     C                     MOVE I2SERL    @9      9
     C                     MOVEL@9        I2SB10    P
     C                     ENDIF
      *
     C           SRVF      IFEQ '1'
     C           *IN55     ANDEQ*OFF
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2CQTY           QTY
     C******     @ITM      IFGT 1
     C*******              MOVEL'0'       I2PART    P
     C*********            MOVE *BLANK    I2CQTY
     C********             ENDIF
     C           BANUKE    IFEQ '00'
     C                     MOVEL'E'       I2LVL
     C                     ELSE
     C                     MOVELBANUKE    I2LVL
     C                     ENDIF
      *
     C                     MOVE I2SERL    I2CASE
     C                     MOVEL'242'     I2CASE
     C                     WRITEAB#WP2Q1
     C                     MOVE *ON       *IN55
      *
JW5  C                     MOVEL'AB#WP2Q 'IXWRKF    P
.    C                     EXSR #XP01
      *
      *
     C**********           EXSR #P66
      *
     C                     EXSR CHKBG
     C                     MOVELBAGFLG    I2DUMY
      *
     C                     ENDIF
      *
     C                     DO   W#LAB
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
E3   C                     END
E3   C                     END
     C                     GOTO #READ3
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ3
     C                     END
     C*
E2   C                     END
E1   C                     END
     C*
     C* USER ONLY MARKED
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
      *
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
     C                     SUB  WSYS      @@SRYO
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C*
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
      *
     C                     ADD  1         WSEQ##
     C                     EXSR @NMBR
      *
     C                     MOVE N3NMBR    I2SERL
     C                     MOVELPNONY     I2SERL
     C                     EXSR #PP70
      *
     C           PNONY     IFEQ '5125'
JW1  C           PNONY     OREQ '5288'
JW2  C           PNONY     OREQ '5211'
     C                     MOVEL'AVRTA'   I2DUMY
     C                     MOVE I2SERL    @9      9
     C                     MOVEL@9        I2SB10    P
     C                     ENDIF
      *
     C           SRVF      IFEQ '1'
     C           *IN55     ANDEQ*OFF
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2CQTY           QTY
     C*******    @ITM      IFGT 1
     C*****                MOVEL'0'       I2PART    P
     C*******              MOVE *BLANK    I2CQTY
     C*********            ENDIF
     C                     MOVE I2SERL    I2CASE
     C                     MOVEL'242'     I2CASE
     C           BANUKE    IFEQ '00'
     C                     MOVEL'E'       I2LVL
     C                     ELSE
     C                     MOVELBANUKE    I2LVL
     C                     ENDIF
      *
     C                     WRITEAB#WP2Q1
     C                     MOVE *ON       *IN55
      *
JW5  C                     MOVEL'AB#WP2Q 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     EXSR #P66
      *
     C                     EXSR CHKBG
     C                     MOVELBAGFLG    I2DUMY
      *
     C                     ENDIF
      *
     C                     DO   W#LAB
     C* SERIAL# SELECTED ?
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C*
     C                     END
      *
     C           #READ3    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
      *
     C           WNONY     IFEQ 0323
     C                     CLOSEAB#WP2Q
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* WRITE CASE DATA FOR 0323
     C***********************************************************
     C           #P66      BEGSR
      *
     C*                    CLEARAB#PP661
     C*                    Z-ADD*DATE     A6KYMD
     C*                    TIME           A6KTIM
     C*                    MOVE BATOKU    A6TOKU
     C*                    MOVE BANONY    A6NONY
     C*                    MOVE BANKOJ    A6NKOJ
     C*                    MOVE BANUKE    A6NUKE
     C*                    MOVELI2CASE    A6MLBL
     C*                    Z-ADDBANOHZ    A6NYMD
     C*                    Z-ADDBANOBN    A6NBIN
      *
     C*                    WRITEAB#PP661
      *
     C                     ENDSR
     C***********************************************************
      *  CHECK SERVICE PART TO SEE IF IT NEEDS A LARGE BAG.
     C***********************************************************
     C           CHKBG     BEGSR
      *
     C                     MOVE *BLANK    BAGFLG  1
     C                     CALL 'AB#R2CH'
     C                     PARM           BAMHN1
     C                     PARM           BAMHN2
     C                     PARM           BAGFLG
      *
     C                     ENDSR
     C***********************************************************
     C* @0291 : 0291 DELIVERY LABEL
     C***********************************************************
     C           @0291     BEGSR
     C*
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    W@20   20
     C*
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
B01  C           *IN93     DOWEQ'0'
     C           BASKJY    IFNE ' '
     C                     GOTO #READ8
     C                     END
     C*
     C* ORDER# SELECTED ?
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ8
     C                     END
     C                     END
     C*
     C           BIN       IFNE BANOBN
     C                     GOTO #READ8
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     I2PART           PART
     C                     MOVE *ALL'*'   I2SBAN           KANBAN #
     C                     MOVE *ALL'*'   I2QTY            QTY
     C                     MOVE *ALL'*'   I2DOCK           DOCK CODE
     C                     MOVE *ALL'*'   I2ADDR           STORE ADDRESS
     C                     MOVE *ALL'*'   I2SIRE           CUSTOMER CODE
     C                     MOVE *ALL'*'   I2PNAM           PART NAME
     C                     MOVE *ALL'*'   I2IPAR           INTERNAL PART
     C                     MOVE *ALL'*'   I2SHDT           SHIP DATE
     C                     MOVE *ALL'*'   I2SEQ#           SERIAL #
     C                     MOVE *ALL'*'   I2ORDR           ORDER #
     C                     MOVE *ALL'*'   I2DUMY           DUMMY
     C*
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ8
     C                     END
      *
     C                     CLEARAB#PP701
      *
     C           BAMHIN    IFNE W@20
     C                     MOVE *OFF      *IN99
     C                     MOVE BAMHIN    W@20
     C                     ENDIF
     C* SUPPLIER CODE
     C                     MOVELBASIRE    I2SIRE
     C* GET PART NAME
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     MOVELF3SMEI    I2PNAM           PART NAME
     C                     MOVE F3ZETI    I2ZETI           ABSOLUTE #
     C                     Z-ADDF3KASI    @@KASI
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    I2LOC1           NEW
     C                     MOVE F3STRT    I2LOC2
     C                     MOVE F3STRR    I2LOC3
     C                     MOVE F3STRD    I2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    I2LOC1           OLD
     C                     MOVE F3KTRT    I2LOC2
     C                     MOVE F3KTRR    I2LOC3
     C                     MOVE F3KTRD    I2LOC4
     C                     END
      *
     C                     ELSE
TCHK3C                     MOVEL*BLANK    F3ZETI
     C                     MOVE *BLANK    I2PNAM
     C                     MOVE *BLANK    I2LOC1
     C                     MOVE *BLANK    I2LOC2
     C                     MOVE *BLANK    I2LOC3
     C                     MOVE *BLANK    I2LOC4
     C           KEY2      SETLLFCEPL011
     C           #PART8    TAG
     C           KEY2      READEFCEPL011                 91
B02  C           *IN91     IFEQ '0'
     C*
     C*          A2GSKD    IFEQ 'D'
     C*                    GOTO #PART8
     C*                    END
     C                     MOVELA2SMEI    I2PNAM           PART NAME
     C                     MOVE A2ZETI    I2ZETI           ABSOLUTE #
     C                     Z-ADDA2KASI    @@KASI
     C*
     C           A2GSKD    IFEQ *BLANK
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    I2LOC1           NEW
     C                     MOVE A2STRT    I2LOC2
     C                     MOVE A2STRR    I2LOC3
     C                     MOVE A2STRD    I2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    I2LOC1           OLD
     C                     MOVE A2KTRT    I2LOC2
     C                     MOVE A2KTRR    I2LOC3
     C                     MOVE A2KTRD    I2LOC4
     C                     END
     C*
     C                     ENDIF
E02  C                     END
E02  C                     ENDIF
     C*
     C                     MOVELWMHIN     I2PART           PART
     C                     MOVE BASBAN    I2SBAN           KANBAN #
     C                     MOVE I2LOC1    EKLOC1
     C                     MOVE I2LOC2    EKLOC2
     C                     MOVE I2LOC3    EKLOC3
     C                     MOVE I2LOC4    EKLOC4
     C*
     C* QTY/CONTAINERS
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C*
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
      ** QTY FOR MASTER LABEL
     C           *IN99     IFEQ *OFF
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     @@QTY   5        TOTAL WGHT
     C                     ENDIF
     C*
     C                     MOVE BANUKE    I2DOCK           DOCK CODE
     C                     MOVE *BLANK    I2DUMY           DUMMY
     C                     MOVE PNONY     I2DELY           DELIVERY
     C                     MOVE PNKOJ     I2FACT           FACTORY
     C                     MOVE PNUKE     I2DOCK           DOCK
     C*
     C* TOPICS CUSTOMER MASTER
     C                     MOVE BATOKU    K31
     C                     MOVE BANONY    K32
     C           KEY3      CHAINALAPL01              92
     C           *IN92     IFEQ '0'
     C                     MOVELTPTPKN    I2CNAM           CUSTOMER NAME
     C                     ELSE
     C                     MOVE *BLANK    I2CNAM
     C                     END
     C*
     C* READ KANBAN MASTER
     C                     Z-ADDBANOMM    KEY12
     C           KEY4      CHAINFCCTL121             95
     C           *IN95     IFEQ '0'
     C                     MOVELB4UTKR    I2ADDR           STORE ADDRESS
     C*
     C                     ELSE                                      1
     C                     MOVE *BLANK    I2ADDR           STORE ADDRESS
     C                     END
     C*
     C                     MOVE BAODRN    I2ORDR           ORDER #
     C                     MOVE BAODRN    I2ODRN           ORDER #
     C                     Z-ADDBASRYO    @@SRYO
     C*
     C                     MOVE WIPAR     I2IPAR           INTERNAL PART
     C                     MOVE PNOHZ     I2SHDT           SHIP DATE
      *
     C* CALUCULATE THE TOTAL WEIGHT PAR PART
     C* (QTY/CONTAINER) * (FINISHED WEIGHT) = NET WEIGHT PER BOX(G)
     C* (NET WEIGHT PER BOX) / 1000      = TOTAL WEIGHT / PART(KG)
     C           WSYS      MULT @@KASI    WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   92
     C           WKOT2     MULT 2.2046    WKOT2
     C                     Z-ADDWKOT2     PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2WEIT           QTY
     C*
      ** WRITE A MASTER LABEL
     C           *IN99     IFEQ *OFF
B2   C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C                     ELSE
     C                     Z-ADDW#LAB     Q
     C                     ENDIF
     C                     ADD  1         WSEQ##
B3   C           1         DO   Q
      *
     C                     MOVEL@@QTY     I2QTY
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     ENDDO
     C                     MOVE *ON       *IN99
     C                     ENDIF
      ****
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C                     MOVELPOQTY     @@QTY1  5        QTY
      *
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
      *
B1   C           *IN88     IFEQ '1'
     C*
     C* USER SELECTED NUMBER OF LABEL
B2   C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
B3   C           1         DO   Q
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    I2SERL
     C                     MOVELPNONY     I2SERL
      *
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
      *
     C                     SUB  WSYS      @@SRYO
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C                     MOVELPOQTY     @@QTY1  5        QTY
      *
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
      *
     C                     EXSR #PP70
     C                     ADD  1         WSEQ##
     C                     DO   W#LAB
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
E3   C                     END
E3   C                     END
     C                     GOTO #READ8
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ8
     C                     END
     C*
E2   C                     END
E1   C                     END
     C*
     C* USER ONLY MARKED
     C*
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
      ** WRITE A MASTER LABEL
     C           *IN99     IFEQ *OFF
     C                     MOVEL@@QTY     I2QTY
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     MOVEL@@QTY1    I2QTY
     C*
     C           1         DO   Q
     C*
     C                     ADD  1         WSEQ##
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    I2SERL
     C                     MOVELPNONY     I2SERL
     C                     EXSR #PP70
      *
     C           @@SRYO    IFGE WSYS
     C                     Z-ADDWSYS      PIQTY
     C                     ELSE
     C                     Z-ADD@@SRYO    PIQTY
     C                     ENDIF
      *
     C                     SUB  WSYS      @@SRYO
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2QTY            QTY
     C                     MOVELPOQTY     @@QTY1  5        QTY
      *
     C                     MOVELPOQTY     I2UNIT           QTY/CONT
      *
     C                     DO   W#LAB
     C                     WRITEAB#WP2I1
      *
JW5  C                     MOVEL'AB#WP2I 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C*
     C                     END
      *
     C           #READ8    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @SFL:CREATE SUB FILE
     C***********************************************************
     C           @SFL      BEGSR
     C*
     C                     Z-ADD*ZERO     RRN
     C                     MOVE PNONY     WNONY
     C*
     C           KEY1      SETLLAB#PL131
     C           KEY1      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C*
     C* DELETED  ?
     C           BASKJY    IFNE ' '
     C                     GOTO #READ
     C                     END
     C*
     C* SAME BIN ?
     C           BIN       IFNE BANOBN
     C                     GOTO #READ
     C                     END
     C*
     C* IF SELECTED ORDER#, SAME ORDER# ?
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ
     C                     END
     C                     END
     C*
     C* SET DATA TO SUB FILE
     C                     ADD  1         RRN
     C           RRN       CHAINSFL01                94
     C                     MOVE *BLANK    @FLAG
     C                     Z-ADD*ZERO     @#LAB
     C*
     C*
     C           BAMHN4    IFEQ *BLANK
     C                     MOVE *BLANK    @P3
     C                     ELSE
     C                     MOVE BAMHN4    WAMHN4
     C                     MOVE '-'       @P3
     C                     END
     C*
     C           BAMHN3    IFEQ *BLANK
     C                     MOVE *BLANK    @P2
     C                     ELSE
     C                     MOVE BAMHN3    WAMHN3
     C                     MOVE '-'       @P2
     C                     END
     C*
     C           BAMHN2    IFEQ *BLANK
     C                     MOVE *BLANK    @P1
     C                     ELSE
     C                     MOVE BAMHN2    WAMHN2
     C                     MOVE '-'       @P1
     C                     END
     C*
     C                     MOVE BAMHN1    WAMHN1
     C*
     C                     MOVE BASBAN    @SBAN
     C                     MOVE BAODRN    @ODER
     C                     Z-ADDBASRYO    @RQTY
     C                     Z-ADDBASYOS    @SYOS
     C   94                WRITESFL01
     C  N94                UPDATSFL01
     C*
     C           #READ     TAG
     C           KEY1      READEAB#PL131                 93
     C                     END
     C*
     C           RRN       IFEQ *ZERO
     C                     SETON                     30
     C                     MOVELER,12     MSG
     C*
     C                     ELSE
     C                     MOVE '2'       WKDSP
     C                     Z-ADDRRN       W1RRN
     C                     Z-ADD1         RRN
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @WRT2:WRITE LABEL DATA(SELECTED PART NUMBER)
     C***********************************************************
     C           @WRT2     BEGSR
     C*
     C                     SETON                     8887
     C* GET THE NUMBER OF LABEL
     C           PNONY     CHAINAB#PL90              96
     C           *IN96     IFEQ '0'
     C                     Z-ADDYA#LAB    W#LAB
     C                     ELSE
     C                     Z-ADD1         W#LAB
     C                     END
     C*
     C                     Z-ADD1         RRN
     C                     DO   W1RRN
     C           RRN       CHAINSFL01                94
     C           *IN94     IFEQ '0'
     C           @FLAG     IFNE *BLANK
     C           @#LAB     ORNE 0
     C*
     C                     MOVE PNONY     WNONY   40
     C                     MOVEL@ODER     WORDN  10
     C*
     C* SIA,D-MAX
     C           PNONY     IFEQ '0437'
     C           PNONY     OREQ '0590'
     C           PNONY     OREQ '0521'
     C           PNONY     OREQ '2389'
TCHK4C           PNONY     OREQ '2390'
TCHK4C           PNONY     OREQ '2391'
TCHK4C           PNONY     OREQ '2392'
TCHK4C           PNONY     OREQ '2394'
TCHK4C           PNONY     OREQ '2395'
TCHK4C           PNONY     OREQ '2396'
TCHK4C           PNONY     OREQ '2397'
TCHK4C           PNONY     OREQ '2398'
TCHK4C           PNONY     OREQ '2399'
     C                     EXSR @0590
     C                     GOTO #WRT2
     C                     END
     C*
     C* TRW-KOYO
     C           PNONY     IFEQ '3892'
     C                     EXSR @3892
     C                     GOTO #WRT2
     C                     END
     C*
     C* NIFAST CANADA
     C           PNONY     IFEQ '1431'
     C                     EXSR @1431
     C                     GOTO #WRT2
     C                     END
     C*
     C* TMMK
     C           PNONY     IFEQ '3347'
     C                     EXSR @3347
     C                     GOTO #WRT2
     C                     END
     C*
     C* ARVIN SANGO(IN)
     C           PNONY     IFEQ '0871'
JW4  C           PNONY     OREQ '0873'
"    C           PNONY     OREQ '0876'
"    C           PNONY     OREQ '0878'
"    C           PNONY     OREQ '0879'
"    C           PNONY     OREQ '0880'
"    C           PNONY     OREQ '0881'
     C                     EXSR @0873
     C                     GOTO #WRT2
     C                     END
     C*
     C* GENERAL FASTNERS, HOLLINGSWORTH
     C           PNONY     IFEQ '5530'
     C           PNONY     OREQ '5211'
JW3  C           PNONY     OREQ '5531'
JW3  C           PNONY     OREQ '5532'
JW3  C           PNONY     OREQ '5533'
     C                     EXSR @5530
     C                     GOTO #WRT2
     C                     END
     C*
     C* AMBRAKE
     C           PNONY     IFEQ '0291'
     C                     EXSR @0291
     C                     GOTO #WRT2
     C                     END
     C* OTHERS
     C                     EXSR @OTHER
     C*
     C                     END
     C                     END
     C*
     C           #WRT2     TAG
     C                     ADD  1         RRN
     C                     END
     C*
     C                     SETOF                     88
     C*
     C                     ENDSR
     C***********************************************************
     C* @0590:DMAX 2D LABEL
     C***********************************************************
     C           @0590     BEGSR
      *
     C                     MOVE X'BA'     @HX1    1
     C                     MOVE X'5D'     @HX2    1
     C                     MOVE X'6E'     @HX3    1
     C                     MOVE X'1E'     @HX4    1
     C                     MOVE X'1C'     @HX5    1
     C                     MOVE X'1D'     @HX6    1
     C                     MOVE X'37'     @HX7    1
     C                     MOVE @HX1      @DX1
     C                     MOVE @HX2      @DX2
     C                     MOVE @HX3      @DX3
     C                     MOVE @HX4      @DX4
     C                     MOVE @HX6      @DX6
     C                     MOVE *BLANK    @@ORDR 10
      *
     C                     CLEARAB#WP2E1
     C                     Z-ADD*ZERO     @D      20
     C                     Z-ADD*ZERO     @TWGHT 110
     C                     MOVE *BLANK    MH@
     C                     MOVE *BLANK    TQ@
     C                     MOVE *BLANK    PA@
     C                     MOVE *BLANK    PQ@
      *
     C           PNONY     CHAINEDIPL40              90
     C           *IN90     IFEQ *OFF
     C                     MOVELE4ADD1    @ADR1  20
     C                     MOVELE4ADD2    @ADR2  20
     C                     MOVELE4ADD3    @ADR3  20
     C                     ENDIF
      *
     C                     MOVE '0111'    @4      4
     C           @4        CHAINEDIPL40              90
     C           *IN90     IFEQ *OFF
     C                     MOVELE4ADD1    @ADR11 20
     C                     MOVELE4ADD2    @ADR22 20
     C                     MOVELE4ADD3    @ADR33 20
     C                     MOVELE4ADD4    @ADR44 20
     C           'MADE IN' CAT  'USA':1   @ADR55 20
     C                     ENDIF
      *
     C                     SETOF                     93
      *
     C  N88      KEY1      SETLLAB#PL131
     C  N88      KEY1      READEAB#PL131                 93
     C*
     C   88      KEY6      SETLLAB#PL131
     C   88      KEY6      READEAB#PL131                 93
     C*
B01  C           *IN93     DOWEQ'0'
     C*
     C           BASKJY    IFNE ' '
     C                     GOTO #READ9
     C                     END
     C*
     C* ORDER NUMBER SELECTED ?
B02  C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     GOTO #READ9
     C                     END
E02  C                     END
     C*
     C* BIN SELECTED ?
     C           BIN       IFNE 0
     C           BIN       ANDNEBANOBN
     C                     GOTO #READ9
     C                     END
     C           PNUKE     IFNE *BLANK
     C           BANUKE    ANDNEPNUKE
     C                     GOTO #READ9
     C                     ENDIF
      *
     C           @@ORDR    IFNE BAODRN
     C                     MOVEL*BLANK    WW11   20
     C                     MOVEL*BLANK    WW13   20
     C                     MOVEL*BLANK    WW14   20
     C                     MOVEL*BLANK    WW15   20
     C                     MOVEL*BLANK    WW16   20
     C                     MOVEL*BLANK    WW17   20
     C                     MOVEL*BLANK    @CNTP  10
     C                     MOVEL'SH 00'   @DOCK  10
     C                     MOVE BATOKU    @TOKU
     C                     MOVE BANONY    @NONY
     C                     MOVE BAODRN    @@ORDR
     C                     MOVELBAODRN    @ORNO  15 P
     C           K#2E      SETGTAB#PL2E
     C           *IN99     DOUEQ*ON
     C           K#2E      REDPEAB#PL2E                  99
     C           *IN99     IFEQ *OFF
     C                     MOVELAEPC11    WW11
     C                     MOVELAEPC13    WW13
     C                     MOVELAEPC14    WW14
     C                     MOVELAEPC15    WW15
     C                     MOVELAEPC16    WW16
     C                     MOVELAEPC17    WW17
     C                     MOVELAEPC12    @DOCK     P
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     CLEARAB#WP2F1
      *
B02  C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C*
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE *ALL'*'   F2ZETI
     C                     MOVE *ALL'*'   F2LOC1
     C                     MOVE *ALL'*'   F2LOC2
     C                     MOVE *ALL'*'   F2LOC3
     C                     MOVE *ALL'*'   F2LOC4
     C                     MOVE *ALL'*'   F2SYOS
     C                     WRITEAB#WP2F1
      *
JW5  C                     MOVEL'AB#WP2F 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     GOTO #READ9
E02  C                     END
      *
     C                     CLEARAB#PP701
      *
     C           BANONY    IFEQ 0590
     C                     MOVEL'W100'    F2PLNT           CUSTOMER NAME
     C                     ELSE
     C                     MOVEL@DOCK     F2PLNT
     C                     ENDIF
     C                     MOVEL@ADR1     F2TAD1
     C                     MOVEL@ADR2     F2TAD2
     C                     MOVEL@ADR3     F2TAD3
     C                     MOVEL@ADR11    F2FAD1
     C                     MOVEL@ADR22    F2FAD2
     C                     MOVEL@ADR33    F2FAD3
     C                     MOVEL@ADR44    F2FAD4
     C           BANONY    IFEQ 0590
     C                     MOVEL'DMAX'    F2CNAM
     C                     ELSE
     C                     MOVEL'GM'      F2CNAM
     C                     ENDIF
     C                     MOVELBAODRN    F2REFR
     C                     MOVELWW11      F2MHND
     C                     MOVELWW13      F2REF1
     C                     MOVELWW14      F2REF2
     C                     MOVELWW15      F2REF3
     C                     MOVELWW16      F2REF4
     C                     MOVELWW17      F2REF5
     C                     ADD  1         @@CNT
      *
     C                     MOVE PNODD     DMXD
     C                     MOVE PNOYY     DMXY
     C                     MOVE MON,PNOMM DMXM
     C                     MOVE DMDAT     F2SHDT
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE BASBAN    F2SBAN
     C                     MOVE BANONY    F2NONY
     C                     MOVE BANKOJ    F2NKOJ
     C                     MOVE BANUKE    F2NUKE
     C* GET ABSOLUTE NUMBER
      *
     C                     Z-ADD*ZERO     @@WHT   72
     C           KEY2      CHAINFCEPL011             91
B02  C           *IN91     IFEQ '0'
     C           A2GSKD    ANDEQ*BLANK
     C*
     C                     MOVE A2ZETI    F2ZETI           ABSOLUTE #
     C                     Z-ADDA2KASI    @@WHT   72
     C           PNOHZ     IFGE A2DATE                     LOCATION
     C                     MOVE A2STRK    F2LOC1           NEW
     C                     MOVE A2STRT    F2LOC2
     C                     MOVE A2STRR    F2LOC3
     C                     MOVE A2STRD    F2LOC4
     C*
     C                     ELSE
     C                     MOVE A2KTRK    F2LOC1           OLD
     C                     MOVE A2KTRT    F2LOC2
     C                     MOVE A2KTRR    F2LOC3
     C                     MOVE A2KTRD    F2LOC4
     C                     ENDIF
     C                     ENDIF
      *
     C* GET ABSOLUTE NUMBER
     C           KEY2      CHAINFCEPL30              91
     C           *IN91     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C*
     C                     MOVE F3ZETI    F2ZETI           ABSOLUTE #
     C           PNOHZ     IFGE F3TYMD                     LOCATION
     C                     MOVE F3STRK    F2LOC1           NEW
     C                     MOVE F3STRT    F2LOC2
     C                     MOVE F3STRR    F2LOC3
     C                     MOVE F3STRD    F2LOC4
     C*
     C                     ELSE
     C                     MOVE F3KTRK    F2LOC1           OLD
     C                     MOVE F3KTRT    F2LOC2
     C                     MOVE F3KTRR    F2LOC3
     C                     MOVE F3KTRD    F2LOC4
     C                     END
     C                     ENDIF
      *
     C                     MOVE F2LOC1    EKLOC1
     C                     MOVE F2LOC2    EKLOC2
     C                     MOVE F2LOC3    EKLOC3
     C                     MOVE F2LOC4    EKLOC4
      *
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYS    60
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYS
     C                     END
     C                     END
      *
     C                     Z-ADDWSYS      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     F2SYOS                       R
     C           WSYS      MULT @@WHT     @@WHT2  92
     C           @@WHT2    DIV  1000      @@WHT3  50H
     C                     Z-ADD@@WHT3    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C           POQTY     CAT  'KG':1    F2WEIG    P                  R
     C                     MOVELPOQTY     @@WHT4  5                    R
      *
     C           @@WHT     MULT BASRYO    @GWHT   92
     C           @GWHT     DIV  1000      @@WHT5  50H
     C                     Z-ADD@@WHT5    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C           POQTY     CAT  'KG':1    E2WEIG    P                  R
     C                     MOVELPOQTY     @@WHT6  5                    R
      *
     C                     ADD  1         @D
     C                     MOVELWMHIN     MH@,@D
     C                     MOVELF2SYOS    PQ@,@D
     C                     Z-ADDBASRYO    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     TQ@,@D                       R
     C           BASRYO    DIV  WSYS      @@PAC   30
     C                     MVR            WRST    40
     C           WRST      IFNE *ZERO
     C                     ADD  1         @@PAC
     C                     END
     C                     Z-ADD@@PAC     PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     PA@,@D                       R
      ** MASTER LABEL
     C           PNONY     IFEQ '0521'
     C           PNONY     OREQ '2389'
TCHK4C           PNONY     OREQ '2390'
TCHK4C           PNONY     OREQ '2391'
TCHK4C           PNONY     OREQ '2392'
TCHK4C           PNONY     OREQ '2394'
TCHK4C           PNONY     OREQ '2395'
TCHK4C           PNONY     OREQ '2396'
TCHK4C           PNONY     OREQ '2397'
TCHK4C           PNONY     OREQ '2398'
TCHK4C           PNONY     OREQ '2399'
      *
     C                     MOVEL@ADR1     E2TAD1
     C                     MOVEL@ADR2     E2TAD2
     C                     MOVEL@ADR3     E2TAD3
     C                     MOVEL@ADR11    E2FAD1
     C                     MOVEL@ADR22    E2FAD2
     C                     MOVEL@ADR33    E2FAD3
     C                     MOVEL@ADR44    E2FAD4
     C                     MOVEL@DOCK     E2PLNT
     C                     MOVEL'GM'      E2CNAM
      *
     C                     MOVELWMHIN     E2MHN1
     C                     MOVE F2SYOS    E2PQY1
     C                     MOVE TQ@,@D    E2TQY1                       R
     C                     MOVE PA@,@D    E2PAC1                       R
     C                     MOVELWW11      E2MHND                       R
      *
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    E2SERL
     C                     MOVELPNONY     E2SERL
     C                     MOVE '6J'      @DUN1
     C                     MOVE N3NMBR    @DUN3
     C                     MOVEL@DUN      E2LCPL
     C                     MOVE *BLANK    @DX7
     C           'P'       CAT  WMHIN:0   @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'Q':0     @DX7      P
     C           @DX7      CAT  F2SYOS:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  E2TQY1:0  @DX7      P
     C           @DX7      CAT  'PL':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  E2PAC1:0  @DX7      P
     C           @DX7      CAT  'PK':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  @@WHT6:0  @DX7      P
     C           @DX7      CAT  'GT':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C*********  @DX7      CAT  '6J':0    @DX7      P
     C           @DX7      CAT  E2LCPL:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           WW11      IFNE *BLANK
     C           @DX7      CAT  '20L':0   @DX7      P
     C           @DX7      CAT  WW11:0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C                     ENDIF
     C           @DX7      CAT  '21L':0   @DX7      P
     C           @DX7      CAT  E2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'K':0     @DX7      P
     C           @DX7      CAT  BAODRN:0  @DX7      P
     C           AESBAN    IFNE *BLANK
     C           AESBAN    ANDNE'0000'
     C           @DX7      CAT  '15K':0   @DX7      P
     C           @DX7      CAT  AESBAN:0  @DX7      P
     C                     ENDIF
     C           @DX7      CAT  @HX4:0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C                     MOVEL@DX       E22DBR
      *
     C                     WRITEAB#WP2E1
      *
JW5  C                     MOVEL'AB#WP2E 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     ENDIF
     C*
B1   C           *IN88     IFEQ '1'
     C* USER SELECTED NUMBER OF LABEL
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C*
     C           1         DO   Q
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    F2SERL
     C                     MOVELPNONY     F2SERL
      *
     C                     EXSR #PP70
     C                     MOVE '1J'      @DUN1
     C                     MOVE N3NMBR    @DUN3
     C                     MOVEL@DUN      F2LCPL
     C                     ADD  @@WHT3    @TWGHT
      *
     C                     MOVE *BLANK    @DX7
     C           'P'       CAT  WMHIN:0   @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'Q':0     @DX7      P
     C           @DX7      CAT  F2SYOS:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  F2LCPL:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '21L':0   @DX7      P
     C           @DX7      CAT  F2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  @@WHT4:0  @DX7      P
     C           @DX7      CAT  'GT':0    @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C                     MOVEL@DX       F22DBR
     C                     WRITEAB#WP2F1
      *
JW5  C                     MOVEL'AB#WP2F 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     END
     C                     GOTO #READ9
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     GOTO #READ9
     C                     END
     C*
E2   C                     END
E1   C                     END
     C*
     C* USER ONLY MARKED
     C           BASRYO    DIV  WSYS      Q
     C                     MVR            WRST    40
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    F2SERL
     C                     MOVELPNONY     F2SERL
     C                     MOVE '1J'      @DUN1
     C                     MOVE N3NMBR    @DUN3
     C                     MOVEL@DUN      F2LCPL
     C                     ADD  @@WHT3    @TWGHT
      *
     C                     MOVE *BLANK    @DX7
     C           'P'       CAT  WMHIN:0   @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'Q':0     @DX7      P
     C           @DX7      CAT  F2SYOS:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  F2LCPL:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '21L':0   @DX7      P
     C           @DX7      CAT  F2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  @@WHT4:0  @DX7      P
     C           @DX7      CAT  'GT':0    @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C                     MOVEL@DX       F22DBR
      *
     C                     WRITEAB#WP2F1
      *
JW5  C                     MOVEL'AB#WP2F 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     EXSR #PP70
     C                     END
      *
     C           #READ9    TAG
     C  N88      KEY1      READEAB#PL131                 93
     C   88      KEY6      READEAB#PL131                 93
E01  C                     END
      ** MIXED  LABEL(DMAX)
     C           @@CNT     IFGT *ZERO
     C           PNONY     ANDEQ'0590'
      *
     C                     MOVEL@ADR1     E2TAD1
     C                     MOVEL@ADR2     E2TAD2
     C                     MOVEL@ADR3     E2TAD3
     C                     MOVEL@ADR11    E2FAD1
     C                     MOVEL@ADR22    E2FAD2
     C                     MOVEL@ADR33    E2FAD3
     C                     MOVEL@ADR44    E2FAD4
     C                     MOVEL'W100'    E2PLNT
     C                     MOVEL'DMAX'    E2CNAM
      *
      *
     C                     Z-ADD@TWGHT    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     E2WEIG                       R
      *
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    E2SERL
     C                     MOVELPNONY     E2SERL
     C                     MOVE '5J'      @DUN1
     C                     MOVE N3NMBR    @DUN3
     C                     MOVEL@DUN      E2LCPL
     C                     MOVE *BLANK    @DX7
     C           E2LCPL    CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  E2WEIG:0  @DX7      P
     C           @DX7      CAT  'GT':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '21L':0   @DX7      P
     C           @DX7      CAT  E2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
      *
     C           1         DO   8         @D
     C           MHN,@D    IFNE *BLANK
     C           @DX7      CAT  '06':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'P':0     @DX7      P
     C           @DX7      CAT  MHN,@D:0  @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  TQY,@D:0  @DX7      P
     C           @DX7      CAT  'PL':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  PAC,@D:0  @DX7      P
     C           @DX7      CAT  'PK':0    @DX7      P
     C           @DX7      CAT  @HX6:0    @DX7      P
     C           @DX7      CAT  'Q':0     @DX7      P
     C           @DX7      CAT  PQY,@D:0  @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
     C                     ENDIF
     C                     ENDDO
      *
     C           @DX7      CAT  @HX7:0    @DX7      P
     C                     MOVEL@DX       E22DBR
     C                     MOVEAPA@,1     PAC
     C                     MOVEAMH@,1     MHN
     C                     MOVEATQ@,1     TQY
     C                     MOVEAPQ@,1     PQY
      *
     C                     WRITEAB#WP2E1
      *
JW5  C                     MOVEL'AB#WP2E 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C           MH@,9     IFNE *BLANK
     C                     MOVE *BLANK    PAC
     C                     MOVE *BLANK    MHN
     C                     MOVE *BLANK    TQY
     C                     MOVE *BLANK    PQY
      *
     C                     MOVEAPA@,9     PAC
     C                     MOVEAMH@,9     MHN
     C                     MOVEATQ@,9     TQY
     C                     MOVEAPQ@,9     PQY
     C                     WRITEAB#WP2E1
      *
JW5  C                     MOVEL'AB#WP2E 'IXWRKF    P
.    C                     EXSR #XP01
      *
     C                     ENDIF
      *
     C                     ENDIF
     C*
     C                     ENDSR
     C***********************************************************
      *  SET FIELDS FOR AB#PP70
     C***********************************************************
     C           #PP70     BEGSR
      *
     C***********          CLEARAB#PP701
     C                     Z-ADD*YEAR     EKKOYY
     C                     Z-ADD*MONTH    EKKOMM
     C                     Z-ADD*DAY      EKKODD
     C                     TIME           @@TIM
     C                     MOVE @@HH      EKKOHH
     C                     MOVE @@MM      EKKOMN
     C                     MOVEL#USER     EKKOME
     C                     MOVE BANONY    EKNONY
     C                     MOVE BANKOJ    EKNKOJ
     C                     MOVE BANUKE    EKNUKE
     C                     MOVE F3ZETI    EKZETI
     C           F3ZETI    IFEQ *BLANK
     C                     MOVE A2ZETI    EKZETI
     C                     ENDIF
      *
     C                     MOVE WSYS      EKSYOS
     C                     MOVE BAODRN    EKODRN
     C                     MOVE BASHN1    EKSHN1
     C                     MOVE BASHN2    EKSHN2
     C                     MOVE BASHN3    EKSHN3
     C                     MOVE BANOYY    EKNOYY
     C                     MOVE BANOMM    EKNOMM
     C                     MOVE BANODD    EKNODD
     C********             Z-ADD@@RCD     EKRCNO
     C                     Z-ADDBATOKU    EKTOKU
     C                     MOVELBAMHN1    EKMHN1
     C                     MOVELBAMHN2    EKMHN2
     C                     MOVELBAMHN3    EKMHN3
     C                     MOVELBAMHN4    EKMHN4
     C                     MOVE BANOBN    EKNOBN
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELPNONY     EKSERL
     C                     Z-ADDBADEYY    EKRLYY
     C                     Z-ADDBADEMM    EKRLMM
     C                     Z-ADDBADEDD    EKRLDD
     C                     WRITEAB#PP701
TCHK2C*
TCHK2C           K#PL7@    KLIST
TCHK2C                     KFLD           EKNOYY
TCHK2C                     KFLD           EKNOMM
TCHK2C                     KFLD           EKNODD
TCHK2C                     KFLD           EKTOKU
TCHK2C                     KFLD           K#NONY  40
TCHK2C                     KFLD           EKNKOJ
TCHK2C                     KFLD           EKNUKE
TCHK2C                     KFLD           K#NOBN  20
TCHK2C                     KFLD           EKRLYY
TCHK2C                     KFLD           EKRLMM
TCHK2C                     KFLD           EKRLDD
TCHK2C                     KFLD           K#ODRN 10
TCHK2C                     MOVELEKNONY    K#NONY
TCHK2C                     MOVELEKNOBN    K#NOBN
TCHK2C                     MOVELEKODRN    K#ODRN
TCHK2C           K#PL7@    CHAINAB#PL75R             81
TCHK2C           *IN81     IFEQ *ON
JW   C           *IN81     OREQ *OFF
JW   C           PUSKJY    ANDEQ'D'
TCHK2C                     MOVEL*BLANK    K#ODRN
TCHK2C           K#PL7@    CHAINAB#PL75R             81
TCHK2C                     END
TCHK2C*
TCHK2C           *IN81     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
TCHK2C*
TCHK2C                     Z-ADD*DATE     PULPDT
TCHK2C                     Z-ADD*DATE     PUKODT
TCHK2C                     TIME           PUKOTN
TCHK2C                     MOVEL#USER     PUKOME
TCHK2C                     UPDATAB#PL75R
TCHK2C*
TCHK2C           K#PL7@    CHAINAB#PL78              82
TCHK2C           *IN82     IFEQ *OFF
TCHK2C           P8SKJY    ANDEQ*BLANK
TCHK2C                     Z-ADD*DATE     P8KODT
TCHK2C                     TIME           P8KOTM
TCHK2C                     MOVEL#USER     P8KONM
TCHK2C           P8LPDT    IFEQ *ZERO
TCHK2C                     Z-ADD*DATE     P8LPDT
TCHK2C                     TIME           P8LPTM
TCHK2C                     MOVEL#USER     P8LPNM
TCHK2C                     END
TCHK2C                     UPDATAB#PP781
JW    * LOG
 .   C           P8KODT    IFNE SVKODT
 .   C           P8KOTM    ORNE SVKOTM
 .   C                     MOVEL#PGM      P8LPPG
 .   C                     MOVEL'AB#RSN'  P8KOPG    P
 .   C                     WRITEAB#PP78R
 .   C                     Z-ADDP8KODT    SVKODT
 .   C                     Z-ADDP8KOTM    SVKOTM
JW   C                     ENDIF
      *
TCHK2C                     END
TCHK2C*
TCHK2C                     END
TCHK2C*
      *
     C                     ENDSR
      *================================================================
      *  ..LABEL DATA ISSUE LOG                            *
      *================================================================
JW5  C           #XP01     BEGSR                                  XXXX
 V   C                     Z-ADDTODAY     IXKOHZ           TODAY
     C                     TIME           IXKOTM           NOW
     C                     MOVEL#USER     IXKOUS
     C                     MOVEL#WSID     IXKOWS
     C                     MOVEL#PGM      IXKOPG
      *
     C                     MOVELBATOKU    IXTOKU           CUSTOMER
     C                     MOVELBANONY    IXNONY           DELIVERY
     C                     MOVELBANKOJ    IXNKOJ           FACTORY
     C                     MOVELBANUKE    IXNUKE           DOCK
     C                     MOVELBAODRN    IXODRN           ORDER #
     C                     MOVE N3NMBR    IXSERL           SERIAL NUMBER
     C                     MOVELPNONY     IXSERL
     C                     Z-ADDBANOHZ    IXDEDT           INVOICE DATE
     C                     MOVE BANOBN    IXNOBN           INVOICE BIN
     C                     MOVELD@BAR     IXPL#
      *
JW5  C                     MOVELWMHIN     IXMHIN
 .   C                     MOVELBASHIN    IXSHIN
 .   C                     MOVELBAINVN    IXINVN
 .   C                     MOVELBAHPOS    IXHPOS
 .   C                     MOVELBAROUT    IXROUT
 .   C                     Z-ADDBASRYO    IXSRYO
 .   C                     Z-ADDBASYOS    IXSYOS
JW5  C                     Z-ADDBAUSYS    IXUSYS
      *
     C                     WRITEAB#XP1A1
      *
JW5  C                     ENDSR
     C***********************************************************
     C* @CLRS:CLEAR SUB FILE
     C***********************************************************
     C           @CLRS     BEGSR
     C*
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C*
     C                     MOVE '1'       WKDSP
     C*
     C                     ENDSR
     C***********************************************************
     C* @CLRK:CLEAR KEY SCREEM
     C***********************************************************
     C*          @CLRK     BEGSR
     C*
     C*                    ENDSR
     C***********************************************************
     C* @END:
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
** ER(60) .........2.........3.........4.........5.........6
E-01 ENTER DELIVERY CODE                                       1
E-02 ENTER FACTORY CODE                                        2
E-03 ENTER DOCK CODE                                           3
E-04 ENTER SHIP DATE                                           4
E-05 DATE IS INCORECT                                          5
E-06 ENTER BIN                                                 6
E-07 ENTER BOTH SERIAL# FROM AND SERIAL# TO                    7
E-08 PLEASE MARK AT LEAST 1 OPTION                             8
E-09 THIS FROM,TO IS ONLY FOR ARVIN SANGO                      9
E-10 THIS FROM,TO IS ONLY FOR TRW-KOYO                        10
E-11 THIS FROM,TO IS ONLY FOR OTHERS                          11
E-12 NO DATA IN ORDER FILE(AB#PP10)                           12
E-13 YOU CAN NOT USE F7(DETAIL) KEY WITH SERIAL#              13
E-14 DO NOT USE # OF LABELS FOR ASI. PLEASE USE SERIAL#       14
USE HONDA MENU!                                               15
TARGET DATA NOT FOUND!                                        16
PRESS F5 TO PRINT LABELS...                                   17
ENTER BARCODE!                                                18
                                                              19
                                                              20
** NAM
INDIANA AUTOMOTIVE F
**
CLRPFM AB#WP2Q
** MST
MASTER LABEL
**
ABCDEFGHIJKL
** MON
JAN
FEB
MAR
APR
MAY
JUN
JUL
AUG
SEP
OCT
NOV
DEC
