     H            Y
      ** AB#R5C **********************************************
      *  LONG KANBAN#/RELEASE# ENTRY                         *
      ********************************* AB#R5C ***************
     FAB#PW5C CF  E                    WORKSTN
     FAB#PP85 UF  E           K        DISK                      A
     FGADPL24 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
      *-----------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   7 70
      *-----------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*------------------------------------------------------
     C* INITIALIZE
     C*------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVEL'01'      W@ID    2
     C           K#GAD     KLIST
     C                     KFLD           D@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           D@NUKE
     C           K#85      KLIST
     C                     KFLD           D@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           D@NUKE
     C                     KFLD           D@MHN1
     C                     KFLD           D@MHN2
     C                     KFLD           D@MHN3
     C                     KFLD           D@MHN4
     C           K#85X     KLIST
     C                     KFLD           D@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           D@NUKE
     C                     KFLD           D@MHN1
     C                     KFLD           D@MHN2
     C                     KFLD           D@MHN3
     C                     KFLD           D@MHN4
     C                     KFLD           K@YMD
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* 1ST SCREEN
     C*------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
      * F10: INQ
     C           *INKJ     WHEQ *ON
     C                     CALL 'AB#R5CB'
      * ENTER
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET
     C                     MOVE '02'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* CHECK
     C*------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      * CUSTOMER
     C           D@TOKU    IFEQ 0
     C                     MOVEA'1'       *IN,61
     C                     MOVE *ON       *IN99
     C                     MOVELMSG,4     D@MSG
     C                     GOTO XCHK1
     C                     ENDIF
      * SHIP TO
     C           D@NONY    IFEQ 0
     C                     MOVEA'1'       *IN,62
     C                     MOVE *ON       *IN99
     C                     MOVELMSG,5     D@MSG
     C                     GOTO XCHK1
     C                     ENDIF
      * SHIPPING MASTER
     C           K#GAD     CHAINGADPL24              90
     C           *IN90     IFEQ *ON
     C                     MOVEA'111'     *IN,61
     C                     MOVE *ON       *IN99
     C                     MOVELMSG,1     D@MSG
     C                     GOTO XCHK1
     C                     ENDIF
      * DATE
     C           D@VALD    IFEQ 0
     C                     MOVE *ON       *IN65
     C  N99                MOVELMSG,6     D@MSG
     C                     MOVE *ON       *IN99
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     Z-ADDD@VALD    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN65
     C  N99                MOVELMSG,3     D@MSG
     C                     MOVE *ON       *IN99
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           D@MHN1    IFEQ *BLANK
     C                     MOVE *ON       *IN64
     C  N99                MOVELMSG,2     D@MSG
     C                     MOVE *ON       *IN99
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
     C*------------------------------------------------------
     C* CLEAR
     C*------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVEA'00000000'*IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* SET DATA
     C*------------------------------------------------------
     C           #SET      BEGSR
      *
     C           K#85      SETGTAB#PP85
     C           K#85      REDPEAB#PP85             N    90
     C           *IN90     IFEQ *OFF
     C                     MOVELA5SBAN    D@KANB    P
     C                     MOVELA5RELS    D@RELS    P
     C                     Z-ADDA5DATE    @@VALD  80
     C                     ELSE
     C                     MOVE *BLANK    D@KANB
     C                     MOVE *BLANK    D@RELS
     C                     Z-ADD*ZERO     @@VALD  80
     C                     ENDIF
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* 2ND SCREEN
     C*------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP02
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C           *INKL     WHEQ *ON
     C                     EXSR #CLR
     C                     MOVE '01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVE '01'      W@ID
     C                     MOVE *BLANK    D@MHN1
     C                     MOVE *BLANK    D@MHN2
     C                     MOVE *BLANK    D@MHN3
     C                     MOVE *BLANK    D@MHN4
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* CHECK
     C*------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     EXSR #CLR
     C           D@KANB    IFEQ *BLANK
     C           D@RELS    ANDEQ*BLANK
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
     C*------------------------------------------------------
     C* UPDATE
     C*------------------------------------------------------
     C           #UPD      BEGSR
      *
     C           @@VALD    IFGT D@VALD
     C                     Z-ADD@@VALD    K@YMD
     C                     ELSE
     C                     Z-ADDD@VALD    K@YMD
     C                     ENDIF
      *
     C           K#85X     CHAINAB#PP85              90
     C   90                CLEARAB#PP851
      *
     C                     MOVEL#PGM      A5UPGM
     C                     MOVEL#USER     A5KOME
     C                     MOVEL#WSID     A5UPWS
     C                     Z-ADD*DATE     A5KODT
     C                     TIME           A5KOTM
     C                     Z-ADDD@TOKU    A5TOKU
     C                     Z-ADDD@NONY    A5NONY
     C                     MOVELD@NUKE    A5NUKE
     C                     MOVE D@MHN1    A5MHN1
     C                     MOVE D@MHN2    A5MHN2
     C                     MOVE D@MHN3    A5MHN3
     C                     MOVE D@MHN4    A5MHN4
     C                     MOVELD@KANB    A5SBAN
     C                     MOVELD@RELS    A5RELS
     C                     Z-ADDK@YMD     A5DATE
     C   90                WRITEAB#PP851
     C  N90                UPDATAB#PP851
      *
     C                     ENDSR
      *------------------------------------------------------
** CMD
  F1:END    F10:INQ
  F1:END    F5:UPDATE    F12:GO BACK
** MSG(70A) .......2.........3.........4.........5.........6.........7
  SHIPPING MASTER NOT FOUND !                                          1
  ENTER CUSTOMER PART# !                                               2
  DATE IS INVALID !                                                    3
  ENTER CUSTOMER !                                                     4
  ENTER SHIP TO !                                                      5
  ENTER VALID DATE !                                                   6
                                                                       7
