     H            Y.
     F** AB#RFN ************************************************
     F*  EDI PLANT&DOCK MATCHING WITH MASTER                   *
     F*  N.HYOTO 00.11.15                                      *
     F*  N.HYOTO 01.05.24                                      *
     F*  H.AMANO 01.08.07  CHECK THE VALID DATE OF THR ROUTE   *
     F*                    MASTER FILE.                        *
     F*  H.AMANO 02.12.18  ADD ERROR MESSAGE                   *
     F*                                                        *
     F*                                                        *
     F*  *IN90=1 NOT EXIST ABFDP01(ROUTE MASTER)               *
     F*  *IN91=1 NOT EXIST ABFAP01(EDI KEY DATA)               *
     F*  *IN92=1 NOT EXIST ABF9P01(ADDRESS MASTER)             *
     F*  *IN93=1 NOT EXIST GADPL11(OUTGOING MASTER)            *
     F************************************ AB#RFN **************
     FABFDP01 IF  E           K        DISK
     FABFAP01 IF  E           K        DISK
     FABF9P01 IF  E           K        DISK
     FABF1L01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F****************************************************
     E                    MSG     1   3 35
     E****************************************************
     I* PLANT(5 A)
     I            DS
     I                                        1   5 K11
     I                                        1   5 CFDOCK
     I                                        5   5 WWWWW
     I* TIME
     I            DS
     I                                        1  120WTMDT
     I                                        1   60WTIME
     I                                        7  120WDATE
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
     C***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           PD      1
     C                     MOVE *BLANK    PD
     C* ABFAP01
     C           KEY1      KLIST
     C                     KFLD           K11              PLANT
     C                     KFLD           CFDOC2           DOCK(RECIVING)
     C* GADPL11
     C           KEY2      KLIST
     C                     KFLD           K21     40       TOKU
     C                     KFLD           K22     40       NONY
     C                     KFLD           K23     1        NKOJ
     C                     KFLD           CFDOC2           NUKE
     C           KEY3      KLIST
     C                     KFLD           STID    5
     C                     KFLD           CFDOC2           DOCK(RECIVING)
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C***********************************************************
     C* INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     TIME           WTMDT
     C                     SETON                     OF
     C                     MOVE 'A'       WWWWW
     C                     Z-ADD5149      K21
     C                     MOVE '0'       K23
     C*
     C                     ENDSR
     C***********************************************************
     C* MAIN
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C           *LOVAL    SETLLABFAP01
     C                     READ ABFAP01                  90
B01  C           *IN90     DOWEQ'0'
      *
     C           CFDLCD    IFEQ *BLANK
     C           CFDOCK    ANDNE*BLANK
     C           CFPART    ANDNE*BLANK
     C           CFDOC2    ANDNE*BLANK
     C*
     C           KEY1      SETLLABFDP01
     C           *IN91     DOUEQ*ON
     C           KEY1      READEABFDP01                  91
     C           *IN91     IFEQ *OFF
%0001C           QASKJY    IFEQ 'D'
%0001C           QASKHZ    ANDLE*DATE
%0001C                     ITER                            DOCK CODE
     C                     ENDIF
     C           QAEFHZ    IFGT *DATE
%0001C                     ITER                            DOCK CODE
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *BLANK    W@MSG 104
B02  C           *IN91     IFEQ '1'
      *
     C           CFDOCK    CAT  'A':0     STID
     C           KEY3      CHAINABF1L01              95
     C           *IN95     IFEQ *OFF
     C*
     C           K11       CHAINABF9P011             92
B03  C           *IN92     IFEQ '1'
     C                     MOVELMSG,1     W@MSG     P
     C                     ENDIF
      *
     C                     MOVE F9DELY    K22
     C           KEY2      CHAINGADPL111             93
B04  C           *IN93     IFEQ '1'
     C           W@MSG     CAT  MSG,2:1   W@MSG     P
     C                     ENDIF
      *
TEST C           KEY1      CHAINABFDP01              96
TEST C           *IN96     IFEQ '1'
     C           W@MSG     CAT  MSG,3:1   W@MSG     P
TEST C                     ENDIF
      *
     C           W@MSG     IFNE *BLANK
     C   OF                EXCPT#HED1
     C   OF                EXCPT#HED2
     C   OF                SETOF                     OF
     C                     EXCPT#DTL1
     C                     MOVE '1'       PD
     C                     ENDIF
     C                     END
     C                     END
     C                     ENDIF
     C*
     C                     READ ABFAP01                  90
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* END
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
     C********************************************************
     OQPRINT  E    2           #HED1
     O       OR        OF
     O                                    8 'AB#RFN'
     O                                   32 'FORD PLANT & DOCK '
     O                                   48 'NEW REPORT'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E 1              #HED2
     O       OR        OF
     O                                    6 'PLANT'
     O                                   11 'DOCK'
     O                                   19 'PART'
     O*
     O        E 1              #DTL1
     O                         CFDOCK     5
     O                         CFDOC2    11
     O                         CFPART    27
     O                         W@MSG    132
**
NO DATA IN FORD ADDRESS M/F:
NO DATA IN 'SHIP TO' M/F:
NO DATA IN FORD ROUTE M/F:
