     H            Y.
     F** AB#R6S **********************************
     F*  DOWNLOAD ACCT RECEIVABLE DATA TO CSV    *
     F*  JW    2021.11.16                        *
     F********************************************
     FAB#PL6E IF  E           K        DISK
     FAB#WP6A O   E                    DISK
      ********************************************
     E                    HAM     1  15  5
     E                    HD      1  15 11
     I            DS
     I                                        1   8 WKYMD1
     I                                        1   4 WKYY1
     I                                        5   6 WKMM1
     I                                        7   8 WKDD1
     I            DS
     I                                        1  10 WKYMD2
     I                                        1   4 WKYY2
     I                                        5   5 XSL1
     I                                        6   7 WKMM2
     I                                        8   8 XSL2
     I                                        9  10 WKDD2
     I            DS
     I                                        1   6 WKHFS1
     I                                        1   2 WKHH1
     I                                        3   4 WKFF1
     I                                        5   6 WKSS1
     I            DS
     I                                        1   8 WKHFS2
     I                                        1   2 WKHH2
     I                                        3   3 XCL1
     I                                        4   5 WKFF2
     I                                        6   6 XCL2
     I                                        7   8 WKSS2
     I            DS
     I                                        1   80APRCHZ
     I                                        1   40APRCYY
     I                                        5   60APRCMM
     I                                        7   80APRCDD
     I            DS
     I                                        1  11 APPAR
     I                                        1   5 APPAR1
     I                                        6   6 XHP1
     I                                        7  11 APPAR2
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C****************************************************
     C                     EXSR #INIT
      *
     C                     SELEC
      *
     C           P@CUST    WHEQ 'HAM  '
     C           1         DO   15        IX      20
     C           HAM,IX    IFEQ *BLANK
     C                     LEAVE
     C                     ELSE
     C                     MOVELHAM,IX    K@CUST
     C                     EXSR #SET
     C                     ENDIF
     C                     ENDDO
      *
     C           P@CUST    WHNE 'HAM  '
     C                     MOVELP@CUST    K@CUST
     C                     EXSR #SET
      *
     C                     ENDSL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
      * OUT
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C           K#KEY     SETLLAB#PL6E
     C                     DO   *HIVAL
     C           K#KEY     READEAB#PL6E                  98
     C   98                LEAVE
      *
     C           APPRTM    IFNE @@TIME
     C                     ITER
     C                     END
      *
     C           RCNT      IFEQ 0
     C                     EXSR #HDR
     C                     ENDIF
      *
     C                     ADD  1         RCNT
     C                     EXSR #DTL
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
      * OUTPUT HEADER
      *--------------------------------------------------
     C           #HDR      BEGSR
      *
     C                     CLEARAB#WP6A1
     C                     MOVELHD,1      WPCNAM
     C                     MOVELHD,2      WPPRDT
     C                     MOVELHD,3      WPPRTM
     C                     MOVELHD,4      WPCARD
     C                     MOVELHD,5      WPPAR1
     C                     MOVELHD,6      WPCLRC
     C                     MOVELHD,7      WPIQTY
     C                     MOVELHD,8      WPUNIT
     C                     MOVELHD,9      WPTAMT
     C                     MOVELHD,10     WPRCHZ
     C                     MOVELHD,11     WPDOCK
     C                     MOVELHD,12     WPMANI
     C                     MOVELHD,13     WPMAMT
     C                     WRITEAB#WP6A1
      *
     C                     ENDSR
      *--------------------------------------------------
      * OUTPUT DETAIL
      *--------------------------------------------------
     C           #DTL      BEGSR
      *
     C                     CLEARAB#WP6A1
     C                     MOVELAPCNAM    WPCNAM
      *
     C                     MOVELAPPRDT    WKYMD1
     C                     MOVELWKYY1     WKYY2
     C                     MOVELWKMM1     WKMM2
     C                     MOVELWKDD1     WKDD2
     C                     MOVELWKYMD2    WPPRDT
      *
     C                     MOVELAPPRTM    WKHFS1
     C                     MOVELWKHH1     WKHH2
     C                     MOVELWKFF1     WKFF2
     C                     MOVELWKSS1     WKSS2
     C                     MOVELWKHFS2    WPPRTM
      *
     C                     MOVELAPCARD    WPCARD
     C                     MOVELAPPAR     WPPAR1
      *
     C                     MOVELAPCLRC    $IN2      P
     C                     MOVEL'02'      $LONG
     C                     CALL 'UTLR32A'
     C                     PARM           $IN2   10
     C                     PARM           $LONG   2
     C                     PARM           $OUT   11
     C                     MOVEL$OUT      WPCLRC
      *
     C                     MOVELAPIQTY    WPIQTY
      *
     C                     Z-ADDAPUNIT    $IN
     C                     CALL 'UTLR64'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     PARM           $RTN    1
     C                     MOVEL$TRUE     WPUNIT
      *
     C                     Z-ADDAPTAMT    $IN
     C                     CALL 'UTLR64'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     PARM           $RTN    1
     C                     MOVEL$TRUE     WPTAMT
      *
     C                     MOVELAPRCHZ    WKYMD1
     C                     MOVELWKYY1     WKYY2
     C                     MOVELWKMM1     WKMM2
     C                     MOVELWKDD1     WKDD2
     C                     MOVELWKYMD2    WPRCHZ
      *
     C                     MOVELAPDOCK    $IN2      P
     C                     MOVEL'02'      $LONG
     C                     CALL 'UTLR32A'
     C                     PARM           $IN2   10
     C                     PARM           $LONG   2
     C                     PARM           $OUT   11
     C                     MOVEL$OUT      WPDOCK
      *
     C                     MOVELAPMANI    WPMANI
      *
     C                     Z-ADDAPMAMT    $IN
     C                     CALL 'UTLR64'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     PARM           $RTN    1
     C                     MOVEL$TRUE     WPMAMT
      *
     C                     WRITEAB#WP6A1
      *
     C                     ENDSR
      *--------------------------------------------------
      * INITIAL SET
      *--------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@CUST  5
     C                     PARM           P@YMD   8
     C                     PARM           P@TIME  6
      *
     C           K#KEY     KLIST
     C                     KFLD           K@CUST  5
     C                     KFLD           K@DATE  80
      *
     C                     MOVELP@YMD     K@DATE
     C                     MOVELP@TIME    @@TIME  60
     C                     Z-ADD0         RCNT    60
      *
     C                     MOVE '-'       XHP1
     C                     MOVE '/'       XSL1
     C                     MOVE '/'       XSL2
     C                     MOVE ':'       XCL1
     C                     MOVE ':'       XCL2
      *
     C                     ENDSR
      ***************************************************
** HAM (5A)
AEP             1
AHM             2
ELP             3
HAM             4
HCM             5
HMA             6
HMI             7
HSP             8
HTM             9
IPS            10
MAP            11
               12
               13
               14
               15
** HD (11A)
CUST_NAME       1
PROC_DATE       2
PROC_TIME       3
CARD#           4
PART#           5
COLOR           6
INVOICE_QTY     7
UNIT_PRICE      8
AMOUNT          9
SHIP_DATE      10
DOCK           11
MANIFEST#      12
MONTHLY_AMT    13
               14
               15
