     H            Y.
     FAB#WPS3 IP  E           K        DISK
     FAB#WPS4 O   E                    DISK
     IAB#WPS31
     I                                              J#HIN1L1
     I                                              J#HIN2L1
     I                                              J#HIN3L1
     I                                              J#NOYYL1
     I                                              J#NOMML1
     I                                              J#NODDL1
     I                                              J#NOTML1
     I                                              J#NOBIL1
     I                                              J#NONYL1
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         @TOTL   90
     C                     END
      *
     C           J#HIN1    IFEQ '90119'
     C           J#HIN2    ANDEQ'A0302'
     C           J#HIN3    ANDEQ'  '
     C                     Z-ADD0         SAKA    40
     C                     END
      *
     C                     ADD  J#SRYO    @TOTL
      *
     CL1                   Z-ADD@TOTL     J#SRYO
     CL1                   WRITEAB#WPS41
