     H            Y.
     ** AB#R0B *******************************
     *  ..EDI FRS ORDER LIST..               *
     *  I-HASADA      97.06.19               *
     *   ADDING %0001 A.MAMIYA 2000.10.23    *
     *
     *   2002/06/24  TCH
     ******************************* AB#R0B **
%0001FAB#WP202IP  F     256            DISK
     FGADPL11 IF  E           K        DISK
     FAB#WP20 O   E                    DISK                      A
     FAB#WPGN O   E                    DISK                      A
     FAB#WPLG O   E                    DISK                      A
     FQPRINT2 O   F     132     OV     PRINTER                        UC
     E                    CMD     1   1 60
     IAB#WP202AA  01
     I                                        1   4 BASIRE
     I                                        5   5 BASIRK
     I                                        6   90BATOKU
     I                                       10  130BANONYL1
     I                                       14  14 BANKOJ
     I                                       15  18 BANUKE
     I                                       19  22 BASBAN
     I                                       23  42 BAMHIN
     I                                       23  27 BAMHN1
     I                                       28  32 BAMHN2
     I                                       33  37 BAMHN3          10
     I                                       38  42 BAMHN4          11
     I                                       43  500BANOHZ
     I                                       43  460BANOYY
     I                                       47  480BANOMM
     I                                       49  500BANODD
     I                                       51  60 BAODRN
     I                                       61  700BASRYO
     I                                       71  760BASYOS
     I                                       77  800BANOTM
     I                                       81  85 BASHN1
     I                                       86  90 BASHN2
     I                                       91  92 BASHN3
     I                                       97  98 BANOBN
     I                                      145 160 BAINVN
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      *
     C                     SETOF                     05
      *
     C           *IN06     IFEQ '0'
     C                     SETON                     0506
     C                     ENDIF
      *
     C           *INL1     IFEQ *ON
      *
     C                     CLEARAB#WPLG1
     C                     Z-ADDBATOKU    AWTOKU
     C                     Z-ADDBANONY    AWNONY
     C                     Z-ADD*DATE     AWDAT1
     C                     Z-ADDWTIME     AWTIM1
     C                     WRITEAB#WPLG1
      *
     C                     SETON                     05
     C                     SETOF                     02
     C           BANONY    IFEQ 0541
     C                     SETON                     02
     C                     END
     C           BANONY    IFEQ 0390
     C           BANONY    OREQ 3656
     C                     SETON                     03
     C                     END
      *
     C                     MOVEL*BLANK    W5KMEI 15
     C           K#GAD     CHAINGADPL11              20
     C  N20                MOVELB5KMEI    W5KMEI
     C                     END
      *
     C           BATOKU    IFEQ BANONY
     C                     MOVE BANKOJ    W1TKOJ
     C                     MOVE BANUKE    W1TUKE
     C                     ELSE
     C                     MOVE *BLANK    W1TKOJ
     C                     MOVE *BLANK    W1TUKE
     C                     END
      *
     C                     MOVE 'U'       W1USRI
     C                     MOVE 'K'       W1ODKE
     C                     MOVE *BLANK    W1TEIS
     C                     Z-ADDBATOKU    W1TOKU
     C                     Z-ADDBANONY    W1NONY
     C                     MOVE BANKOJ    W1NKOJ
     C                     MOVE BANUKE    W1NUKE
     C                     MOVE BAMHN1    W1UHN1
     C                     MOVE BAMHN2    W1UHN2
     C                     MOVE BAMHN3    W1UHN3
     C                     MOVE BAMHN4    W1UHN4
     C                     MOVE BASHN1    W1SHN1
     C                     MOVE BASHN2    W1SHN2
     C                     MOVE BASHN3    W1SHN3
     C                     MOVE *BLANK    W1KANR
     C                     MOVE BAODRN    W1ODNO
     C                     MOVE *BLANK    W1ODED
     C                     MOVE *BLANK    W1NOBN
     C                     MOVE 'C'       W1NOKB
     C                     Z-ADDBANOYY    W1NOYY
     C                     Z-ADDBANOMM    W1NOMM
     C                     Z-ADDBANODD    W1NODD
      ***
     C                     MOVE BANOBN    W1ODED
     C                     Z-ADD9         W1NOBI
     C                     MOVE *BLANK    W1SENO
     C                     Z-ADD0         W1TANK
     C                     MOVE *BLANK    W1TAKB
     C                     MOVE 'C'       W1SUTN
     C                     Z-ADD0         W1KING
     C                     Z-ADDBANOYY    W1JYRY
     C                     Z-ADDBANOMM    W1JYRM
     C                     Z-ADDBANODD    W1JYRD
     C                     MOVE '9'       W1JKKB
     C                     MOVE *BLANK    W1KENS
     C                     Z-ADD0         W1SEIY
     C                     Z-ADD0         W1SEIM
     C                     Z-ADD0         W1SEID
     C                     Z-ADD0         W1SIMY
     C                     Z-ADD0         W1SIMM
     C                     Z-ADD0         W1SIMD
     C                     MOVE *BLANK    W1JUNJ
     C                     MOVE *BLANK    W1MACH
     C                     Z-ADD0         W1MACY
     C                     Z-ADD0         W1MACM
     C                     Z-ADD0         W1MACD
     C                     Z-ADD0         W1GETU
     C                     MOVE *BLANK    W1KURK
     C                     MOVE BASBAN    W1SEBN
     C                     MOVE BAMHIN    W1UHIN
     C                     Z-ADD0         W1LTNO
     C                     Z-ADD0         W1PANO
     C                     MOVE *BLANK    W1MIKB
     C                     Z-ADD0         W1MIHK
     C                     Z-ADD0         W1MISU
     C                     MOVE *BLANK    W1STKB
     C                     Z-ADD0         W1RECN
     C                     Z-ADD0         W1URIY
     C                     Z-ADD0         W1URIM
     C                     Z-ADD0         W1URID
     C                     MOVE *BLANK    W1TKKB
     C                     MOVE *BLANK    W1TUKA
     C                     Z-ADD0         W1RATE
     C                     MOVE *BLANK    W1BANK
     C                     MOVE *BLANK    W1KOZN
     C                     Z-ADD0         W1PAYY
     C                     Z-ADD0         W1PAYM
     C                     Z-ADD0         W1PAYD
     C                     Z-ADD0         W1PKIN
     C                     Z-ADD0         W1SAGK
     C                     MOVE 'S'       W1SYBT
     C                     MOVE '4'       W1SOBT
     C                     MOVE '04'      W1GYOM
     C                     Z-ADDBASRYO    W1NOSU
     C                     Z-ADDBASYOS    W1SYUY
     C           BASYOS    IFEQ *ZERO
     C                     Z-ADDBASRYO    W1HAKO
     C*
     C                     ELSE
     C           BASRYO    DIV  BASYOS    W1HAKO
     C                     MVR            W1HK1   30
     C           W1HK1     IFNE 0
     C                     ADD  1         W1HAKO
     C                     END
      *
     C                     END
     C*
     C                     WRITEAB#WP201
      *
     C                     MOVE *BLANK    BAPRNT
     C                     Z-ADD*DATE     BADATE
     C                     Z-ADDWTIME     BATIME
     C                     WRITEAB#WPGN1
      *
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *--------------------------------------------------------
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C           K#GAD     KLIST
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
      *
     C                     TIME           WTIME   60
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT2
      *
     C                     ENDSR
      *--------------------------------------------------------
     OQPRINT2 H  102   05
     O       OR        OV
     O                                  131 '.....................'
     O        H  1     05
     O       OR        OV
     O                                  131 '.         .         .'
     O        H  1     05
     O       OR        OV
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        H  2     05
     O       OR        OV
     O                         #PGM       8
     O                      N20W5KMEI    27
     O                                   58 '**   EDI  FRS  ORDER'
     O                                   71 'LIST   **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE2 Z  108
     O                                  131 '.....................'
     O        H  1     05
     O       OR        OV
     O                                   53 'KANBAN'
     O        H  2     05
     O       OR        OV
     O                                   12 'PICK-UP DATE'
     O                                   17 'BIN'
     O                                   26 'SUPPLIER'
     O                                   36 'DELIVERY'
     O                                   44 'DOCK'
     O                                   53 'NUMBER'
     O                                   69 'USER PARTS NO'
     O                                   88 'QUANTITY'
     O                N02               100 'ORDER NO.'
     O                 02               101 'FRS NUMBER'
     O                                  116 'PICK-UP TIME'
     O        D  1     01
     O                         BANOHZ    11 '    .  .  '
     O                         BANOBN    17
     O                         BASIRE    24
     O                                   25 '-'
     O                         BASIRK    26
     O                         BANONY    34
     O                         BANUKE    44
     O                         BASBAN    52
     O                         BAMHN1    61
     O                                   62 '-'
     O                         BAMHN2    67
     O                N10                68 '-'
     O                         BAMHN3    73
     O                N11                74 '-'
     O                         BAMHN4    79
     O                         BASRYO1   88
     O                         BAODRN   101
     O                         BANOTM   113 '  :  '
     O                         BAINVN   132
      *
**
OVRPRTF FILE(QPRINT2) OUTQ(SAVEOUTQ) SAVE(*YES)
