     H            Y/
     ** AB#RAD ********************************************************
     *  SHIPMENT TOTAL                                                *
     ******************************************************** AB#RAA **
     FAB#PWAD CF  E                    WORKSTN
     FAB#PL06 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FGHCPL21 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    TTL     1   1 35
     E                    IT          9  5 0
     E                    KN          9  5 0
     E                    TOT         9  5 0
      *------------------------------------------------------------
     I            DS
     I                                        1   60K@YM
     I                                        1   40K@YY
     I                                        5   60K@MM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           K#FCE     KLIST
     C                     KFLD           B1SHN1
     C                     KFLD           B1SHN2
     C                     KFLD           B1SHN3
     C           K#KEY     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#AB      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD    20
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE *ALL'-'   @LIN  132
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #DSP01    BEGSR
      *-----------------------------------------------------
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------
     C                     MOVEA'00000000'*IN,61
     C                     MOVE *OFF      *IN99
      *
     C           D@YYMM    IFEQ *ZERO
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #OUT      BEGSR
      *-----------------------------------------------------
     C                     MOVE *OFF      *IN98
     C                     TIME           @@TIM   60
     C                     Z-ADDD@YYMM    K@YM
      *
     C           1         DO   31        X       30
      *
     C                     Z-ADDX         K@DD
     C                     MOVE *BLANK    @@SHN  12
     C                     Z-ADD*ZERO     @ITEM   50
     C                     Z-ADD*ZERO     @BOXT
     C                     Z-ADD*ZERO     IT
     C                     Z-ADD*ZERO     KN
     C           K#AB      SETLLAB#PL06
     C           *IN90     DOUEQ*ON
     C           K#AB      READEAB#PL06                  90
     C           *IN90     IFEQ *OFF
     C           B1SKJY    ANDEQ*BLANK
      *
      *
     C           B1SHIN    IFNE @@SHN
     C           @@SHN     IFNE *BLANK
     C                     EXSR #WRT
     C                     ENDIF
      *
     C           K#FCE     CHAINFCEPL01              91
     C           *IN91     IFEQ *ON
     C           B1SRYO    ORLT A2SSYS
     C           A2SSYS    OREQ 0
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         @ITEM
     C                     ENDIF
      *
     C                     MOVE B1SHIN    @@SHN
     C           B1SRYO    IFGE A2SSYS
     C           B1SRYO    DIV  A2SSYS    @@BOX   50
     C                     ADD  @@BOX     @BOXX   70
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @BOXX     IFNE *ZERO
     C                     EXSR #WRT
     C                     ENDIF
     C           @ITEM     IFGT *ZERO
     C                     EXSR #PRT
     C                     ENDIF
     C                     ADD  KN        TOT
     C                     ADD  @BOXT     @BTOT   70
      *
     C                     ENDDO
      *
     C           *IN98     IFEQ *ON
     C                     EXCPT@TOT
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #WRT      BEGSR
      *-----------------------------------------------------
     C*          @@QTY     DIV  A2SSYS    @BOX    50
     C                     ADD  @BOXX     @BOXT   60
      * PT
     C           K#KEY     SETLLAAPTL01
     C           *IN91     DOUEQ*ON
     C           K#KEY     READEAAPTL01                  91
     C           *IN91     IFEQ *OFF
     C           L5STYY    ANDEQ9999
     C           L5SKJY    ANDEQ*BLANK
     C                     ADD  1         IT,1
     C                     ADD  @BOXX     KN,1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * BZ
     C                     MOVE *OFF      *IN92
     C           K#KEY     SETGTGHCPL21
     C           *IN91     DOUEQ*ON
     C           K#KEY     REDPEGHCPL21                  91
     C           *IN91     IFEQ *OFF
      *
     C                     SELEC
     C           M7MSNO    WHEQ 'A01'
     C           M7MSNO    OREQ 'B01'
     C                     ADD  1         IT,3
     C                     ADD  @BOXX     KN,3
     C                     MOVE *ON       *IN92
     C           M7MSNO    WHEQ 'D01'
     C                     ADD  1         IT,4
     C                     ADD  @BOXX     KN,4
     C                     MOVE *ON       *IN92
     C           M7MSNO    WHEQ 'E01'
     C                     ADD  1         IT,5
     C                     ADD  @BOXX     KN,5
     C                     MOVE *ON       *IN92
     C           M7MSNO    WHEQ 'A10'
     C                     ADD  1         IT,6
     C                     ADD  @BOXX     KN,6
     C                     MOVE *ON       *IN92
     C           M7MSNO    WHEQ 'T01'
     C                     ADD  1         IT,7
     C                     ADD  @BOXX     KN,7
     C                     MOVE *ON       *IN92
     C           M7MSNO    WHEQ 'A21'
     C                     ADD  1         IT,8
     C                     ADD  @BOXX     KN,8
     C                     MOVE *ON       *IN92
     C                     ENDSL
      *
     C           M7MBMN    IFEQ 2255
     C           *IN92     ANDEQ*OFF
     C                     ADD  1         IT,9
     C                     ADD  @BOXX     KN,9
     C                     MOVE *ON       *IN92
     C                     ENDIF
      *
     C           *IN92     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @BOXX
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #PRT      BEGSR
      *-----------------------------------------------------
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
     C           @ITEM     SUB  IT,1      IT,2    50
     C           @BOXT     SUB  KN,1      KN,2    50
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *-----------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  100
     O                         @@TIM    109 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   02           @HED
     O                         TTL       70
     O        E   03           @HED
     O                         D@YYMM    10 '    /  '
     O        E   05           @HED
     O                                    4 'DATE'
     O                                   13 'TOTAL'
     O                                   25 'PT'
     O                                   37 'IAF'
     O                                   49 'BZ'
     O                                   61 'DC'
     O                                   73 'DCF'
     O                                   85 'JC'
     O                                   97 'TC'
     O                                  111 'SB/KRO'
     O                                  123 '3 BOND'
     O        E   06           @HED
     O                                    9 'ITEM'
     O                                   16 'BOXES'
     O                                   23 'ITEM'
     O                                   29 'BOXES'
     O                                   35 'ITEM'
     O                                   41 'BOXES'
     O                                   47 'ITEM'
     O                                   53 'BOXES'
     O                                   59 'ITEM'
     O                                   65 'BOXES'
     O                                   71 'ITEM'
     O                                   77 'BOXES'
     O                                   83 'ITEM'
     O                                   89 'BOXES'
     O                                   95 'ITEM'
     O                                  101 'BOXES'
     O                                  107 'ITEM'
     O                                  113 'BOXES'
     O                                  119 'ITEM'
     O                                  125 'BOXES'
     O        E   07           @HED
     O                         @LIN     132
     O        E 11             @DTL
     O                         K@DD  4    3
     O                         @ITEM 4    9
     O                         @BOXT 1   16
     O                         IT,1  4   23
     O                         KN,1  4   29
     O                         IT,2  4   35
     O                         KN,2  4   41
     O                         IT,3  4   47
     O                         KN,3  4   53
     O                         IT,4  4   59
     O                         KN,4  4   65
     O                         IT,5  4   71
     O                         KN,5  4   77
     O                         IT,6  4   83
     O                         KN,6  4   89
     O                         IT,7  4   95
     O                         KN,7  4  101
     O                         IT,8  4  107
     O                         KN,8  4  113
     O                         IT,9  4  119
     O                         KN,9  4  125
     O        E  1             @TOT
     O                         @LIN     132
     O        E                @TOT
     O                                    5 'TOTAL'
     O                         @BTOT 1   16
     O                         TOT,1 1   29
     O                         TOT,2 1   41
     O                         TOT,3 1   53
     O                         TOT,4 1   65
     O                         TOT,5 1   77
     O                         TOT,6 1   89
     O                         TOT,7 1  101
     O                         TOT,8 1  113
     O                         TOT,9 1  125
** TTL
<<< DAILY SHIPMENT BY PROCESS >>>
