     H            Y/
      *-----------------------------------------------------------
      * ASN PROCESSING INQUIRY
      *      DEC/06/01  (TCH)
      *
      * DELIVERY CODES WHICH REQUIRE ASN DATA SHOULD BE REGISTERED
      * IN AB#PPCT.
      *     CTKEY1 = 'ASN'
      *     CTKEY2 = DELIVERY CODE
      *
TCHK1 *  TCH  10/05/05  BUG FIX
JW1   *  JW   05/11/16  EXPAND BIN 12 TO 20
      *-----------------------------------------------------------
     FAB#PWL3 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FAGDPL12 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGADTL17 IF  E           K        DISK
     FAB#PPCT IF  E           K        DISK
     FAB#PL30 IF  E           K        DISK
     FAB#PL08 IF  E           K        DISK
     FAB#PL1B IF  E           K        DISK
     FAB#PL1A IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     FABF9L01 IF  E           K        DISK
     FABF6L02 IF  E           K        DISK
      *-------------------------------------------------------------
     E                    CMD     1   1 78
     E                    ERR     1   1 78
     E                    DT6         5  6 0
     E                    DT8         5  8 0
     E                    ORD         5  1
     E                    ASN         5  6 0
TCHXXE*                   BIN        10  2 0
TCHXXE*JW1                BIN        12  2 0
JW1  E                    BIN        20  2 0
      *-------------------------------------------------------------
      *
     I            DS
     I                                        1  30 DT6
     I                                        1   60D@SHP1
     I                                        7  120D@SHP2
     I                                       13  180D@SHP3
     I                                       19  240D@SHP4
     I                                       25  300D@SHP5
     I            DS
     I                                        1   5 ORD
     I                                        1   1 S@ORD1
     I                                        2   2 S@ORD2
     I                                        3   3 S@ORD3
     I                                        4   4 S@ORD4
     I                                        5   5 S@ORD5
     I            DS
     I                                        1  30 ASN
     I                                        1   60S@ASN1
     I                                        7  120S@ASN2
     I                                       13  180S@ASN3
     I                                       19  240S@ASN4
     I                                       25  300S@ASN5
     I            DS
     I                                        1   80W@DATE
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8DATE
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80BDDATE
     I                                        1   40BDKOYY
     I                                        5   60BDKOMM
     I                                        7   80BDKODD
     I            DS
     I                                        1   80FCDATE
     I                                        1   40FCKOYY
     I                                        5   60FCKOMM
     I                                        7   80FCKODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
      *   MAIN ROUTINE
      *---------------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *--------------------------------------------------
      * INITIAL SET
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#PL30    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#PL8     KLIST
     C                     KFLD           K@NONY
     C                     KFLD           B5NKOJ
     C                     KFLD           B5NUKE
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#PL8X    KLIST
     C                     KFLD           K@NONY
     C                     KFLD           B5NKOJ
     C                     KFLD           B5NUKE
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           K@NBIN  20
     C           K#PLB     KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NBIN  20
     C                     KFLD           K@DATE  80
     C           K#PLBX    KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NBIN  20
     C           K#PLBZ    KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NBIN  20
     C                     KFLD           K@DATE  80
     C                     KFLD           K@RYY   40
     C                     KFLD           K@RMM   20
     C                     KFLD           K@RDD   20
     C           K#PL3X    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           K@BIN   20
     C           K#F6      KLIST
     C                     KFLD           K@SHDT  80
     C                     KFLD           K@SHTM  20
     C                     KFLD           K@RYY   40
     C                     KFLD           K@RMM   20
     C                     KFLD           K@RDD   20
     C                     KFLD           K@NONY
     C           K#75      KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
      *
     C                     MOVEL'ASN'     K@KWD1  8 P
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*DAY      K@DD
      *
     C                     MOVE '01'      @@ID    2
     C                     EXSR #SET1
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET1     BEGSR
      *--------------------------------------------------
      * DATE SET(5 DAYS)
     C                     Z-ADD*ZERO     DT8
     C                     Z-ADD*ZERO     DT6
     C                     Z-ADD*ZERO     X       20
     C           K#AGD     SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C*          F8HIRU    IFNE *BLANK
     C*                    ITER
     C*                    ENDIF
     C           F8DATE    SETLLAB#PL1A
     C           *IN91     DOUEQ*ON
     C           F8DATE    READEAB#PL1A                  91
     C           *IN91     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN91     IFEQ *ON
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         X
     C                     Z-ADDF8DATE    DT8,X
     C                     Z-ADDF8DATE    DT6,X
     C           X         IFEQ 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      * NOT FORD(FIND DELIVERY CODES IN AB#PPCT)
     C           K@KWD1    SETLLAB#PPCT
     C           *IN80     DOUEQ*ON
     C           K@KWD1    READEAB#PPCT                  80
     C           *IN80     IFEQ *OFF
     C                     CLEARSFL01
      *
     C                     MOVELCTKEY2    K@NONY
     C           K@NONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    S@NAME
     C                     ENDIF
     C                     MOVE K@NONY    S@DLV
     C                     Z-ADD*ZERO     @CONT   20
     C           K@NONY    SETLLGADTL17
     C           *IN96     DOUEQ*ON
     C           K@NONY    READEGADTL17                  96
     C           *IN96     IFEQ *OFF
     C           B5SKJY    ANDEQ*BLANK
     C                     MOVE B5NUKE    S@DOCK
     C                     MOVE B5NKOJ    S@FCT
     C                     EXSR #BIN1
     C                     EXSR #ORD1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      * FORD(FIND DELIVERY CODES IN ABF9PP01)
     C           *LOVAL    SETLLABF9L01
     C           *IN80     DOUEQ*ON
     C                     READ ABF9L01                  80
     C           *IN80     IFEQ *OFF
     C                     CLEARSFL01
      *
     C                     MOVELF9DELY    K@NONY
     C           K@NONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    S@NAME
     C                     ENDIF
     C                     MOVE K@NONY    S@DLV
      *
     C                     EXSR #BIN
     C                     EXSR #ORDX
     C                     ENDIF
     C           F9DELY    SETGTABF9L01
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #BIN1     BEGSR
      *--------------------------------------------------
      * SET BIN
     C                     Z-ADD*ZERO     BIN
     C                     Z-ADD1         K@NBIN
     C                     Z-ADDDT8,5     K@DATE
     C                     Z-ADD*ZERO     Z       20
     C                     Z-ADDDT8,5     W@DATE
     C           1         DO   5         X
     C                     Z-ADDDT8,X     W@DATE
     C           K#PL8     SETLLAB#PL08
     C           *IN95     DOUEQ*ON
     C           K#PL8     READEAB#PL08                  95
     C           *IN95     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BANKOJ    ANDEQB5NKOJ
     C           BATOKU    ANDEQB5TOKU
      *
     C           BANOBN    LOKUPBIN                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Z
     C                     Z-ADDBANOBN    BIN,Z
     C                     ENDIF
     C                     Z-ADDBANOBN    K@NBIN
     C           K#PL8X    SETGTAB#PL08
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #ORD1     BEGSR
      *--------------------------------------------------
      *
     C                     Z-ADD*ZERO     Z
     C                     DO   *HIVAL
     C                     ADD  1         Z
     C           BIN,Z     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDBIN,Z     K@NBIN
     C                     Z-ADDBIN,Z     K@BIN
     C                     MOVE BIN,Z     S@BIN
     C                     MOVE *BLANK    ORD
     C                     Z-ADD*ZERO     ASN
     C                     MOVEA'00000'   *IN,11
     C           1         DO   5         X
     C                     Z-ADDDT8,X     K@DATE
     C                     Z-ADDDT8,X     W@DATE
     C           K#PL8X    SETLLAB#PL08
     C           *IN90     DOUEQ*ON
     C           K#PL8X    READEAB#PL08                  90
      * ORER = YES
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BANKOJ    ANDEQB5NKOJ
     C           BATOKU    ANDEQB5TOKU
     C                     MOVE '*'       ORD,X
     C           K#75      SETLLAB#PL75
     C           *IN91     DOUEQ*ON
     C           K#75      READEAB#PL75                  91
     C           *IN91     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
     C           PUASDT    IFNE *ZERO
     C                     Z-ADDPUASDT    ASN,X
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN91     IFEQ *ON
      * ASN = NO
     C           X         ADD  10        Y       20
     C                     MOVE *ON       *IN,Y
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #BIN      BEGSR
      *--------------------------------------------------
      * SET BIN
     C                     Z-ADD*ZERO     BIN
     C                     Z-ADD1         K@NBIN
     C                     Z-ADDDT8,5     K@DATE
     C                     Z-ADD*ZERO     Z       20
     C                     Z-ADDDT8,5     W@DATE
     C           K#PLB     SETLLAB#PL1B
     C           *IN95     DOUEQ*ON
     C           K@NONY    READEAB#PL1B                  95
     C           *IN95     IFEQ *OFF
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
     C           BANOHZ    IFLE DT8,1
     C           BANOHZ    ANDGEDT8,5
TCHK1 *
TCHK1C           BANOBN    LOKUPBIN                      10
TCHK1C           *IN10     IFEQ *OFF
     C                     ADD  1         Z
     C                     Z-ADDBANOBN    BIN,Z
TCHK1C                     END
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         K@NBIN
     C           K#PLB     SETLLAB#PL1B
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #ORD      BEGSR
      *--------------------------------------------------
      *
     C                     Z-ADD*ZERO     Z
     C                     DO   *HIVAL
     C                     ADD  1         Z
     C           BIN,Z     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDBIN,Z     K@NBIN
     C                     Z-ADDBIN,Z     K@BIN
     C                     MOVE BIN,Z     S@BIN
     C                     MOVE *BLANK    ORD
     C                     Z-ADD*ZERO     ASN
     C                     MOVEA'00000'   *IN,11
     C           1         DO   5         X
     C                     Z-ADDDT8,X     K@DATE
     C                     Z-ADDDT8,X     W@DATE
     C           K#PLB     CHAINAB#PL1B              90
      * ORER = YES
     C           *IN90     IFEQ *OFF
     C                     MOVE '*'       ORD,X
     C           K#PL3X    CHAINAB#PL30              91
     C           *IN91     IFEQ *OFF
      * ASN = YES
     C                     Z-ADDBDDATE    ASN,X
     C                     ELSE
      * ASN = NO
     C           X         ADD  10        Y       20
     C                     MOVE *ON       *IN,Y
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #ORDX     BEGSR
      *--------------------------------------------------
      *
     C                     Z-ADD*ZERO     Z
     C                     DO   *HIVAL
     C                     ADD  1         Z
TCHXXC*JW1       Z         IFGT 12
JW1  C           Z         IFGT 20
     C                     LEAVE
TCHXXC                     ENDIF
     C           BIN,Z     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDBIN,Z     K@SHTM
     C                     Z-ADDBIN,Z     K@BIN
     C                     Z-ADDBIN,Z     K@NBIN
     C                     MOVE BIN,Z     S@BIN
     C                     MOVE *BLANK    ORD
     C                     Z-ADD*ZERO     ASN
     C                     MOVEA'00000'   *IN,11
     C           1         DO   5         X
     C                     Z-ADDDT8,X     K@SHDT
     C                     Z-ADDDT8,X     W@DATE
     C                     Z-ADDDT8,X     K@DATE
     C           K#PLB     SETLLAB#PL1B              90
     C           *IN90     DOUEQ*ON
     C           K#PLB     READEAB#PL1B                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      * ORDER = YES
     C                     MOVE '*'       ORD,X
     C           K#75      SETLLAB#PL75
     C           *IN91     DOUEQ*ON
     C           K#75      READEAB#PL75                  91
     C           *IN91     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
     C           PUASDT    IFNE *ZERO
     C                     Z-ADDPUASDT    ASN,X
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     Z-ADDBADEYY    K@RYY
     C                     Z-ADDBADEMM    K@RMM
     C                     Z-ADDBADEDD    K@RDD
     C           ASN,X     IFEQ *ZERO
     C           K#F6      SETLLABF6L02
     C           *IN91     DOUEQ*ON
     C           K#F6      READEABF6L02                  91
     C           *IN91     IFEQ *OFF
     C           FCSKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
     C           FCPRNT    IFEQ 'A'
      * ASN = YES
     C                     Z-ADDFCDATE    ASN,X
     C                     ELSE
      * ASN = NO
     C           X         ADD  10        Y       20
     C                     MOVE *ON       *IN,Y
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      * FIND OTHER DATA WITH DIFFERENT RELEASE DATES.
     C           K#PLBZ    SETGTAB#PL1B
     C                     ENDIF
      *
     C                     ENDDO
     C                     ENDDO
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C           1         DO   5         X
     C           ASN,X     IFNE *ZERO
     C           X         ADD  10        Y
     C           *IN,Y     IFEQ *ON
     C                     MOVE ERR,1     #MSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *--------------------------------------------------
     C                     MOVE CMD,1     #CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C           *INKC     IFEQ *ON
     C           *INKA     OREQ *ON
     C                     MOVE '99'      @@ID
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
** CMD
   F3:END      * = SHIPPED OR SCHEDULED
** ERR
DATA WITH ANOTHER RELEASE DATE HASN'T BEEN SENT YET TO FORD.
