     H            Y.
      ** AB#RH51 *********************************************
      *  HONDA EDI(830/862) ORDER INQ BY RECEIVE DATE        *
      *  J.WATANABE  2024.02.08                              *
      ********************************************************
     FAB#PWH51CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     FAB#EL92SIF  E           K        DISK
     FAB#EL93SIF  E           K        DISK
     FAB#EL90SIF  E           K        DISK
     F**AB#PL10AIF  E           K        DISK
JW   FAB#PL1C IF  E           K        DISK
     FAB#PL83 IF  E           K        DISK
     FAB#WPH5 UF  E           K        DISK                      A
      *
     E                    ERR     1   7 60
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1   60FDTIME
     I                                        1   20HH1
     I                                        3   40MM1
     I                                        5   60SS1
     I            DS
     I                                        1   80DATE
     I                                        1   20W@CT
     I                                        3   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80DATE2
     I                                        1   40W@YY2
     I                                        5   60W@MM2
     I                                        7   80W@DD2
     I            DS
     I                                        1   80KDATE2
     I                                        1   40KW@YY
     I                                        5   60KW@MM
     I                                        7   80KW@DD
     I            DS
     I                                        1  120#TIME
     I                                        1   20W@HH
     I                                        3   40W@MIN
     I                                        5   60W@SS
      *
      *-----------------------------------------------------------*
      *     M  A  I  N  L  I  N  E                                *
      *-----------------------------------------------------------*
      *
     C                     EXSR #INIT
      *
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP1            PO# ENTRY
     C           W@ID      CASEQ'02'      #DSP2            IAF ORDER
     C           W@ID      CASEQ'03'      #DSP3            EDI ORDER
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *************************************************************
      * SCREEN 1
      *************************************************************
     C           #DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVE *OFF      *IN85
     C                     MOVE *OFF      *IN30
     C                     MOVE *OFF      *IN31
     C                     MOVE *OFF      *IN32
      *
     C                     EXSR #CHK1
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C                     MOVEL'99'      W@ID
     C                     GOTO @END1
      * F5: ORDER
     C           *INKE     WHEQ *ON
     C           *IN85     ANDEQ*OFF
     C                     EXSR #SFL1
     C           RRN1      IFGT 0
     C                     MOVEL'02'      W@ID
     C                     ELSE
     C                     MOVELERR,4     XMSG
     C                     SETON                     313285
     C                     ENDIF
      * F7: STATUS
     C           *INKG     WHEQ *ON
     C           *IN85     ANDEQ*OFF
     C                     EXSR #SFL2
     C           RRN2      IFGT 0
     C                     MOVEL'03'      W@ID
     C                     ELSE
     C                     MOVELERR,2     XMSG
     C                     SETON                     313285
     C                     ENDIF
      * ENTR
     C                     OTHER
     C                     MOVEL'01'      W@ID
     C                     ENDSL
      *
     C           @END1     ENDSR
      *************************************************************
      * CHECK SCREEN 1
      *************************************************************
     C           #CHK1     BEGSR
      *
     C                     MOVE *BLANK    XMSG
     C                     MOVE *OFF      *IN31
     C                     MOVE *OFF      *IN85
      *
     C           XORD      IFEQ *BLANK
     C                     MOVE *ON       *IN31
     C                     MOVE *ON       *IN85
     C                     MOVELERR,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR
     C           *IN85     IFEQ *OFF
     C                     MOVELERR,3     XMSG
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *************************************************************
      * SET DATA FOR DSP01
      *************************************************************
     C           #SFL1     BEGSR
      * GET FROM AB#PLE1 (EDI824)
     C                     Z-ADD0         SVCRDT  80
     C                     Z-ADD0         SVCRTM  60
     C                     Z-ADD0         RRN1
     C                     MOVE *OFF      *IN51
     C                     MOVELXORD      #ASN16 16 P
     C********   XORD      SETLLAB#PL10A
JW   C           XORD      SETLLAB#PL1C
      *
     C                     DO   *HIVAL
     C********   XORD      READEAB#PL10A                 51
JW   C           XORD      READEAB#PL1C                  51
     C   51                LEAVE
      * CHECK DLT
     C**         BASKJY    IFNE *BLANK
     C**                   ITER
     C**                   ENDIF
      * CHECK HONDA
     C           BATOKU    IFEQ 0294
     C           BATOKU    OREQ 0295
     C           BATOKU    OREQ 0296
     C           BATOKU    OREQ 0390
     C           BATOKU    OREQ 0391
     C           BATOKU    OREQ 0400
     C           BATOKU    OREQ 1602
     C           BATOKU    OREQ 3135
     C                     ELSE
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELBAEDIK    #TYP
     C                     MOVE *BLANK    #DLT
      *
     C           BASKJY    IFEQ 'D'
     C           BAKOHH    IFEQ 10
     C           BAKOSS    ANDEQ05
     C                     ITER
     C                     ELSE
     C                     MOVEL'DLT'     #DLT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDBATOKU    #TOKU
     C                     Z-ADDBANONY    #NONY
      * NAME
     C                     MOVELBANONY    $DLV
     C                     CALL 'UTLR62B'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C                     MOVEL$NAME1    #NAME
      *
     C                     Z-ADDBACRHZ    #CRHZ
     C                     MOVELBACRME    #CRME
     C                     Z-ADDBANOHZ    #NOHZ
     C                     Z-ADDBANOBN    #NOBN
      * MHIN
     C                     MOVELBAMHIN    $MHIN
     C                     CALL 'UUUR03'
     C                     PARM           $MHIN  20
     C                     PARM           $MHIN2 23
     C                     MOVEL$MHIN2    #MHIN
      *
     C                     Z-ADDBASRYO    #SRYO
     C                     MOVELBAINVN    #INVN
     C                     Z-ADDBASYOS    #SYOS
      * READ PP78
     C                     MOVE *BLANK    #SERL
     C                     Z-ADD0         #PSHZ
     C                     Z-ADD0         #POHZ
     C           BASERL    IFNE *BLANK
     C                     Z-ADDBANOYY    K#NOYY  40
     C                     Z-ADDBANOMM    K#NOMM  20
     C                     Z-ADDBANODD    K#NODD  20
     C                     Z-ADDBATOKU    K#CUST  40
     C                     Z-ADDBANONY    K#NONY  40
     C                     MOVELBANKOJ    K#NKOJ  1
     C                     MOVELBANUKE    K#NUKE  4
     C                     Z-ADDBANOBN    K#BINN  20
     C           K#PL83    SETLLAB#PL83                  97
     C                     DO   *HIVAL
     C           K#PL83    READEAB#PL83                  97
     C   97                LEAVE
     C                     MOVELP8SERL    #SERL
     C                     MOVELP8PLDT    #PSHZ
     C                     MOVELP8SPDT    #POHZ
     C           P8ODRN    IFEQ XORD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ENDDO
      *
     C                     Z-ADDRRN1      COUNT1  60
      *
     C                     ENDSR
      ************************************************************
      * SCREEN 2 (ORDER)
      ************************************************************
     C           #DSP2     BEGSR
      *
     C                     WRITEFMT90
     C                     MOVEL'1'       *IN70
     C                     EXFMTCTL01
     C                     MOVEL*BLANKS   XMSG
     C                     MOVEL'0'       *IN85
     C                     MOVEL'0'       *IN70
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     EXSR @CLR1
     C                     Z-ADD0         RRN1
     C                     MOVEL'01'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************
      * CLEAR SCREEN 1
      *************************************************************
     C           @CLR1     BEGSR
     C                     SETON                     71
     C                     WRITECTL01
     C                     SETOF                     71
     C                     Z-ADD0         RRN1
      *
     C                     ENDSR
      *************************************************************
      * SET SFL02 DATA
      *************************************************************
     C           #SFL2     BEGSR
      * SET AB#WPH5
     C                     EXSR #SET2
      * GET FROM AB#EP92 (EDI862) **********
     C                     Z-ADD0         RRN2
     C                     Z-ADD0         SVCRDT
     C           *LOVAL    SETLLAB#WPH5
     C                     DO   *HIVAL
     C                     READ AB#WPH5                  51
     C   51                LEAVE
      * BREAK?
     C           SVCRDT    IFEQ 0
     C                     Z-ADDWHRCHZ    SVCRDT
     C                     ENDIF
     C           SVCRDT    IFNE WHRCHZ
     C                     Z-ADDWHRCHZ    SVCRDT
     C                     CLEARSFL02
     C                     MOVE *ON       *IN89            NOT DISPLAY
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     ENDIF
      *=======
     C                     CLEARSFL02
     C                     MOVE WHSRC     @EP
     C                     Z-ADDWHRCHZ    @RCDT
     C                     MOVELWHRCTM    @RCTM
     C                     MOVELWHEDI     @EDI
     C                     MOVELWHPLNT    @PLNT
     C                     MOVELWHSHCD    @SHCD
     C                     MOVELWHMHIN    @MHIN
     C                     Z-ADDWHNOHZ    @SHDT
     C                     Z-ADDWHQTY     @QTY
     C                     MOVELWHSCAC    @SCAC
     C                     MOVELWHADDR    @ADDR
      *
     C                     MOVE *OFF      *IN89            DISPLAY
     C                     ADD  1         RRN2
     C                     WRITESFL02
     C                     ENDDO
      *
     C                     Z-ADDRRN2      COUNT2  60
      *
     C                     ENDSR
      ************************************************************
      * SET AB#WPH5
      ************************************************************
     C           #SET2     BEGSR
      * CLEAR AB#WPH5
     C           *LOVAL    SETLLAB#WPH5
     C                     DO   *HIVAL
     C                     READ AB#WPH5                  99
     C   99                LEAVE
     C                     DELETAB#WPH51
     C                     ENDDO
      *
      * GET FROM AB#EP90 (EDI850) **********
     C                     MOVELXORD      @ORD   20
     C                     MOVE *BLANK    WHSCAC
     C           @ORD      SETLLAB#EL90S
     C                     DO   *HIVAL
     C           @ORD      READEAB#EL90S                 51
     C   51                LEAVE
      *
     C                     CLEARAB#WPH51
     C                     MOVELXORD      WHODRN
     C                     MOVEL'EP90'    WHSRC
     C                     Z-ADDAECRDT    WHRCHZ
     C                     MOVELAECRTM    WHRCTM
     C                     MOVELAEEDID    WHEDI
     C                     MOVELAEPLNT    WHPLNT
     C                     MOVELAESHCD    WHSHCD
     C                     MOVELAEMHIN    WHMHIN
     C                     Z-ADDAEPLSH    WHNOHZ
     C                     Z-ADDAEQNTY    WHQTY
     C                     MOVELAESCAC    WHSCAC
      * ADDRESS
     C                     MOVELAESHNM    PNAM      P
     C                     MOVELAESAD1    PAD1      P
     C                     MOVELAESAD2    PAD2      P
     C                     MOVELAECITY    PCTY      P
     C                     MOVELAESTAT    PSTT      P
     C                     MOVELAEZIPC    PZIP      P
     C                     CALL 'EDTC01'
     C                     PARM           PNAM   30
     C                     PARM           PAD1   30
     C                     PARM           PAD2   30
     C                     PARM           PCTY   30
     C                     PARM           PSTT    2
     C                     PARM           PZIP   10
     C                     PARM           PADDR 120
     C                     MOVELPADDR     WHADDR
      *
     C           EP93B     CHAINAB#EL93S             99
     C           *IN99     IFEQ *OFF
     C                     MOVELA3SCAC    WHSCAC
     C                     ENDIF
      *
     C                     WRITEAB#WPH51
     C                     ENDDO
      *
      * GET FROM AB#EP92 (EDI862) **********
     C           @ORD      SETLLAB#EL92S
     C                     DO   *HIVAL
     C           @ORD      READEAB#EL92S                 51
     C   51                LEAVE
      *
     C           A9QNTY    IFEQ 0
     C                     ITER
     C                     ENDIF
      * ===
     C                     CLEARAB#WPH51
     C                     MOVEL'EP92'    WHSRC
     C                     Z-ADDE9CRDT    WHRCHZ
     C                     MOVELE9CRTM    WHRCTM
     C                     MOVELA9EDID    WHEDI
     C                     MOVELA9PLNT    WHPLNT
     C                     MOVELA9SHCD    WHSHCD
     C                     MOVELA9MHIN    WHMHIN
     C                     Z-ADDA9PLSH    WHNOHZ
     C                     Z-ADDA9QNTY    WHQTY
      * GET FROM AB#EP93
     C           EP93A     CHAINAB#EL93S             99
     C           *IN99     IFEQ *OFF
     C                     MOVELA3SCAC    WHSCAC
     C                     ENDIF
      * CHECK EP90'S DATA
     C           K#WPH5    CHAINAB#WPH5              98
     C           *IN98     IFEQ *ON
     C                     WRITEAB#WPH51
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      ************************************************************
      * SCREEN 3
      ************************************************************
     C           #DSP3     BEGSR
      *
     C                     WRITEFMT90
     C                     MOVEL'1'       *IN70
     C                     EXFMTCTL02
     C                     MOVEL*BLANKS   XMSG
     C                     MOVEL'0'       *IN85
     C                     MOVEL'0'       *IN70
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C           *INKC     OREQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     EXSR #CLR2
     C                     Z-ADD0         RRN2
     C                     MOVEL'01'      W@ID
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************
      * CLEAR SCREEN
      *************************************************************
     C           #CLR2     BEGSR
     C                     SETON                     71
     C                     WRITECTL02
     C                     SETOF                     71
     C                     Z-ADD0         RRN2
      *
     C                     ENDSR
      *************************************************************
      * INITIALIZE
      *************************************************************
     C           #INIT     BEGSR
      *
     C           EP93A     KLIST
     C                     KFLD           A9ODRN
     C                     KFLD           E9CRDT
     C                     KFLD           E9CRTM
     C                     KFLD           A9EDID
     C                     KFLD           A9PLNT
     C                     KFLD           A9SHCD
     C                     KFLD           A9MHIN
     C                     KFLD           A9RENO
      *
     C           EP93B     KLIST
     C                     KFLD           AEODRN
     C                     KFLD           AECRDT
     C                     KFLD           AECRTM
     C                     KFLD           AEEDID
     C                     KFLD           AEPLNT
     C                     KFLD           AESHCD
     C                     KFLD           AEMHIN
     C                     KFLD           AERENO
      *
     C           K#PL83    KLIST
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
     C                     KFLD           K#CUST  40
     C                     KFLD           K#NONY  40
     C                     KFLD           K#NKOJ  1
     C                     KFLD           K#NUKE  4
     C                     KFLD           K#BINN  20
      *
     C           K#WPH5    KLIST
     C                     KFLD           WHRCHZ
     C                     KFLD           WHRCTM
     C                     KFLD           WHEDI
     C                     KFLD           WHPLNT
     C                     KFLD           WHSHCD
     C                     KFLD           WHMHIN
     C                     KFLD           WHNOHZ
     C                     KFLD           WHQTY
      *
     C                     MOVEL*BLANKS   XMSG
     C                     MOVEL'01'      W@ID    2
     C                     TIME           #TIME
     C                     MOVE *DATE     DATE
     C                     Z-ADD0         RRN1    50
     C                     Z-ADD0         RRN2    50
      *
     C                     ENDSR
      *************************************************************
** ERR (60A) ......2.........3.........4.........5.........6
ENTER ORDER#                                                 01
IAF DID NOT RECEIVE ANY EDI ORDER(862/850) WITH THIS ORDER#  02
PRESS F5 OR F7 TO DISPLAY ORDER DATA...                      03
IAF ORDER NOT FOUND!                                         04
                                                             05
                                                             06
                                                             07
