     F**********************************************************
     FAB#PL76 IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     F            AB#PP751                          KRENAMEAB#75R
     FAB#PL07 UF  E           K        DISK
     FAB#PL11 IF  E           K        DISK
     FAB#PL14 IF  E           K        DISK
     FAB#PL17 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FABF9L01 IF  E           K        DISK
     FABF4P01 IF  E           K        DISK
     FAB#EP00 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FFCEPL01 IF  E           K        DISK
     FAB#PP47 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAB#WP621O   F     256            DISK
      *--------------------------------------------------
     E                    MSG     1   7 78
     E                    CMD     1   2 78
      *--------------------------------------------------
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I I            'F'                       1   7 FNO
     I                                        1   1 FFFF
     I                                        2   7 FPS#
     I            DS
     I                                        1  20 $MHIN
     I                                        1   5 $MHN1
     I                                        6  10 $MHN2
     I                                       11  15 $MHN3
     I                                       16  20 $MHN4
     I            DS
     I                                        1   4 B1NUKE
     I                                        1   1 B11
     I            DS
     I                                        1  16 B1NBAN
     I                                        1  10 B1NB1
     I                                       11  16 B1NB2
     I            DS
     I                                        1   80@@DAT
     I                                        1   60@@YM
     I                                        3   60@@YM4
     I            DS
     I                                        1  16 @@INVO
     I                                        1   4 @@INV1
     I                                        5   8 @@INV2
     I            DS
     I                                        1  23 ZMHIN
     I                                        1   5 ZMHN1
     I                                        6   6 BA1
     I                                        7  11 ZMHN2
     I                                       12  12 BA2
     I                                       13  17 ZMHN3
     I                                       18  18 BA3
     I                                       19  23 ZMHN4
     I            DS
     I                                        1  20 XMHIN
     I                                        1   5 XMHN1
     I                                        6  10 XMHN2
     I                                       11  15 XMHN3
     I                                       16  20 XMHN4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1   8 W@DUE
     I                                        1   40W@DUEY
     I                                        5   60W@DUEM
     I                                        7   80W@DUED
     I            DS
     I                                        1  12 W@SHIN
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
      *--------------------------------------------------
      *  MAIN ROUTINE
      *--------------------------------------------------
     C                     EXSR #WRT
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@NONY  4
     C                     PARM           P@END   1
      *
     C           K#P01     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C           KEY4      KLIST
     C                     KFLD           B1NONY
     C                     KFLD           B1NUKE
     C                     KFLD           B1NOHZ
     C                     KFLD           PNOBI   20
     C           K#P10     KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C           K#P14     KLIST
     C                     KFLD           PUNOYY
     C                     KFLD           PUNOMM
     C                     KFLD           PUNODD
     C                     KFLD           PUBINN
     C                     KFLD           PURLYY
     C                     KFLD           PURLMM
     C                     KFLD           PURLDD
     C                     KFLD           PUNONY
     C                     KFLD           PUNKOJ
     C                     KFLD           PUNUKE
     C           K#P17     KLIST
     C                     KFLD           D@NONY
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C           K#P07     KLIST
     C                     KFLD           D@NONY
     C                     KFLD           D@FACT
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
      *
     C           K#PCT     KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
     C           K#KEY     KLIST
     C                     KFLD           K@KY01 10
     C                     KFLD           K@KY02 10
      *
      *
     C                     TIME           @@TIM   60
      *
     C                     Z-ADD*ZERO     W@NOHZ  80
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #WRT      BEGSR
      *-----------------------------------------------
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@BARC    ANDNE*BLANK
     C           S@BARC    CHAINAB#PL76              91
     C           *IN91     IFEQ *OFF
     C                     MOVE PUNONY    P@NONY
     C                     Z-ADDPUNOYY    K@NOYY
     C                     Z-ADDPUNOMM    K@NOMM
     C                     Z-ADDPUNODD    K@NODD
     C                     Z-ADDPUNONY    K@NONY
     C                     MOVE PUNKOJ    K@NKOJ
      *
     C           K#P10     CHAINAB#PL11              92
     C           *IN92     IFEQ *OFF
     C                     MOVE BASIRE    #SIRE
     C                     MOVE BASIRK    #SIRK
     C                     ENDIF
      *
     C           W@RRN     IFEQ 1
     C                     MOVEL'E3MHIN'  K@KY01    P
     C                     MOVELPUNONY    K@KY02    P
     C           K#KEY     CHAINAB#EP00              96
     C           *IN96     IFEQ *ON
     C                     MOVE *BLANK    @@M     1
     C                     ELSE
     C                     MOVE '1'       @@M
     C                     ENDIF
     C                     ENDIF
      *
     C           PURLYY    COMP *ZERO                    11
      *
      * DATA FROM AB#PP01(EXCLUDE CARD='MA02')
     C                     EXSR #P01
      * DATA FROM AB#PP10(PICK UP CARD='MA02')
     C                     EXSR #P10
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #P01      BEGSR
      *-----------------------------------------------
     C           K#P01     SETLLAB#PL07
     C           *IN95     DOUEQ*ON
     C           K#P01     READEAB#PL07                  95
      *
     C           *IN95     IFEQ *OFF
     C           B1SKJY    ANDEQ*BLANK
      *
     C           B1NUKE    IFNE PUNUKE
     C                     ITER
     C                     ENDIF
      *
     C           B1NOBI    IFNE PUBINN
     C                     ITER
     C                     ENDIF
      *
     C           PUODRN    IFNE *BLANK
     C           B1ODR1    ANDNEPUODRN
     C                     ITER
     C                     ENDIF
      *
     C           B1SRYO    IFEQ 0
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE *BLANK    @@F     1
     C                     MOVE B1NONY    @NON4   4
     C           @NON4     CHAINABF9L01              96
     C           *IN96     IFEQ *OFF
     C                     MOVE '1'       @@F
     C                     ELSE
     C                     MOVE *BLANK    @@F
     C                     ENDIF
      *
     C                     MOVE B1TOKU    @TOKU   4
     C                     MOVE B1NONY    @NONY   4
     C                     MOVE B1NKOJ    @NKOJ   1
     C                     MOVE B1NUKE    @NUKE   4
      *
     C                     MOVE B1MHIN    @MHIN  20
     C                     MOVE B1NOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C           B1TANK    IFEQ *ZERO
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      * UNIT PRICE ERROR
     C           @TANK     IFEQ 0
     C                     MOVE B1NONY    D@NONY
     C                     MOVE B1NKOJ    D@FACT
     C                     MOVE B1NUKE    D@DOCK
     C                     MOVE B1MHN1    D@PRT1
     C                     MOVE B1MHN2    D@PRT2
     C                     MOVE B1MHN3    D@PRT3
     C                     EXFMTDSP03
      *
     C                     MOVE '1'       P@END
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     END
      *
     C                     Z-ADD@TANK     B1TANK
     C                     UPDATAB#PL071
      *
     C                     END
      *
     C                     MOVE B1SBAN    #SBAN   4
     C                     Z-ADDB1NOBI    #BIN    20
      *
     C                     MOVELB1NBAN    @@8     8
     C                     SELEC
     C           B1TOKU    WHEQ 0873
     C                     MOVELB1NBAN    #ODR1
     C                     OTHER
     C                     MOVE B1ODR1    #ODR1  10
     C                     ENDSL
      * FORD
     C           @@F       IFEQ '1'
     C           B1NOBI    IFEQ 0
     C                     Z-ADD01        PNOBI
     C                     ELSE
     C                     Z-ADDB1NOBI    PNOBI
     C                     END
     C           KEY4      CHAINABF4P01              96
     C           *IN96     IFEQ '0'
     C                     MOVE *BLANK    #ODR1
     C                     MOVELYBPS#     FPS#
     C                     MOVELFNO       #ODR1
     C                     ENDIF
     C                     ENDIF
      * HONDA
     C           B1NONY    IFEQ 0295
     C           B1NONY    OREQ 2020
     C           B1NBAN    IFNE *BLANK
     C                     MOVELB1NB1     #ODR1
     C                     ENDIF
     C                     ENDIF
      *
     C           B1NONY    IFEQ 3503
     C           B1NONY    OREQ 3504
     C                     MOVE '1731'    #SIRE   4
     C                     MOVE 'B'       #SIRK   1
     C                     END
     C*
     C           B1NONY    IFEQ 3347
     C           B1NONY    OREQ 3348
     C           B1NONY    OREQ 3481
     C           B1NONY    OREQ 3482
     C           B1NONY    OREQ 3851
     C           B1NONY    OREQ 3226
     C           B1NONY    OREQ 3770
     C           B1NONY    OREQ 3852
     C           B1NONY    OREQ 3764
     C           B1NONY    OREQ 3765
     C           B1NONY    OREQ 3220
     C           B1NONY    OREQ 3421
     C           B1NONY    OREQ 3931
     C           B1NONY    OREQ 3932
     C           B1NONY    OREQ 3804
     C           B1NONY    OREQ 3805
     C           B1NONY    OREQ 3428
     C           B1NONY    OREQ 3429
     C           B1NONY    OREQ 3423
     C                     MOVE '1406'    #SIRE   4
     C                     MOVE '0'       #SIRK   1
     C                     END
      *
     C           B1NONY    IFEQ 0506
     C           B1NONY    OREQ 0437
     C                     MOVE 'C742'    #SIRE
     C                     MOVE '1'       #SIRK
     C                     END
      * TEST ?????
     C           B1NONY    IFEQ 3556
     C           B1NONY    OREQ 3550
     C                     MOVE '1234'    #SIRE
     C                     MOVE '0'       #SIRK
     C                     END
      *
     C* KHMCA
     C           B1NONY    IFEQ 1101
     C                     MOVE '0000'    #SIRE
     C                     MOVE '3'       #SIRK
     C                     END
     C*
     C                     Z-ADDB1NOHZ    WNOHZ   60
     C                     MOVELB1NUKE    WNUKE   2
     C                     MOVELB1NUKE    WNUKE4  4
     C                     Z-ADDB1SRYO    WSRYO  100
     C                     MOVELB1MHIN    WMHIN  30
     C*                    Z-ADDB1TANK    WTANK  134
     C                     Z-ADDB1TANK    WTANK  135
     C                     MOVE B1CARD    WCARD   4
      ** ---------------------------------------------------- **
      *  APPEND A "P" TO THE END OF THE INVOICE#.......
      **
     C           B1NBAN    CAT  'L':0     WINVO  16
      *
      ** ---------------------------------------------------- **
     C*
     C           B1NONY    IFEQ 3511                       TTTX
     C           B1NONY    OREQ 3512                       TTCA
     C           B1NONY    OREQ 3513                       TTMX
     C           B1NONY    OREQ 4022                       YKTA
     C           B1NONY    OREQ 3550                       TTMA
     C           B1NONY    OREQ 3556                       TTAI
     C           B1NONY    OREQ 0250                       APMM
     C           B1NONY    OREQ 8296                       TESLA
     C           K#PK      KLIST
     C                     KFLD           B1NOYY
     C                     KFLD           B1NOMM
     C                     KFLD           B1NODD
     C                     KFLD           B1TOKU
     C                     KFLD           B1NONY
     C                     KFLD           B1NKOJ
     C                     KFLD           B1NUKE
     C                     KFLD           B1NOBI
     C           K#PK      SETLLAB#PL75
     C           *IN90     DOUEQ*ON
     C           K#PK      READEAB#PL75                  90
     C           *IN90     IFEQ *OFF
     C           PUSKJY    ANDEQ*BLANK
     C           B1ODR1    IFEQ PUODRN
     C                     MOVELPUSERL    WINVO     P
     C                     LEAVE
     C                     END
     C                     END
     C                     ENDDO
     C                     END
     C*
     C                     Z-ADDB1SYUY    WSYOS   60
     C                     MOVE B1TOKU    WTOKU   4
     C                     MOVE B1NONY    WNONY   4
     C                     MOVE B1NKOJ    WNKOJ   1
     C                     MOVE B1NOBI    WNBIN   2
     C           WINVO     IFEQ *BLANK
     C           @@INVO    IFEQ *BLANK
     C                     EXSR #INV
     C                     ELSE
     C                     MOVE @@INVO    WINVO
     C                     ENDIF
     C                     ENDIF
      *
     C           B1NONY    IFEQ 0250
     C                     EXSR #APMM
     C                     END
     C*
     C           B1NONY    IFEQ 8296
     C                     EXSR #TESLA
     C                     END
     C*
     C                     EXSR #MH
     C                     EXCPTDT1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #P10      BEGSR
      *-----------------------------------------------
     C           K#P10     SETLLAB#PL111
     C           *IN95     DOUEQ*ON
     C           K#P10     READEAB#PL111                 95
     C           *IN95     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BACARD    ANDEQ'MA02'
      *
     C           BANUKE    IFNE PUNUKE
     C                     ITER
     C                     ENDIF
      *
     C           BANOBN    IFNE PUBINN
     C                     ITER
     C                     ENDIF
      *
     C           BAODRN    IFNE PUODRN
     C                     ITER
     C                     ENDIF
      *
     C           BASRYO    IFEQ 0
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE BATOKU    PTOKU   4
     C                     MOVE BANONY    PNONY   4
     C                     MOVE BANKOJ    PNKOJ   1
     C                     MOVE BANUKE    PNUKE   4
     C                     MOVE BAMHIN    $MHIN
     C                     MOVE *BLANK    $SHIN  12
     C                     MOVE *BLANK    $FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           $MHIN
     C                     PARM           $SHIN  12
     C                     PARM           $FLG    1
      *
     C           $FLG      IFEQ '*'
     C                     MOVE *BLANK    $MHN3
     C                     MOVE *BLANK    $MHN4
     C                     END
      *
     C                     MOVE BATOKU    @TOKU
     C                     MOVE BANONY    @NONY
     C                     MOVE BANKOJ    @NKOJ
     C                     MOVE BANUKE    @NUKE
     C                     MOVE $MHIN     @MHIN
     C                     MOVE BANOHZ    @HIZK
     C                     Z-ADD0         @TANK
     C                     MOVE *BLANK    @CHEK
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      * UNIT PRICE ERROR
  B6 C           @TANK     IFEQ 0
     C                     MOVE BANONY    D@NONY
     C                     MOVE BANKOJ    D@FACT
     C                     MOVE BANUKE    D@DOCK
     C                     MOVE BAMHN1    D@PRT1
     C                     MOVE BAMHN2    D@PRT2
     C                     MOVE BAMHN3    D@PRT3
     C                     EXFMTDSP03
      *
     C                     MOVE '1'       P@END
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     END
      *
     C                     MOVE BASBAN    #SBAN
     C                     MOVE BAODRN    #ODR1
      *
     C                     MOVE BASIRE    #SIRE
     C                     MOVE BASIRK    #SIRK
     C                     Z-ADDBANOHZ    WNOHZ
     C                     MOVELBANUKE    WNUKE
     C                     MOVELBANUKE    WNUKE4
     C                     Z-ADDBASRYO    WSRYO
     C                     MOVELBAMHIN    WMHIN
     C                     Z-ADD@TANK     WTANK
     C                     MOVE BACARD    WCARD
     C           BAINVN    CAT  'L':0     WINVO  16
     C                     MOVELBAINVN    WKRLNO 20
     C                     Z-ADDBASYOS    WSYOS
     C                     MOVE BATOKU    WTOKU
     C                     MOVE BANONY    WNONY   4
     C                     MOVE BANKOJ    WNKOJ   1
     C                     MOVE BANOBN    WNBIN   2
     C           BASYOS    IFEQ *ZERO
     C           BAUSYS    ANDNE*ZERO
     C                     Z-ADDBAUSYS    WSYOS
     C                     ENDIF
     C           WINVO     IFEQ *BLANK
     C           @@INVO    IFEQ *BLANK
     C                     EXSR #INV
     C                     ELSE
     C                     MOVE @@INVO    WINVO
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXSR #MH
     C                     EXCPTDT1
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #INV      BEGSR
      *-----------------------------------------------
     C                     Z-ADD*DATE     @@DAT
     C                     MOVELWNONY     K@KWD2    P
     C           K#PCT     CHAINAB#PPCT              93
     C           *IN93     IFEQ *OFF
     C           CTNBR1    IFEQ @@YM
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADD@@YM      CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
     C                     UPDATAB#PPCT1
     C                     ELSE
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADD@@YM      CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     WRITEAB#PPCT1
     C                     ENDIF
      *
     C                     MOVE @@YM4     @@INV1
     C                     MOVE CTNBR2    @@INV2
     C                     MOVE @@INVO    WINVO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #MH       BEGSR
      *-----------------------------------------------
     C           @@M       IFNE *BLANK
     C                     MOVE *BLANK    BA1
     C                     MOVE *BLANK    BA2
     C                     MOVE *BLANK    BA3
     C                     MOVELWMHIN     XMHIN
     C                     MOVE XMHN1     ZMHN1
     C                     MOVE XMHN2     ZMHN2
     C                     MOVE XMHN3     ZMHN3
     C                     MOVE XMHN4     ZMHN4
     C           XMHN4     IFNE *BLANK
     C                     MOVE '-'       BA3
     C                     ENDIF
     C           XMHN3     IFNE *BLANK
     C                     MOVE '-'       BA2
     C                     ENDIF
     C           XMHN2     IFNE *BLANK
     C                     MOVE '-'       BA1
     C                     ENDIF
     C                     MOVELZMHIN     WMHIN     P
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------
