     H            Y.
     F** AB#RAR ********************************************************
     F*  ASN CHECK LIST                                                *
     F*                            05.01.10                            *
     F*                                                                *
JW1  F*  JW    09/23/16 CHG HEADER                                     *
     F******************************************************************
     FAB#WP0G UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *-------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PDTA    1
     C**JW1                MOVE *ALL'-'   @LINE 100
JW1  C                     MOVE *ALL'-'   @LINE 110
      *
     C                     MOVE *BLANK    K#KEY   1
     C           K#KEY     SETLLAB#WP0G
     C           *IN80     DOUEQ*ON
     C           K#KEY     READEAB#WP0G                  80
     C           *IN80     IFEQ *OFF
     C**JW1?     WPRINT    ANDEQ*BLANK
     C                     EXSR #OUT
     C                     MOVE '1'       WPRINT
     C                     UPDATAB#WP0G1
     C                     MOVE '1'       PDTA
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------------
     C           #OUT      BEGSR
      *
     C  N98
     COR OF                EXCPT@HED
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *-------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   03           @HED
     O**JW1                              50 'ASN LOG WITHOUT SCANNING'
JW1  O                                   51 'ASN SENT WITH LABELS'
JW1  O                                   63 'NOT SCANNED'
     O        E   05           @HED
     O                                   10 'ASN DATE'
     O                                   18 'TIME'
     O                                   24 'USER'
     O                                   35 'CUST'
     O                                   40 'DELV'
     O                                   45 'DOCK'
     O                                   56 'SHP DATE'
     O                                   61 'BIN'
     O                                   67 'PART#'
     O                                   88 'SHP QTY'
     O                                  100 'SCN QTY'
JW1  O                                  110 'PACK SLIP'
     O        E   06           @HED
     O**JW1                    @LINE    100
JW1  O                         @LINE    110
     O        E 1              @DTL
     O                         WDATE     10 '    /  /  '
     O                         WTIME     19 '  :  :  '
     O                         WUSRID    30
     O                         WTOKU     35
     O                         WNONY     40
     O                         WNUKE     45
     O                         WNOHZ     56 '    /  /  '
     O                         WNBIN     60
     O                         WSHN1     67
     O                         WSHN2     73
     O                         WSHN3     76
     O                         WQTY  1   88
     O                         WSCAN 1  100
     O                         WBAR     110
      *
