     H            Y.
     F** AB#R0F5 ************************************************************
     F*  WRITE AB#EP60/61/62 FOR AWTX(0493) ATXW8                           *
     F*  JW   2023.11.10                                                    *
     F***********************************************************************
     FAB#EL60 IF  E           K        DISK                      A
     FAB#EP61 IF  E           K        DISK                      A
     FAB#EP62 IF  E           K        DISK                      A
     E*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************************
      *                    MAIN ROUTINE                                     *
      ***********************************************************************
      *
     C                     EXSR #CK60
      *
     C           *IN85     IFEQ *OFF
     C                     EXSR #EP60
     C                     EXSR #EP61
     C                     EXSR #EP62
     C                     ENDIF
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C***********************************************************
     C* CHECK AB#EP60
     C***********************************************************
     C           #CK60     BEGSR
      *
     C                     MOVE *OFF      *IN85
     C           *LOVAL    SETLLAB#EL60
     C                     DO   *HIVAL
     C                     READ AB#EL60                  98
     C   98                LEAVE
      *
     C                     MOVELE1SHID    LTR1    1
     C           E1PRTN    IFEQ '0493B'
     C           LTR1      ANDEQ'9'
     C                     MOVE *ON       *IN85
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* WRITE AB#EP60
     C***********************************************************
     C           #EP60     BEGSR
      *
     C           *LOVAL    SETLLAB#EL60
     C                     DO   *HIVAL
     C                     READ AB#EL60                  98
     C   98                LEAVE
      *
     C           E1PRTN    IFEQ '0493A'
     C                     MOVEL'0493B'   E1PRTN
     C                     MOVEL'9'       E1SHID
     C                     WRITEAB#EP601
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* WRITE AB#EP61
     C***********************************************************
     C           #EP61     BEGSR
      *
     C           *LOVAL    SETLLAB#EP61
     C                     DO   *HIVAL
     C                     READ AB#EP61                  98
     C   98                LEAVE
      *
     C           E2PRTN    IFEQ '0493A'
     C                     MOVEL'0493B'   E2PRTN
     C                     MOVEL'9'       E2SHID
     C                     WRITEAB#EP611
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* WRITE AB#EP62
     C***********************************************************
     C           #EP62     BEGSR
      *
     C           *LOVAL    SETLLAB#EP62
     C                     DO   *HIVAL
     C                     READ AB#EP62                  98
     C   98                LEAVE
      *
     C           E3PRTN    IFEQ '0493A'
     C                     MOVEL'0493B'   E3PRTN
     C                     MOVEL'9'       E3SHID
     C                     WRITEAB#EP621
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
