     H            Y.
     F** AB#R6C *******************************
     F*  ..ACCOUNTS RECEIVABLE DATA           *
     F******************************* AB#R6C **
     FAB#PW6C CF  E                    WORKSTN
     FAB#PL06 UF  E           K        DISK
     FAB#WP6C O   E                    DISK
     E                    ER      1   3 60
     I            DS
     I                                        1   60INOYM
     I                                        1   40INOYY
     I                                        5   60INOMM
     I            DS
     I                                        1  23 ABUPRT
     I                                        1   5 B1MHN1
     I                                        6   6 HFN1
     I                                        7  11 B1MHN2
     I                                       12  12 HFN2
     I                                       13  17 B1MHN3
     I                                       18  18 HFN3
     I                                       19  23 B1MHN4
      *-----------------------------------------------
     C           *INKA     DOUEQ*ON
      *
     C                     EXFMTAB#PW6C1
      *
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     MOVE *ON       *IN10
     C                     WRITEAB#PW6C1
      *
     C                     EXSR #WRT
     C                     MOVE '1'       P@END
     C                     MOVE *ON       *INKA
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------
     C           *INZSR    BEGSR
      *----------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
      *
     C           KEY1      KLIST
     C                     KFLD           INOYY
     C                     KFLD           INOMM
      *
     C                     Z-ADD0         INOYM
      *
     C                     ENDSR
      *----------------------------------------------------
     C           #CHK      BEGSR
      *----------------------------------------------------
     C                     SETOF                     0199
     C                     MOVE *BLANK    MSG
      *
     C           INOYM     IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     ELSE
      *
     C           INOMM     IFLT 01
     C           INOMM     ORGT 12
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     END
     C                     END
      *
     C           KEY1      CHAINAB#PL061             90
     C           *IN90     IFEQ *ON
     C                     SETON                     0299
     C                     MOVE ER,1      MSG
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------
     C           #WRT      BEGSR
      *----------------------------------------------------
B1   C           KEY1      SETLLAB#PL06
     C           *IN90     DOUEQ*ON
     C           KEY1      READEAB#PL06                  90
 B2  C           *IN90     IFEQ *OFF
  B3 C           B1SKJY    ANDEQ*BLANK
      *
     C                     MOVE B1TOKU    ABCUST
     C                     MOVE B1NONY    ABSHIP
     C                     MOVE B1NKOJ    ABFCTY
     C                     MOVE B1NUKE    ABDOCK
     C                     MOVE B1ODR1    ABODNO
     C           B1MHN2    IFNE *BLANK
     C                     MOVE '-'       HFN1
     C                     ELSE
     C                     MOVE *BLANK    HFN1
     C                     ENDIF
     C           B1MHN3    IFNE *BLANK
     C                     MOVE '-'       HFN2
     C                     ELSE
     C                     MOVE *BLANK    HFN2
     C                     ENDIF
     C           B1MHN4    IFNE *BLANK
     C                     MOVE '-'       HFN3
     C                     ELSE
     C                     MOVE *BLANK    HFN3
     C                     ENDIF
      *
     C           B1TANK    IFEQ *ZERO
     C                     MOVE B1TOKU    @TOKU   4
     C                     MOVE B1NONY    @NONY   4
     C                     MOVE B1NKOJ    @NKOJ   1
     C                     MOVE B1NUKE    @NUKE   4
      *
     C                     MOVE B1MHIN    @MHIN  20
     C                     MOVE B1NOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      *
      *
     C                     Z-ADD@TANK     B1TANK
     C                     UPDATAB#PL061
     C                     ENDIF
      *
     C                     MOVE B1NOHZ    ABSHDT
     C                     Z-ADDB1TANK    ABUPRC
      *
     C                     Z-ADDB1SRYO    ABSRYO
     C           ABSRYO    MULT ABUPRC    ABAMNT
     C                     Z-ADDB1SYUY    ABQPCT
      *
     C                     WRITEAB#WP6C1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
** ER
E-01 NO DATA IN SHIPMENT M/F
E-02 INPUT A/R LIST MONTH DATE
E-03 A/R LIST MONTH DATE IS NOT RIGHT
