     H** AB#RH4 *******************************************************
     H* INQUIRY HONDA (DISTRIBUTING MASTER)                             *
     H*
     H*  KIRI 15.09.01
     H*****************************************************************
     H            Y/                                    1
     FAB#PWH4 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFREC1
      * DETAIL CODE MANAGEMENT RECORD .LAYOUT ..LOGICAL FILE ..        *
     FFGBPL01 IF  E           K        DISK
      *
     FAB#PPHD IF  E           K        DISK
      *================================================================
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *     <<
      *
     I           SDS
     I                                     *PROGRAM W@PGM
     I                                      244 253 W@WSID
     I                                      254 263 W@USER
     I                                      264 269 W@JBNO
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@TOKU  40
     C                     PARM           P@NONY  40
     C                     PARM           P@SHCD 10
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
     C                     TIME           @TIME
     C                     MOVEA*ALL'0'   *IN
      *
     C* SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
     C           KEY01     KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@SHCD 10
      *
     C                     Z-ADDP@TOKU    K@TOKU  40
     C                     Z-ADDP@NONY    K@NONY  40
     C                     MOVELP@SHCD    K@SHCD 10
     C                     Z-ADD0         P@TOKU
     C                     Z-ADD0         P@NONY
     C                     MOVEL*BLANK    P@SHCD
      *
     C           KEY01     SETLLAB#PPHD
      *-----------------------------------
     C                     DO   *HIVAL
     C                     READ AB#PPHD                  90
     C   90                LEAVE
     C*
     C           ADSKJY    IFEQ 'D'                        DELETE CODE
     C           ADSKDT    ANDLE@SYSHZ                     DELETE DATE
     C                     ITER
     C                     ENDIF
     C*
     C                     MOVELADTOKU    S$TOKU
     C                     MOVELADNONY    S$NONY
     C                     MOVELADTOKU    S1TOKU
     C                     MOVELADNONY    S1NONY
     C                     MOVELADSHCD    S1SHCD
     C                     MOVELADDEST    S1DEST
     C                     MOVEL*BLANK    S1TNAM
     C                     MOVEL*BLANK    S1NNAM
     C                     MOVEL*BLANK    S1DESM
     C           S1TOKU    IFEQ '0000'
     C                     MOVE *BLANK    S1TOKU
     C                     ENDIF
     C           S1NONY    IFEQ '0000'
     C                     MOVE *BLANK    S1NONY
     C                     ENDIF
     C*
     C           ADTOKU    CHAINFGBPL01              91
     C  N91      B2SKJY    IFEQ 'D'
     C                     SETON                     91
     C                     ENDIF
     C  N91                MOVELB2SMEI    S1TNAM
     C*
     C           ADNONY    CHAINFGBPL01              91
     C  N91      B2SKJY    IFEQ 'D'
     C                     SETON                     91
     C                     ENDIF
     C  N91                MOVELB2SMEI    S1NNAM
     C*
     C                     SELEC
     C           ADDEST    WHEQ '1'
     C                     MOVEL'P.C. '   S1DESM
     C           ADDEST    WHEQ '2'
     C                     MOVEL'SALES'   S1DESM
     C                     ENDSL
     C*
     C                     ADD  1         RRN1
     C                     WRITESFREC1
     C*
     C                     ENDDO
      *-----------------------------------
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1             エラー
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      *  画面１　表示
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     SETON                     70
     C           ENDRRN    IFNE 0
     C                     SETON                     71
     C                     ENDIF
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     707199
     C                     Z-ADD$$RRN     RRN1
     C*----------
     C                     SELEC
     C* < F3 > 終了
     C           *INKC     WHEQ *ON
     C   KC                MOVE '#END    '@STEP
     C* < PAGE UP/DOWN >
     C           *IN73     WHEQ *ON
     C           *IN73     OREQ *ON
     C                     MOVE '#DSP1   '@STEP
     C* <    >
     C                     OTHER
     C           $RRN      IFNE 0
     C           $RRN      CHAINSFREC1               95
     C           *IN95     IFEQ *OFF
     C                     Z-ADDS$TOKU    P@TOKU
     C                     Z-ADDS$NONY    P@NONY
     C                     MOVELS1SHCD    P@SHCD
     C                     MOVE '#END    '@STEP
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
     C                     ENDSR
      *===============================================================
      *===============================================================
