     H            Y.
     F** AB#R6D **********************************
     F*     MAKING EDI REMITANCE ADVICE          *
     F*     N.HYOTO 2000.11.29                   *
     F*                                          *
     F* TCHK1 03/03/09 RE-MAKE                   *
     F* TCHK2 02/11/13 ADD AEP                   *
     F* TCHK3 09/10/14 HONDA RE-MAKE             *
     F********************************** AB#R6A **
     FAB#PL6A IF  E           K        DISK
     FAB#PP6B O   E                    DISK
     FAB#PP6C O   E                    DISK
     FAB#PPCT UF  E           K        DISK                      A
      *----------------------------------------------------------
     E                    TAB1    1   3  5   TAB2    5
     I**********************************************************
     I            DS
     I                                        1   60K@YYMM
     I                                        1   40K@YY
     I                                        5   60K@MM
     I            DS
     I                                        1   80APRCDT
     I                                        1   40APRCYY
     I                                        5   60APRCMM
     I                                        7   80APRCDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C****************************************************
     C           P@SLCT    COMP '2'                      01
     C                     MOVE *OFF      *IN88
      *
     C           P@CUST    IFNE 'HAM  '
     C                     MOVELP@CUST    K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C                     ELSE
     C                     MOVEL'200  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'MAP  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'210  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'ELP  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'260  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'IPS  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
     C                     MOVEL'HAM  '   K@CUST
     C  N01                EXSR #OUT
     C   01                EXSR #OUT2
     C           *IN98     IFEQ *ON
     C                     MOVE *ON       *IN88
     C                     END
TCHK2C                     MOVEL'AEP  '   K@CUST
TCHK2C  N01                EXSR #OUT
TCHK2C   01                EXSR #OUT2
TCHK2C           *IN98     IFEQ *ON
TCHK2C                     MOVE *ON       *IN88
TCHK2C                     END
TCHK3C                     MOVEL'HTM  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
TCHK3C                     MOVEL'HMA  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
TCHK3C                     MOVEL'HCM  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
TCHK3C                     MOVEL'HMI  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
TCHK3C                     MOVEL'HSP  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
TCHK3C                     MOVEL'AHM  '   K@CUST
TCHK3C  N01                EXSR #OUT
TCHK3C   01                EXSR #OUT2
TCHK3C           *IN98     IFEQ *ON
TCHK3C                     MOVE *ON       *IN88
TCHK3C                     END
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#PCT     KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
     C           *ENTRY    PLIST
     C                     PARM           P@CUST  5
     C                     PARM           P@YMD   80
TCHK3C                     PARM           P@TIM   60
     C                     PARM           P@SLCT  1
      *
     C           K#KEY     KLIST
     C                     KFLD           K@CUST  5
     C                     KFLD           K@DATE  80
     C***                  KFLD           K@MM
      *
     C***                  Z-ADDP@YYMM    K@YYMM
     C*          P@YYMM    MULT 100       K@DATE
     C*          K@DATE    ADD  99        W@END   80
     C                     Z-ADDP@YMD     K@DATE
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     MOVEA'00'      *IN,97
     C                     MOVE *BLANK    @@MANI 16
     C                     Z-ADD*ZERO     @@TOT
     C           K#KEY     SETLLAB#PL6A
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PL6A                  90
     C           *IN90     IFEQ *OFF
     C*          APPRDT    IFGT W@END
     C*                    LEAVE
     C*                    ENDIF
      *
TCHK3C           APPRTM    IFNE P@TIM
TCHK3C                     ITER
TCHK3C                     END
TCHK3C*
     C           *IN98     IFEQ *OFF
     C           *IN88     ANDEQ*OFF
     C                     MOVE *ON       *IN98
     C                     CLEARAB#PP6B1
      *
TCHK3C                     MOVELP@CUST    A6CNAM    P
      *
TCHK3C*                    MOVELAPCNAM    K@KWD2    P
TCHK3C                     MOVELP@CUST    K@KWD2    P
     C                     MOVEL'AB#PP6B' K@KWD1    P
     C           APRCYY    MULT 100       YM      60
     C                     ADD  APRCMM    YM
     C           K#PCT     CHAINAB#PPCT              91
     C           *IN91     IFEQ *ON
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADDYM        CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     WRITEAB#PPCT1
     C                     ELSE
     C           CTNBR1    IFEQ YM
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADDYM        CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
     C                     UPDATAB#PPCT1
     C                     ENDIF
     C                     MOVE CTNBR2    W@1     1
      *
     C                     MOVE APRCYY    YY      2
     C                     MOVE APRCMM    MM      2
     C           YY        CAT  MM        YYMM    4
TCHK3C*          APCNAM    LOKUPTAB1      TAB2           10
TCHK3C           P@CUST    LOKUPTAB1      TAB2           10
     C           TAB2      CAT  YYMM:0    CHK9    9 P
     C           CHK9      CAT  W@1:0     A6CHEK    P
      *
     C                     Z-ADDAPMAMT    A6TOTL
     C                     WRITEAB#PP6B1
     C                     ENDIF
      *
     C*          *IN97     IFEQ *ON
     C*          APMANI    ANDNE@@MANI
     C*                    EXSR #MANI
     C*                    ENDIF
      *
TCHK3C                     MOVELK@CUST    A6CNAM    P
     C                     MOVELAPMANI    A6MANI
     C                     MOVELAPCARD    A6CARD
     C                     MOVELAPPAR1    A6PRT1
     C                     MOVELAPPAR2    A6PRT2
     C                     MOVELAPCLRC    A6COLR
     C                     Z-ADDAPIQTY    A6QTY
     C                     Z-ADDAPUNIT    A6UPRC
     C                     MOVELAPDOCK    A6DOCK
     C                     Z-ADDAPRCDT    A6RCDT
      *
     C                     MOVE APMANI    @@MANI
     C  N97                MOVE *ON       *IN97
B01   *
     C           APUNIT    IFNE *ZERO
     C           APIQTY    MULT APUNIT    APTAMT
     C                     ENDIF
     C                     ADD  APTAMT    @@TOT  112
     C                     Z-ADDAPTAMT    A6MAMT
      *
     C                     WRITEAB#PP6C1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C*          *IN97     IFEQ *ON
     C*                    EXSR #MANI
     C*                    ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #OUT2     BEGSR
      *
     C                     MOVEA'00'      *IN,97
     C                     MOVE *BLANK    @@MANI 16
     C                     Z-ADD*ZERO     @@TOT
     C           K#KEY     SETLLAB#PL6A
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PL6A                  90
     C           *IN90     IFEQ *OFF
      *
TCHK3C           APPRTM    IFNE P@TIM
TCHK3C                     ITER
TCHK3C                     END
TCHK3C*
     C           *IN98     IFEQ *OFF
     C           *IN88     ANDEQ*OFF
     C                     MOVE *ON       *IN98
     C                     CLEARAB#PP6B1
      *
TCHK3C                     MOVELP@CUST    A6CNAM    P
      *
TCHK3C*                    MOVELAPCNAM    K@KWD2    P
TCHK3C                     MOVELP@CUST    K@KWD2    P
     C                     MOVEL'AB#PP6B' K@KWD1    P
     C           APRCYY    MULT 100       YM      60
     C                     ADD  APRCMM    YM
     C           K#PCT     CHAINAB#PPCT              91
     C           *IN91     IFEQ *ON
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADDYM        CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     WRITEAB#PPCT1
     C                     ELSE
     C           CTNBR1    IFEQ YM
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADDYM        CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
     C                     UPDATAB#PPCT1
     C                     ENDIF
     C                     MOVE CTNBR2    W@1     1
      *
     C                     MOVE APRCYY    YY      2
     C                     MOVE APRCMM    MM      2
     C           YY        CAT  MM        YYMM    4
TCHK3C*          APCNAM    LOKUPTAB1      TAB2           10
TCHK3C           P@CUST    LOKUPTAB1      TAB2           10
     C           TAB2      CAT  YYMM:0    CHK9    9 P
     C           CHK9      CAT  W@1:0     A6CHEK    P
      *
     C                     Z-ADDAPMAMT    A6TOTL
     C                     WRITEAB#PP6B1
     C                     ENDIF
      *
     C           *IN97     IFEQ *ON
     C           APMANI    ANDNE@@MANI
     C                     EXSR #MANI
     C                     ENDIF
      *
     C                     MOVE APMANI    @@MANI
     C  N97                MOVE *ON       *IN97
B01   *
     C           APUNIT    IFNE *ZERO
     C           APIQTY    MULT APUNIT    APTAMT
     C                     ENDIF
     C                     ADD  APTAMT    @@TOT  112
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN97     IFEQ *ON
     C                     EXSR #MANI
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #MANI     BEGSR
      *----------------------------------------------------------
     C**********           CLEARAB#PP6C1
     C*********            Z-ADD4         A6ROWN
     C           @@TOT     IFNE *ZERO
     C           @@MANI    ORNE *BLANK
     C                     MOVE @@MANI    A6MANI
     C                     Z-ADD@@TOT     A6MAMT
TCHK3C                     MOVELK@CUST    A6CNAM    P
     C                     WRITEAB#PP6C1
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     @@TOT  112
      *
     C                     ENDSR
      *-------------------------------------------------
** TAB1/TAB2
TMMI 34113
TMMK 34111
TMMWV34114
