     H            Y.
     F** AB#R48K2 ***********************************************************
     F*  .TAKATA ---- SORT SEQUENCE                                         *
     F*  LEC  10/18/19                                                      *
     F***********************************************************************
     FAL#PL62 IF  E           K        DISK
      *
      ***********************************************************
      *   ﾐﾔｲﾊﾔ ｲﾔ ﾔｹｶ ｳﾁﾔﾔﾁｿ ﾐﾁ ｻﾔ ﾗｻｾｾ ﾂﾊｻﾀﾔ ｲﾀｵ ﾐﾔｲｴｽ ｹｻｸｹｶﾐﾔ #
      *   (ｾﾁﾗｶﾐﾔ ﾂﾊｻﾁﾊｻﾔﾙ) ｷｻﾊﾐﾔ ｲﾀｵ ﾔｹｶ ｾﾁﾗｶﾐﾔ # (ｹｻｸｹｶﾐﾔ ﾂﾊｻﾁﾊｻﾔﾙ)
      *   ｾｲﾐﾔ, ﾗｹｻｴｹ ﾗｻｾｾ ｶﾀｵ ﾕﾂ ﾁﾀ ﾔﾁﾂ.
      *
     C           *LOVAL    SETLLAL#PL62
      *
     C           *IN51     DOWEQ*OFF
     C                     READ AL#PL62                  51
      *
     C           *IN51     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           C6BLK     IFNE *BLANKS
     C           C6BLK2    ORNE *BLANKS
     C                     CALL 'AB#C48K3'
     C                     PARM           C6BLK
     C                     PARM           C6BLK2
     C                     PARM           C6SITE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ***********************************************************
