     H            Y.
      ** AB#R0GK *******************************************************
      *  GET NONY FROM ABWEP70                                         *
      *  JW     2024/03/27                                             *
      ******************************************************************
     FABWEP70 IF  E                    DISK
      *************************************************************
      *  MAIN
      *************************************************************
     C           *ENTRY    PLIST
     C                     PARM           $NONY   4
      *
     C                     READ ABWEP70                  98
     C  N98                MOVELENONY     $NONY
     C   98                MOVE *BLANK    $NONY
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
