     H            Y.
     F** AB#R0H4 ********************************************
     F* RETURN PULLED QTY FOR ORDERED LINE ITEM
     F*    LEC.             2022.01.26                      *
     F*******************************************************
     FAB#PL65BIF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           #ODRN  12
     C                     PARM           #NONY   4
     C                     PARM           #NUKE   4
     C                     PARM           #NOYY   40
     C                     PARM           #NOMM   20
     C                     PARM           #NODD   20
     C                     PARM           #MHN1   5
     C                     PARM           #MHN2   5
     C                     PARM           #MHN3   5
     C                     PARM           #MHN4   5
     C                     PARM           ##TOTL  60
      *
     C           KEY65B    KLIST
     C                     KFLD           #NONY
     C                     KFLD           #NOYY
     C                     KFLD           #NOMM
     C                     KFLD           #NODD
     C                     KFLD           #NUKE
     C                     KFLD           #ODRN
     C                     KFLD           #MHN1
     C                     KFLD           #MHN2
     C                     KFLD           #MHN3
     C                     KFLD           #MHN4
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     Z-ADD*ZERO     ##TOTL
      *
      * for ordered line item,
      * calculate total pulled qty.
      *
     C           KEY65B    SETLLAB#PL65B
     C           KEY65B    READEAB#PL65B                 50
     C           *IN50     DOWEQ*OFF
      *
     C           A6SKJY    IFEQ *BLANK
     C                     MOVELA6SYOS    QPC50   50
     C                     ADD  QPC50     ##TOTL
     C                     ENDIF
      *
     C           KEY65B    READEAB#PL65B                 50
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
