     H            Y.
     F** AB#RBD *************************************
     F*  TMS BILL OF LADING                         *
     F*                                             *
     F*
     F************************************* AB#RBD **
     FAB#PWBD CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAB#PL1A IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     FAB#PP44 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FAB#PL66 UF  E           K        DISK
     FAB#PL67 IF  E           K        DISK
     F            AB#PP661                          KRENAMEAB#67R
     FAB#WPBD O   E                    DISK
     F*AB#WPBE1O   E                    DISK
     F*AB#WPBE2O   E                    DISK
      *----------------------------------------------------------
     E                    @DE        17  5
     E                    @DO        17  4
     E                    @PS        17  6
     E                    @#P        17  3
     E                    @#C        17  5
     E                    @TG        17  9
     E                    @TT        17  9
     E                    @TN        17  9
     E                    @CS        17  2
     E********            KEY        10 13
     E                    CMT     1   1 40
     E                    TB1     1   1 15
     E                    CMD     1   2 78
     E                    MSG     1   4 78
     E*********           SUPL    1   1 30
      *----------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
     I            DS
     I                                        1   80YBSKHZ
     I                                        1   40YBSKYY
     I                                        5   60YBSKMM
     I                                        7   80YBSKDD
     I            DS
     I                                        1   80BASKHZ
     I                                        1   40BASKYY
     I                                        5   60BASKMM
     I                                        7   80BASKDD
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1  85 @DE
     I                                        1   5 AFPLC1
     I                                        6  10 AFPLC2
     I                                       11  15 AFPLC3
     I                                       16  20 AFPLC4
     I                                       21  25 AFPLC5
     I                                       26  30 AFPLC6
     I                                       31  35 AFPLC7
     I                                       36  40 AFPLC8
     I                                       41  45 AFPLC9
     I                                       46  50 AFPLCA
     I                                       51  55 AFPLCB
     I                                       56  60 AFPLCC
     I                                       61  65 AFPLCD
     I                                       66  70 AFPLCE
     I                                       71  75 AFPLCF
     I                                       76  80 AFPLCG
     I                                       81  85 AFPLCH
     I            DS
     I                                        1  68 @DO
     I                                        1   4 AFDKC1
     I                                        5   8 AFDKC2
     I                                        9  12 AFDKC3
     I                                       13  16 AFDKC4
     I                                       17  20 AFDKC5
     I                                       21  24 AFDKC6
     I                                       25  28 AFDKC7
     I                                       29  32 AFDKC8
     I                                       33  36 AFDKC9
     I                                       37  40 AFDKCA
     I                                       41  44 AFDKCB
     I                                       45  48 AFDKCC
     I                                       49  52 AFDKCD
     I                                       53  56 AFDKCE
     I                                       57  60 AFDKCF
     I                                       61  64 AFDKCG
     I                                       65  68 AFDKCH
     I            DS
     I                                        1 102 @PS
     I                                        1   6 AFPSN1
     I                                        7  12 AFPSN2
     I                                       13  18 AFPSN3
     I                                       19  24 AFPSN4
     I                                       25  30 AFPSN5
     I                                       31  36 AFPSN6
     I                                       37  42 AFPSN7
     I                                       43  48 AFPSN8
     I                                       49  54 AFPSN9
     I                                       55  60 AFPSNA
     I                                       61  66 AFPSNB
     I                                       67  72 AFPSNC
     I                                       73  78 AFPSND
     I                                       79  84 AFPSNE
     I                                       85  90 AFPSNF
     I                                       91  96 AFPSNG
     I                                       97 102 AFPSNH
     I            DS
     I                                        1  51 @#P
     I                                        1   3 AFNOP1
     I                                        4   6 AFNOP2
     I                                        7   9 AFNOP3
     I                                       10  12 AFNOP4
     I                                       13  15 AFNOP5
     I                                       16  18 AFNOP6
     I                                       19  21 AFNOP7
     I                                       22  24 AFNOP8
     I                                       25  27 AFNOP9
     I                                       28  30 AFNOPA
     I                                       31  33 AFNOPB
     I                                       34  36 AFNOPC
     I                                       37  39 AFNOPD
     I                                       40  42 AFNOPE
     I                                       43  45 AFNOPF
     I                                       46  48 AFNOPG
     I                                       49  51 AFNOPH
     I            DS
     I                                        1  85 @#C
     I                                        1   5 AFNOC1
     I                                        6  10 AFNOC2
     I                                       11  15 AFNOC3
     I                                       16  20 AFNOC4
     I                                       21  25 AFNOC5
     I                                       26  30 AFNOC6
     I                                       31  35 AFNOC7
     I                                       36  40 AFNOC8
     I                                       41  45 AFNOC9
     I                                       46  50 AFNOCA
     I                                       51  55 AFNOCB
     I                                       56  60 AFNOCC
     I                                       61  65 AFNOCD
     I                                       66  70 AFNOCE
     I                                       71  75 AFNOCF
     I                                       76  80 AFNOCG
     I                                       81  85 AFNOCH
     I            DS
     I                                        1 153 @TG
     I                                        1   9 AFWTG1
     I                                       10  18 AFWTG2
     I                                       19  27 AFWTG3
     I                                       28  36 AFWTG4
     I                                       37  45 AFWTG5
     I                                       46  54 AFWTG6
     I                                       55  63 AFWTG7
     I                                       64  72 AFWTG8
     I                                       73  81 AFWTG9
     I                                       82  90 AFWTGA
     I                                       91  99 AFWTGB
     I                                      100 108 AFWTGC
     I                                      109 117 AFWTGD
     I                                      118 126 AFWTGE
     I                                      127 135 AFWTGF
     I                                      136 144 AFWTGG
     I                                      145 153 AFWTGH
     I            DS
     I                                        1 153 @TT
     I                                        1   9 AFWTT1
     I                                       10  18 AFWTT2
     I                                       19  27 AFWTT3
     I                                       28  36 AFWTT4
     I                                       37  45 AFWTT5
     I                                       46  54 AFWTT6
     I                                       55  63 AFWTT7
     I                                       64  72 AFWTT8
     I                                       73  81 AFWTT9
     I                                       82  90 AFWTTA
     I                                       91  99 AFWTTB
     I                                      100 108 AFWTTC
     I                                      109 117 AFWTTD
     I                                      118 126 AFWTTE
     I                                      127 135 AFWTTF
     I                                      136 144 AFWTTG
     I                                      145 153 AFWTTH
     I            DS
     I                                        1 153 @TN
     I                                        1   9 AFWTN1
     I                                       10  18 AFWTN2
     I                                       19  27 AFWTN3
     I                                       28  36 AFWTN4
     I                                       37  45 AFWTN5
     I                                       46  54 AFWTN6
     I                                       55  63 AFWTN7
     I                                       64  72 AFWTN8
     I                                       73  81 AFWTN9
     I                                       82  90 AFWTNA
     I                                       91  99 AFWTNB
     I                                      100 108 AFWTNC
     I                                      109 117 AFWTND
     I                                      118 126 AFWTNE
     I                                      127 135 AFWTNF
     I                                      136 144 AFWTNG
     I                                      145 153 AFWTNH
     I            DS
     I                                        1  34 @CS
     I                                        1   2 AFCS01
     I                                        3   4 AFCS02
     I                                        5   6 AFCS03
     I                                        7   8 AFCS04
     I                                        9  10 AFCS05
     I                                       11  12 AFCS06
     I                                       13  14 AFCS07
     I                                       15  16 AFCS08
     I                                       17  18 AFCS09
     I                                       19  20 AFCS10
     I                                       21  22 AFCS11
     I                                       23  24 AFCS12
     I                                       25  26 AFCS13
     I                                       27  28 AFCS14
     I                                       29  30 AFCS15
     I                                       31  32 AFCS16
     I                                       33  34 AFCS17
     I            DS
     I                                        1   72@WEIT
     I                                        1   20@WEIT1
     I                                        3   50@WEIT2
     I                                        6   70@WEIT3
     I            DS
     I                                        1   9 #WEIT
     I                                        1   2 #WEIT1
     I                                        3   3 #WEIT2
     I                                        4   6 #WEIT3
     I                                        7   7 #WEIT4
     I                                        8   90#WEIT5
     I*           DS
     I*                                       1  13 @13
     I*                                       1   40BATOKU
     I*                                       5   80BANONY
     **                                       9   9 BANKOJ
     I*                                      10  13 BANUKE
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1  17 W@PART
     I                                        1   5 BAMHN1
     I                                        6   6 BH1
     I                                        7  11 BAMHN2
     I                                       12  12 BH2
     I                                       13  17 BAMHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
      *  MAIN
      *---------------------------------------------------------
B01  C           @@DSP     DOWNE'99'
     C           @@DSP     CASEQ'01'      #SCRN1
     C           @@DSP     CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-------------------------------------------------------
      * INITIALIZE
      *-------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           #CHG      PLIST
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C           K#1A      KLIST
     C                     KFLD           D@DATE
     C                     KFLD           D@NBIN
     C                     KFLD           D@NONY
     C           K#1AX     KLIST
     C                     KFLD           D@DATE
     C                     KFLD           D@NBIN
     C                     KFLD           D@NONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAODRN
     C           K#1AY     KLIST
     C                     KFLD           D@DATE
     C                     KFLD           D@NBIN
     C                     KFLD           D@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           S@ODRN
     C           K#67      KLIST
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           D@DATE
     C                     KFLD           BANOBN
     C                     KFLD           BAODRN
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C           K#66      KLIST
     C                     KFLD           H@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           S@NKOJ
     C                     KFLD           H@NUKE
     C                     KFLD           D@DATE
     C                     KFLD           D@NBIN
     C           K#FCE     KLIST
     C                     KFLD           A6SHN1
     C                     KFLD           A6SHN2
     C                     KFLD           A6SHN3
     C           K#75      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           @@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           D@NBIN
     C           K#44      KLIST
     C                     KFLD           @@TOKU
     C                     KFLD           D@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           D@DATE
      *
     C                     MOVE '01'      @@DSP   2
     C                     MOVELTB1,1     D@CARR
     C                     MOVELCMT,1     AFTONM
      *
     C                     ENDSR
      *-------------------------------------------------------
      * 1ST SCREEN
      *-------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@DSP
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET
     C           RRN1      IFGT 0
     C                     MOVE '02'      @@DSP
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-------------------------------------------------------
      *  CHECK
      *-------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     619988
     C                     MOVE *BLANK    D@MSG
     C******               MOVE *ALL'9'   KEY
     C                     Z-ADD*ZERO     X       20
      *
     C           K#1A      SETLLAB#PL1A
     C           *IN90     DOUEQ*ON
     C           K#1A      READEAB#PL1A                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C           K#67      CHAINAB#PL67              95
     C           *IN95     IFEQ *ON
     C           *IN99     IFEQ *OFF
     C                     MOVE BATOKU    @4C     4
     C           MSG,3     CAT  BAMHIN:1  D@MSG     P
     C           D@MSG     CAT  '/':0     D@MSG     P
     C           D@MSG     CAT  @4C:0     D@MSG     P
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C*          @13       LOKUPKEY                      10
     C*          *IN10     IFEQ *OFF
     C*                    ADD  1         X
     C*                    MOVE @13       KEY,X
     C*****                ENDIF
      *
     C  N88                MOVE *ON       *IN88
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN88     IFEQ *OFF
     C                     MOVE MSG,2     D@MSG
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------
      * SET DATA FOR SELECTION
      *-------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           K#1A      SETLLAB#PL1A
     C           *IN90     DOUEQ*ON
     C           K#1A      READEAB#PL1A                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     MOVE BANKOJ    S@NKOJ
     C                     MOVE BAODRN    S@ODRN
     C                     Z-ADDBATOKU    H@TOKU
     C                     MOVE BANUKE    H@NUKE
     C                     WRITESFL01
     C           K#1AX     SETGTAB#PL1A
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------
      * 2ND SCREEN
      *-------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVELCMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@DSP
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@DSP
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C                     MOVE MSG,1     D@MSG
     C                     MOVE '01'      @@DSP
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-------------------------------------------------------
      *  CHECK
      *-------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     MOVE *ON       *IN99
      *
     C                     Z-ADD*ZERO     WRRN    40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         WRRN
     C           WRRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    ANDNE*BLANK
     C                     MOVE *OFF      *IN99
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN99     IFEQ *ON
     C                     MOVE MSG,4     D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------
      * WRITE RECORDS
      *-------------------------------------------------------
     C           #WRT      BEGSR
      *
     C***********          SORTAKEY
     C                     MOVE *BLANK    @242A   1
     C                     MOVE *BLANK    @242C   1
     C                     Z-ADD*ZERO     @@TOKU  40
     C                     Z-ADD*ZERO     @@BOX   50
     C                     Z-ADD*ZERO     @@PLT   30
     C                     Z-ADD*ZERO     W@NET
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADDD@DATE    K@YMD
     C                     CLEARAB#WPBD1
     C                     Z-ADD*ZERO     WRRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         WRRN
     C           WRRN      CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    ANDNE*BLANK
      *
     C           @@TOKU    IFNE *ZERO
     C           @@TOKU    ANDNEH@TOKU
     C                     EXSR #WRT1
     C                     Z-ADD*ZERO     @@BOX   50
     C                     Z-ADD*ZERO     @@PLT   30
     C                     Z-ADD*ZERO     W@NET   92
     C                     ENDIF
      *
     C                     Z-ADDH@TOKU    @@TOKU
     C                     MOVE H@NUKE    K@NUKE
     C                     MOVE S@NKOJ    K@NKOJ
      *
     C                     EXSR #WRT2
      *
     C                     MOVELD@NONY    @NONYC  4
     C           @NONYC    CHAINEDIPL40              95
     C           *IN95     IFEQ *OFF
     C                     MOVELE4ADD1    AFAD01
     C                     MOVELE4ADD2    AFAD02
     C                     MOVELE4ADD3    AFAD03
     C                     MOVELE4ADD4    AFAD04
     C                     ENDIF
      *
     C                     MOVE *BLANK    W@MLBL  8
     C           K#66      SETLLAB#PL66
     C           *IN95     DOUEQ*ON
     C           K#66      READEAB#PL66                  95
     C           *IN95     IFEQ *OFF
     C           A6ORDN    ANDEQS@ODRN
     C           A6MHN1    IFEQ *BLANK
     C                     MOVELD@CARR    A6CARR
     C                     MOVE D@DATE    @6      6
     C                     MOVE D@NBIN    @1      1
     C           @6        CAT  @1:0      A6BLNO    P
     C                     UPDATAB#PP661
      *
     C                     ELSE
     C           A6SRYO    DIV  A6QTYB    W@BOX   50
     C                     ADD  W@BOX     @@BOX
     C           A6MLBL    IFNE W@MLBL
     C                     ADD  1         @@PLT
     C                     ENDIF
     C                     MOVE A6MLBL    W@MLBL
      *
     C           K#FCE     CHAINFCEPL01              90
     C           A6SRYO    MULT A2KASI    W@WHT   72
     C                     ADD  W@WHT     W@NET
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @@BOX     IFNE *ZERO
     C                     EXSR #WRT1
     C                     ENDIF
      *
     C                     EXSR #TOT
      *
     C*          @242C     IFEQ *BLANK
     C*                    CLEARAB#WBE11
     C*                    MOVELSUPL,1    AESUPL
     C*                    WRITEAB#WBE11
     C*                    ENDIF
     C*          @242A     IFEQ *BLANK
     C*                    CLEARAB#WBE21
     C*                    MOVELSUPL,1    AESUPL
     C*                    WRITEAB#WBE21
     C*****                ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------
      * WRITE RECORDS
      *-------------------------------------------------------
     C           #WRT1     BEGSR
      * PLANT CODE
     C           W@NET     DIV  1000      W@KG    72
     C           W@KG      MULT 2.2046    W@#     92H
     C                     ADD  W@#       @@NET   92
      *
     C                     ADD  1         Y
      *
     C           K#44      CHAINAB#PP44              90
     C           *IN90     IFEQ *OFF
     C                     MOVELDASUNM    @DE,Y
     C                     ELSE
     C           @@TOKU    IFEQ 3411
     C                     MOVEL'0242C'   @DE,Y
     C                     ELSE
     C                     MOVEL'0242A'   @DE,Y
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELK@NUKE    @DO,Y
      *
     C           K#75      CHAINAB#PL75              90
     C                     MOVE PUSERL    @PS,Y
      * CASE
     C                     MOVE '50'      @CS,Y
      * PALLET
     C                     Z-ADD0         PLEN
     C                     Z-ADD@@PLT     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @#P,Y
      *
     C                     ADD  @@PLT     T@PLT   50
      * CONTAINER
     C                     Z-ADD0         PLEN
     C                     Z-ADD@@BOX     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @#C,Y
     C                     ADD  @@BOX     T@BOX   70
      * NET WEIGHT
     C                     Z-ADD2         PLEN
     C                     Z-ADD@@NET     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TN,Y
     C                     ADD  @@NET     T@NET   92
      * TARE WEIGHT
     C           @@PLT     MULT 24        @PLWHT  92
     C                     Z-ADD2         PLEN
     C                     Z-ADD@PLWHT    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TT,Y
     C                     ADD  @PLWHT    T@PWHT  92
      * GROSS WEIGHT
     C           @@NET     ADD  @PLWHT    @PGRS   92
     C                     Z-ADD2         PLEN
     C                     Z-ADD@PGRS     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TG,Y
     C                     ADD  @PGRS     T@PGRS  92
      *
     C           Y         IFEQ 17
     C                     EXSR #HED
     C                     WRITEAB#WPBD1
     C                     CLEARAB#WPBD1
     C                     Z-ADD*ZERO     Y
     C                     END
      *
     C                     ENDSR
     C*****************************************************************
      *   HEADER
     C*****************************************************************
     C           #HED      BEGSR
      *
     C                     MOVELCMT,1     AFTONM
     C                     MOVELD@CARR    AFCANM
     C                     MOVE D@DATE    AFSHDT
      * BILL OF LADING#
     C                     MOVE D@DATE    @6      6
     C                     MOVE D@NBIN    @1      1
     C           @6        CAT  @1:0      AFBLNO    P
      *
     C                     ENDSR
     C*****************************************************************
      *   TOTAL
     C*****************************************************************
     C           #TOT      BEGSR
      *
     C                     EXSR #HED
      *
     C                     ADD  1         Y
     C                     MOVEL*BLANK    @DE,Y
     C                     MOVEL*BLANK    @DO,Y
     C                     MOVEL'TOTAL'   @PS,Y
      * PALLET
     C                     Z-ADD0         PLEN
     C                     Z-ADDT@PLT     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @#P,Y
      *
      * CONTAINER
     C                     Z-ADD0         PLEN
     C                     Z-ADDT@BOX     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @#C,Y
      * NET WEIGHT
     C                     Z-ADD2         PLEN
     C                     Z-ADDT@NET     PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TN,Y
      * TARE WEIGHT
     C                     Z-ADD2         PLEN
     C                     Z-ADDT@PWHT    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TT,Y
      * GROSS WEIGHT
     C                     Z-ADD2         PLEN
     C                     Z-ADDT@PGRS    PIN
     C                     MOVE *BLANK    POUT
     C                     CALL 'AB#R2N'  #CHG
     C                     MOVE POUT      @TG,Y
      *
     C                     WRITEAB#WPBD1
      *
     C                     ENDSR
      *-------------------------------------------------------
      * WRITE ASN RECORDS
      *-------------------------------------------------------
     C           #WRT2     BEGSR
      *
      *
     C*          K#1AY     SETLLAB#PL1A
     C*          *IN90     DOUEQ*ON
     C*          K#1AY     READEAB#PL1A                  90
     C*          *IN90     IFEQ *OFF
     C*          BASKJY    ANDEQ*BLANK
     C***                  CLEARAB#WBE11
     C******               CLEARAB#WBE21
      *
     C*                    MOVE *BLANK    BH1
     C*                    MOVE *BLANK    BH2
     C*          BAMHN2    IFNE *BLANK
     C*                    MOVE '-'       BH1
     C*                    ENDIF
     C*          BAMHN3    IFNE *BLANK
     C*                    MOVE '-'       BH2
     C*                    ENDIF
     C*                    MOVELW@PART    AEPART
     C*                    MOVELSUPL,1    AESUPL
     C*                    Z-ADDBASRYO    AEQNTY
     C*                    Z-ADDBANOHZ    AESHDT
     C*                    MOVELBAODRN    AEORNO
     C*                    MOVE BANOHZ    @6      6
     C*          K#67      CHAINAB#PL67              95
     C*          *IN95     IFEQ *OFF
     C*                    MOVELA6MLBL    AECASE
     C*                    ENDIF
     C*          BATOKU    IFEQ 3411
     C*                    MOVEL'1'       @242C
     C*          '0242C'   CAT  @6:0      AESHID
     C*                    WRITEAB#WBE11
     C*                    ELSE
     C*                    MOVEL'1'       @242A
     C*          '0242A'   CAT  @6:0      AESHID
     C*                    WRITEAB#WBE21
     C*                    ENDIF
      *
     C*                    ENDIF
     C*                    ENDDO
      *
     C                     ENDSR
** CMT
TOYOTA MOTOR SALES
** TB1
USF HOLLAND
** CMD
  F1:END     ENTER:CONFIRM
  F1:END     F5:CREATE      F12:GO BACK
** MSG
DATA HAS BEEN CREATED. HIT F1, AND CLICK B/L ICON ON DESKTOP.
NO DATA.
NOT SCANNED YET.
CHOOSE AT LEAST ONE ORDER.
