     H            Y.
      ** AB#R5G ********************************************
      *  SHIPPING LOT# REPORT                              *
      *                                                    *
TCHK1 * TCHK1  02/04/06 CREATE                             *
      ******************************************************
     FAB#PW5G CF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK
     FAB#PL7B IF  E           K        DISK
      *--------------------------------------------------
     E                    MSG     1  10 70
      *--------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140W@TIME
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
     I            DS
     I                                        1   80W@NOHZ
     I                                        1   40W@NOYY
     I                                        5   60W@NOMM
     I                                        7   80W@NODD
     C******************************************************
     C* MAIN                                               *
     C******************************************************
     C                     EXSR @F1INT
     C*
     C                     DO   *HIVAL
     C*
     C                     EXFMTFMT010
     C   KA                LEAVE
     C*
     C                     MOVEL*BLANK    F1MSG
     C                     MOVEL*OFF      W@F1ER  1
     C                     EXSR @F1CHK
     C           W@F1ER    IFEQ *ON
     C                     ITER
     C                     END
     C*
     C           *INKE     IFEQ *ON
     C                     CALL 'AB#C5G1'
     C                     PARM           F1SIRE
     C                     PARM           F1SIRK
     C                     PARM           F1DOCK
     C                     PARM           F1NOHZ
     C                     PARM           F1NOBI
     C                     PARM           F1COPY
     C                     PARM           F1PRNT
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *
     C******************************************************
     C* INITIALIZE                                         *
     C******************************************************
     C           *INZSR    BEGSR
      *
     C           K#PP7B    KLIST
     C                     KFLD           F1SIRE
     C                     KFLD           F1SIRK
     C                     KFLD           F1DOCK
     C                     KFLD           W@NOYY
     C                     KFLD           W@NOMM
     C                     KFLD           W@NODD
     C                     KFLD           W@NOBI
     C*
     C           K#DP12    KLIST
     C                     KFLD           W@NOYY
     C                     KFLD           W@NOMM
     C                     KFLD           W@NODD
      *
     C                     TIME           W@TIME
      *
     C                     ENDSR
     C******************************************************
     C* FMT010 INITIALIZE                                  *
     C******************************************************
     C           @F1INT    BEGSR
     C*
     C                     MOVEL*BLANK    F1SIRE
     C                     MOVEL'0'       F1SIRK
     C                     MOVEL'00'      F1DOCK
     C                     Z-ADD*DATE     F1NOHZ
     C                     Z-ADD*ZERO     F1NOBI
     C                     Z-ADD01        F1COPY
     C                     MOVEL'1'       F1PRNT
     C*
     C                     MOVEL*BLANK    F1MSG
     C*
     C                     ENDSR
     C******************************************************
     C* FMT010 CHECK
     C******************************************************
     C           @F1CHK    BEGSR
      *
     C                     SETOF                     414243
     C                     SETOF                     444546
     C                     SETOF                     47
      *  DELIVERY CODE CHECK
     C           F1SIRE    IFEQ *BLANK
     C                     MOVEL*ON       *IN41
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,1     F1MSG
     C                     END
     C                     END
      *  FACTORY CODE CHECK
     C           F1SIRK    IFEQ *BLANK
     C                     MOVEL*ON       *IN42
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,2     F1MSG
     C                     END
     C                     END
      *  DOCK CODE CHECK
     C           F1DOCK    IFEQ *BLANK
     C                     MOVEL*ON       *IN43
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,3     F1MSG
     C                     END
     C                     END
      *  SHIPPING DATE CHECK
     C                     Z-ADDF1NOHZ    W@NOHZ
     C           K#DP12    CHAINAGDPL12              91
     C           *IN91     IFEQ '1'
     C                     MOVEL*ON       *IN44
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,4     F1MSG
     C                     END
     C                     END
      *  BIN# CHECK
     C           F1NOBI    IFEQ *ZERO
     C                     MOVEL*ON       *IN45
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,5     F1MSG
     C                     END
     C                     END
     C*
     C* DATA EXISTING CHECK
     C           W@F1ER    IFEQ *OFF
     C                     MOVELF1NOBI    W@NOBI  2
     C           K#PP7B    CHAINAB#PL7B              92
     C           *IN92     IFEQ *ON
     C                     SETON                     414243
     C                     SETON                     4445
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,8     F1MSG
     C                     END
     C                     END
     C                     END
     C*
     C* # OF COPY CHECK
     C           F1COPY    IFEQ *ZERO
     C                     MOVEL*ON       *IN46
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,6     F1MSG
     C                     END
     C                     END
      * PRINTER CODE CHECK
     C           F1PRNT    IFLT '1'
     C           F1PRNT    ORGT '9'
     C                     MOVEL*ON       *IN47
     C                     MOVEL*ON       W@F1ER
     C           F1MSG     IFEQ *BLANK
     C                     MOVELMSG,7     F1MSG
     C                     END
     C                     END
      *
     C                     ENDSR
      *-------------------------------------------------------------
** (MSG)
DELIVERY ERROR.
FACTORY ERROR.
DOCK ERROR.
DATE IS INVALID.
BIN ERROR.
# OF COPY ERROR
PRINTER ERROR.
NO DATA.


