     H            Y.
     F** AB#R1K *********************************************
     F*  PRINT HONDA SPLIT REPORTT                          *
     F*  J.WATANABE  2016.11.09                             *
     F*******************************************************
     FAB#PL2M IF  E           K        DISK
     FAB#PL19EIF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     ********************************************************
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
     C                     EXSR #INIT
      *
     C           $PDATE    SETLLAB#PL2M
     C           *IN91     DOWEQ*OFF
     C           $PDATE    READEAB#PL2M                  91
     C           *IN91     IFEQ *OFF
      * END?
     C           $PDATE    IFNE M2SPDT
     C                     LEAVE
     C                     ENDIF
      * SELECT UFLG
     C           M2UFLG    IFNE 'S'
     C                     ITER
     C                     ENDIF
      * BREAK?
     C           M2NONY    IFNE S2NONY
     C           M2SPDT    ORNE S2SPDT
     C                     EXSR #LIST
     C                     MOVELM2NONY    S2NONY
     C                     MOVELM2SPDT    S2SPDT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*****************************************************************
     C* PRINT REPORT
     C*****************************************************************
     C           #LIST     BEGSR
      * READ AB#PP10
     C                     MOVE 'Y'       FIRST   1
     C                     MOVELM2NONY    N2NONY  40
     C                     MOVE *OFF      *IN92
      *
     C                     MOVELM2NONY    K@NONY
     C                     MOVELM2NOHZ    K@NOHZ
     C           K#PP10    SETLLAB#PL19E
     C           *IN92     DOWEQ*OFF
     C           K#PP10    READEAB#PL19E                 92
     C           *IN92     IFEQ *OFF
      * SELECT UFLG
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     MOVELBANOHZ    SANOHZ
     C                     MOVELBANOBN    SANOBN
     C                     MOVELBANOHZ    SANOHZ
     C                     MOVELBANOBN    SANOBN
     C                     ENDIF
      * BREAK?
     C           BANOHZ    IFNE SANOHZ
     C           BANOBN    ORNE SANOBN
     C                     EXSR #BRK1
     C                     ENDIF
      * DETAIL
     C           BASYOS    IFEQ 0
     C                     Z-ADD1         BOX     41
     C                     ELSE
     C           BASRYO    DIV  BASYOS    BOX
     C                     ENDIF
      *
     C                     ADD  BOX       T@BOX
     C                     EXSR #PRNT
     C                     ENDIF
     C                     ENDDO
      * LAST BREAK?
     C           FIRST     IFEQ 'N'
     C                     EXSR #BRK1
     C                     ENDIF
      *
     C                     ENDSR
     C*****************************************************************
     C* PRINT REPORT
     C*****************************************************************
     C           #BRK1     BEGSR
      *
     C           T@BOX     IFGT 60
     C                     EXCPT@TTL1
     C                     ELSE
     C                     EXCPT@TTL2
     C                     ENDIF
     C                     ADD  2         #LINE
      * RESET VALUE
     C                     Z-ADD0         T@BOX
     C                     MOVELBANOHZ    SANOHZ
     C                     MOVELBANOBN    SANOBN
      *
     C                     ENDSR
     C*****************************************************************
     C* PRINT REPORT
     C*****************************************************************
     C           #PRNT     BEGSR
      *
     C           #LINE     IFGE 69
     C                     EXCPT@HDR1
     C                     Z-ADD4         #LINE
     C                     ENDIF
      *
     C                     EXCPT@DTL1
     C                     ADD  1         #LINE
      *
     C                     ENDSR
     C*****************************************************************
     C* SET INITIAL VALUE
     C*****************************************************************
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $PDATE  8
     C                     PARM           $RTN    1
      *
     C           K#PP10    KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NOHZ
     C           *LIKE     DEFN BANONY    K@NONY
     C           *LIKE     DEFN BANOHZ    K@NOHZ
      *
     C           *LIKE     DEFN M2NONY    S2NONY
     C           *LIKE     DEFN M2SPDT    S2SPDT
      *
     C           *LIKE     DEFN BANOHZ    SANOHZ
     C           *LIKE     DEFN BANOBN    SANOBN
      *
     C                     MOVEL*DATE     SDATE   80
     C                     TIME           STIME   60
     C                     MOVEL$PDATE    PDATE   80
     C                     Z-ADD90        #LINE   30
     C                     CLEARS2NONY
     C                     CLEARS2SPDT
     C                     Z-ADD0         T@BOX   41
      *
     C                     ENDSR
     C********************************************************
     OQPRINT  E    2           @HDR1
     O                                    8 'AB#R1K'
     O                                   40 '** HONDA SPLIT REPOR'
     O                                   60 'T **                '
     O                         SDATE     80 '    /  /  '
     O                         STIME     89 '  :  :  '
     O                         PAGE  Z  104
     O                                   98 'PAGE'
      *
     O        E 11             @HDR1
     O                                    8 'CREATE'
     O                                   12 'STT'
     O                                   18 'DELV#'
     O                                   28 'SHIP DATE'
     O                                   32 'BIN'
     O                                   42 'USER PART'
     O                                   59 'ORDER#'
     O                                   68 'ASN#'
     O                                   91 'ORDER QTY'
     O                                   97 'BOX'
     O                                  104 'QPC'
      *
      *============
     O        E 1              @DTL1
     O                         M2SPDT  +  1
     O                         BASKJY  +  1
     O                         BANONY  +  2
     O                         BANOHZ  +  2
     O                         BANOBNZ +  2
     O                         BAMHIN  +  1
     O                         BAODRN  +  1
     O                         BAINVN  +  1
     O                         BASRYOZ +  1
     O                         BOX   1 +  1
     O                         BASYOSZ +  1
      *
     O        E 11             @TTL1
     O                         T@BOX 1   97
     O                                   91 '****'
     O                                  110 '** SPLIT **'
      *
     O        E 11             @TTL2
     O                         T@BOX 1   97
     O                                   91 '----'
     O                                  103 '----'
