     H            Y.
      ** AB#RY1 **********************************************
      *  FORD PLANT CODE & CONTAINER TYPE MAINTENANCE        *
      *  JW(SRA)   2015.12.14                                *
      *  --------------------                                *
JW1   *  JW        2021.11.23 ADD F10 PLANT CODE INQUIRY     *
      ********************************************************
      * F3 - EXIT
      * F5 - ADD
      * F7 - CHANGE
      * F9 - DELETE
      * F12- PREVIOUS SCREEN
      * IN99 ERROR
      ********************************************************
     FAB#PWY1 CF  E                    WORKSTN
     FAB#PPYY UF  E           K        DISK                      A
      *
     E                    MSGTBL  1  13 60
     I            DS
     I                                        1   80FFKODT
     I                                        1   40FFKOYY
     I                                        5   60FFKOMM
     I                                        7   80FFKODD
     I            DS
     I                                        1   80FFSKDT
     I                                        1   40FFSKYY
     I                                        5   60FFSKMM
     I                                        7   80FFSKDD
     I            DS
     I                                        1   80DATE
     I                                        1   20W@CT
     I                                        3   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80DATE2
     I                                        1   40W@YY2
     I                                        5   60W@MM2
     I                                        7   80W@DD2
     I            DS
     I                                        1   80KDATE2
     I                                        1   40KW@YY
     I                                        5   60KW@MM
     I                                        7   80KW@DD
     I            DS
     I                                        1  120#TIME
     I                                        1   20W@HH
     I                                        3   40W@MIN
     I                                        5   60W@SS
     I            DS
     I                                        1   60FFKOTM
     I                                        1   20FFKOHH
     I                                        3   40FFKOMN
     I                                        5   60FFKOSS
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *==============================================================
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C*
      *--------------*
      * MAIN ROUTINE *
      *--------------*
     C                     EXSR @INTR
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      @DSP1            1ST SCREEN
     C           W@ID      CASEQ'02'      @DSP2            ADD SCREEN
     C           W@ID      CASEQ'03'      @DSP3            CHG SCREEN
     C           W@ID      CASEQ'04'      @DSP4            DELETE SCREEN
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
      *---------------*
      * INITIALIZATION
      *---------------*
     C           @INTR     BEGSR
     C                     MOVEL'01'      W@ID    2
     C                     TIME           #TIME
     C                     MOVE *DATE     DATE
     C                     Z-ADD2000      W@YY4   40
     C                     ADD  W@YY      W@YY4
     C                     Z-ADD0         FFKOSS
     C                     SETOF                     9998
     C                     ENDSR
      *--------------*
      * FIRST SCREEN *
      *--------------*
     C           @DSP1     BEGSR
     C                     EXFMTAB#PWY11
     C                     MOVEL*BLANKS   @MSG1
     C                     SETOF                     993098
     C* F3 EXIT
     C                     SELEC
     C           *INKC     WHEQ '1'
     C           *INKA     OREQ '1'
     C                     MOVEL'99'      W@ID
     C* F5 ADD
     C           *INKE     WHEQ '1'
     C                     EXSR @CHK1
     C           *IN99     IFEQ '0'
     C                     CLEARAB#PWY12
     C                     MOVE PLNT1     PLNT2
     C                     MOVEL'02'      W@ID
     C                     ENDIF
      * F7 CHANGE
     C           *INKG     WHEQ '1'
     C                     EXSR @CHK2
     C           *IN99     IFEQ '0'
     C                     CLEARAB#PWY13
     C                     MOVE PLNT1     PLNT3
     C                     MOVELFFCONT    @TYPE3
     C                     MOVEL'03'      W@ID
     C                     ENDIF
      * F9 DELETE
     C           *INKI     WHEQ '1'
     C                     EXSR @CHK2
     C           *IN99     IFEQ '0'
     C                     CLEARAB#PWY14
     C                     MOVE PLNT1     PLNT4
     C                     MOVELFFCONT    @TYPE4
     C                     MOVEL'04'      W@ID
     C                     ENDIF
JW1   * F10 PLANT CODE INQ
 .   C           *INKJ     WHEQ '1'
JW1  C                     CALL 'FBCR48'
      *
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------*
     C* CHK1 FOR ADD RECORD
      *--------------------*
     C           @CHK1     BEGSR
     C           PLNT1     IFEQ *BLANK
     C                     SETON                     9930
     C                     MOVELMSGTBL,1  @MSG1
     C                     ENDIF
     C*
     C           *IN99     IFEQ '0'
     C                     SETOF                     70
     C           PLNT1     CHAINAB#PPYY              70
     C           *IN70     IFEQ '0'
     C           FFSKJY    IFEQ 'D'
     C           FFSKDT    ANDLE*DATE
     C                     ELSE
     C                     SETON                     9930
     C                     MOVELMSGTBL,2  @MSG1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
     C*
      *-------------------------------*
     C* CHK2 FOR CHAGE OR DELETE RECORD
      *-------------------------------*
     C           @CHK2     BEGSR
     C           PLNT1     IFEQ *BLANK
     C                     SETON                     9930
     C                     MOVELMSGTBL,1  @MSG1
     C                     ENDIF
     C*
     C           *IN99     IFEQ '0'
     C                     MOVELPLNT1     PLNT2
     C                     SETOF                     70
     C           PLNT2     CHAINAB#PPYY              70
     C           *IN70     IFEQ '1'
     C                     SETON                     9930
     C                     MOVELMSGTBL,3  @MSG1
     C                     ELSE
     C           FFSKJY    IFEQ 'D'
     C           FFSKDT    ANDLE*DATE
     C                     SETON                     9930
     C                     MOVELMSGTBL,3  @MSG1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDSR
      *---------------*
      * ADD SCREEN *
      *---------------*
     C           @DSP2     BEGSR
     C                     EXFMTAB#PWY12
     C                     MOVEL*BLANKS   @MSG2
     C                     SETOF                     993132
     C                     SETOF                     333435
     C                     SETOF                     3670
     C*
     C                     SELEC
     C           *INKC     WHEQ '1'
     C           *INKA     OREQ '1'
     C                     MOVEL'99'      W@ID
     C*
     C           *INKL     WHEQ '1'
     C                     CLEARAB#PWY11
     C                     MOVEL'01'      W@ID
     C*
     C           *INKE     WHEQ '1'
     C                     EXSR @ADCHK
     C           *IN99     IFEQ '0'
     C           *IN97     ANDEQ'0'
     C                     Z-ADD0         FFSKDT
     C                     MOVELPLNT2     FFCUST
     C                     MOVEL@TYPE2    FFCONT
     C                     Z-ADDW@YY      W@YY2
     C                     Z-ADDW@MM      W@MM2
     C                     Z-ADDW@DD      W@DD2
     C                     ADD  20000000  DATE2
     C                     MOVE DATE2     FFKODT
     C                     Z-ADDW@HH      FFKOHH
     C                     Z-ADDW@MIN     FFKOMN
     C                     MOVELUS        FFKOME
     C                     MOVEL#PGM      FFKGMN
     C           FFSKJY    IFEQ 'D'
     C           FFSKDT    ANDLE*DATE
     C                     MOVEL*BLANKS   FFSKJY
     C                     Z-ADD0         FFSKDT
     C                     UPDATAB#PPYY1
     C                     ELSE
     C                     WRITEAB#PPYY1
     C                     ENDIF
     C                     CLEARAB#PWY11
     C                     MOVELMSGTBL,10 @MSG1
     C                     SETON                     98
     C                     MOVEL'01'      W@ID
     C                     ENDIF
     C*
     C                     OTHER
     C                     EXSR @ADCHK
     C                     ENDSL
     C*
     C                     ENDSR
     C*-------
     C* CHANGE
     C*-------
     C           @DSP3     BEGSR
     C                     EXFMTAB#PWY13
     C                     MOVEL*BLANKS   @MSG3
     C                     SETOF                     993132
     C                     SETOF                     333435
     C                     SETOF                     3670
     C*
     C                     SELEC
     C           *INKC     WHEQ '1'
     C           *INKA     OREQ '1'
     C                     MOVEL'99'      W@ID
     C*
     C           *INKL     WHEQ '1'
     C                     CLEARAB#PWY11
     C                     MOVEL'01'      W@ID
     C*
     C           *INKG     WHEQ '1'
     C                     EXSR @CHCHK
     C           *IN99     IFEQ '0'
     C           *IN97     ANDEQ'0'
     C                     MOVE PLNT3     FFCUST
     C                     MOVEL@TYPE3    FFCONT
     C                     Z-ADDW@YY      W@YY2
     C                     Z-ADDW@MM      W@MM2
     C                     Z-ADDW@DD      W@DD2
     C                     ADD  20000000  DATE2
     C                     MOVE DATE2     FFKODT
     C                     Z-ADDW@HH      FFKOHH
     C                     Z-ADDW@MIN     FFKOMN
     C                     MOVELUS        FFKOME
     C                     MOVEL#PGM      FFKGMN
     C                     UPDATAB#PPYY1
     C                     CLEARAB#PWY11
     C                     MOVELMSGTBL,11 @MSG1
     C                     SETON                     98
     C                     MOVEL'01'      W@ID
     C                     ENDIF
     C*
     C                     OTHER
     C                     EXSR @CHCHK
     C                     ENDSL
     C*
     C                     ENDSR
     C*--------
     C* DELETE
     C*--------
     C           @DSP4     BEGSR
     C                     EXFMTAB#PWY14
     C                     MOVEL*BLANKS   @MSG4
     C* F3 EXIT
     C                     SELEC
     C           *INKC     WHEQ '1'
     C           *INKA     OREQ '1'
     C                     MOVEL'99'      W@ID
     C* F12
     C           *INKL     WHEQ '1'
     C                     CLEARAB#PWY11
     C                     MOVEL'01'      W@ID
     C* F9 DELETE
     C           *INKI     WHEQ '1'
     C                     MOVEL'D'       FFSKJY
     C                     Z-ADDW@YY      W@YY2
     C                     Z-ADDW@MM      W@MM2
     C                     Z-ADDW@DD      W@DD2
     C                     ADD  20000000  DATE2
     C                     MOVE DATE2     FFSKDT
     C                     MOVE DATE2     FFKODT
     C                     Z-ADDW@HH      FFKOHH
     C                     Z-ADDW@MIN     FFKOMN
     C                     MOVELUS        FFKOME
     C                     MOVEL#PGM      FFKGMN
     C                     UPDATAB#PPYY1
     C                     CLEARAB#PWY11
     C                     MOVELMSGTBL,12 @MSG1
     C                     SETON                     98
     C                     MOVEL'01'      W@ID
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*--------------
     C* ADD CHECK
     C*--------------
     C           @ADCHK    BEGSR
     C*
     C           @TYPE2    IFEQ *BLANKS
     C                     SETON                     3199
     C                     MOVELMSGTBL,4  @MSG2
     C                     ENDIF
     C*
     C                     ENDSR
     C*--------------
     C* CHG CHECK
     C*--------------
     C           @CHCHK    BEGSR
     C*
     C           @TYPE3    IFEQ *BLANKS
     C                     SETON                     3199
     C                     MOVELMSGTBL,4  @MSG3
     C                     ENDIF
     C*
     C                     ENDSR
** (MSGTBL)
E-01 ENTER PLANT CODE!
E-02 PLANT CODE ALREADY EXISTS!
E-03 PLANT CODE DOES NOT EXIST!
E-04 ENTER CONTAINER TYPE!
E-05
E-06
E-07
E-08
E-09
E-10 PROCESS FOR ADD RECORD IS COMPLETED.
E-11 PROCESS FOR CHANGE RECORD IS COMPLETED.
E-12 PROCESS FOR DELETE RECORD IS COMPLETED.

