     H            Y.
     F** AB#R486 *******************************************
     F* MIXED PALLET LIST (PART/PALLET) (OTICS ONLY)       *
     F*                                                    *
     F* JW    04/17/2017 CREATE(COPIED FROM AB#R482)       *
     F* LEC   03/27/2018 FINISHED IT                       *
     F***************************************(AB#R486)******
     FABWPP31 IF  E           K        DISK
     FAB#PP85 IF  E           K        DISK
     FAB#PR486O   E             70     PRINTER
     E*-----------------------------------------------------
     E                    WW          4  1
     E                    T1          5  1
     E                    T2         11  1
     E*-----------------------------------------------------
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1  20 S@MHN
     I                                        1   5 S@MHN1
     I                                        6  10 S@MHN2
     I                                       11  15 S@MHN3
     I                                       16  20 S@MHN4
     I            DS
     I                                        1   80INOHZ
     I                                        1   40YYYY
     I                                        5   60MM
     I                                        7   80DD
     I            DS
     I                                        1  10 WNOHZ
     I                                        1   2 WNOMM
     I                                        3   3 WNO1
     I                                        4   5 WNODD
     I                                        6   6 WNO2
     I                                        7  10 WNOYY
     I            DS
     I                                        1  17 WMHIN
     I                                        1   5 WMHN1
     I                                        6   6 WMH1
     I                                        7  11 WMHN2
     I                                       12  12 WMH2
     I                                       13  17 WMHN3
     I            DS
     I                                        1   80PHZ8
     I                                        1   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60WTIME
     I                                        1   20THH
     I                                        3   40TMM
     I                                        5   60TSS
      *****************************************************
      *          MAIN ROUTINE
      *****************************************************
     C                     EXSR #INIT
     C           *LOVAL    SETLLABWPP31
      *
     C                     DO   *HIVAL
      *
     C                     READ ABWPP31                  99
      * END?
     C           *IN99     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C* FIRST?
     C           FIRST     IFEQ 'Y'
     C                     MOVELIMHN      S@MHN
     C                     MOVELFCLOC1    S@LOC1
     C                     MOVELFCLOC2    S@LOC2
     C                     MOVELFCLOC3    S@LOC3
     C                     MOVELFCLOC4    S@LOC4
     C                     MOVE 'N'       FIRST
     C                     ENDIF
     C* BREAK?
     C           IMHN      IFNE S@MHN
     C                     EXSR #BREAK
     C                     ENDIF
     C* DETAIL PROCESS
     C                     EXSR #DTL
      *
     C                     ENDDO
      * FINAL PROCESS
     C           FIRST     IFEQ 'N'
     C                     EXSR #BREAK
     C                     ENDIF
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C******************************************************
     C*  BREAK PROCESS
     C******************************************************
     C           #BREAK    BEGSR
      *
     C                     Z-ADDBOXCNT    WRKTOT  50
     C                     Z-ADD*ZERO     BOXCNT
      *
     C                     MOVELS@MHN1    WMHN1
     C                     MOVE '-'       WMH1
     C                     MOVELS@MHN2    WMHN2
     C           S@MHN3    IFNE *BLANKS
     C                     MOVE '-'       WMH2
     C                     ENDIF
     C                     MOVELS@MHN3    WMHN3
      *
     C           WRKTOT    DOUEQ*ZERO
      *
     C                     EXSR @HDR
      *
     C           WRKTOT    IFGE PMXPL
     C           WRKTOT    SUB  PMXPL     WRKTOT
     C                     Z-ADDPMXPL     BOXCNT
     C                     ELSE
     C                     Z-ADDWRKTOT    BOXCNT
     C                     Z-ADD0         WRKTOT
     C                     ENDIF
      *
     C                     WRITEAB#PR442
      *
     C                     Z-ADDBOXCNT    THAKO
     C                     EXSR #LARG
     C                     WRITEAB#PR443
      *
     C                     ENDDO
      *
      * RESET ------------------------------------
     C           @RESET    TAG
     C                     MOVELIMHN      S@MHN
     C                     MOVELFCLOC1    S@LOC1
     C                     MOVELFCLOC2    S@LOC2
     C                     MOVELFCLOC3    S@LOC3
     C                     MOVELFCLOC4    S@LOC4
     C                     Z-ADD*ZERO     BOXCNT
      *
     C                     ENDSR
     C******************************************************
     C           @HDR      BEGSR
     C******************************************************
      *
     C                     MOVEL*BLANKS   SPART  17        PART#
     C                     Z-ADD*DATE     PHZ8
     C                     TIME           WTIME
     C                     ADD  1         WD#BOX
     C                     EXSR #EDTPL
     C                     WRITEAB#PR441
      *
     C                     ENDSR
     C******************************************************
     C*          DETAIL PROCESS
     C******************************************************
     C           #DTL      BEGSR
      *
     C* GET SBAN FROM AB#PP85
     C                     Z-ADDITOKU     KTOKU
     C                     Z-ADDINONY     KNONY            DELIVERY CODE
     C           KEY2      SETGTAB#PP85
     C           *IN90     DOUEQ*ON
     C           KEY2      REDPEAB#PP85                  90
     C           *IN90     IFEQ *OFF
     C           A5DATE    ANDLEINOHZ
     C                     MOVELA5SBAN    WSBAN     P
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN90     IFEQ *ON
     C                     MOVELISBAN     WSBAN     P
     C                     ENDIF
      *
     C                     ADD  FC#BOX    BOXCNT
      *
     C                     MOVELS@MHN1    WMHN1
     C                     MOVE '-'       WMH1
     C                     MOVELS@MHN2    WMHN2
     C           S@MHN3    IFNE *BLANKS
     C                     MOVE '-'       WMH2
     C                     ENDIF
     C                     MOVELS@MHN3    WMHN3
      *
     C                     MOVE YYYY      WNOYY
     C                     MOVE MM        WNOMM
     C                     MOVE DD        WNODD
     C                     MOVE '/'       WNO1
     C                     MOVE '/'       WNO2
      *
     C                     ENDSR
     C******************************************************
     C           #FOOT     BEGSR
     C******************************************************
      *
     C                     EXSR #LARG
     C                     WRITEAB#PR443
      *
     C                     ENDSR
     C******************************************************
     C           #EDTPL    BEGSR
     C******************************************************
     C                     MOVELWD#BOX    W@A5    5
     C                     MOVEAW@A5      T1
     C                     Z-ADD*ZERO     X       20
     C                     Z-ADD*ZERO     Y       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C           T1,X      IFEQ *ZERO
     C                     ITER
     C                     ENDIF
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C                     MOVELT1,X      T2,Y
     C                     ADD  1         X
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ADD  1         Y
     C                     MOVEL'/'       T2,Y
     C*
     C                     MOVELWT#PAL    W@A5
     C                     MOVEAW@A5      T1
     C                     Z-ADD*ZERO     X       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C           T1,X      IFEQ *ZERO
     C                     ITER
     C                     ENDIF
     C                     DO   *HIVAL
     C                     ADD  1         Y
     C                     MOVELT1,X      T2,Y
     C                     ADD  1         X
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           X         IFGT 5
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C                     MOVEAT2        @#PLT
     C*
     C                     ENDSR
     C******************************************************
     C           #LARG     BEGSR
     C******************************************************
      * --- PRINT LARGE CHR ---
     C                     MOVELWNOMM     WW,1
     C                     MOVE WNOMM     WW,2
     C                     MOVELWNODD     WW,3
     C                     MOVE WNODD     WW,4
     C*
     C           1         DO   4         CC      10
     C*
     C                     MOVE *BLANKS   #L1
     C                     MOVE *BLANKS   #L2
     C                     MOVE *BLANKS   #L3
     C                     MOVE *BLANKS   #L4
     C                     MOVE *BLANKS   #L5
     C                     MOVE *BLANKS   #L6
     C                     MOVE *BLANKS   #L7
     C                     MOVE *BLANKS   #L8
     C                     MOVE WW,CC     #CHR
     C                     CALL 'AB#R4P'  P#CMD
     C           CC        IFEQ 1
     C                     MOVE #L1       #11
     C                     MOVE #L2       #12
     C                     MOVE #L3       #13
     C                     MOVE #L4       #14
     C                     MOVE #L5       #15
     C                     MOVE #L6       #16
     C                     MOVE #L7       #17
     C                     MOVE #L8       #18
     C                     ENDIF
     C           CC        IFEQ 2
     C                     MOVE #L1       #21
     C                     MOVE #L2       #22
     C                     MOVE #L3       #23
     C                     MOVE #L4       #24
     C                     MOVE #L5       #25
     C                     MOVE #L6       #26
     C                     MOVE #L7       #27
     C                     MOVE #L8       #28
     C                     ENDIF
     C           CC        IFEQ 3
     C                     MOVE #L1       #31
     C                     MOVE #L2       #32
     C                     MOVE #L3       #33
     C                     MOVE #L4       #34
     C                     MOVE #L5       #35
     C                     MOVE #L6       #36
     C                     MOVE #L7       #37
     C                     MOVE #L8       #38
     C                     ENDIF
     C           CC        IFEQ 4
     C                     MOVE #L1       #41
     C                     MOVE #L2       #42
     C                     MOVE #L3       #43
     C                     MOVE #L4       #44
     C                     MOVE #L5       #45
     C                     MOVE #L6       #46
     C                     MOVE #L7       #47
     C                     MOVE #L8       #48
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *=================================================
      *  INITIAL SETTING
      *=================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PMXPL   30
      *
     C                     MOVE '===='    BA1     4
     C                     MOVE '===='    BA2     4
      *
     C           P#CMD     PLIST
     C                     PARM           #CHR    1
     C                     PARM           #L1     6
     C                     PARM           #L2     6
     C                     PARM           #L3     6
     C                     PARM           #L4     6
     C                     PARM           #L5     6
     C                     PARM           #L6     6
     C                     PARM           #L7     6
     C                     PARM           #L8     6
      *
     C           KEY1      KLIST
     C                     KFLD           KTOKU   40       CUSTOMER CODE
     C                     KFLD           KNONY   40       DELIVERY CODE
      *
     C           KEY2      KLIST
     C                     KFLD           KTOKU
     C                     KFLD           KNONY
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
      * GET TOTAL BOXES
     C                     Z-ADD*ZERO     WW#BOX  90
      *
     C           *LOVAL    SETLLABWPP31
     C                     DO   *HIVAL
     C                     READ ABWPP31                  99
      *
     C           *IN99     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
      * get number of pallets
     C           IMHN      IFNE S@MHN
      *
     C           WW#BOX    DIV  PMXPL     WK#PAL  50
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         WK#PAL
     C                     ENDIF
      *
     C                     ADD  WK#PAL    WT#PAL  50
     C                     Z-ADD*ZERO     WW#BOX
     C                     ENDIF
      *
     C                     MOVELIMHN      S@MHN
     C                     ADD  FC#BOX    WW#BOX
      *
     C                     ENDDO
      *
     C           WW#BOX    IFGT *ZERO
      *
     C           WW#BOX    DIV  PMXPL     WK#PAL
     C                     MVR            @@MVR
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         WK#PAL
     C                     ENDIF
      *
     C                     ADD  WK#PAL    WT#PAL
     C                     ENDIF
      *
     C                     MOVEL*BLANK    S@MHN
     C                     MOVEL*BLANK    S@LOC1  1
     C                     MOVEL*BLANK    S@LOC2  2
     C                     MOVEL*BLANK    S@LOC3  2
     C                     MOVEL*BLANK    S@LOC4  1
     C                     Z-ADD0         BOXCNT
     C                     Z-ADD0         WD#BOX  50
      *
     C                     MOVE 'Y'       FIRST   1
      *
     C                     ENDSR
