     H            Y
      *------------------------------------------------------
      *  SHIP TOTAL
      *   PGM ID:      AB#RA4
      *   CREATE DATE: FEB/05/02
      *          BY  : TCH
TCHK1 * TCHK1 12/26/05 CHG
      *------------------------------------------------------
     FAB#PWA4 CF  E                    WORKSTN
     FAB#PL06 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAB#WPA4 O   E           K        DISK                      A
      *-----------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-----------------------------------------------------------
     C                     EXSR #SCRN1
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@ID    1
     C                     PARM           P@YY    40
     C                     PARM           P@MM    20
TCHK1C                     PARM           P@SORT  1
     C           K#KEY     KLIST
     C                     KFLD           D@YY
     C                     KFLD           D@MM
      *
     C                     MOVE *BLANK    P@ID
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------------
     C           *INKA     DOUEQ*ON
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '9'       P@ID
     C                     OTHER
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     Z-ADDD@YY      P@YY
     C                     Z-ADDD@MM      P@MM
TCHK1C                     MOVELD@SORT    P@SORT
     C                     MOVE *ON       *INKA
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #CHK      BEGSR
      *
TCHK1C*                    MOVEA'00'      *IN,61
TCHK1C                     MOVEA'000'     *IN,61
     C                     MOVE *OFF      *IN99
     C           D@YY      IFEQ *ZERO
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@MM      IFEQ *ZERO
     C                     SETON                     6299
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C           K#KEY     CHAINAB#PL06              90
     C           *IN90     IFEQ *ON
     C                     SETON                     626199
     C                     ENDIF
     C                     ENDIF
      *
TCHK1C           D@SORT    IFEQ '1'
TCHK1C           D@SORT    OREQ '2'
TCHK1C                     ELSE
TCHK1C                     SETON                     6199
TCHK1C                     END
TCHK1 *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #OUT      BEGSR
      *
     C           K#KEY     SETLLAB#PL06
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PL06                  90
     C           *IN90     IFEQ *OFF
     C           B1SKJY    ANDEQ*BLANK
TCHK1 *
TCHK1C           K#KEY2    KLIST
TCHK1C                     KFLD           B1TOKU
TCHK1C                     KFLD           B1NONY
TCHK1C                     KFLD           B1NKOJ
TCHK1C                     KFLD           B1NUKE
TCHK1C           K#KEY2    CHAINGADPL11              91
TCHK1C  N91                MOVELB5KMEI    B1KMEI
TCHK1C   91                MOVEL*BLANK    B1KMEI
TCHK1 *
     C                     WRITEAB#WPA41
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
