     H            Y.
      ** AB#RFP **************************
      *  MAKING JULIAN CALENDAR          *
      *  K.KASHIWAGI 2000.12.20          *
      *  TCHK1       2006.01.03          *
      *  TCHK2       2006.07.12          *
      ******************* AB#RFP *********
     F*AB#PWFP CF  E                    WORKSTN
     FABFEP01 UF  E           K        DISK                      A
     FAGDPL12 IF  E           K        DISK
      *
     E*******             MSGTBL  1   1 60
     I            DS
     I                                        1  140#TIME
     I                                        1   20W@HH
     I                                        3   40W@MIN
     I                                        5   60W@SS
     I                                        7  100YEAR
     I            DS
     I                                        1   80DATE
     I                                        1   20W@MM
     I                                        3   40W@DD
     I                                        5   60W@CT
     I                                        7   80W@YY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------*
      * PARM *
      *------*
     C*          *ENTRY    PLIST
     C*                    PARM           USID   10
      *-----*
      * KEY *
      *-----*
     C           KEYY      KLIST
     C                     KFLD           KYEAR   40
     C*
     C           KEYYM     KLIST
     C                     KFLD           KYEAR   40
     C                     KFLD           KMON    20
     C*
     C*                    MOVEL'01'      W@ID    2
     C*
     C*          W@ID      DOWNE'98'
     C*          W@ID      CASEQ'01'      @DSP1
     C*                    ENDCS
     C*                    ENDDO
      *
     C                     EXSR @GET
      *
     C                     SETON                     LR
     C                     RETRN
     C*----------
     C* DISPLAY
     C*----------
     C*          @DSP1     BEGSR
     C*                    EXFMTAB#PWFP1
     C*                    MOVEL*BLANKS   MSG
     C*                    MOVEL'0'       *IN99
     C*
     C*                    SELEC
     C*          *INKA     WHEQ '1'
     C*                    MOVEL'98'      W@ID
     C*          *INKE     WHEQ '1'
     C*                    EXSR @CHK
     C*                    ENDSL
     C*
     C*                    ENDSR
     C*----------
     C* YEAR CHECK
     C*----------
     C*          @CHK      BEGSR
     C*          #YEAR     IFLE 0
     C*          #YEAR     ORGT 9999
     C*                    SETON                     99
     C*                    MOVELMSGTBL,1  MSG
     C*                    ELSE
     C*                    EXSR @GET
     C*                    ENDIF
     C*                    ENDSR
     C*-------------
     C* GET CALENDAR
     C*-------------
     C           @GET      BEGSR
     C                     SETOF                     90
     C                     TIME           #TIME
     C                     Z-ADDYEAR      KYEAR
     C*
     C                     Z-ADD0         SAVMM   20
     C                     Z-ADD0         SAVDD   30
     C                     Z-ADD0         SAVJD   30
     C*
     C           KEYY      SETLLAGDPL12
     C           *IN90     DOWEQ'0'
TCHK1C*          KEYY      READEAGDPL12                  90
TCHK1C                     READ AGDPL12                  90
     C           *IN90     IFEQ '0'
     C*
     C           F8KAMM    IFNE SAVMM
TCHK2C*                    ADD  1         SAVMM
TCHK2C           F8KAYY    IFNE KYEAR
TCHK2C                     Z-ADD*ZERO     SAVDD
TCHK2C                     Z-ADD*ZERO     SAVJD
TCHK2C                     END
TCHK2C                     Z-ADDF8KAYY    KYEAR
TCHK2C                     Z-ADDF8KAMM    SAVMM
     C                     Z-ADDSAVMM     KMON
     C           KEYYM     CHAINABFEP01              80
     C*
     C           *IN80     IFEQ '0'
     C                     ADD  SAVDD     SAVJD
     C                     Z-ADDSAVJD     QB#DAY
     C                     MOVEL#USER     QBKOME
     C                     TIME           #TIME
     C                     Z-ADD*YEAR     QBKOYY
     C                     Z-ADD*MONTH    QBKOMM
     C                     Z-ADD*DAY      QBKODD
     C                     Z-ADDW@HH      QBKOHH
     C                     Z-ADDW@MIN     QBKOSS
     C                     UPDATABFEP01R
     C                     ELSE
     C                     ADD  SAVDD     SAVJD
     C                     Z-ADDSAVJD     QB#DAY
     C                     Z-ADDKYEAR     QBYYYY
     C                     Z-ADDSAVMM     QBMMMM
     C                     MOVEL#USER     QBKOME
     C                     TIME           #TIME
     C                     Z-ADD*YEAR     QBKOYY
     C                     Z-ADD*MONTH    QBKOMM
     C                     Z-ADD*DAY      QBKODD
     C                     Z-ADDW@HH      QBKOHH
     C                     Z-ADDW@MIN     QBKOSS
     C                     WRITEABFEP01R
     C                     ENDIF
     C*
     C                     ENDIF
     C                     Z-ADDF8KADD    SAVDD   30
     C                     Z-ADDF8KAMM    SAVMM   20
     C*
     C                     ENDIF
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
     C                     ENDSR
