     H            Y.
     F** AB#RFI *********************************
     F*  ..PRINT BILL OF LADING..               *
     F*                                         *
     F*   A-MAMIYA         2000.10.27           *
     F*   N-HYOTO  2001.02.08 ADD CLOSE COMMAND *
     F*   H-AMANO  2001.08.07 CHECK VALID DATE  *
TCH  F*   TCH      2005.02.03 ADDED OPTION 4    *
     F* TCHK1 12/31/09 ADD DELIVERY GROUP       *
     F* TCHK2 05/11/11 ADD CUATITLAUN(AP23A:5163) GROUP#2
     F* TCHK3 11/11/11 ADD RELEASE DATE TO DELIVERY
     F* TCHK4 04/27/12 CHG DELIVERY GROUP       *
     F* TCHK5 05/01/12 CHG DELIVERY GROUP(5150,5173)
     F* TCHK6 07/03/12 CHG DELIVERY GROUP(5164,5173)
     F* TCHK7 03/13/13 CHG DELIVERY GROUP ALL(=0)
     F* TCHK8 03/15/13 CHG DELIVERY GROUP '3'
     F***************************** AB#RFI ******
     FAB#PWFI CF  E                    WORKSTN
     FABFDL01 IF  E           K        DISK
     FABF6L03 IF  E           K        DISK                           UC
     FABF6L04 IF  E           K        DISK                           UC
     F            ABF6P011                          KRENAMEABF6L041
TCH  FABF6L07 IF  E           K        DISK                           UC
TCH  F            ABF6P011                          KRENAMEABF6L071
     FABF9L01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAB#WPFI1O   F     256            DISK                           UC
     E                    ERR     1  20 60
TCHK5E                    GRP2    1   2  4
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80FCSKHZ
     I                                        1   40FCSKYY
     I                                        5   60FCSKMM
     I                                        7   80FCSKDD
     I            DS
     I                                        1   80FCSHDT
     I                                        1   40FCSHYY
     I                                        5   60FCSHMM
     I                                        7   80FCSHDD
     I            DS
     I                                        1   80FCRYHZ
     I                                        1   40FCRYYY
     I                                        5   60FCRMMM
     I                                        7   80FCRDDD
     I            DS
     I                                        1   80@REHZ2
     I                                        1   40@REYY2
     I                                        5   60@REMM2
     I                                        7   80@REDD2
     I            DS
     I                                        1   80@SIHZ2
     I                                        1   40@SIYY2
     I                                        5   60@SIMM2
     I                                        7   80@SIDD2
     I            DS
     I                                        1   80@SIHZ3
     I                                        1   40@SIYY3
     I                                        5   60@SIMM3
     I                                        7   80@SIDD3
TCHK3I            DS
TCHK3I                                        1   80@RLHZ3
TCHK3I                                        1   40@RLYY3
TCHK3I                                        5   60@RLMM3
TCHK3I                                        7   80@RLDD3
TCH  I            DS
 |   I                                        1   80@SIHZ4
     I                                        1   40@SIYY4
 |   I                                        5   60@SIMM4
TCH  I                                        7   80@SIDD4
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@CAR  15
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     MOVEL*BLANK    @DATA   1
     C                     MOVEL*BLANK    @KOKB1
     C                     MOVEL*BLANK    @KOKB2
     C                     MOVEL*BLANK    @KOKB3
TCH  C                     MOVEL*BLANK    @KOKB4
     C                     MOVEL*BLANK    @BINO1           BILL OF LADING
     C                     MOVEL*BLANK    @BINO2           BILL OF LADING
     C                     Z-ADD0         @REHZ2           RELEASED DATE
     C                     Z-ADD0         @SIHZ2           SHIPPING DATE
     C                     Z-ADD0         @DECD3           DELIVERY CODE
     C                     Z-ADD0         @SIHZ3           SHIPPING DATE
TCHK3C                     Z-ADD0         @RLHZ3           RELEASE  DATE
     C                     Z-ADD0         @SIBN3           BIN
TCH  C                     Z-ADD0         @SIHZ4           SHIPPING DATE
TCH  C                     Z-ADD0         @SIBN4           BIN
     C                     Z-ADD*ZERO     D@SHDT
      *
     C           @STP1     TAG
     C                     EXFMTAB#PWFI1
     C                     MOVEL*BLANK    @DATA
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     109911
TCHK1C                     SETOF                     14
TCHK3C                     SETOF                     15
     C*
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
     C*
     C           @KOKB1    IFEQ *BLANK
     C           @KOKB2    ANDEQ*BLANK
     C           @KOKB3    ANDEQ*BLANK
TCH  C           @KOKB4    ANDEQ*BLANK
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELERR,1     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB1    IFNE *BLANK
     C           @KOKB2    ANDNE*BLANK
     C           @KOKB3    ANDNE*BLANK
TCH  C           @KOKB4    ANDNE*BLANK
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB1    IFNE *BLANK
     C           @KOKB2    ANDNE*BLANK
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB1    IFNE *BLANK
     C           @KOKB3    ANDNE*BLANK
     C                     SETON                     0103
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB2    IFNE *BLANK
     C           @KOKB3    ANDNE*BLANK
     C                     SETON                     0203
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
TCH  C*
     C           @KOKB4    IFNE *BLANK
     C           @KOKB1    ANDNE*BLANK
     C                     SETON                     0111
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C           @KOKB4    IFNE *BLANK
     C           @KOKB2    ANDNE*BLANK
     C                     SETON                     1102
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C           @KOKB4    IFNE *BLANK
     C           @KOKB3    ANDNE*BLANK
     C                     SETON                     1103
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
TCH  C*
     C*
     C           @KOKB1    IFEQ *BLANK
     C           @KOKB1    OREQ '1'
     C                     ELSE
     C                     SETON                     0199
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB2    IFEQ *BLANK
     C           @KOKB2    OREQ '1'
     C                     ELSE
     C                     SETON                     0299
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
     C*
     C           @KOKB3    IFEQ *BLANK
     C           @KOKB3    OREQ '1'
     C                     ELSE
     C                     SETON                     0399
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
TCH  C*
     C           @KOKB4    IFEQ *BLANK
     C           @KOKB4    OREQ '1'
     C                     ELSE
     C                     SETON                     1199
     C                     MOVELERR,2     MSG
     C                     GOTO @STP1
     C                     END
TCH  C*
     C*
     C           @KOKB1    IFEQ '1'
     C           @BINO1    IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVELERR,3     MSG
     C                     GOTO @STP1
     C                     END
     C                     END
     C*
     C           @KOKB2    IFEQ '1'
     C           @BINO2    IFEQ *BLANK
     C                     SETON                     0599
     C                     MOVELERR,3     MSG
     C                     GOTO @STP1
     C                     END
     C           @REHZ2    IFEQ 0
     C                     SETON                     0699
     C                     MOVELERR,4     MSG
     C                     GOTO @STP1
     C                     END
     C           @REYY2    IFLT 2000
     C           @REMM2    ORLT 1
     C           @REMM2    ORGT 12
     C           @REDD2    ORLT 1
     C           @REDD2    ORGT 31
     C                     SETON                     0699
     C                     MOVELERR,5     MSG
     C                     GOTO @STP1
     C                     END
     C           @SIHZ2    IFEQ 0
     C                     SETON                     0799
     C                     MOVELERR,6     MSG
     C                     GOTO @STP1
     C                     END
     C           @SIYY2    IFLT 2000
     C           @SIMM2    ORLT 1
     C           @SIMM2    ORGT 12
     C           @SIDD2    ORLT 1
     C           @SIDD2    ORGT 31
     C                     SETON                     0799
     C                     MOVELERR,9     MSG
     C                     GOTO @STP1
     C                     END
     C                     END
     C*
B0   C           @KOKB3    IFEQ '1'
TCHK7C*B1        @DECD3    IFEQ 0
TCHK7C*TCHK1     @GRP##    ANDEQ0
TCHK7C*TCHK1 ****          SETON                     0899
TCHK7C*TCHK1               SETON                     089914
TCHK7C*                    MOVELERR,7     MSG
TCHK7C*                    GOTO @STP1
TCHK7C*E1                  END
      *
TCHK1C           @DECD3    IFNE 0
TCHK1C           @GRP##    ANDNE0
TCHK1C                     SETON                     089914
TCHK1C                     MOVELERR,7     MSG
TCHK1C                     GOTO @STP1
TCHK1C                     END
B1   C           @SIHZ3    IFEQ 0
     C                     SETON                     0999
     C                     MOVELERR,6     MSG
     C                     GOTO @STP1
E1   C                     END
B1   C           @SIYY3    IFLT 2000
     C           @SIMM3    ORLT 1
     C           @SIMM3    ORGT 12
     C           @SIDD3    ORLT 1
     C           @SIDD3    ORGT 31
     C                     SETON                     0999
     C                     MOVELERR,9     MSG
     C                     GOTO @STP1
E1   C                     END
TCHK3C           @RLHZ3    IFEQ 0
TCHK3C                     SETON                     1599
TCHK3C                     MOVELERR,6     MSG
TCHK3C                     GOTO @STP1
TCHK3C                     END
B1   C           @SIBN3    IFEQ 0
     C                     SETON                     1099
     C                     MOVELERR,8     MSG
     C                     GOTO @STP1
E1   C                     END
E0   C                     END
TCH  C*
B0 | C           @KOKB4    IFEQ '1'
B1   C           @SIHZ4    IFEQ 0
     C                     SETON                     1299
     C                     MOVELERR,6     MSG
     C                     GOTO @STP1
E1   C                     END
B1   C           @SIYY4    IFLT 2000
     C           @SIMM4    ORLT 1
     C           @SIMM4    ORGT 12
     C           @SIDD4    ORLT 1
     C           @SIDD4    ORGT 31
     C                     SETON                     1299
     C                     MOVELERR,9     MSG
     C                     GOTO @STP1
E1   C                     END
B1   C           @SIBN4    IFEQ 0
     C                     SETON                     1399
     C                     MOVELERR,8     MSG
     C                     GOTO @STP1
E1   C                     END
E0 | C                     END
TCH  C*
      *
     C           D@SHDT    IFNE *ZERO
     C                     Z-ADDD@SHDT    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     1199
     C                     MOVELERR,11    MSG
     C                     GOTO @STP1
     C                     ENDIF
     C                     ENDIF
     C*
     C           *INKE     IFEQ '0'
     C                     GOTO @STP1
     C                     END
      *
      * F5: PROCESS =======================================
     C                     CALL 'AB#CFJ'                   CLEAR WORK FILES
     C                     OPEN AB#WPFI1
     C*
     C                     MOVE D@CARR    P@CAR            CARRIER NAME
      *
      * (1) BY B/L# ---------------------------------------
     C           @KOKB1    IFEQ '1'
     C                     MOVEL*BLANK    KBINO  11
     C                     MOVEL@BINO1    KBINO  11
     C*
     C                     OPEN ABF6L03
     C                     SETOF                     20
     C           KBINO     SETLLABF6L03
     C                     DO   *HIVAL
     C           KBINO     READEABF6L03                  20
     C           *IN20     IFEQ '0'
     C           FCSKJY    IFEQ 'D'
     C**         FCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #PLANT
     C           D@SHDT    IFEQ *ZERO
     C                     Z-ADDFCSHDT    D@SHDT
     C                     ENDIF
      *
      *(1)****************************
     C                     EXCPTDT
      ********************************
      *
     C           @DATA     IFEQ *BLANK
     C                     MOVEL'*'       @DATA
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C  N20                ENDDO
      *
     C                     CLOSEABF6L03
     C                     ENDIF
      *
      * (2) BY B/L# + DATE ---------------------------------
     C           @KOKB2    IFEQ '1'
     C                     MOVEL*BLANK    KBINO  11
     C                     MOVEL@BINO2    KBINO  11
      *
     C           KEY1      KLIST
     C                     KFLD           KBINO
     C                     KFLD           @REYY2
     C                     KFLD           @REMM2
     C                     KFLD           @REDD2
     C                     KFLD           @SIHZ2
      *
     C                     OPEN ABF6L03
     C                     SETOF                     20
     C           KEY1      SETLLABF6P011
     C                     DO   *HIVAL
     C           KEY1      READEABF6P011                 20
     C           *IN20     IFEQ '0'
     C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #PLANT
     C           D@SHDT    IFEQ *ZERO
     C                     Z-ADDFCSHDT    D@SHDT
     C                     ENDIF
      *
      *(2)****************************
     C                     EXCPTDT
      ********************************
      *
     C           @DATA     IFEQ *BLANK
     C                     MOVEL'*'       @DATA
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C  N20                ENDDO
     C                     CLOSEABF6L03
     C                     ENDIF
      *
      * (3) BY DELIV# + DATE -------------------------------
B0   C           @KOKB3    IFEQ '1'
      *
TCHK1C           @DECD3    IFNE 0
TCHK1C*
     C           KEY2      KLIST
     C                     KFLD           @DECD3
     C                     KFLD           @SIHZ3
     C                     KFLD           @SIBN3
      *
     C                     OPEN ABF6L04
     C                     SETOF                     20
     C           KEY2      SETLLABF6L041
B1   C                     DO   *HIVAL
     C           KEY2      READEABF6L041                 20
B2   C           *IN20     IFEQ '0'
B3   C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
TCHK3C           FCRYHZ    IFNE @RLHZ3
TCHK3C                     ITER
TCHK3C                     ENDIF
     C                     EXSR #PLANT
B4   C           D@SHDT    IFEQ *ZERO
     C                     Z-ADDFCSHDT    D@SHDT
E4   C                     ENDIF
      *
      *(3)****************************
     C                     EXCPTDT
      ********************************
      *
B4   C           @DATA     IFEQ *BLANK
     C                     MOVEL'*'       @DATA
E4   C                     ENDIF
E3   C                     ENDIF
E2   C                     ENDIF
E1   C  N20                ENDDO
     C                     CLOSEABF6L04
TCHK1C*
TCHK1C                     ELSE
TCHK1C*
TCHK1C           KEY5      KLIST
TCHK1C                     KFLD           @SIHZ3
TCHK1C                     KFLD           @SIBN3
TCHK1C*
TCHK1C                     OPEN ABF6L07
TCHK1C                     SETOF                     20
TCHK1C           KEY5      SETLLABF6L071
TCHK1C                     DO   *HIVAL
TCHK1C           KEY5      READEABF6L071                 20
TCHK1C   20                LEAVE
TCHK1C           FCSKJY    IFEQ 'D'
TCHK1C           FCSKHZ    ANDLE*DATE
TCHK1C                     ITER
TCHK1C                     ENDIF
TCHK3C           FCRYHZ    IFNE @RLHZ3
TCHK3C                     ITER
TCHK3C                     ENDIF
TCHK1C                     MOVEL*OFF      W@SLCT  1
TCHK1C                     EXSR #PLNT#
TCHK1C           W@SLCT    IFEQ *OFF
TCHK1C                     ITER
TCHK1C                     ENDIF
TCHK1C           D@SHDT    IFEQ *ZERO
TCHK1C                     Z-ADDFCSHDT    D@SHDT
TCHK1C                     ENDIF
      *
      *(4)****************************
     C                     EXCPTDT
      ********************************
      *
TCHK1C           @DATA     IFEQ *BLANK
TCHK1C                     MOVEL'*'       @DATA
TCHK1C                     ENDIF
TCHK1C                     ENDDO
TCHK1C                     CLOSEABF6L07
TCHK1C*
TCHK1C                     ENDIF
     C                     ENDIF
      *
      * (4) BY SHIP DATE + BIN# ----------------------------
B0 | C           @KOKB4    IFEQ '1'
      *
     C           KEY4      KLIST
     C                     KFLD           @SIHZ4
     C                     KFLD           @SIBN4
      *
     C                     OPEN ABF6L07
     C                     SETOF                     20
     C           KEY4      SETLLABF6L071
B1   C                     DO   *HIVAL
     C           KEY4      READEABF6L071                 20
B2   C           *IN20     IFEQ '0'
B3   C           FCSKJY    IFEQ 'D'
     C           FCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #PLANT
B4   C           D@SHDT    IFEQ *ZERO
     C                     Z-ADDFCSHDT    D@SHDT
E4   C                     ENDIF
      *
      *(5)****************************
     C                     EXCPTDT
      ********************************
      *
B4   C           @DATA     IFEQ *BLANK
     C                     MOVEL'*'       @DATA
E4   C                     ENDIF
E3   C                     ENDIF
E2   C                     ENDIF
E1   C  N20                ENDDO
     C                     CLOSEABF6L07
E0 | C                     ENDIF
TCH  C*
B0   C           @DATA     IFEQ '*'
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,10    MSG
     C                     CLOSEAB#WPFI1
     C                     GOTO @STP1
E0   C                     ENDIF
      **** END
     C*****************************************************************
     CSR         #PLANT    BEGSR
     C*****************************************************************
     C           KEY3      KLIST
     C                     KFLD           WDELY
     C                     KFLD           WDOCK
     C*
     C                     Z-ADD0         WDELY   40
     C                     MOVEL*BLANK    WDOCK   4
     C                     MOVE FCDELY    WDELY
     C                     MOVELFCDOCK    WDOCK
     C                     MOVEL*BLANK    WWPLAN  5
      *
     C           KEY3      SETGTABFDL01R
     C           *IN30     DOUEQ*ON
     C           KEY3      REDPEABFDL01R                 30
     C           *IN30     IFEQ '0'
     C                     SELEC
     C           QASKJY    WHEQ 'D'
     C           QASKHZ    ANDLE*DATE
     C                     ITER
     C           QAEFHZ    WHGT *DATE
     C                     ITER
     C                     OTHER
     C                     MOVELQAPLAN    WWPLAN
     C                     LEAVE
     C                     ENDSL
     C                     END
     C                     END
      *
     C           FCCUST    IFEQ 5149
     C           WWPLAN    ANDEQ*BLANK
     C                     MOVE FCDELY    @@4     4
     C           @@4       CHAINABF9L01              30
     C           *IN30     IFEQ *OFF
     C                     MOVELF9DOCK    WWPLAN
     C                     ENDIF
     C                     ENDIF
      *
     CSR         EPLANT    ENDSR
TCHK1C*****************************************************************
TCHK1CSR         #PLNT#    BEGSR
TCHK1C*****************************************************************
TCHK1C                     MOVE FCDELY    WDELY
TCHK1C                     MOVELFCDOCK    WDOCK
TCHK1C                     MOVEL*BLANK    WWPLAN  5
TCHK1C                     MOVEL*BLANK    W@A002  2
TCHK1C*
TCHK1C           KEY3      SETGTABFDL01R
TCHK1C           *IN30     DOUEQ*ON
TCHK1C           KEY3      REDPEABFDL01R                 30
TCHK1C           *IN30     IFEQ '0'
TCHK1C                     SELEC
TCHK1C           QASKJY    WHEQ 'D'
TCHK1C           QASKHZ    ANDLE*DATE
TCHK1C                     ITER
TCHK1C           QAEFHZ    WHGT *DATE
TCHK1C                     ITER
TCHK1C                     OTHER
TCHK1C                     MOVELQAPLAN    WWPLAN
TCHK1C                     MOVELQAPLAN    W@A002
TCHK8C           @GRP##    IFEQ 3
TCHK1C           W@A002    IFEQ 'IE'
TCHK1C                     MOVEL*ON       W@SLCT
TCHK8C                     ELSE
TCHK1C                     LEAVE
TCHK1C                     END
TCHK8C                     END
TCHK1C                     MOVELFCDELY    W@A004  4
TCHK1C           W@A004    LOKUPGRP2                     31
TCHK1C           @GRP##    IFEQ 1
TCHK1C           *IN31     IFEQ *OFF
TCHK1C                     MOVEL*ON       W@SLCT
TCHK1C                     END
TCHK7C                     END
TCHK7C*TCHK1               ELSE
TCHK7C           @GRP##    IFEQ 2
TCHK1C           *IN31     IFEQ *ON
TCHK1C                     MOVEL*ON       W@SLCT
TCHK1C                     END
TCHK1C                     END
TCHK7C           @GRP##    IFEQ 0
TCHK7C                     MOVEL*ON       W@SLCT
TCHK7C                     END
TCHK1C                     LEAVE
TCHK1C                     ENDSL
TCHK1C                     END
TCHK1C                     ENDDO
TCHK1C*
TCHK1C           FCCUST    IFEQ 5149
TCHK1C           WWPLAN    ANDEQ*BLANK
TCHK1C                     MOVE FCDELY    @@4     4
TCHK1C           @@4       CHAINABF9L01              30
     C           *IN30     IFEQ *OFF
     C                     MOVELF9DOCK    WWPLAN
     C                     ENDIF
     C                     ENDIF
      *
     CSR         EPLNT#    ENDSR
     OAB#WPFI1E                DT
     O                         FCSHDT
     O                         FCSHTM
     O                         FCRYHZ
     O                         FCASN#
     O                         FCDELY
     O                         FCDOCK
     O                         FC#CON
     O                         WWPLAN
     O                         D@SHDT
** ERR
E-01 PLEASE MAKE ONE SELECTION
E-02 PLEASE ENTER ONLY 1 TO SELECTION
E-03 PLEASE ENTER THE BILL OF LADING NUMBER
E-04 PLEASE ENTER THE RELEASE DATE
E-05 INCORRECT RELEASE DATE
E-06 PLEASE ENTER THE SHIPPING DATE
E-07 PLEASE ENTER THE DELIVERY CODE OR GROUPE#
E-08 PLEASE SPECIFY BIN
E-09 INCORRECT SHIPPING DATE
E-10 NO DATA FOUND
E-11 DATE ERROR
** GRP2
5164
5173
