     H            Y.
     F** AB#RF0 *************************************************
     F*    FORD DELIVERY CODE CHECK                             *
     F*       SEPT/14/01   TCH                                  *
     F*----------------------------
     F*  CALLING SEQ.
     F*                    CALL 'AB#RF0'
     F*                    PARM           P@DELV  4
     F*                    PARM           P@FDID  1
     F*   IN  P@DELV:  4A DELIVERY CODE
     F*   OUT P@FDID:  1A RETURN CODE (1:NORMAL, BLANK:ERROR)
     F***********************************************************
     FABF9L01 IF  E           K        DISK
     C****************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@DELV  4
     C                     PARM           P@FDID  1
      *
     C           P@DELV    SETLLABF9L01
     C           *IN90     DOUEQ*ON
     C           P@DELV    READEABF9L01                  90
     C           *IN90     IFEQ *OFF
     C           F9SKJY    IFNE *BLANK
     C                     ITER
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *OFF
     C                     MOVE '1'       P@FDID
     C                     ELSE
     C                     MOVE *BLANK    P@FDID
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
