     H            Y
      *------------------------------------------------------
      *  CREATE DOCK LABEL DATA
      *   PGM ID:      AB#RA1
      *   CREATE DATE: OCT/15/01
      *          BY  : TCH
      *------------------------------------------------------
     FAB#PWA1 CF  E                    WORKSTN
     FAB#PL1A IF  E           K        DISK
     FAB#PL17 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FABWPP1A IF  E           K        DISK                      A
     F**AB#PL40 IF  E           K        DISK
     FAB#WP50 O   E                    DISK                      A    UC
      *-----------------------------------------------------------
     E                    ER      1   4 78
     E                    CMD     1   1 70
     E                    BKN        90  4
     E                    BBX        90  3
     E                    BX         90  3 0
     E                    @BX         3  1
      *-----------------------------------------------------------
     I            DS
     I                                        1 360 BKN
     I                                        1   4 DKKA01
     I                                        5   8 DKKA02
     I                                        9  12 DKKA03
     I                                       13  16 DKKA04
     I                                       17  20 DKKA05
     I                                       21  24 DKKA06
     I                                       25  28 DKKA07
     I                                       29  32 DKKA08
     I                                       33  36 DKKA09
     I                                       37  40 DKKA10
     I                                       41  44 DKKA11
     I                                       45  48 DKKA12
     I                                       49  52 DKKA13
     I                                       53  56 DKKA14
     I                                       57  60 DKKA15
     I                                       61  64 DKKA16
     I                                       65  68 DKKA17
     I                                       69  72 DKKA18
     I                                       73  76 DKKA19
     I                                       77  80 DKKA20
     I                                       81  84 DKKA21
     I                                       85  88 DKKA22
     I                                       89  92 DKKA23
     I                                       93  96 DKKA24
     I                                       97 100 DKKA25
     I                                      101 104 DKKA26
     I                                      105 108 DKKA27
     I                                      109 112 DKKA28
     I                                      113 116 DKKA29
     I                                      117 120 DKKA30
     I                                      121 124 DKKA31
     I                                      125 128 DKKA32
     I                                      129 132 DKKA33
     I                                      133 136 DKKA34
     I                                      137 140 DKKA35
     I                                      141 144 DKKA36
     I                                      145 148 DKKA37
     I                                      149 152 DKKA38
     I                                      153 156 DKKA39
     I                                      157 160 DKKA40
     I                                      161 164 DKKA41
     I                                      165 168 DKKA42
     I                                      169 172 DKKA43
     I                                      173 176 DKKA44
     I                                      177 180 DKKA45
     I                                      181 184 DKKA46
     I                                      185 188 DKKA47
     I                                      189 192 DKKA48
     I                                      193 196 DKKA49
     I                                      197 200 DKKA50
     I                                      201 204 DKKA51
     I                                      205 208 DKKA52
     I                                      209 212 DKKA53
     I                                      213 216 DKKA54
     I                                      217 220 DKKA55
     I                                      221 224 DKKA56
     I                                      225 228 DKKA57
     I                                      229 232 DKKA58
     I                                      233 236 DKKA59
     I                                      237 240 DKKA60
     I                                      241 244 DKKA61
     I                                      245 248 DKKA62
     I                                      249 252 DKKA63
     I                                      253 256 DKKA64
     I                                      257 260 DKKA65
     I                                      261 264 DKKA66
     I                                      265 268 DKKA67
     I                                      269 272 DKKA68
     I                                      273 276 DKKA69
     I                                      277 280 DKKA70
     I                                      281 284 DKKA71
     I                                      285 288 DKKA72
     I                                      289 292 DKKA73
     I                                      293 296 DKKA74
     I                                      297 300 DKKA75
     I                                      301 304 DKKA76
     I                                      305 308 DKKA77
     I                                      309 312 DKKA78
     I                                      313 316 DKKA79
     I                                      317 320 DKKA80
     I                                      321 324 DKKA81
     I                                      325 328 DKKA82
     I                                      329 332 DKKA83
     I                                      333 336 DKKA84
     I                                      337 340 DKKA85
     I                                      341 344 DKKA86
     I                                      345 348 DKKA87
     I                                      349 352 DKKA88
     I                                      353 356 DKKA89
     I                                      357 360 DKKA90
     I            DS
     I                                        1 270 BBX
     I                                        1   3 DKQY01
     I                                        4   6 DKQY02
     I                                        7   9 DKQY03
     I                                       10  12 DKQY04
     I                                       13  15 DKQY05
     I                                       16  18 DKQY06
     I                                       19  21 DKQY07
     I                                       22  24 DKQY08
     I                                       25  27 DKQY09
     I                                       28  30 DKQY10
     I                                       31  33 DKQY11
     I                                       34  36 DKQY12
     I                                       37  39 DKQY13
     I                                       40  42 DKQY14
     I                                       43  45 DKQY15
     I                                       46  48 DKQY16
     I                                       49  51 DKQY17
     I                                       52  54 DKQY18
     I                                       55  57 DKQY19
     I                                       58  60 DKQY20
     I                                       61  63 DKQY21
     I                                       64  66 DKQY22
     I                                       67  69 DKQY23
     I                                       70  72 DKQY24
     I                                       73  75 DKQY25
     I                                       76  78 DKQY26
     I                                       79  81 DKQY27
     I                                       82  84 DKQY28
     I                                       85  87 DKQY29
     I                                       88  90 DKQY30
     I                                       91  93 DKQY31
     I                                       94  96 DKQY32
     I                                       97  99 DKQY33
     I                                      100 102 DKQY34
     I                                      103 105 DKQY35
     I                                      106 108 DKQY36
     I                                      109 111 DKQY37
     I                                      112 114 DKQY38
     I                                      115 117 DKQY39
     I                                      118 120 DKQY40
     I                                      121 123 DKQY41
     I                                      124 126 DKQY42
     I                                      127 129 DKQY43
     I                                      130 132 DKQY44
     I                                      133 135 DKQY45
     I                                      136 138 DKQY46
     I                                      139 141 DKQY47
     I                                      142 144 DKQY48
     I                                      145 147 DKQY49
     I                                      148 150 DKQY50
     I                                      151 153 DKQY51
     I                                      154 156 DKQY52
     I                                      157 159 DKQY53
     I                                      160 162 DKQY54
     I                                      163 165 DKQY55
     I                                      166 168 DKQY56
     I                                      169 171 DKQY57
     I                                      172 174 DKQY58
     I                                      175 177 DKQY59
     I                                      178 180 DKQY60
     I                                      181 183 DKQY61
     I                                      184 186 DKQY62
     I                                      187 189 DKQY63
     I                                      190 192 DKQY64
     I                                      193 195 DKQY65
     I                                      196 198 DKQY66
     I                                      199 201 DKQY67
     I                                      202 204 DKQY68
     I                                      205 207 DKQY69
     I                                      208 210 DKQY70
     I                                      211 213 DKQY71
     I                                      214 216 DKQY72
     I                                      217 219 DKQY73
     I                                      220 222 DKQY74
     I                                      223 225 DKQY75
     I                                      226 228 DKQY76
     I                                      229 231 DKQY77
     I                                      232 234 DKQY78
     I                                      235 237 DKQY79
     I                                      238 240 DKQY80
     I                                      241 243 DKQY81
     I                                      244 246 DKQY82
     I                                      247 249 DKQY83
     I                                      250 252 DKQY84
     I                                      253 255 DKQY85
     I                                      256 258 DKQY86
     I                                      259 261 DKQY87
     I                                      262 264 DKQY88
     I                                      265 267 DKQY89
     I                                      268 270 DKQY90
     I            DS
     I                                        1   80W@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   4 SHTM
     I                                        1   2 SHHH
     I                                        3   4 SHMM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-----------------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C           K@KEY     CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C           CTCHR1    ANDEQ#USER
     C                     MOVE *BLANK    CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------------
      *
     C           *ENTRY    PLIST
     C                     PARM           @ENDID  1
      *
     C                     MOVE *BLANK    @ENDID
     C                     MOVE '01'      @@ID    2
      *
     C           K#AB1A    KLIST
     C                     KFLD           W@YMD
     C                     KFLD           K@BIN   20
     C                     KFLD           D@NONY
     C                     KFLD           D@FACT
     C                     KFLD           D@DOCK
     C           K#AB1X    KLIST
     C                     KFLD           W@YMD
     C                     KFLD           K@BIN   20
     C                     KFLD           D@NONY
     C                     KFLD           D@FACT
     C           K#AB17    KLIST
     C                     KFLD           D@NONY
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           D@ORDR
     C           K#AB40    KLIST
     C                     KFLD           D@NONY
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           BANOBN
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C                     Z-ADD*DATE     W@YMD
     C           K#AGD     SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8YMD     D@SHDT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEL'AB#RA1'  K@KEY   8 P
     C           K@KEY     CHAINAB#PPCT              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVELK@KEY     CTKEY1
     C                     MOVEL#USER     CTCHR1
     C                     WRITEAB#PPCT1
     C                     ELSE
     C           CTCHR1    IFNE *BLANK
     C           CTCHR1    CAT  ER,3:1    D@MSG     P
     C                     MOVE *ON       *IN99
     C                     MOVE *ON       *IN77
     C                     ELSE
     C                     MOVEL#USER     CTCHR1
     C                     UPDATAB#PPCT1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------------
     C                     EXFMTDSP01
      *
     C           *INKA     IFEQ *ON
     C                     MOVE '99'      @@ID
     C                     MOVE '1'       @ENDID
     C                     ELSE
      *
     C           *IN77     IFEQ *OFF
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT1
     C                     EXSR #WRT2
     C                     SELEC
     C           *IN99     WHEQ *ON
     C                     MOVE ER,4      D@MSG     P
     C           *IN88     WHEQ *OFF
     C                     MOVE ER,1      D@MSG
     C                     OTHER
     C                     MOVE '99'      @@ID
     C                     ENDSL
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------------
     C                     MOVEA'00000000'*IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
      *
     C           D@BIN     IFEQ *ZERO
     C                     SETON                     9963
     C                     MOVE ER,2      D@MSG
     C                     ELSE
     C                     Z-ADDD@BIN     K@BIN
     C                     ENDIF
      *
     C           D@SHDT    ADD  20000000  W@YMD
     C           D@DOCK    IFNE *BLANK
     C           K#AB1A    CHAINAB#PL1A              90
     C                     ELSE
     C           K#AB1X    CHAINAB#PL1A              90
     C                     ENDIF
      *
     C           *IN90     IFEQ *ON
     C                     MOVELER,1      D@MSG
     C                     MOVEA'11111'   *IN,61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           D@ORDR    IFNE *BLANK
     C           K#AB17    CHAINAB#PL17              90
     C           *IN90     IFEQ *ON
     C                     MOVEA'111111'  *IN,61
     C                     MOVELER,1      D@MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #WRT1     BEGSR
      *-----------------------------------------------------------
     C           BANONY    CHAINFGBPL01              90
     C           D@DOCK    IFEQ *BLANK
     C           K#AB1X    SETLLAB#PL1A
     C                     ELSE
     C           K#AB1A    SETLLAB#PL1A
     C                     ENDIF
      *
     C           *IN80     DOUEQ*ON
     C           D@DOCK    IFEQ *BLANK
     C           K#AB1X    READEAB#PL1A                  80
     C                     ELSE
     C           K#AB1A    READEAB#PL1A                  80
     C                     ENDIF
      *
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C           BANOBN    IFNE D@BIN
     C                     ITER
     C                     ENDIF
      *
     C           D@DOCK    IFNE *BLANK
     C           BANUKE    ANDNED@DOCK
     C                     ITER
     C                     ENDIF
      *
     C           D@ORDR    IFNE *BLANK
     C           BAODRN    ANDNED@ORDR
     C                     ITER
     C                     ENDIF
      *
     C           D@FACT    IFNE *BLANK
     C           BANKOJ    ANDNED@FACT
     C                     ITER
     C                     ENDIF
      *
     C                     WRITEABWPP1A1
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #WRT2     BEGSR
      *-----------------------------------------------------------
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD          99
     C           *IN99     IFEQ *OFF
      *
     C                     OPEN AB#WP50
     C                     CLOSEABWPP1A
     C                     OPEN ABWPP1A
      *
     C                     MOVE *OFF      *IN88
     C           *LOVAL    SETLLABWPP1A
      *
     C                     CLEARAB#WP501
     C                     MOVE *BLANK    W@ORDN 10
     C                     MOVE *BLANK    W@IVNO 16
     C                     MOVE *BLANK    W@DOCK  4
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     BX
      *
     C           *IN80     DOUEQ*ON
     C                     READ ABWPP1A                  80
     C           *IN80     IFEQ *OFF
      *
     C           BAODRN    IFNE W@ORDN
     C           W@ORDN    ANDNE*BLANK
     C           BANONY    ANDNE3804
     C           BANONY    ANDNE3347
     C           BANONY    ANDNE3764
     C           BANONY    ANDNE3423
     C           BAINVN    ORNE W@IVNO
     C           W@IVNO    ANDNE*BLANK
     C           BANONY    ANDEQ3804
     C           BAINVN    ORNE W@IVNO
     C           W@IVNO    ANDNE*BLANK
     C           BANONY    ANDEQ3347
     C           BAINVN    ORNE W@IVNO
     C           W@IVNO    ANDNE*BLANK
     C           BANONY    ANDEQ3423
     C           BAINVN    ORNE W@IVNO
     C           W@IVNO    ANDNE*BLANK
     C           BANONY    ANDEQ3764
     C           W@DOCK    ORNE *BLANK
     C           BANUKE    ANDNEW@DOCK
     C                     EXSR #OUT
     C                     ENDIF
      *
     C                     MOVE BANUKE    W@DOCK
     C                     MOVELBAODRN    W@ORDN
     C                     MOVELBAINVN    W@IVNO
     C                     MOVE *ON       *IN88
      *
     C                     MOVE BANOTM    SHTM
     C           SHHH      CAT  ':':0     DKTIME    P
     C           DKTIME    CAT  SHMM:0    DKTIME    P
     C                     Z-ADDK@YY      DKNOYY
     C                     Z-ADDK@MM      DKNOMM
     C                     Z-ADDK@DD      DKNODD
     C                     Z-ADDBANONY    DKNONY
     C                     MOVELBANUKE    DKDOCK
     C                     MOVELBASIRE    DKSUPP
     C                     MOVELBANKOJ    DKFACT
     C                     MOVELBAODRN    DKODRN
     C           BANONY    IFEQ 3804
     C           BANONY    OREQ 3347
     C           BANONY    OREQ 3931
     C           BANONY    OREQ 0701
     C           BANONY    OREQ 3423
     C                     MOVELBAINVN    DKODRN
     C                     ENDIF
      *
     C                     MOVELBAINVN    DKINVN
     C                     MOVELB2SMEI    DKCUST
     C                     Z-ADD*ZERO     @@QTY
     C                     Z-ADD*ZERO     @@MVR
     C           BASYOS    IFNE *ZERO
     C           BASRYO    DIV  BASYOS    @@QTY   30
     C                     MVR            @@MVR   30
     C                     ELSE
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    @@QTY   30
     C                     MVR            @@MVR   30
     C                     ELSE
     C                     Z-ADD1         @@QTY
     C                     ENDIF
     C                     ENDIF
     C           @@MVR     IFGT *ZERO
     C           @@QTY     OREQ *ZERO
     C                     ADD  1         @@QTY
     C                     ENDIF
      *
     C                     Z-ADD1         Y       30
     C           BASBAN    IFNE *BLANK
     C           BASBAN    LOKUPBKN,Y                    10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C                     MOVE BASBAN    BKN,X
     C                     ADD  @@QTY     BX,X
     C                     ELSE
     C                     ADD  @@QTY     BX,Y
     C                     ENDIF
     C                     ELSE
     C           BANONY    IFEQ 0285
     C                     ADD  1         X
     C                     ADD  @@QTY     BX,1
     C                     ENDIF
     C                     ENDIF
      *
     C           BANONY    IFEQ 0701
     C           X         ANDEQ20
     C           X         OREQ 90
     C                     EXSR #OUT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           X         IFGT *ZERO
     C                     EXSR #OUT
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #OUT      BEGSR
      *-----------------------------------------------------------
     C           1         DO   90        X
     C           BX,X      IFNE *ZERO
     C                     MOVE BX,X      BBX,X
     C                     MOVEABBX,X     @BX
     C                     MOVE *OFF      *IN95
     C           1         DO   3         Y
     C           @BX,Y     IFEQ *ZERO
     C           *IN95     ANDEQ*OFF
     C                     MOVE *BLANK    @BX,Y
     C                     ELSE
     C                     MOVE *ON       *IN95
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEA@BX       BBX,X
      *
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     WRITEAB#WP501
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     BX
     C                     CLEARAB#WP501
      *
     C                     ENDSR
      *-----------------------------------------------------------
**
THERE IS NO DATA FOR YOUR SELECTION.
PLEASE ENTER "BIN".
IS USING THE SAME PROGRAM. TRY AGAIN LATER.
PLEASE PRINT THE LABELS YOU CREATED BEFORE.
** CMD
CLRPFM AB#WP50
