     H            Y.
     F** AB#RAA *************************************************************
     F*  SHIP BOX INQUIRY MENU                                              *
     F*                                                                     *
     F* TCHK1 10/24/08 CREATE
     F****************************************** ABAR34 *********************
     FAB#PWAA CF  E                    WORKSTN
     E*****************************************************************
     E                    ERR     1   5 78
     I*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(8)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMHH
     I                                        3   40WTIMMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           WWTIME
     C                     MOVE '01'      W@ID    2
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     SELEC
     C*
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C*
     C           *IN41     IFEQ *OFF
     C                     SELEC
     C           D@SLCT    WHEQ 01
     C                     CALL 'AB#RAB'
     C           D@SLCT    WHEQ 02
     C                     CALL 'AB#RAS'
     C           D@SLCT    WHEQ 03
     C**JW                 MOVE '5'       @PF     1
     C**                   CALL 'AB#RAT'
     C**                   PARM           @PF
JW   C                     CALL 'UTLC99A'                  PROGRAM NOT READY
JW   C                     PARM           #PGM
     C           D@SLCT    WHEQ 04
     C                     CALL 'AB#RAU'
     C                     ENDSL
     C                     Z-ADD*ZERO     D@SLCT
     C                     END
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*------------------------------------------------------
     C* 1ST SCREEN CHECK
     C*------------------------------------------------------
     C           #CHK1     BEGSR
     C*
     C                     DO
     C*
     C           D@SLCT    IFEQ *ZERO
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,1     D@MSG
     C                     LEAVE
     C                     END
     C*
     C           D@SLCT    IFLT 01
     C           D@SLCT    ORGT 04
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,2     D@MSG
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
** ERR
SELECTION IS REQUIRED.
SELECTION IS INVALID.



