     H            Y.
     ** AB#RAF ********************************************************
     *  PART MASTER UPDATE CHECK LIST                                 *
     ******************************************************** AB#RAF **
     FFCEPL05 IF  E           K        DISK
     FFCEPL30 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C                     Z-ADD*DATE     K@YMD
     C           K#KEY     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8YMD     K@YMD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           K#KEY     SETLLFCEPL05
     C           *IN80     DOUEQ*ON
     C           K#KEY     READEFCEPL05                  80
     C           *IN80     IFEQ *OFF
      *
     C           K#F30     SETLLFCEPL30
     C           *IN90     DOUEQ*ON
     C           K#F30     READEFCEPL30                  90
     C           *IN90     IFEQ *OFF
     C           F3GSKD    ANDEQ*BLANK
     C                     EXSR #PRT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           K#KEY     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#F30     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C                     TIME           @TIME   60
     C                     MOVE *ALL'-'   @LINE  35
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #PRT      BEGSR
      *-----------------------------------------------------
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *-----------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       9
     O                         UDATE Y   50
     O                         @TIME     59 '  :  :  '
     O        E   02           @HED
     O                                   25 '** PART MASTER CHECK '
     O                                   32 'LIST **'
     O        E   03           @HED
     O                                   20 'DELETED ON '
     O                         K@MM  4   22
     O                                   23 '/'
     O                         K@DD  4   25
     O                                   26 '/'
     O                         K@YY  4   30
     O        E   05           @HED
     O                                    8 'DELETED'
     O                                   26 'SERVICE'
     O        E   06           @HED
     O                                    7 'PART #'
     O                                   27 'LOCATION'
     O        E   07           @HED
     O                         @LINE     35
     O        E 1              @DTL
     O                         A2BHB1     6
     O                         A2BHB2    12
     O                         A2BHB3    15
     O                         F3STRK    20
     O                                   21 '-'
     O                         F3STRT    23
     O                                   24 '-'
     O                         F3STRR    26
     O                                   27 '-'
     O                         F3STRD    28
