     H            Y.
     F** AB#R2Z *************************************************************
     F*  ..EDI ORDER PROCESSING                                             *
     F*                                                                     *
     F* TCHK1 11/06/09 RE-MAKE
     F* TCHK2 05/20/10 ADD TIEM
     F* TCHK3 05/28/10 ADD TAKUMI CANADA
     F* TCHK4 10/30/12 ADD ACZ
     F* TCHK5 11/12/13 ADD ARJ
     F* TCHK6 07/25/14 ADD ADI
JW1  F* JW    01/10/19 ADD 0468 TAKUMI TX NORTH
JW2  F* JW    01/06/30 ADD 0682 PMT
     F****************************************** AB#R2Z *********************
     FAB#PW2Z CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     E*****************************************************************
     E                    ER      1   1 78
     E                    KEY     1   1 78
TCHK2E*TCHK1              NAM     1  17 20
TCHK3E*TCHK2              NAM     1  18 20
TCHK4E*TCHK3              NAM     1  19 20
TCHK5E*TCHK4              NAM     1  20 20
TCHK6E*TCHK5              NAM     1  21 20
TCHK6E*                   NAM     1  22 30
JW1  E                    NAM     1  23 30
     I*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C***********************************************************************
     C* PARM                                                                *
     C***********************************************************************
     C           *ENTRY    PLIST
     C                     PARM           @END    1
      *
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     MOVE '01'      W@ID    2
     C                     EXSR #SET
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* SET DATA
      *------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     Z-ADD*ZERO     RRN1    40
TCHK2C*TCHK1     1         DO   17        X       30
TCHK3C*TCHK2     1         DO   18        X       30
TCHK4C*TCHK3     1         DO   19        X       30
TCHK5C*TCHK4     1         DO   20        X       30
TCHK6C*TCHK5     1         DO   21        X       30
TCHK6C           1         DO   23        X       30
     C           NAM,X     IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     MOVELNAM,X     S@NAME
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE KEY,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '1'       @END
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
     C* CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     6199
     C                     MOVE *BLANK    MSG
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVE *OFF      *IN61
     C           S@OPT     IFNE 'Y'
     C           S@OPT     ANDNE*BLANK
     C                     MOVE ER,1      MSG
     C                     SETON                     6199
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C* WRITE
      *------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C           *IN90     DOUEQ*ON
      *
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C*
     C           *IN90     IFEQ *OFF
     C           S@OPT     ANDEQ'Y'
      * TAKATA
     C           @@RRN     IFEQ 1
     C                     MOVE '3656'    P@ID    4
     C                     CALL 'AB#C2U'
     C                     PARM           P@ID
     C                     ENDIF
      * PMO
     C           @@RRN     IFEQ 2
     C                     MOVE '0681'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * TAKUMI
     C           @@RRN     IFEQ 3
     C                     MOVE '0645'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * TAKUMI TEXAS
     C           @@RRN     IFEQ 4
     C                     MOVE '0646'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
TCHK3 * TAKUMI CANADA
TCHK3C           @@RRN     IFEQ 5
TCHK3C                     MOVE '0647'    P@ID    4
TCHK3C                     CALL 'AB#C2F'
TCHK3C                     PARM           P@ID
TCHK3C                     ENDIF
      * OHASHI
     C           @@RRN     IFEQ 6
     C                     MOVE '5671'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * ADVICS(ABI)
     C           @@RRN     IFEQ 7
     C                     MOVE '0465'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * ASJ
     C           @@RRN     IFEQ 8
     C                     MOVE '8990'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * RITATSU
     C           @@RRN     IFEQ 9
     C                     MOVE '1301'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * NIFAST MICHIGAN
     C           @@RRN     IFEQ 10
     C                     MOVE '0203'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
     C* NIFAST CANADA
     C           @@RRN     IFEQ 11
     C                     MOVE '1431'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * FUTABA TEXAS
     C           @@RRN     IFEQ 12
     C                     MOVE '0578'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * FUTABA INDIANA
     C           @@RRN     IFEQ 13
     C                     MOVE '0567'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * FUTABA CANADA
     C           @@RRN     IFEQ 14
     C                     MOVE '0579'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * FUTABA CHICAGO
     C           @@RRN     IFEQ 15
     C                     MOVE '0556'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * JTEKT TEXAS
     C           @@RRN     IFEQ 16
     C                     MOVE '3832'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
      * JTEKT VIRGINIA
     C           @@RRN     IFEQ 17
     C                     MOVE '3891'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
TCHK2 * TIEM
TCHK2C           @@RRN     IFEQ 18
TCHK2C                     MOVE '0753'    P@ID    4
TCHK2C                     CALL 'AB#C2F'
TCHK2C                     PARM           P@ID
TCHK2C                     ENDIF
TCHK4 * ACZ
TCHK4C           @@RRN     IFEQ 19
TCHK4C                     MOVE '0170'    P@ID    4
TCHK4C                     CALL 'AB#C2F'
TCHK4C                     PARM           P@ID
TCHK4C                     ENDIF
TCHK5 * ARJ
TCHK5C           @@RRN     IFEQ 20
TCHK5C                     MOVE '3201'    P@ID    4
TCHK5C                     CALL 'AB#C2F'
TCHK5C                     PARM           P@ID
TCHK5C                     ENDIF
TCHK6 * ADI
TCHK6C           @@RRN     IFEQ 21
TCHK6C                     MOVE '0777'    P@ID    4
TCHK6C                     CALL 'AB#C2F'
TCHK6C                     PARM           P@ID
TCHK6C                     ENDIF
JW    * TAKUMI TX NORTH
 "   C           @@RRN     IFEQ 22
 "   C                     MOVE '0648'    P@ID    4
 "   C                     CALL 'AB#C2F'
 "   C                     PARM           P@ID
 "   C                     ENDIF
      * OTHER(COMMON FORMAT)
TCHK6C           @@RRN     IFEQ 23
     C                     MOVE 'OTHC'    P@ID    4
     C                     CALL 'AB#C2F'
     C                     PARM           P@ID
     C                     ENDIF
     C*
     C                     END
     C*
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
** ER
E-01 OPTION CODE ERROR
** KEY
F1:END     F5:PROCESS
** NAM  ---------------------> (30)
TAKATA/JOYSON-3656              01
PMO-0681 OR PMT-0682            02
TAKUMI OHIO-0645                03
TAKUMI TEXAS-0646               04
TAKUMI CANADA-0647              05
OHASHI-5671                     06
ADVICS(ABI)-0465                07
ASJ-8990                        08
RITATSU-1301                    09
NIFAST MICHIGAN-0203            10
NIFAST CANADA-1431              11
FUTABA TEXAS-0578               12
FUTABA INDIANA-0567             13
FUTABA CANADA-0579              14
FUTABA CHICAGO-0556             15
JTEKT TEXAS-3832                16
JTEKT VIRGINIA-3891/3318        17
TIEM-0753                       18
ACZ-0170                        19
ARJ-3201                        20
ADI-0777                        21
TAKUMI TX NORTH-0648            22
OTHER(COMMON FORMAT)            23
