     H            Y.
     F** AB#R0B ********************************************
     F* EDI FRS ORDER ERRER LIST                           *
     F*                                                    *
     F* TCHK1 05/24/07 ADD TOWER ROUTINE(SURYO)            *
JW1  F* JW    08/31/16 CHG PRINT FORMAT                    *
JW2  F* JW    10/12/16 SKIP WHEN DELIVERY CODE = 0323      *
JW3  F* JW    01/28/21 CHK  PAST DUE ORDER                 *
JW4  F* JW    04/07/21 ADD  PARAMETER (PRINT FLAG)         *
     F******************************************************
     FAB#WP2A IP  F     100            DISK
TCHK1FAB#WP452IF  F     256            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    HND     1   7  4
     E                    TTL     1   1 62
     E                    TAB1    1   9  1   TAB2   32
     IAB#WP2A AA  01
     I                                        1   4 ISIRE
     I                                        5   5 ISIRK
     I                                        6   90ITOKU
     I                                       10  130INONY L1
     I                                       14  14 INKOJ
     I                                       15  18 INUKE
     I                                       19  22 ISBAN
     I                                       23  42 IMHIN
     I                                       43  52 IODRN
     I                                       53  590ISURY
     I                                       60  670INYMD
     I                                       68  730IUSYS
     I                                       74  790ISYOS
     I                                      100 100 IERCD
TCHK1IAB#WP452BB  01
TCHK1I                                        1   4 I@SIRE
TCHK1I                                        5   5 I@SIRK
TCHK1I                                        6   90I@TOKU
TCHK1I                                       10  130I@NONY
TCHK1I                                       14  14 I@NKOJ
TCHK1I                                       15  18 I@NUKE
TCHK1I                                       19  22 I@SBAN
TCHK1I                                       23  42 I@MHIN
TCHK1I                                       23  27 I@MHN1
TCHK1I                                       28  32 I@MHN2
TCHK1I                                       33  37 I@MHN3
TCHK1I                                       38  42 I@MHN4
TCHK1I                                       43  500I@NOHZ
TCHK1I                                       43  460I@NOYY
TCHK1I                                       47  480I@NOMM
TCHK1I                                       49  500I@NODD
TCHK1I                                       51  60 I@ODRN
TCHK1I                                       61  670I@SRYO
TCHK1I                                       68  730I@SYOS
TCHK1I                                       74  770I@NOTM
TCHK1I                                       78  89 I@SHIN
TCHK1I                                       78  82 I@SHN1
TCHK1I                                       83  87 I@SHN2
TCHK1I                                       88  89 I@SHN3
TCHK1I                                       90  93 I@CARD
TCHK1I                                       94  97 I@ALFL
TCHK1I                                       98  990I@NOBN
TCHK1I                                      100 1050I@USYS
TCHK1I                                      106 121 I@INVN
TCHK1I                                      122 125 I@RESE
TCHK1I                                      126 1330I@DEHZ
TCHK1I                                      126 1290I@DEYY
TCHK1I                                      130 1310I@DEMM
TCHK1I                                      132 1330I@DEDD
TCHK1I                                      134 145 I@PGID
TCHK1I                                      256 256 I@@H
     I            DS
     I                                        1  20 XMHIN
     I                                        1   5 XMHN1
     I                                        6   9 XMHN2
     I                                       10  14 XMHN3
     I            DS
     I                                        1  20 ZMHIN
     I                                        1   5 ZMHN1
     I                                        6  10 ZMHN2
     I                                       11  15 ZMHN3
     I            DS
     I                                        1  25 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 BAR1
     I                                        7  10 @MHN2
     I                                       11  11 BAR2
     I                                       12  16 @MHN3
     I            DS
     I                                        1  25 #MHIN
     I                                        1   5 #MHN1
     I                                        6   6 BAR3
     I                                        7  11 #MHN2
     I                                       12  12 BAR4
     I                                       13  17 #MHN3
JW3  I            DS
 .   I                                        1  140STIME
 .   I                                        1   60NOW
JW3  I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------*
      * PARM *
      *------*
TCHK1C*
TCHK1C           ITOKU     IFEQ 0946
TCHK1C                     MOVEL*OFF      W@FND   1
TCHK1C                     EXSR @TOWSB
TCHK1C           W@FND     IFEQ *OFF
TCHK1C                     GOTO @@JUMP
TCHK1C                     END
TCHK1C                     END
      *
JW2  C           ITOKU     IFEQ 3411
JW2  C           INONY     ANDEQ0323
JW2  C                     GOTO @@JUMP
JW2  C                     END
      * CHECK SHIP DATE
JW3  C           INYMD     IFLT TODAY
 .   C                     GOTO @@JUMP
JW3  C                     END
      *
     C           *IN05     IFEQ '0'
     C                     MOVE *ALL'-'   WLINE 132
     C                     TIME           WTIME   60
     C                     SETON                     05
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTHD
     C                     END
      *
     C   L1                EXCPTLN
      *
     C                     SETOF                     10
     C           ISIRE     LOKUPHND                      10
      *
     C                     MOVE '-'       BAR1
     C                     MOVE '-'       BAR2
     C                     MOVE '-'       BAR3
     C                     MOVE '-'       BAR4
     C                     MOVE *BLANK    WMHIN  25
     C           *IN10     IFEQ '1'
     C                     MOVELIMHIN     XMHIN
     C                     MOVELXMHN1     @MHN1
     C                     MOVELXMHN2     @MHN2
     C                     MOVELXMHN3     @MHN3
     C                     MOVEL@MHIN     WMHIN
     C                     ELSE
     C                     MOVELIMHIN     ZMHIN
     C                     MOVELZMHN1     #MHN1
     C                     MOVELZMHN2     #MHN2
     C                     MOVELZMHN3     #MHN3
     C                     MOVEL#MHIN     WMHIN
     C                     END
     C           IERCD     LOKUPTAB1      TAB2           20
     C           *IN20     IFEQ *ON
     C                     MOVELTAB2      @@32   32
     C                     ELSE
     C                     MOVE *BLANK    @@32
     C                     ENDIF
      *
     C                     EXCPTDT
JW4  C                     MOVE '*'       $RTN
TCHK1C*
TCHK1C           @@JUMP    TAG
TCHK1C*
TCHK1C******************************************************
TCHK1C* TOWER ROUTINE                                      *
TCHK1C******************************************************
TCHK1C           @TOWSB    BEGSR
TCHK1C*
TCHK1C           1         SETLLAB#WP452
TCHK1C*
TCHK1C                     DO   *HIVAL
TCHK1C*
TCHK1C                     READ AB#WP452                 91
TCHK1C   91                LEAVE
TCHK1C*
TCHK1C           ITOKU     IFEQ I@TOKU
TCHK1C           INONY     ANDEQI@NONY
TCHK1C           INKOJ     ANDEQI@NKOJ
TCHK1C           INUKE     ANDEQI@NUKE
TCHK1C           IMHIN     ANDEQI@MHIN
TCHK1C           IODRN     ANDEQI@ODRN
TCHK1C           INYMD     ANDEQI@NOHZ
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     END
TCHK1C*
TCHK1C                     Z-ADDI@SRYO    ISURY
TCHK1C*
TCHK1C           IERCD     IFNE '1'
TCHK1C                     MOVEL*ON       W@FND
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C           ISYOS     IFEQ *ZERO
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C*
TCHK1C           ISURY     DIV  ISYOS     W@BOX   90
TCHK1C                     MVR            W@MVR   90
TCHK1C           W@MVR     IFNE *ZERO
TCHK1C                     MOVEL*ON       W@FND
TCHK1C                     END
TCHK1C*
TCHK1C                     LEAVE
TCHK1C*
TCHK1C                     ENDDO
TCHK1C*
TCHK1C                     ENDSR
      **************************
JW3   * INITIAL SETTING
 .    **************************
 .   C           *INZSR    BEGSR
      *
JW4  C           *ENTRY    PLIST
 |   C                     PARM           $RTN    1
 |    *
JW4  C                     MOVE *BLANK    $RTN
      *
 .   C                     TIME           STIME
 .    *
JW3  C                     ENDSR
      ********************************************************
     OQPRINT  E   02           HD
     O                         #PGM       8
TCHK2O                                   28 'SEND TO PC TEAM'
     O                                  109 'TIME'
     O                         WTIME    118 '  :  :  '
     O        E   04           HD
     O                         TTL,1     83
     O                                  109 'DATE'
     O                         UDATE Y  118
     O                                  124 'PAGE'
     O                         PAGE  Z  128
     O        E   06           HD
     O**JW1                              30 'KANBAN'
     O**                                 87 'USER'
     O**                                 95 'IAF'
JW1  O                                    1 '.'
JW1  O        E   07           HD
     O                                    4 'CUST'
     O                                   10 'DLV#'
     O                                   14 'F'
     O                                   20 'DOCK'
JW1  O                                   30 'KANBN#'
     O                                   41 'USER_PART'
     O                                   68 'SHIP_DATE'
     O                                   79 'QTY'
JW1  O                                   87 'USR_QPC'
JW1  O                                   97 'IAF_QPC'
     O        E 1              DT
     O                         ITOKU      4
     O                         INONY     10
     O                         INKOJ     14
     O                         INUKE     20
JW   O                                   22 'E'
     O                         ISBAN     29
     O                         WMHIN     57
     O                         INYMD     68 '    .  .  '
     O                         ISURY 1   79
     O                         IUSYS 1   87
     O                         ISYOS 1   97
JW1  O                         @@32     131
     O        E 1              LN
     O                         WLINE    132
** HND
0295
0296
0297
2418
3128
4126
4155
** TTL
<< EDI(ORDER DATA) PARTS/SHIPMENT INFORMATION MASTER ERROR >>
** TAB1/TAB2 (32A) .2.........3.>
1QTY IS NOT FULL BOX QTY!
2NO DATA IN PART M/F!
3QPC ERROR!
4NOT MASS PROD PART!
5NO SERVICE LOCATION!
6QTY IS NOT MULT OF 10!
7NO DATA IN SHIPMENT M/F!
8NO SHPMENT AS A MASS PROD PART!
9PART# HAS ALREADY BEEN DELETED!
