     H            Y/
     FAB#PLL1 UF  E           K        DISK                      A
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C           *ENTRY    PLIST
     C                     PARM           P@DLV   4
     C                     PARM           P@FCT   1
     C                     PARM           P@ID    1
      *
     C           K#PL      KLIST
     C                     KFLD           K@DLV   40
     C                     KFLD           K@FCT   1
     C                     KFLD           K@DATE  80
      *
     C                     MOVE P@DLV     K@DLV
     C                     MOVE P@FCT     K@FCT
     C                     Z-ADD*DATE     K@DATE
      *
     C           P@ID      IFEQ '1'
     C                     CLEARAB#PPLG1
     C                     Z-ADD*DATE     LGSDAT
     C                     TIME           LGSTIM
     C                     MOVEL#PGM      LGUPGM
     C                     MOVEL#WSID     LGUWIS
     C                     MOVEL#USER     LGUUSR
     C                     MOVE P@DLV     LGNONY
     C                     MOVE P@FCT     LGFCTY
     C                     MOVEL'ORDER'   LGEDID
     C                     MOVE '1'       LGFLG1
     C                     WRITEAB#PPLG1
     C                     ELSE
     C           K#PL      SETGTAB#PLL1
     C           *IN90     DOUEQ*ON
     C           K#PL      REDPEAB#PLL1                  90
     C           *IN90     IFEQ *OFF
     C           LGFLG2    ANDEQ*BLANK
     C                     Z-ADD*DATE     LGEDAT
     C                     TIME           LGETIM
     C                     MOVEL#PGM      LGUPGM
     C                     MOVEL#WSID     LGUWIS
     C                     MOVEL#USER     LGUUSR
     C                     MOVE '1'       LGFLG2
     C                     UPDATAB#PPLG1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
