     H            Y.
     F** AB#RYY *************************************
     F*  SET CONTAINER TYPE TO ABF7P01              *
     F***********************************************
     FABF7P01 UF  E                    DISK
     C*
     C           1         SETLLABF7P01
     C                     DO   *HIVAL
     C                     READ ABF7P01                  99
     C   99                LEAVE
     C*
     C                     MOVEL*BLANK    PCONT  20
     C                     CALL 'AB#RYZ'
     C                     PARM           F7CUST
     C                     PARM           PCONT
     C                     MOVELPCONT     F7CONT
     C                     UPDATABF7P011
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
