     H            Y
      ** AB#R8M **********************************************
      *  RETRIEVE BIN FROM TOYOTA ROUTE/BIN M/F              *
      *  LEC  2018/08/07                                     *
      ********************************* AB#R8M ***************
     FAB#PP82 IF  E           K        DISK
      *
     E                    RTE        30 10               ROUTE
      *
     I            DS
     I                                        1 300 RTE
     I                                        1  10 A8RT01
     I                                       11  20 A8RT02
     I                                       21  30 A8RT03
     I                                       31  40 A8RT04
     I                                       41  50 A8RT05
     I                                       51  60 A8RT06
     I                                       61  70 A8RT07
     I                                       71  80 A8RT08
     I                                       81  90 A8RT09
     I                                       91 100 A8RT10
     I                                      101 110 A8RT11
     I                                      111 120 A8RT12
     I                                      121 130 A8RT13
     I                                      131 140 A8RT14
     I                                      141 150 A8RT15
     I                                      151 160 A8RT16
     I                                      161 170 A8RT17
     I                                      171 180 A8RT18
     I                                      181 190 A8RT19
     I                                      191 200 A8RT20
     I                                      201 210 A8RT21
     I                                      211 220 A8RT22
     I                                      221 230 A8RT23
     I                                      231 240 A8RT24
     I                                      241 250 A8RT25
     I                                      251 260 A8RT26
     I                                      261 270 A8RT27
     I                                      271 280 A8RT28
     I                                      281 290 A8RT29
     I                                      291 300 A8RT30
      *
     I            DS
     I                                        1  10 BLNKRT
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
      *
     C                     Z-ADD*ZERO     OUTBIN
     C           INSHDT    IFNE *ZERO
      *
     C           INSHDT    SETGTAB#PP82
     C                     READPAB#PP82                  98
      *
     C           *IN98     IFEQ *OFF
     C                     Z-ADD1         X       20
     C           INRTE     LOKUPRTE,X                    50
     C           *IN50     IFEQ *ON
     C                     Z-ADDX         OUTBIN
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           INRTE     IFEQ 'EXPDIT'
     C                     Z-ADD33        OUTBIN
     C                     ENDIF
      *
     C           *IN98     IFEQ *ON
     C           OUTBIN    OREQ *ZERO
     C                     Z-ADD1         OUTBIN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      * INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           INSHDT  80
     C                     PARM           INRTE  10
     C                     PARM           OUTBIN  20
      *
     C                     ENDSR
