     H            Y/
     FAB#PW0U CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FAB#PL1A IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      *
     E                    CMD     1   1 78
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      *--------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#1A      KLIST
     C                     KFLD           BANOHZ
     C                     KFLD           BANOBN
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAODRN
     C           K#75      KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
      *
     C                     MOVE '01'      @@ID    2
     C                     EXSR #SET
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           *DATE     SETLLAB#PL1A
     C           *IN90     DOUEQ*ON
     C           *DATE     READEAB#PL1A                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C                     CLEARSFL01
     C           K#75      CHAINAB#PL75              91
     C           *IN91     IFEQ *ON
JW   C           *IN91     OREQ *OFF
     C           PUSKJY    ANDNE'D'
     C                     MOVEL'NOT YET' S@MSG1
     C                     ADD  1         RRN1
     C                     Z-ADDBANONY    S@NONY
     C                     Z-ADDBATOKU    S@CUST
     C                     MOVE BANKOJ    S@FACT
     C                     MOVE BANUKE    S@NUKE
     C                     Z-ADDBANOBN    S@NOBN
     C                     Z-ADD*DATE     S@SHDT
     C           BANONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    S@NAME
     C                     ENDIF
     C                     WRITESFL01
      *
     C                     ENDIF
     C           K#1A      SETGTAB#PL1A
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     MOVE '99'      @@ID
      *
     C                     ENDSR
      *---------------------------------------------------
** CMD
  ENTER:CONTINUE
