     H            Y.
     F** AB#RED **********************************************************
     F*  ADJUST FIRM DATA (AB#EP40) -CHANGE QTY BY CUM QTY               *
     F*  JW     2025.12.08                                               *
     F********************************************************************
     FAB#EL40AUF  E                    DISK
      *-------------------------------------------------------------------
     C                     MOVE *BLANK    SVMHIN 30
     C                     Z-ADD0         CUMQTY  70
     C                     Z-ADD0         SVQTY   70
      *
     C                     DO   *HIVAL
     C                     READ AB#EL40A                 98
     C   98                LEAVE
      *
     C           ENONY     IFNE '5211'                     HOLLINGSWORTH
     C                     ITER
     C                     ENDIF
      * SAME MHIN
     C           EMHIN     IFEQ SVMHIN
     C                     Z-ADDESRYO     SVQTY
     C           ESRYO     SUB  CUMQTY    ESRYO
     C                     UPDATAB#EP401
     C                     ADD  SVQTY     CUMQTY
      * FIRST MHIN
     C                     ELSE
     C                     Z-ADDECRYO     CUMQTY
     C                     Z-ADDESRYO     SVQTY
     C           ESRYO     SUB  CUMQTY    ESRYO
     C                     UPDATAB#EP401
     C                     ADD  SVQTY     CUMQTY
     C                     MOVELEMHIN     SVMHIN
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
