     H            Y.
     F** AB#R1O3 ***************************************************************
     F*  ORDER CHANGE HISTORY (2 LINES) V03                                    *
     F*  JW    2023.06.15                                                      *
     F*  ----------------------------------                                    *
JW1  F*  JW    2021.11.17 ADD OPTION SEARCH BY PO#                             *
JW2  F*  JW    2023.06.07 CHG AB#WHP10 -->  AB#WP1H                            *
.    F*                   ADD DOWNLOAD CSV (F7)                                *
JW3  F*  JW    2023.06.15 ADD 3 KEYS (BIN#, HUKE, SHIN)                        *
     F**************************************************************************
     FAB#PW1O3CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAB#HL10 IF  E           K        DISK
     FAB#PL13 IF  E           K        DISK
     FAB#PPY9 IF  E           K        DISK
JW1  FAB#WP1H UF  E           K        DISK                      A
     F****************************************************************
     E                    ERR     1  10 60
     E****************************************************************
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80W@NOHZ
     I                                        1   40W@NOYY
     I                                        5   60W@NOMM
     I                                        7   80W@NODD
     I            DS
     I                                        1  30 DAMANI
     I                                        1   8 WMANI2
     I                                       10  16 WMANI3
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80AHYMD
     I                                        1   40AHNOYY
     I                                        5   60AHNOMM
     I                                        7   80AHNODD
     I            DS
     I                                        1  20 AHMHIN
     I                                        1   5 AHMHN1
     I                                        6  10 AHMHN2
     I                                       11  15 AHMHN3
     I                                       16  20 AHMHN4
     I            DS
     I                                        1  12 AHSHIN
     I                                        1   5 AHSHN1
     I                                        6  10 AHSHN2
     I                                       11  12 AHSHN3
     I            DS
     I                                        1  12 X@SHIN
     I                                        1   5 X@SHN1
     I                                        6  10 X@SHN2
     I                                       11  12 X@SHN3
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I**************************************************************
      *
     C                     EXSR #INIT
      *
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *================================================================
      * DISPLAY SCREEN 1
      *================================================================
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F3:END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      * ENTER KEY
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C                     EXSR #SET1
      *
     C           RRN1      IFGT 0
      *
     C           *INKE     IFEQ *ON
     C                     MOVE '02'      @@ID
     C                     ELSE
     C                     MOVE '01'      @@ID
     C                     MOVE ERR,6     X@MSG
     C                     ENDIF
      *
     C                     ELSE
     C                     SETON                     6162
     C                     MOVE '01'      @@ID
     C                     MOVE ERR,5     X@MSG
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CLEAR VALUES
      *----------------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *BLANK    X@MSG
     C                     SETOF                     606162
     C                     SETOF                     636465
     C                     SETOF                     666768
     C                     SETOF                     697071
     C                     MOVE *OFF      *IN85
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK SCREEN 1 DATA
      *----------------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      * CHECK DATE
     C           X@FROM    IFEQ 0
     C                     MOVELERR,1     X@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELX@FROM    $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
     C           $RTN      IFNE ' '
     C                     MOVELERR,2     X@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           X@TO      IFEQ 0
     C                     Z-ADDX@FROM    X@TO
     C                     ENDIF
      *
     C                     MOVELX@TO      $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
     C           $RTN      IFNE ' '
     C                     MOVELERR,3     X@MSG
     C                     SETON                     62  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           X@TO      IFLT X@FROM
     C                     MOVE ERR,4     X@MSG
     C                     SETON                     616285
     C                     GOTO XCHK1
     C                     ENDIF
      * DELIVERY
     C**         X@NONY    IFNE 0
     C**         X@USER    IFNE *BLANK
JW1  C**         X@PO      ORNE *BLANK
     C**         X@TOYF    ORNE *BLANK
     C**         X@HONF    ORNE *BLANK
     C**         X@FORF    ORNE *BLANK
     C**                   MOVELERR,7     X@MSG
     C**                   SETON                     63  85
     C**                   GOTO XCHK1
     C**                   ENDIF
     C**                   ENDIF
      ** EXCLUSIVE **
      * USER
     C           X@USER    IFNE *BLANK
     C           X@TOYF    IFNE *BLANK
     C           X@HONF    ORNE *BLANK
     C           X@FORF    ORNE *BLANK
     C                     MOVELERR,7     X@MSG
     C                     SETON                     64  85
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * TOYOTA
     C           X@TOYF    IFNE 'Y'
     C           X@TOYF    ANDNE*BLANK
     C                     MOVELERR,8     X@MSG
     C                     SETON                     65  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           X@TOYF    IFNE *BLANK
     C           X@HONF    IFNE *BLANK
     C           X@FORF    ORNE *BLANK
     C                     MOVELERR,7     X@MSG
     C                     SETON                     65  85
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * HONDA
     C           X@HONF    IFNE 'Y'
     C           X@HONF    ANDNE*BLANK
     C                     MOVELERR,8     X@MSG
     C                     SETON                     66  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           X@HONF    IFNE *BLANK
     C           X@FORF    IFNE *BLANK
     C                     MOVELERR,7     X@MSG
     C                     SETON                     66  85
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * FORD
     C           X@FORF    IFNE 'Y'
     C           X@FORF    ANDNE*BLANK
     C                     MOVELERR,8     X@MSG
     C                     SETON                     67  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *----------------------------------------------------------------
      * SET DATA
      *----------------------------------------------------------------
     C           #SET1     BEGSR
      * CLEAR SUB FILE
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1
      *
      * CLEAR AB#WP1H (WORK FILE)
     C           *LOVAL    SETLLAB#WP1H
     C                     DO   *HIVAL
     C                     READ AB#WP1H                  98
     C   98                LEAVE
     C                     DELETAB#WP1H1
     C                     ENDDO
      *
     C                     Z-ADDX@FROM    K@YMD
     C           K#HL      SETLLAB#HL10
     C           *IN80     DOUEQ*ON
     C                     READ AB#HL10                  80
     C           *IN80     IFEQ *OFF
     C           AHYMD     IFGT X@TO
     C                     LEAVE
     C                     ENDIF
      * NONY
     C           X@NONY    IFNE 0
     C           X@NONY    ANDNEAHNONY
     C                     ITER
     C                     ENDIF
      * BIN#
     C           X@NOBN    IFNE 0
     C           X@NOBN    ANDNEAHNOBN
     C                     ITER
     C                     ENDIF
      * DOCK
     C           X@NUKE    IFNE *BLANK
     C           X@NUKE    ANDNEAHNUKE
     C                     ITER
     C                     ENDIF
      * SHN1
     C           X@SHIN    IFNE *BLANK
     C           X@SHIN    ANDNEAHSHIN
     C                     ITER
     C                     ENDIF
      * PO#
     C           X@PO      IFNE *BLANK
     C           X@PO      ANDNEAHODRN
     C                     ITER
     C                     ENDIF
      * USER
     C           X@USER    IFNE *BLANK
     C                     EXSR #USE
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * TOYOTA
     C           X@TOYF    IFNE *BLANK
     C                     EXSR #TOYO
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * HONDA
     C           X@HONF    IFNE *BLANK
     C                     EXSR #HONDA
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * FORD
     C           X@FORF    IFNE *BLANK
     C                     EXSR #FORD
     C           *IN85     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C                     ENDIF
JW1   * GET INVOICE#
 .   C                     MOVE *BLANK    AHINVN
 .   C                     Z-ADDAHNONY    K#NONY  40
 .   C                     Z-ADDAHNOYY    K#NOYY  40
 .   C                     Z-ADDAHNOMM    K#NOMM  20
 .   C                     Z-ADDAHNODD    K#NODD  20
 .   C                     MOVELAHNUKE    K#NUKE  4
 .   C                     MOVELAHMHN1    K#MHN1  5
 .   C                     MOVELAHMHN2    K#MHN2  5
 .   C                     MOVELAHMHN3    K#MHN3  5
 .   C                     MOVELAHMHN4    K#MHN4  5
 .   C                     MOVELAHODRN    K#ODRN 10
 .   C                     Z-ADDAHNOBN    K#NOBN  20
 .   C           K#PL13    SETLLAB#PL13
 .   C                     DO   *HIVAL
 .   C           K#PL13    READEAB#PL13                  97
 .   C   97                LEAVE
 .    *
 .   C                     MOVELBAINVN    AHINVN
 .   C                     LEAVE
JW1  C                     ENDDO
      *
     C**                   WRITEAB#HP10A
JW2  C                     WRITEAB#WP1H1
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C**         *LOVAL    SETLLAB#WHP10
JW2  C           *LOVAL    SETLLAB#WP1H
     C*
     C                     DO   *HIVAL
     C*
     C**                   READ AB#WHP10                 80
JW2  C                     READ AB#WP1H                  80
     C   80                LEAVE
      *
     C                     MOVE AHNONY    S@NONY
     C                     MOVELAHNUKE    S@NUKE
     C                     Z-ADDAHYMD     S@SHDT
     C                     Z-ADDAHNOBN    S@BIN
     C                     MOVELAHODRN    S@ODRN
     C                     Z-ADDAHQTY1    S@QTY1
     C                     Z-ADDAHQTY2    S@QTY2
     C           S@QTY2    SUB  S@QTY1    S@QTY3
     C                     Z-ADDAHKYMD    S@CHDT
     C                     MOVE AHSHN1    S@PRT1
     C                     MOVE AHSHN2    S@PRT2
     C                     MOVE AHSHN3    S@PRT3
      *
     C                     MOVELAHKTIM    S@KTIM
     C                     MOVELAHKMID    S@KUSR
      *
JW1  C                     MOVELAHINVN    S@INVN
 .   C                     MOVELAHMHN1    S@MHN1
 .   C                     MOVELAHMHN2    S@MHN2
 .   C                     MOVELAHMHN3    S@MHN3
 .    * GET SBAN
 .   C                     MOVELAHNONY    $NONY
 .   C                     MOVELAHNKOJ    $NKOJ
 .   C                     MOVELAHNUKE    $NUKE
 .   C                     MOVELAHMHIN    $MHIN
 .   C                     MOVELAHYMD     $NOHZ
 .   C                     CALL 'UTLR33A'
 .   C                     PARM           $NONY   4
 .   C                     PARM           $NKOJ   1
 .   C                     PARM           $NUKE   4
 .   C                     PARM           $MHIN  20
 .   C                     PARM           $NOHZ   8
 .   C                     PARM           $SBAN   6
JW1  C                     MOVEL$SBAN     S@SBAN
      *
     C                     ADD  1         RRN1
     C           RRN1      IFGE 9999
     C                     LEAVE
     C                     ENDIF
      *
     C                     WRITESFL01
     C*
     C                     ENDDO
      * HEADER
     C                     MOVEL'N/A   '  X@OPTN
     C                     SELEC
     C           X@NONY    WHNE 0
     C                     MOVELX@NONY    X@OPTN    P
     C           X@USER    WHNE *BLANK
     C                     MOVELX@USER    X@OPTN    P
     C           X@TOYF    WHNE *BLANK
     C                     MOVEL'TOYOTA'  X@OPTN
     C           X@HONF    WHNE *BLANK
     C                     MOVEL'HONDA '  X@OPTN
     C           X@FORF    WHNE *BLANK
     C                     MOVEL'FORD  '  X@OPTN
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK USER
      *----------------------------------------------------------------
     C           #USE      BEGSR
      *
     C                     SETON                     85
     C                     MOVELX@USER    LTR10  10 P
     C           LTR10     SETLLAB#PPY9
     C                     DO   *HIVAL
     C           LTR10     READEAB#PPY9                  99
     C   99                LEAVE
      *
     C           UANONY    IFEQ AHNONY
     C                     SETOF                     85
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------------
JW1   * CHECK PO#
 .    *----------------------------------------------------------------
 .   C           #PO       BEGSR
 .    *
     C                     SETON                     85
     C                     MOVELX@USER    LTR10  10 P
     C           LTR10     SETLLAB#PPY9
     C                     DO   *HIVAL
     C           LTR10     READEAB#PPY9                  99
     C   99                LEAVE
      *
     C           UANONY    IFEQ AHNONY
     C                     SETOF                     85
     C                     LEAVE
 .   C                     ENDIF
 .   C                     ENDDO
 .    *
JW1  C                     ENDSR
      *----------------------------------------------------------------
      * CHECK TOYOTA
      *----------------------------------------------------------------
     C           #TOYO     BEGSR
      *
     C                     SETON                     85
      *
     C           AHTOKU    IFEQ 3411
     C                     SETOF                     85
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK HONDA
      *----------------------------------------------------------------
     C           #HONDA    BEGSR
      *
     C                     SETON                     85
      *
     C           AHTOKU    IFEQ 0294
     C           AHTOKU    OREQ 0295
     C           AHTOKU    OREQ 0296
     C           AHTOKU    OREQ 0390
     C           AHTOKU    OREQ 0391
     C           AHTOKU    OREQ 0400
     C           AHTOKU    OREQ 1602
     C           AHTOKU    OREQ 3135
     C                     SETOF                     85
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK FORD
      *----------------------------------------------------------------
     C           #FORD     BEGSR
      *
     C                     SETON                     85
      *
     C           AHTOKU    IFEQ 5149
     C                     SETOF                     85
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * DISPLAY SCREEN 2
      *----------------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
      * F3:END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      * F7:DOWNLOAD
     C           *INKG     WHEQ *ON
     C                     CALL 'AB#C1OA'
     C                     MOVE '01'      @@ID
      * F12:BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------------
      * INITIAL SETTING
      *------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K#HL      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
JW1  C           K#PL13    KLIST
 .   C                     KFLD           K#NONY  40
 .   C                     KFLD           K#NOYY  40
 .   C                     KFLD           K#NOMM  20
 .   C                     KFLD           K#NODD  20
 .   C                     KFLD           K#NUKE  4
 .   C                     KFLD           K#MHN1  5
 .   C                     KFLD           K#MHN2  5
 .   C                     KFLD           K#MHN3  5
 .   C                     KFLD           K#MHN4  5
 .   C                     KFLD           K#ODRN 10
JW1  C                     KFLD           K#NOBN  20
      *
     C                     TIME           SDATE
     C                     Z-ADDTODAY     X@FROM
     C                     Z-ADDTODAY     X@TO
     C                     Z-ADD0         RRN1    40
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
** ERR(60A) .......2.........3.........4.........5.........6
ENTER DATE FROM!                                              1
FROM IS INVALID DATE!                                         2
TO IS INVALID DATE!                                           3
DATE FROM > TO!                                               4
THERE IS NO DATA!                                             5
PRESS F5 TO RUN...                                            6
YOU CAN NOT SELECT MULTIPLE CONDITION FOR THIS FIELD!         7
ENTER Y OR BLANK!                                             8
                                                              9
                                                             10
