     H            Y.
     F** AB#R5M  ***************************************************************
     F*  PROGRAM    : PRINT DCL COMPARISON REPORT                              *
     F*  WRITTEN    : 12/22/2016                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F**************************************************************************
     FEDIPP42 IF  E           K        DISK
     FAB#PL08 IF  E           K        DISK
     FAB#PL2A3IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR @INIT
      *
     C           *IN98     DOWEQ*OFF
     C                     READ EDIPP42                  98
      * SELECT
     C           *IN98     IFEQ *OFF
     C           E4GRP     ANDEQ'HND'
     C           E4SKJY    ANDNE'D'
      * GET ORDER
     C           E4NNY2    SETLLAB#PL08
     C                     MOVE *OFF      *IN97
     C           *IN97     DOWEQ*OFF
     C           E4NNY2    READEAB#PL08                  97
     C           *IN97     IFEQ *OFF
     C           BASKJY    ANDNE'D'
     C           BAURYY    ANDEQ0
      * GET DCL FROM AB#PP2A
     C                     MOVEL'******'  @DCL    6
     C                     MOVELBATOKU    KCTOKU
     C                     MOVELBANONY    KCNONY
     C                     MOVELBANKOJ    KCNKOJ
     C                     MOVELBANUKE    KCNUKE
     C                     MOVELBAMHN1    KCMHN1
     C                     MOVELBAMHN2    KCMHN2
     C                     MOVELBAMHN3    KCMHN3
     C                     MOVELBAMHN4    KCMHN4
     C                     Z-ADDBANOHZ    KCPLSH
     C                     MOVELBANOBN    KCBIN
     C                     MOVELBAODRN    KCODRN
     C           K@2A      SETLLAB#PL2A3
     C                     MOVE *OFF      *IN96
     C           *IN96     DOWEQ*OFF
     C           K@2A      READEAB#PL2A3                 96
     C           *IN96     IFEQ *OFF
     C           ACUPID    ANDNE'D'
     C                     SELEC
     C           ACUPID    WHEQ '1'
     C                     MOVELACREVN    @DCL
     C                     LEAVE
     C                     OTHER
     C                     MOVELACREVN    @DCL
     C                     ENDSL
      *
     C                     ENDIF
     C                     ENDDO
      * END OF AB#PP2A -----------------------
      * GET TRUE DCL
     C                     MOVEL'HND'     $CGRP
     C                     MOVELBAMHIN    $PART
     C                     MOVELBANOBN    $NONY
     C                     MOVEL'C'       $PTYP
     C                     MOVELBANOHZ    $SHDT
     C                     CALL 'UTLR11'
     C                     PARM           $CGRP   3
     C                     PARM           $PART  20
     C                     PARM           $NONY   4
     C                     PARM           $PTYP   1
     C                     PARM           $SHDT   8
     C                     PARM           $DCL    6
     C                     PARM           $RTN    1
      *
     C           $RTN      IFEQ '*'
     C                     MOVEL'NOTSET'  $DCL
     C                     ENDIF
      *
     C           $DCL      IFNE @DCL
     C           @DCL      ANDNE'******'
     C                     EXSR @PRINT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * END OF AB#PP10 -----------------------
     C                     ENDIF
     C                     ENDDO
      * END OF AB#PP55 -----------------------
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           @PRINT    BEGSR
      *
     C           LINE      IFGE 65
     C                     EXCPT@HDR
     C                     Z-ADD4         LINE
     C                     ENDIF
      * CONVERT
     C           @DCL      IFEQ *BLANK
     C                     MOVEL'*BLANK'  DCL@E   6
     C                     ELSE
     C                     MOVEL@DCL      DCL@E
     C                     ENDIF
     C           $DCL      IFEQ *BLANK
     C                     MOVEL'*BLANK'  DCL@M   7 P
     C                     ELSE
     C           $DCL      IFEQ 'NOTSET'
     C                     MOVEL'NOT SET' DCL@M   7 P
     C                     ELSE
     C                     MOVEL$DCL      DCL@M     P
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
     C                     ADD  1         LINE
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           K@2A      KLIST
     C                     KFLD           KCTOKU
     C                     KFLD           KCNONY
     C                     KFLD           KCNKOJ
     C                     KFLD           KCNUKE
     C                     KFLD           KCMHN1
     C                     KFLD           KCMHN2
     C                     KFLD           KCMHN3
     C                     KFLD           KCMHN4
     C                     KFLD           KCPLSH
     C                     KFLD           KCBIN
     C                     KFLD           KCODRN
      *
     C           *LIKE     DEFN ACTOKU    KCTOKU
     C           *LIKE     DEFN ACNONY    KCNONY
     C           *LIKE     DEFN ACNKOJ    KCNKOJ
     C           *LIKE     DEFN ACNUKE    KCNUKE
     C           *LIKE     DEFN ACMHN1    KCMHN1
     C           *LIKE     DEFN ACMHN2    KCMHN2
     C           *LIKE     DEFN ACMHN3    KCMHN3
     C           *LIKE     DEFN ACMHN4    KCMHN4
     C           *LIKE     DEFN ACPLSH    KCPLSH
     C           *LIKE     DEFN ACBIN     KCBIN
     C           *LIKE     DEFN ACODRN    KCODRN
      *
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     Z-ADD0         SEQ#    40
     C                     Z-ADD80        LINE    30
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** DESIGN CHANGE LEV'
     O                                   60 'EL COMPARISON REPORT'
     O                                   80 ' **                 '
     O                                   99 'DATE'
     O                         @DATE    102 '    .  .  '
     O                         @TIME    112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   17 'F'
     O                                   22 'DOCK'
     O                                   28 'PART1'
     O                                   34 'PART2'
     O                                   40 'PART3'
     O                                   45 'ORD#'
     O                                   60 'SHP_DATE'
     O                                   66 'BIN'
     O                                   79 'ORD_QTY'
     O                                   93 'ORD_IAF_PART'
     O                                  103 'DCL_EDI'
     O                                  111 'DCL_MST'
     O        E 1              @DTL
     O                         SEQ#  Z +001
     O                         BATOKU  +001
     O                         BANONY  +001
     O                         BANKOJ  +001
     O                         BANUKE  +001
     O                         BAMHN1  +001
     O                         BAMHN2  +001
     O                         BAMHN3  +001
     O                         BAODRN  +001
     O                         BANOYY  +001
     O                         BANOMM  +001
     O                         BANODD  +001
     O                         BANOBN  +001
     O                         BASRYOJ +001
     O                         BASHN1  +001
     O                         BASHN2  +001
     O                         BASHN3  +001
     O                         DCL@E   +001
     O                         DCL@M   +002
