     H            Y.
     F** AB#R34 **************************************************
     F*  ..RECORDING OF EDI FRS SALES & EDI(810) INVOICE DATA    *
     F*  ..ISSURANCE OF CANADA CUSTOM SHEET                      *
     F*    I-HASADA                             97.06.26         *
     F*
     F*   NOV/28/01     TCH
     F************************************************** AB#R34 **
     FAB#WP32 UP  E                    DISK
     FFCEPL01 IF  E           K        DISK
      *
     I            DS
     I                                        1  12 SHN
     I                                        1   5 W1SHN1
     I                                        6  10 W1SHN2
     I                                       11  12 W1SHN3
     I            DS
     I                                        1  20 UHN
     I                                        1   5 W1UHN1
     I                                        6  10 W1UHN2
     I                                       11  15 W1UHN3
     I                                       16  20 W1UHN4
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     C           BKEY      KLIST
     C                     KFLD           W1SHN1
     C                     KFLD           W1SHN2
     C                     KFLD           W1SHN3
      *
     C                     MOVELW1TOKU    PTOKU   4
     C                     MOVELW1NONY    PNONY   4
     C                     MOVELW1NKOJ    PNKOJ   1
     C                     MOVELW1NUKE    PNUKE   4
     C                     MOVELUHN       @MHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C*                    MOVE @MHIN     UHN
     C                     MOVE @SHIN     SHN    12        
      *
     C***        @FLG      IFEQ '*'
     C*****                MOVE *BLANK    W1UHN3
     C*****                MOVE *BLANK    W1UHN4
     C******               END
      *
      *********************************
      * PART INFORMATION M/F  CHAIN   *
      *********************************
     C                     SETOF                     03
     C           BKEY      CHAINFCEPL011             03
     C           *IN03     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
      *
     C           *IN03     IFEQ '1'
     C                     MOVE 'S'       W1STKB
     C                     ELSE
     C                     MOVE A2TEHI    W1STKB
     C                     END
      *
     C                     UPDATAB#WP321
