     H            Y.
      ** AB#R0D3******************************************************
      *  UNDECIDED UNIT PRICE LIST                                   *
      *   - USING MITWP01 (EXTERNAL) INSTEAD OF MITANK (INTERNAL)    *
      *  J.WATANABE  2023.04.13                                      *
      ********************************** (COPIED FROM AB#R0D) ********
     FMITWP01 IF  E                    DISK
     FGADPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *----------------------------------------
     E                    ME      1   2 20
     E                    MHN     1   5 20
      * SYSTEM
     I            DS
     I                                        1  140WTMDT
     I                                        1   60NOW
     I                                        7  140TODAY
      * USER PART
     I            DS
     I                                        1  20 W1MHIN
     I                                        1   5 W1MHN1
     I                                        6  10 W1MHN2
     I                                       11  15 W1MHN3
     I                                       16  20 W1MHN4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      ***************************************************
      * MAIN ROUTINE
      ***************************************************
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     READ MITWP01                  98
     C   98                LEAVE
      * IGNORE PART
     C           W1MHIN    IFEQ MHN,1
     C           W1MHIN    OREQ MHN,2
     C           W1MHIN    OREQ MHN,3
     C                     ITER
     C                     ENDIF
      *
     C           K#GAD     CHAINGADPL11              99
     C   99                MOVE *BLANK    W5KMEI 15
     C  N99                MOVELB5KMEI    W5KMEI
      *
     C                     SETOF                     505152
     C           W1MHN2    IFNE *BLANK
     C                     SETON                     50
     C                     ENDIF
     C           W1MHN3    IFNE *BLANK
     C                     SETON                     51
     C                     ENDIF
     C           W1MHN4    IFNE *BLANK
     C                     SETON                     52
     C                     ENDIF
      *
     C                     MOVE *BLANK    WSMEI  15
     C           W1TOKU    CHAINFGBPL01              99
     C           *IN99     IFEQ *OFF
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C                     MOVE ME,1      RESN   20
      *
     C                     EXSR #PRINT
      *
     C                     ENDDO
      *
     C           SEQ#      IFGE 1
     C                     EXCPTTTL
     C                     END
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ****************************************************
      * PRINT                                            *
      ****************************************************
     C           #PRINT    BEGSR
      *
     C           LIN#      IFGE 60
     C                     EXCPTHDR
     C                     ADD  3         LIN#
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
     C                     EXCPTDTL
     C                     ADD  1         LIN#
      *
     C                     ENDSR
      ****************************************************
      * INITIAL SETTINGS                                 *
      ****************************************************
     C           #INIT     BEGSR
      *
     C           K#GAD     KLIST
     C                     KFLD           W1TOKU
     C                     KFLD           W1NONY
      *
     C                     TIME           WTMDT
     C                     Z-ADD88        LIN#    20
     C                     Z-ADD0         SEQ#    30
      *
     C                     ENDSR
      ***************************************************************
     OQPRINT  E  102           HDR
     O                                   28 'SEND TO SALES TEAM'
     O                                  131 '.....................'
     O        E  1             HDR
     O                                  131 '.         .         .'
     O        E  1             HDR
     O                         #PGM       8
     O                         W5KMEI    25
     O                                   87 'TIME'
     O                         NOW       96 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HDR
     O**                                  8 'DATE'
     O**                       TODAY     20 '    .  .  '
     O                                   65 'UNDECIDED UNIT PRICE'
     O                                   70 'LIST'
     O                                   87 'DATE'
     O                         TODAY Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O**      E  1             HDR
     O**                                  9 'CUSTOMER'
     O**                                 50 'DELIVERY'
     O**                                 64 'USER'
     O**                                 94 'DELIVERY'
     O        E  2             HDR
     O                                    7 'CUST#'
     O                                   14 'NAME'
     O                                   48 'DELV#'
     O                                   52 'F'
     O                                   58 'DOCK'
     O                                   70 'USER PART#'
     O                                   92 'SHIP DATE'
     O                                  101 'ORDER#'
     O                                  122 'ERROR REASON'
     O        E  1             DTL
     O                         W1TOKU     6
     O                         WSMEI     25
     O                         W1NONY    47
     O                         W1NKOJ    52
     O                         W1NUKE    58
     O                         W1MHN1    65
     O                 50                66 '-'
     O                         W1MHN2    71
     O                 51                72 '-'
     O                         W1MHN3    77
     O                 52                78 '-'
     O                         W1MHN4    83
     O                         W1NOHZ    93 '    /  /  '
     O                         W1ODNO   105
     O                         RESN     130
      *
     O        E 2              TTL
     O                                   30 'TOTAL'
     O                         SEQ#      38 '  , * '
** ME (20A) .......>
@M/F UNDECIDED       01
OTHERS               02
** MHN(20A) .......>
W718105S442          01
W505395S450          02
W500100S442          03
                     04
                     05
