     H            Y.
     ** AB#RAH ********************************************************
     *  SHIPPING PREPARATION CHECK                                    *
     ******************************************************** AB#RAH **
     FAB#PWAH CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FGDGPL04 IF  E           K        DISK
     FALDPL20 IF  E           K        DISK
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   1 78
     E                    DAT         2  4 0
     E                    LBL         2 18
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   8 DAT
     I                                        1   40S@DAT1
     I                                        5   80S@DAT2
     I            DS
     I                                        1  36 LBL
     I                                        1  18 S@LBL1
     I                                       19  36 S@LBL2
     I            DS
     I                                        1   80A1KYMD
     I                                        1   40A1KSYY
     I                                        5   60A1KSMM
     I                                        7   80A1KSDD
     I            DS
     I                                        1   80IAKYMD
     I                                        1   40IAKOYY
     I                                        5   60IAKOMM
     I                                        7   80IAKODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------------
      * INITIALIZE
      *------------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KEY     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#KEYX    KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           IAZETI
     C                     KFLD           IAODER
     C                     KFLD           IASEIH
     C                     KFLD           IARENB
     C           K#20      KLIST
     C                     KFLD           IAZETI
     C                     KFLD           K@ODER  6
     C                     KFLD           IASEIH
     C                     KFLD           IARENB
      *
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
      *-----------------------------------------------------
      *  1ST SCREEN
      *-----------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET1
     C           RRN1      IFEQ *ZERO
     C                     MOVE MSG,1     D@MSG
     C                     ELSE
     C                     MOVE '02'      @@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
      *  CHECK THE BARCODE
      *-----------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     SETOF                     6199
      *
     C           D@TO      IFEQ *ZERO
     C                     Z-ADDD@FROM    D@TO
     C                     ENDIF
      *
     C           D@FROM    IFEQ *ZERO
     C           D@TO      ANDEQ*ZERO
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@TO      IFLT D@FROM
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
      *  CHECK SCANNED DATA
      *-----------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     Z-ADDD@FROM    K@YMD
     C           K#KEY     SETLLGDGPL04
     C           *IN80     DOUEQ*ON
     C           K#KEY     READEGDGPL04                  80
     C           *IN80     IFEQ *OFF
     C           IAKYMD    IFGT D@TO
     C                     LEAVE
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     Z-ADD0         X       20
     C                     MOVE IAODER    K@ODER
     C           K#20      SETLLALDPL20
     C           *IN81     DOUEQ*ON
     C           K#20      READEALDPL20                  81
     C           *IN81     IFEQ *OFF
     C                     ADD  1         X
     C                     MOVE A1SERL    LBL,X
     C                     Z-ADDA1KYMD    DAT,X
     C           X         IFEQ 2
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           X         IFGT 1
     C                     ADD  1         RRN1
     C                     MOVELIAHIN1    S@PRT1
     C                     MOVELIAHIN2    S@PRT2
     C                     MOVELIAHIN3    S@PRT3
     C                     MOVE IAODER    S@ORNO
     C                     MOVE IARENB    S@LTNO
     C                     WRITESFL01
     C                     ENDIF
      *
     C           K#KEYX    SETGTGDGPL04
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
      *  2ND SCREEN
      *-----------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
** CMD
  F1:END
  F1:END       F12:GO BACK
** MSG
NO DUPLICATE DATA
