     H            Y.
      ** AB#RG8 ************************************************
      *  FORD EDI FORECAST STORAGE FACILITY MATCH              *
      *                                                        *
JW1   *  JW  2018.07.03 FIX DATE TO SYSTEM DATE                *
JW2   *  JW  2022.12.13 ADD PRINT FIELD                        *
      ************************************ AB#RG8 **************
     F**ABAEP10 IF  E           K        DISK
     FEBAEP10 IF  E           K        DISK
     FABFDL03 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      ****************************************************
     E                    MSG     1   3 30
     E                    PDF       999 14               PLANT/DOCK/FACILITY
JW2  E                    PDP       999 40               PART
      ****************************************************
      * TIME
     I            DS
     I                                        1  140WTMDT
     I                                        1   60WTIME
     I                                        7  120WDATE
JW1  I                                        9  140WDAT6
JW1  I                                        7  140TODAY
     I            DS
     I                                        1  14 PDFCOD
     I                                        1   5 ABDOCK
     I                                        6   9 ABSHDK
     I                                       10  14 ABSTFC
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
      ***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           PD      1
     C                     MOVE *BLANK    PD
      *
     C           KEY1      KLIST
     C                     KFLD           ABDOCK           PLANT CODE
     C                     KFLD           ABSHDK           DOCK(RECIVING)
     C                     KFLD           ABSTFC           STORAGE FACILITY
      ***********************************************************
      *
     C                     TIME           WTMDT
     C                     SETON                     OF
      *
     C                     EXSR @MAIN
      *
     C                     SETON                     LR
     C                     RETRN
      *
      ***********************************************************
      *    MAIN SUBROUTINE...                                  **
      *
     C           @MAIN     BEGSR
      *
     C***                  READ ABAEP10                  90
     C                     READ EBAEP10                  90
     C           *IN90     DOWEQ*OFF
      *
     C           ABSTFC    IFNE *BLANK
JW1  C           ABQTY1    ANDNE0
      *
     C           KEY1      SETLLABFDL03
     C           *IN91     DOUEQ*ON
     C           KEY1      READEABFDL03                  91
      *
      * if route deleted or not in effect yet, ignore and read next...
     C           *IN91     IFEQ *OFF
     C           QASKJY    IFEQ 'D'
     C**         QASKHZ    ANDLE*DATE
JW1  C           QASKHZ    ANDLETODAY
     C                     ITER
     C                     ENDIF
     C**         QAEFHZ    IFGT *DATE
JW1  C           QAEFHZ    IFGT TODAY
     C                     ITER
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
      * if route, dock, str fac not found in route master print detail...
     C           *IN91     IFEQ *ON
      *
      *    check to see if not already printed....
     C           PDFCOD    LOKUPPDF,1                    10
JW2  C   10      ABPART    LOKUPPDP,1                    10
     C           *IN10     IFEQ *OFF
      *
     C                     MOVELMSG,1     W@MSG  30
     C   OF                EXCPT#HED1
     C   OF                EXCPT#HED2
     C   OF                SETOF                     OF
     C                     ADD  1         X       40
     C                     MOVELPDFCOD    PDF,X
JW2  C                     MOVELABPART    PDP,X
     C                     MOVELABPART    PART   20
     C                     EXCPT#DTL1
     C                     MOVE *ON       PD
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C***                  READ ABAEP10                  90
     C                     READ EBAEP10                  90
     C                     ENDDO
      *
     C                     ENDSR
      ***********************************************************
     OQPRINT  E    2           #HED1
     O       OR        OF
     O                                    8 'AB#RG8'
     O                                   37 'FORD PLANT/DOCK/STORAGE '
     O                                   45 'FACILITY'
     O                                   72 'NEW REPORT'
      *
     O        E 1              #HED1
     O       OR        OF
     O                                   37 '(EDI830 FORECAST)       '
     O                                  131 '.         .         .'
      *
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
      *
     O        E 1              #HED1
     O       OR        OF
     O                                   89 'DATE'
     O**JW1                    UDATE Y   98
JW1  O                         WDAT6 Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E 1              #HED2
     O       OR        OF
     O                                    6 'PLANT'
     O                                   12 'DOCK'
     O                                   23 'IC CODE'
     O                                   65 'PART#'
JW2  O                                   93 'SHIP QTY'
.    O                                  105 'SHIP DATE'
      *
     O        E 1              #DTL1
     O                         ABDOCK     6
     O                         ABSHDK    12
     O                         ABSTFC    22
     O                         W@MSG     56
     O                         PART      80
JW2  O                         ABQTY11   93
.    O                         ABCSDT   105 '    /  /  '
** MSG(30A) .......2.........3
 NOT IN FORD ROUTE MASTER FILE
ERROR 2
ERROR 3
