     H            Y.
     F** AB#R6M **********************************
     F*     CONVERT AB#PP6F TO AB#PP6A           *
     F*                                          *
     F*  JW1  CHG 0TTMI TO TMMI                  *
     F********************************** AB#R6M **
     FAB#PP6F IP  E                    DISK
     FAB#PP6A O   E                    DISK
      **********************************************************
     E                    ARY1       20  1
     E                    ARY2       20  1
      **********************************************************
     IAB#PP6F1
     I                                              AFMANIL1
     I            DS
     I                                        1  12 WPART
     I                                        1   5 APPAR1
     I                                        6  10 APPAR2
     I                                       11  12 APCLRC
     I            DS
     I                                        1   80WYMD
     I                                        1   40APRCYY
     I                                        5   60APRCMM
     I                                        7   80APRCDD
     C****************************************************
     C           *INL1     IFEQ *ON
     C                     MOVE AFMANI    APMANI
     C                     Z-ADDAFRCDT    WYMD
     C                     ENDIF
     C                     MOVE AFSIRE    APSIRE
     C                     MOVELAFPLNT    APCNAM
     C                     Z-ADDAFIQTY    APIQTY
     C                     Z-ADDAFUNIT    APUNIT
     C                     Z-ADDAFTAMT    APMAMT
     C           AFNETA    IFNE *ZERO
     C                     Z-ADDAFNETA    APTAMT
     C                     ELSE
     C           AFUNIT    MULT AFIQTY    APTAMT
     C                     ENDIF
      *
     C           APTAMT    IFNE *ZERO
     C           APIQTY    ORNE *ZERO
     C                     MOVEAAFPART    ARY1
     C                     MOVE *BLANK    ARY2
     C                     Z-ADD*ZERO     Y       20
     C           1         DO   20        X       20
     C           ARY1,X    IFNE '-'
     C           ARY1,X    ANDNE*BLANK
     C                     ADD  1         Y
     C                     MOVE ARY1,X    ARY2,Y
     C                     ENDIF
     C                     ENDDO
     C                     MOVEAARY2      W20    20
     C                     MOVELW20       WPART
      *
     C                     Z-ADD*DATE     APPRDT
     C                     Z-ADD@@TIME    APPRTM
      *
JW1  C           APCNAM    IFEQ '0TMMI'
 |   C                     MOVEL'TMMI '   APCNAM
JW1  C                     ENDIF
      *
     C                     WRITEAB#PP6A1
     C                     ENDIF
      *------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@TIM   6
      *
     C           P@TIM     IFEQ *BLANK
     C                     TIME           @@TIME  60
     C                     MOVE @@TIME    P@TIM
     C                     ELSE
     C                     MOVE P@TIM     @@TIME
     C                     ENDIF
      *
     C                     ENDSR
