     H            Y.
     F** AB#R163 ***************************************************************
     F*  ORDER INQUIRY BY PACKING LIST#                                        *
     F*  JW    2023.03.23                                                      *
     F************************ AB#R40 ******************************************
     FAB#PW163CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FAB#PL76 IF  E           K        DISK
     FAB#PL1Q IF  E           K        DISK
     FAB#PL40 IF  E           K        DISK
     FAB#PP43 IF  E           K        DISK
     F****************************************************************
     E                    CMD     1   2 78
     E                    MSG     1   5 60
     E****************************************************************
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
JW1  I            DS
JW1  I                                        1   80BADEHZ
JW1  I                                        1   40BADEYY
JW1  I                                        5   60BADEMM
JW1  I                                        7   80BADEDD
     I            DS
     I                                        1   80W@NOHZ
     I                                        1   40W@NOYY
     I                                        5   60W@NOMM
     I                                        7   80W@NODD
     I            DS
     I                                        1   80PUNOHZ
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1  30 DAMANI
     I                                        1   8 WMANI2
     I                                       10  16 WMANI3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C**************************************************************
     C* MAIN ROUTINE
     C**************************************************************
     C                     EXSR #INIT
      *
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C           @@ID      CASEQ'03'      #SCRN3
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------------------
      * DISPLAY 1ST SCREEN (ENTRY)
      *----------------------------------------------------------------
     C           #SCRN1    BEGSR
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
      * ENTR KEY
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *OFF
     C                     EXSR #SET1
     C           RRN1      IFGT 0
     C                     MOVE '02'      @@ID
     C                     ELSE
     C                     MOVE *ON       *IN61
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------------------
     C           #CLR      BEGSR
      *----------------------------------------------------------------
     C                     MOVE *BLANK    D@MSG
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *OFF      *IN85
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK FIRST SCREEN
      *----------------------------------------------------------------
     C           #CHK1     BEGSR
     C                     EXSR #CLR
      *
     C           D@PL#     IFEQ *BLANK
     C                     MOVELMSG,3     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           D@PL#     CHAINAB#PL76              90
     C           *IN90     IFEQ *ON
     C                     MOVELMSG,2     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           *IN90     IFEQ *OFF
     C           PUSKJY    ANDEQ'D'
     C                     MOVELMSG,1     D@MSG
     C                     SETON                     61  85
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *----------------------------------------------------------------
      * SET DATA TO SUBFILE
      *----------------------------------------------------------------
     C           #SET1     BEGSR
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD0         RRN1
     C                     Z-ADD0         @RRN
      *
     C                     Z-ADDPUNOHZ    K@NOHZ
     C                     Z-ADDPUBINN    K@NOBN
     C                     Z-ADDPUNONY    K@NONY
     C                     MOVELPUNKOJ    K@NKOJ
     C                     MOVELPUNUKE    K@NUKE
     C                     MOVE *BLANK    K@ODRN
     C                     MOVE *BLANK    K@MHIN
     C*
     C           K#PLQ1    SETLLAB#PL1Q
     C                     EXSR #SET11
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * SET DATA FOR SFL01
      *----------------------------------------------------------------
     C           #SET11    BEGSR
     C                     Z-ADD0         @CNT    20
     C                     Z-ADD@RRN      RRN1
     C                     CLEARSFL01
      *
     C                     DO   *HIVAL
     C           K#PLQ2    READEAB#PL1Q                  80
     C   80                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C           BANONY    IFEQ S@DELV
     C           BANKOJ    ANDEQS@NKOJ
     C           BANUKE    ANDEQS@DOCK
     C           BANOHZ    ANDEQS@SHDT
     C           BAURHZ    ANDEQS@POST
     C           BADEHZ    ANDEQS@RLDT
     C           BANOBN    ANDEQS@BIN
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     MOVE BATOKU    S@CUST
     C                     MOVE BANONY    S@DELV
     C                     MOVE BANKOJ    S@NKOJ
     C                     MOVE BANUKE    S@DOCK
     C                     Z-ADDBANOHZ    S@SHDT
     C                     Z-ADDBAURHZ    S@POST
JW1  C                     Z-ADDBADEHZ    S@RLDT
     C                     Z-ADDBANOBN    S@BIN
     C                     MOVELBAEDIK    S@EDIK
JW2   * GET # OF ORDERS
 |   C                     Z-ADDBANONY    $NONY
 |   C                     MOVELBANKOJ    $NKOJ
 |   C                     MOVELBANUKE    $NUKE
 |   C                     Z-ADDBANOHZ    $SHFM
 |   C                     Z-ADDBANOHZ    $SHTO
 |   C                     MOVELBANOBN    $NOBN
 |   C**                   MOVEL'*'       $ODRN     P
      *
     C           PUODRN    IFEQ *BLANK
 |   C                     MOVEL'*'       $ODRN
     C                     ELSE
 |   C                     MOVELPUODRN    $ODRN     P
     C                     ENDIF
      *
 |   C                     MOVELBAINVN    $INVN
 |   C                     CALL 'UEXR30'
 |   C                     PARM           $NONY   40
 |   C                     PARM           $NKOJ   1
 |   C                     PARM           $NUKE   4
 |   C                     PARM           $SHFM   80
 |   C                     PARM           $SHTO   80
 |   C                     PARM           $NOBN   2
 |   C                     PARM           $ODRN  10
 |   C                     PARM           $INVN  16
 |   C                     PARM           $QTY    50
JW2  C                     Z-ADD$QTY      S@OQTY
      *
     C                     Z-ADDBADEYY    H@DEYY
     C                     Z-ADDBADEMM    H@DEMM
     C                     Z-ADDBADEDD    H@DEDD
     C                     WRITESFL01
      *
     C                     MOVE BANONY    K@NONY
     C                     MOVE BANUKE    K@NUKE
     C                     MOVE BANKOJ    K@NKOJ
     C                     Z-ADDBANOBN    K@NOBN
     C**                   Z-ADDBADEYY    K@DEYY
     C**                   Z-ADDBADEMM    K@DEMM
     C**                   Z-ADDBADEDD    K@DEDD
      *
     C                     ADD  1         @CNT
     C           @CNT      IFEQ 17
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDRRN1      @RRN    40
     C                     Z-ADDRRN1      #RCNO
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * DISPLAY 2ND SCREEN (HEADER)
      *----------------------------------------------------------------
     C           #SCRN2    BEGSR
     C                     EXSR #GETT
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C**                   MOVE *BLANK    D@PL#
      * PAGE UP
     C           *IN38     WHEQ *ON
     C           *IN80     ANDEQ*OFF
     C                     EXSR #SET11
      * ENTRY KEY
     C                     OTHER
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * CHECK SECOND SCREEN
      *----------------------------------------------------------------
     C           #CHK2     BEGSR
     C                     Z-ADD0         W@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    ANDNE*BLANK
     C                     MOVE *BLANK    S@SLCT
     C                     UPDATSFL01
     C**                   MOVE S@DELV    W@NONY
     C**                   MOVE S@DOCK    W@NUKE
     C**                   MOVE S@NKOJ    W@NKOJ
     C**                   Z-ADDS@SHDT    W@NOHZ
     C**                   Z-ADDS@BIN     W@NOBN
     C**                   Z-ADDH@DEYY    W@DEYY
     C**                   Z-ADDH@DEMM    W@DEMM
     C**                   Z-ADDH@DEDD    W@DEDD
     C                     MOVE S@CUST    D@CUST
     C                     MOVE S@DELV    D@NONY
     C                     MOVE S@DOCK    D@DOCK
     C                     MOVE S@NKOJ    D@FACT
     C                     Z-ADDS@SHDT    D@SHDT
     C                     Z-ADDS@POST    D@POST
     C                     Z-ADDS@BIN     D@NOBN
     C                     EXSR #SET2
     C                     MOVE '03'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------------
JW2   * GET TOTAL ORDERS
 |    *----------------------------------------------------------------
 |   C           #GETT     BEGSR
      *
 |   C                     Z-ADD0         D@TQTY
     C                     GOTO XGETT
      *---------------
     C           K#PLQ1    SETLLAB#PL1Q
     C                     DO   *HIVAL
     C           K#PLQ2    READEAB#PL1Q                  81
     C   81                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
JW2   * GET # OF ORDERS
 |   C                     Z-ADDBANONY    $NONY
 |   C                     MOVELBANKOJ    $NKOJ
 |   C                     MOVELBANUKE    $NUKE
 |   C                     Z-ADDBANOHZ    $SHFM
 |   C                     Z-ADDBANOHZ    $SHTO
 |   C                     MOVELBANOBN    $NOBN
 |   C                     MOVEL'*'       $ODRN     P
 |   C                     MOVELBAINVN    $INVN
 |   C                     CALL 'UEXR30'
 |   C                     PARM           $NONY   40
 |   C                     PARM           $NKOJ   1
 |   C                     PARM           $NUKE   4
 |   C                     PARM           $SHFM   80
 |   C                     PARM           $SHTO   80
 |   C                     PARM           $NOBN   2
 |   C                     PARM           $ODRN  10
 |   C                     PARM           $INVN  16
 |   C                     PARM           $QTY    50
 |   C                     ADD  $QTY      D@TQTY
 |   C                     ENDDO
 |    *
JW2  C           XGETT     ENDSR
      *----------------------------------------------------------------
      * SET DATA FOR SFL02
      *----------------------------------------------------------------
     C           #SET2     BEGSR
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
     C                     Z-ADD0         RRN2
     C                     Z-ADD0         D@UNLD
     C                     Z-ADD0         D@UNLT
      *
     C           K#PLQ1    SETLLAB#PL1Q
     C                     DO   *HIVAL
     C           K#PLQ2    READEAB#PL1Q                  85
     C   85                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARSFL02
     C                     ADD  1         RRN2
     C           BATOKU    IFEQ 3411
     C           D@UNLD    ANDEQ0
     C                     EXSR #UNLD
     C                     ENDIF
      *
     C                     MOVE BAMHN1    S@MHN1
     C                     MOVE BAMHN2    S@MHN2
     C                     MOVE BAMHN3    S@MHN3
     C                     MOVE BASHN1    S@SHN1
     C                     MOVE BASHN2    S@SHN2
     C                     MOVE BASHN3    S@SHN3
     C                     MOVE BASBAN    H@SBAN
     C                     MOVELBAODRN    S@ORDN
     C                     MOVELBAINVN    S@INVN
     C                     Z-ADDBAUSYS    S@SYOS
     C                     Z-ADDBASRYO    S@SHQY
      *
      ***** if subaru, check that info is complete...
     C           BATOKU    IFEQ 3611
     C                     EXSR #CHSUB
     C                     ENDIF
      *
     C                     WRITESFL02
      *
     C                     ENDDO
      *
     C                     Z-ADDRRN1      @RRN    40
     C                     Z-ADDRRN1      #RCNO
      *
     C                     ENDSR
      *----------------------------------------------------------------
      *
      *----------------------------------------------------------------
     C           #UNLD     BEGSR
      *
     C           K#40      SETLLAB#PL40
     C           *IN86     DOUEQ*ON
     C           K#40      READEAB#PL40                  86
     C           *IN86     IFEQ *OFF
     C                     MOVELDAORDN    @@ODR1 10 P
     C                     MOVELWMANI2    @@ODR2 10 P
     C           @@ODR1    IFEQ BAODRN
     C           @@ODR2    OREQ BAODRN
     C                     Z-ADDDAULDT    D@UNLD
     C           DAULTM    DIV  100       D@UNLT
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------------
      *
      *----------------------------------------------------------------
     C           #CHSUB    BEGSR
      *
     C           S@SYOS    IFEQ 0
     C                     Z-ADDBASYOS    S@SYOS
     C                     ENDIF
      *
     C           D@UNLD    IFEQ 0
     C                     EXSR #UNLD2
     C                     ENDIF
      *
     C           H@SBAN    IFEQ '0000'
     C           SVSBAN    ANDNE*BLANKS
     C                     MOVELSVSBAN    H@SBAN
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------------
      *
      *----------------------------------------------------------------
     C           #UNLD2    BEGSR
      *
     C                     MOVEL*BLANKS   SVSBAN  5
     C           K#43      SETLLAB#PP43
     C           *IN86     DOUEQ*ON
     C           K#43      READEAB#PP43                  86
     C           *IN86     IFEQ *OFF
     C           DADEL#    IFEQ BAODRN
     C                     Z-ADDDAULDT    D@UNLD
     C           DAULTM    DIV  100       D@UNLT
     C                     MOVELDASBAN    SVSBAN
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------------
      * DISPLAY 3RD SCREEN (DETAIL)
      *----------------------------------------------------------------
     C           #SCRN3    BEGSR
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      @@ID
     C                     Z-ADDW@RRN     #RCNO
     C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------------
      * INITIAL SETTING
      *------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           K#PLQ1    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@NOHZ  80
     C                     KFLD           K@NOBN  20
     C                     KFLD           K@ODRN 10
     C                     KFLD           K@MHIN 20
      *
     C           K#PLQ2    KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@NOHZ
     C                     KFLD           K@NOBN
      *
     C           K#40      KLIST
     C                     KFLD           BANONY
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           BANOBN
      *
     C           K#43      KLIST
     C                     KFLD           BANONY
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
      *
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         RRN2    40
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
      ********************************************************************
** CMD (78A)
 F1:END
 F1:END      F12:GO BACK
** MSG (60A) ......2.........3.........4.........5.........6
 PACKING LIST# HAS BEEN DELETED ALREADY!                     01
 PACKING LIST NOT FOUND!                                     02
 ENTER PACKING LIST#                                         03
                                                             04
                                                             05
