     H            Y.
     ** AB#R0L **********************************
     *  ..EDI(861)  GENTRAN AS/400          *
     *
     *   TCH         03/13/03
JW1  *   JW    2016.12.19 SAVE AB#EP81
     ********************************** AB#R0A **
     FAB#EP81 IP  E                    DISK
     FAB#PL1C IF  E           K        DISK
     FAB#EPRA O   E                    DISK
     FAB#EP81SO   E                    DISK
      *---------------------------------------------------------
     E                    MH1        30  1
     E                    MH2        30  1
      *---------------------------------------------------------
     IAB#EP811
     I                                              RPRTNRL1
     I            DS
     I                                        1  30 WMHIN
     I                                        1   5 RAMHN1
     I                                        6  10 RAMHN2
     I                                       11  15 RAMHN3
     I                                       16  20 RAMHN4
     I            DS
     I                                        1  30 BAHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1   80BAYMD
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 RASHN1
     I                                        6  10 RASHN2
     I                                       11  12 RASHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
      *   MAIN ROUTINE
      *---------------------------------------------------------
JW1   * SAVE AB#EP81 TO AB#EP81S
JW1  C                     WRITEAB#E81S1
      *
     C                     CLEARAB#EPRA1
      * CUSTOMER,SHIP TO
     C                     MOVELRREFE     RAREF#
     C                     MOVE RDATE     RADATE
     C                     MOVE RDATE     RADAT2
     C                     MOVE RREPK     RARFQ1
     C                     MOVELRREF2     RARFN1
     C                     MOVELRRESI     RARFQ2
     C                     MOVELRREF3     RARFN2
     C                     Z-ADDRCD02     RARQTY
     C                     Z-ADDRCD15     RARRQY
     C                     Z-ADDRCD06     RAQQTY
     C                     Z-ADDRSN01     RASHQY
     C                     MOVELRPONO     RARFN1
      * CUSTOMER PART#
     C                     MOVEARPART     MH1       P
     C                     MOVE *BLANK    MH2
     C                     Z-ADD*ZERO     Y       20
     C           1         DO   30        X       20
     C           MH1,X     IFNE '-'
     C           MH1,X     ANDNE'/'
     C           MH1,X     ANDNE'.'
     C           MH1,X     ANDNE*BLANK
     C                     ADD  1         Y
     C                     MOVE MH1,X     MH2,Y
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAMH2       WMHIN     P
      * IAF PART#
     C                     MOVELRPONO     @10    10
     C           @10       SETLLAB#PL1C
     C           *IN90     DOUEQ*ON
     C           @10       READEAB#PL1C                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAHIN     ANDEQWMHIN
     C           BAYMD     ANDEQRADATE
     C                     MOVE BATOKU    RATOKU
     C                     MOVE BANONY    RANONY
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELRATOKU    PTOKU   4
     C                     MOVEL*BLANK    PNKOJ   1
     C                     MOVEL*BLANK    PNUKE   4
     C                     MOVE RANONY    PNONY   4
     C                     MOVELWMHIN     @MHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C                     MOVEL@SHIN     WSHIN
     C                     WRITEAB#EPRA1
      *-----------------------------------------------------------
      *  INITIALIZE
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     ENDSR
