     H            Y.
      ** AB#R0O **********************************
      *  ..EDI(864)      GENTRAN AS/400          *
      *------------------------------------------------------------------------*
      * CHANGE DATE| PROGRAMMER  | ID  | MEMO                                  *
      *------------------------------------------------------------------------*
      * 2024/05/17 | JW (SRA)    | JW2 | ADDED ORDER QTY                       *
      **************************************************************************
     FAB#EP95 IF  E                    DISK
     FAB#EP96 IF  E           K        DISK
     FAB#PL2I IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
     C                     DO   *HIVAL
     C                     READ AB#EP95                  97
     C   97                LEAVE
      * PRINT HEADER
     C                     EXCPT@HED1
      * PRINT EP96
     C                     EXSR #DTL1
      * PRINT PP2A
     C                     EXSR #DTL2
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
      * PRINT DETAIL1                                   -
      *--------------------------------------------------
     C           #DTL1     BEGSR
      *
     C                     MOVE *BLANK    SVRENO 20
     C                     MOVE *BLANK    XXRENO 20
     C                     Z-ADD0         CNT     30
      *
     C           K#KEY     SETLLAB#EP96
     C                     DO   *HIVAL
     C           K#KEY     READEAB#EP96                  96
     C   96                LEAVE
      *
     C                     ADD  1         CNT
      *
     C           CNT       IFEQ 1
     C                     MOVELAERENO    XXRENO 20
     C                     ELSE
     C                     MOVE *BLANK    XXRENO
     C                     ENDIF
      *
     C                     EXCPT@DTL1
      *
     C           SVRENO    IFEQ *BLANK
     C                     MOVELAERENO    SVRENO 20
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------
      * PRINT AB#PP2A DATA                              -
      *--------------------------------------------------
     C           #DTL2     BEGSR
      *
     C                     MOVELSVRENO    @@14   14
JW1  C           @@14      SETLLAB#PL2I
     C                     DO   *HIVAL
JW1  C           @@14      READEAB#PL2I                  95
     C   95                LEAVE
JW2  C                     MOVELACODRN    XXODRN 12
JW2  C                     Z-ADDACQNTY    XXQNTY  50
     C                     EXCPT@DTL2
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------------
      *  INITIALIZE
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KEY     KLIST
     C                     KFLD           ADCRDT
     C                     KFLD           ADCRTM
     C                     KFLD           ADPLNT
      *
     C                     MOVE *ALL'-'   @LINE 132
     C                     TIME           @@TIME  60
     C                     MOVE *BLANK    @@REF  20
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HED1
     O                         #PGM       9
     O                                   99 'DATE'
     O                         UDATE Y  102
     O                         @@TIME   112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
      *
     O        E   02           @HED1
     O                                   60 'EDI(864) MESSAGE'
      *
     O        E   04           @HED1
     O                                    7 'PLANT:'
     O                         ADPLNT    11
     O                                   13 '('
     O                         ADPLNM    43
     O                                   44 ')'
     O                                  101 'CREATED:'
     O                         ADCRDT   112 '    /  /  '
     O                         ADCRTM   118 '  :  '
      *
     O        E   05           @HED1
     O                                   11 'CONTACT  :'
     O                         ADPRSN    32
      *
     O        E   06           @HED1
     O                                   11 'TEL/EMAIL:'
     O                         ADTLNO    32
      *
     O        E   07           @HED1
     O                                   11 'FAX      :'
     O                         ADFXNO    32
     O                                  107 'REFERENCE #'
      *
     O        E   08           @HED1
     O                         @LINE    132
      *
     O        E 1              @DTL1
     O                         AEMASG    81
     O                         XXRENO   116
      *
     O        E 1              @DTL2
     O                         ACTOKU     5
     O                                    7 '-'
     O                         ACNONY    12
     O                                   21 'ORDER#:'
     O                         XXODRN    34
     O                                   42 'PART#:'
     O                         ACMHIN    63
     O                                   73 'SHIP DATE:'
     O                         ACPLSH    84 '    /  /  '
     O                                   94 'QTY:'
     O                         XXQNTY1  104
