     H            Y.
     ** AB#R0N **********************************
     *  ..EDI(832)      GENTRAN AS/400          *
     *
     * TCHK1 04/30/07 RMV @@TOKU,@@NONY
     * TCHK2 03/07/12 ADD OUTPUT FILE
     ********************************** AB#R0N **
     FAB#EP10 IP  E                    DISK
TCHK2FAG#PP10 O   E                    DISK
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------------
     E                    TAB1    1   5  5   TAB2   15
      *---------------------------------------------------------
     IAB#EP101
     I                                              E1PLIDL1
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK2I* SYSTEM TIME
TCHK2I            DS
TCHK2I                                        1  140WSDT
TCHK2I                                        1   60WSSTM6
TCHK2I                                        1   40WSSTM4
TCHK2I                                        1   20WSSHHH
TCHK2I                                        3   40WSSNNN
TCHK2I                                        5   60WSSSSS
TCHK2I                                        7  140WSSDAT
TCHK2I                                        7  100WSSYYY
TCHK2I                                       11  120WSSMMM
TCHK2I                                       13  140WSSDDD
      *---------------------------------------------------------
      *
TCHK1C*                    SELEC
TCHK1C*          E1PLID    WHEQ 'HMA'
TCHK1C*          E1PLID    OREQ 'V  '
TCHK1C*                    MOVE '0294'    @@TOKU  4
TCHK1C*                    MOVE '0294'    @@NONY  4
TCHK1C*          E1PLID    WHEQ 'HTM'
TCHK1C*                    MOVE '0296'    @@TOKU
TCHK1C*                    MOVE '0296'    @@NONY
TCHK1C*          E1PLID    WHEQ '200'
TCHK1C*          E1PLID    OREQ 'A  '
TCHK1C*          E1PLID    OREQ 'AP9'
TCHK1C*                    MOVE '0390'    @@TOKU
TCHK1C*                    MOVE '4126'    @@NONY
TCHK1C*          E1PLID    WHEQ '210'
TCHK1C*          E1PLID    OREQ 'T  '
TCHK1C*          E1PLID    OREQ 'TP9'
TCHK1C*                    MOVE '0390'    @@TOKU
TCHK1C*                    MOVE '3128'    @@NONY
TCHK1C*          E1PLID    WHEQ '240'
TCHK1C*                    MOVE '5379'    @@TOKU
TCHK1C*                    MOVE '5379'    @@NONY
TCHK1C*          E1PLID    WHEQ '260'
TCHK1C*          E1PLID    OREQ 'Q  '
TCHK1C*          E1PLID    OREQ 'QP9'
TCHK1C*                    MOVE '0390'    @@TOKU
TCHK1C*                    MOVE '0402'    @@NONY
TCHK1C*          E1PLID    WHEQ 'AEP'
TCHK1C*          E1PLID    OREQ 'N  '
TCHK1C*                    MOVE '0390'    @@TOKU
TCHK1C*                    MOVE '2418'    @@NONY
TCHK1C*          E1PLID    WHEQ 'HCM'
TCHK1C*                    MOVE '0295'    @@TOKU
TCHK1C*                    SELEC
TCHK1C*          E1PLID    WHEQ 'SPS1'
TCHK1C*          E1PLID    OREQ 'HCM1'
TCHK1C*                    MOVE '2021'    @@NONY
TCHK1C*          E1PLID    WHEQ 'SPS2'
TCHK1C*          E1PLID    OREQ 'HCM2'
TCHK1C*                    MOVE '2022'    @@NONY
TCHK1C*                    OTHER
TCHK1C*                    MOVE '2020'    @@NONY
TCHK1C*                    ENDSL
TCHK1C*
TCHK1C*                    ENDSL
      *
     C                     MOVE *OFF      *IN50
     C           *INL1     IFEQ *ON
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     EXCPT@DTLX
     C                     MOVE *ON       *IN50
     C                     ENDIF
      *
     C           E1REF2    LOKUPTAB1      TAB2           10
     C                     MOVELE1REF3    @@50   50
     C                     MOVE E1REF3    @@30   30
      *
     C           *IN50     IFEQ *OFF
     C           E1PART    ANDNE*BLANK
     C                     EXCPT@DTLX
     C                     ENDIF
     C                     EXCPT@DTL
TCHK2C*
TCHK2C                     EXSR #OUTF
TCHK2C*
     *-----------------------------------------------------------
     *  INITIALIZE
     *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVE *ALL'-'   @LINE 131
     C                     TIME           @@TIME  60
TCHK2C                     TIME           WSDT
      *
     C                     ENDSR
TCHK2C*
     *-----------------------------------------------------
TCHK2C           #OUTF     BEGSR
TCHK2C*
TCHK2C                     CLEARAG#PP101
TCHK2C*
TCHK2C                     Z-ADDWSSDAT    G1KODT
TCHK2C                     Z-ADDWSSTM6    G1KOTM
TCHK2C                     Z-ADDE1CDAT    G1CDAT
TCHK2C                     Z-ADDE1CTIM    G1CTIM
TCHK2C                     MOVELE1PLNM    G1PLNM
TCHK2C                     MOVELE1PLID    G1PLID
TCHK2C                     MOVELE1PART    G1PART
TCHK2C                     Z-ADDE1UPRC    G1UPRC
TCHK2C                     Z-ADDE1EDAT    G1EDAT
TCHK2C                     Z-ADDE1ETIM    G1ETIM
TCHK2C                     Z-ADDE1XDAT    G1XDAT
TCHK2C                     Z-ADDE1XTIM    G1XTIM
TCHK2C                     MOVELE1REF2    G1REF2
TCHK2C                     MOVELE1REF3    G1REF3
TCHK2C                     Z-ADDE1232D    G1232D
TCHK2C                     MOVELE1REF4    G1REF4
TCHK2C                     MOVELE1REF5    G1REF5
TCHK2C*
TCHK2C                     WRITEAG#PP101
TCHK2C*
TCHK2C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HED
     O                         #PGM       9
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                         @@TIME   107 '  :  :  '
     O                                  110 'PAGE'
     O                         PAGE  Z  114
     O        E   02           @HED
     O                                   70 'EDI(832) PRICE CATALOG'
      *
     O        E   04           @HED
     O                                   18 'CORPORATION NAME:'
     O                         E1PLNM    48
     O*                                  51 'CUST:'
     O*                        @@TOKU    56
     O*                                  61 'DELV:'
     O*                        @@NONY    66
     O                                  101 'CREATE DATE:'
     O                         E1CDAT   112 '    /  /  '
     O        E   05           @HED
     O                                   44 'EFFECTIVE'
     O                                   61 'EXPIRED'
     O        E   06           @HED
     O                                    7 'PART #'
     O                                   31 'U/PRICE'
     O**JW                               40 'DATE'
     O                                   47 'DATE.TIME'
     O**JW                               57 'DATE'
     O                                   64 'DATE.TIME'
     O                                   74 'PLANT ID'
     O        E 1              @DTLX
     O                         @LINE    132
     O        E 1              @DTL
     O                         E1PART    21
     O                         E1UPRC4   31
     O                         E1EDAT    42 '    /  /  '
     O                         E1ETIM    48 '  :  '
     O                         E1XDAT    59 '    /  /  '
     O                         E1XTIM    65 '  :  '
     O                         E1REF4    80
     O                       10TAB2      81
     O                         @@50     132
     O        E 1              @DTL
     O                         @@30     112
** TAB1 / TAB2
MP    MASS PRODUCTION
SP    SERVICE PART
TR    TRIAL PART
NM    NEW MODEL
PPTMP TEMPORARY S/P
