     H            Y.
      ** AB#R95 ********************************************************
      *  .. MANIFEST NUMBER  M/F ..                                    *
      *        K.YASUDA   1999.07.14                                   *
      *        TCH 2000.08.14 ADDD D-MAX                               *
      *        TCH 2004.01.07 ADDD GM(0521)                            *
      * TCHK1 08/16/06 ADD GM(0520)                                    *
      * TCHK2 08/26/06 BUG FIX                                         *
      * TCHK3 07/18/07 ADD GM(0522) & BUG FIX                          *
      * TCHK4 08/23/07 BUG FIX                                         *
      * TCHK5 09/14/07 ADD GM-SPO NEW PLANT                            *
      * TCHK6 11/16/07 ADD TOWER 17 ---> 16                            *
      * TCHK7 12/17/07 ADD GM BRAZIL(2393)
      * TCHK8 05/22/08 ADD GM FAPCO (2394)
      * TCHK8 05/29/08 ADD GM LANS  (2395)
      * TCHK8 07/22/08 ADD GM PONTIAC(2396)
      * TCHK9 09/10/08 ADD GM MGO(0523) DAYTON
      * TCHK8 11/04/08 ADD GM PP(2397) PONTIAC
      * TCHK8 11/12/08 ADD GM HOLLINGSWORTH(2398)
      * TCHK8 04/01/09 ADD GM WILLOW RUN STORAGE(2399)
JW1   * J.W.  07.19.2017 ADD ORDER FILE (AB#PLAA=AB#PPA1)
JW2   * J.W.  02.20.2019 ADD ARVIN SANGO CANADA (0878)
      ******************************************************** AB#R95 **
     FAB#PL95 UF  E           K        DISK                      A
     FAB#PL1A UF  E           K        DISK
JW1  FAB#PLAA UF  E           K        DISK
     FAB#WPNO UF  F       6            DISK                      A
     FAB#WPN2 UF  F       3            DISK                      A
     E                    TB1     1  12  2 0 TB2     1
     E                    TB3     1   2  4   TB4     4
     IAB#WPNO AA  01
     I                                        1   60PNO
     IAB#WPN2 BB  02
     I                                        1   30$PNO
     I            DS
     I                                        1   80YBSKHZ
     I                                        1   40YBSKYY
     I                                        5   60YBSKMM
     I                                        7   80YBSKDD
     I            DS
     I                                        1   80YBKOHZ
     I                                        1   40YBKOYY
     I                                        5   60YBKOMM
     I                                        7   80YBKODD
     I            DS
     I                                        1   60YBKOTM
     I                                        1   20YBKOHH
     I                                        3   40YBKOSS
     I            DS
     I                                        1   80@NOHZ
     I                                        3   40@NOYY
     I                                        5   60@NOMM
     I                                        7   80@NODD
     I            DS
     I                                        1   60INOHZ
     I                                        1   20INOMM
     I                                        3   40INODD
     I                                        5   60INOYY
     I            DS
     I                                        1  17 #MANI
     I                                        1   4 #SIRE
     I                                        5  100#NOHZ
     I                                       11  120IBIN
     I                                       13  170ICONT
      *
     I            DS
     I                                        1  10 MANI
     I                                        1   4 INVO1
     I                                        5   5 INVO2
     I                                        6   70INVO3
     I                                        8  100INVO4
     I                                        2  10 MANI7
TCHK6 *
TCHK6I            DS
TCHK6I                                        1  18 W@MANI
TCHK6I                                        2  18 W@MAN1
TCHK6 *
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     PARM           PSIRE   4
     C                     PARM           PNOHZ   8
TCHK2C*                    PARM           PBIN    10
TCHK2C                     PARM           PBIN    20
     C                     PARM           PMANI  18
      *-----*
      * KEY *
      *-----*
     C           KEY       KLIST
     C                     KFLD           PSIRE
     C                     KFLD           INOHZ
     C                     KFLD           IBIN    20
     C           K#1A      KLIST
     C                     KFLD           @NOHZ
     C                     KFLD           @@BN
     C                     KFLD           K@NONY  40
      *-------------*
      * ARVIN SANGO *
      *-------------*
     C                     MOVE PSIRE     K@NONY
     C                     MOVELPNOHZ     @NOHZ
     C                     Z-ADD@NOYY     INOYY
     C                     Z-ADD@NOMM     INOMM
     C                     Z-ADD@NODD     INODD
     C                     Z-ADDPBIN      @@BN    20
     C******               MOVE PBIN      @@BNC   1
     C           PSIRE     IFEQ '0870'
     C           PSIRE     OREQ '0871'
JW2  C           PSIRE     OREQ '0873'
 |   C           PSIRE     OREQ '0876'
 |   C           PSIRE     OREQ '0878'
 |   C           PSIRE     OREQ '0879'
 |   C           PSIRE     OREQ '0880'
JW2  C           PSIRE     OREQ '0881'
     C           PBIN      IFEQ 0
     C                     Z-ADD1         IBIN
     C                     ELSE
     C                     Z-ADDPBIN      IBIN
     C                     END
     C                     MOVELPSIRE     #SIRE
      *
     C                     Z-ADD@NOYY     INOYY
     C                     Z-ADD@NOMM     INOMM
     C                     Z-ADD@NODD     INODD
     C                     Z-ADDINOHZ     #NOHZ
     C                     SETOF                     50
     C           KEY       CHAINAB#PL951             50
     C           *IN50     IFEQ '1'
     C                     GOTO JUMP
     C                     END
      *
     C           *IN50     IFEQ '0'
     C           YBSKJY    IFEQ 'D'
     C           YBSKHZ    ANDLE*DATE
     C                     GOTO JUMP
     C                     ELSE
     C                     MOVELYBMANI    PMANI
     C                     GOTO SKIP
      *
     C                     END
     C                     END
     C                     END
      *-------------*
      * ISUZU DMAX  *
      *-------------*
     C           JUMP      TAG
     C           PSIRE     IFNE '0437'
     C           PSIRE     ANDNE'0590'
     C           PSIRE     ANDNE'0521'
TCHK1C           PSIRE     ANDNE'0520'
TCHK3C           PSIRE     ANDNE'0522'
TCHK9C           PSIRE     ANDNE'0523'
     C           PSIRE     ANDNE'2389'
TCHK5C           PSIRE     ANDNE'2390'
TCHK5C           PSIRE     ANDNE'2391'
TCHK5C           PSIRE     ANDNE'2392'
TCHK7C           PSIRE     ANDNE'2393'
TCHK8C           PSIRE     ANDNE'2394'
TCHK8C           PSIRE     ANDNE'2395'
TCHK8C           PSIRE     ANDNE'2396'
TCHK8C           PSIRE     ANDNE'2397'
TCHK8C           PSIRE     ANDNE'2398'
TCHK8C           PSIRE     ANDNE'2399'
     C           *IN78     IFEQ '0'
     C                     Z-ADD1         PCONT   50
     C                     SETON                     78
     C                     SETOF                     77
     C           1         CHAINAB#WPNO              77
      *
     C           *IN77     IFEQ '0'
     C                     MOVE PNO       PCONT
     C                     END
     C                     END
      *
     C                     MOVELPNOHZ     @NOHZ
     C           PBIN      IFEQ 0
     C                     Z-ADD1         IBIN
     C                     ELSE
     C                     Z-ADDPBIN      IBIN
     C                     END
     C                     MOVELPSIRE     #SIRE
      *
     C                     Z-ADD@NOYY     INOYY
     C                     Z-ADD@NOMM     INOMM
     C                     Z-ADD@NODD     INODD
     C                     Z-ADDINOHZ     #NOHZ
     C                     ELSE
     C           *IN78     IFEQ '0'
     C           PBIN      IFEQ 0
     C                     Z-ADD1         IBIN
     C                     ELSE
     C                     Z-ADDPBIN      IBIN
     C                     END
     C                     Z-ADD1         $CONT   30
     C                     SETON                     78
     C                     SETOF                     77
     C           1         CHAINAB#WPN2              77
      *
     C           *IN77     IFEQ '0'
     C                     MOVE $PNO      $CONT
     C                     END
     C                     END
     C                     Z-ADD@NOYY     INOYY
     C                     Z-ADD@NOMM     INOMM
     C                     Z-ADD@NODD     INODD
     C                     Z-ADDINOHZ     #NOHZ
     C                     Z-ADD1         A       20
     C                     SETOF                     66
     C           PSIRE     LOKUPTB3,A                    66
     C   66                MOVELTB4,A     INVO1
     C  N66                MOVELPSIRE     INVO1
     C                     MOVELPSIRE     #SIRE
     C                     Z-ADD1         A       20
     C                     SETOF                     55
     C           @NOMM     LOKUPTB1,A                    55
     C           *IN55     IFEQ '1'
     C                     MOVELTB2,A     INVO2
     C                     END
     C                     Z-ADD@NODD     INVO3
     C                     Z-ADD$CONT     INVO4
     C                     END
      *
     C                     SETOF                     10
     C           KEY       CHAINAB#PL951             10
     C           *IN10     IFEQ *OFF
     C           YBMANI    ANDNE*BLANK
     C                     MOVELYBMANI    PMANI
     C*                    GOTO SKIP
     C                     ENDIF
      *
     C*** WRITE MANIFEST # ***
     C           *IN10     IFEQ '1'
TCHK3C           YBMANI    OREQ *BLANK
     C                     MOVE *BLANK    YBSKJY
     C                     Z-ADD0         YBSKHZ
     C                     Z-ADD*DATE     YBKOHZ
     C                     TIME           YBKOTM
     C                     MOVELUS        YBKOME
     C                     MOVELPSIRE     YBSUPP
     C                     MOVELINOHZ     YBSPHZ
     C                     MOVELIBIN      YBSPBN
     C                     SELEC
     C           PSIRE     WHEQ '0437'
     C           PSIRE     OREQ '0590'
     C                     Z-ADD0         YBCONT
     C                     MOVELMANI      YBMANI
     C                     MOVELMANI      PMANI
     C           PSIRE     WHEQ '0521'
TCHK1C           PSIRE     OREQ '0520'
TCHK3C           PSIRE     OREQ '0522'
TCHK9C           PSIRE     OREQ '0523'
     C           PSIRE     OREQ '2389'
TCHK5C           PSIRE     OREQ '2390'
TCHK5C           PSIRE     OREQ '2391'
TCHK5C           PSIRE     OREQ '2392'
TCHK7C           PSIRE     OREQ '2393'
TCHK8C           PSIRE     OREQ '2394'
TCHK8C           PSIRE     OREQ '2395'
TCHK8C           PSIRE     OREQ '2396'
TCHK8C           PSIRE     OREQ '2397'
TCHK8C           PSIRE     OREQ '2398'
TCHK8C           PSIRE     OREQ '2399'
     C                     Z-ADD0         YBCONT
     C                     MOVELMANI7     YBMANI    P
     C                     MOVELMANI7     PMANI     P
     C                     OTHER
     C                     MOVE PCONT     YBCONT
     C                     MOVE PCONT     ICONT
     C                     MOVEL#MANI     YBMANI
TCHK3C                     MOVEL#MANI     PMANI     P
     C                     ENDSL
     C                     Z-ADD@NOHZ     YBNOHZ
TCHK3C*                    WRITEAB#PL951
TCHK3C   10                WRITEAB#PL951
TCHK3C  N10                UPDATAB#PL951
     C*
     C* 0437(SIA),0590(D-MAX)
     C           PSIRE     IFNE '0437'
     C           PSIRE     ANDNE'0590'
     C           PSIRE     ANDNE'0521'
TCHK1C           PSIRE     ANDNE'0520'
TCHK3C           PSIRE     ANDNE'0522'
TCHK9C           PSIRE     ANDNE'0523'
     C           PSIRE     ANDNE'2389'
TCHK5C           PSIRE     ANDNE'2390'
TCHK5C           PSIRE     ANDNE'2391'
TCHK5C           PSIRE     ANDNE'2392'
TCHK7C           PSIRE     ANDNE'2393'
TCHK8C           PSIRE     ANDNE'2394'
TCHK8C           PSIRE     ANDNE'2395'
TCHK8C           PSIRE     ANDNE'2396'
TCHK8C           PSIRE     ANDNE'2397'
TCHK8C           PSIRE     ANDNE'2398'
TCHK8C           PSIRE     ANDNE'2399'
     C                     EXSR SUB1
     C                     ELSE
     C                     EXSR SUB2
     C                     END
      *
     C                     END
      *
     C*** UPDATE MANIFEST # ***
     C           *IN10     IFEQ '0'
     C           YBSKJY    IFEQ 'D'
     C           YBSKHZ    ANDLE*DATE
     C                     MOVE *BLANK    YBSKJY
     C                     Z-ADD0         YBSKHZ
     C                     Z-ADD*DATE     YBKOHZ
     C                     TIME           YBKOTM
     C                     MOVELUS        YBKOME
     C                     MOVELPSIRE     YBSUPP
     C                     MOVELINOHZ     YBSPHZ
     C                     MOVELIBIN      YBSPBN
     C*
     C                     SELEC
     C           PSIRE     WHEQ '0437'
     C           PSIRE     OREQ '0590'
     C                     Z-ADD0         YBCONT
     C                     MOVELMANI      YBMANI
     C                     MOVELMANI      PMANI
     C           PSIRE     WHEQ '0521'
TCHK1C           PSIRE     OREQ '0520'
TCHK3C           PSIRE     OREQ '0522'
TCHK9C           PSIRE     OREQ '0523'
     C           PSIRE     OREQ '2389'
TCHK5C           PSIRE     OREQ '2390'
TCHK5C           PSIRE     OREQ '2391'
TCHK5C           PSIRE     OREQ '2392'
TCHK7C           PSIRE     OREQ '2393'
TCHK8C           PSIRE     OREQ '2394'
TCHK8C           PSIRE     OREQ '2395'
TCHK8C           PSIRE     OREQ '2396'
TCHK8C           PSIRE     OREQ '2397'
TCHK8C           PSIRE     OREQ '2398'
TCHK8C           PSIRE     OREQ '2399'
     C*                    Z-ADD0         YBCONT
     C*          MANI7     CAT  @@BNC:0   YBMANI    P
     C*          MANI7     CAT  @@BNC:0   PMANI     P
     C                     MOVELYBMANI    PMANI
     C                     OTHER
     C                     MOVE PCONT     YBCONT
     C                     MOVE PCONT     ICONT
     C                     MOVEL#MANI     YBMANI
TCHK3C                     MOVEL#MANI     PMANI     P
     C                     ENDSL
     C                     Z-ADD@NOHZ     YBNOHZ
     C                     UPDATAB#PL951
     C*
     C* 0437(SIA),0590(D-MAX)
     C           PSIRE     IFNE '0437'
     C           PSIRE     ANDNE'0590'
     C           PSIRE     ANDNE'0521'
TCHK1C           PSIRE     ANDNE'0520'
TCHK3C           PSIRE     ANDNE'0522'
TCHK9C           PSIRE     ANDNE'0523'
     C           PSIRE     ANDNE'2389'
TCHK5C           PSIRE     ANDNE'2390'
TCHK5C           PSIRE     ANDNE'2391'
TCHK5C           PSIRE     ANDNE'2392'
TCHK7C           PSIRE     ANDNE'2393'
TCHK8C           PSIRE     ANDNE'2394'
TCHK8C           PSIRE     ANDNE'2395'
TCHK8C           PSIRE     ANDNE'2396'
TCHK8C           PSIRE     ANDNE'2397'
TCHK8C           PSIRE     ANDNE'2398'
TCHK8C           PSIRE     ANDNE'2399'
     C                     EXSR SUB1
     C                     ELSE
     C                     EXSR SUB2
     C                     END
     C*
     C                     ELSE
     C*
TCHK3C* 0437(SIA),0590(D-MAX)
TCHK3C*          PSIRE     IFNE '0437'
TCHK3C*          PSIRE     ANDNE'0590'
TCHK3C*                    MOVE YBCONT    ICONT
TCHK3C*                    MOVEL#MANI     YBMANI
TCHK3C*                    UPDATAB#PL951
     C*
TCHK3C*                    ELSE
TCHK3C*          YBMANI    IFEQ *BLANK
TCHK3C*                    MOVE YBCONT    ICONT
TCHK3C*                    MOVEL#MANI     PMANI
TCHK3C*                    ELSE
TCHK3C*                    MOVELYBMANI    PMANI
TCHK3C*                    END
     C*
TCHK3C*                    END
TCHK4C           PSIRE     IFNE '0437'
TCHK4C           PSIRE     ANDNE'0590'
TCHK4C           PSIRE     ANDNE'0521'
TCHK4C           PSIRE     ANDNE'0520'
TCHK4C           PSIRE     ANDNE'0522'
TCHK9C           PSIRE     ANDNE'0523'
TCHK4C           PSIRE     ANDNE'2389'
TCHK5C           PSIRE     ANDNE'2390'
TCHK5C           PSIRE     ANDNE'2391'
TCHK5C           PSIRE     ANDNE'2392'
TCHK7C           PSIRE     ANDNE'2393'
TCHK8C           PSIRE     ANDNE'2394'
TCHK8C           PSIRE     ANDNE'2395'
TCHK8C           PSIRE     ANDNE'2396'
TCHK8C           PSIRE     ANDNE'2397'
TCHK8C           PSIRE     ANDNE'2398'
TCHK8C           PSIRE     ANDNE'2399'
TCHK4C                     MOVE YBCONT    ICONT
TCHK4C                     MOVEL#MANI     PMANI
TCHK4C                     ELSE
TCHK4C                     MOVELYBMANI    PMANI     P
TCHK4C                     END
     C                     END
     C                     END
      *
TCHK3C* 0437(SIA),0590(D-MAX)
TCHK3C*          PSIRE     IFNE '0437'
TCHK3C*          PSIRE     ANDNE'0590'
TCHK3C*          PSIRE     ANDNE'0521'
TCHK3C*TCHK1     PSIRE     ANDNE'0520'
TCHK3C*TCHK3     PSIRE     ANDNE'0522'
TCHK3C*          PSIRE     ANDNE'2389'
TCHK3C*                    MOVEL#MANI     PMANI
TCHK3C*                    END
      *
     C           SKIP      TAG
      *
     C           PSIRE     IFEQ '0521'
TCHK1C           PSIRE     OREQ '0520'
TCHK3C           PSIRE     OREQ '0522'
TCHK9C           PSIRE     OREQ '0523'
     C           PSIRE     OREQ '2389'
TCHK5C           PSIRE     OREQ '2390'
TCHK5C           PSIRE     OREQ '2391'
TCHK5C           PSIRE     OREQ '2392'
TCHK7C           PSIRE     OREQ '2393'
TCHK8C           PSIRE     OREQ '2394'
TCHK8C           PSIRE     OREQ '2395'
TCHK8C           PSIRE     OREQ '2396'
TCHK8C           PSIRE     OREQ '2397'
TCHK8C           PSIRE     OREQ '2398'
TCHK8C           PSIRE     OREQ '2399'
     C                     EXSR #APUP
     C                     ENDIF
      *
TCHK6C           PSIRE     IFEQ '0940'
TCHK6C           PSIRE     OREQ '0946'
TCHK6C                     MOVELPMANI     W@MANI
TCHK6C                     MOVELW@MAN1    PMANI     P
TCHK6C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------------
      * UPDATE AB#PL1A
      *---------------------------------------------------------
     C           #APUP     BEGSR
      * AB#PP10 --------------------------------
     C           K#1A      SETLLAB#PL1A
     C           *IN80     DOUEQ*ON
     C           K#1A      READEAB#PL1A                  80
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    IFEQ *BLANK
     C                     MOVELPMANI     BAINVN
     C                     UPDATAB#PL141
     C                     ELSE
     C                     MOVELBAINVN    PMANI
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
JW1   * AB#PPA1 --------------------------------
 |   C                     MOVE *OFF      *IN81
 |   C           K#1A      SETLLAB#PLAA
 |   C           *IN81     DOUEQ*ON
 |   C           K#1A      READEAB#PLAA                  81
 |   C           *IN81     IFEQ *OFF
 |   C           BASKJY    ANDEQ*BLANK
 |   C           BAINVN    IFEQ *BLANK
 |   C                     MOVELPMANI     BAINVN
 |   C                     UPDATAB#PLAA1
 |   C                     ELSE
 |   C                     MOVELBAINVN    PMANI
 |   C                     ENDIF
 |   C                     ENDIF
JW1  C                     ENDDO
      *
     C                     ENDSR
     C*****************************************************************
      * SUB1:UPDATE AB#WPNO FOR COMMON MANIFEST #(SEQUENCE #)
     C*****************************************************************
     C           SUB1      BEGSR
     C                     Z-ADD0         #PNO    60
     C           PCONT     IFLT 99999
     C           PCONT     ADD  1         #PNO
     C                     ELSE
     C                     Z-ADD1         #PNO
     C                     END
      *
     C                     SETOF                     77
     C           1         CHAINAB#WPNO              77
      *
     C           *IN77     IFEQ '0'
     C                     EXCPTDUP
     C                     ELSE
     C                     EXCPTDAD
     C                     END
     C                     ENDSR
     C*****************************************************************
      * SUB2:UPDATE AB#WPN2 FOR SIA,D-MAX MANIFEST #(SEQUENCE #)
     C*****************************************************************
     C           SUB2      BEGSR
     C                     Z-ADD0         @PNO    30
     C           $CONT     IFLT 999
     C           $CONT     ADD  1         @PNO
     C                     ELSE
     C                     Z-ADD1         @PNO
     C                     END
      *
     C                     SETOF                     77
     C           1         CHAINAB#WPN2              77
      *
     C           *IN77     IFEQ '0'
     C                     EXCPTDDUP
     C                     ELSE
     C                     EXCPTDDAD
     C                     END
     C                     ENDSR
      *
     OAB#WPNO E                DUP
     O                         #PNO
     O        EADD             DAD
     O                         #PNO
      *
     OAB#WPN2 E                DDUP
     O                         @PNO
     O        EADD             DDAD
     O                         @PNO
** TB1/2
011
022
033
044
055
066
077
088
099
10A
11B
12C
** TB3/TB4
0437C742
0590D742
