     H            Y.
     ** AB#RAC ********************************************************
     *  SHIPPING PREPARATION CHECK                                    *
      *
      *  TCHK1  11/01/05  ADD 3764,3423
      *  TCHK2  08/23/06  ADD 0541,3851
      *  TCHK3  11/07/06  BUG FIX
      *  TCHK4  11/13/07  ADD 3220
      *  TCHK5  08/09/12  ADD 3428
      *  LEC    05/20/2024 CHK AL#PL21 FOR TOYOTA DELV CD
     ******************************************************** AB#RAA **
     FAB#PL14 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FAB#PL75 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAL#PL21 IF  E           K        DISK
     FPRT132  O   F     132            DISK
      *------------------------------------------------------------
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C                     Z-ADD*DATE     K@YMD
     C                     Z-ADD*ZERO     @CNT    20
     C           K#KEY     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         @CNT
     C           @CNT      IFEQ 5
     C                     Z-ADDF8YMD     @ENDDT  80
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*DATE     K@YMD
     C           K#KEY     SETLLAB#PL14
     C           *IN80     DOUEQ*ON
     C                     READ AB#PL14                  80
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BANOHZ    IFGT @ENDDT
     C                     LEAVE
     C                     ENDIF
      *
     C                     EXSR #CHK
     C                     Z-ADDBANOHZ    K@YMD
     C           K#14      SETGTAB#PL14
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@ID    1
      *
     C           K#KEY     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#14      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           BANOBN
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C           K#70      KLIST
     C                     KFLD           BATOKU
     C                     KFLD           K@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           BAODRN
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C           K#75      KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
      *
     C                     MOVE *BLANK    P@ID
     C                     TIME           @TIME   60
     C                     MOVE *ALL'-'   @LINE  88
     C                     MOVE X'0D'     A       1
     C                     MOVE X'0A'     B       1
     C                     Z-ADD*DATE     K@YMD
      *
     C           K#KEY     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C           F8HIRU    ORNE *BLANK
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK      BEGSR
      *-----------------------------------------------------
      *
     C                     MOVE BANONY    K@NONY
     C                     MOVE BANOBN    K@NOBN
     C                     MOVE *BLANK    @CHK1   1
     C                     MOVE *BLANK    @CHK2   1
     C           K#75      CHAINAB#PL75              90
     C           *IN90     IFEQ *ON
     C**                   MOVE 'X'       @CHK1
JW   C                     MOVE 'N'       @CHK1
     C                     ENDIF
JW   C           *IN90     IFEQ *OFF
     C           PUSKJY    ANDEQ'D'
     C**                   MOVE 'X'       @CHK1
JW   C                     MOVE 'N'       @CHK1
     C                     ENDIF
      *
     C           BANONY    CHAINAL#PL21              50
     C           *IN50     IFEQ *ON
     C           K#70      CHAINAB#PL70              90
     C           *IN90     IFEQ *ON
JW   C                     MOVE 'N'       @CHK2
     C                     ENDIF
     C                     ENDIF
      *
     C           @CHK1     IFNE *BLANK
     C           @CHK2     ORNE *BLANK
     C                     EXSR #OUT
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #OUT      BEGSR
      *-----------------------------------------------------
     C           *IN98     IFEQ *OFF
     C                     EXCPT@HED1
     C                     EXCPT@HED2
     C                     EXCPT@HED3
     C                     EXCPT@HED4
     C                     EXCPT@HED5
     C                     EXCPT@HED6
     C                     MOVE *ON       *IN98
     C                     ENDIF
      *
     C                     MOVE '1'       P@ID
     C**********           MOVELMSG,X     D@MSG  25
     C           BANONY    CHAINFGBPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVELB2SMEI    D@NAME 15
TCHK3C                     ELSE
TCHK3C                     MOVEL*BLANK    D@NAME
     C                     ENDIF
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *-----------------------------------------------------
     OPRT132  E                @HED1
     O                         #PGM       9
JW   O                         #USER     20
     O                         UDATE Y   80
     O                         @TIME     90 '  :  :  '
     O        E                @HED2
     O                         A          1
     O                                   47 '** SHIPPING PREPARATION'
     O                                   61 'CHECK LIST **'
     O        E                @HED3
     O                         A          1
     O        E                @HED4
     O                         A          1
     O                                   85 'N=NOT PRINTED'
     O        E                @HED5
     O                         A          1
     O                                    5 'CUST'
     O                                   14 'SHIP TO'
     O                                   17 'F'
     O                                   40 'DOCK'
     O                                   52 'SHIP DATE'
     O                                   60 'BIN'
     O                                   78 'PACKING LIST'
     O                                   89 'LABELS'
     O        E                @HED6
     O                         A          1
     O                         @LINE     90
     O        E                @DTL
     O                         A          1
     O                         BATOKU     5
     O                         BANONY    12
     O                         BANKOJ    17
     O                         D@NAME    35
     O                         BANUKE    40
     O                         BANOHZ    52 '    /  /  '
     O                         BANOBN    60
     O                         @CHK1     75
     O                         @CHK2     85
