     H            Y.
      ** AB#RRS ********************************************************
      *  EDI FORD(862) DATA LIST (FUTURE FORD ORDER INFORMATION)       *
      *  CREATED AB#WPFO TO BE PUT INTO A CSV FILE.                    *
      *********************************************** AB#RRS **        *
     FABFAP01 IF  E           K        DISK
     FABF2L02 IF  E           K        DISK
     FABF9P01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#WPFO O   E                    DISK                      A
     E                    NET        14  7
     E                    DAT        14  6
     E                    QPC        14  6 0
     E                    SQPC       14  6 0
     E                    PT1        40  1
     E                    PT2        40  1
      * NET.
     I            DS
     I                                        1  98 NET
     I                                        1   70WNET1
     I                                        8  140WNET2
     I                                       15  210WNET3
     I                                       22  280WNET4
     I                                       29  350WNET5
     I                                       36  420WNET6
     I                                       43  490WNET7
     I                                       50  560WNET8
     I                                       57  630WNET9
     I                                       64  700WNET10
     I                                       71  770WNET11
     I                                       78  840WNET12
     I                                       85  910WNET13
     I                                       92  980WNET14
      * DELIVERY DATE
     I            DS
     I                                        1  84 DAT
     I                                        1   60WDDT1
     I                                        7  120WDDT2
     I                                       13  180WDDT3
     I                                       19  240WDDT4
     I                                       25  300WDDT5
     I                                       31  360WDDT6
     I                                       37  420WDDT7
     I                                       43  480WDDT8
     I                                       49  540WDDT9
     I                                       55  600WDDT10
     I                                       61  660WDDT11
     I                                       67  720WDDT12
     I                                       73  780WDDT13
     I                                       79  840WDDT14
      * QUANTITY
     I            DS
     I                                        1  100AFQTY2
     I                                        4  10 WWQTY2
      * DELIVERY DATE
     I            DS
     I                                        1   80AFDLDT
     I                                        3   8 WWDLDT
      * NET QUANTITY(FORD CUM ATY - SHIPPED CUM)
     I            DS
     I                                        1   70WNNET
     I                                        1   7 WCNET
     I            DS
     I                                        1  40 DPART
     I                                        1   5 DPART1
     I                                        6  10 DPART2
     I                                       11  12 DPART3
     I                                       13  40 DPART4
      * QUANTITY PER CONTAINER
     I            DS
     I                                        1  840QPC
     I                                        1   60QPC1
     I                                        7  120QPC2
     I                                       13  180QPC3
     I                                       19  240QPC4
     I                                       25  300QPC5
     I                                       31  360QPC6
     I                                       37  420QPC7
     I                                       43  480QPC8
     I                                       49  540QPC9
     I                                       55  600QPC10
     I                                       61  660QPC11
     I                                       67  720QPC12
     I                                       73  780QPC13
     I                                       79  840QPC14
      *
      * SAVE QUANTITY PER CONTAINER
     I            DS
     I                                        1  840SQPC
     I                                        1   60SQPC1
     I                                        7  120SQPC2
     I                                       13  180SQPC3
     I                                       19  240SQPC4
     I                                       25  300SQPC5
     I                                       31  360SQPC6
     I                                       37  420SQPC7
     I                                       43  480SQPC8
     I                                       49  540SQPC9
     I                                       55  600SQPC10
     I                                       61  660SQPC11
     I                                       67  720SQPC12
     I                                       73  780SQPC13
     I                                       79  840SQPC14
      *
     I            DS
     I                                        1   80CDATE
     I                                        1   40CDAT1
     I                                        5   60CDAT2
     I                                        7   80CDAT3
     I                                        3   80CDAT
      *
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 #PAR1
     I                                        6  10 #PAR2
     I                                       11  12 #PAR3
     I            DS
     I                                        1   80TDATE
     I                                        1   40TDAT1
     I                                        5   60TDAT2
     I                                        7   80TDAT3
     I                                        3   80TDAT
     I            DS
     I                                        1   8 WSTR
     I                                        1   1 WSTRK
     I                                        2   3 WSTRT
     I                                        4   5 WSTRR
     I                                        6   6 WSTRD
     I            DS
     I                                        1   8 WKTR
     I                                        1   1 WKTRK
     I                                        2   3 WKTRT
     I                                        4   5 WKTRR
     I                                        6   6 WKTRD
     I            DS
     I                                        1   8 A2STR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   8 A2KTR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     ******************************************************
      *
     C           KEY1      KLIST
     C                     KFLD           KDOC1   5
      *
     C           KEY2      KLIST
     C                     KFLD           #PAR1
     C                     KFLD           #PAR2
     C                     KFLD           #PAR3
      *
     C           KEY3      KLIST
     C                     KFLD           KSTID   5        PLANT
     C                     KFLD           KDOCK   4        DOCK
     C                     KFLD           KIPAR  20        INTRL PART#
     C                     KFLD           KSIDT   80       SHIP ISS DAT
     C                     KFLD           KPOR#   6        RELEASE#
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10        USER ID
      *
     C                     MOVELPUSER     USER    5
     C                     TIME           WTIME   60
     C                     Z-ADD*ZERO     WNNET   70
     C                     Z-ADD*ZERO     QTYPC   50
     C                     Z-ADD1         I       20
     C                     Z-ADD*ZERO     X       20
     C                     MOVE *ZERO     NET
     C                     MOVE *ZERO     DAT
     C                     MOVE *ZERO     QPC
      *
      *------------------- SETON                     98
     C           *LOVAL    SETLLABFAP01R
     C                     READ ABFAP01R                 90
      *
     C           *IN90     DOWEQ'0'
      *
     C                     SETON                     91
      * MOVE VALUE FOR KEY3
     C                     MOVELCFDOCK    KSTID
     C                     MOVE 'A'       KSTID
     C                     MOVELCFDOC2    KDOCK
     C                     MOVELCFPART    KIPAR
     C                     MOVE CFSIDT    KSIDT
     C                     MOVE CFPOR#    KPOR#
      *
     C                     SETOF                       95
     C           KEY3      SETLLABF2P011
     C           KEY3      READEABF2P011                 95
      *
     C                     Z-ADD0         Y       20       14 TIMES
     C           *IN95     DOWEQ'0'
     C                     ADD  1         Y
     C           *IN95     IFEQ '1'
     C           Y         ORGT 14
     C                     LEAVE
     C                     ENDIF
      *
     C                     SETON                       80  RECORD IS FOUND
      * MOVE VALUE FOR KEY1
     C                     MOVELAFDOCK    WDOCK   4
     C                     MOVELAFSTID    KDOC1
     C                     MOVE 'A'       KDOC1
     C           KEY1      CHAINABF9P01              92
     C           *IN92     IFEQ '0'
     C                     MOVELF9DOCK    WTOKU   4        TOKUISAKI
     C                     MOVELF9DELY    WNONY   4        NONYUSAKI
     C                     END
      *
     C                     MOVEL'5149'    PTOKU   4
     C                     MOVELF9DELY    PNONY   4
     C                     MOVEL'0'       PNKOJ   1
     C                     MOVELAFDOCK    PNUKE   4
     C                     MOVELCFPART    @MHIN  20        USER PART#
     C                     MOVEL*BLANK    @SHIN  12        INTERNAL
     C                     MOVEL*BLANK    @FLG    1
      *
      *  CALL PART# CONVERSION PGM
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU
     C                     PARM           PNONY
     C                     PARM           PNKOJ
     C                     PARM           PNUKE
     C                     PARM           @MHIN
     C                     PARM           @SHIN
     C                     PARM           @FLG
     C                     MOVEL@MHIN     WPART  12
      *
      *  PART# IS IN KEY2
     C           KEY2      CHAINFCEPL011             93
     C           *IN93     IFEQ '0'
     C                     MOVE A2SYYY    CDAT1
     C                     MOVE A2SYMM    CDAT2
     C                     MOVE A2SYDD    CDAT3
     C                     MOVE A2TRYY    TDAT1
     C                     MOVE A2TRMM    TDAT2
     C                     MOVE A2TRDD    TDAT3
      *
     C                     ELSE
     C                     MOVE *BLANK    CDAT1
     C                     MOVE *BLANK    CDAT2
     C                     MOVE *BLANK    CDAT3
     C                     END
      *
      * 1ST. RECORD ?
     C           *IN91     IFEQ '1'
     C                     SETOF                     913031
     C                     SETOF                     32
      *
     C                     MOVEAWWDLDT    DAT,I
     C           AFQTY2    SUB  AFYSQY    WNNET
      *
     C                     EXSR @SYOS
     C                     EXSR @SUBR1
     C                     Z-ADDQTYPC     WTYPC   50
      *
     C                     ELSE
      *
     C           *IN93     IFEQ '1'
     C                     MOVE *ZERO     QTYPC
      *
     C                     ELSE
     C           CDATE     IFGE WFHSDT
     C           CDATE     ANDLEWFHEDT
     C                     SETON                     31
     C                     MOVE A2SSYS    QTYPC
      *
     C                     ELSE
     C                     MOVE WSYOS     QTYPC
     C                     END
     C           TDATE     IFGE WFHSDT
     C           TDATE     ANDLEWFHEDT
     C                     SETON                     32
     C                     END
     C                     END
      *
     C                     ADD  1         I
     C                     MOVEAWWDLDT    DAT,I
     C           AFQTY2    SUB  AFYSQY    WNNET
      *
     C                     EXSR @SYOS
     C                     EXSR @SUBR1
      *
     C                     END
     C                     Z-ADDAFHSDT    WFHSDT  80
     C                     Z-ADDAFHEDT    WFHEDT  80
      *
     C           KEY3      READEABF2P011                 95
     C                     END
      *
      * WHEN THERE IS ANY RECORD TO BE WRITTEN
      *
     C           *IN80     IFEQ '1'
      * if any of the 14 qtys is greater than zero, output detail.
     C                     MOVE ' '       PRINT   1
      *
     C                     DO   14        QX      20
     C           QPC,QX    IFGT *ZERO
     C                     MOVE 'Y'       PRINT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           PRINT     IFEQ 'Y'
      *
     C           HDG       IFNE 'Y'
     C                     MOVEL'PLANT'   FDPLNT
     C                     MOVEL'DOCK'    FDDOCK
     C                     MOVEL'PART#'   FDPART
     C                     MOVEL'QPC'     FDQPC
     C                     MOVELWDDT1     FDQT01
     C                     MOVELWDDT2     FDQT02
     C                     MOVELWDDT3     FDQT03
     C                     MOVELWDDT4     FDQT04
     C                     MOVELWDDT5     FDQT05
     C                     MOVELWDDT6     FDQT06
     C                     MOVELWDDT7     FDQT07
     C                     MOVELWDDT8     FDQT08
     C                     MOVELWDDT9     FDQT09
     C                     MOVELWDDT10    FDQT10
     C                     MOVELWDDT11    FDQT11
     C                     MOVELWDDT12    FDQT12
     C                     MOVELWDDT13    FDQT13
     C                     MOVELWDDT14    FDQT14
     C                     WRITEABWPFOR
     C                     CLEARABWPFOR
     C                     MOVE 'Y'       HDG     1
     C                     ENDIF
      *
     C                     MOVELWNONY     FDPLNT
     C                     MOVELWTOKU     FDPLCD
     C                     MOVELWDOCK     FDDOCK
     C                     MOVELWPART     FDPART
     C                     MOVELWTYPC     FDQPC
     C                     Z-ADDQPC1      FDQT01
     C                     Z-ADDQPC2      FDQT02
     C                     Z-ADDQPC3      FDQT03
     C                     Z-ADDQPC4      FDQT04
     C                     Z-ADDQPC5      FDQT05
     C                     Z-ADDQPC6      FDQT06
     C                     Z-ADDQPC7      FDQT07
     C                     Z-ADDQPC8      FDQT08
     C                     Z-ADDQPC9      FDQT09
     C                     Z-ADDQPC10     FDQT10
     C                     Z-ADDQPC11     FDQT11
     C                     Z-ADDQPC12     FDQT12
     C                     Z-ADDQPC13     FDQT13
     C                     Z-ADDQPC14     FDQT14
     C                     WRITEABWPFOR
     C                     CLEARABWPFOR
      *
     C                     ENDIF
      *
     C                     EXSR @CLR
     C                     SETOF                     80
     C                     ENDIF
      *
     C                     READ ABFAP01R                 90
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *****************************************************************
      *     @CLR : CLEAR WORK-AREA,TBL
      *****************************************************************
     C           @CLR      BEGSR
      *
     C                     Z-ADD*ZERO     QTYPC   50
     C                     Z-ADD*ZERO     CDAT
     C                     Z-ADD*ZERO     QTYPC1  50
     C                     MOVE *BLANK    WSTR
     C                     MOVE *BLANK    WKTR
     C                     SETOF                     303132
     C                     Z-ADD1         I
     C                     MOVE *ZERO     DAT
     C                     MOVE *ZERO     NET
     C                     MOVE *ZERO     QPC
     C           AFQTY2    SUB  AFYSQY    WNNET
     C                     MOVEAWWDLDT    DAT,I
      *
     C                     ENDSR
      *****************************************************************
      *     @SYOS:CALCULATION WITH REMAINDER
      *****************************************************************
     C           @SYOS     BEGSR
      *
      * SAVE UNIT QTY.
      * CALUCULATE THE NUMBER OF CONTAINER
     C           *IN93     IFEQ '1'
     C                     MOVE *ZERO     WSYOS
     C                     MOVE *ZERO     QTYPC1
     C                     MOVE *ZERO     QTYPC
      *
     C                     ELSE
     C           AFDLDT    IFLT CDATE
     C                     MOVE A2KSYS    WSYOS   50
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS
     C                     END
      *
     C                     MOVE A2KSYS    QTYPC1
     C                     MOVE A2SSYS    QTYPC
     C                     MOVE A2STR     WSTR
     C                     MOVE A2KTR     WKTR
     C                     END
      *
     C           WSYOS     IFNE *ZERO
     C           WNNET     DIV  WSYOS     QPCN    60
     C                     MVR            P1      30
      *
     C                     ELSE
     C                     Z-ADD*ZERO     QPCN
     C                     SETON                     30
     C                     END
      *
     C                     ENDSR
      *****************************************************************
      *     @SUBR1:CALCULATION WITH REMAINDER
      *****************************************************************
     C           @SUBR1    BEGSR
      *
     C           P1        IFGT 0
     C           QPCN      ANDGE0
     C                     ADD  1         QPCN
     C                     END
     C           P1        IFLT 0
     C           QPCN      ANDLE0
     C                     SUB  1         QPCN
     C                     END
      *
     C                     Z-ADDQPCN      SQPC,I  60       SAVE BOX CNT
      *
     C           I         IFEQ 1
     C                     Z-ADDQPCN      QPC,I
     C                     ENDIF
      *
     C           I         IFGT 1
     C           I         SUB  1         X
     C           SQPC,I    SUB  SQPC,X    QPC,I
     C           QPC,I     IFLT 0
     C                     Z-ADD0         QPC,I
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      **************************************************************************
