     H            Y.
     F** AB#R2C3C ***********************************************************
     F*  PALLET# ADD TO LABEL DATA FOR OHASHI                               *
     F*                                                                     *
     F* COPIED FROM AB#R2C3B  04/21/2020                                    *
     F****************************************** AB#R2C3C  ******************
     FAB#WP2I UF  E                    DISK
     FAB#PL90 IF  E           K        DISK
     E*****************************************************************
     I            DS
     I                                        1   5 W@PLNX
     I                                        1   1 W@PLN1
     I                                        2   2 W@PLN2
     I                                        3   3 W@PLN3
     I                                        4   4 W@PLN4
     I                                        5   5 W@PLN5
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************************
     C                     EXSR @INZ
     C                     EXSR @MAIN
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
      ***********************************************************
      * @INZ:INITIALIZE WORK AREA
      ***********************************************************
     C           @INZ      BEGSR
      *
     C                     Z-ADD*ZERO     W@MXPL  50
     C                     Z-ADD*ZERO     W@CCNT  50
     C                     Z-ADD1         W@PLNO  50
      *
     C                     MOVEL*OFF      W@1ST   1
      *
     C                     ENDSR
      ***********************************************************
      * @MAIN
      ***********************************************************
     C           @MAIN     BEGSR
      *
      * read through to the bottom of the file first to start
      * numbering from the bottom up. this is so when file has
      * been printed, pallet 1 will be on top.
      *
     C                     DO   *HIVAL
      *
     C                     READ AB#WP2I                  99
     C   99                LEAVE
      *
     C                     ADD  1         RRN     60
      *
      * GET THE NUMBER OF LABEL
     C           W@1ST     IFEQ *OFF
     C           I2DELY    CHAINAB#PL90              98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDYAMXPL    W@MXPL
     C                     Z-ADDYA#LAB    W#LAB   50
     C           W#LAB     IFNE *ZERO
     C           W#LAB     MULT W@MXPL    W@MXPL
     C                     ENDIF
     C                     ENDIF
     C                     MOVEL*ON       W@1ST
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      *
     C                     MOVE *OFF      *IN99
     C           RRN       SETGTAB#WP2I
      *
     C                     DO   *HIVAL
      *
     C                     READPAB#WP2I                  99
     C   99                LEAVE
      *
     C                     ADD  1         W@CCNT
     C           W@CCNT    IFGT W@MXPL
     C                     Z-ADD1         W@CCNT
     C                     ADD  1         W@PLNO
     C                     ENDIF
     C                     MOVELW@PLNO    W@PLNX
      *
     C                     DO
      *
     C           W@PLN1    IFEQ *ZERO
     C                     MOVEL*BLANK    W@PLN1
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C           W@PLN2    IFEQ *ZERO
     C                     MOVEL*BLANK    W@PLN2
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C           W@PLN3    IFEQ *ZERO
     C                     MOVEL*BLANK    W@PLN3
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C           W@PLN4    IFEQ *ZERO
     C                     MOVEL*BLANK    W@PLN4
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE W@PLNX    I2DUMY
      *
     C                     UPDATAB#WP2I1
      *
     C                     ENDDO
      *
     C                     ENDSR
