     H            Y.
     F** AB#RH9 **************************************
     F*  HONDA FTP INFORMATION MASTER                *
     F*   T.SAKAKI         2015.09.16                *
     F************************************************
     FAB#PWH9 CF  E                    WORKSTN
     FAB#PPH9 UF  E                    DISK                      A
     E                    ER      1  19 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *----------------------------------------------------*
      *
      *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
      *
     C                     MOVEL*BLANK    @USER
     C                     MOVEL*BLANK    @PASS
     C                     MOVEL*BLANK    @PORT
      *
     C           1         SETLLAB#PPH91
     C                     READ AB#PPH91                 21
      *
     C           *IN21     IFEQ *OFF
     C                     MOVELAHUSER    @USER
     C                     MOVELAHPASS    @PASS
     C                     Z-ADDAHPORT    @PORT
     C                     ENDIF
      *
     CSR         #S100E    ENDSR
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         #S200E    ENDSR
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         #S300E    ENDSR
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAB#PWH91
     C                     SETOF                     313233
     C                     SETOF                     99
     C                     MOVEL*BLANK    @ERR
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO #S210E
     C                     ENDIF
      *
     C           @USER     IFEQ *BLANK
     C                     MOVELER,1      @ERR
     C                     SETON                     3199
     C                     GOTO #S210E
     C                     ENDIF
     C*
     C           @PASS     IFEQ *BLANK
     C                     MOVELER,1      @ERR
     C                     SETON                     3299
     C                     GOTO #S210E
     C                     ENDIF
     C*
     C           @PORT     IFEQ 0
     C                     MOVELER,1      @ERR
     C                     SETON                     3399
     C                     GOTO #S210E
     C                     ENDIF
     C* F5 UPDATE
     C           *IN05     IFEQ '1'
     C                     EXSR #UPD
     C                     MOVE '99'      DSPSW
     C                     ENDIF
      *
     CSR         #S210E    ENDSR
      *----------------------------------------------------*
      *CHANGE                                              *
      *----------------------------------------------------*
     CSR         #UPD      BEGSR
      *
     C           1         SETLLAB#PPH91
     C                     READ AB#PPH91                 21
      *
     C                     Z-ADDWTIHZ     AHKODT
     C                     MOVELWJFB      AHKOTM
     C                     MOVELW#USER    AHKOME
     C                     MOVELW#PGM     AHPGMN
     C                     MOVEL@USER     AHUSER
     C                     MOVEL@PASS     AHPASS
     C                     Z-ADD@PORT     AHPORT
      *
     C           *IN21     IFEQ *OFF
     C                     UPDATAB#PPH91
     C                     ELSE
     C                     WRITEAB#PPH91
     C                     ENDIF
      *
     CSR         EUPD      ENDSR
      *
**
ER-01 PLEASE INPUT ALL
ER-02
ER-03
ER-04
ER-05
ER-06
ER-07
ER-08
ER-09
