     H            Y.
     F** AB#R37 **************************************************
     F*  ..RECORDING OF EDI FRS SALES & EDI(810) INVOICE DATA    *
     F*  ..ISSURANCE OF CANADA CUSTOM SHEET                      *
     F*    I-HASADA                             97.06.26         *
     F*                                                          *
     F*  UPDATE ONLY SALES RELATED FILES        01.08.14         *
     F*  ADD RELEASE DATE FOR FORD              01.11.05         *
     F*  CHECK DELETED DATA OR NOT              02.02.18         *
TCH40F*  ADD FACIL ACCUM FILE                   05.03.01         *
     F*  TCHK1 01/08/08 CHG UPDATE SEQ
     F*                ADD DUPLICATE FILE
JW1   *  J.WATANABE  07.21.2017 ADD ORDER FILE (AB#PLA3=AB#PPA1)
     F************************************************** AB#R37 **
     FAB#WP33 UP  E                    DISK
     FAB#PL13 UF  E           K        DISK
JW1  FAB#PLA3 UF  E           K        DISK
     FAB#PP01 O   E                    DISK                      A
TCHK1FAB#WP01 O   E                    DISK                      A
     FAB#PLNO UF  E           K        DISK                      A
TCH40FAB#FPCL UF  E           K        DISK                      A
     IAB#WP331
     I                                              W1UHN3          50
     I                                              W1UHN4          51
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTIM
     I                                        1   20WJI
     I                                        3   40WFN
     I                                        5   60WBY
JW1  I                                        7  140WDAT
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
     I            DS
     I                                        1   80HIZK
     I                                        1   20HIZM
     I                                        3   40HIZD
     I                                        5   80HIZY
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
     I            DS
     I                                        1   80BARLDT
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
     I            DS
     I                                        1   80WREHZ
     I                                        1   40WREYY
     I                                        5   60WREMM
     I                                        7   80WREDD
     I            DS
     I                                        1   80NOHZ
     I                                        1   40NOYY
     I                                        5   60NOMM
     I                                        7   80NODD
     I            DS
     I                                        1   80BDSKHZ
     I                                        1   40BDSKYY
     I                                        5   60BDSKMM
     I                                        7   80BDSKDD
     I            DS
     I                                        1   80BDKOHZ
     I                                        1   40BDKOYY
     I                                        5   60BDKOMM
     I                                        7   80BDKODD
     I            DS
     I                                        1   60BDKOTI
     I                                        1   20BDKOHH
     I                                        3   40BDKOSS
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ******************************************************
     C           KEY1      KLIST
     C                     KFLD           W1NONY
     C                     KFLD           W1NOYY
     C                     KFLD           W1NOMM
     C                     KFLD           W1NODD
     C                     KFLD           W1NUKE
     C                     KFLD           W1THN1
     C                     KFLD           W1THN2
     C                     KFLD           W1THN3
     C                     KFLD           W1THN4
     C                     KFLD           W1ODNO
     C                     KFLD           W1NOBI
      *
TCH40C           KEY8      KLIST
   | C                     KFLD           XXTOKU
   | C                     KFLD           XXNONY
   | C                     KFLD           B1MHN1
     C                     KFLD           B1MHN2
   | C                     KFLD           B1MHN3
TCH40C                     KFLD           B1MHN4
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PNOHZ   8
     C                     PARM           PNOBN   20
     C                     PARM           PRLDT   8
      *
     C                     TIME           WTIME
     C           PRLDT     IFNE *BLANK
     C                     MOVE PRLDT     WREHZ
     C                     ENDIF
      *
TCHK1 ******************************************************
TCHK1 *  SALES ACCUMULATION PRN & SHR CONTROL FILE CHAIN   *
TCHK1 ******************************************************
TCHK1C                     SETOF                     18
TCHK1C           W1URIM    CHAINAB#PLNO1             18
TCHK1C           *IN18     IFEQ '0'
TCHK1C                     ADD  1         I5RENO
TCHK1C                     UPDATAB#PLNO1
TCHK1C                     ELSE
TCHK1C                     Z-ADDW1URIM    I5TUKI
TCHK1C                     Z-ADD1         I5RENO
TCHK1C                     WRITEAB#PLNO1
TCHK1C                     END
      * UPDATE AB#PP10 --------------------------------
TCHK1C                     SETOF                     20
TCHK1C           PRLDT     IFEQ *BLANK
TCHK1C           KEY1      SETLLAB#PL131
TCHK1C           *IN20     DOUEQ*ON
TCHK1C           KEY1      READEAB#PL131                 20
TCHK1C           *IN20     IFEQ '0'
TCHK1C           BASKJY    ANDEQ*BLANK
TCHK1C           BAURHZ    IFNE *ZERO
TCHK1C                     ITER
TCHK1C                     END
TCHK1C                     Z-ADDW1TANK    BATANK
TCHK1C                     Z-ADD*DATE     BAURHZ
TCHK1C                     Z-ADDI5RENO    BARCOD
TCHK1C                     Z-ADD*YEAR     BAKOYY
TCHK1C                     Z-ADD*MONTH    BAKOMM
TCHK1C                     Z-ADD*DATE     BAKODD
TCHK1C                     Z-ADDWJI       BAKOHH
TCHK1C                     Z-ADDWFN       BAKOSS
TCHK1C                     MOVELPUS       BAKOME
TCHK1C                     UPDATAB#PL131
TCHK1C                     LEAVE
TCHK1C                     ENDIF
TCHK1C                     ENDDO
TCHK1C                     ELSE
TCHK1C           KEY1      SETLLAB#PL131
TCHK1C           *IN20     DOUEQ*ON
TCHK1C           KEY1      READEAB#PL131                 20
TCHK1C           *IN20     IFEQ *OFF
TCHK1C           BASKJY    ANDEQ*BLANK
TCHK1C           BARLDT    IFNE WREHZ
TCHK1C                     ITER
TCHK1C                     ENDIF
TCHK1C           BAURHZ    IFNE *ZERO
TCHK1C                     ITER
TCHK1C                     END
TCHK1C                     Z-ADDW1TANK    BATANK
TCHK1C                     Z-ADD*DATE     BAURHZ
TCHK1C                     Z-ADDI5RENO    BARCOD
TCHK1C                     Z-ADD*YEAR     BAKOYY
TCHK1C                     Z-ADD*MONTH    BAKOMM
TCHK1C                     Z-ADD*DATE     BAKODD
TCHK1C                     Z-ADDWJI       BAKOHH
TCHK1C                     Z-ADDWFN       BAKOSS
TCHK1C                     MOVE PUS       BAKOME
TCHK1C                     UPDATAB#PL131
TCHK1C                     LEAVE
TCHK1C                     ENDIF
TCHK1C                     ENDDO
TCHK1C                     ENDIF
      * UPDATE AB#PPA1 --------------------------------
JW1  C                     SETOF                     21
 |   C           PRLDT     IFEQ *BLANK
 |   C           KEY1      SETLLAB#PLA31
 |   C           *IN21     DOUEQ*ON
 |   C           KEY1      READEAB#PLA31                 21
 |   C           *IN21     IFEQ '0'
 |   C           BASKJY    ANDEQ*BLANK
 |   C           BAURHZ    IFNE 0
 |   C                     ITER
 |   C                     ENDIF
 |   C                     Z-ADDW1TANK    BATANK
 |   C                     Z-ADDWDAT      BAURHZ
 |   C                     Z-ADDWTIM      BAURTM
 |   C                     MOVEL#USER     BAURME
 |   C                     MOVEL#PGM      BAURPG
 |   C                     Z-ADDI5RENO    BARCOD
 |   C                     Z-ADDWYY       BAKOYY
 |   C                     Z-ADDWMM       BAKOMM
 |   C                     Z-ADDWDD       BAKODD
 |   C                     Z-ADDWJI       BAKOHH
 |   C                     Z-ADDWFN       BAKOSS
 |   C                     MOVELPUS       BAKOME
 |   C                     MOVEL#PGM      BANOPG
 |   C                     UPDATAB#PLA31
 |   C                     LEAVE
 |   C                     ENDIF
 |   C                     ENDDO
 |    *
 |   C                     ELSE
 |   C           KEY1      SETLLAB#PLA31
 |   C           *IN21     DOUEQ*ON
 |   C           KEY1      READEAB#PLA31                 21
 |   C           *IN21     IFEQ *OFF
 |   C           BASKJY    ANDEQ*BLANK
 |   C           BARLDT    IFNE WREHZ
 |   C                     ITER
 |   C                     ENDIF
 |   C           BAURHZ    IFNE 0
 |   C                     ITER
 |   C                     ENDIF
 |   C                     Z-ADDW1TANK    BATANK
 |   C                     Z-ADDWDAT      BAURHZ
 |   C                     Z-ADDWTIM      BAURTM
 |   C                     MOVEL#USER     BAURME
 |   C                     MOVEL#PGM      BAURPG
 |   C                     Z-ADDI5RENO    BARCOD
 |   C                     Z-ADDWYY       BAKOYY
 |   C                     Z-ADDWMM       BAKOMM
 |   C                     Z-ADDWDD       BAKODD
 |   C                     Z-ADDWJI       BAKOHH
 |   C                     Z-ADDWFN       BAKOSS
 |   C                     MOVELPUS       BAKOME
 |   C                     MOVEL#PGM      BANOPG
 |   C                     UPDATAB#PLA31
 |   C                     LEAVE
 |   C                     ENDIF
 |   C                     ENDDO
JW1  C                     ENDIF
      *
     C                     CLEARAB#PP011
     C                     CLEARAB#WP011
      *
     C                     MOVE *BLANK    B1SKJY
     C                     Z-ADD0         B1SKYY
     C                     Z-ADD0         B1SKMM
     C                     Z-ADD0         B1SKDD
     C                     Z-ADD*YEAR     B1KSYY
     C                     Z-ADD*MONTH    B1KSMM
     C                     Z-ADD*DAY      B1KSDD
     C                     Z-ADDWJI       B1KSJI
     C                     Z-ADDWFN       B1KSPN
     C                     MOVE PUS       B1KSNA
      *
     C                     MOVE W1USRI    B1RENO
     C                     MOVE W1ODKE    B1JTYU
     C                     MOVE W1TEIS    B1REYU
     C                     Z-ADDW1TOKU    B1TOKU
     C                     MOVE W1TKOJ    B1TKOJ
     C                     MOVE W1TUKE    B1TUKE
     C                     Z-ADDW1NONY    B1NONY
     C                     MOVE W1NKOJ    B1NKOJ
     C                     MOVE W1NUKE    B1NUKE
     C                     MOVE W1UHN1    B1MHN1
     C                     MOVE W1UHN2    B1MHN2
     C                     MOVE W1UHN3    B1MHN3
     C                     MOVE W1UHN4    B1MHN4
     C                     MOVE W1SHN1    B1SHN1
     C                     MOVE W1SHN2    B1SHN2
     C                     MOVE W1SHN3    B1SHN3
     C                     MOVE W1ODNO    B1ODR1
     C                     Z-ADDW1ODED    B1ODR2
     C                     MOVE W1KANR    B1KBAN
     C                     Z-ADDW1TANK    B1TANK
     C                     MOVE W1TAKB    B1TKBN
     C                     MOVE W1TATN    B1TTAI
     C                     MOVELW1NOBN    B1NBAN
     C                     MOVE W1NOKB    B1NSYO
     C                     Z-ADDW1NOYY    B1NOYY
     C                     Z-ADDW1NOMM    B1NOMM
     C                     Z-ADDW1NODD    B1NODD
     C                     Z-ADDW1NOBI    B1NOBI
     C                     Z-ADDW1NOSU    B1SRYO
     C                     MOVE W1SUTN    B1TANI
     C                     Z-ADDW1KING    B1KING
     C                     Z-ADDW1JYRY    B1JRYY
     C                     Z-ADDW1JYRM    B1JRMM
     C                     Z-ADDW1JYRD    B1JRDD
     C                     MOVE W1JKKB    B1JRYO
     C                     MOVE W1JUNJ    B1SQES
     C                     Z-ADDW1SEIY    B1SEYY
     C                     Z-ADDW1SEIM    B1SEMM
     C                     Z-ADDW1SEID    B1SEDD
     C                     MOVE W1KENS    B1KSYU
     C                     MOVE W1MACH    B1MACH
     C                     Z-ADDW1MACY    B1KAYY
     C                     Z-ADDW1MACM    B1KAMM
     C                     Z-ADDW1MACD    B1KADD
     C                     Z-ADDW1GETU    B1GEMM
     C                     MOVE W1KURK    B1KRKS
     C                     MOVE W1SEBN    B1SBAN
     C                     MOVE W1UHIN    B1UHIN
     C                     Z-ADDW1HAKO    B1HAKO
     C                     Z-ADDW1SYUY    B1SYUY
     C                     Z-ADDW1LTNO    B1LOTO
     C                     Z-ADDW1PANO    B1PAGE
     C                     Z-ADD0         B1GIYO
     C                     MOVE W1STKB    B1THAI
     C                     Z-ADDW1URIY    B1URYY
     C                     Z-ADDW1URIM    B1URMM
     C                     Z-ADDW1URID    B1URDD
     C                     MOVE W1SYBT    B1SYBT
     C                     MOVE W1SOBT    B1SOBT
     C                     MOVE W1GYOM    B1GYOM
     C                     MOVE W1CARD    B1CARD
      *
TCHK1**-----------------------------------------------------
TCHK1**  SALES ACCUMULATION PRN & SHR CONTROL FILE CHAIN   -
TCHK1**-----------------------------------------------------
     C                     Z-ADDI5RENO    W1RECN
     C                     UPDATAB#WP331
      *
     C                     Z-ADDI5RENO    B1RCOD
TCHK1C           *IN20     IFEQ *OFF
     C                     WRITEAB#PP011
TCHK1C                     ELSE
TCHK1C                     WRITEAB#WP011
TCHK1C                     END
TCH40C*
B0   C           B1TOKU    IFEQ 0601
     C                     MOVE B1TOKU    XXTOKU  4
     C                     MOVE B1NONY    XXNONY  4
     C           KEY8      CHAINAB#FPCL1             65
B1   C           *IN65     IFEQ '0'
     C                     ADD  B1SRYO    AFIFYY
     C                     UPDATAB#FPCL1
     C                     ELSE
     C                     MOVE B1MHN1    AFMHN1
     C                     MOVE B1MHN2    AFMHN2
     C                     MOVE B1MHN3    AFMHN3
     C                     MOVE B1MHN4    AFMHN4
     C                     Z-ADDB1SRYO    AFIFYY
     C                     WRITEAB#FPCL1
E1   C                     ENDIF
E0   C                     ENDIF
TCH40C*
