     H            Y.
     F** AB#R8U *************************************************************
     F*  CONTAINER SHIPMENT WITH INVENTORY CONTROL                          *
     F*                                                                     *
     F* TCHK1 05/27/11 CREATE(COPY FROM AB#RAZ)
     F* TCHK2 12/13/13 ADD SELECT 5
     F* TCHK3 03/04/14 ADD SELECT 6
     F***********************************************************************
     FAB#PW8U CF  E                    WORKSTN
     E*****************************************************************
     E                    ERR     1   5 78
     I*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(8)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMHH
     I                                        3   40WTIMMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           WWTIME
     C                     MOVE '01'      W@ID    2
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     SELEC
     C*
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C*
     C           *IN41     IFEQ *OFF
     C                     SELEC
     C           D@SLCT    WHEQ 01
     C                     CALL 'AB#C6V '
     C           D@SLCT    WHEQ 02
     C                     CALL 'AB#C6W '
     C           D@SLCT    WHEQ 03
     C                     CALL 'AB#C6R '
     C           D@SLCT    WHEQ 04
     C                     CALL 'AB#C6Y2'
     C**         D@SLCT    WHEQ 99
     C**                   CALL 'AB#R8Z'
     C                     ENDSL
     C                     Z-ADD*ZERO     D@SLCT
     C                     END
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*------------------------------------------------------
     C* 1ST SCREEN CHECK
     C*------------------------------------------------------
     C           #CHK1     BEGSR
     C*
     C                     DO
     C*
     C           D@SLCT    IFEQ *ZERO
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,1     D@MSG
     C                     LEAVE
     C                     END
     C*
     C**         D@SLCT    IFNE 99
     C           D@SLCT    IFLT 01
     C           D@SLCT    ORGT 04
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,2     D@MSG
     C                     LEAVE
     C                     END
     C**                   END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
** ERR
ENTER SELECCTION !
SELECTION SHOULD BE 1, 2, 3 OR 4 !



