     H            Y.
     F** AB#RAZ *************************************************************
     F*  DAILY ORDER CONTAINER INQUIRY                                      *
     F*                                                                     *
     F* TCHK1 01/14/09 CREATE
     F* TCHK2 04/24/10 ADD IAF PART# INQUIRY
     F* TCHK3 02/10/11 ADD ALL SHIP-TO INQUIRY
     F* TCHK4 07/02/13 ADD EACH PROCESS INQUIRY
     F****************************************** ABAR34 *********************
     FAB#PWAZ CF  E                    WORKSTN
     E*****************************************************************
     E                    ERR     1   5 78
     I*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(8)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMHH
     I                                        3   40WTIMMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           WWTIME
     C                     MOVE '01'      W@ID    2
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     SELEC
     C*
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C*
     C           *IN41     IFEQ *OFF
     C                     SELEC
     C           D@SLCT    WHEQ 01
     C                     CALL 'AB#CAV'
     C           D@SLCT    WHEQ 02
     C                     CALL 'AB#CAW'
     C           D@SLCT    WHEQ 03
     C                     CALL 'AB#CAX'
     C           D@SLCT    WHEQ 04
     C                     CALL 'AB#CAY'
     C           D@SLCT    WHEQ 05
     C                     CALL 'AB#CAY1'
TCHK4C           D@SLCT    WHEQ 06
TCHK4C                     CALL 'AB#C9I'
JW   C           D@SLCT    WHEQ 07
     C                     CALL 'AB#CC1'
JW   C           D@SLCT    WHEQ 08
     C                     CALL 'AB#CC1B'
TCHK3C           D@SLCT    WHEQ 99
TCHK3C                     CALL 'AB#CAY2'
     C                     ENDSL
     C                     Z-ADD*ZERO     D@SLCT
     C                     END
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*------------------------------------------------------
     C* 1ST SCREEN CHECK
     C*------------------------------------------------------
     C           #CHK1     BEGSR
     C*
     C                     DO
     C*
     C           D@SLCT    IFEQ *ZERO
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,1     D@MSG
     C                     LEAVE
     C                     END
     C*
TCHK3C           D@SLCT    IFNE 99
     C           D@SLCT    IFLT 01
TCHK4C***        D@SLCT    ORGT 06
JW   C           D@SLCT    ORGT 08
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,2     D@MSG
     C                     LEAVE
     C                     END
TCHK3C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
** ERR
SELECTION IS REQUIRED.
SELECTION IS INVALID.



