     H            Y.
      ** AB#R1A *******************************************
      * MONTHLY SHIP QTY                                  *
      *                                                   *
      *  AB#PP10 -> AB#PP01         FEB/02/2003           *
      *
      * TCHK1 04/02/08 CHG CALC # OF CONT
      * TCHK2 01/04/12 CHG DIVIDE ZERO
      ******************************************* AB#R1A **
     FAB#PW1A CF  E                    WORKSTN
     F**AB#PL11 IF  E           K        DISK
     FAB#PL07 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#WP1A O   E           K        DISK
     FAB#WP1B O   E           K        DISK
      *----------------------------------------------------------
     E                    QT         31  7 0
     E                    TT         31  7 0
     E                    STL     1   1 15
      *----------------------------------------------------------
     I            DS
     I                                        1 217 QT
     I                                        1   70WQTY01
     I                                        8  140WQTY02
     I                                       15  210WQTY03
     I                                       22  280WQTY04
     I                                       29  350WQTY05
     I                                       36  420WQTY06
     I                                       43  490WQTY07
     I                                       50  560WQTY08
     I                                       57  630WQTY09
     I                                       64  700WQTY10
     I                                       71  770WQTY11
     I                                       78  840WQTY12
     I                                       85  910WQTY13
     I                                       92  980WQTY14
     I                                       99 1050WQTY15
     I                                      106 1120WQTY16
     I                                      113 1190WQTY17
     I                                      120 1260WQTY18
     I                                      127 1330WQTY19
     I                                      134 1400WQTY20
     I                                      141 1470WQTY21
     I                                      148 1540WQTY22
     I                                      155 1610WQTY23
     I                                      162 1680WQTY24
     I                                      169 1750WQTY25
     I                                      176 1820WQTY26
     I                                      183 1890WQTY27
     I                                      190 1960WQTY28
     I                                      197 2030WQTY29
     I                                      204 2100WQTY30
     I                                      211 2170WQTY31
      *-----------------------------------------------------
      *    MAIN
      *-----------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           K#KEY     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C           K#KEYX    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#GAD     KLIST
     C                     KFLD           B1TOKU
     C                     KFLD           B1NONY
      *
     C           K#FC      KLIST
     C                     KFLD           B1SHN1
     C                     KFLD           B1SHN2
     C                     KFLD           B1SHN3
      *
     C           K#AGX     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
      *
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*DAY      K@DD
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C           F8YOBI    ANDLT6
     C                     Z-ADDF8KAYY    D@YY
     C                     Z-ADDF8KAMM    D@MM
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------------
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #READ
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00'      *IN,61
     C                     Z-ADDD@YY      K@YY
     C                     Z-ADDD@MM      K@MM
     C           K#AGX     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     MOVEA'11'      *IN,61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #READ     BEGSR
      *-----------------------------------------------------
     C                     Z-ADD*ZERO     TT
     C           *LOVAL    SETLLAB#PL07
     C           *IN80     DOUEQ*ON
     C                     READ AB#PL07                  80
     C           *IN80     IFEQ *OFF
     C           B1SKJY    ANDEQ*BLANK
     C           K#GAD     CHAINGADPL11              90
     C                     Z-ADDB1NONY    K@NONY
     C                     MOVE B1NKOJ    K@NKOJ
     C                     EXSR #WRT
     C           K#KEYX    SETGTAB#PL07
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *BLANK    WNONY
     C                     MOVEL'TOTAL'   WNAME     P
     C                     Z-ADDTT        QT
     C                     WRITEAB#WP1A1
     C                     WRITEAB#WP1B1
      *
     C                     CLEARAB#WP1A1
     C                     WRITEAB#WP1A1
     C                     Z-ADD*ZERO     WPQTY   70
     C           1         DO   31        X       20
     C           TT,X      ADD  WPQTY     QT,X
     C                     Z-ADDQT,X      WPQTY
     C                     ENDDO
     C                     MOVELSTL,1     WNAME
     C                     WRITEAB#WP1A1
     C                     WRITEAB#WP1B1
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #WRT      BEGSR
      *-----------------------------------------------------
     C                     Z-ADD*ZERO     QT
     C                     MOVE *OFF      *IN91
     C           K#KEY     SETLLAB#PL07
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAB#PL07                  90
     C           *IN90     IFEQ *OFF
     C           B1SKJY    ANDEQ*BLANK
     C           B1NOHZ    IFGE *DATE
     C                     LEAVE
     C                     ENDIF
      *
     C           K#FC      CHAINFCEPL01              95
     C           *IN95     IFEQ *ON
TCHK1C*          B1SRYO    ORLT A2SSYS
     C           A2SSYS    OREQ 0
TCHK1C*                    ITER
TCHK1C                     Z-ADDB1SRYO    A2SSYS
     C                     ENDIF
     C*          BAUSYS    IFNE *ZERO
     C*          BASYOS    ANDNE*ZERO
     C*          BAUSYS    ANDNEBASYOS
     C*                    ITER
     C*****                ENDIF
      *
     C*          BASYOS    IFEQ *ZERO
     C*                    ITER
     C*                    ENDIF
      *
     C                     Z-ADDB1NODD    @D      20
     C                     Z-ADD*ZERO     @@QTY   70
     C*          BAUSYS    IFNE *ZERO
     C*          BASRYO    DIV  BAUSYS    @@QTY   70
     C*                    ELSE
     C*          BASYOS    IFNE *ZERO
     C*          BASRYO    DIV  BASYOS    @@QTY   70
     C*                    ENDIF
     C*********            ENDIF
     C*****      BASRYO    DIV  BASYOS    @@QTY   70
TCHK2C           A2SSYS    IFEQ *ZERO
TCHK2C                     Z-ADD1         @@QTY
TCHK2C                     ELSE
     C           B1SRYO    DIV  A2SSYS    @@QTY   70
TCHK1C                     MVR            W@MVR   70
TCHK1C           W@MVR     IFNE *ZERO
TCHK1C                     ADD  1         @@QTY
TCHK1C                     END
TCHK2C                     END
     C                     ADD  @@QTY     QT,@D
     C                     MOVE *ON       *IN91
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN91     IFEQ *ON
     C                     MOVE K@NONY    WNONY
     C                     MOVELB5KMEI    WNAME
     C                     ADD  QT        TT
     C                     WRITEAB#WP1A1
     C                     ENDIF
      *
     C                     ENDSR
** STL
CUM TOTAL
