     H            Y.
     F** AB#R3O *************************************
     F*   SHIPPER REPROT (HONDA)                    *
     F*      10/21/03                               *
     F*                                             *
     F*
     F************************************* AB#R3A **
     FAB#PP31 IP  E           K        DISK
     FAB#PL2A IF  E           K        DISK
     FAB#PR3O O   E             77     PRINTER
      *--------------------------------------------------
     E                    TL1     1   2 35
     E                    TL2     1   2 79
      *--------------------------------------------------
     IAB#PP311    01
     I                                              INOHZ L1
     I                                              ISIRE L1
     I                                              ISIRK L1
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1   80@SHDT
     I                                        1   20@MM
     I                                        3   40@DD
     I                                        5   80@YY
     I            DS
     I                                        1   80INOHZ
     I                                        1   40INOYY
     I                                        5   60INOMM
     I                                        7   80INODD
     I           SDS
     I                                        1   8 @PGMID
     I                                        1   6 PGMID
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      *
     C           K#P2A     KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           K@ODRN 20
     C           K#P2AX    KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
      *
     C                     Z-ADDINOMM     @MM
     C                     Z-ADDINODD     @DD
     C                     Z-ADDINOYY     @YY
     C                     Z-ADDISRYO     @QTY
     C                     Z-ADDISYOS     @SYOS
     C           @SYOS     IFNE *ZERO
     C           @QTY      DIV  @SYOS     @BOX
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVELTL1,1     @TTL1
     C                     MOVELTL1,2     @TTL2
     C                     MOVELTL2,1     @STL1
     C                     MOVELTL2,2     @STL2
     C                     MOVE *ALL'-'   @LIN3
     C                     MOVELIINV#     @SHNO
     C                     MOVELIINV#     @BARC
     C                     MOVELIINV#     @@NBR
     C                     ENDIF
      *
     C                     MOVELIODRN     K@ODRN
     C                     MOVELIODRN     @@ODRN
     C           K#P2A     CHAINAB#PL2A              90
     C           *IN90     IFEQ *ON
     C           K#P2A     SETGTAB#PL2A
     C           K#P2AX    REDPEAB#PL2A                  90
     C                     ENDIF
      *
     C           *IN90     IFEQ *OFF
     C           *IN99     IFEQ *OFF
     C                     MOVE ACEDID    @EDIID
     C                     MOVELACSHNM    @SHNM
     C                     MOVELACPLNM    @BLNM
     C                     MOVELACPLNT    @PLNT
     C                     MOVELACSHCD    @ID1
     C                     MOVELACSAD1    @ADR1
     C                     MOVELACSAD2    @ADR2
     C           ACCITY    CAT  ',':0     @ADR3     P
     C           @ADR3     CAT  ACSTAT:0  @ADR3     P
     C           @ADR3     CAT  ACZIPC:1  @ADR3     P
     C                     ENDIF
      *
     C           ACSHTM    IFNE *ZERO
     C                     Z-ADDACSHTM    @SHTM
     C                     ELSE
     C                     Z-ADDACDLTM    @SHTM
     C                     ENDIF
      *
     C                     MOVELACMHIN    @MHIN
     C                     MOVELACSLTN    @LOT
     C                     MOVELACLOTN    @PLOT
     C                     MOVELACREVN    @REVN
      *
     C                     ELSE
     C                     MOVELIMHN      @MHIN
     C                     ENDIF
      *
     C  N99
     COR 77                WRITE@HED
      *
     C  N99                MOVE *ON       *IN99
     C   77                MOVE *OFF      *IN77
     C                     WRITE@DTL
      *---------------------------------------------------
** TL1
INDIANA AUTOMOTIVE FASTENERS,INC.
     SHIPPER REPORT - HONDA
** TL2
SEQ#     PRODUCT LOT             CUSTOMER PART#/     QTY PER BOX/
SMALL LOT               E/C      SCHEDULE#             #OF BOXES       RET QTY
