     H            Y/                                    1
     H** AB#R1F *******************************************************
     H* HONDA ORDER/SHIPPING INQUIRY                                  *
     H*                                                               *
     H* J.WATANABE  3/25/2016 CRAETED                                 *
JW1  H* J.WATANABE  1/10/2017 ADD DCL CHANGE FUNCTION                 *
     H*****************************************************************
     FAB#PW1F CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFL01
     FAB#PL2A2IF  E           K        DISK
JW1  FAB#PL15 IF  E           K        DISK
JW1  FAB#PL2A3UF  E           K        DISK
     F            AB#PP2A1                          KRENAMEAB#P2A3R
      *================================================================
     E**JW1               MSG     1   1 78
JW1  E                    MSG     1   2 78
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
     I            DS
     I                                        1   6 @NUM6
     I                                        1   1 @N1
     I                                        2   2 @N2
     I                                        3   3 @N3
     I                                        4   4 @N4
     I                                        5   5 @N5
     I                                        6   6 @N6
     I            DS
     I                                        1   80@DATE1
     I                                        1   4 @YY1
     I                                        5   6 @MM1
     I                                        7   8 @DD1
     I            DS
     I                                        1   80ACPLSH
     I                                        1   40WWNOYY
     I                                        5   60WWNOMM
     I                                        7   80WWNODD
     I            DS
     I                                        1  10 @DATE2
     I                                        1   4 @YY2
     I I            '/'                       5   5 @H12
     I                                        6   7 @MM2
     I I            '/'                       8   8 @H22
     I                                        9  10 @DD2
      *
     I           SDS
     I                                     *PROGRAM W@PGM
     I                                      244 253 W@WSID
     I                                      254 263 W@USER
     I                                      264 269 W@JBNO
     C*===============================================================
     C*  START  PROGRAM
     C*===============================================================
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* INITIAL SET
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@MHN1  5
     C                     PARM           P@MHN2  5
     C                     PARM           P@MHN3  5
     C                     PARM           P@MHN4  5
     C                     PARM           P@RTN   1
     C                     TIME           @TIME
      *
     C           KEY01     KLIST
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
      *
     C           KEY2A     KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
     C                     KFLD           K@PLSH
     C                     KFLD           K@BIN
     C                     KFLD           K@ODRN
      *
     C           KEY10     KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
     C                     KFLD           K@OD10 10
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
     C                     KFLD           K@BIN
      *
     C           *LIKE     DEFN ACTOKU    K@TOKU
     C           *LIKE     DEFN ACNONY    K@NONY
     C           *LIKE     DEFN ACNKOJ    K@NKOJ
     C           *LIKE     DEFN ACNUKE    K@NUKE
     C           *LIKE     DEFN ACPLSH    K@PLSH
     C           *LIKE     DEFN ACBIN     K@BIN
     C           *LIKE     DEFN ACODRN    K@ODRN
      *
     C           *LIKE     DEFN ACTOKU    SVTOKU
     C           *LIKE     DEFN ACNONY    SVNONY
     C           *LIKE     DEFN ACPLNT    SVPLNT
     C           *LIKE     DEFN ACSHCD    SVSHCD
     C           *LIKE     DEFN ACREVN    SVREVN
      *
     C                     MOVEA*ALL'0'   *IN
     C                     Z-ADD0         SEQ#    40
      *
     C* CLEAR SUBFILE
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVELW@PGM     #PGM
     C                     MOVELP@MHN1    S@MHN1
     C                     MOVELP@MHN2    S@MHN2
     C                     MOVELP@MHN3    S@MHN3
     C                     MOVELP@MHN4    S@MHN4
      * READ ORDER(AB#PP2A)
     C                     MOVELP@MHN1    K@MHN1
     C                     MOVELP@MHN2    K@MHN2
     C                     MOVELP@MHN3    K@MHN3
     C                     MOVELP@MHN4    K@MHN4
     C           KEY01     SETLLAB#PL2A2
      *-----------------------------------
     C                     DO   *HIVAL
     C           KEY01     READEAB#PL2A2                 90
     C           *IN90     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C* IGNORE DELETED RECORD
     C           ACUPID    IFEQ 'D'                        DELETE CODE
     C                     ITER
     C                     ENDIF
     C* SELECT BIN=1 ONLY
     C**         ACBIN     IFNE 1
     C**                   ITER
     C**                   ENDIF
      * CHECK ORDER
     C                     MOVELACTOKU    K@TOKU
     C                     MOVELACNONY    K@NONY
     C                     MOVELACNKOJ    K@NKOJ
     C                     MOVELACNUKE    K@NUKE
     C                     MOVELACMHN1    K@MHN1
     C                     MOVELACMHN2    K@MHN2
     C                     MOVELACMHN3    K@MHN3
     C                     MOVELACMHN4    K@MHN4
     C                     MOVELACODRN    K@OD10
     C                     MOVELWWNOYY    K@NOYY
     C                     MOVELWWNOMM    K@NOMM
     C                     MOVELWWNODD    K@NODD
     C                     MOVELACBIN     K@BIN
     C           KEY10     CHAINAB#PL15              99
     C           *IN99     IFEQ *OFF
     C           ACUPID    IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           ACUPID    IFNE *BLANK
     C           BASKJY    ANDEQ'D'
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * BREAK LINE
     C           SEQ#      IFNE 0
     C                     EXSR #BREAK
     C                     ENDIF
     C* WRITE SUBFILE
     C                     ADD  1         SEQ#
JW1  C                     MOVE ACNKOJ    S@NKOJ
JW1  C                     MOVELACNUKE    S@NUKE
JW1  C                     Z-ADDACASDT    S@ASDT
     C                     MOVE *BLANK    S@SLCT
     C                     MOVELSEQ#      S@SEQ
     C                     MOVELACTOKU    S@TOKU
     C                     MOVELACNONY    S@NONY
     C                     MOVELACPLNT    S@PLNT
     C                     MOVELACSHCD    S@SHCD
     C                     MOVELACREVN    S@REVN
     C* YYYYMMDD TO Y/M/D  MOVELACPLSH    S@PLSH
JW1  C                     MOVELACPLSH    S@PLS2
     C                     MOVELACPLSH    @DATE1
     C                     MOVEL@YY1      @YY2
     C                     MOVEL@MM1      @MM2
     C                     MOVEL@DD1      @DD2
     C                     MOVEL@DATE2    S@PLSH
     C                     MOVELACBIN     S@BIN
     C                     MOVELACUPID    S@UPID
     C                     MOVELACODRN    S@ODRN
     C*                    MOVE ACQNTY    S@QNTY
     C                     MOVE ACQNTY    @NUM6
     C                     EXSR #ZERO
     C                     MOVEL@NUM6     S@QNTY
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     Z-ADDRRN1      SVRRN   40
      * SAVE LINE
     C                     MOVELACTOKU    SVTOKU
     C                     MOVELACNONY    SVNONY
     C                     MOVELACPLNT    SVPLNT
     C                     MOVELACSHCD    SVSHCD
     C                     MOVELACREVN    SVREVN
     C*
     C                     ENDDO
      *-----------------------------------
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      * DISPLAY BREAK LINE
      *===============================================================
     C           #BREAK    BEGSR
      *
     C           ACTOKU    IFNE SVTOKU
     C           ACNONY    ORNE SVNONY
     C**JW1      ACPLNT    ORNE SVPLNT
     C**         ACSHCD    ORNE SVSHCD
     C**         ACREVN    ORNE SVREVN
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      * ZERO SUPPLESS
      *===============================================================
     C           #ZERO     BEGSR
      *
     C           @N1       IFEQ '0'
     C                     MOVE ' '       @N1
     C                     ELSE
     C                     GOTO #ZERO9
     C                     ENDIF
      *
     C           @N2       IFEQ '0'
     C                     MOVE ' '       @N2
     C                     ELSE
     C                     GOTO #ZERO9
     C                     ENDIF
      *
     C           @N3       IFEQ '0'
     C                     MOVE ' '       @N3
     C                     ELSE
     C                     GOTO #ZERO9
     C                     ENDIF
      *
     C           @N4       IFEQ '0'
     C                     MOVE ' '       @N4
     C                     ELSE
     C                     GOTO #ZERO9
     C                     ENDIF
      *
     C           @N5       IFEQ '0'
     C                     MOVE ' '       @N5
     C                     ELSE
     C                     GOTO #ZERO9
     C                     ENDIF
      *
     C           #ZERO9    ENDSR
      *===============================================================
      * DISPLAY
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     SETON                     70
     C           ENDRRN    IFNE 0
     C                     SETON                     71
     C                     ENDIF
     C                     MOVELMSG,1     D@MSG
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     707199
     C                     Z-ADD$$RRN     RRN1
     C*----------
     C                     SELEC
     C* <F1> END
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C* <F12> END
     C           *INKL     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C* <PAGE UP/DOWN>
     C           *IN73     WHEQ *ON
     C           *IN73     OREQ *ON
     C                     MOVE '#DSP1   '@STEP
     C* <ENTER>
     C                     OTHER
JW1  C* <CHG DCL?>
 |   C           SVRRN     IFNE 0
 |   C                     EXSR #CHGD
 |   C                     ENDIF
JW1  C                     MOVE '#INIT   '@STEP
     C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
JW1   * CHANGE DCL
 |    *===============================================================
 |   C           #CHGD     BEGSR
 |    *
 |   C                     Z-ADD0         RRN2    40
 |   C           *IN80     DOUEQ*ON
 |   C                     ADD  1         RRN2
 |   C           RRN2      CHAINSFL01                80
 |   C           *IN80     IFEQ *OFF
 |   C           S@SLCT    ANDNE*BLANK
 |   C                     MOVE *BLANK    S@SLCT
 |   C                     UPDATSFL01
 |   C           S@SEQ     IFNE *BLANK
 |   C                     CLEARWIN01
 |   C                     MOVELS@MHN1    W@MHN1
 |   C                     MOVELS@MHN2    W@MHN2
 |   C                     MOVELS@MHN3    W@MHN3
 |   C                     MOVELS@MHN4    W@MHN4
 |   C                     MOVELS@TOKU    W@TOKU
 |   C                     MOVELS@NONY    W@NONY
 |   C                     MOVELS@NKOJ    W@NKOJ
 |   C                     MOVELS@NUKE    W@NUKE
 |   C                     MOVELS@PLS2    W@PLSH
 |   C                     MOVELS@BIN     W@BIN
 |   C                     MOVELS@ODRN    W@ODRN
 |   C                     MOVELS@PLNT    W@PLNT
 |   C                     MOVELS@SHCD    W@SHCD
 |   C                     MOVELS@REVN    W@REVN
 |    * DISPLAY WINDOW
 |   C           LOOP      TAG
 |   C                     EXFMTWIN01
 |   C                     MOVE *BLANK    S@MSG
 |    * F12 BACK
 |   C           *INKL     IFEQ *ON
 |   C                     ITER
 |   C                     ENDIF
 |    * F5  UPDATE
 |   C           *INKE     IFEQ *ON
 |   C                     EXSR #CHGD2
 |   C           RTN2      IFEQ '*'
 |   C                     MOVELMSG,2     S@MSG
 |   C                     GOTO LOOP
 |   C                     ENDIF
 |   C                     ENDIF
 |    *
 |   C                     ENDIF
 |   C                     ENDIF
 |   C                     ENDDO
 |    *
JW1  C                     ENDSR
      *===============================================================
JW1   * CHANGE DCL FIELD OF AB#PP2A
 |    *===============================================================
 |   C           #CHGD2    BEGSR
 |    *
 |   C                     MOVE *BLANK    RTN2    1
 |   C                     MOVELS@TOKU    K@TOKU
 |   C                     MOVELS@NONY    K@NONY
 |   C                     MOVELS@NKOJ    K@NKOJ
 |   C                     MOVELS@NUKE    K@NUKE
 |   C                     MOVELS@MHN1    K@MHN1
 |   C                     MOVELS@MHN2    K@MHN2
 |   C                     MOVELS@MHN3    K@MHN3
 |   C                     MOVELS@MHN4    K@MHN4
 |   C                     MOVELS@PLS2    K@PLSH
 |   C                     MOVELS@BIN     K@BIN
 |   C                     MOVELS@ODRN    K@ODRN
 |    *
 |   C           KEY2A     CHAINAB#P2A3R             99
 |   C           *IN99     IFEQ *ON
 |   C                     MOVE '*'       RTN2
 |   C                     ELSE
 |   C                     MOVELW@DCL     ACREVN
 |   C                     MOVEL'*CHGDCL1'ACKPGM
 |   C                     UPDATAB#P2A3R
 |   C                     ENDIF
 |    *
JW1  C                     ENDSR
** MSG
F1/F12: GO BACK   S(STATUS): 1=ORDER, 3=ASN, BLANK=EDI
NO ORDER FOUND! DCL DID NOT CHANGED!
