     H            Y/
      *-----------------------------------------------------------
      * ASN PROCESSING START
      *      JAN/10/02  (TCH)
      *
      *
      *-----------------------------------------------------------
     FAB#WP40 IP  F     100            DISK
      *---------------------------------------------------------
     IAB#WP40 AA  70
     I                                       10  13 NONY  L1
     I                                       14  14 NKOJ  L1
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
      *   MAIN ROUTINE
      *---------------------------------------------------------
     CL1                   EXSR #CALL
      *---------------------------------------------------------
     C           #CALL     BEGSR
      *
     C                     CALL 'AB#RL1'
     C                     PARM           NONY
     C                     PARM           NKOJ
     C                     PARM '1'       P@ID    1
      *
     C                     ENDSR
