     H            Y.
      ** AB#R3L **********************************************
      *  CUSTOM SHEET PRINT                                  *
      *         K.KASHIWAGI     2001.01.08                   *
      *         H.AMANO         2001.09.14                   *
      *           ADD ENTRY CHECK
TCH47 *    TCH 03/08/05 PRINTER
TCHK1 *  TCHK1  12/24/2005 CHG PRINTER CONTROL
TCHK2 *  TCHK2  08/28/2006 CHG BIN# LENGTH
JW1   *  J.WATA 04/07/2016 CHG WGT FOR FORD
JW2   *  J.WATA 07/26/2021 ADD LANPRT50
      ********************************* AB#R3L ***************
     FAB#PW3L CF  E                    WORKSTN
     FAB#PL11 IF  E           K        DISK
      *
     E                    MSGTBL  1  10 60
     I            DS
     I                                        1   80PNOHZ
     I                                        1   40PYEAR
     I                                        5   60PMM
     I                                        7   80PDD
JW   I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------*
      * MAIN ROUTINE *
      *--------------*
     C                     EXSR @INTR
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      @DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
      *---------------*
      * INITIALIZATION
      *---------------*
     C           @INTR     BEGSR
TCH47C                     MOVE '1'       P@PRT
     C                     Z-ADD0         PNOHZ
     C                     Z-ADD1.07      PWEIG
     C                     MOVEL*BLANKS   MSG
     C                     MOVEL'01'      W@ID    2
     C                     SETOF                     020304
     C                     SETOF                     060708
     C                     SETOF                     091099
      *
     C           KEY1      KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           PYEAR
     C                     KFLD           PMM
     C                     KFLD           PDD
      *
     C                     ENDSR
      *--------------*
      * FIRST SCREEN *
      *--------------*
     C           @DSP1     BEGSR
     C                     EXFMTAB#PW3L1
     C                     MOVEL*BLANKS   MSG
     C                     SETOF                     020304
     C                     SETOF                     060708
     C                     SETOF                     091099
     C*
     C                     SELEC
     C           *INKA     WHEQ '1'
     C                     MOVEL'99'      W@ID
     C           *INKE     WHEQ '1'
     C                     EXSR @CHECK
     C           *IN99     IFEQ '0'
     C                     MOVE PNOHZ     PNOHZC  8
     C                     CALL 'AB#C3M'
     C                     PARM           PSIRE   4
     C                     PARM           PSIRK   1
     C                     PARM           PNOHZC  8
TCHK2C*                    PARM           PNOBN   1
TCHK2C                     PARM           PNOBN   2
     C                     PARM           PWEIG   52
     C                     PARM           PNUKE   4
     C                     PARM           PODRN  10
TCH47C                     PARM           POUTQ  08
     C                     CLEARAB#PW3L1
     C                     Z-ADD1.07      PWEIG
     C                     ENDIF
      *
     C                     OTHER
     C                     EXSR @CHECK
     C           *IN99     IFEQ '0'
     C                     ENDIF
     C                     ENDSL
     C                     ENDSR
      *--------------*
      * CHECK1*
      *--------------*
     C           @CHECK    BEGSR
     C                     TESTN          PSIRE      02
     C           *IN02     IFEQ *OFF
     C                     MOVELMSGTBL,1  MSG
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN02
     C                     ENDIF
     C*
      ********   *IN99     IFEQ '0'
      ********             TESTN          PSIRK      03
      ********   *IN03     IFEQ '0'
      ********             MOVELMSGTBL,1  MSG
      ********             MOVEL'1'       *IN99
      ********             MOVEL'1'       *IN03
      ********             ENDIF
      ********             ENDIF
     C*
     C           *IN99     IFEQ '0'
     C           PYEAR     IFLT 1997
     C           PMM       ORGT 12
     C           PMM       OREQ 0
     C           PDD       ORGT 31
     C           PDD       ORLT 1
     C                     MOVELMSGTBL,2  MSG
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN04
     C                     ENDIF
     C                     ENDIF
     C*
     C           *IN99     IFEQ '0'
     C           PNOBN     IFNE *BLANKS
     C                     TESTN          PNOBN      07
     C           *IN07     IFEQ '0'
     C                     MOVELMSGTBL,3  MSG
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN07
     C                     ELSE
     C                     MOVEL'0'       *IN07
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           *IN99     IFEQ '0'
     C           PWEIG     IFEQ 0
     C           PWEIG     ORGT 999.99
     C                     MOVELMSGTBL,4  MSG
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN06
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE PSIRE     K@NONY
     C           KEY1      CHAINAB#PL11              90
     C           *IN90     IFEQ *ON
     C  N99                MOVELMSGTBL,7  MSG
     C                     MOVE *ON       *IN99
     C                     SETON                     020304
     C                     ENDIF
      *
JW1   *CHANGE PWEIG IF CUSTOMER IS FORD,
JW1  C           BATOKU    IFEQ 5149
JW1  C                     Z-ADD0.33      PWEIG
JW1  C                     ENDIF
      * IF NO ERROR,
JW2  C           *IN99     IFEQ '0'
     C                     MOVE *BLANK    POUTQ
     C                     SELEC
     C           P@PRT     WHEQ '1'
     C                     MOVEL'LANPRT02'POUTQ
     C           P@PRT     WHEQ '2'
     C                     MOVEL'LANPRT07'POUTQ
     C           P@PRT     WHEQ '3'
     C                     MOVEL'LANPRT08'POUTQ
     C           P@PRT     WHEQ '4'
     C                     MOVEL'LANPRT03'POUTQ
     C           P@PRT     WHEQ '5'
     C                     MOVEL'QPRINTA 'POUTQ
     C           P@PRT     WHEQ '6'
     C                     MOVEL'LANPRT09'POUTQ
     C           P@PRT     WHEQ '7'
     C                     MOVEL'LANPRT10'POUTQ
     C           P@PRT     WHEQ '8'
     C                     MOVEL'LANPRT05'POUTQ
     C           P@PRT     WHEQ '9'
     C                     MOVEL'QDKT    'POUTQ
JW2  C           P@PRT     WHEQ 'A'
 "   C                     MOVEL'LANPRT50'POUTQ
     C                     OTHER
     C  N99                MOVELMSGTBL,8  MSG
     C                     MOVE *ON       *IN99
     C                     SETON                     10
     C                     ENDSL
JW2  C                     ENDIF
     C*
     C                     ENDSR
      *---------------*
** MSGTBL(60A) ....2.........3.........4.........5.........6
E-01 INVALID DELIVERY CODE !                                 01
E-02 INVALID DATE(YYYYMMDD) !                                02
E-03 INVALID BIN# !                                          03
E-04 INVALID WEIGHT !                                        04
                                                             05
E-06 INVALID ORDER# !                                        06
E-07 NO DATA !                                               07
E-08 SELECT 1 TO A !                                         08


