     H            Y.
      ** AB#R4SFX ******************************************
      * GET HOMEPOS TO UPDATE AB#PP4S                      *
      *                                                    *
      * LEC   01/17/2023 CREATE                            *
      ******************************************************
     FAB#PP4S UF  E           K        DISK
     FAB#PL44EIF  E           K        DISK
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     I            DS
     I                                        1  140@SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     C                     TIME           @SDATE
      *
     C           *IN50     DOWEQ*OFF
      *
     C                     READ AB#PP4S                  50
      *
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           PHMHIN    CHAINAB#PL44E             51
     C           *IN51     IFEQ *OFF
     C           DAHOME    IFNE PHHPOS
     C                     MOVELDAHOME    PHHPOS
     C                     Z-ADDTODAY     PHKYMD
     C                     UPDATAB#PP4S1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
