     H            Y.
     F** AB#RA7 ********************************************************
     F*  FORD DATE CHECK                                               *
     F*     P@ID = 1 : PAST DATE
     F*     P@ID = 2 : MORE THAN 2 DAYS AFTER OR TODAY
     F******************************************************** AB#RA7 **
     FAGDPL12 IF  E           K        DISK
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@YY    40
     C                     PARM           P@MM    20
     C                     PARM           P@DD    20
     C                     PARM           P@ID    1
      *
     C           K#KEY     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
      *
     C                     MOVE *BLANK    P@ID
     C                     Z-ADDP@YY      W@YY
     C                     Z-ADDP@MM      W@MM
     C                     Z-ADDP@DD      W@DD
     C                     Z-ADDP@YY      K@YY
     C                     Z-ADDP@MM      K@MM
     C                     Z-ADDP@DD      K@DD
     C           K#KEY     CHAINAGDPL12              90
     C                     SELEC
     C           *IN90     WHEQ *ON
     C                     MOVE '1'       P@ID
     C           W@YMD     WHLT *DATE
     C                     MOVE '1'       P@ID
     C           W@YMD     WHEQ *DATE
     C                     MOVE '2'       P@ID
     C                     OTHER
     C                     Z-ADD*YEAR     K@YY
     C                     Z-ADD*MONTH    K@MM
     C                     Z-ADD*DAY      K@DD
     C           K#KEY     SETGTAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C           F8YOBI    ANDLE5
     C           F8YMD     IFLT W@YMD
     C                     MOVE '2'       P@ID
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
