     H            Y
      ** AB#R8N **********************************************
      *  RETRIEVE BIN FOR NAPCK                              *
      *  LEC  2022/08/29                                     *
      ********************************* AB#R8M ***************
     FAB#PP89 IF  E           K        DISK
      *
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
      *
     C                     Z-ADD*ZERO     OUTBIN
      *
     C           INSHDT    IFNE *ZERO
      *
     C                     MOVE *BLANKS   SPSURT 10
      *
     C           K#891     SETGTAB#PP89
     C           K#892     REDPEAB#PP89                  98
      *
     C           *IN98     IFEQ *OFF
     C                     MOVELA9SURT    SPSURT
     C                     ENDIF
      *
     C                     ENDIF
      *
      * use bin assignment program for toyota to get bin# for napck route...
     C           SPSURT    IFNE *BLANK
     C                     MOVELSPSURT    INRTE  10 P
     C                     Z-ADD*ZERO     BINRTN  20
     C                     CALL 'AB#R8M'
     C                     PARM           INSHDT
     C                     PARM           INRTE
     C                     PARM           BINRTN
      *
     C                     Z-ADDBINRTN    OUTBIN
     C                     ENDIF
      *
     C           *IN98     IFEQ *ON
     C           OUTBIN    OREQ *ZERO
     C                     Z-ADD1         OUTBIN
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      * INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           INHOME  1
     C                     PARM           INSHDT  80
     C                     PARM           OUTBIN  20
      *
     C           K#891     KLIST
     C                     KFLD           INHOME
     C                     KFLD           INSHDT
      *
     C           K#892     KLIST
     C                     KFLD           INHOME
      *
     C                     ENDSR
