     H            Y.
     F** AB#R2G ************************************
     F*  ..EDI FRS ORDER ERROR LIST.            .  *
     F*      K.YASUDA      2000.03.30              *
     F*      K.KASHIWAGI   2001.01.21 CHANGE TITLE *
     F*      A.AMANO       2002.05.10 CHANGE TITLE *
     F*          ADD ERROR MESSAGE                 *
JW1  F*  JW  2018.01.30 ADD HONDA CUSTOMER         *
     F************************************ AB#R2G **
     FAB#WP2A IP  F     100            DISK
     FQPRINT  O   F     132     OF     PRINTER
     E**JW1               HND     1   7  4
JW1  E                    HND     1  13  4
     E                    TTL     1   1 53
     E                    TAB1    1   3  1   TAB2   22
     IAB#WP2A AA  01
     I                                        1   4 ISIRE
     I                                        5   5 ISIRK
     I                                        6   90ITOKU
     I                                       10  130INONY
     I                                       14  14 INKOJ
     I                                       15  18 INUKE
     I                                       19  22 ISBAN
     I                                       23  42 IMHIN
     I                                       43  52 IODRN
     I                                       53  590ISURY
     I                                       60  670INYMD
     I                                       68  730IUSYS
     I                                      100 100 IERCD
     I            DS
     I                                        1  20 XMHIN
     I                                        1   5 XMHN1
     I                                        6   9 XMHN2
     I                                       10  14 XMHN3
     I            DS
     I                                        1  20 ZMHIN
     I                                        1   5 ZMHN1
     I                                        6  10 ZMHN2
     I                                       11  15 ZMHN3
     I            DS
     I                                        1  25 @MHIN
     I                                        1   5 @MHN1
     I                                        6   6 BAR1
     I                                        7  10 @MHN2
     I                                       11  11 BAR2
     I                                       12  16 @MHN3
     I            DS
     I                                        1  25 #MHIN
     I                                        1   5 #MHN1
     I                                        6   6 BAR3
     I                                        7  11 #MHN2
     I                                       12  12 BAR4
     I                                       13  17 #MHN3
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
      *
     C           *IN05     IFEQ '0'
     C                     TIME           WTIME   60
     C                     SETON                     05
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTHD
     C                     END
      *
     C                     SETOF                     10
     C           PSIRE     LOKUPHND                      10
      *
     C                     MOVE '-'       BAR1
     C                     MOVE '-'       BAR2
     C                     MOVE '-'       BAR3
     C                     MOVE '-'       BAR4
     C                     MOVE *BLANK    WMHIN  25
     C           *IN10     IFEQ '1'
     C                     MOVELIMHIN     XMHIN
     C                     MOVELXMHN1     @MHN1
     C                     MOVELXMHN2     @MHN2
     C                     MOVELXMHN3     @MHN3
     C                     MOVEL@MHIN     WMHIN
     C                     ELSE
     C                     MOVELIMHIN     ZMHIN
     C                     MOVELZMHN1     #MHN1
     C                     MOVELZMHN2     #MHN2
     C                     MOVELZMHN3     #MHN3
     C                     MOVEL#MHIN     WMHIN
     C                     END
     C           IERCD     LOKUPTAB1      TAB2           10
      *
     C                     EXCPTDT
      *
     OQPRINT  E  102           HD
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                                   12 'AB#R2G-1'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O*                                  50 '** EDI(ORDER DATA)'
     O*                                  74 'PARTS INFOMATION MASTER'
     O*                                  82 'LIST **'
     O                         TTL,1     82
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  1             HD
     O                                   42 'KANBAN'
     O        E  2             HD
     O                                    6 'CUST'
     O                                   14 'RCV CO.'
     O                                   18 'FCT'
     O                                   23 'DOCK'
     O                                   42 'NUMBER'
     O                                   60 'USER PART NUMBER'
     O                                   84 'PICK-UP DATE'
     O                                   99 'PIECES'
     O                                  107 'QTY/BOX'
     O        E  1             DT
     O                         ITOKU      6
     O                         INONY     12
     O                         INKOJ     17
     O                         INUKE     23
     O                         ISBAN     40
     O                         WMHIN     69
     O                         INYMD     83 '    .  .  '
     O                         ISURY 1   99
     O                         IUSYS 2  107
     O                       10TAB2     132
** HND
0295
0296
0297
2418
3128
4126
4155
0294
0390
0391
0400
1602
3135
** TTL
<< EDI(ORDER DATA) PARTS INFORMATION MASTER ERROR >>
** TAB1/TAB2
1QTY IS NOT MULT OF BOX
2NO DATA IN PART M/F
3QTY/BOX ERROR
