     H            Y.
     F** AB#R457************************************************
     F*  PRINT FIRM ORDER SHIP DATE ERROR LIST                 *
     F*  JW         2024.01.23                                 *
     F**********************************************************
     FAB#WP452IP  F     256            DISK
     FAB#PL15 IF  E           K        DISK                      A
     FAB#PPA1 O   E           K        DISK
     FQPRINT6 O   F     132     OB     PRINTER                        UC
     **-----------------------------------------------------------
     E                    TTL     1   2 57
     E                    CMD     1   4 60
     **-----------------------------------------------------------
     IAB#WP452AA  01
     I                                        1   4 ISIRE
     I                                        5   5 ISIRK
     I                                        6   90ITOKU L4
     I                                       10  130INONY L4
     I                                       14  14 INKOJ L4
     I                                       15  18 INUKE L3
     I                                       19  22 ISBAN
     I                                       23  42 IMHIN L2
     I                                       23  27 IMHN1
     I                                       28  32 IMHN2
     I                                       33  37 IMHN3
     I                                       38  42 IMHN4
     I                                       43  500INOHZ L2
     I                                       43  460INOYY
     I                                       47  480INOMM
     I                                       49  500INODD
     I                                       51  60 IODRN L2
     I                                       61  670ISRYO
     I                                       68  730ISYOS
     I                                       74  770INOTM
     I                                       78  89 ISHIN
     I                                       78  82 ISHN1
     I                                       83  87 ISHN2
     I                                       88  89 ISHN3
     I                                       90  93 ICARD
     I                                       94  97 IALFL
%0001I                                       98  990INOBN L2
%0001I                                      100 1050IUSYS
%0001I                                      106 121 IINVN L1
%0001I                                      122 125 IRESE
%0001I                                      126 1330IDEHZ
%0001I                                      126 1290IDEYY
%0001I                                      130 1310IDEMM
%0001I                                      132 1330IDEDD
%0001I                                      134 145 IPGID
JW2  I                                      146 165 IMHIN2
     I                                      166 166 IHOME
     I                                      167 171 ILINE
     I                                      172 178 ISUBRT
JWB  I                                      179 198 IFLD2
JWB  I                                      199 208 INUM1
JWC  I                                      209 218 IPGM
JWC  I                                      219 226 IOGHZ
     I                                      256 256 @@H
     I            DS
     I                                        1   80BASKHZ
     I                                        1   40BASKYY
     I                                        5   60BASKMM
     I                                        7   80BASKDD
     I            DS
     I                                        1   80BAKOHZ
     I                                        1   40BAKOYY
     I                                        5   60BAKOMM
     I                                        7   80BAKODD
     I            DS
     I                                        1   60BATIME
     I                                        1   20BAKOHH
     I                                        3   40BAKOSS
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1  12 BASHIN
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
JW6  I            DS
 |   I                                        1   80BADEHZ
 |   I                                        1   40BADEYY
 |   I                                        5   60BADEMM
JW6  I                                        7   80BADEDD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
      * %0003
     I            DS
     I                                        1  10 W@ODRN
     I                                       10  10 W@NPLX
JW3  I            DS
 |   I                                        1  140WSDT
 |   I                                        1   60WSTM6
 |   I                                        1   40WSTM4
 |   I                                        1   20WSHH
 |   I                                        3   40WSMN
 |   I                                        5   60WSSS
 |   I                                        7  140WSDAT
 |   I                                        7  100WSYY
 |   I                                       11  120WSMM
JW3  I                                       13  140WSDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
JW5  I              'MX-UST026'           C         @@UST
      *
     C           KEY1      KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           IODRN
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
      *
     C           KEY2      KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           IODRN
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           INOBN
     C                     KFLD           IDEYY
     C                     KFLD           IDEMM
     C                     KFLD           IDEDD
      *
     C           KEY2X     KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           IODRN
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           INOBN
      *
     C           KEY3      KLIST
     C                     KFLD           INONY
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           IODRN
     C                     KFLD           INOBN
     C                     KFLD           IINVN
      *
     C           KEY4      KLIST
     C                     KFLD           INONY
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           IODRN
     C                     KFLD           INOBN
      *
     C           KEY5      KLIST
     C                     KFLD           INONY
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
      *
     C           KEY5X     KLIST
     C                     KFLD           INONY
     C                     KFLD           INOYY
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           IODRN
     C                     KFLD           INOBN
      *
     C           KEY0      KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           IODRN
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C           K#75      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           INOBN
      * %0003
     C           KEYN1     KLIST
     C                     KFLD           K@DELV  40
     C                     KFLD           K@ODRN 16
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
JW4  C                     MOVE PUS       PUS10   1
      *
     C           ITOKU     IFEQ 0873
     C**JW       ITOKU     OREQ 0701
     C                     MOVE *ON       *IN22
     C                     ELSE
     C                     MOVE *OFF      *IN22
     C                     ENDIF
      *
     C           *INL4     IFEQ *ON
     C                     MOVE *OFF      *IN88
     C                     ENDIF
      *
      *
     C           *INL2     IFEQ '1'
     C           ITOKU     ANDNE0873
     C                     Z-ADD0         WSRYO
     C                     END
      *
     C           *INL1     IFEQ '1'
     C           ITOKU     IFEQ 0873
     C**JW       ITOKU     OREQ 0701
     C                     Z-ADD0         WSRYO
     C                     END
     C                     END
      *
     C                     ADD  ISRYO     WSRYO   90
      *
     C  N22                EXSR SUBR
      *
     CL1 22                EXSR SUBR
      *
     CL4 88                EXSR #CALL
      *-------------------------------------------------
     C           SUBR      BEGSR
      *
     C                     SETOF                     10
     C                     MOVEL*BLANK    W@ODRN
      *
     C           INOHZ     IFLT *DATE
     C           @@H       ANDEQ*BLANK
     C                     EXSR #ERR
     C                     WRITEAB#WP4W1
     C                     ELSE
      *
     C                     Z-ADDINOHZ     K@YMD
     C           K#AGD     CHAINAGDPL12              10
     C           *IN10     IFEQ *ON
     C           @@H       ANDEQ*BLANK
     C                     EXSR #ERR
     C                     WRITEAB#WP4W1
     C                     ELSE
      *
     C                     SELEC
     C           ITOKU     WHEQ 5149                       FORD
     C           KEY2      SETLLAB#PL151
     C           *IN10     DOUEQ*ON
     C           KEY2      READEAB#PL151                 10
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C           BASRYO    IFNE WSRYO
     C                     EXSR #DIFF
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           ITOKU     WHEQ 0873                       ARVIN SANGO
     C**JW       ITOKU     OREQ 0701                       TISA
     C           KEY2X     SETLLAB#PL151
     C           *IN10     DOUEQ*ON
     C           KEY2X     READEAB#PL151                 10
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C           BASRYO    IFNE WSRYO
     C                     EXSR #DIFF
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      * %0002
     C           ITOKU     WHEQ 8450                       VOLKSWAGEN
     C           KEY1      SETLLAB#PL151
     C           *IN10     DOUEQ*ON
     C           KEY1      READEAB#PL151                 10
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    ANDEQIINVN
      *
     C           BASRYO    IFNE WSRYO
     C                     EXSR #DIFF
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     OTHER
     C           KEY1      SETLLAB#PL151
     C           *IN10     DOUEQ*ON
     C           KEY1      READEAB#PL151                 10
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BANOBN    ANDEQINOBN
      *
     C           BASRYO    IFNE WSRYO
     C                     EXSR #DIFF
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDSL
      * NAL
 4   C           ITOKU     IFEQ 0271
 |    *  %0003  PLEX OR OLD
 |   C                     MOVELIODRN     W@ODRN
 |3  C           W@NPLX    IFNE *BLANK
 ||   * OLD
 ||  C           KEY0      SETLLAB#PL151
 ||  C           *IN90     DOUEQ*ON
 ||  C           KEY0      READEAB#PL151                 90
 ||   *
 ||  C           *IN90     IFEQ *OFF
 ||  C           BASKJY    ANDEQ*BLANK
 ||  C           BANOBN    ANDEQINOBN
 ||  C           BANOHZ    ANDNEINOHZ
 ||  C                     MOVE *OFF      *IN10
 ||  C                     EXSR #DIFF
 ||  C                     LEAVE
 ||  C                     ENDIF
 ||   *
 ||  C                     ENDDO
 ||   * %0003 PLEX
 |3  C                     ELSE
 ||   * GET SERIAL NUMBER FOR MANIFEST
 ||2 C           *IN10     IFEQ '1'
 ||| C                     Z-ADDINONY     K@DELV
 ||| C                     MOVEL*BLANK    K@ODRN
 ||| C                     MOVELIODRN     K@ODRN
 |||  *
 ||| C           KEYN1     CHAINAB#NP401             21
 |||1C           *IN21     IFEQ '0'
 |||| * UPDATE
 ||||C                     Z-ADDN4NMBR    @CONT   40
 ||||C                     ADD  1         N4NMBR
 ||||C                     Z-ADD*DATE     N4UDAT
 ||||C                     TIME           N4UTIM
 ||||C                     MOVEL#PGM      N4UPGM
 ||||C                     UPDATAB#NP401
 |||| * ADD
 |||1C                     ELSE
 ||||C                     Z-ADD1         N4NMBR
 ||||C                     Z-ADD1         @CONT
 ||||C                     ADD  1         N4NMBR
 ||||C                     Z-ADD*DATE     N4UDAT
 ||||C                     TIME           N4UTIM
 ||||C                     MOVEL#PGM      N4UPGM
 ||||C                     Z-ADDK@DELV    N4KWF1
 ||||C                     MOVELK@ODRN    N4KWC1
 ||||C                     WRITEAB#NP401
 |||1C                     ENDIF
 |||  *
 ||| C                     MOVELIODRN     IINVN
 ||| C                     MOVE '0000000' IINVN
 ||| C                     MOVE @CONT     IINVN
 ||| C*
 ||2 C                     ENDIF
 |3  C                     ENDIF
 4   C                     ENDIF
      *
      *
     C           *IN10     IFEQ '1'
      *
     C           K#75      CHAINAB#PL75              90
     C           *IN90     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C                     EXSR #NEW
     C                     ENDIF
      *
     C                     SETON                     U2
     C                     MOVE *ON       *IN88
     C                     CLEARAB#PL151
      *
     C                     MOVE *BLANK    BASKJY
     C                     Z-ADD0         BASKHZ
     C                     Z-ADD*DATE     BAKOHZ
     C                     TIME           BATIME
TCHK1C                     MOVEL#USER     BAKOME    P
     C                     MOVE ISIRE     BASIRE
     C                     MOVE ISIRK     BASIRK
     C                     Z-ADDITOKU     BATOKU
     C                     Z-ADDINONY     BANONY
     C                     MOVE INKOJ     BANKOJ
     C                     MOVE INUKE     BANUKE
     C                     MOVE ISBAN     BASBAN
     C                     MOVE IMHIN     BAMHIN
     C                     MOVE ISHIN     BASHIN
     C                     Z-ADDINOHZ     BANOHZ
     C                     Z-ADDINOTM     BANOTM
     C                     MOVELIINVN     BAINVN
     C                     MOVELIODRN     BAODRN
     C                     Z-ADDWSRYO     BASRYO
     C                     Z-ADDISYOS     BASYOS
      *
     C                     Z-ADD0         BATANK
     C                     Z-ADD0         BAURHZ
     C                     MOVELICARD     BACARD
     C                     Z-ADD0         BARCOD
     C                     MOVELIALFL     BAALFL
%0001C                     Z-ADDINOBN     BANOBN
%0001C                     Z-ADDIUSYS     BAUSYS
%0001C                     Z-ADDWSRYO     BAODER
%0001C**JW4                MOVEL'E'       BAEDIK
      *
JW4  C           PUS10     IFEQ *BLANK
 |   C                     MOVEL'E'       BAEDIK
 |   C                     ELSE
 |   C                     MOVELPUS10     BAEDIK
JW4  C                     ENDIF
      *
%0001C                     MOVELIRESE     BARESE
%0001C                     Z-ADDIDEYY     BADEYY
%0001C                     Z-ADDIDEMM     BADEMM
%0001C                     Z-ADDIDEDD     BADEDD
%0001C                     MOVELIPGID     BAPGID
      * DEFAULT=318239 FOR 3322
JW5  C           BANONY    IFEQ 3322
 |   C           BAPGID    ANDEQ*BLANK
 |   C                     MOVEL'318239'  BAPGID    P
JW5  C                     ENDIF
 |    * DENSO: SET SUPPLIER CODE
 |   C           BAPGID    IFEQ *BLANK
 |   C                     SELEC
 |   C           BANONY    WHEQ 3032
 |   C                     MOVEL'AA-C13'  BAPGID    P
 |   C           BANONY    WHEQ 3056
 |   C                     MOVEL'XC-C46'  BAPGID    P
 |   C           BANONY    WHEQ 3062
 |   C                     MOVEL@@UST     BAPGID    P
 |   C           BANONY    WHEQ 3063
 |   C                     MOVEL@@UST     BAPGID    P
 |   C           BANONY    WHEQ 3070
 |   C                     MOVEL@@UST     BAPGID    P
 |   C           BANONY    WHEQ 3076
 |   C                     MOVEL'AK-C45'  BAPGID    P
 |   C           BANONY    WHEQ 3086
 |   C                     MOVEL'CN-C90'  BAPGID    P
 |   C                     ENDSL
JW5  C                     ENDIF
      * BASYOS=0?
JW9  C           BASYOS    IFEQ 0
 |   C           BAUSYS    IFEQ 0
 |   C                     Z-ADDBASRYO    BASYOS
 |   C                     ELSE
 |   C                     Z-ADDBAUSYS    BASYOS
 |   C                     ENDIF
JW9  C                     ENDIF
      * FORD SATURDAY SHIP
JW6  C           BATOKU    IFEQ 5149
 |   C           BANOHZ    IFNE BADEHZ
 |   C                     EXSR #FORD1
 |   C           UPDFLG    IFEQ 'Y'
 |   C                     MOVEL$TGT8     BANOHZ
 |   C                     ENDIF
 |   C                     ENDIF
JW6  C                     ENDIF
      *
     C           BATOKU    IFEQ 3411
     C                     MOVELISUBRT    BAROUT    P
     C                     ENDIF
     C                     MOVELIHOME     BAHPOS
     C                     MOVELILINE     BALIN#
JW   C                     MOVELIODRN     BAORD#
.    C                     MOVELIMHIN2    BAUHIN
.    C                     Z-ADDWSDAT     BACRHZ
.    C                     Z-ADDWSTM6     BACRTM
.    C                     MOVEL#USER     BACRME
.    C                     MOVEL#PGM      BACRPG
      *
.    C           BAODRN    IFEQ *BLANK
.    C                     MOVEL'1       'BAODRN    P
.    C                     ENDIF
      * IAF#
JWA  C           BAIAF#    IFEQ 0
     C                     MOVELWSDAT     $DATE
     C                     MOVE 'Y'       $UPD
     C                     CALL 'UTLR56C'
     C                     PARM           $DATE   8
     C                     PARM           $UPD    1
     C                     PARM           $IAF#  10
     C                     MOVEL$IAF#     BAIAF#
JWA  C                     ENDIF
      * EDI ORIGINAL PGM
JWC  C                     MOVELIPGM      BAFLD1
      * RAN#
JWC  C                     MOVELIFLD2     BAFLD2
      * EDI PO ISSUE DATE
 .   C           INUM1     IFEQ *ZERO
 .   C           INUM1     OREQ *BLANK
 .   C                     Z-ADD0         BANUM1
 .   C                     ELSE
 .   C                     MOVE INUM1     BANUM1
JWC  C                     ENDIF
      * EDI SHIP DATE
 .   C           IOGHZ     IFEQ *ZERO
 .   C           IOGHZ     OREQ *BLANK
 .   C                     Z-ADD0         BANUM2
 .   C                     ELSE
 .   C                     MOVE IOGHZ     BANUM2
JWC  C                     ENDIF
      *
      **** CREATE AB#PP10 *******************************
     C                     WRITEAB#PL151
      ***************************************************
      *
JW1   * WRITE AB#PPA1 (EXTRA ORDER)
 |   C                     Z-ADD01        BAPAL#
 |   C                     MOVE *BLANK    BAPALT
 |   C                     MOVE *BLANK    BAPLNT
 |   C                     MOVE *BLANK    BAEDII
 |   C                     MOVE *BLANK    BASHCD
 |   C                     MOVE *BLANK    BAREVN
 |   C                     MOVE *BLANK    BACTTP
 |   C                     MOVELIODRN     BAORD#
JW2  C                     MOVELIMHIN2    BAFLD2
 |   C                     Z-ADD0         BASKTM
 |   C                     MOVE *BLANK    BASKME
 |   C                     Z-ADDWSDAT     BACRHZ
 |   C                     Z-ADDWSTM6     BACRTM
 |   C                     MOVEL#USER     BACRME
 |   C                     MOVEL#PGM      BACRPG
 |   C                     Z-ADD0         BAURTM
 |   C                     MOVE *BLANK    BAURME
JW1  C                     WRITEAB#PPA11
      *
     C                     EXCPTDT
     C                     END
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADD0         WSRYO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #CALL     BEGSR
      *
     C                     MOVE INONY     P@NONY  4
     C                     CALL 'AB#RL1'
     C                     PARM           P@NONY
     C                     PARM           INKOJ
     C                     PARM '1'       P@ID    1
      *
     C                     ENDSR
JW6   *-----------------------------------------------------
 |    *  ADJUST FORD SHIP DATE TO SATURDAY
 |    *-----------------------------------------------------
 |   C           #FORD1    BEGSR
 |   C                     MOVE 'N'       UPDFLG  1
 |    * CHECK SUNDAY
 |   C                     MOVELBADEHZ    $DATE
 |   C                     CALL 'UTLR02'
 |   C                     PARM           $DATE   8
 |   C                     PARM           $DAY    2
 |   C                     PARM           $WEEK#  1
 |   C                     PARM           $RTN1   1
 |   C           $RTN1     IFEQ *BLANK
 |   C           $DAY      ANDNE'07'                       NOT SUNDAY
 |   C                     GOTO XFORD1
 |   C                     ENDIF
 |    * GET SATURDAY
 |   C                     MOVEL'-'       $SIGN   1
 |   C                     MOVEL'0001'    $DAYS   4
 |   C                     MOVEL'Y'       $IAF    1
 |   C                     CALL 'UTLR10'
 |   C                     PARM           $DATE   8
 |   C                     PARM           $SIGN   1
 |   C                     PARM           $DAYS   4
 |   C                     PARM           $IAF    1
 |   C                     PARM           $TGT8   8
 |   C                     PARM           $RTN2   1
 |   C           $RTN2     IFEQ *BLANK
 |   C                     MOVE 'Y'       UPDFLG
 |   C                     ENDIF
 |    *
JW6  C           XFORD1    ENDSR
      *-----------------------------------------------------
     C           #DIFF     BEGSR
      *
     C                     SETON                     U5
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     TIME           @@TIM   60
     C                     EXCPT@HED
     C                     EXCPT@HED2
     C                     ENDIF
      *
     C           BANOHZ    COMP INOHZ                    19
     C           BAMHN3    COMP *BLANK                   20
     C           BAMHN4    COMP *BLANK                   21
     C  N98                MOVE *ON       *IN98
     C           WSRYO     SUB  BASRYO    @@BAL   70
JW7   * GET NAME
 |   C                     MOVELBANONY    PMNONY
 |   C                     MOVEL'D'       PMOPT
 |   C                     CALL 'UTLR16'
 |   C                     PARM           PMNONY  4
 |   C                     PARM           PMOPT   1
 |   C                     PARM           PMNAME 20
 |   C                     PARM           PTOKU   4
 |   C                     PARM           PMRTN   1
JW7  C                     MOVELPMNAME    XNAM7   7
      *
     C                     EXCPT@DTL
     C                     EXCPT@DTL2
      *
     C                     Z-ADD*ZERO     WSRYO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #NEW      BEGSR
      *
     C                     SETON                     U5
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     TIME           @@TIM   60
     C                     EXCPT@HED
     C                     EXCPT@HED2
     C                     ENDIF
      *
     C           IMHN3     COMP *BLANK                   20
     C           IMHN4     COMP *BLANK                   21
     C  N98                MOVE *ON       *IN98
     C                     EXCPT@DTLN
     C                     EXCPT@DTL2N
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #ERR      BEGSR
      *
     C                     SETON                     U6
     C           *IN77     IFEQ *OFF
     C           *INOA     OREQ *ON
     C                     TIME           @@TIM   60
     C                     EXCPT@HED3
     C                     EXCPT@HED4
     C                     ENDIF
      *
     C           IMHN3     COMP *BLANK                   20
     C           IMHN4     COMP *BLANK                   21
     C  N77                MOVE *ON       *IN77
JW    * GET DELIVERY NAME
 |   C                     MOVELINONY     $DLV
 |   C                     CALL 'UTLR62B'
 |   C                     PARM           $DLV    4
 |   C                     PARM           $GRP    3
 |   C                     PARM           $NAME1 15
 |   C                     PARM           $NAME2 50
 |   C                     PARM           $RTN    1
JW   C                     MOVEL$NAME1    XNAM10 10
      *
     C                     EXCPT@DTL3
     C                     EXCPT@DTL4
      *
     C                     ENDSR
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *--------------------------------------------------------
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT2
      *
     C                     MOVELCMD,2     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT6
      *
     C                     MOVELCMD,3     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT5
      *
     C                     MOVELCMD,4     P@CMD
     C                     Z-ADD70        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN QPRINT
      *
JW3  C                     TIME           WSDT
      *
     C                     ENDSR
      *-----------------------------------------------------
     OAB#WP201E                DT
     O                         BASIRE     4
     O                         BASIRK     5
     O                         BATOKU     9
     O                         BANONY    13
     O                         BANKOJ    14
     O                         BANUKE    18
     O                         BASBAN    22
     O                         BAMHIN    42
     O                         BANOHZ    50
     O                         BAODRN    60
     O                         BASRYO    70
     O                         BASYOS    76
     O                         BANOTM    80
     O                         BASHIN    92
     O                         BAALFL    96
%0001O                         BANOBN    98
%0001O                         BAUSYS   104
%0001O                         BAINVN   120
%0001O                         BARESE   124
%0001O                         BADEYY   128
%0001O                         BADEMM   130
%0001O                         BADEDD   132
%0001O                         BAPGID   144
     O                         BAINVN   160
      *******
     OQPRINT  E   01           @HED
     O                         #PGM       8
JW1  O                                   20 'QPRINT '
JW1  O                         #USER     32
     O                         UDATE Y  110
     O                         @@TIM    120 '  :  :  '
     O                                  124 'P.'
     O                         PAGE  Z  128
     O        E   02           @HED
     O                         TTL,1     70
     O        E   03           @HED
     O                                   39 'KBAN'
     O        E  104           @HED
     O                                   12 'PICK-UP DATE'
     O                                   15 'BN'
     O                                   21 'SUPPL'
     O                                   28 'DELV'
     O                                   33 'DOCK'
     O                                   39 'NMBR'
     O                                   53 'USER PART NO'
     O                                   73 'NEW QTY'
     O                                   86 'OLD QTY'
     O                                   93 'DIFF.'
     O                                  106 'ORDER NO.'
     O                                  127 'NEW DATE'
     O        E 1              @DTL
     O                         BANOHZ    11 '    .  .  '
     O                         BANOBN    15
     O                         BASIRE    20
     O                                   21 '-'
     O                         BASIRK    22
     O                         BANONY    28
     O                         BANUKE    33
     O                         BASBAN    39
     O                         BAMHN1    46
     O                                   47 '-'
     O                         BAMHN2    52
     O                N20                53 '-'
     O                         BAMHN3    58
     O                N21                59 '-'
     O                         BAMHN4    64
     O                         WSRYO 1   73
     O                         BASRYO1   86
     O                         @@BAL J   96
     O                         BAODRN   109
     O                N19      INOHZ    130 '    .  .  '
      *
     O        E 1              @DTLN
     O                         INOHZ     11 '    .  .  '
     O                         INOBN     15
     O                         INONY     28
     O                         INUKE     33
     O                         ISBAN     39
     O                         IMHN1     46
     O                                   47 '-'
     O                         IMHN2     52
     O                N20                53 '-'
     O                         IMHN3     58
     O                N21                59 '-'
     O                         IMHN4     64
     O                         ISRYO 1   73
     O                                   86 '0'
     O                         ISRYO J   96
     O                         IODRN    109
      *******
     OQPRINT2 E   01           @HED2
     O                         #PGM       8
JW1  O                                   20 'QPRINT2'
JW1  O                         #USER     32
     O                         UDATE Y  110
     O                         @@TIM    120 '  :  :  '
     O                                  124 'P.'
     O                         PAGE1 Z  128
     O        E   02           @HED2
     O                         TTL,1     70
     O        E   03           @HED2
     O                                   39 'KBAN'
     O        E  104           @HED2
     O                                   10 'SHIP DATE'
     O                                   15 'BN'
     O**JW7                              21 'SUPPL'
JW7  O                                   20 'DELV'
"    O                                   25 'NAME'
     O                                   33 'DOCK'
     O                                   39 'NMBR'
     O                                   53 'USER PART NO'
     O                                   73 'CURRENT QTY'
     O                                   86 'NEW QTY'
     O                                   96 'DIFF.'
     O                                  108 'ORDER NO.'
     O                                  129 'NEW DATE'
     O        E 1              @DTL2
     O                         BANOHZ    11 '    .  .  '
     O                         BANOBN    15
     O**JW7                    BASIRE    20
     O**                                 21 '-'
     O**                       BASIRK    22
JW7  O                         BANONY    20
"    O                         XNAM7     28
     O                         BANUKE    33
     O                         BASBAN    39
     O                         BAMHN1    46
     O                                   47 '-'
     O                         BAMHN2    52
     O                N20                53 '-'
     O                         BAMHN3    58
     O                N21                59 '-'
     O                         BAMHN4    64
     O**                       WSRYO 1   73
     O**                       BASRYO1   86
JW8  O                         BASRYO1   73
 .   O                         WSRYO 1   86
 .   O                                   77 '-->'
     O                         @@BAL J   97
     O                         BAODRN   109
     O                N19      INOHZ    130 '    .  .  '
      *
     O        E 1              @DTL2N
     O                         INOHZ     11 '    .  .  '
     O                         INOBN     15
     O                         INONY     20
      *                        XNAM7     28
     O                         INUKE     33
     O                         ISBAN     39
     O                         IMHN1     46
     O                                   47 '-'
     O                         IMHN2     52
     O                N20                53 '-'
     O                         IMHN3     58
     O                N21                59 '-'
     O                         IMHN4     64
     O                         ISRYO 1   73
     O                                   86 '0'
     O                         ISRYO J   96
     O                         IODRN    109
      *******
     OQPRINT5 E   01           @HED3
     O                         #PGM       8
JW1  O                                   20 'QPRINT5'
JW1  O                         #USER     32
     O                         UDATE Y  110
     O                         @@TIM    120 '  :  :  '
     O                                  124 'P.'
     O                         PAGE1 Z  128
     O        E   02           @HED3
     O                         TTL,2     70
     O        E   03           @HED3
     O                                   62 'KBAN'
     O        E  104           @HED3
     O                                   15 ' SHIP DATE'
     O                                   23 'BIN'
     O                                   34 'SUPPLIER'
     O                                   45 'DELIVERY'
     O                                   53 'DOCK'
     O                                   62 'NUMBER'
     O                                   77 'USER PART NO'
     O                                   97 'QTY'
     O                                  110 'ORDER NO.'
     O        E 1              @DTL3
     O                         INOHZ     16 '    .  .  '
     O                         INOBN     22
     O                         ISIRE     31
     O                                   32 '-'
     O                         ISIRK     33
     O                         INONY     43
     O                         INUKE     53
     O                         ISBAN     61
     O                         IMHN1     70
     O                                   71 '-'
     O                         IMHN2     76
     O                N20                77 '-'
     O                         IMHN3     82
     O                N21                83 '-'
     O                         IMHN4     88
     O                         ISRYO 1   97
     O                         IODRN    112
JW   O                         XNAM10   123
      *******
     OQPRINT6 E   01           @HED4
     O                         #PGM       8
JW1  O                                   20 'QPRINT6'
JW1  O                         #USER     32
     O                         UDATE Y  110
     O                         @@TIM    120 '  :  :  '
     O                                  124 'P.'
     O                         PAGE1 Z  128
     O        E   02           @HED4
     O                         TTL,2     70
     O        E   03           @HED4
     O                                   62 'KANBAN'
     O        E  104           @HED4
     O                                   17 ' SHIP DATE  '
     O                                   23 'BIN'
     O                                   34 'SUPPLIER'
     O                                   43 'DELV'
     O                                   53 'DOCK'
     O                                   62 'NUMBER'
     O                                   77 'USER PART NO'
     O                                   97 'QTY'
     O                                  110 'ORDER NO.'
     O        E 1              @DTL4
     O                         INOHZ     16 '    .  .  '
     O                         INOBN     22
     O                         ISIRE     31
     O                                   32 '-'
     O                         ISIRK     33
     O                         INONY     43
     O                         INUKE     53
     O                         ISBAN     61
     O                         IMHN1     70
     O                                   71 '-'
     O                         IMHN2     76
     O                N20                77 '-'
     O                         IMHN3     82
     O                N21                83 '-'
     O                         IMHN4     88
     O                         ISRYO 1   97
     O                         IODRN    113
JW   O                         XNAM10   124
**
<< FRS ORDER QUANTITY/SHIP DATE CHANGING CHECK LIST >>
<< FRS ORDER DELIVERY DATE ERROR LIST >>
**
OVRPRTF FILE(QPRINT2) OUTQ(SAVEOUTQ) SAVE(*YES)
OVRPRTF FILE(QPRINT6) OUTQ(SAVEOUTQ) SAVE(*YES)
OVRPRTF FILE(QPRINT5) OUTQ(QPRINTB)
OVRPRTF FILE(QPRINT) OUTQ(QPRINTB)
