     H            Y.
     F**************************************************************************
     F*  PROGRAM    : FIX DATA OF FBCPP01 (SALES UNIT PRICE)  2                *
     F*  WRITTEN    : 12/3/2015                                                *
     F*  WRITTEN BY : JW (SRA)                                                 *
     F*  FUNCTION   : CHECK EXP DATE=9999, BUT NOT LAST TRANSACTION            *
     F**************************************************************************
     FFBCPL07 UF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      **************************************************************************
     C                     EXSR @INIT
      *
     C           KEY       SETLLFBCPL07
      *
     C           *IN98     DOWEQ*OFF
     C           KEY       READEFBCPL07                  98
     C           *IN98     IFEQ *OFF
     C           FBSKJY    ANDEQ' '
     C           FBTSHZ    ANDEQ99999999
     C                     MOVELFBTOKU    @CUST
     C                     MOVELFBNONY    @DELV
     C                     CALL 'FBCR72'
     C                     PARM           @CUST   4
     C                     PARM           @DELV   4
     C                     PARM           FBMHN1
     C                     PARM           FBMHN2
     C                     PARM           FBMHN3
     C                     PARM           FBMHN4
     C                     PARM           #EFDAT  8
     C                     PARM           #RTN    1
      *
     C                     MOVEL#EFDAT    @EFDAT  80
     C           #RTN      IFEQ *BLANK
     C           FBTKHZ    ANDNE@EFDAT
     C                     EXSR @PRINT
      * UPDATE
     C           UPDFLG    IFEQ *ON
     C           K#AGDP    KLIST
     C                     KFLD           FBTKYY
     C                     KFLD           FBTKMM
     C                     KFLD           FBTKDD
     C           K#AGDP    CHAINAGDPL12              94
     C  N94                READPAGDPL12                  94
     C  N94                Z-ADDF8KAYY    FBTSYY
     C  N94                Z-ADDF8KAMM    FBTSMM
     C  N94                Z-ADDF8KADD    FBTSDD
     C   94                Z-ADD7777      FBTSYY
     C   94                Z-ADD77        FBTSMM
     C   94                Z-ADD77        FBTSDD
     C                     Z-ADDFBTKYY    FBTSYY
     C                     Z-ADD12        FBTSMM
     C                     Z-ADD31        FBTSDD
     C                     UPDATFBCPL071
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      * FOOT
     C           SEQ#      IFEQ 0
     C                     EXCPT@FOT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           @PRINT    BEGSR
      *
     C                     ADD  1         SEQ#
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           @INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           \CUST   4
     C                     PARM           UPDFLG  1
      *
     C           KEY       KLIST
     C                     KFLD           CUST#   40
      *
     C                     MOVEL\CUST     CUST#
     C                     MOVEL'Y'       FIRST   1
     C                     Z-ADD*DATE     @DATE   80
     C                     TIME           @TIME   60
     C                     Z-ADD0         SEQ#    40
     C*                    MOVE *BLANK    UPDFLG
      *
     C                     EXCPT@HDR
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   60 '** ERROR REPORT **      '
     O                                   99 'DATE'
     O                         @DATE    102 '    .  .  '
     O                         @TIME    112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E   02           @HDR
     O                                   10 'CONDITION:'
     O                                   17 'CUST='
     O                         \CUST     21
     O                                   60 '(EXP DATE S/NOT/B 9999) '
     O        E   03           @HDR
     O                                    5 'SEQ#'
     O                                   10 'CUST'
     O                                   15 'DELV'
     O                                   25 'CUST_PART'
     O                                   48 'EFFECTIV'
     O                                   57 'EXP_DT'
     O                                   66 'UPD_DT'
     O                                   73 'UPD_ID'
     O                                   90 'PRICE'
     O        E 1              @DTL
     O                         SEQ#  Z +001
     O                         FBTOKU  +001
     O                         FBNONY  +001
     O                         FBMHN1  +001
     O                         FBMHN2  +001
     O                         FBMHN3  +001
     O                         FBMHN4  +001
     O                         FBTKHZ  +001
     O                         FBTSHZ  +001
     O                         FBKOYY  +001
     O                         FBKOMM  +000
     O                         FBKODD  +000
     O                         FBKOME  +001
     O                         FBNTAN1 +001
     O        E 1              @FOT
     O                                   20 '** THERE IS NO TARGE'
     O                                   40 'T DATA **           '
