     H            Y.
     F** AB#R6G **********************************
     F*    FORD REMITTANCE ADVICE                *
     F*                                          *
     F*                                          *
     F********************************** AB#R6G **
     FAB#PP6J IF  E                    DISK
     FAB#PP6K IF  E                    DISK
     FAB#PP6L IF  E                    DISK
     FAB#PP6P O   E                    DISK
     FAB#PP6Q O   E                    DISK
     FAB#PP6R O   E                    DISK
      *--------------------------------------------------------
     I            DS
     I                                        1  140D#TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      **********************************************************
     C                     TIME           D#TIME
     C                     MOVE *OFF      *IN90
     C           *IN90     DOUEQ*ON
     C                     READ AB#PP6J                  90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDTODAY     APPRDT
     C                     Z-ADDNOW       APPRTM
     C                     WRITEAB#PP6P1
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *OFF      *IN90
     C           *IN90     DOUEQ*ON
     C                     READ AB#PP6K                  90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDTODAY     APPRDT
     C                     Z-ADDNOW       APPRTM
     C                     WRITEAB#PP6Q1
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *OFF      *IN90
     C           *IN90     DOUEQ*ON
     C                     READ AB#PP6L                  90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDTODAY     ALPRDT
     C                     Z-ADDNOW       ALPRTM
     C                     WRITEAB#PP6R1
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
