     H            Y.
      ** AB#RC2  **************************************************************
      *  IAF PART# DAILY SHIPPED CONTAINER DOWNLOAD                           *
      *  JW   2025.04.22                                                      *
      *************************************************************************
     FAB#PL09 IF  E           K        DISK
     FAB#WPC2 UF  E           K        DISK                      A
     FAB#WPC2BO   E                    DISK
      *------------------------------------------------------------
     I* SYSTEM DATE
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I            DS
     I                                        1   80WFROM
     I                                        1   40WFRYY
     I                                        5   60WFRMM
     I                                        7   80WFRDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN ROUTINE
      *------------------------------------------------------------
     C                     EXSR #INIT
      * READ SALES FILE (AB#PL09)
     C                     MOVELWSHN1     K1SHN1
     C                     MOVELWSHN2     K1SHN2
     C                     MOVELWSHN3     K1SHN3
     C                     Z-ADDWFRYY     K1NOYY
     C                     Z-ADDWFRMM     K1NOMM
     C                     Z-ADDWFRDD     K1NODD
     C           K1PL9A    SETLLAB#PL09
      *
     C                     DO   *HIVAL
      *
     C           K1PL9B    READEAB#PL09                  98
     C   98                LEAVE
      * END
     C           B1NOHZ    IFGT @TO
     C                     LEAVE
     C                     ENDIF
      * IGNORE
     C           B1SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * IGNORE
     C           @NONY     IFNE 0
     C           @NONY     ANDNEB1NONY
     C                     ITER
     C                     ENDIF
      * CHAIN AB#WPC2
     C                     MOVELB1SHIN    K2SHIN
     C                     Z-ADDB1NOHZ    K2NOHZ
     C                     Z-ADDB1NONY    K2NONY
     C                     MOVELB1NKOJ    K2NKOJ
     C                     MOVELB1NUKE    K2NUKE
     C           K2PC2     CHAINAB#WPC2              97
      *
     C           *IN97     IFEQ *OFF
     C                     ADD  B1SRYO    AWSRYO
     C**                   ADD  B1HAKO    AWBOX
     C           B1SYUY    IFEQ 0
     C                     Z-ADD1         BOX     62
     C                     ELSE
     C           B1SRYO    DIV  B1SYUY    BOX
     C                     ENDIF
      * ROUND UP
     C                     ADD  0.09      BOX
     C                     ADD  BOX       AWBOX
      *
     C                     ELSE
     C                     CLEARAB#WPC21
     C                     MOVELB1SHIN    AWSHIN
     C                     Z-ADDB1NOHZ    AWNOHZ
     C                     Z-ADDB1TOKU    AWTOKU
     C                     Z-ADDB1NONY    AWNONY
     C                     MOVELB1NKOJ    AWNKOJ
     C                     MOVELB1NUKE    AWNUKE
     C                     Z-ADDB1SRYO    AWSRYO
     C**                   Z-ADDB1HAKO    AWBOX
     C           B1SYUY    IFEQ 0
     C                     Z-ADD1         BOX     62
     C                     ELSE
     C           B1SRYO    DIV  B1SYUY    BOX
     C                     ENDIF
      * ROUND UP
     C                     ADD  0.09      BOX
     C                     ADD  BOX       AWBOX
      *
     C                     Z-ADDB1SYUY    AWQPC
     C                     ENDIF
      * OUTPUT WORK FILE
     C  N97                UPDATAB#WPC21
     C   97                WRITEAB#WPC21
      *
     C                     ENDDO
      * TRANSFER WORK FILE
     C                     EXSR #TRN
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------------
      * TRANSFER AB#WPC2 --> AB#WPC2B
      *------------------------------------------------------------
     C           #TRN      BEGSR
      * CREATE HEADER
     C                     CLEARAB#WC2B1
     C                     MOVEL'IAF_PART'A2SHIN
     C                     MOVEL'SHP_DATE'A2NOHZ
     C                     MOVEL'CUST#   'A2TOKU
     C                     MOVEL'DELV#   'A2NONY
     C                     MOVEL'FACTORY 'A2NKOJ
     C                     MOVEL'DOCK    'A2NUKE
     C                     MOVEL'SHP_QTY 'A2SRYO
     C                     MOVEL'BOX     'A2BOX
     C                     MOVEL'QPC     'A2QPC
     C                     MOVEL'PGM:AB#R'LTR16  16
     C                     MOVE 'C2      'LTR16
     C                     MOVELLTR16     A2MEMO
     C                     WRITEAB#WC2B1
      * CREATE DELAI
     C           *LOVAL    SETLLAB#WPC2
     C                     DO   *HIVAL
     C                     READ AB#WPC2                  97
     C   97                LEAVE
      *
     C                     CLEARAB#WC2B1
     C                     MOVELAWSHIN    $SHINA
     C                     CALL 'EDTR02'
     C                     PARM           $SHINA 12
     C                     PARM           $SHINB 14
     C                     MOVEL$SHINB    A2SHIN
      *
     C                     MOVELAWNOHZ    $DATE1
     C                     MOVE 'YMD'     $YMD
     C                     MOVE '/'       $SEP
     C                     CALL 'EDTR01A'
     C                     PARM           $DATE1  8
     C                     PARM           $YMD    3
     C                     PARM           $SEP    1
     C                     PARM           $DATE2 10
     C                     MOVEL$DATE2    A2NOHZ
      *
     C                     MOVELAWTOKU    A2TOKU
     C                     MOVELAWNONY    A2NONY
     C                     MOVELAWNKOJ    A2NKOJ
     C                     MOVELAWNUKE    A2NUKE
     C                     MOVELAWSRYO    A2SRYO
     C**                   MOVELAWBOX     A2BOX
      * EDIT DECIMAL
     C           AWBOX     IFNE 0
     C                     Z-ADDAWBOX     $IN
     C                     CALL 'EDTR05A'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     PARM           $RTN    1
     C                     MOVEL$TRUE     A2BOX
     C                     ENDIF
      *
     C                     MOVELAWQPC     A2QPC
     C                     MOVE *BLANK    A2MEMO
     C                     WRITEAB#WC2B1
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------------
      * INITIAL SETTINGS
      *------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $FROM   8
     C                     PARM           $TO     8
     C                     PARM           $NONY   4
     C                     PARM           $SHIN  12
      *
     C                     MOVEL$FROM     WFROM
     C                     MOVEL$FROM     @FROM   80
     C                     MOVEL$TO       @TO     80
     C                     MOVEL$NONY     @NONY   40
     C                     MOVEL$SHIN     WSHIN
      *
     C           K1PL9A    KLIST
     C                     KFLD           K1SHN1  5
     C                     KFLD           K1SHN2  5
     C                     KFLD           K1SHN3  2
     C                     KFLD           K1NOYY  40
     C                     KFLD           K1NOMM  20
     C                     KFLD           K1NODD  20
      *
     C           K1PL9B    KLIST
     C                     KFLD           K1SHN1
     C                     KFLD           K1SHN2
     C                     KFLD           K1SHN3
      *
     C           K2PC2     KLIST
     C                     KFLD           K2SHIN 12
     C                     KFLD           K2NOHZ  80
     C                     KFLD           K2NONY  40
     C                     KFLD           K2NKOJ  1
     C                     KFLD           K2NUKE  4
      *
     C                     ENDSR
