     H            Y.
     F** AB#RF7 ************************************************
     F************************************ AB#RF7 **************
     FABFEP01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FABF9P01 IF  E           K        DISK
     FABFDL01 IF  E           K        DISK
     FABFAP01 IF  E           K        DISK
     FABF2L02 IF  E           K        DISK
     FAB#PL15 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FABFBP10 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     FABWP451 O   E                    DISK
     FAB#PP2W O   E                    DISK
     FABF3P01 O   E                    DISK
     F****************************************************
     E                    P1      1   3 12
     E                    P2      1   3 20
     E                    GRP2    1   2  4
     E****************************************************
     I* RELEASED DATE(PARAMETER)
     I            DS
     I                                        1   8 WRDATE
     I                                        1   80WRDAT
     I                                        1   40WRYYYY
     I                                        5   60WRMMMM
     I                                        7   80WRDDDD
     I* SHIPPING DATE(PARAMETER)
     I            DS
     I                                        1   8 WSDATE
     I                                        1   80WSDAT
     I                                        1   40WSYYYY
     I                                        5   60WSMMMM
     I                                        7   80WSDDDD
     I* TIME
     I            DS
     I                                        1  120WTMDT
     I                                        1   60WTIME
     I                                        7  120WDATE
     I                                        7   80WDAYY
     I                                        9  100WDAMM
     I                                       11  120WDADD
     I            DS
     I                                        1  140STIME
     I                                        1   60NOW
     I                                        7  140TODAY
      * DELETE DATE(YYYYMMDD) PART MASTER
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      * DELIVERY DATE(YYYYMMDD) AB#PP10
     I            DS
     I                                        1   80BANDAT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      * DELIVERY DATE(YYYYMMDD) AB#PP10
     I            DS
     I                                        1   80BADDAT
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
      * LAST SHIPPED DATE(YYMMDD) ABF2L02
     I            DS
     I                                        1   60AFLSDT
     I                                        1   20WFLSDT
     I                                        3   40K64
     I                                        5   60K65
     I* CHANGE DATE(PART MASTER)
     I            DS
     I                                        1   80A2SSHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I* PLANT(ROUTE FILE)
     I            DS
     I                                        1   5 QAPLAN
     I                                        1   5 K11
     I* PART NUMBER(INTERNAL PART=NO BLANKS)
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 WHIN1
     I                                        6  10 WHIN2
     I                                       11  12 WHIN3
     I* PART NUMBER(USER)
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
     I* INVOICE NUMBER(OUT FILE)
     I            DS
     I                                        1   6 WINV#
     I                                        1   3 WINV1
     I                                        4   60WINV2
     I* ROUTE CODE(RIGHT 3 DIGITS)
     I            DS
     I                                        1   4 QAROUT
     I                                        2   4 WROUT
     I* 2WEEKS AGO(CALENDER FILE)
     I            DS
     I                                        1   80F8DATE
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@Y
     I                                        5   60K@M
     I                                        7   80K@D
     I            DS
     I                                        1   80QASKHZ
     I                                        1   40QASKYY
     I                                        5   60QASKMM
     I                                        7   80QASKDD
     I            DS
     I                                        1   80QAEFHZ
     I                                        1   40QAEFYY
     I                                        5   60QAEFMM
     I                                        7   80QAEFDD
     I            DS
     I                                        1   80W@DAT1
     I                                        1   20W@DAT2
     I                                        3   80W@DAT3
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           PRYYYY  40
     C                     PARM           PRMMMM  20
     C                     PARM           PRDDDD  20
     C                     PARM           PSYYYY  40
     C                     PARM           PSMMMM  20
     C                     PARM           PSDDDD  20
     C                     PARM           PSIRE   4
     C                     PARM           PGRP    1
     C                     PARM           PBIN#   20
     C* ABFAP01
     C           KEY1      KLIST
     C                     KFLD           K11              PLANT
     C                     KFLD           K12              DOCK(RECIVING)
     C* ABF2L02
     C           KEY5      KLIST
     C                     KFLD           QAPLAN           PLANT + A
     C                     KFLD           QADOCK           DOCK
     C                     KFLD           K21              INTERNAL PART
     C                     KFLD           CFSIDT           SCHEDULE CRT DATE
     C                     KFLD           CFPOR#           ORDER #
     C                     KFLD           CFREF#           REFERENCE #
     C* ABF2L02
     C           KEY2      KLIST
     C                     KFLD           QAPLAN           PLANT + A
     C                     KFLD           QADOCK           DOCK
     C                     KFLD           K21              INTERNAL PART
     C                     KFLD           CFSIDT           SCHEDULE CRT DATE
     C                     KFLD           CFPOR#           ORDER #
     C                     KFLD           CFREF#           REFERENCE #
     C                     KFLD           K22              SHIP DATE
     C           KEY21     KLIST
     C                     KFLD           QAPLAN           PLANT + A
     C                     KFLD           QADOCK           DOCK
     C                     KFLD           K21              INTERNAL PART
     C                     KFLD           CFSIDT           SCHEDULE CRT DATE
     C                     KFLD           CFPOR#           ORDER #
     C                     KFLD           CFREF#           REFERENCE #
     C* ABFEP01
     C           KEY3      KLIST
     C                     KFLD           WSYYYY           SHIP YYYY
     C                     KFLD           WSMMMM                MMMM
     C* FCEPL01
     C           KEY4      KLIST
     C                     KFLD           WHIN1            INTERNAL PART
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C* AB#PL15
     C           KEY7      KLIST
     C                     KFLD           K61              BATOKU
     C                     KFLD           QANONY             NONY
     C                     KFLD           WNKOJ              NKOJ
     C                     KFLD           @NUKE   4        BANUKE
     C                     KFLD           WMHN1              MHN1
     C                     KFLD           WMHN2              MHN2
     C                     KFLD           WMHN3            BAMHN3
     C                     KFLD           WMHN4              MHN4
     C                     KFLD           WODRN              ODRN
     C* AB#PL15
     C           KEY6      KLIST
     C                     KFLD           K61              BATOKU
     C                     KFLD           QANONY             NONY
     C                     KFLD           WNKOJ              NKOJ
     C                     KFLD           @NUKE            BANUKE
     C                     KFLD           WMHN1              MHN1
     C                     KFLD           WMHN2              MHN2
     C                     KFLD           WMHN3            BAMHN3
     C                     KFLD           WMHN4              MHN4
     C                     KFLD           WODRN              ODRN
     C                     KFLD           K63     40       BANOYY
     C                     KFLD           K64                NOMM
     C                     KFLD           K65                NODD
     C                     KFLD           K62              BANOBN
     C* AGDPL11
     C           KEY8      KLIST
     C                     KFLD           WRYYYY           SHIP YYYY
     C                     KFLD           WRMMMM                MMMM
     C                     KFLD           WRDDDD                DDDD
     C           K#AGD     KLIST
     C                     KFLD           K@Y              SHIP YYYY
     C                     KFLD           K@M                   MMMM
     C                     KFLD           K@D                   DDDD
      *
     C           K#ADF     KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@DOCK
     C           K#GAD     KLIST
     C                     KFLD           @TOKU
     C                     KFLD           QANONY
     C                     KFLD           WNKOJ
      *
     C           *LIKE     DEFN QANONY    K@NONY
     C           *LIKE     DEFN QADOCK    K@DOCK
      *
     C           PSIRE     IFNE *BLANK
     C                     MOVE PSIRE     @@NONY  40
     C                     ELSE
     C                     Z-ADD*ZERO     @@NONY
     C                     ENDIF
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
      *
     C                     EXSR #LOG
      *
     C                     EXSR @END
     C***********************************************************
     C* INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     TIME           WTMDT
     C                     TIME           STIME
     C                     Z-ADD0         RCNT    40       ORDER REC
     C*
     C                     Z-ADD*ZERO     WQTY2  100
     C                     Z-ADD*ZERO     WQTY3  100
     C                     Z-ADD*ZERO     WSUMQ  100
     C                     Z-ADD*ZERO     WODRQ  100
     C                     SETON                     OF
     C*
     C                     Z-ADDPRYYYY    WRYYYY
     C                     Z-ADDPRMMMM    WRMMMM
     C                     Z-ADDPRDDDD    WRDDDD
     C                     Z-ADDPSYYYY    WSYYYY
     C                     Z-ADDPSMMMM    WSMMMM
     C                     Z-ADDPSDDDD    WSDDDD
     C*
     C* NOT WORKING DAY?
     C           WRDATE    IFNE WSDATE
     C                     SETON                     89
     C                     END
     C*
     C* GET THE DATE OF 2WEEKS AGO
     C                     Z-ADD*ZERO     @CNT    20
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETLLAGDPL11
     C           *IN97     DOUEQ*ON
     C                     READPAGDPL11                  97
     C           *IN97     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         @CNT
     C           @CNT      IFEQ 7
     C                     Z-ADDF8DATE    @@STDT  80
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           KEY8      SETLLAGDPL111
     C                     DO   14
     C                     READPAGDPL111                 97
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* MAIN
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C* NIRVANA PLANT EXISTS IN ROUTE MASTER
     C* READ AND PROCESS ALL ROUTE MASTER RECORD
     C           *LOVAL    SETLLABFDL01R
B1   C           *IN90     DOUEQ*ON
     C                     READ ABFDL01R                 90
     C   90                LEAVE
      *
     C           @@NONY    IFEQ *ZERO
     C*
     C           PGRP      IFEQ '3'
     C           QANONY    IFEQ 5120
     C           QANONY    OREQ 5100
     C           QANONY    OREQ 5111
     C           QANONY    OREQ 5115
     C           QANONY    OREQ 5130
     C           QANONY    OREQ 5118
     C           QANONY    OREQ 5140
     C           QANONY    OREQ 5135
     C           QANONY    OREQ 5102
     C           QANONY    OREQ 5141
     C           QANONY    OREQ 5119
     C           QANONY    OREQ 5116
     C           QANONY    OREQ 5114
     C           QANONY    OREQ 5121
     C           QANONY    OREQ 5138
     C           QANONY    OREQ 5113
     C           QANONY    OREQ 5112
     C           QANONY    OREQ 5166
     C           QANONY    OREQ 5129
     C                     ELSE
     C                     ITER
     C                     END
     C                     END
     C*
     C                     MOVELQANONY    W@A004  4
     C           W@A004    LOKUPGRP2                     87
     C           PGRP      IFEQ '1'
     C           *IN87     ANDEQ*ON
     C                     ITER
     C                     END
     C           PGRP      IFEQ '2'
     C           *IN87     ANDEQ*OFF
     C                     ITER
     C                     END
     C*
     C                     ELSE
     C*
     C           @@NONY    IFNE QANONY
     C                     ITER
     C                     END
     C*
     C                     END
      *
     C                     Z-ADDQANONY    K@NONY
     C                     MOVE QADOCK    K@DOCK
      *
     C           K#ADF     SETGTABFDL01R
B2   C           *IN88     DOUEQ*ON
     C           K#ADF     REDPEABFDL01R                 88
B3   C           *IN88     IFEQ *ON
     C           K#ADF     SETGTABFDL01R
     C                     LEAVE
     C                     ELSE
B4   C           QASKJY    IFEQ 'D'
     C           QASKHZ    ANDLE*DATE
     C                     ITER
E4   C                     ENDIF
B4   C           QAEFHZ    IFGT *DATE
     C                     ITER
E4   C                     ENDIF
     C*
     C* SET ROUTE CODE TO INVOICE#
     C                     MOVE WROUT     WINV1
     C*
     C* READ ADDRESS MASTER
     C           QAPLAN    CHAINABF9P01              93
B4   C           *IN93     IFEQ '1'
     C   OF                EXCPT#HED1
     C   OF                SETOF                     OF
     C                     EXCPT#DTL1
     C                     SETON                     U2
E4   C                     END
     C*
     C* READ EDI KEY FILE
     C                     MOVELQADOCK    K12     4
     C           KEY1      SETLLABFAP01R
     C           KEY1      READEABFAP01R                 91
B4   C           *IN91     DOWEQ'0'
     C*
B5   C           CFDLCD    IFEQ *BLANK
     C           CFSIDT    ANDGE@@STDT
     C* READ FORD EDI FILE
     C                     CLEARK21
     C                     MOVELCFPART    K21    20
     C                     Z-ADD1         WW      10
     C           CFPART    LOKUPP1,WW                    10
     C   10                MOVELP2,WW     K21
      *
     C                     Z-ADDWRDAT     K22     80
     C           KEY2      CHAINABF2P011             92
      *
B6   C           *IN92     IFEQ *ON
     C           KEY2      SETLLABF2P011
     C           KEY21     REDPEABF2P011                 92
E6   C                     ENDIF
      *
B6   C           *IN92     IFEQ '0'
     C*
     C* SET AB#WP451(INPUT FILE FOR AB#R45)
     C                     MOVE 'AVRT'    WSIRE   4        SUPPLIER CODE
     C                     MOVE 'A'       WSIRK   1        FACTORY  CODE
     C                     MOVE '5149'    WTOKU   4        CUSTOMER CODE
     C                     MOVE 5149      @TOKU   40       CUSTOMER CODE
     C                     MOVE QANONY    WNONY   4        DELIVERY CODE
     C                     MOVE '0'       WNKOJ   1        FACTORY  CODE
     C                     MOVELQADOCK    WNUKE   4        RECEIVING   E
     C                     MOVE *BLANK    WSBAN   4        NUMBER      E
     C                     MOVE *BLANK    WMHIN
     C                     MOVELAFIPAR    WMHIN            PART NUMBER E
     C                     Z-ADDWSDAT     WNYMD   80       DELIVERY DATE
     C                     MOVEL'11111'   WODRN  10        ORDER #     E
     C           PBIN#     IFNE *ZERO
     C                     MOVELPBIN#     WBIN
     C                     ELSE
     C           QAROUT    CHAINABFBP10              95
B7   C           *IN95     IFEQ *OFF
     C                     MOVE B1BINN    WBIN    2
     C                     ELSE
     C                     MOVE '06'      WBIN
E7   C                     ENDIF
     C                     END
      *
     C                     Z-ADD99        K62     20       BIN
     C*
     C                     EXSR @SUM
     C*
     C* NOT WORKING DAY,RE-CULUCULATE
B7   C           *IN89     IFEQ '1'
     C           AFQTY2    SUB  AFYSQY    WQTY2            ORDERED QTY
     C                     SUB  WODRQ     WQTY2
     C                     MOVE WQTY2     WSURY   7
     C*
     C                     ELSE
     C*
     C* REQUESTED CUM - SHIPPED CUM
     C           AFQTY2    SUB  AFYSQY    WQTY2            ORDERED QTY
     C                     SUB  WODRQ     WQTY2
     C                     MOVE WQTY2     WSURY   7
E7   C                     END
     C*
B7   C           WQTY2     IFGT *ZERO
     C*
     C***** GET UNIT QUANTITY
     C                     MOVELWTOKU     PTOKU   4
     C                     MOVELWNONY     PNONY   4
     C                     MOVELWNKOJ     PNKOJ   1
     C                     MOVELWNUKE     PNUKE   4
     C                     MOVELWMHIN     @MHIN  20
     C                     MOVELWMHIN     WMHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
     C*
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU
     C                     PARM           PNONY
     C                     PARM           PNKOJ
     C                     PARM           PNUKE
     C                     PARM           @MHIN
     C                     PARM           @SHIN
     C                     PARM           @FLG
     C*
     C* GET QTY./CONT. FROM PART MASTER
     C                     Z-ADD*ZERO     WSYOS            FOR ERROR
     C           KEY4      SETLLFCEPL011
     C           #READ1    TAG
     C           KEY4      READEFCEPL011                 94
B8   C           *IN94     IFEQ '0'
B9   C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO #READ1
     C*
     C                     ELSE
     C*
B10  C           A2SSHZ    IFLE *DATE
     C                     Z-ADDA2SSYS    WSYOS   60
     C                     ELSE
     C                     Z-ADDA2KSYS    WSYOS
E10  C                     END
     C*
E9   C                     END
     C*
     C                     ELSE
     C   OF                EXCPT#HED1
     C   OF                SETOF                     OF
     C                     EXCPT#DTL2
     C                     SETON                     U2
E8   C                     END
     C*
     C* CHECK FRACTION OR NOT
B8   C           WSYOS     IFNE *ZERO
     C           WQTY2     DIV  WSYOS     WQTY2
     C                     MVR            WREST   40
B9   C           WREST     IFNE *ZERO
     C   OF                EXCPT#HED1
     C   OF                SETOF                     OF
     C                     EXCPT#DTL3
     C                     SETON                     U2
E9   C                     END
     C*
E8   C                     END
     C*
     C                     Z-ADD*ZERO     WNOTM   40       INVOICE TIME
     C                     Z-ADD*ZERO     WUSYS   60       USER QTY/CONT.
     C                     MOVELAFALFL    WALFL   4        FEED LINE
     C*
     C* GET INVOICE NUMBER(ROUTE + JULIAN DATE)
     C           KEY3      CHAINABFEP01              95
B8   C           *IN95     IFEQ '0'
     C           QB#DAY    ADD  WSDDDD    WINV2
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     WINV2
E8   C                     END
     C*
     C                     MOVELAFRALF    WRLOC   4
     C                     Z-ADD20        W@DAT2
     C                     Z-ADDAFDATE    W@DAT3
     C                     MOVELW@DAT1    WCRTDT
      * ADJUST
XX   C                     MOVELWSURY     NUM7    70
XX   C           NUM7      IFGT 10
     C                     WRITEABWP451R
     C                     SETON                     U1
      *
     C                     ADD  1         RCNT
     C                     Z-ADDTODAY     F3PRHZ
     C                     Z-ADDNOW       F3PRTM
     C                     MOVEL#USER     F3PRUS
     C                     MOVEL#PGM      F3PRPG
     C                     MOVEL#WSID     F3PRWS
     C                     MOVELWTOKU     XTOKU
     C                     MOVELWNONY     XNONY
     C                     MOVELWSURY     XSURY
     C                     MOVELWBIN      XBIN
     C                     WRITEABF3P011
XX   C                     ENDIF
      *
E7   C                     END
     C*
X6   C                     ELSE
B7   C           F8DATE    IFLE CFSIDT
     C   OF                EXCPT#HED1
     C   OF                SETOF                     OF
     C                     EXCPT#DTL4
     C                     SETON                     U2
E7   C                     END
E6   C                     END
      *
E5   C                     ENDIF
     C           KEY1      READEABFAP01R                 91
E4   C                     ENDDO
     C*
     C           K#ADF     SETGTABFDL01R
     C                     LEAVE
E3   C                     ENDIF
E2   C                     ENDDO
      *
E1   C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
     C* SUM (SUMMARY ALREADY ORDERED DATA)
     C***********************************************************
     C           @SUM      BEGSR
     C*
     C                     Z-ADD5149      K61     40
     C                     Z-ADD*ZERO     WODRQ
     C                     Z-ADD2000      K63
     C           AFLSDT    IFEQ *ZERO
     C                     ADD  WDAYY     K63
     C                     ELSE
     C                     ADD  WFLSDT    K63
     C                     END
     C                     MOVELQADOCK    @NUKE   4        RECEIVING   E
     C                     EXSR @SUM2
     C*
     C           K#GAD     SETLLGADPL11
     C           *IN97     DOUEQ*ON
     C           K#GAD     READEGADPL11                  97
     C           *IN97     IFEQ *OFF
     C           B5NUKE    ANDNEQADOCK
     C           B5SKJY    ANDEQ' '
     C                     MOVE B5NUKE    @NUKE
     C                     EXSR @SUM2
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
     C* SUM (SUMMARY ALREADY ORDERED DATA)
     C***********************************************************
     C           @SUM2     BEGSR
     C*
     C           KEY6      SETGTAB#PL151
     C           KEY7      READEAB#PL151                 96
     C           *IN96     DOWEQ'0'
     C           BANDAT    ANDLTWRDAT
     C* %0001
     C           BANDAT    IFEQ 20160827
     C           BADDAT    ANDEQ20160828
     C           AFLSDT    ANDEQ160826
     C                     GOTO #READ2
     C                     ENDIF
     C           BANDAT    IFEQ 20160910
     C           BADDAT    ANDEQ20160911
     C           AFLSDT    ANDEQ160909
     C                     GOTO #READ2
     C                     ENDIF
     C*
     C           BASKJY    IFEQ ' '
     C                     ADD  BASRYO    WODRQ
     C                     END
     C*
     C           #READ2    TAG
     C           KEY7      READEAB#PL151                 96
     C                     END
      *
     C                     ENDSR
     C***********************************************************
     C* SAVE PRARAMETER
     C***********************************************************
     C           #LOG      BEGSR
     C*
     C                     CLEARAB#PP2W1
     C                     Z-ADDTODAY     P2CRHZ
     C                     Z-ADDWTIME     P2CRTM
     C                     MOVEL#USER     P2CRUS
     C                     MOVEL#WSID     P2CRWS
     C                     MOVEL#PGM      P2CRPG
     C                     MOVELPSIRE     P2SIRE
     C                     MOVEL'6 '      P2SEL
     C                     Z-ADDWRDAT     P2RLHZ
     C                     Z-ADDWSDAT     P2NOHZ
     C                     MOVELPGRP      P2GRP
     C                     Z-ADDPBIN#     P2BIN
     C                     Z-ADDRCNT      P2REC#
     C                     WRITEAB#PP2W1
     C*
     C                     ENDSR
     C***********************************************************
     C* END
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
     OQPRINT  E    2           #HED1
     O       OR        OF
     O                                    9 'AB#RF7F1'
     O                                   32 'FORD NIRVANA  DATA'
     O                                   43 'ERROR LIST'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                         #USER     10
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O*
     O        E 1              #HED1
     O       OR        OF
     O                                   21 'ERROR MESSAGE       '
     O                                   46 'PLANT'
     O                                   51 'DOCK'
     O                                   66 '   PART        '
     O                                   76 'ISSUED  '
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E 1              #HED1
     O       OR        OF
     O                                   21 '--------------------'
     O                                   41 '------------------  '
     O                                   46 '-----'
     O                                   51 '--- '
     O                                   66 '   ------------'
     O                                   76 '--------'
     O*
     O        E 1              #DTL1
     O                                   21 'PLANT NOT FOUND IN A'
     O                                   41 'DDRESS MASTER!      '
     O                         QAPLAN    46
     O*
     O        E 1              #DTL2
     O                                   21 'QTY/BOX ERROR (PART '
     O                                   41 'MASTER NOT EXIST)!  '
     O                         QAPLAN    46
     O                         QADOCK    51
     O                         CFPART    66
     O*
     O        E 1              #DTL3
     O                                   21 'ORDER QTY IS NOT FUL'
     O                                   41 'L BOX QTY!          '
     O                         QAPLAN    46
     O                         QADOCK    51
     O                         CFPART    66
     O                                   90 'ORDER QTY:'
     O                         WSURY     99
     O                                  108 'QTY/BOX:'
     O                         WSYOS 1  117
     O*
     O        E 1              #DTL4
     O                                   21 'ORDER ISSUE DATE IS '
     O                                   41 'NOT BEFORE 14 DAYS! '
     O                         QAPLAN    46
     O                         QADOCK    51
     O                         CFPART    66
     O                         CFSIDT    76
     O                         CFPOR#    86
     O                         WSDATE    96
     O                                  111 'RELEASED DATE:'
     O                         WRDATE   119
**
W500214S437K
W500214S439K
W500100S300K
**
W500214S437KIT
W500214S439KIT
W500100S300KIT
** GRP2
5164
5173
