     H            Y/
     H** AB#R6Q **************************************************
     H* CONVERT AB#WP6V4 TO AB#WP6V6
     H* JW     2021.11.05
     H************************************************************
     FAB#WP6V4IF  E           K        DISK                           UC
     FAB#PL1E IF  E           K        DISK
     FAB#WL6V6IF  E           K        DISK
     FAB#WP6V6O   E           K        DISK
     FAB#WP6V7O   E           K        DISK
JW1  FUEXWP38 IF  E           K        DISK
     H************************************************************
     E                    TTL     1   5 60
      *
     E                    @TF        13  4 0
     E                    @TT        13  4 0
     E                    C6A        13 10
     E                    C6B        13 10
     E                    C6Q        14  4 0
      * DAY1
JW1  E                    $BA        13  2
 .   E                    $FA        13  4 0
 .   E                    $TA        13  4 0
      * DAY2
JW1  E                    $BB        13  2
 .   E                    $FB        13  4 0
 .   E                    $TB        13  4 0
      * TABLE BIN#
     I**          DS
     I**                                      1  22 #BN
     I**                                      1   2 #BN01
     I**                                      3   4 #BN02
     I**                                      5   6 #BN03
     I**                                      7   8 #BN04
     I**                                      9  10 #BN05
     I**                                     11  12 #BN06
     I**                                     13  14 #BN07
     I**                                     15  16 #BN08
     I**                                     17  18 #BN09
     I**                                     19  20 #BN10
     I**                                     21  22 #BN11
      * TABLE FROM
     I            DS
     I                                        1  520@TF
     I                                        1   40@TF01
     I                                        5   80@TF02
     I                                        9  120@TF03
     I                                       13  160@TF04
     I                                       17  200@TF05
     I                                       21  240@TF06
     I                                       25  280@TF07
     I                                       29  320@TF08
     I                                       32  360@TF09
     I                                       36  400@TF10
     I                                       41  440@TF11
     I                                       45  480@TF12
     I                                       49  520@TF13
     I            DS
     I                                        1  520@TT
     I                                        1   40@TT01
     I                                        5   80@TT02
     I                                        9  120@TT03
     I                                       13  160@TT04
     I                                       17  200@TT05
     I                                       21  240@TT06
     I                                       25  280@TT07
     I                                       29  320@TT08
     I                                       32  360@TT09
     I                                       36  400@TT10
     I                                       41  440@TT11
     I                                       45  480@TT12
     I                                       49  520@TT13
JW1   * TABLE BIN# (DAY1)
 .   I            DS
 .   I                                        1  26 $BA
 .   I                                        1   2 $BA01
     I                                        3   4 $BA02
     I                                        5   6 $BA03
     I                                        7   8 $BA04
     I                                        9  10 $BA05
     I                                       11  12 $BA06
     I                                       13  14 $BA07
     I                                       15  16 $BA08
     I                                       17  18 $BA09
     I                                       19  20 $BA10
     I                                       21  22 $BA11
     I                                       23  24 $BA12
     I                                       25  26 $BA13
JW1   * TABLE BIN# (DAY2)
 .   I            DS
 .   I                                        1  26 $BB
 .   I                                        1   2 $BB01
     I                                        3   4 $BB02
     I                                        5   6 $BB03
     I                                        7   8 $BB04
     I                                        9  10 $BB05
     I                                       11  12 $BB06
     I                                       13  14 $BB07
     I                                       15  16 $BB08
     I                                       17  18 $BB09
     I                                       19  20 $BB10
     I                                       21  22 $BB11
     I                                       23  24 $BB12
     I                                       25  26 $BB13
JW1   * TABLE FROM (DAY1)
 .   I            DS
 .   I                                        1  520$FA
 .   I                                        1   40$FA01
     I                                        5   80$FA02
     I                                        9  120$FA03
     I                                       13  160$FA04
     I                                       17  200$FA05
     I                                       21  240$FA06
     I                                       25  280$FA07
     I                                       29  320$FA08
     I                                       32  360$FA09
     I                                       36  400$FA10
     I                                       41  440$FA11
     I                                       45  480$FA12
     I                                       49  520$FA13
JW1   * TABLE FROM (DAY2)
 .   I            DS
 .   I                                        1  520$FB
 .   I                                        1   40$FB01
     I                                        5   80$FB02
     I                                        9  120$FB03
     I                                       13  160$FB04
     I                                       17  200$FB05
     I                                       21  240$FB06
     I                                       25  280$FB07
     I                                       29  320$FB08
     I                                       32  360$FB09
     I                                       36  400$FB10
     I                                       41  440$FB11
     I                                       45  480$FB12
     I                                       49  520$FB13
JW1   * TABLE TO (DAY1)
 .   I            DS
 .   I                                        1  520$TA
 .   I                                        1   40$TA01
     I                                        5   80$TA02
     I                                        9  120$TA03
     I                                       13  160$TA04
     I                                       17  200$TA05
     I                                       21  240$TA06
     I                                       25  280$TA07
     I                                       29  320$TA08
     I                                       32  360$TA09
     I                                       36  400$TA10
     I                                       41  440$TA11
     I                                       45  480$TA12
     I                                       49  520$TA13
JW1   * TABLE TO (DAY2)
 .   I            DS
 .   I                                        1  520$TB
 .   I                                        1   40$TB01
     I                                        5   80$TB02
     I                                        9  120$TB03
     I                                       13  160$TB04
     I                                       17  200$TB05
     I                                       21  240$TB06
     I                                       25  280$TB07
     I                                       29  320$TB08
     I                                       32  360$TB09
     I                                       36  400$TB10
     I                                       41  440$TB11
     I                                       45  480$TB12
     I                                       49  520$TB13
      * 1ST DAY TABLE
     I            DS
     I                                        1 130 C6A
     I                                        1  10 C6Q01A
     I                                       11  20 C6Q02A
     I                                       21  30 C6Q03A
     I                                       31  40 C6Q04A
     I                                       41  50 C6Q05A
     I                                       51  60 C6Q06A
     I                                       61  70 C6Q07A
     I                                       71  80 C6Q08A
     I                                       81  90 C6Q09A
     I                                       91 100 C6Q10A
     I                                      101 110 C6Q11A
     I                                      111 120 C6Q12A
     I                                      121 130 C6Q13A
      * 2ND DAY TABLE
     I            DS
     I                                        1 130 C6B
     I                                        1  10 C6Q01B
     I                                       11  20 C6Q02B
     I                                       21  30 C6Q03B
     I                                       31  40 C6Q04B
     I                                       41  50 C6Q05B
     I                                       51  60 C6Q06B
     I                                       61  70 C6Q07B
     I                                       71  80 C6Q08B
     I                                       81  90 C6Q09B
     I                                       91 100 C6Q10B
     I                                      101 110 C6Q11B
     I                                      111 120 C6Q12B
     I                                      121 130 C6Q13B
     I            DS
     I                                        1   4 #FROM
     I                                        1   2 #FROM1
     I                                        3   4 #FROM2
     I            DS
     I                                        1   5 @FROM
     I                                        1   2 @FROM1
     I                                        3   3 @C
     I                                        4   5 @FROM2
     I            DS
     I                                        1   7 LTR7
     I                                        2   7 LTR6
     I            DS
     I                                        1  14 CSSHIN
     I                                        1   5 C@SHN1
     I                                        6   6 PF1
     I                                        7  11 C@SHN2
     I                                       12  12 PF2
     I                                       13  14 C@SHN3
      *
     I            DS
     I                                        1  60 C#SHN
     I                                        1   5 C#SHN1
     I                                        6  10 C#SHN2
     I                                       11  12 C#SHN3
     I                                       13  60 C#SHN4
      *
     I            DS
     I                                        1  12 K#SHN
     I                                        1   5 K#SHN1
     I                                        6  10 K#SHN2
     I                                       11  12 K#SHN3
      *
     I            DS
     I                                        1  12 BASHIN
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
      *
     I            DS
     I                                        1   80K#NOHZ
     I                                        1   40K#NOYY
     I                                        5   60K#NOMM
     I                                        7   80K#NODD
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  26 #HEAD
AS OFI                                        1   8 #HEAD1
DATE I                                        9  19 #HEAD2
TIME I                                       20  24 #HEAD3
TIME I                                       25  26 #HEAD4
     I            DS
     I                                        1  10 #DATE
     I                                        1   4 #DATEY
     I                                        5   5 #DATE1
     I                                        6   7 #DATEM
     I                                        8   8 #DATE2
     I                                        9  10 #DATED
      *
     I            DS
     I                                        1   5 #TIME
     I                                        1   2 #TIMEH
     I                                        3   3 #TIME1
     I                                        4   5 #TIMEM
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        1   20NOWH
     I                                        3   40NOWM
     I                                        7  100TODYY
     I                                       11  120TODMM
     I                                       13  140TODDD
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------
      *          MAIN ROUTINE
      *--------------------------------------------------
     C                     EXSR #INIT
      *
     C                     OPEN AB#WP6V4
     C                     DO   *HIVAL
     C                     READ AB#WP6V4                 98
     C   98                LEAVE
      * CONVERSION
     C                     EXSR #CONV
     C                     ENDDO
     C                     CLOSEAB#WP6V4
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
      * CONVERT AB#WP6V4
      *--------------------------------------------------
     C           #CONV     BEGSR
      *
     C                     CLEARAB#WPV61
     C                     MOVELCSLOC     C6LOC     P
     C                     MOVELCSSHN1    LTR7
     C                     MOVELLTR6      C@SHN1
     C                     MOVELCSSHN2    LTR7
     C                     MOVELLTR6      C@SHN2
     C                     MOVELCSSHN3    C@SHN3
      * EDIT PART
     C           C@SHN2    IFEQ *BLANK
     C                     MOVE *BLANK    PF1
     C                     ELSE
     C                     MOVE '-'       PF1
     C                     ENDIF
     C           C@SHN3    IFEQ *BLANK
     C                     MOVE *BLANK    PF2
     C                     ELSE
     C                     MOVE '-'       PF2
     C                     ENDIF
     C                     MOVELCSSHIN    C6SHIN    P
     C                     MOVELCSUNS     C6UNS     P
     C                     MOVELCSICNT    C6ICNT    P
     C                     MOVELCSDAY1    C6DAY1    P
     C                     MOVELCSSRT#    C6SRT#    P
     C                     MOVELCSSRT     C6SRT     P
     C                     MOVELCSSRTX    C6SRTX    P
     C                     MOVELCSPRC     C6PRC     P
     C                     MOVELCSMCN     C6MCN     P
     C                     MOVELCSAF      C6AF      P
     C                     MOVELCSAFX     C6AFX     P
     C                     MOVELCSIN      C6IN      P
     C                     MOVELCSINX     C6INX     P
     C                     MOVELCSBF      C6BF      P
     C                     MOVELCSBFX     C6BFX     P
     C                     MOVELCSCVP     C6CVP     P
     C                     MOVELCSCVPX    C6CVPX    P
     C                     MOVELCSICN2    C6ICN2    P
     C                     MOVELCSDAY2    C6DAY2    P
      * ADOID AB#WP6V6 DUPLICATE
     C                     MOVELCSSHIN    LTR60  60 P
     C           LTR60     CHAINAB#WL6V6             99
     C           *IN99     IFEQ *ON
     C                     EXSR #DTL1
     C                     EXSR #DTL2
     C                     ELSE
     C                     MOVE *ALL' '   C6A
     C                     MOVE *ALL' '   C6A
     C                     MOVE *BLANK    C6Q14A
     C                     MOVE *BLANK    C6Q14B
     C                     ENDIF
      *
     C                     WRITEAB#WPV61
      *
     C                     ENDSR
      *--------------------------------------------------
      * GET UNSCAN SUBTOTAL (1ST DAY)
      *--------------------------------------------------
     C           #DTL1     BEGSR
      *
     C                     Z-ADD0         C6Q
      *
     C                     MOVELC@SHN1    K#SHN1
     C                     MOVELC@SHN2    K#SHN2
     C                     MOVELC@SHN3    K#SHN3
     C                     Z-ADDTODAY     K#NOHZ
     C           K#PL1E    SETLLAB#PL1E
     C                     DO   *HIVAL
     C           K#PL1E    READEAB#PL1E                  97
     C   97                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           BATOKU    IFNE 3411
     C                     ITER
     C                     ENDIF
      * GET UNSCAN QTY
     C                     MOVELBANONY    $NONY
     C                     MOVELBANKOJ    $NKOJ
     C                     MOVELBANUKE    $NUKE
     C                     MOVELBANOHZ    $NOHZ
     C                     MOVELBANOBN    $NOBN
     C                     MOVELBASHIN    $SHIN
     C                     MOVELBAODRN    $ODRN
     C                     CALL 'UEXR21B'
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $NOBN   2
     C                     PARM           $SHIN  12
     C                     PARM           $ODRN  10
     C                     PARM           $UNS    5
     C                     PARM           $RTN    1
     C                     MOVEL$UNS      @UNS    50
      * OUT AB#WP6V7
     C                     Z-ADD@UNS      BARCOD
     C                     WRITEAB#WPV71
      *
     C           @UNS      IFEQ 0
     C                     ITER
     C                     ENDIF
JW1   * SET TIME TABLE
 .   C**                   EXSR #TBL1
      * ADD UP TO BIN TABLE
     C                     Z-ADD1         IX
     C           $NOBN     LOKUP$BA,IX                   20
     C           *IN20     IFEQ *ON
     C                     ADD  @UNS      C6Q,IX
     C                     ELSE
     C                     EXSR #SHPT1
     C                     ADD  @UNS      C6Q,IZ           OTHER
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ALL' '   C6A
      *
     C           1         DO   13        IX      20
     C           C6Q,IX    IFNE 0
     C                     MOVELC6Q,IX    C6A,IX
     C                     ENDIF
     C                     ENDDO
     C           C6Q,14    IFNE 0
     C                     MOVELC6Q,14    C6Q14A
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * GET UNSCAN SUBTOTAL (2ND DAY)
      *--------------------------------------------------
     C           #DTL2     BEGSR
      *
     C                     Z-ADD0         C6Q
      *
     C                     MOVELC@SHN1    K#SHN1
     C                     MOVELC@SHN2    K#SHN2
     C                     MOVELC@SHN3    K#SHN3
     C                     MOVEL$TGT8     K#NOHZ
     C           K#PL1E    SETLLAB#PL1E
     C                     DO   *HIVAL
     C           K#PL1E    READEAB#PL1E                  97
     C   97                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           BATOKU    IFNE 3411
     C                     ITER
     C                     ENDIF
      * GET UNSCAN QTY
     C                     MOVELBANONY    $NONY
     C                     MOVELBANKOJ    $NKOJ
     C                     MOVELBANUKE    $NUKE
     C                     MOVELBANOHZ    $NOHZ
     C                     MOVELBANOBN    $NOBN
     C                     MOVELBASHIN    $SHIN
     C                     MOVELBAODRN    $ODRN
     C                     CALL 'UEXR21B'
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $NOHZ   8
     C                     PARM           $NOBN   2
     C                     PARM           $SHIN  12
     C                     PARM           $ODRN  10
     C                     PARM           $UNS    5
     C                     PARM           $RTN    1
     C                     MOVEL$UNS      @UNS    50
      * OUT AB#WP6V7
     C                     Z-ADD@UNS      BARCOD
     C                     WRITEAB#WPV71
      *
     C           @UNS      IFEQ 0
     C                     ITER
     C                     ENDIF
JW1   * SET TIME TABLE
 .   C**                   EXSR #TBL2
      * ADD UP TO BIN TABLE
     C                     Z-ADD1         IX
     C           $NOBN     LOKUP$BB,IX                   20
     C           *IN20     IFEQ *ON
     C                     ADD  @UNS      C6Q,IX
     C                     ELSE
     C                     EXSR #SHPT2
     C                     ADD  @UNS      C6Q,IZ
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ALL' '   C6B
      *
     C           1         DO   13        IX      20
     C           C6Q,IX    IFNE 0
     C                     MOVELC6Q,IX    C6B,IX
     C                     ENDIF
     C                     ENDDO
      *
     C           C6Q,14    IFNE 0
     C                     MOVELC6Q,14    C6Q14B
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * GET BIN TABLE FROM SHIP TIME (DAY1)
      *--------------------------------------------------
     C           #SHPT1    BEGSR
      *
     C           BANOTM    IFEQ 0
     C           BANOBN    ANDGE20
     C                     Z-ADD14        IZ
     C                     ELSE
      *
     C                     Z-ADD14        IZ      20
     C           1         DO   13        IX
     C           BANOTM    IFGE $FA,IX
     C           BANOTM    ANDLE$TA,IX
     C                     Z-ADDIX        IZ
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * GET BIN TABLE FROM SHIP TIME (DAY2)
      *--------------------------------------------------
     C           #SHPT2    BEGSR
      *
     C           BANOTM    IFEQ 0
     C           BANOBN    ANDGE20
     C                     Z-ADD14        IZ
     C                     ELSE
      *
     C                     Z-ADD14        IZ      20
     C           1         DO   13        IX
     C           BANOTM    IFGE $FB,IX
     C           BANOTM    ANDLE$TB,IX
     C                     Z-ADDIX        IZ
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------
      * INITIAL PROCESS
      *--------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $GRP    1
      *
     C           K#PL1E    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#NOYY  40
     C                     KFLD           K#NOMM  20
     C                     KFLD           K#NODD  20
      *
     C                     TIME           SDATE
     C                     MOVE ':'       @C
     C                     MOVELTODYY     #DATEY
     C                     MOVELTODMM     #DATEM
     C                     MOVELTODDD     #DATED
     C                     MOVE '/'       #DATE1
     C                     MOVE '/'       #DATE2
     C                     MOVELNOWH      #TIMEH
     C                     MOVELNOWM      #TIMEM
     C                     MOVE ':'       #TIME1
     C                     MOVEL' (AS OF '#HEAD1
     C                     MOVEL#DATE     #HEAD2
     C                     MOVEL#TIME     #HEAD3
     C                     MOVEL' )'      #HEAD4
     C                     MOVE *BLANK    C#SHN
      * GET 2ND DAY
     C                     MOVELTODAY     $DT8
     C                     MOVE '+'       $SIGN
     C                     MOVEL'0001'    $DAYS
     C                     MOVE 'N'       $IAF
     C                     CALL 'UTLR10'
     C                     PARM           $DT8    8
     C                     PARM           $SIGN   1
     C                     PARM           $DAYS   4
     C                     PARM           $IAF    1
     C                     PARM           $TGT8   8
     C                     PARM           $RTN    1
      *
JW1   * SAVE EFFECTIVE DATE
 .   C                     MOVELTODAY     @EFDT1  80
 .   C                     MOVEL$TGT8     @EFDT2  80
 .    * SETUP TIME TABLE FOR DAY 1
     C                     MOVEL@EFDT1    $TGDT
     C                     CALL 'UEXC38'
     C                     PARM           $TGDT   8
 .    * SETUP TIME TABLE FOR DAY 2
     C                     MOVEL@EFDT2    $TGDT
     C                     CALL 'UEXC38'
     C                     PARM           $TGDT
JW1   * SET TIME TABLE
 .   C                     EXSR #TBL1
 .   C                     EXSR #TBL2
      * READ 1ST RECORD TO GET SHIP DATE
     C                     OPEN AB#WP6V4
     C                     READ AB#WP6V4                 99
     C                     CLOSEAB#WP6V4
      *
      * SET HEADER 1 ================================
     C                     CLEARAB#WPV61
      *
     C                     SELEC
     C           $GRP      WHEQ '1'
     C                     MOVELTTL,1     C6SHIN    P
     C           $GRP      WHEQ '2'
     C                     MOVELTTL,2     C6SHIN    P
     C           $GRP      WHEQ '3'
     C                     MOVELTTL,3     C6SHIN    P
     C           $GRP      WHEQ '4'
     C                     MOVELTTL,4     C6SHIN    P
     C                     ENDSL
      *
JWX  C           $GRP      IFEQ '1'
JWX  C           $GRP      OREQ '4'
      *
     C           1         DO   13        IX      20
     C           $BA,IX    IFEQ *BLANK
     C                     MOVEL'------'  C6A,IX    P
     C                     ELSE
     C           'BIN '    CAT  $BA,IX    C6A,IX
     C                     ENDIF
      *
     C           $BB,IX    IFEQ *BLANK
     C                     MOVEL'------'  C6B,IX    P
     C                     ELSE
     C           'BIN '    CAT  $BB,IX    C6B,IX
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEL'OTHER'   C6Q14A    P
     C                     MOVEL'OTHER'   C6Q14B    P
      *
JWX  C                     ENDIF
      *
     C                     WRITEAB#WPV61
      *
      * SET HEADER 2 ================================
     C                     CLEARAB#WPV61
      *
     C***                  MOVEL#HEAD     C6SHIN    P
     C                     MOVELTTL,5     LTR23  23
      *
     C                     MOVELCSSHDT    $DATE1
     C                     MOVE 'YMD'     $YMD
     C                     MOVE '.'       $SEP
     C                     CALL 'EDTR01A'
     C                     PARM           $DATE1  8
     C                     PARM           $YMD    3
     C                     PARM           $SEP    1
     C                     PARM           $DATE2 10
      *
     C                     MOVE $DATE2    LTR23
     C                     MOVELLTR23     LTR49  49
     C                     MOVE #HEAD     LTR49
     C                     MOVELLTR49     C6SHIN    P
      *
JWX  C           $GRP      IFEQ '1'
JWX  C           $GRP      OREQ '4'
      *
     C           1         DO   13        IX      20
     C                     MOVELTODAY     C6A,IX
     C                     MOVEL$TGT8     C6B,IX
     C                     ENDDO
      *
     C                     MOVELTODAY     C6Q14A
     C                     MOVEL$TGT8     C6Q14B
      *
JWX  C                     ENDIF
      *
     C                     WRITEAB#WPV61
      *
      * SET HEADER 3 ================================
     C                     CLEARAB#WPV61
      *
     C                     MOVEL'LOCATION'C6LOC     P
     C                     MOVEL'IAF PART'C6SHIN    P
     C                     MOVEL'UNSCAN'  C6UNS     P
     C                     MOVEL'INV'     C6ICNT    P
     C                     MOVEL'DAY1'    C6DAY1    P
     C                     MOVEL'SORT#'   C6SRT#    P
     C                     MOVEL'SORT'    C6SRT     P
     C                     MOVEL'*'       C6SRTX    P
     C                     MOVEL'PROCESS' C6PRC     P
     C                     MOVEL'MACHINE' C6MCN     P
     C                     MOVEL'LAST'    C6AF      P
     C                     MOVEL'*'       C6AFX     P
     C                     MOVEL'INPROC'  C6IN      P
     C                     MOVEL'*'       C6INX     P
     C                     MOVEL'BEFORE'  C6BF      P
     C                     MOVEL'*'       C6BFX     P
     C                     MOVEL'CV_PULL' C6CVP     P
     C                     MOVEL'*'       C6CVPX    P
     C                     MOVEL'INV2'    C6ICN2    P
     C                     MOVEL'DAY2'    C6DAY2    P
     C**                   MOVEL'SHP_DAT1'C6SHDA    P
     C**                   MOVEL'SHP_DAT2'C6SHDB    P
      *
JWX  C           $GRP      IFEQ '1'
JWX  C           $GRP      OREQ '4'
      * SET START TIME - OLD
     C**         1         DO   11        IX      20
     C**                   MOVEL#TM,IX    #FROM
     C**                   MOVEL#FROM1    @FROM1
     C**                   MOVEL#FROM2    @FROM2
     C**                   MOVEL@FROM     C6A,IX
     C**                   MOVEL@FROM     C6B,IX
     C**                   ENDDO
      * SET START TIME - DAY 1
     C                     Z-ADD0         IX
     C           *LOVAL    SETLLUEXWP38
     C                     DO   *HIVAL
     C                     READ UEXWP38                  96
     C   96                LEAVE
      *
     C           U3TGDT    IFEQ @EFDT1
     C                     ADD  1         IX
     C           IX        IFLE 13
     C                     MOVELU3STIM    #FROM
     C                     MOVEL#FROM1    @FROM1
     C                     MOVEL#FROM2    @FROM2
     C                     MOVEL@FROM     C6A,IX
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      * SET START TIME - DAY 2
     C                     Z-ADD0         IX
     C           *LOVAL    SETLLUEXWP38
     C                     DO   *HIVAL
     C                     READ UEXWP38                  96
     C   96                LEAVE
      *
     C           U3TGDT    IFEQ @EFDT2
     C                     ADD  1         IX
     C           IX        IFLE 13
     C                     MOVELU3STIM    #FROM
     C                     MOVEL#FROM1    @FROM1
     C                     MOVEL#FROM2    @FROM2
     C                     MOVEL@FROM     C6B,IX
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
JWX  C                     ENDIF
      *
     C                     WRITEAB#WPV61
      * DUMMY
     C**                   MOVEL#TM,1     JW4     4
      *
     C                     ENDSR
      *--------------------------------------------------
JW1   * SET TIME TABLE (DAY1)
 .    *--------------------------------------------------
 .   C           #TBL1     BEGSR
      * CLEAR TABLE
     C           1         DO   13        IX
     C                     MOVE *BLANK    $BA,IX
     C                     Z-ADD99        $FA,IX
     C                     Z-ADD99        $TA,IX
     C                     ENDDO
      * SETUP TABLE
     C                     Z-ADD0         IX
     C           *LOVAL    SETLLUEXWP38
     C                     DO   *HIVAL
     C                     READ UEXWP38                  96
     C   96                LEAVE
      *
     C           U3TGDT    IFNE @EFDT1
     C                     ITER
     C                     ENDIF
      *
     C           U3ROUT    IFNE *BLANK
     C                     ADD  1         IX
     C           IX        IFLE 13
     C                     MOVELU3BIN     $BA,IX
     C                     MOVELU3STIM    $FA,IX
     C                     MOVELU3ETIM    $TA,IX
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
 .   C                     ENDDO
 .    *
JW1  C                     ENDSR
      *--------------------------------------------------
JW1   * SET TIME TABLE (DAY2)
 .    *--------------------------------------------------
 .   C           #TBL2     BEGSR
      * CLEAR TABLE
     C           1         DO   13        IX
     C                     MOVE *BLANK    $BB,IX
     C                     Z-ADD99        $FB,IX
     C                     Z-ADD99        $TB,IX
     C                     ENDDO
      * SETUP TABLE
     C                     Z-ADD0         IX
     C           *LOVAL    SETLLUEXWP38
     C                     DO   *HIVAL
     C                     READ UEXWP38                  96
     C   96                LEAVE
      *
     C           U3TGDT    IFNE @EFDT2
     C                     ITER
     C                     ENDIF
      *
     C           U3ROUT    IFNE *BLANK
     C                     ADD  1         IX
     C           IX        IFLE 13
     C                     MOVELU3BIN     $BB,IX
     C                     MOVELU3STIM    $FB,IX
     C                     MOVELU3ETIM    $TB,IX
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
 .   C                     ENDDO
 .    *
JW1  C                     ENDSR
      *==========================================================
** TTL(60A) .......2.........3.........4.........5.........6
 ** TOYOTA CONTAINER (UNSCAN) ** PGM:AB#R6Q                   01
 ** HONDA CONTAINER (UNSCAN) ** PGM:AB#R6Q                    02
 ** FORD CONTAINER (UNSCAN) ** PGM:AB#R6Q                     03
 ** USER CONTAINER (UNSCAN) ** PGM:AB#R6Q                     04
START FROM : YYYY.MM.DD                                       05
