     H            Y.
     F** AB#R9C **************************************
     F*  .. EDI AGAI LABEL DATA FILE REFORMATION ..  *
     F*                       K.YASUDA   2001.01.26  *
     F************************************** AB#R9C **
     FAB#PP2C IP  E                    DISK
     FAB#WP9C O   E                    DISK
     I            DS
     I                                        1   80BBNOHZ
     I                                        1   40BBNOYY
     I                                        5   60BBNOMM
     I                                        7   80BBNODD
     I            DS
     I                                        1   80BBSKHZ
     I                                        1   40BBSKYY
     I                                        5   60BBSKMM
     I                                        7   80BBSKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   8
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
      *
     C                     MOVE PHIZK     WHIZK   80
     C                     ADD  1         WRECD   70
     C           BBSKJY    IFEQ 'D'
     C           BBSKHZ    ANDLE*DATE
     C                     GOTO NDAT
     C                     END
      *
     C           BBNOHZ    IFLT WHIZK
     C                     GOTO NDAT
     C                     END
      *
     C                     ADD  1         WKENS   70
     C                     WRITEAB#WP9C1
      *
     C           NDAT      TAG
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
