     H            Y.
     F** AB#RBI *************************************************************
     F*  TMS CASE LABEL DATA                                                *
     F*                                                                     *
     F*  KIRI 15/10/14 CRATE(COPY FROM AB#RBG)
     F*---------------------------------------------------------------------*
     F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                               *
     F*---------------------------------------------------------------------*
     F* 2015/11/02 | JW (SRA)    | JW1 | CHANGED BOX 3 --> 5 DIGITS         *
     F* 2016/01/18 | JW (SRA)    | JW2 | CHANGED QTY 4 --> 6 DIGITS         *
     F***********************************************************************
     FAB#PWBI CF  E                    WORKSTN
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
      *
     FAB#NP31 UF  E           K        DISK                      A
     FAB#PL76 IF  E           K        DISK
     FAB#PL1A IF  E           K        DISK
     FAB#PP70 O   E                    DISK                      A
      *
     FAB#WP2Q O   E           K        DISK                           UC
     FAB#PL67 IF  E           K        DISK                      A
     FAB#PP44 IF  E           K        DISK
     E*****************************************************************
     E                    ER      1  15 60
     E                    CMD     1   1 60
      *
     E*JW2                QT          4  4 0             QTY/BOX
JW2  E                    QT          4  6 0             QTY/BOX
     E*JW1                BX          4  3 0             BOXES
JW1  E                    BX          4  5 0             BOXES
     E*JW1                SU          4  8 0             TOTAY QTY
JW1  E*JW2                SU          4  9 0             TOTAL QTY
JW2  E                    SU          4 11 0             TOTAL QTY
     I*****************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I* SHIPPING DATE
     I            DS
     I                                        1   80PUNDAT
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1   80F2NOHZ
     I                                        1   40F2NOYY
     I                                        5   60F2NOMM
     I                                        7   80F2NODD
     I            DS
     I                                        1   80K@NOHZ
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I*
     I            DS
     I                                        1  11 W@MHIN
     I                                        1   5 W@MHN1
     I                                        6   6 W@MHNA
     I                                        7  11 W@MHN2
     I            DS
     I                                        1  11 H@MHIN
     I                                        1   5 H3MHN1
     I                                        6  10 H3MHN2
     I                                       11  15 H3MHN3
     I                                       16  20 H3MHN4
     I            DS
     I**JW2                                   1  16 QT
     I**                                      1   40S3QT01
     I**                                      5   80S3QT02
     I**                                      9  120S3QT03
     I**                                     13  160S3QT04
      *
 JW2 I                                        1  24 QT
 JW2 I                                        1   60S3QT01
 JW2 I                                        7  120S3QT02
 JW2 I                                       13  180S3QT03
 JW2 I                                       19  240S3QT04
     I**JW1       DS
     I**                                      1  12 BX
     I**                                      1   30S3BX01
     I**                                      4   60S3BX02
     I**                                      7   90S3BX03
     I**                                     10  120S3BX04
 JW1 I            DS
 JW1 I                                        1  20 BX
 JW1 I                                        1   50S3BX01
 JW1 I                                        6  100S3BX02
 JW1 I                                       11  150S3BX03
 JW1 I                                       16  200S3BX04
      *
     ISHIN        DS
     I                                        1   5 A6SHN1
     I                                        6  10 A6SHN2
     I                                       11  12 A6SHN3
      *
      *---------------------------------------------------------
      *  MAIN
      *---------------------------------------------------------
     C           @@DSP     DOWNE'99'
     C           @@DSP     CASEQ'01'      #SCRN1
     C           @@DSP     CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-------------------------------------------------------
      * INITIALIZE
      *-------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           P2        PLIST
     C                     PARM           PIQTY  300       NUMERIC QTY
     C                     PARM           POQTY  30        CHAR    QTY
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C***********************************************************************
     C* KEY1                                                                *
     C***********************************************************************
     C           K#66X     KLIST
     C                     KFLD           K@CUST
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@NOHZ
     C                     KFLD           K@NBIN
     C                     KFLD           K@MLBL  8
     C*
     C                     MOVE '01'      @@DSP   2
     C                     MOVE *ALL'0'   WKBLAK 10
     C*
     C                     MOVE *BLANK    F2NONY
     C                     MOVE *BLANK    F2NKOJ
     C                     MOVE *BLANK    F2NUKE
     C                     Z-ADD*ZERO     F2NOHZ
     C                     MOVEL*BLANK    F2ODRN
     C                     Z-ADD*ZERO     F2NOBN
      *
     C                     ENDSR
     C***********************************************************
     C* BARCODE ENTRY
     C***********************************************************
     C           #SCRN1    BEGSR
      *
     C                     EXFMTFMT010
      *
S1   C                     SELEC
-1   C           *INKI     WHEQ *ON
     C                     MOVE '02'      @@DSP
 1   C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@DSP
 1   C                     OTHER
     C                     EXSR @CHK1
     C* CHECK OK?
 S2  C           *IN99     IFEQ '0'
     C                     EXSR #SCRN3
  S3 C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@DSP
  E3 C                     END
  S3 C           *IN99     IFEQ *ON
     C                     MOVEL*ON       *IN31
  X3 C                     ELSE
     C                     MOVE *BLANK    D@BARC
  E3 C                     END
 E2  C                     END
E1   C                     ENDSL
      *
     C                     ENDSR
     C***********************************************************
     C* BARCODE ENTRY
     C***********************************************************
     C           @CHK1     BEGSR
      *
     C                     MOVEAWKBLAK    *IN,30
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     8799
     C           D@BARC    CHAINAB#PL76              90
S1   C           *IN90     IFEQ *ON
     C                     SETON                     9931
     C                     MOVE ER,13     MSG
X1   C                     ELSE
     C                     Z-ADDPUCUST    K@CUST  40
     C                     MOVELPUNONY    K@NONY  40
     C                     MOVELPUNKOJ    K@NKOJ  1
     C                     MOVELPUNUKE    K@NUKE  4
     C                     Z-ADDPUBINN    K@NBIN  20
     C                     Z-ADDPUNDAT    K@NOHZ  80
     C                     MOVELPUODRN    K@ODRN 10
E1   C                     ENDIF
      *
     C                     ENDSR
     C***********************************************************
     C* @MANUALLY
     C***********************************************************
     C           #SCRN2    BEGSR
     C*
     C                     EXFMTFMT020
     C* CLEAR MSG
     C                     MOVEAWKBLAK    *IN,30
     C                     SETOF                     8799
     C*
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVE '99'      @@DSP
     C*
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@DSP
     C                     OTHER
     C                     EXSR @CHK2
     C* CHECK OK?
     C           *IN99     IFEQ '0'
     C                     EXSR #SCRN3
     C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@DSP
     C                     END
     C           *IN99     IFEQ *ON
     C                     SETON                     313233
     C                     SETON                     343537
     C                     ELSE
     C                     MOVE *BLANK    F2NONY
     C                     MOVE *BLANK    F2NKOJ
     C                     MOVE *BLANK    F2NUKE
     C                     MOVE *BLANK    F2ODRN
     C                     Z-ADD*ZERO     F2NOHZ
     C                     Z-ADD*ZERO     F2NOBN
     C                     END
     C                     END
      *
     C                     ENDSL
     C*
     C                     ENDSR
     C***********************************************************
     C* @CHK2:CHECK ITEMS ON 2ND. SCREEN
     C***********************************************************
     C           @CHK2     BEGSR
     C*
     C                     MOVEAWKBLAK    *IN,30
     C                     MOVE *BLANK    MSG
     C                     SETOF                     8799
     C* DELIVERY CODE BLANK ?
     C           F2NONY    IFEQ *BLANK
     C                     SETON                     9931
     C                     MOVELER,1      MSG
     C                     GOTO #CHK2
     C                     END
     C*
     C* FACTORY CODE BLANK ?
     C           F2NKOJ    IFEQ *BLANK
     C                     SETON                     9932
     C                     MOVELER,2      MSG
     C                     GOTO #CHK2
     C                     END
     C*
     C* DOCK CODE BLANK ?
     C           F2NUKE    IFEQ *BLANK
     C                     SETON                     9933
     C                     MOVELER,3      MSG
     C                     GOTO #CHK2
     C                     END
     C*
     C* SHIPPING DATE
     C           F2NOHZ    IFEQ 0
     C                     SETON                     9934
     C                     MOVELER,4      MSG
     C                     GOTO #CHK2
     C                     END
      *
     C           F2NOMM    IFLT 1
     C           F2NOMM    ORGT 12
     C                     SETON                     9934
     C                     MOVELER,5      MSG
     C                     GOTO #CHK2
     C                     END
      *
     C           F2NODD    IFLT 1
     C           F2NODD    ORGT 31
     C                     SETON                     9934
     C                     MOVELER,5      MSG
     C                     GOTO #CHK2
     C                     END
     C* BIN       *
     C           F2NOBN    IFEQ 0
     C                     SETON                     9935
     C                     MOVELER,6      MSG
     C                     GOTO #CHK2
     C                     END
     C* ORDER#    *
     C           F2ODRN    IFEQ *BLANK
     C                     SETON                     9937
     C                     MOVELER,15     MSG
     C                     GOTO #CHK2
     C                     END
     C*
     C           K#1A      KLIST
     C                     KFLD           K@NOHZ
     C                     KFLD           K@NBIN
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@ODRN
     C                     Z-ADDF2NOHZ    K@NOHZ  80
     C                     Z-ADDF2NOBN    K@NBIN  20
     C                     MOVELF2NONY    K@NONY  40
     C                     MOVELF2NKOJ    K@NKOJ  1
     C                     MOVELF2NUKE    K@NUKE  4
     C                     MOVELF2ODRN    K@ODRN 10
      *
     C           K#1A      SETLLAB#PL1A
     C           *IN90     DOUEQ*ON
     C           K#1A      READEAB#PL1A                  90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     Z-ADDBATOKU    K@CUST
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVEA'11111'   *IN,31
     C                     MOVEL*ON       *IN37
     C                     SETON                     99
     C                     MOVELER,12     MSG
     C                     ENDIF
     C*
     C           #CHK2     ENDSR
      *================================================================
      * #SCRN3 :収容数*箱数　入力
      *================================================================
     C           #SCRN3    BEGSR
     C*
S1   C                     DO
     C*                        サブファイル作成
     C                     EXSR @SET3
     C           RRN3      IFEQ *ZERO
     C                     MOVEL*ON       *IN99
     C                     MOVELER,8      MSG
     C                     LEAVE
     C                     END
     C                     MOVEL*BLANK    MSG
     C                     Z-ADD1         W@RCN3  40
     C*-------------------------
 S2  C                     DO   *HIVAL
     C*
     C                     WRITEFMT099
     C*
     C                     Z-ADDW@RCN3    #RCN03
     C                     EXFMTCTL030
     C   KC
     COR KL                LEAVE
     C*
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@RCN3
     C                     END
     C*
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
     C*
     C                     EXSR @CHK3
     C   99                ITER
     C*
     C           *INKE     IFEQ *ON
     C                     EXSR @WRT1
     C                     MOVEL*ON       *IN87
     C                     LEAVE
     C                     END
     C*
 E1  C                     ENDDO
     C*-------------------------
     C*
E1   C                     ENDDO
     C*
     C                     ENDSR
      *================================================================
      * @SET3 :サブファイル作成
      *================================================================
     C           @SET3     BEGSR
      * SFLCLR
     C                     MOVEL*OFF      *IN42
     C                     MOVEL*ON       *IN41
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN41
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     Z-ADDK@NOHZ    C3NOHZ
     C                     Z-ADDK@NBIN    C3NBIN
     C                     MOVELK@NONY    C3NONY
     C                     MOVELK@NKOJ    C3NKOJ
     C                     MOVELK@NUKE    C3NUKE
     C                     MOVELK@ODRN    C3ODRN
      *
     C           K#1A      SETLLAB#PL1A
      *
S1   C                     DO   *HIVAL
      *
     C           K#1A      READEAB#PL1A                  93
     C   93                LEAVE
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C           K#67      KLIST
     C                     KFLD           K@CUST
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@NOHZ
     C                     KFLD           K@NBIN
     C                     KFLD           K@ODRN
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C           K#67      CHAINAB#PL67              90
     C           *IN90     IFEQ *OFF
     C                     ITER
     C                     END
     C*
     C                     CLEARSFL030
     C*
     C                     MOVELBAMHN1    W@MHN1
     C                     MOVEL'-'       W@MHNA
     C                     MOVELBAMHN2    W@MHN2
     C                     MOVELW@MHIN    S3MHIN
     C                     MOVELBAMHN1    H3MHN1
     C                     MOVELBAMHN2    H3MHN2
     C                     MOVELBAMHN3    H3MHN3
     C                     MOVELBAMHN4    H3MHN4
     C                     MOVELBASHN1    H3SHN1
     C                     MOVELBASHN2    H3SHN2
     C                     MOVELBASHN3    H3SHN3
     C                     Z-ADDBAUSYS    H3USYS
     C*
     C                     Z-ADDBASRYO    S3SRYO
     C*
     C                     MOVEA'00000000'*IN,51
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
E1   C                     ENDDO
     C*
     C                     ENDSR
      *================================================================
      * @CHK3 :サブファイルチェック
      *================================================================
     C           @CHK3     BEGSR
      *
     C                     Z-ADD*ZERO     RRN3    40
      *-------------------------
S1   C                     DO   *HIVAL
      *
     C                     ADD  1         RRN3
     C           RRN3      CHAINSFL030               93
     C   93                LEAVE
      *
     C                     MOVEA'00000000'*IN,51
      *----------
 S2  C                     DO   4         X       20
     C           QT,X      IFEQ 0
     C           BX,X      ANDEQ0
     C                     ITER
     C                     ENDIF
     C           50        ADD  X         @X      20
     C           QT,X      IFEQ 0
     C                     MOVEL*ON       *IN,@X
     C                     MOVEL*ON       *IN99
     C                     MOVELER,9      MSG
     C                     LEAVE
     C                     ENDIF
     C           BX,X      IFEQ 0
     C                     MOVEL*ON       *IN,@X
     C                     MOVEL*ON       *IN99
     C                     MOVELER,10     MSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *----------
     C                     Z-ADD0         S3TOTL
     C*
     C           *IN99     IFEQ *OFF
     C           QT        MULT BX        SU
     C                     XFOOTSU        S3TOTL
     C           S3SRYO    IFNE S3TOTL
     C                     MOVEL*ON       *IN99
     C                     MOVEA'1111'    *IN,51
     C                     MOVELER,7      MSG
     C                     END
     C                     ENDIF
     C*
     C                     UPDATSFL030
     C   99                Z-ADDRRN3      W@RCN3
     C   99                LEAVE
     C*
     C                     ENDDO
      *-------------------------
     C                     ENDSR
      *================================================================
      * @WRT1:WRITE LABEL DATA
      *================================================================
     C           @WRT1     BEGSR
      *
      **  CLRPFM AB#WP2Q
     C           *IN22     IFEQ *OFF
     C                     MOVELCMD,1     P@CMD
     C                     Z-ADD30        P@LEN
     C                     CALL 'QCMDEXC' P#CMD          99
     C                     MOVE *ON       *IN22
     C                     ENDIF
      *
     C                     OPEN AB#WP2Q
      *
     C                     Z-ADD*ZERO     RRN3    40
      *-------------------------
S1   C                     DO   *HIVAL
      *
     C                     ADD  1         RRN3
     C           RRN3      CHAINSFL030               93
     C   93                LEAVE
     C*
     C           K#44      KLIST
     C                     KFLD           K@CUST
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@NOHZ
     C           K#44      CHAINAB#PP44              90
     C           *IN90     IFEQ *OFF
     C                     MOVELDAHOME    I2LVL
     C                     MOVELDASUNM    I2SIRE
     C                     ELSE
     C           BANUKE    IFEQ '00'
     C                     MOVEL'E'       I2LVL
     C                     MOVEL'0242'    I2SIRE
     C                     ELSE
     C                     MOVELBANUKE    I2LVL
     C                     MOVEL'0242'    I2SIRE
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELK@NKOJ    I2FACT
     C                     MOVELH@MHIN    I2PART
      *----------
 S2  C                     DO   4         X       20
  S3 C           QT,X      IFNE 0
     C                     Z-ADDQT,X      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     I2CQTY
     C*-----
     C*                         BOXES箱数
     C*-----
  S4 C                     DO   BX,X
     C*                         ( N3NMBR カウントアップ)
     C                     EXSR @NMBR
     C*                         ( WRITE AB#PP701 )
     C                     EXSR #PP70
     C                     MOVE N3NMBR    I2SERL
     C                     MOVELK@NONY    I2SERL
     C                     MOVE I2SERL    I2CASE
     C                     MOVEL'242'     I2CASE
     C*                         ( WRITE AB#PP661 )
     C                     EXSR #P66
     C                     MOVELK@ODRN    I2ODRN
     C                     MOVELSHIN      I2IPAR
     C                     MOVEL#PGM      I2PGM
     C                     WRITEAB#WP2Q1
  E4 C                     ENDDO
     C*-----
  E3 C                     ENDIF
 E2  C                     ENDDO
      *----------
E1   C                     ENDDO
      *-------------------------
     C                     CLOSEAB#WP2Q
     C*
     C                     ENDSR
      *================================================================
      * @NMBR: TMS CASE NUMBER  ( N3NMBR カウントアップ)
      *================================================================
     C           @NMBR     BEGSR
      *
     C**JW1                Z-ADD99999     @@14   140
JW1  C                     Z-ADD99999999  @@14   140
     C           K@NONY    CHAINAB#NP31              97
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    N3UDAT
     C                     Z-ADDWSSTM6    N3UTIM
     C                     MOVEL#PGM      N3UPGM
     C                     MOVEL#USER     N3UUSR
     C                     MOVEL#WSID     N3UWIS
     C                     Z-ADDK@NONY    N3NONY
     C           *IN97     IFEQ *ON
     C                     Z-ADD1         N3NMBR
     C                     WRITEAB#NP311
     C                     ELSE
     C                     ADD  1         N3NMBR
     C           N3NMBR    IFGE @@14
     C                     Z-ADD1         N3NMBR
     C                     ENDIF
     C                     UPDATAB#NP311
     C                     ENDIF
      *
     C                     ENDSR
      *================================================================
      * #PP70: SET FIELDS FOR AB#PP70
      *================================================================
     C           #PP70     BEGSR
      *
     C                     CLEARAB#PP701
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    EKKOYY
     C                     Z-ADDWSSMMM    EKKOMM
     C                     Z-ADDWSSDDD    EKKODD
     C                     Z-ADDWSSHHH    EKKOHH
     C                     Z-ADDWSSNNN    EKKOMN
     C                     MOVEL#USER     EKKOME
     C                     MOVE K@NONY    EKNONY
     C                     MOVE K@NKOJ    EKNKOJ
     C                     MOVE K@NUKE    EKNUKE
      *
     C                     MOVE K@NOYY    EKNOYY
     C                     MOVE K@NOMM    EKNOMM
     C                     MOVE K@NODD    EKNODD
     C                     Z-ADDK@CUST    EKTOKU
     C                     MOVE K@NBIN    EKNOBN
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELK@NONY    EKSERL
     C                     WRITEAB#PP701
      *
     C                     ENDSR
      *================================================================
      * #P66 : WRITE CASE DATA FOR 0323
      *================================================================
     C           #P66      BEGSR
      *
     C                     CLEARAB#PP661
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A6KYMD
     C                     Z-ADDWSSTM6    A6KTIM
     C                     MOVE K@CUST    A6TOKU
     C                     MOVE K@NONY    A6NONY
     C                     MOVE K@NKOJ    A6NKOJ
     C                     MOVE K@NUKE    A6NUKE
     C                     MOVELI2CASE    A6MLBL
     C                     Z-ADDK@NOHZ    A6NYMD
     C                     Z-ADDK@NBIN    A6NBIN
     C                     MOVELK@ODRN    A6ORDN
     C*
     C                     WRITEAB#PP661
     C*
     C                     MOVELH3MHN1    A6MHN1
     C                     MOVELH3MHN2    A6MHN2
     C                     MOVELH3MHN3    A6MHN3
     C                     MOVELH3MHN4    A6MHN4
     C                     MOVELH3SHN1    A6SHN1
     C                     MOVELH3SHN2    A6SHN2
     C                     MOVELH3SHN3    A6SHN3
     C                     Z-ADDQT,X      A6SRYO
     C                     Z-ADDH3USYS    A6QTYB
     C*
     C                     WRITEAB#PP661
     C*
     C                     ENDSR
     C***********************************************************
** ER
E-01 ENTER DELIVERY CODE.
E-02 ENTER FACTORY CODE.
E-03 ENTER DOCK CODE.
E-04 ENTER SHIPPING DATE.
E-05 DATE IS WRONG.
E-06 ENTER BIN.
E-07 TOTAL QTY IS NOT MATCHED.
E-08 ALL DATA ALREADY CREATED.
E-09 ENTER QTY.
E-10 ENTER BOXES.
E-11
E-12 NO DATA IN ORDER FILE(AB#PP10)
E-13 BARCODE ERROR
E-14
E-15 ENTER ORDER#.
** CMD
CLRPFM AB#WP2Q
