     FPRT132  UP  F     132            DISK
      *
     IPRT132  AA  01
     I                                        1 132 DATA
     C                     MOVE X'0D'     A       1
     C                     MOVE X'0A'     B       1
      *
     C                     EXCPT@UPD
      *
     OPRT132  E                @UPD
     O                         A        132
     O********                 B        132
