     H            Y.
     F** AB#R2C7 *******************************************
     F*  PALLET# ADD FOR ACZ                               *
     F*                                                    *
     F* TCHK1 12/14/12 CREATE(COPIED FROM AB#R485)         *
     F******************************************************
     FAB#WP2ITIF  E           K        DISK
     FAB#WP2I O   E                    DISK
     E*-----------------------------------------------------
     I            DS
     I                                        1  10 W@LMS
     I                                        1   1 W@L
     I                                        2   6 W@M
     I                                        7   8 W@S
      *
     C           *LOVAL    SETLLAB#WP2IT
     C                     DO   *HIVAL
     C                     READ AB#WP2IT                 99
     C           *IN99     IFEQ *ON
     C                     LEAVE
     C                     END
     C*
     C                     MOVELW#L       W@L
     C                     MOVELW#M       W@M
     C                     MOVELW#S       W@S
     C                     MOVELW@LMS     I2FLD1
     C*
     C                     WRITEAB#WP2I1
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*
