     H            Y.
     ** AB#REA ********************************************************
     *  RETRIEVE DATE AND TIME TO CHECK AUDIT RECORDS                 *
     ******************************************************** AB#REA **
      *------------------------------------------------------------
     I            DS
     I                                        1  140@@TIME
     I                                        1   40@@HM
     I                                        1   20@@HH
     I                                        3   40@@MN
     I                                        9  140@@YMD6
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@DATE  7
     C                     PARM           P@TIM1  4
     C                     PARM           P@TIM2  4
      *
     C                     TIME           @@TIME
     C           1000000   ADD  @@YMD6    @7      70
     C                     MOVE @7        P@DATE
      *
     C                     MOVE @@HM      P@TIM2
     C           @@MN      SUB  10        @@MN
     C           @@MN      IFLT *ZERO
     C                     ADD  60        @@MN
     C                     SUB  1         @@HH
     C                     ENDIF
     C                     MOVE @@HM      P@TIM1
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
