     H            Y/
     F** AB#R18 ****************************************************************
     F* ACTUAL SHIPMENT                                                        *
     F*                                                                        *
     F*  JUN/11/06   TCH                                                       *
     F*                                                                        *
     F************************ AB#R18 ******************************************
     FAB#WP17 IP  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F****************************************************************
     E                    MNT         5  2 0
     E                    DAT         5  2 0
     E                    QTY         5  9 0
     E                    WQT         5  9 0
     E                    BOX         5  4 1
     E                    TQT         5  9 0
     E                    TBX         5  4 1
     E                    MON     1  12  4
     E                    LMN         5  6
     E****************************************************************
     IAB#WP171
     I                                              BATOKUL1
     I                                              BASHINL1
     I                                              BANONYL1
     I            DS
     I                                        1  12 BASHIN
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@Y
     I                                        5   60K@M
     I                                        7   80K@D
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I                                        1   60BAYM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I**************************************************************
     C                     Z-ADD1         X
     C           BANOMM    LOKUPMNT,X                    50
     C   50                ADD  BASRYO    QTY,X
      *
     CL1                   EXSR #PRT
     CLR                   EXSR #TOT
      *------------------------------------------------------------
     C           *INZSR    BEGSR
      *------------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@TOKU  40
     C                     PARM           P@DAT1  80
     C                     PARM           P@DAT2  80
     C           K#AGD     KLIST
     C                     KFLD           K@Y
     C                     KFLD           K@M
      *
     C           K#FCE     KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     MNT
     C                     MOVE P@DAT1    K@YMD
     C           1         DO   5         X       20
     C                     MOVE K@Y       @@2     2
     C           MON,K@M   CAT  @@2:0     LMN,X
      *
     C                     Z-ADD*ZERO     @@DAY   20
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C           K#AGD     READEAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C           F8YOBI    ANDLE5
     C                     ADD  1         @@DAY
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD@@DAY     DAT,X
     C                     Z-ADDK@M       MNT,X
     C                     ADD  1         K@M
     C           K@M       IFGT 12
     C                     SUB  12        K@M
     C                     ADD  1         K@Y
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE P@TOKU    K@CUST  40
     C           K@CUST    CHAINFGBPL01              90
     C           *IN90     IFEQ *OFF
     C                     MOVELB2SMEI    W@NAME 20
     C                     ENDIF
      *
     C                     MOVE *BLANK    @@SHN  12
     C                     MOVE *ALL'-'   @@LIN 132
     C                     MOVE P@DAT2    W@END   80
      *
     C                     ENDSR
      *------------------------------------------------------------
     C           #PRT      BEGSR
      *------------------------------------------------------------
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C           BASHIN    COMP @@SHN                    11
     C                     Z-ADD*ZERO     BOX
     C                     Z-ADD*ZERO     WQT
     C           QTY       DIV  DAT       WQT       H
     C           1         DO   5         X
     C           BASYOS    IFNE *ZERO
     C           WQT,X     DIV  BASYOS    BOX,X
     C                     ELSE
     C           K#FCE     CHAINFCEPL01              95
     C           *IN95     IFEQ *OFF
     C           WQT,X     DIV  A2SSYS    BOX,X
     C                     ELSE
     C           BAUSYS    IFNE *ZERO
     C           WQT,X     DIV  BAUSYS    BOX,X
     C                     ELSE
     C                     Z-ADD1         BOX,X
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXCPT@DTL
     C                     ADD  QTY       TQT
     C                     ADD  BOX       TBX
      *
     C                     MOVE BASHIN    @@SHN
     C  N98                MOVE *ON       *IN98
     C                     Z-ADD*ZERO     QTY
      *
     C                     ENDSR
      *------------------------------------------------------------
     C           #TOT      BEGSR
      *------------------------------------------------------------
     C           *INOF     IFEQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C                     EXCPT@TOT
     C                     Z-ADD*ZERO     TQT
     C                     Z-ADD*ZERO     TBX
      *
     C                     ENDSR
      *------------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  120
     O                                  125 'P.'
     O                         PAGE  Z  129
     O        E   02           @HED
     O                                   60 'ACTUAL SHIPMENT TO'
     O                         W@NAME    81
     O                                  120 '( ) = BOXES/DAY'
     O        E   04           @HED
     O                                    9 'IAF PART#'
     O                                   23 'USER PART#'
     O                                   38 'DELV'
     O                         LMN,1     51
     O                         LMN,2     69
     O                         LMN,3     87
     O                         LMN,4    105
     O                         LMN,5    123
     O        E   05           @HED
     O                         @@LIN    132
     O        E 1              @DTL
     O                      N11BASHIN    12
     O                      N11BAMHIN    33
     O                         BANONY    38
     O                         QTY,1 1   49
     O                                   50 '('
     O                         BOX,1 4   55
     O                                   56 ')'
     O                         QTY,2 1   67
     O                                   68 '('
     O                         BOX,2 4   73
     O                                   74 ')'
     O                         QTY,3 1   85
     O                                   86 '('
     O                         BOX,3 4   91
     O                                   92 ')'
     O                         QTY,4 1  103
     O                                  104 '('
     O                         BOX,4 4  109
     O                                  110 ')'
     O                         QTY,5 1  121
     O                                  122 '('
     O                         BOX,5 4  127
     O                                  128 ')'
     O        E 1              @TOT
     O                                   20 'CUSTOMER TOTAL'
     O                         TQT,1 1   49
     O                                   50 '('
     O                         TBX,1 4   55
     O                                   56 ')'
     O                         TQT,2 1   67
     O                                   68 '('
     O                         TBX,2 4   73
     O                                   74 ')'
     O                         TQT,3 1   85
     O                                   86 '('
     O                         TBX,3 4   91
     O                                   92 ')'
     O                         TQT,4 1  103
     O                                  104 '('
     O                         TBX,4 4  109
     O                                  110 ')'
     O                         TQT,5 1  121
     O                                  122 '('
     O                         TBX,5 4  127
     O                                  128 ')'
     O        E 1              @TOT
     O                         @@LIN    132
**
JAN-
FEB-
MAR-
APR-
MAY-
JUN-
JUL-
AUG-
SEP-
OCT-
NOV-
DEC-
