     H            Y.
     F** AB#R4D ************************************************************
     F*  PRINT CUSTOM SHEET                                                *
     F*  I-HASADA 1998.08.07                                               *
     F*  N-HYOTO  2000.01.03 CHAIN EDIPL40 & SET ADDR1 - ADDR4             *
     F*  N-HYOTO  2000.01.10 ADD FORD(MEXICO)                              *
     F*  N-HYOTO  2000.02.22 AHIFT TOTAL TO RIGHT(OVER FLOW)               *
     F*                      CHANGE TRANSPORTATION                         *
     F*  G.ALKHUTOVA  CHANGE QPRINT: #3, #5,     00.03.01                  *
     F*               ADD '109010' TO #1                                   *
     F*  K.KASHIWAGI  2001.03.16 ADD COUNTRY                               *
     F*  H.AMANO      2002.08.13 ADD ASN#                                  *
     F*  TCHK1 08/27/08 ADD MEXICO                                         *
     F*  TCHK2 09/10/08 CHG PRICE DECIMAL                                  *
     F*  TCHK3 04/17/12 ADD ORDER# TO INFILE                               *
     F*  TCHK4 12/13/13 RMV WSMEI                                          *
     F*  TCHK5 02/17/14 ADD MEXICO(0391-0286)                              *
     F*  TCHK6 04/22/14 ADD PURCHASERS NAME & ADDRESS                      *
JW1  F*  JW    2016/04/19 ADD COUNTRY/ORIGIN IN PART LINE                  *
JW2  F*  JW    2016/06/22 ADD PARAMETER OF UTLR06 (CUST GROUP)             *
JW3  F*  JW    2016/09/16 ADD DELIVERY# 396                                *
JW4  F*  JW    2017/05/19 CHG STOP PRINT IF CONSOLIDATED PACKING LIST      *
JW5  F*  JW    2024/05/07 CHG UTLR06 TO UTLR06A                            *
     F*  JW6   2025.12.19 ADD PARAMETER FOR TRIAL PART (D@P6)
     F*************************************** AB#R4D ***********************
TCHK3FAB#WP39 IP  F     110            DISK
     FFCEPL01 IF  E           K        DISK
%0001FEDIPL40 IF  E           K        DISK
TCHK5FAB#PP9A IF  E           K        DISK
JW4  FAB#PL83 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1  12  2 0 TB2     9
     IAB#WP39 AA  01
     I                                        1   40ITOKU
     I                                        5   80INONY
     I                                        9   9 INKOJ
     I                                       10  13 INUKE
     I                                       14  18 IMHN1 L1
     I                                       19  21 IMHN2 L1
     I                                       22  25 IMHN3 L1
     I                                       26  27 IMHN4 L1
     I                                       34  410INOHZ
     I                                       34  370INOYY
     I                                       38  390INOMM
     I                                       40  410INODD
     I                                       46  510ISRYO
TCHK2I                                       55  625ITANK
     I                                       63  67 ISHN1
     I                                       68  72 ISHN2
     I                                       73  74 ISHN3
     I                                       75  800ISYOS
     I                                       81  96 ISASN
TCHK3I                                       97 106 IODRN
JW1  I                                       14  27 IPART
JW4  I                                      107 1080INOBN
      *
     I            DS
     I                                        1   5 WWNO1
     I                                        6   8 WWNO2
     I                                        9  12 WWNO3
     I                                       13  14 WWNO4
     I                                        1   7 WWNO5
     I                                        8  11 WWNO6
     I            DS
     I                                        1  20 @MHIN
     I                                        1   5 @MHN1
     I                                        6   8 @MHN2
     I                                        9  12 @MHN3
     I                                       13  14 @MHN4
     I                                        1   5 XMHN1
     I                                        6  10 XMHN2
     I                                       11  15 XMHN3
     I                                       16  20 XMHN4
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
JW4  C           K#78      KLIST
 |   C                     KFLD           INOYY
 |   C                     KFLD           INOMM
 |   C                     KFLD           INODD
 |   C                     KFLD           ITOKU
 |   C                     KFLD           INONY
 |   C                     KFLD           INKOJ
 |   C                     KFLD           INUKE
 |   C                     KFLD           INOBN
JW4  C                     KFLD           W@OD25 25
      *
     C           *ENTRY    PLIST
     C                     PARM           PWEIG   52
     C                     PARM           PSIRE   4
     C                     PARM           PCNAM  10        COUNTRY
     C                     PARM           PTRAN  30        TRANSPORTATION
JW6  C                     PARM           D@P6    1
      *
     C                     SETOF                     10
JW4   * STOP PRINT CONSOLIDATED CUSTOMS
 |   C                     MOVELIODRN     W@OD25
 |   C           K#78      CHAINAB#PL83              99
 |   C           *IN99     IFEQ *OFF
 |   C           P8SKJY    ANDEQ'C'
 |   C                     MOVE *ON       *INLR
 |   C                     RETRN
 |   C                     GOTO @END
JW4  C                     ENDIF
JW1   * COSWORTH(4160) SPECIAL
 |   C           PSIRE     IFEQ '4160'
 |   C                     MOVE *ON       *IN31
 |   C                     ELSE
 |   C                     MOVE *OFF      *IN31
JW1  C                     ENDIF
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     1011
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       20
     C           INOMM     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVELTB2,A     WMNAM   9
     C                     END
     C* DUE TO USING COUNTRY(PCNAM), WLOCA FOR MEXICO AND CANADA
     C* IS NOT USED ANY MORE
      * SET LOCATION(COUNTRY)
     C*          INONY     IFEQ 5162
     C*          INONY     OREQ 5163
     C*                    MOVE 'MEXICO'  WLOCA   6
     C*                    ELSE
     C*                    MOVE 'CANADA'  WLOCA
     C*                    END
TCHK1C                     MOVEL'HONDA'   W@EXPT 12 P
TCHK1C           INONY     IFEQ 0391
TCHK1C           INONY     OREQ 0286
JW3  C           INONY     OREQ 0396
TCHK1C                     MOVE 'MEXICO'  W@EXPT
TCHK1C                     ELSE
TCHK1C                     MOVE 'CANADA'  W@EXPT
TCHK1C                     END
TCHK5C                     MOVEL*BLANK    W@LIN1 40
TCHK5C                     MOVEL*BLANK    W@LIN2 40
TCHK5C                     MOVEL*BLANK    W@LIN3 40
TCHK5C                     MOVELINONY     WWNONY  4
TCHK5C           WWNONY    CHAINAB#PP9A              91
TCHK5C           *IN91     IFEQ *OFF
TCHK5C           YBLIN1    IFEQ *BLANK
TCHK5C           YBLIN1    ANDEQ*BLANK
TCHK5C           YBLIN1    ANDEQ*BLANK
TCHK5C                     MOVELW@EXPT    W@LIN2
TCHK5C                     ELSE
TCHK5C                     MOVELYBLIN1    W@LIN1
TCHK5C                     MOVELYBLIN2    W@LIN2
TCHK5C                     MOVELYBLIN3    W@LIN3
TCHK5C                     END
TCHK5C                     ELSE
TCHK5C                     MOVELW@EXPT    W@LIN2
TCHK5C                     END
      *
     C                     SETOF                     20
TCHK4C*                    MOVE *BLANK    WSMEI  15
TCHK4C*          INONY     CHAINFGBPL011             20
TCHK4C*          *IN20     IFEQ '0'
TCHK4C*          B2SKJY    ANDEQ'D'
TCHK4C*          B2SKHZ    ANDLE*DATE
TCHK4C*                    SETON                     20
TCHK4C*                    END
TCHK4C*          *IN20     IFEQ '0'
TCHK4C*                    MOVELB2SMEI    WSMEI
TCHK4C*                    END
      *
      ***
%0001C                     EXSR #SUB1
      *
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WSRYO   60
     C                     END
      *
%0001C**********           EXSR #SUB1
     C*
     C                     SETOF                     20
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WDMEI  13
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C                     MOVELA2DMEI    WDMEI
     C                     END
      *
     C                     ADD  ISRYO     WSRYO
      *
     CL1                   EXSR SUBR
     CLR         TEIGH     ADD  26.76     TGROS   72
      *
JW4  C           @END      TAG
      *---------------------------------------------
     C           SUBR      BEGSR
      * EDIT PART NO.(FORD)
     C           ITOKU     IFEQ 5149
     C                     SETON                     30
     C                     MOVE IMHN1     WWNO1
     C                     MOVE IMHN2     WWNO2
     C                     MOVE IMHN3     WWNO3
     C                     MOVE IMHN4     WWNO4
     C                     ELSE
     C                     SETOF                     30
     C                     END
      *
     C           ISYOS     IFEQ *ZERO
     C                     Z-ADD1         ISYOS
     C                     ENDIF
      *
     C           WSRYO     DIV  ISYOS     WHAKO   30
      *
     C           WSRYO     MULT ITANK     WKING   82
     C                     ADD  WKING     TKING   82
      *
JW6  C           D@P6      IFEQ 'Y'
 .   C           WSRYO     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  0         WGROS   62H
 .   C                     ELSE
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   62H
JW6  C                     ENDIF
      *
      *
     C           WSRYO     DIV  ISYOS     WKT1    30
     C                     MVR            WKT2    30
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     END
      *
JW6  C           D@P6      IFEQ 'Y'
     C           PWEIG     MULT WKT1      @PAL    73
 .   C           WGROS     ADD  @PAL      WEIGH   73
 .   C                     ELSE
     C           WGROS     MULT WKT1      WEIGH   73
JW6  C                     ENDIF
      *
     C                     ADD  WEIGH     TEIGH   73
JW1   * GET COUNTRY OF ORIGIN
JW1  C                     CLEAR$PART
JW2  C**                   MOVEL'HND'     $CGRP
JW1  C                     MOVELIPART     $PART
JW1  C                     MOVELPSIRE     $PNONY
JW1  C                     MOVE 'U'       $PTYP
JW1  C*********            CALL 'UTLR06'
JW5  C                     CALL 'UTLR06A'
JW2  C**                   PARM           $CGRP   3
JW1  C                     PARM           $PART  20
JW1  C                     PARM           $PNONY  4
JW1  C                     PARM           $PTYP   1
JW1  C                     PARM           $CO     3
JW1  C**                   PARM           $RTN    1
     C           $CO       IFEQ ' '
     C                     MOVEL'UN '     WKORG
     C                     ELSE
JW1  C                     MOVEL$CO       WKORG   3
JW5  C                     ENDIF
      *
     C                     ENDSR
      *
     C           #SUB1     BEGSR
     C                     MOVELINONY     WNONY   4
     C                     MOVE *BLANK    WADD1  30
     C                     MOVE *BLANK    WADD2  30
     C                     MOVE *BLANK    WADD3  30
     C                     MOVE *BLANK    WADD4  30
     C                     MOVE *BLANK    WADD5  30
     C                     MOVE *BLANK    WADD6  30
     C           WNONY     CHAINEDIPL401             77
     C           *IN77     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C                     ELSE
     C                     MOVELE4ADD1    WADD1
     C                     MOVELE4ADD2    WADD2
     C                     MOVELE4ADD3    WADD3
     C                     MOVELE4ADD4    WADD4
     C                     MOVELE4ADD5    WADD5
     C                     MOVELE4ADD6    WADD6
     C                     END
     C                     END
     C                     ENDSR
      *
     OQPRINT  H  202   10
TCHK4O*                        WSMEI     29
     O        H  2     10
     O                                   17 'IAF'
     O*----------------------  WLOCA     25
     O                         PCNAM     29
     O                                   36 'CUSTOM'
     O                                   49 'INFORMATION'
     O                                   71 'PAGE'
     O                         PAGE  Z   75
     O        H  2     10
     O                                   11 '1.VENDOR'
     O                                   56 '2.DATE OF DIRECT'
     O                                   68 'SHIPMENT TO'
     O*----------------------- WLOCA     75
     O                         PCNAM     79
     O        H  1     10
 GA  O**                                  8 'IAF'
 GA  O                                   20 'IAF CODE 500907'
     O                         WMNAM     51
     O                         INODD Z   54
     O                                   56 ','
     O                         INOYY     61
     O        H  1     10
     O                                   26 '1300 W. ANDERSON BLVD'
TCHK5O        H  2     10
     O                                   25 'GREENFIELD, IN 46140'
 GA  O**                                 58 '3.OTHER REFERENCES'
 GA  O                                   45 '3.ASN'
     O                         ISASN     66
 GA  O**      H  2     10
 GA  O**                                 11 '109010'
TCHK5O        H  1     10
     O                                   14 '4.CONSIGNEE'
 GA  O**                                 58 'PRODUCTION PARTS'
TCHK5O                                   61 '5.PURCHASERS NAME AND'
TCHK5O                                   69 'ADDRESS'
     O        H  1     10
     O                         WADD1     35
TCHK5O                         W@LIN1    80
TCHK5O*                                  61 '5.PURCHASERS NAME AND'
TCHK5O*                                  69 'ADDRESS'
 GA  O**                                 57 '5.RELATED COMPANY'
 GA  O**                                 70 'TRANSACTION'
     O        H  1     10
     O                         WADD2     35
TCHK5O                         W@LIN2    80
     O        H  1     10
     O                         WADD3     35
TCHK1O* GA                               54 'HONDA CANADA'
TCHK5O* TCHK1                  W@EXPT    54
TCHK5O                         W@LIN3    80
 GA  O**                                 49 'NO-NONE'
     O        H  2     10
     O                         WADD4     35
     O        H  1     10
     O**JW1                              27 '6.COUNTRY OF ORIGIN     '
JW1  O                    31             22 '6.ULTIMATE COSIGNEE'
     O                                   56 '7.TRANSPORTATION'
     O        H  1     10
JW1  O                    31             27 '  COSWORTH LIMITED      '
JW1  O                   N31             56 ' '
     O        H  1     10
JW1  O                    31             27 '  44ST. JAMES MILL RD   '
     O                         PTRAN     72
JW1  O        H  2     10
JW1  O                    31             29 'NORTH HAMPTON NH NN5 5RA'
JW1  O                   N31             56 ' '
     O        H  1     10
     O                                   18 '8.CONDITIONS OF'
     O                                   33 'SALE AND TERMS'
     O                                   50 '9.CURRENCY'
     O        H  1     10
     O                                   16 'OF PAYMENT'
     O        H  1     10
     O                                   52 'U.S. FUNDS'
     O        H  2     10
     O                                   11 'NET 25'
     O        H  2     10
     O                                   16 '10.ORIGINATOR'
     O                                   56 '11.FIELDS 23 TO 25'
     O                                   76 'ARE NOT APPLICABLE'
     O        H  3     10
     O                                   22 'SAME AS NUMBER 1.'
     O                                   43 'X'
     O        H  2     10
     O                                   13 'NO. OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES QUANTITY'
     O                                   62 'UNIT PRICE'
     O                                   72 'TOTAL'
JW1  O                                   80 'CNT/ORG'
     O        H  202   OF
     O                                   10 ' '
     O        H  2     OF
     O                                   13 'NO. OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES QUANTITY'
     O                                   62 'UNIT PRICE'
     O                                   71 'TOTAL'
     O        T  1     L1
     O                         WHAKO Z    8
     O                N30      IMHN1     16
     O                N30                17 '-'
     O                N30      IMHN2     20
     O                N30                21 '-'
     O                N30      IMHN3     25
     O                N30                26 '-'
     O                N30      IMHN4     28
     O                 30      WWNO5     19
     O                 30                20 '-'
     O                 30      WWNO6     24
     O                         WDMEI     42
     O                         WSRYO 1   51
     O                         ITANK 1   62
     O                         WKING 1   72
JW1  O                         WKORG     79
     O        T 11     LR
     O                                   53 'TOTAL WEIGHT'
     O                                   75 'INVOICE TOTAL'
     O        T  2     LR
     O                                   44 'NET'
     O                                   57 'GROSS'
     O        T  1     LR
     O                         TEIGH 1   50
     O                                   51 'K'
     O                         TGROS 1   61
     O                                   62 'K'
     O                         TKING 1   72
      *
** TB1.TB2
01JANUARY
02FEBRUARY
03MARCH
04APRIL
05MAY
06JUNE
07JULY
08AUGUST
09SEPTEMBER
10OCTOBER
11NOVEMBER
12DECEMBER
