     H            Y.
     F** AB#R3A1 ************************************
     F*  ..EDI PICK-UP     LIST..  '02' OR '09'     *
     F*  COPIED FROM AB#R3B                         *
     F*  ADD PACKING LIST & QTY = 1                 *
     F*                                             *
     F*  CHANGE PICK-UP LIST LAYOUT                 *
     F*  K.KASHIWAGI  2001.04.02                    *
     F*                                             *
     F*  H.AMANO      2002.03.06                    *
     F*       ADD BARCODE/CHANGE QPRINT -> PRINTER FILE
     F*  H.AMANO      2003.02.17                    *
     F*       CHANGE AMBRAKE 0291
JW1  F*  JW      05/04/17 ACCEPT PUSKJY=C
JW2  F*  JW      07/19/17 ADD AB#PPA1 (NEW ORDER FILE)
JW3  F*  JW      08/11/17 ADD DENSO CANADA (3086)
JW4  F*  JW      10/12/17 ADD DENSO CANADA (3076)
     F*  KIRI    03/26/18 ADD AB#WP37 WORK FILE FOR NEW PACKING LIST 2018
     F*  JW      09/05/23 ADD AB#PP78L (LOG FILE)
     F*  JW5   2025.12.19 ADD PARAMETER FOR TRIAL PART (D@P6)
     F************************************* AB#R3A **
TCHK5FAB#PL37 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FAB#PL75 IF  E           K        DISK                      A
TCHK6FAB#PP78 O   E                    DISK
TCHK8FAB#PL7B IF  E           K        DISK
     FAB#PL2A IF  E           K        DISK
     FAB#PL1A UF  E           K        DISK
JW2  FAB#PLAA UF  E           K        DISK
TCH41FAB#PL90 IF  E           K        DISK
     FAB#PR3A O   E             77     PRINTER
      *
      *  WORK FILE FOR NEW PACKING LIST 2018 *
     FAB#WP37 O   E                    DISK
JW   FAB#PP78LO   E                    DISK
      *--------------------------------------------------
     E                    TB1     1   3  4   TB2     5
     E                    TTL     1   5 11
TCHK2E                    TXT     1   5 22
      *--------------------------------------------------
TCHK5IAB#PL371    01
     I                                              INOHZ L1
     I                                              ISIRE L1
     I                                              ISIRK L1
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1  20 IMHNA
     I                                        1   5 IHMH1
     I                                        6   8 IHMH2
     I                                        9  12 IHMH3
     I                                       13  14 IHMH4
     I            DS
     I                                        1  17 @MHN
     I                                        1   5 @MHN1
     I I            '-'                       6   6 @M1
     I                                        7  11 @MHN2
     I I            '-'                      12  12 @M2
     I                                       13  17 @MHN3
     I            DS
     I                                        1  17 @MHNA
     I                                        1   5 @HMH1
     I I            '-'                       6   6 @H1
     I                                        7   9 @HMH2
     I I            '-'                      10  10 @H2
     I                                       11  14 @HMH3
     I I            '-'                      15  15 @H3
     I                                       16  17 @HMH4
TCHK7I            DS
TCHK7I                                        1  20 IMHNB
TCHK7I                                        1   8 IMHB1
TCHK7I                                        9  20 IMHB2
TCHK7I            DS
TCHK7I                                        1  17 @MHNB
TCHK7I                                        1   8 @MHB1
TCHK7I I            '-'                       9   9 @MHB2
TCHK7I                                       10  17 @MHB3
     I            DS
     I                                        1  12 ISHN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80INOHZ
     I                                        1   40INOYR
     I                                        1   20INOCC
     I                                        3   40INOYY
     I                                        5   60INOMM
     I                                        7   80INODD
     I            DS
     I                                        1   60SPHZ
     I                                        1   20INOMMA
     I                                        3   40INODDA
     I                                        5   60INOYYA
     I            DS
     I                                        1   80PHZ8
     I                                        1   20PCC8
     I                                        3   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60PHZ
     I                                        1   20PMM
     I                                        3   40PDD
     I                                        5   60PYY
     I           SDS
     I                                        1   8 @PGMID
     I                                        1   6 PGMID
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK8I            DS
TCHK8I                                        1  140WSSDT
TCHK8I                                        1   20WSSHHH
TCHK8I                                        3   40WSSNNN
TCHK8I                                        5   60WSSSSS
TCHK8I                                        7  100WSSYYY
TCHK8I                                       11  120WSSMMM
TCHK8I                                       13  140WSSDDD
TCHK8I                                        1   40WSSTM4
TCHK8I                                        1   60WSSTM6
TCHK8I                                        7  140WSSDAT
TCHK3I*
TCHK3I              'EXPEDITE'            C         C#SPBN
TCHK3I*
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           K#P75     KLIST
     C                     KFLD           INOYR
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           INOTM
      *
     C           K#1A      KLIST
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C           K#1AX     KLIST
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IODRN
     C           K#P2A     KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           K@ODRN 20
      ***************************************************
      *   ENTRY
      ***************************************************
     C           *ENTRY    PLIST
     C                     PARM           PWEIG   32
     C                     PARM           PMANI  18
     C                     PARM           PODRN  10
JW5  C                     PARM           D@P6    1
      ***************************************************
     C                     TIME           WTIME   60
TCHK8C                     TIME           WSSDT
TCHK8C                     Z-ADDWSSDAT    PHZ8
     C                     Z-ADDPMM8      PMM
     C                     Z-ADDPDD8      PDD
     C                     Z-ADDPYY8      PYY
     C                     MOVELINONY     PSIRE   4
     C                     MOVELIMHN      IMHNA
     C                     Z-ADDINOMM     INOMMA
     C                     Z-ADDINODD     INODDA
     C                     Z-ADDINOYY     INOYYA
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     11
      *
     C           PSIRE     IFEQ '0541'
     C                     MOVELTTL,2     @@TT2
     C                     ELSE
     C                     MOVELTTL,1     @@TT2
     C                     END
      *
     C           ITOKU     IFEQ 0390
     C           ITOKU     OREQ 0295
     C           ITOKU     OREQ 0294
     C           ITOKU     OREQ 0296
     C           ITOKU     OREQ 5382
     C           ITOKU     OREQ 5379
TCHK1C           ITOKU     OREQ 0400
     C                     MOVELTTL,5     @@SHTL
     C                     MOVELIINV#     @@SHNO
     C                     ELSE
     C                     MOVE *BLANK    @@SHTL
     C                     MOVE *BLANK    @@SHNO
     C                     ENDIF
      *
     C           PSIRE     IFEQ '0437'
     C                     MOVELTTL,3     @@TT1
     C                     ELSE
     C                     MOVELTTL,4     @@TT1
     C                     END
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       10
     C           PSIRE     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVE TB2,A     WNAME   5
     C                     END
     C                     END
      *
     C                     SELEC
     C           ITOKU     WHEQ 0390
     C           ITOKU     OREQ 0295
     C           ITOKU     OREQ 0294
     C           ITOKU     OREQ 0296
     C           ITOKU     OREQ 5382
     C           ITOKU     OREQ 5379
     C                     MOVELIHMH1     @HMH1
     C                     MOVELIHMH2     @HMH2
     C                     MOVELIHMH3     @HMH3
     C                     MOVELIHMH4     @HMH4
     C                     MOVEL@MHNA     @PART
     C           INONY     WHEQ 0291
     C           2         SUBSTIMHN:1    @2      2
     C           5         SUBSTIMHN:3    @5      5
     C           5         SUBSTIMHN:8    @51     5
     C           @2        CAT  '-':0     @PART     P
     C           @PART     CAT  @5:0      @PART     P
     C           @PART     CAT  '-':0     @PART     P
     C           @PART     CAT  @51:0     @PART     P
TCHK6C*
TCHK6C           INONY     WHEQ 3032
JW3  C           INONY     OREQ 3062
JW3  C           INONY     OREQ 3063
JW4  C           INONY     OREQ 3070
JW4  C           INONY     OREQ 3076
JW4  C           INONY     OREQ 3086
TCHK6C                     MOVELIMHN      IMHNB
TCHK6C                     MOVELIMHB1     @MHB1
TCHK6C                     MOVELIMHB2     @MHB3
TCHK6C                     MOVEL@MHNB     @PART
      *
     C                     OTHER
     C                     MOVELIMHN1     @MHN1
     C                     MOVELIMHN2     @MHN2
     C                     MOVELIMHN3     @MHN3
     C                     MOVEL@MHN      @PART
     C                     ENDSL
      *
     C                     SETOF                     50
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WTKRO
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
TCHK8C           A2GSHZ    ANDLEWTODAY
     C                     SETON                     50
     C                     END
     C           *IN50     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C           A2TRHZ    IFGT INOHZ
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     END
     C                     END
      *
TCHKAC                     Z-ADDISRYO     WSRYO   90
      *
JW5  C           D@P6      IFEQ 'Y'
 .   C           ISRYO     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
 .   C           WKOT2     ADD  0         WGROS   72H
 .   C                     ELSE
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
TCHK9C           WKOT2     ADD  PWEIG     WGROS   72H
JW5  C                     ENDIF
      *
      *
     C           ISYOS     IFEQ *ZERO
     C                     Z-ADD*ZERO     WKT1
     C*
     C                     ELSE
     C           ISRYO     DIV  ISYOS     WKT1    40
     C                     MVR            WKT2    40
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     END
     C                     END
      *
     C                     ADD  WKT1      TKT1
     C*
JW5  C           D@P6      IFEQ 'Y'
 .   C           PWEIG     MULT WKT1      @PAL    72
 .   C           WGROS     ADD  @PAL      WEIGH   72
     C                     ELSE
TCHK9C           WGROS     MULT WKT1      WEIGH   72
JW5  C                     ENDIF
      *
     C                     ADD  WEIGH     TEIGH   72
IH   C           TEIGH     MULT 2.2046    WLB1    82H
      *
      * BAR CODE
     C           *INL1     IFEQ *ON
     C                     MOVE *BLANK    NADD1  40
     C                     MOVE *BLANK    NADD2  40
     C                     MOVE *BLANK    NADD3  40
     C                     MOVE *BLANK    NADD4  40
     C                     MOVE *BLANK    NADD5  40
     C                     MOVE *BLANK    NADD6  40
     C                     MOVE *BLANK    WNONY   4
     C                     MOVE INONY     WNONY
     C                     MOVELIODRN     K@ODRN
     C           K#P2A     CHAINAB#PL2A              90
     C           *IN90     IFEQ *OFF
     C                     MOVELACPLNM    NADD1
     C                     MOVELACSHNM    NADD2
     C                     MOVELACSAD1    NADD3
     C                     MOVELACSAD2    NADD4
     C           ACCITY    CAT  ',':0     NADD5     P
     C           NADD5     CAT  ACSTAT:0  NADD5     P
     C           NADD5     CAT  ACZIPC:1  NADD5     P
     C                     ELSE
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
TCHK8C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    NADD1
     C                     MOVELE4ADD2    NADD2
     C                     MOVELE4ADD3    NADD3
     C                     MOVELE4ADD4    NADD4
     C                     MOVELE4ADD5    NADD5
     C                     MOVELE4ADD6    NADD6
     C                     END
     C                     ENDIF
     C                     END
     C                     MOVE *BLANK    SADD1  38
     C                     MOVE *BLANK    SADD2  38
     C                     MOVE *BLANK    SADD3  38
     C                     MOVE *BLANK    SADD4  38
     C                     MOVE *BLANK    SADD5  38
     C                     MOVE *BLANK    SADD6  38
     C                     MOVE '0111'    WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
TCHK8C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    SADD1
     C                     MOVELE4ADD2    SADD2
     C                     MOVELE4ADD3    SADD3
     C                     MOVELE4ADD4    SADD4
     C                     MOVELE4ADD5    SADD5
     C                     MOVELE4ADD6    SADD6
     C                     END
     C                     END
     C                     EXSR #NMBR
TCH41C                     EXSR #PBOX
TCHK3C*
TCHK3C                     MOVEL*BLANK    P@TTLA
TCHK3C           INOTM     IFEQ 33
TCHK3C                     MOVELC#SPBN    P@TTLA
TCHK3C                     END
TCHK3C*
     C                     WRITE@HED
     C                     EXSR #WP37H
     C                     MOVE *OFF      *IN77
     C                     ELSE
      *
     C           *IN77     IFEQ *ON
TCH41C                     EXSR #PBOX
     C                     WRITE@HED
     C                     EXSR #WP37H
     C                     MOVE *OFF      *IN77
     C                     ENDIF
     C                     ENDIF
TCH67C           ITOKU     IFEQ 8990
   | C                     MOVE '1'       *IN61
     C                     MOVELIODRN     IODRX
     C                     ELSE
   | C                     MOVE '0'       *IN61
TCH67C                     ENDIF
TCHK4C*
TCHK4C           INONY     IFEQ 3851
TCHK4C           INONY     OREQ 3852
TCHK4C           IINV#     IFNE *BLANK
TCHK4C                     MOVELIINV#     IODRN
TCHK4C                     END
TCHK4C                     END
TCHK4C*
      *
     C                     WRITE@DTL
     C                     EXSR #WP37D
      *
     CL1                   EXSR #TTL
      *---------------------------------------------------
     C           #TTL      BEGSR
      *---------------------------------------------------
     C           *IN77     IFEQ *ON
TCH41C                     EXSR #PBOX
     C                     WRITE@HED
     C                     EXSR #WP37H
     C                     MOVE *OFF      *IN77
     C                     ENDIF
      *
     C                     WRITE@TTL
     C                     EXSR #WP37T
      *
     C                     Z-ADD*ZERO     TEIGH
     C                     Z-ADD*ZERO     TKT1
     C                     Z-ADD*ZERO     WLB1
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #NMBR     BEGSR
      *---------------------------------------------------
     C           K#P75     SETLLAB#PL75
     C           *IN90     DOUEQ*ON
     C           K#P75     READEAB#PL75                  90
     C           *IN90     IFEQ *OFF
     C           PUSKJY    ANDEQ*BLANK
     C           PUODRN    ANDEQPODRN
     C                     LEAVE
     C                     ENDIF
      *
JW1  C           *IN90     IFEQ *OFF
 |   C           PUSKJY    ANDEQ'C'
 |   C           PUODRN    ANDEQPODRN
 |   C                     LEAVE
JW1  C                     ENDIF
      *
     C                     ENDDO
      *
     C           *IN90     IFEQ *OFF
     C                     MOVELPUSERL    BARC
     C                     ELSE
      *
     C           K#KEY     KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
      *
     C                     MOVEL'PICKLIST'K@KWD1
     C                     MOVE *YEAR     @@YY    2
     C                     MOVE *MONTH    @@MM    2
     C           @@YY      CAT  @@MM:0    K@KWD2    P
     C           K#KEY     CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C                     ADD  1         CTNBR1
     C                     UPDATAB#PPCT1
     C                     ELSE
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     ADD  1         CTNBR1
     C                     WRITEAB#PPCT1
     C                     ENDIF
      *
     C                     Z-ADDCTNBR1    @@5     50
     C                     MOVE @@5       @@5C    5
     C           K@KWD2    CAT  @@5C:0    BARC      P
      *
     C                     CLEARAB#PP751
TCHK8C                     TIME           WSSDT
TCHK8C                     Z-ADDWSSDAT    PUKODT
TCHK8C                     Z-ADDWSSTM6    PUKOTN
     C                     MOVEL#USER     PUKOME
     C                     Z-ADDITOKU     PUCUST
     C                     Z-ADDINONY     PUNONY
     C                     MOVELINKOJ     PUNKOJ
     C                     MOVELINUKE     PUNUKE
     C                     Z-ADDINOTM     PUBINN
     C                     MOVELBARC      PUSERL
     C                     Z-ADDINOYR     PUNOYY
     C                     Z-ADDINOMM     PUNOMM
     C                     Z-ADDINODD     PUNODD
     C                     MOVE PODRN     PUODRN
      *
     C                     WRITEAB#PP751
TCHK6C*
TCHK6C                     CLEARAB#PP781
TCHK8C                     TIME           WSSDT
TCHK8C                     Z-ADDWSSDAT    P8KODT
TCHK8C                     Z-ADDWSSTM6    P8KOTM
TCHK6C                     MOVEL#USER     P8KONM
TCHK6C                     Z-ADDITOKU     P8CUST
TCHK6C                     Z-ADDINONY     P8NONY
TCHK6C                     MOVELINKOJ     P8NKOJ
TCHK6C                     MOVELINUKE     P8NUKE
TCHK6C                     Z-ADDINOTM     P8BINN
TCHK6C                     MOVELBARC      P8SERL
TCHK6C                     Z-ADDINOYR     P8NOYY
TCHK6C                     Z-ADDINOMM     P8NOMM
TCHK6C                     Z-ADDINODD     P8NODD
TCHK6C                     MOVELPODRN     P8ODRN
TCHK8C                     Z-ADDWSSDAT    P8PLDT
TCHK8C                     Z-ADDWSSTM6    P8PLTM
TCHK6C                     MOVEL#USER     P8PLNM
TCHK8C*
TCHK8C                     MOVELINONY     K@NONY
TCHK8C                     MOVELINOTM     K@NOBN
TCHK8C           PODRN     IFNE *BLANK
TCHK8C           K#L7BA    KLIST
TCHK8C                     KFLD           K@NONY  4
TCHK8C                     KFLD           INKOJ
TCHK8C                     KFLD           INUKE
TCHK8C                     KFLD           INOYR
TCHK8C                     KFLD           INOMM
TCHK8C                     KFLD           INODD
TCHK8C                     KFLD           K@NOBN  2
TCHK8C                     KFLD           PODRN
TCHK8C           K#L7BA    CHAINAB#PL7B              90
TCHK8C           *IN90     IFEQ *OFF
TCHK8C                     Z-ADDWSSDAT    P8LPDT
TCHK8C                     Z-ADDWSSTM6    P8LPTM
TCHK8C                     MOVEL#USER     P8LPNM
TCHK8C                     END
TCHK8C                     ELSE
TCHK8C           K#L7BB    KLIST
TCHK8C                     KFLD           K@NONY  4
TCHK8C                     KFLD           INKOJ
TCHK8C                     KFLD           INUKE
TCHK8C                     KFLD           INOYR
TCHK8C                     KFLD           INOMM
TCHK8C                     KFLD           INODD
TCHK8C                     KFLD           K@NOBN  2
TCHK8C           K#L7BB    CHAINAB#PL7B              90
TCHK8C           *IN90     IFEQ *OFF
TCHK8C                     Z-ADDWSSDAT    P8LPDT
TCHK8C                     Z-ADDWSSTM6    P8LPTM
TCHK8C                     MOVEL#USER     P8LPNM
TCHK8C                     END
TCHK8C                     END
TCHK8C*
TCHK6C                     WRITEAB#PP781
      *
JW   C                     Z-ADDWSSDAT    P8CRDT
JW   C                     Z-ADDWSSTM6    P8CRTM
JW   C                     MOVEL#USER     P8CRNM
JW   C                     MOVEL@PGMID    P8CRPG
JW   C                     MOVEL@PGMID    P8PLPG
JW   C                     MOVEL@PGMID    P8KOPG
JW   C                     WRITEAB#PP78R
      *
     C                     ENDIF
      *
     C                     MOVELBARC      @BARC   9
      * AMBRAKE ------------------------------------------
     C           INONY     IFEQ 0291
     C           INONY     OREQ 0271
     C           PODRN     IFEQ *BLANK
     C           K#1A      SETLLAB#PL1A
     C                     ELSE
     C           K#1AX     SETLLAB#PL1A
     C                     ENDIF
      *
     C           *IN90     DOUEQ*ON
     C           PODRN     IFEQ *BLANK
     C           K#1A      READEAB#PL1A                  90
     C                     ELSE
     C           K#1AX     READEAB#PL1A                  90
     C                     ENDIF
      *
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    ANDEQ*BLANK
     C                     MOVELBARC      BAINVN
     C                     UPDATAB#PL141
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
JW2   * AMBRAKE UPDATE AB#PPA1 ---------------------------
 |   C           INONY     IFEQ 0291
 |   C           INONY     OREQ 0271
 |   C           PODRN     IFEQ *BLANK
 |   C           K#1A      SETLLAB#PLAA
 |   C                     ELSE
 |   C           K#1AX     SETLLAB#PLAA
 |   C                     ENDIF
 |    *
 |   C           *IN90     DOUEQ*ON
 |   C           PODRN     IFEQ *BLANK
 |   C           K#1A      READEAB#PLAA                  90
 |   C                     ELSE
 |   C           K#1AX     READEAB#PLAA                  90
 |   C                     ENDIF
 |    *
 |   C           *IN90     IFEQ *OFF
 |   C           BASKJY    ANDEQ*BLANK
 |   C           BAINVN    ANDEQ*BLANK
 |   C                     MOVELBARC      BAINVN
 |   C                     Z-ADDWSSYYY    BAKOYY
 |   C                     Z-ADDWSSMMM    BAKOMM
 |   C                     Z-ADDWSSDDD    BAKODD
 |   C                     Z-ADDWSSHHH    BAKOHH
 |   C                     Z-ADDWSSNNN    BAKOSS
 |   C                     MOVEL#USER     BAKOME
 |   C                     MOVEL@PGMID    BANOPG
 |   C                     UPDATAB#PLAA1
 |   C                     ENDIF
 |   C                     ENDDO
JW2  C                     ENDIF
      *
     C                     ENDSR
TCH41 *---------------------------------------------------
     C           #PBOX     BEGSR
      *---------------------------------------------------
      * IAF
     C                     MOVE INONY     CHRD    4
      *
     C           CHRD      CHAINAB#PL90              65
B0   C           *IN65     IFEQ *OFF
     C           YASKJY    ANDEQ*BLANK
B1   C           YAMXPL    IFGE 120
     C                     MOVE TXT,3     PBOX
     C                     ELSE
     C                     MOVE TXT,4     PBOX
E1   C                     ENDIF
E0   C                     ENDIF
TCHK2C* JATM
TCHK2C           INONY     IFEQ 3515
TCHK2C                     MOVE TXT,5     PBOX
TCHK2C                     END
TCHK2C*
      * FORD RETURNABLE
     C           ITOKU     IFEQ 5149
     C           ITOKU     OREQ 5530
     C           CHRD      IFEQ '5143'
     C           CHRD      OREQ '5161'
     C           CHRD      OREQ '5162'
     C           CHRD      OREQ '5186'
     C           CHRD      OREQ '5187'
     C           CHRD      OREQ '5188'
     C           CHRD      OREQ '5189'
     C           CHRD      OREQ '5191'
     C           CHRD      OREQ '5192'
     C           CHRD      OREQ '5193'
     C           CHRD      OREQ '5194'
     C           CHRD      OREQ '5196'
     C           CHRD      OREQ '5197'
     C           CHRD      OREQ '5198'
JW   C           CHRD      OREQ '5199'
JW   C           CHRD      OREQ '5228'
JW   C           CHRD      OREQ '5229'
     C                     MOVE TXT,1     PBOX
     C                     ELSE
     C                     MOVE TXT,2     PBOX
     C                     ENDIF
     C                     ENDIF
      *
TCH41C                     ENDSR
      *---------------------------------------------------
      *---------------------------------------------------
TCHK8C           *INZSR    BEGSR
TCHK8C*
TCHK8C                     TIME           WSSDT
TCHK8C                     Z-ADDWSSDAT    WTODAY  80
TCHK8C*
TCHK8C                     ENDSR
TCHK8 *---------------------------------------------------
      *---------------------------------------------------
      *---------------------------------------------------
      *  WORK FILE FOR NEW PACKING LIST 2018 *
      *---------------------------------------------------
      * HEADER
     C           #WP37H    BEGSR
     C                     CLEARAB#WP371
     C                     Z-ADDPHZ8      A7PDAT           PRINT DATE
     C                     Z-ADDWTIME     A7PTIM           PRINT TIME
     C                     MOVEL@BARC     A7BARC           SERIAL #
     C                     MOVELITOKU     A7TOKU           CUSTOMERY
     C                     MOVELINONY     A7NONY           DELIVERY
     C                     MOVELINKOJ     A7NKOJ           FACTORY
     C                     MOVELINUKE     A7NUKE           DOCK
     C                     MOVELISHP#     A7SHP#           SHIPPING #
     C                     MOVELP@TTLA    A7EXPE           EXPD
     C*                                 * A7SUBR           SUB ROUTE
     C                     MOVELISIRE     A7SIRE           SUPPLIER
     C                     MOVELPBOX      A7PBOX           CONT. TYPE
     C                     Z-ADDINOHZ     A7DEDT           SHIPPING DATE
     C                     Z-ADDINOTM     A7DETM           SHIPPING TIME
     C*                                 * A7REDT           RELEASE DATE
     C*                                 * A7FSUP           FORD SUP.
     C*                                 * A7FPLT           FORD PLANT
     C*                                 * A7FDCK           FORD DOCK
     C*                                 * A7ASN#           ASN #
     C*                                 * A7PPS#           PACKING SLIP #
     C*                                 * A7BIL#           BILL OF LADING #
     C*                                 * A7DLV#           DELIVERY #
     C                     MOVEL@@SHNO    A7SPR#            SHIPPER #
     C*                                 * A7MAN#           MANIFEST #
     C*                                 * A7PSDT           PLND SHIP DATE
     C*                                 * A7PSTM           PLND SHIP TIME
     C*                                 * A7ORD#           ORDER #
     C*                                 * A7INV#           INVOICE #
     C*                                 * A7RLS#           RELEASE #
     C*                                 * A7SPM#           SHIPMENT #
     C                     MOVELNADD1     A7NAD1           SHIP TO AD1
     C                     MOVELNADD2     A7NAD2           AD2
     C                     MOVELNADD3     A7NAD3           AD3
     C                     MOVELNADD4     A7NAD4           AD4
     C                     MOVELNADD5     A7NAD5           AD5
     C                     MOVELNADD6     A7NAD6           AD6
      *
     C           PSIRE     IFEQ '0437'
     C                     MOVELPMANI     A7MAN#            MANIFEST #
     C                     ELSE
     C                     MOVELPMANI     A7ASN#           ASN #
     C                     ENDIF
     C*
     C                     WRITEAB#WP371
     C*
     C                     ENDSR
      *---------------------------------------------------
      * DETAIL
     C           #WP37D    BEGSR
     C                     CLEARAB#WP371
     C                     MOVEL@PART     A7PART           PART #
     C  N61                MOVELIODRN     A7EOR#           EACH ORDER #
     C   61      'IAF-'    CAT  IODRX:0   A7EOR#           EACH ORDER #
     C*                                 * A7SBAN           KANBAN #
     C                     Z-ADDWKT1      A7EBOX           # OF BOX
     C                     Z-ADDISYOS     A7SYOS           QPC
     C                     Z-ADDWSRYO     A7SRYO           QTY
     C                     Z-ADDWEIGH     A7EPWG           EACH WEIGHT
     C*                    MOVEL        * A7LOC1           LOC 1
     C*                    MOVEL        * A7LOC2           LOC 2
     C*                    MOVEL        * A7LOC3           LOC 3
     C*                    MOVEL        * A7LOC4           LOC 4
     C*                                 * A7LOCA           LOC ALL
     C*
     C                     WRITEAB#WP371
     C*
     C                     ENDSR
      *---------------------------------------------------
      * TOTAL INFO.
     C           #WP37T    BEGSR
     C                     CLEARAB#WP371
     C                     Z-ADDTKT1      A7TBOX           # OF BOX
     C                     Z-ADDTEIGH     A7TNWK           NET WGHT-KG
     C                     Z-ADDWLB1      A7TNWL           NET WGHT-LB
     C*                    Z-ADD        * A7TGWK           GRS WGHT-KG
     C*                    Z-ADD        * A7TGWL           GRS WGHT-LB
     C*                    Z-ADD          A7PPLT           # OF PALLET
     C*
     C                     WRITEAB#WP371
     C*
     C                     ENDSR
      *---------------------------------------------------
      *
** TB1.TB2
3347TMMK
0541NUMMI
3503TMMC
**
ORDER NO.
FRS NO.
MANIFEST#:
ASN #   :
SHIPPER# :
**
 ** FORD RETURNABLE **
 ** FORD BOX **
 ** IAF RETURNABLE **
 ** IAF BOX **
 ** JATM RETURNABLE **
