     H            Y.
     F** AB#R1J ******************************************
     F*  CHECK OBJECT LOCK OF EDI ASN FILES              *
     F*                           T.SAKAKI   2016.10.26  *
     F****************************************** AB#R1J **
     FAB#WP1J IF  F     256            DISK
     FRGAPL11 IF  E           K        DISK
     FAB#WP1J1O   F      80            DISK
     E*
     IAB#WP1J AA  01
     I                                        1 256 #DATA
     I                                        5  14 #FILE
     I                                       16  25 #WSID
     I                                       27  36 #USER
     I                                       47  50 #LCTP
      ***********************************************
      *  MAIN                                       *
      ***********************************************
      *
     C                     MOVE X'0D'     AAA     1
      *
     C           1         SETLLAB#WP1J
      *
     C                     DO   *HIVAL
     C                     READ AB#WP1J                  90
      *
     C           *IN90     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           #LCTP     IFEQ 'MBR '
     C           #USER     ANDNE*BLANK
      *
     C           #USER     CHAINRGAPL111             54
     C           *IN54     IFEQ '0'
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    WUSNM  15
     C                     END
      *
     C                     EXCPTFILE1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * WRITE DATA                                         *
      *----------------------------------------------------*
     OAB#WP1J1E                FILE1
     O                         #FILE
     O                                      ' IS LOCKED BY '
     O                         #USER
     O                                      ' '
     O                         WUSNM
     O                                      ' AT '
     O                         #WSID
     O                         AAA       80
