     H            Y.
     F** AB#R80 ************************************
     F*  FIXED ORDER DATA NOT ON SALES LIST        *
     F*    K.OKACHI                    98.03.12    *
     F*    N.HYOTO 2000.11.21 ADD BIN              *
     F*                                            *
     F* TCHK1 03/27/07 ADD DATE DEFAULT SET        *
     F* TCHK2 10/01/09 ADD IAF P# TO AB#WP80       *
     F* TCHK3 07/12/10 ADD DETAIL INQUIRY FUNCTION(RE-MAKE)
JW1  F* JW    2021.04.28 ADD PACKIG LIST#          *
     F**********************************************
     FAB#PW80 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                              KINFDS @INFDS
     FAB#PL1N IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAB#WP80 O   F     128            DISK
      *
     E                    ER      1   4 60               ERROR MESSAGE
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK1I* SYSTEM TIME
TCHK1I            DS
TCHK1I                                        1  140WSDT
TCHK1I                                        1   20WSSHHH
TCHK1I                                        3   40WSSNNN
TCHK1I                                        5   60WSSSSS
TCHK1I                                        7  100WSSYYY
TCHK1I                                       11  120WSSMMM
TCHK1I                                       13  140WSSDDD
TCHK1I                                        1   40WSSTM4
TCHK1I                                        1   60WSSTM6
TCHK1I                                        7  140WSSDAT
     I            DS
     I                                        1   8 SDATE
     I                                        1   4 SYY
     I                                        5   6 SMM
     I                                        7   8 SDD
     I            DS
     I                                        1   8 EDATE
     I                                        1   4 EYY
     I                                        5   6 EMM
     I                                        7   8 EDD
     I            DS
     I                                        1   80SHIZ
     I                                        1   40SHZYY
     I                                        5   60SHZMM
     I                                        7   80SHZDD
     I            DS
     I                                        1   80EHIZ
     I                                        1   40EHZYY
     I                                        5   60EHZMM
     I                                        7   80EHZDD
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80BAURHZ
     I                                        1   40BAURYY
     I                                        5   60BAURMM
     I                                        7   80BAURDD
     I            DS
     I                                        1  20 BAMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1  12 BASHIN
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I            DS
     I                                        1   80BARLHZ
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
      *
TCHK1C*                    MOVE *BLANK    SDATE
TCHK1C*                    MOVE *BLANK    EDATE
TCHK1C*
TCHK1C                     TIME           WSDT
TCHK1C                     MOVELWSSDAT    SDATE
TCHK1C                     MOVELWSSDAT    EDATE
TCHK1C*
     C           STEP1     TAG
     C                     EXFMTAB#PW801
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
     C                     SETOF                     010299
     C                     EXSR #CHK1
     C           *IN99     IFEQ *ON
     C                     GOTO STEP1
     C                     END
      *
     C                     EXSR #SET#2
     C           *IN99     IFEQ *ON
     C                     GOTO STEP1
     C                     END
     C*
     C                     EXSR #DTL
     C*
     C  NKANKE             GOTO STEP1
      *
     C                     SETON                     LR
     C                     RETRN
     C******************************************************
     C*    CHECK 1ST SCREEN
     C******************************************************
     C           #CHK1     BEGSR
     C*
     C                     DO
     C*
     C           SDATE     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           EDATE     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           SMM       IFGT '12'
     C           SMM       ORLT '01'
     C           SDD       ORGT '31'
     C           SDD       ORLT '01'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           EMM       IFGT '12'
     C           EMM       ORLT '01'
     C           EDD       ORGT '31'
     C           EDD       ORLT '01'
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           SDATE     IFGT EDATE
     C                     SETON                     010299
     C                     MOVE ER,3      MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           *INKE     IFNE '1'
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C*    SET 2ND SCREEN
     C******************************************************
     C           #SET#2    BEGSR
     C*
     C                     MOVEL*ON       *IN61
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C*
     C                     MOVE SDATE     SHIZ    80
     C                     MOVE EDATE     EHIZ    80
     C                     Z-ADD*ZERO     RRN2    40
      *
     C           KEY1      KLIST
     C                     KFLD           SHZYY
     C                     KFLD           SHZMM
     C                     KFLD           SHZDD
     C           KEY1      SETLLAB#PL1N
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AB#PL1N                  10
     C   10                LEAVE
     C           EHIZ      IFLT BANOHZ
     C                     LEAVE
     C                     ENDIF
      *
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           BAURHZ    IFNE *ZERO
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARSFL020
     C*
     C                     Z-ADDBANOHZ    S2NOHZ
     C                     MOVELBANOBN    S2NOBN
     C                     MOVELBATOKU    S2TOKU
     C                     MOVELBANONY    S2NONY
     C                     MOVELBANKOJ    S2NKOJ
     C                     MOVELBANUKE    S2NUKE
     C           K#GADP    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C           K#GADP    CHAINGADPL11              94
     C  N94                MOVELB5KMEI    S2NONM
     C                     MOVELBAMHIN    S2MHIN
     C                     MOVELBASHIN    S2SHIN
     C                     MOVELBASBAN    S2SBAN
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    S2QPC
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    S2QPC
     C                     ELSE
     C                     Z-ADDBASRYO    S2QPC
     C                     END
     C                     END
     C                     Z-ADDBASRYO    S2SRYO
     C                     MOVELBAINVN    S2INVN
     C                     MOVELBAODRN    S2ODRN
JW1   * GET PACKIN LIST#
 .   C                     MOVELBANOHZ    $NOHZ
 .   C                     MOVELBATOKU    $CUST
 .   C                     MOVELBANONY    $NONY
 .   C                     MOVELBANKOJ    $NKOJ
 .   C                     MOVELBANUKE    $NUKE
 .   C                     MOVELBANOBN    $BINN
 .   C                     MOVELBARLHZ    $RLHZ
 .   C                     MOVELBAODRN    $ODRN
 .   C                     CALL 'UTLR51'
 .   C                     PARM           $NOHZ   8
 .   C                     PARM           $CUST   4
 .   C                     PARM           $NONY   4
 .   C                     PARM           $NKOJ   1
 .   C                     PARM           $NUKE   4
 .   C                     PARM           $BINN   2
 .   C                     PARM           $RLHZ   8
 .   C                     PARM           $ODRN  10
 .   C                     PARM           $PICK#  9
 .   C                     PARM           $RTN    1
JW1  C                     MOVEL$PICK#    S2SERL
      *
     C                     Z-ADDBASYOS    H2SYOS
     C                     Z-ADDBAUSYS    H2USYS
      *
     C           RRN2      IFEQ 9999
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020                 31
      *
     C*
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     010299
     C                     MOVE ER,4      MSG
     C                     ENDIF
     C*
     C                     ENDSR
     C******************************************************
     C*    2ND SCREEN
     C******************************************************
     C           #DTL      BEGSR
     C*
     C                     Z-ADD1         W#RNP2  40
     C                     MOVEL*OFF      *IN49
     C*
     C                     DO   *HIVAL
     C*
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
     C   KA
     COR KL                LEAVE
     C*
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     END
     C*
     C           *INKE     IFEQ *ON
     C                     EXSR #PRT
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C*    PRINT DATA CREATE
     C******************************************************
     C           #PRT      BEGSR
     C*
     C                     Z-ADD*ZERO     RRN2
     C*
     C                     DO   *HIVAL
     C*
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
     C*
     C                     Z-ADDS2NOHZ    W8NOHZ  80
     C                     MOVELS2NOBN    W8NOBN  2
     C                     MOVELS2TOKU    W8TOKU  4
     C                     MOVELS2NONY    W8NONY  4
     C                     MOVELS2NKOJ    W8NKOJ  1
     C                     MOVELS2NUKE    W8NUKE  4
     C                     MOVELS2MHIN    W8MHIN 20
     C                     MOVELS2SHIN    W8SHIN 12
     C                     MOVELS2SBAN    W8SBAN  4
     C                     Z-ADDS2SRYO    W8SRYO 100
     C                     MOVELS2ODRN    W8ODRN 10
     C                     Z-ADDH2SYOS    W8SYOS  60
     C                     Z-ADDH2USYS    W8USYS  60
     C*
     C                     EXCPTDAT
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     OAB#WP80 E                DAT
     O                         W8TOKU     4
     O                         W8NONY     8
     O                         W8NKOJ     9
     O                         W8NUKE    13
     O                         W8SBAN    17
     O                         W8MHIN    37
     O                         W8ODRN    47
     O                         W8NOHZ    55
     O                         W8SRYO    65
     O                         SDATE     73
     O                         EDATE     81
     O                         W8NOBN    83
TCHK3O*TCHK2                   W8SHN1    88
TCHK3O*TCHK2                   W8SHN2    93
TCHK3O*TCHK2                   W8SHN3    95
TCHK3O                         W8SHIN    95
TCHK2O                         W8SYOS   101
TCHK2O                         W8USYS   107
**  ER
E-01 START DATE ISN'T IT. INPUT IT.
E-02 END DATE ISN'T IT. INPUT IT.
E-03 THE INPUT VALUE IS DIFFERENT.
M-04 ALL THE DATA IS POSTED.
