     H            Y.
     F** AB#RHF **************************************
     F*  HONDA/GXS FTP INFORMATION MASTER REFERENCE  *
     F*   RMK              2022.08.09                *
     F************************************************
     FAB#PPH4 IF  E                    DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
     C*===============================================================
     C*   ENTRY                                                      *
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@USER 20
     C                     PARM           P@PASS 20
     C                     PARM           P@PORT  70
     C*===============================================================
     C*   MAIN                                                       *
     C*===============================================================
     C           1         SETLLAB#PPH41
     C                     READ AB#PPH41                 21
      *
     C           *IN21     IFEQ *OFF
     C                     MOVELAHUSER    P@USER
     C                     MOVELAHPASS    P@PASS
     C                     Z-ADDAHPORT    P@PORT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
