     H            Y.
     F** AB#R44 ****************************************************
     F*  ..MIXED PALLET    LIST..                                  *
     F*  I-HASADA        97.07.17                                  *
     F*------------------------------------------------------------*
     F* THIS IS FOR MIXED PALLET LIST FOR COMMON CUSTOMER          *
     F* BOX# SHOULD NOT BE OVER MAX/PALLET                         *
     F* EXCEPTION: IF ONE PART HAS OVER MAX BOX, IT DOES NOT SPLIT *
     F*------------------------------------------------------------*
     F* G.ALKHU 02.23.00 CHG FOR CUST 5149 0291                    *
     F* G.ALKHU 03.13.00 CHG FOR CUST 0295 0296 0390               *
     F* K.KASHI 04.03.01 CHG WAY OF COUNTING BOX                   *
TCH55F* TCH     03/28/05 ADD LARGE CHR.                            *
JW1  F* JW      11/29/17 CHG PRINTER FILE                          *
JW2  F* JW      10/23/18 FIX PRINT LARGE LETTER POSITION           *
JW3  F* JW      11/15/19 ADD AB#PP71 (MIXED PALLET TRANS FILE)     *
     F**************************************************************
     FABWPL32 IP  E           K        DISK
     FALAPL01 IF  E           K        DISK
     FAB#PP85 IF  E           K        DISK
JW1  FAB#PR45 O   E             70     PRINTER
JW3  FAB#PP71 UF  E           K        DISK                      A
     E*------------------ TB1     1   3  4   TB2     5
TCH55E                    WW          4  1
     IAB#PL321    01
     I                                              INUKE L3
     I                                              ISBAN L1
     I                                              IMHN  L1
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1   80INOHZ
     I                                        1   40YYYY
     I                                        5   60MM
     I                                        7   80DD
     I            DS
     I                                        1  10 WNOHZ
     I                                        1   2 WNOMM
     I                                        3   3 WNO1
     I                                        4   5 WNODD
     I                                        6   6 WNO2
     I                                        7  10 WNOYY
     I            DS
     I                                        1  17 WMHIN
     I                                        1   5 WMHN1
     I                                        6   6 WMH1
     I                                        7  11 WMHN2
     I                                       12  12 WMH2
     I                                       13  17 WMHN3
     I            DS
 GA  I                                        1   5 WPART1
 GA  I                                        6  10 WPART2
 GA  I                                       11  15 WPART3
 GA  I                                        1   7 IMHN5
 GA  I                                        8  11 IMHN6
 GA  I            DS
 GA  I                                        1   5 WPART4
 GA  I                                        6  10 WPART5
 GA  I                                       11  15 WPART6
 GA  I                                        1   2 IMHN7
 GA  I                                        3   7 IMHN8
 GA  I                                        8  15 IMHN9
 GA  I            DS
 GA  I                                        1  12 WMHIN1
 GA  I                                        1   7 WMHN4
 GA  I                                        8   8 WMH5
 GA  I                                        9  12 WMHN6
      *
 GA  I            DS
 GA  I                                        1  17 WMHIN2
 GA  I                                        1   2 WMHN7
 GA  I                                        3   3 WMH8
 GA  I                                        4   8 WMHN9
 GA  I                                        9   9 WMH10
 GA  I                                       10  17 WMHN11
     I            DS
 GA  I                                        1  17 PARTA
 GA  I                                        1   5 PART1
 GA  I                                        6   6 FLD1
 GA  I                                        7   9 PART2
 GA  I                                       10  10 FLD2
 GA  I                                       11  14 PART3
 GA  I                                       15  17 PART4
 GA  I            DS
 GA  I                                        1  18 PARTB
 GA  I                                        1   5 PART5
 GA  I                                        6   6 FLD3
 GA  I                                        7   9 PART6
 GA  I                                       10  10 FLD5
 GA  I                                       11  11 FLD4
 GA  I                                       12  15 PART7
 GA  I                                       16  18 PART8
     I            DS
 GA  I                                        1   5 NPART1
 GA  I                                        6  10 NPART2
 GA  I                                       11  15 NPART3
 GA  I                                        1   5 NMHN1
 GA  I                                        6   8 NMHN2
 GA  I                                        9  12 NMHN3
 GA  I                                       13  15 NMHN4
     I            DS
     I                                        1   80PHZ8
     I                                        1   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60WTIME
     I                                        1   20THH
     I                                        3   40TMM
     I                                        5   60TSS
JW3  I            DS
 |   I                                        1  140@STIME
 |   I                                        1   60NOW
 |   I                                        7  140TODAY
 |   I            DS
 |   I                                        1  12 ISHN
 |   I                                        1   5 ISHN1
 |   I                                        6  10 ISHN2
 |   I                                       11  12 ISHN3
 |   I           SDS
 |   I                                        1   8 #PGM
 |   I                                      244 253 #WSID
JW3  I                                      254 263 #USER
      ***********************************************
      * MAIN ROUTINE                                *
      ***********************************************
     C           *ENTRY    PLIST
     C                     PARM           PMXPL   30
JW   C                     PARM           PNONY   4
      *
TCH55C                     MOVE '===='    BA1     4
   | C                     MOVE '===='    BA2     4
      *
     C           P#CMD     PLIST
     C                     PARM           #CHR    1
     C                     PARM           #L1     6
     C                     PARM           #L2     6
     C                     PARM           #L3     6
     C                     PARM           #L4     6
     C                     PARM           #L5     6
     C                     PARM           #L6     6
     C                     PARM           #L7     6
   | C                     PARM           #L8     6
TCH55 *
     C           KEY1      KLIST
     C                     KFLD           KTOKU   40       CUSTOMER CODE
     C                     KFLD           KNONY   40       DELIVERY CODE
      *
     C           KEY2      KLIST
     C                     KFLD           KTOKU
     C                     KFLD           KNONY
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
      *
 JW1 C                     MOVEL'R48 '    WPGM
      *
 GA  C                     SETOF                     11
 GA  C           ITOKU     IFEQ 5149
 GA  C                     SETON                     11
 GA  C                     MOVE IMHN1     WPART1
 GA  C                     MOVE IMHN2     WPART2
 GA  C                     MOVE IMHN3     WPART3
 GA  C                     END
 GA  C*
 GA  C                     MOVE '-'       FLD1
 GA  C                     MOVE '-'       FLD2
 GA  C                     MOVE '-'       FLD3
 GA  C                     MOVE '-'       FLD4
 GA  C                     MOVE *BLANK    FLD5
 GA  C                     SETOF                     60
GA310C           ITOKU     IFEQ 0295
GA310C           ITOKU     OREQ 0296
     C                     SETON                     60
 GA  C                     MOVE IMHN1     NPART1
 GA  C                     MOVE IMHN2     NPART2
 GA  C                     MOVE IMHN3     NPART3
 GA  C                     MOVE NMHN1     PART1
 GA  C                     MOVE NMHN2     PART2
 GA  C                     MOVE NMHN3     PART3
 GA  C                     MOVE NMHN4     PART4
 GA  C                     MOVE PARTA     PART   17
     C                     END
 GA  C           ITOKU     IFEQ 0390
     C                     SETON                     60
 GA  C                     MOVE IMHN1     NPART1
 GA  C                     MOVE IMHN2     NPART2
 GA  C                     MOVE IMHN3     NPART3
 GA  C                     MOVE NMHN1     PART5
 GA  C                     MOVE NMHN2     PART6
 GA  C                     MOVE NMHN3     PART7
 GA  C                     MOVE NMHN4     PART8
 GA  C                     MOVELPARTB     PART   17
 GA  C                     END
 GA  C*
 GA  C                     SETOF                     12
 GA  C           ITOKU     IFEQ 0291
 GA  C                     SETON                     12
 GA  C                     MOVE IMHN1     WPART4
 GA  C                     MOVE IMHN2     WPART5
 GA  C                     MOVE IMHN3     WPART6
 GA  C                     END
     C*
     C*-         *INL1     IFEQ '0'
     C                     ADD  FC#BOX    WHAKO
     C*---                 ENDIF
      *
     C                     MOVE YYYY      WNOYY
     C                     MOVE MM        WNOMM
     C                     MOVE DD        WNODD
     C                     MOVE '/'       WNO1
     C                     MOVE '/'       WNO2
      *
     C           *IN70     IFEQ '1'
JW3  C                     ADD  1         @@SKD
     C                     WRITEAB#PR441
JW2  C                     Z-ADD13        LIN#
     C                     SETOF                     70
     C                     END
      *
     CL1                   EXSR SUBR
     CL3                   EXSR DOCR
      *************************************************
      ** END OF MAIN ROUTINE                         **
      *************************************************
      *=======================================
      * WRITE TOTAL INFORMATION
      *=======================================
     C           DOCR      BEGSR
      *
     C                     SETON                     70
      *
TCH55C                     EXSR #LARG
     C                     WRITEAB#PR443
     C                     Z-ADD0         PAGE
JW2  C                     ADD  20        LIN#
      *
     C                     Z-ADD0         THAKO   50
     C                     Z-ADD0         SHAKO   50
      *
      *  GET CUSTOMER NAME
      *
     C                     Z-ADDITOKU     KTOKU
     C                     Z-ADDINONY     KNONY            DELIVERY CODE
     C                     SETOF                     85
     C           KEY1      CHAINALAPL011             85
     C           *IN85     IFEQ '0'
     C                     MOVELTPTPKN    WNAME
     C                     ELSE
     C                     MOVEL*BLANKS   WNAME
     C                     ENDIF
     C                     ENDSR
      *========================================
      * WRITE DETAIL LINE
      *========================================
     C           SUBR      BEGSR
      *
     C           *IN55     IFEQ '0'
     C                     MOVEL*BLANKS   SPART  17        PART#
     C                     MOVEL*BLANKS   SSBAN   4        KANBAN#
     C                     Z-ADD*DATE     PHZ8
     C                     TIME           WTIME
JW3  C                     ADD  1         @@SKD
     C                     WRITEAB#PR441
JW2  C                     Z-ADD13        LIN#
     C                     ENDIF
      *
     C                     MOVE IMHN1     WMHN1
     C                     MOVE '-'       WMH1
     C                     MOVE IMHN2     WMHN2
     C                     MOVE '-'       WMH2
     C                     MOVE IMHN3     WMHN3
      *
GA   C                     MOVE IMHN5     WMHN4
GA   C                     MOVE '-'       WMH5
GA   C                     MOVE IMHN6     WMHN6
GA   C*
GA   C                     MOVE IMHN7     WMHN7
GA   C                     MOVE '-'       WMH8
GA   C                     MOVE IMHN8     WMHN9
GA   C                     MOVE '-'       WMH10
GA   C                     MOVELIMHN9     WMHN11
     C*
 KK  C*                    Z-ADDFC#BOX    WHAKO
     C                     ADD  WHAKO     THAKO
     C                     ADD  WHAKO     SHAKO
      *
     C                     Z-ADDITOKU     KTOKU
     C                     Z-ADDINONY     KNONY            DELIVERY CODE
     C           KEY2      SETGTAB#PP85
     C           *IN90     DOUEQ*ON
     C           KEY2      REDPEAB#PP85                  90
     C           *IN90     IFEQ *OFF
     C           A5DATE    ANDLEINOHZ
     C                     MOVELA5SBAN    WSBAN     P
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVELISBAN     WSBAN     P
     C                     ENDIF
      *
     C           THAKO     IFLE PMXPL
     C           *IN55     OREQ *OFF
     C           *INL1     ANDEQ*ON
      *
JW2  C           LIN#      IFGT 46
 |   C                     WRITEAB#PR449
JW3  C                     ADD  1         @@SKD
 |   C                     WRITEAB#PR441
 |   C                     Z-ADD13        LIN#
JW2  C                     ENDIF
JW3   * OUT AB#PP71
     C           WHAKO     IFNE 0
"    C                     EXSR #PP71
     C                     ENDIF
      *
     C                     WRITEAB#PR442
     C                     ADD  1         LIN#
      *
     C                     Z-ADD0         WHAKO
     C                     ELSE
     C           SHAKO     SUB  WHAKO     THAKO
TCH55C                     EXSR #LARG
     C                     WRITEAB#PR443
JW2  C                     ADD  20        LIN#
     C                     Z-ADDWHAKO     SHAKO
     C                     Z-ADDWHAKO     THAKO
     C                     SETON                     70
JW3  C                     ADD  1         @@SKD
     C                     WRITEAB#PR441
JW2  C                     Z-ADD13        LIN#
     C                     SETOF                     70
JW3   * OUT AB#PP71
     C           WHAKO     IFNE 0
"    C                     EXSR #PP71
     C                     ENDIF
      *
     C                     WRITEAB#PR442
JW2  C                     ADD  1         LIN#
     C                     Z-ADD0         WHAKO
     C                     ENDIF
      *
     C  N55                SETON                     55
      *
     C                     ENDSR
JW3   *========================================
      * OUTPUT AB#PP71
      *========================================
     C           #PP71     BEGSR
      * GET PACKING LIST#
     C                     MOVELINOHZ     $NOHZ   8
     C                     MOVELITOKU     $CUST
     C                     MOVELINONY     $NONY
     C                     MOVELINKOJ     $NKOJ
     C                     MOVELINUKE     $NUKE
     C                     MOVELINOTM     $BINN
     C                     MOVEL'00000000'$RLHZ
     C                     MOVE *BLANK    $ODRN
     C                     CALL 'UTLR51'
     C                     PARM           $NOHZ   8
     C                     PARM           $CUST   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
     C                     PARM           $BINN   2
     C                     PARM           $RLHZ   8
     C                     PARM           $ODRN  10
     C                     PARM           $PICK#  9
     C                     PARM           $RTN    1
      * IF FIRST PACKING#, DELETE PAST RECORD
     C           FIRST     IFEQ 'Y'
     C                     MOVE 'N'       FIRST
     C                     EXSR #DLT
     C                     ENDIF
      *
     C                     CLEARAB#PP711
     C                     Z-ADDTODAY     MPCRHZ           CRT DATE
     C                     Z-ADDNOW       MPCRTM           CRT TIME
     C                     MOVEL#USER     MPCRUS           CRT USER
     C                     MOVEL#PGM      MPCRPG           CRT PGM
     C                     MOVEL#WSID     MPCRWS           CRT WSID
     C                     MOVEL$PICK#    MPSERL           PACKING LIST#
      *
     C                     Z-ADD@@SKD     MPPAL#           PALLET#
     C                     Z-ADDITOKU     MPTOKU           CUST CODE
     C                     Z-ADDINONY     MPNONY           DELIV CODE
     C                     MOVELINKOJ     MPNKOJ           FACTORY
     C                     MOVELINUKE     MPNUKE           DOCK
     C                     MOVELIMHN1     MPMHN1           USER PART1
     C                     MOVELIMHN2     MPMHN2           USER PART2
     C                     MOVELIMHN3     MPMHN3           USER PART3
     C                     MOVELIMHN4     MPMHN4           USER PART4
     C                     Z-ADDINOHZ     MPNOHZ           SHIP DATE
     C                     Z-ADDINOTM     MPNOBN           BIN
     C                     MOVELIODRN     MPODRN           ORDER NO
     C                     MOVELISBAN     MPSBAN           KANBAN#
      * VALUE
     C           WHAKO     MULT ISYOS     MPSRYO           ORDER QTY
     C                     Z-ADDISYOS     MPSYOS           QTY/BOX
     C                     Z-ADDWHAKO     MPHAKO           BOX
     C                     MOVELISHN1     MPSHN1           IAF PART1
     C                     MOVELISHN2     MPSHN2           IAF PART2
     C                     MOVELISHN3     MPSHN3           IAF PART3
     C                     MOVELFCLOC1    MPLOC1           LOC 1
     C                     MOVELFCLOC2    MPLOC2           LOC 2
     C                     MOVELFCLOC3    MPLOC3           LOC 3
     C                     MOVELFCLOC4    MPLOC4           LOC 4
     C                     Z-ADD0         MPTPAL           TTL PALLET#
      *
     C                     WRITEAB#PP711
      *
JW3  C                     ENDSR
      *========================================
JW3   * DELETE PAST RECORD
      *========================================
     C           #DLT      BEGSR
      *
     C           $PICK#    SETLLAB#PP71
     C                     DO   *HIVAL
     C           $PICK#    READEAB#PP71                  98
     C   98                LEAVE
      *
     C           MPSKJY    IFEQ *BLANK
     C                     MOVE 'D'       MPSKJY
     C                     Z-ADDTODAY     MPSKHZ
     C                     UPDATAB#PP711
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *========================================
     C* PRINT LARGE CHRACTER
      *========================================
     C           #LARG     BEGSR
     C                     MOVELWNOMM     WW,1
     C                     MOVE WNOMM     WW,2
     C                     MOVELWNODD     WW,3
     C                     MOVE WNODD     WW,4
     C           1         DO   4         CC      10
     C                     MOVE *BLANKS   #L1
     C                     MOVE *BLANKS   #L2
     C                     MOVE *BLANKS   #L3
     C                     MOVE *BLANKS   #L4
     C                     MOVE *BLANKS   #L5
     C                     MOVE *BLANKS   #L6
     C                     MOVE *BLANKS   #L7
     C                     MOVE *BLANKS   #L8
     C                     MOVE WW,CC     #CHR
     C                     CALL 'AB#R4P'  P#CMD
     C           CC        IFEQ 1
     C                     MOVE #L1       #11
     C                     MOVE #L2       #12
     C                     MOVE #L3       #13
     C                     MOVE #L4       #14
     C                     MOVE #L5       #15
     C                     MOVE #L6       #16
     C                     MOVE #L7       #17
     C                     MOVE #L8       #18
     C                     ENDIF
     C           CC        IFEQ 2
     C                     MOVE #L1       #21
     C                     MOVE #L2       #22
     C                     MOVE #L3       #23
     C                     MOVE #L4       #24
     C                     MOVE #L5       #25
     C                     MOVE #L6       #26
     C                     MOVE #L7       #27
     C                     MOVE #L8       #28
     C                     ENDIF
     C           CC        IFEQ 3
     C                     MOVE #L1       #31
     C                     MOVE #L2       #32
     C                     MOVE #L3       #33
     C                     MOVE #L4       #34
     C                     MOVE #L5       #35
     C                     MOVE #L6       #36
     C                     MOVE #L7       #37
     C                     MOVE #L8       #38
     C                     ENDIF
     C           CC        IFEQ 4
     C                     MOVE #L1       #41
     C                     MOVE #L2       #42
     C                     MOVE #L3       #43
     C                     MOVE #L4       #44
     C                     MOVE #L5       #45
     C                     MOVE #L6       #46
     C                     MOVE #L7       #47
     C                     MOVE #L8       #48
     C                     ENDIF
   | C                     ENDDO
TCH66C                     ENDSR
      *========================================
     C* INITIALIZATION
      *========================================
     C           *INZSR    BEGSR
      *
JW2  C                     Z-ADD0         LIN#    30
JW3  C                     TIME           @STIME
"    C                     Z-ADD0         @@SKD
"    C                     MOVE 'Y'       FIRST   1
      *
     C                     ENDSR
