     H            Y.
     F** AB#R3K *******************************************************
     F*  ..EDI(810) INVOICE DATA & CANADA CUSTOM SHEET REISSURANCE    *
     F*       A.MAMIYA                             2000.10.28         *
     F*
     F*  NOV/28/01   TCH
     F* TCHK1 08/29/06 BUG FIX
     F* TCHK2 09/10/08 CHG PRICE DECIMAL
     F* TCHK3 03/31/14 BUG FIX
     F******************************************************* AB#R3K **
     FAB#PL14 IF  E           K        DISK
     FAB#WP3K1O   F     100            DISK
     I            DS
     I                                        1   80WNOHZ
     I                                        1   40WNOYY
     I                                        5   60WNOMM
     I                                        7   80WNODD
     I            DS
     I                                        1   80WREHZ
     I                                        1   40WREYY
     I                                        5   60WREMM
     I                                        7   80WREDD
     I            DS
     I                                        1  20 #MHIN
     I                                        1   5 #MHN1
     I                                        6  10 #MHN2
     I                                       11  15 #MHN3
     I                                       16  20 #MHN4
      *
     C           KEY1      KLIST
     C                     KFLD           WNOYY
     C                     KFLD           WNOMM
     C                     KFLD           WNODD
     C                     KFLD           WNOBN
     C                     KFLD           WREYY
     C                     KFLD           WREMM
     C                     KFLD           WREDD
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
      *
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PSIRK   1
     C                     PARM           PDOCK   4
     C                     PARM           PNOHZ   8
     C                     PARM           PBIN    20
     C                     PARM           PREHZ   8
     C                     PARM           PFLG    1
     C                     MOVELPSIRE     WNONY   40
     C                     MOVELPSIRK     WNKOJ   1
     C                     MOVELPDOCK     WNUKE   4
     C                     MOVE PNOHZ     WNOHZ   80
     C                     Z-ADDPBIN      WNOBN   20
     C                     MOVE PREHZ     WREHZ   80
      *
     C           KEY1      SETLLAB#PL141
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAB#PL141                 10
     C           *IN10     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           BASKJY    IFEQ 'D'
     C**JW       BASKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     U1
TCHK2C*                    Z-ADDBATANK    WTANK  134
TCHK2C*                    Z-ADDBATANK    @@TANK 114
TCHK2C                     Z-ADDBATANK    WTANK  135
TCHK2C                     Z-ADDBATANK    @@TANK 115
      *
TCHK3C*          WTANK     IFEQ 0
      *
     C                     MOVELBATOKU    #TOKU   4
     C                     MOVELBANONY    #NONY   4
     C                     MOVELBANKOJ    #NKOJ   1
     C                     MOVELBANUKE    #NUKE   4
     C                     MOVELBAMHIN    #MHIN  20
     C                     MOVEL*BLANK    #SHIN  12
     C                     MOVEL*BLANK    #FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           #TOKU
     C                     PARM           #NONY
     C                     PARM           #NKOJ
     C                     PARM           #NUKE
     C                     PARM           #MHIN
     C                     PARM           #SHIN
     C                     PARM           #FLG
      *
TCHK1C*          #FLG      IFEQ '*'
TCHK1C*                    MOVE *BLANK    #MHN3
TCHK1C*                    MOVE *BLANK    #MHN4
TCHK1C*                    END
      *
     C                     MOVE BATOKU    @TOKU   4
     C                     MOVE BANONY    @NONY   4
     C                     MOVE BANKOJ    @NKOJ   1
     C                     MOVE BANUKE    @NUKE   4
     C                     MOVEL#MHIN     @MHIN  20
     C                     MOVE BANOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      *
     C                     Z-ADD@TANK     WTANK
     C                     Z-ADD@TANK     @@TANK
      *
TCHK3C*                    END
      *
     C           WTANK     IFEQ 0
     C                     MOVE '*'       PFLG
     C                     END
      *
     C                     EXCPTDT1
      *
     C                     END
     C           SKP       TAG
     C  N10                ENDDO
      *
     OAB#WP3K1E                DT1
     O                         BATOKU     4
     O                         BANONY     8
     O                         BANKOJ     9
     O                         BANUKE    13
     O                         BAMHIN    33
     O                         BANOHZ    41
     O                         BASRYO    51
     O                         @@TANK    62
     O                         BASHIN    74
     O                         BASYOS    80
