     H            Y.
      ** AB#R13B  ***********************************************
      *  SET ASN BATCH# IN AB#EP14                              *
      *  J.WATANABE   2025.05.09                                *
      ***********************************************************
     FAB#EL14AUF  E           K        DISK
      ***********************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      ** PARAMETER
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C                     Z-ADDTODAY     @DATE   80
     C                     ELSE
     C                     MOVEL$DATE     @DATE
     C                     ENDIF
      ***********************************************************
      * MAIN ROUTINE
      ***********************************************************
      * READ AB#EP14
     C           @DATE     SETLLAB#EL14A
     C                     DO   *HIVAL
     C           @DATE     READEAB#EL14A                 98
     C   98                LEAVE
      * IGNORE
     C           E4BCH#    IFNE 0
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE4PRTN    LTR5    5
      *
     C                     SELEC
     C           LTR5      WHEQ 'HONDA'
     C                     EXSR #HOND
     C           LTR5      WHEQ 'FORD '
     C                     OTHER
     C                     EXSR #TOYO
     C                     ENDSL
      *
     C           E4BCH#    IFNE 0
     C                     UPDATAB#EP141
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *=========================================
      * GET BATCH# FOR HONDA
      *=========================================
     C           #HOND     BEGSR
      *
     C                     MOVELE4PRTN    $PRTN     P
     C                     MOVELE4REF#    $REF#     P
     C                     CALL 'UEXC58HA'
     C                     PARM           $PRTN  30
     C                     PARM           $REF#  14
     C                     PARM           $RCVD   8
     C                     PARM           $RCVT   6
     C                     PARM           $BCH#   7
     C                     PARM           $INT#  14
     C                     MOVEL$BCH#     E4BCH#
      *
     C                     ENDSR
      *=========================================
      * GET BATCH# FOR TOYOTA GROUP
      *=========================================
     C           #TOYO     BEGSR
      *
     C                     MOVELE4PRTN    $PRTN     P
     C                     MOVELE4RCHZ    $RCVD1
     C                     MOVELE4RCT4    $RCVT1
     C                     CALL 'UEXC58TA'
     C                     PARM           $PRTN  30
     C                     PARM           $RCVD1  8
     C                     PARM           $RCVT1  4
     C                     PARM           $RCVD2  8
     C                     PARM           $RCVT2  6
     C                     PARM           $BCH#   7
     C                     PARM           $INT#  14
     C                     MOVEL$BCH#     E4BCH#
      *
     C                     ENDSR
