     H            Y.
     F** AB#R36 **************************************************
     F*  ..RECORDING OF EDI FRS SALES & EDI(810) INVOICE DATA    *
     F*  ..ISSURANCE OF CANADA CUSTOM SHEET                      *
     F*    I-HASADA                             97.06.26         *
     F*                                                          *
     F* TCHK1 05/07/14 ADD LIST SEND-TO NAME                     *
     F************************************************** AB#R36 **
     FMITANKF IP  F     300            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    ME      1   2 20               -
     E                    TB1     1   3  4   TB2    13
     IMITANKF AA  01
     I                                        1   1 W1USRI
     I                                        2   2 W1ODKE
     I                                        3   3 W1TEIS
     I                                        4   70W1TOKU
     I                                        8   8 W1TKOJ
     I                                        9  12 W1TUKE
     I                                       13  160W1NONY
     I                                       17  17 W1NKOJ
     I                                       18  21 W1NUKE
     I                                       22  41 UHN
     I                                       22  26 W1UHN1
     I                                       27  31 W1UHN2
     I                                       32  36 W1UHN3
     I                                       37  41 W1UHN4
     I                                       42  53 SHN
     I                                       42  46 W1SHN1
     I                                       47  51 W1SHN2
     I                                       52  53 W1SHN3
     I                                       54  63 W1KANR
     I                                       64  73 W1ODNO
     I                                       74  760W1EDNO
     I                                       77  83 W1NOBN
     I                                       84  84 W1NOKB
     I                                       85  920NOHZ
     I                                       85  880W1NOYY
     I                                       89  900W1NOMM
     I                                       91  920W1NODD
     I                                       95 102 W1SENO
     I                                      112 112 W1TAKB
     I                                      113 113 W1TATN
     I                                      114 1200W1NOSU
     I                                      121 121 W1SUTN
     I                                      122 1324W1KING
     I                                      133 1400JRHZ
     I                                      133 1360W1JYRY
     I                                      137 1380W1JYRM
     I                                      139 1400W1JYRD
     I                                      141 141 W1JKKB
     I                                      142 142 W1KENS
     I                                      143 1500SEHZ
     I                                      143 1460W1SEIY
     I                                      147 1480W1SEIM
     I                                      149 1500W1SEID
     I                                      151 1580SIHZ
     I                                      151 1540W1SIMY
     I                                      155 1560W1SIMM
     I                                      157 1580W1SIMD
     I                                      159 159 W1JUNJ
     I                                      160 160 W1MACH
     I                                      161 1680MAHZ
     I                                      161 1640W1MACY
     I                                      165 1660W1MACM
     I                                      167 1680W1MACD
     I                                      169 1700W1GETU
     I                                      171 171 W1KURK
     I                                      172 175 W1SEBN
     I                                      178 1800W1HAKO
     I                                      181 1850W1SYUY
     I                                      186 1870W1LTNO
     I                                      188 1910W1PANO
     I                                      192 192 W1MIKB
     I                                      193 1950W1MIHK
     I                                      196 2020W1MISU
     I                                      203 203 W1STKB
     I                                      204 2100W1RECN
     I                                      211 2180URHZ
     I                                      211 2140W1URIY
     I                                      215 2160W1URIM
     I                                      217 2180W1URID
     I                                      219 219 W1TKKB
     I                                      220 220 W1TUKA
     I                                      221 2275W1RATE
     I                                      228 231 W1BANK
     I                                      232 241 W1KOZN
     I                                      242 2490PAHZ
     I                                      242 2450W1PAYY
     I                                      246 2470W1PAYM
     I                                      248 2490W1PAYD
     I                                      250 2612W1PKIN
     I                                      262 2702W1SAGK
     I                                      271 271 RES
      *---------------*
      * DELIVERY DATE *
      *---------------*
     I            DS
     I                                        1  10 NOHIZK
     I                                        1   20W1NOMM
     I                                        3   3 FN1
     I                                        4   50W1NODD
     I                                        6   6 FN2
     I                                        7  100W1NOYY
      *
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PNOHZ   8
     C                     MOVE PNOHZ     WNOHZ   80
      *
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C                     TIME           WTIME   60
     C                     MOVE '/'       FN1
     C                     MOVE '/'       FN2
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       20
     C           PSIRE     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVE TB2,A     WNAME  13
     C                     END
      *
     C                     EXCPTHD
     C                     ENDIF
      *
     C                     SETOF                     505152
     C           W1UHN2    IFNE *BLANK
     C                     SETON                     50
     C                     ENDIF
     C           W1UHN3    IFNE *BLANK
     C                     SETON                     51
     C                     ENDIF
     C           W1UHN4    IFNE *BLANK
     C                     SETON                     52
     C                     ENDIF
      *
     C                     SETOF                     04
     C                     MOVE *BLANK    WSMEI  30
     C           W1TOKU    CHAINFGBPL011             04
     C           *IN04     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C                     MOVE ME,1      RESN   20
      *
     C                     EXCPTMS                         
      *
     C           ICTR      ADD  1         ICTR    50
     C   OF                EXCPTHD                         
     C                     SETOF                     OF
     C           END       TAG
      *
     CLR         ICTR      IFGT 0
     CLR                   EXCPTTO
     CLR                   END
      *
     OQPRINT  E  102           HD
TCHK1O                                   28 'SEND TO SALES TEAM'
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                                   12 'AB#R36-1'
     O                         WNAME     27
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O                                    8 'DATE'
     O                         WNOHZ     20 '    .  .  '
     O                                   65 'UNDECIDED UNIT PRICE'
     O                                   70 'LIST'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  1             HD
     O                                    9 'CUSTOMER'
     O                                   50 'DELIVERY'
     O                                   64 'USER'
     O                                   94 'DELIVERY'
     O        E  2             HD
     O                                    7 'CODE'
     O                                   14 'NAME'
     O                                   48 'CODE'
     O                                   52 'F'
     O                                   57 'RCV'
     O                                   67 'PART NO'
     O                                   92 'DATE'
     O                                  105 'ORDER NO'
     O                                  124 'ERROR REASON'
     O        E  1             MS
     O                         W1TOKU     7
     O                         WSMEI     40
     O                         W1NONY    48
     O                         W1NKOJ    52
     O                         W1NUKE    58
     O                         W1UHN1    65
     O                 50                66 '-'
     O                         W1UHN2    71
     O                 51                72 '-'
     O                         W1UHN3    77
     O                 52                78 '-'
     O                         W1UHN4    83
     O                         NOHIZK    95
     O                         W1ODNO   107
     O*                                 108 '-'
     O*                        W1EDNO   111
     O                         RESN     132
     O        E 2              TO
     O                                   30 'TOTAL'
     O                         ICTR      38 '  , * '
**
@M/F UNDECIDED
OTHERS
** TB1.TB2
3347EDI(830)TMMK
0541EDI(830)NUMMI
3503EDI(830)TMMC
