     H            Y.
     F** AB#RF81 *******************************************
     F*  MIXED LOAD LIST(copy from AB#RF8)                 *
     F*                                                    *
     F*  TCHK1  05.11.04 CREATE                            *
     F**************************************** AB#RF81 *****
     FABF6L05 IF  E           K        DISK
     FABF9L01 IF  E           K        DISK
     FABF6PW1 IF  E           K        DISK
     FABF4P01 IF  E           K        DISK
     FAB#WPF8HO   E                    DISK
     FAB#WPF8DO   E                    DISK
     E************************************************
 GA  E                    AR1        20  1
 GA  E                    AR2        20  1
     E                    PLT       100  2 0
     I************************************************
     I* DELIVERY DATE
     I            DS
     I                                        1   8 WSHDT
     I                                        1   80KSHDT
     I                                        1   40WSHYY
     I                                        5   60WSHMM
     I                                        7   80WSHDD
     I            DS
     I                                        1   8 WREDT
     I                                        1   80KREDT
     I                                        1   40KREYY
     I                                        5   60KREMM
     I                                        7   80KREDD
     I                                        1   40WDEYY
     I                                        5   60WDEMM
     I                                        7   80WDEDD
     I* DELIVERY CODE
     I            DS
     I                                        1  13 WNOHB
     I                                        1  10 WNOHZ
     I                                        1   4 WNOYY
     I                                        5   5 WNO1
     I                                        6   7 WNOMM
     I                                        8   8 WNO2
     I                                        9  10 WNODD
     I                                       11  11 WNO3
     I                                       12  13 WNOBN
     I            DS
     I                                        1  10 WREHZ
     I                                        1   4 WREYY
     I                                        5   5 WRE1
     I                                        6   7 WREMM
     I                                        8   8 WRE2
     I                                        9  10 WREDD
     I            DS
     I                                        1   6 WDELY
     I                                        1   1 WKK1
     I                                        2   5 @DELY
     I                                        6   6 WKK2
     I* PART EDIT(W,N   YL)
TCHK1I            DS
TCHK1I                                        1  20 WPARTN
TCHK1I                                        1   5 WPART1
TCHK1I                                        6  10 WPART2
TCHK1I                                       11  15 WPART3
TCHK1I                                        1   1 WPARTL
TCHK1I                                        1   7 IPRT1
TCHK1I                                        8  16 IPRT2
TCHK1I                                        8  11 IP1
TCHK1I                                       12  16 IP2
TCHK1I                                        1   4 IPRT3
TCHK1I                                        5   9 IPRT4
TCHK1I                                       10  15 IPRT5
TCHK1I            DS
TCHK1I                                        1  20 PARTN1
TCHK1I                                        1   7 PRT1
TCHK1I                                        8   8 PR1
TCHK1I                                        9  20 PRT2
TCHK1I            DS
TCHK1I                                        1  20 PARTN2
TCHK1I                                        1   4 PRT3
TCHK1I                                        5   5 PR2
TCHK1I                                        6  10 PRT4
TCHK1I                                       11  11 PR3
TCHK1I                                       12  17 PRT5
TCHK1I*
     I            DS
     I                                        1   80F9SKHZ
     I                                        1   40F9SKYY
     I                                        5   60F9SKMM
     I                                        7   80F9SKDD
     I* SYSTEM DATE & TIME
     I            DS
     I                                        1  120WDTTM
     I                                        1   2 PTHHH
     I                                        3   4 PTMMM
     I                                        5   6 PTDDD
     I                                        7   8 PYYYY
     I                                        9  10 PMMMM
     I                                       11  12 PDDDD
     C************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4
     C                     PARM           PDOCK   4
     C                     PARM           PSHDT   80
     C                     PARM           PSHTM   20
     C                     PARM           PREHZ   80
      *
     C           KEY1      KLIST
     C                     KFLD           KSHDT
     C                     KFLD           KSHTM
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C                     KFLD           KDELY
     C                     KFLD           KDOCK
      *
     C           KEY2      KLIST
     C                     KFLD           KSHDT
     C                     KFLD           KSHTM
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C                     KFLD           KDELY
     C                     KFLD           KDOCK
     C                     KFLD           KPLAT
     C                     KFLD           KCPAR
     C           K#FW      KLIST
     C                     KFLD           FCDELY
     C                     KFLD           FCDOCK
     C                     KFLD           FCSHDT
     C                     KFLD           FCSHTM
     C                     KFLD           FCRYYY
     C                     KFLD           FCRMMM
     C                     KFLD           FCRDDD
     C                     KFLD           FC#PLT
      *
     C           *LIKE     DEFN FCCPAR    KCPAR
     C           *LIKE     DEFN FCCPAR    @CPAR
     C           *LIKE     DEFN FC#PLT    KPLAT
     C           *LIKE     DEFN FC#PLT    @PLAT
     C                     Z-ADD*ZERO     @CONT   30
     C*
     C                     SETON                     77
     C                     MOVE PSHDT     KSHDT   80
     C                     Z-ADDPSHTM     KSHTM   20
     C                     MOVE PREHZ     KREHZ   80
     C                     MOVE PSIRE     KDELY   40
     C                     MOVE PDOCK     KDOCK   4
     C*
     C                     TIME           WDTTM
 GA  C                     MOVE *BLANK    WPART  20
     C                     MOVE *BLANK    WPBCD   1
 GA  C                     MOVEA*BLANK    AR1
 GA  C                     MOVEA*BLANK    AR2
     C                     Z-ADD*ZERO     WPLAT   20
     C                     MOVE PSHDT     WSHDT
     C                     MOVE WSHYY     WNOYY
     C                     MOVE '/'       WNO1
     C                     MOVE WSHMM     WNOMM
     C                     MOVE '/'       WNO2
     C                     MOVE WSHDD     WNODD
     C                     MOVE '-'       WNO3
     C                     MOVE PSHTM     WNOBN
     C                     MOVE PREHZ     WREDT
     C                     MOVE WDEYY     WREYY
     C                     MOVE '/'       WRE1
     C                     MOVE WDEMM     WREMM
     C                     MOVE '/'       WRE2
     C                     MOVE WDEDD     WREDD
      *
     C                     SETOF                     10
     C           PSIRE     CHAINABF9P011             10
     C           *IN10     IFEQ '0'
     C           F9SKJY    IFEQ 'D'
     C           F9SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELF9DOCK    WPLAN   5
     C                     END
     C                     END
      *
     C                     Z-ADD*ZERO     PLT
     C                     Z-ADD*ZERO     X       30
     C           KEY1      SETLLABF6P011
     C           *IN81     DOUEQ*ON
     C           KEY1      READEABF6P011                 81
     C           *IN81     IFEQ *OFF
     C           FCSKJY    ANDNE'D'
      *
     C           FC#PLT    LOKUPPLT                      11
     C           *IN11     IFEQ *OFF
     C           K#FW      CHAINABF6PW1              96
     C           *IN96     IFEQ *ON
TCHK1C********** *IN96     OREQ *OFF
TCHK1C********** WCPRNT    ANDNE*BLANK
     C                     ITER
     C                     ENDIF
     C                     ADD  1         X
     C                     Z-ADDFC#PLT    PLT,X
     C                     ENDIF
      *
     C           FCCPAR    IFNE @CPAR
     C           @CONT     ANDGT*ZERO
     C           FC#PLT    ORNE @PLAT
     C           @CONT     ANDGT*ZERO
     C                     MOVE @CPAR     KCPAR
     C                     Z-ADD@PLAT     KPLAT
     C                     EXSR #OUT
     C                     Z-ADD*ZERO     @CONT
     C           KEY2      SETGTABF6P011
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE FCCPAR    @CPAR
     C                     Z-ADDFC#PLT    @PLAT
     C           FCPBCD    IFNE 'M'
     C           FCPRNT    ANDNE'C'
     C                     ADD  1         @CONT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @CONT     IFGT *ZERO
     C                     MOVE @CPAR     KCPAR
     C                     Z-ADD@PLAT     KPLAT
     C                     EXSR #OUT
     C                     ENDIF
     C*
     C                     SETON                     LR
     C                     RETRN
      *------------------------------------------------------
     C           #OUT      BEGSR
      *------------------------------------------------------
     C                     MOVE *OFF      *IN90
     C                     MOVE *BLANK    WPART
     C           KEY2      SETLLABF6P011
     C           KEY2      READEABF6P011                 90
     C*
     C           *IN90     DOWEQ'0'
     C           FCSKJY    IFNE 'D'
     C*
     C           WPLAT     IFNE FC#PLT
     C                     MOVE FC#PLT    WPLAT
     C                     MOVE '('       WKK1
     C                     MOVE FCDELY    @DELY
     C                     MOVE ')'       WKK2
     C                     MOVE FCDOCK    WDOCK   4
TCHK1C                     EXSR @OTF8H
     C                     SETON                     50
     C                     END
      *
     C* EDIT PART NUMBER
 GA  C           WPART     IFNE FCCPAR
 GA  C           FC#PLT    ORNE WPLAT
     C           WPART     IFNE *BLANK
     C                     MOVE *OFF      *IN50
     C                     ENDIF
      *
 GA  C                     MOVELFCCPAR    WPART
 GA  C                     Z-ADD1         I       20
 GA  C                     Z-ADD1         N       20
     C                     MOVE *BLANK    AR2
 GA  C                     MOVEAFCCPAR    AR1
 GA  C           1         DO   20        I       20
 GA  C           AR1,I     IFNE *BLANK
 GA  C                     MOVE AR1,I     AR2,N
 GA  C                     ADD  1         N       20
 GA  C                     END
 GA  C                     ENDDO
TCHK1C                     MOVEAAR2       WPARTN
TCHK1C           WPARTL    IFEQ 'W'
TCHK1C           WPARTL    OREQ 'N'
TCHK1C                     MOVE IPRT1     PRT1
TCHK1C                     MOVE '-'       PR1
TCHK1C           IP2       IFEQ *BLANK
TCHK1C                     MOVELIPRT2     PRT2      P
TCHK1C                     ELSE
TCHK1C           IP1       CAT  '-':0     PRT2      P
TCHK1C           PRT2      CAT  IP2:0     PRT2      P
TCHK1C                     END
TCHK1C                     MOVELPARTN1    WMHIN  20 P
TCHK1C                     ELSE
TCHK1C                     MOVE IPRT3     PRT3
TCHK1C                     MOVE '-'       PR2
TCHK1C                     MOVE IPRT4     PRT4
TCHK1C                     MOVE '-'       PR3
TCHK1C                     MOVE IPRT5     PRT5
TCHK1C                     MOVELPARTN2    WMHIN     P
TCHK1C                     END
     C                     SETOF                     50
TCHK1C                     EXSR @OTF8D
     C                     MOVE FCPBCD    WPBCD
     C                     MOVE FC#PLT    WPLAT
     C                     ELSE
     C                     MOVE *BLANK    WMHIN
     C                     END
     C*
     C*          WPBCD     IFNE FCPBCD
     C*                    MOVE FCPBCD    WPBCD
     C*                    END
     C*
     C                     END
     C*
     C           KEY2      READEABF6P011                 90
     C                     END
      *
     C                     ENDSR
TCHK1C*------------------------------------------------------
TCHK1C*  Create Mixed Load Summary work file HEADER
TCHK1C*------------------------------------------------------
TCHK1C           @OTF8H    BEGSR
TCHK1C*
TCHK1C                     CLEARABWPF8HR
TCHK1C*
TCHK1C                     Z-ADDPSHDT     FHSHDT
TCHK1C                     MOVELPSHTM     FHNOBN
TCHK1C                     Z-ADDPREHZ     FHRLDT
TCHK1C                     MOVELPSIRE     FHNONY
TCHK1C                     MOVELWPLAN     FHPLNT
TCHK1C                     MOVELWDOCK     FHNUKE
TCHK1C           K#F4P     KLIST
TCHK1C                     KFLD           WSIRE            DELIVERY
TCHK1C                     KFLD           WDOCK            DOCK
TCHK1C                     KFLD           PSHDT            SHIP DATE
TCHK1C                     KFLD           PSHTM            BIN
TCHK1C                     KFLD           KREYY            RELEASED YY
TCHK1C                     KFLD           KREMM
TCHK1C                     KFLD           KREDD
TCHK1C                     MOVELPSIRE     WSIRE   40
TCHK1C           K#F4P     CHAINABF4P01              95
TCHK1C  N95                Z-ADDYBPS#     FHPS#
TCHK1C******************** MOVELPBIL#     FHBL#
TCHK1C                     MOVELWPLAT     FHPL#
TCHK1C*
TCHK1C                     WRITEABWPF8HR
TCHK1C*
TCHK1C                     ENDSR
TCHK1C*------------------------------------------------------
TCHK1C*  Create Mixed Load Summary work file DETAIL
TCHK1C*------------------------------------------------------
TCHK1C           @OTF8D    BEGSR
TCHK1C*
TCHK1C                     DO
TCHK1C*
TCHK1C                     MOVELWPLAT     W@@A02  2
TCHK1C           FHPS#     IFEQ FDPS#
TCHK1C           W@@A02    ANDEQFDPL#
TCHK1C           WMHIN     ANDEQFDUPRT
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C*
TCHK1C                     CLEARABWPF8DR
TCHK1C*
TCHK1C                     Z-ADDFHPS#     FDPS#
TCHK1C                     MOVELWPLAT     FDPL#
TCHK1C                     MOVELWMHIN     FDUPRT
TCHK1C                     Z-ADD@CONT     FDCONT
TCHK1C                     Z-ADDFCUQTY    FDSYOS
TCHK1C           @CONT     MULT FCUQTY    FDQTY
TCHK1C*
TCHK1C                     WRITEABWPF8DR
TCHK1C*
TCHK1C                     ENDDO
TCHK1C*
TCHK1C                     ENDSR
