     H            Y.
     F** AB#R3SC ************************************************************
     F*  ADJUST PP2A - SYNCHORONIZE PP10 AND PP2A                           *
     F*  (READ PP10 AND CREATE PP2A IF IT DOES NOT EXIST)                   *
     F*  JW     2024.11.11
     F***********************************************************************
     FAB#TL1A IF  E           K        DISK
     FAB#PL2ACIF  E           K        DISK
      *****************************************************************
     I            DS
     I                                        1   80@DATE
     I                                        1   40@DATYY
     I                                        5   60@DATMM
     I                                        7   80@DATDD
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-------------------------------------------------------------
      *  MAIN
      *-------------------------------------------------------------
     C                     EXSR #INIT
      *
     C           K#DATE    SETLLAB#TL1A
     C                     DO   *HIVAL
     C                     READ AB#TL1A                  98
     C   98                LEAVE
      *
     C                     EXSR #CHK1
      *
     C           EFLG      IFEQ 'N'
     C                     EXSR #WRT1
     C                     ADD  1         CNT1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-------------------------------------------------------------
      *  CHECK PP2A
      *-------------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE 'N'       EFLG    1
      *
     C                     Z-ADDBANONY    KCNONY
     C                     MOVELBAODRN    KCODRN
     C                     Z-ADDBANOBN    KCBIN
     C                     MOVELBAMHN1    KCMHN1
     C                     MOVELBAMHN2    KCMHN2
     C                     MOVELBAMHN3    KCMHN3
     C                     MOVELBAMHN4    KCMHN4
     C           K#01      SETLLAB#PL2AC
     C                     DO   *HIVAL
     C           K#01      READEAB#PL2AC                 97
     C   97                LEAVE
      *
     C           ACUPID    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE 'Y'       EFLG
     C                     LEAVE
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------------
      *  WRITE PP2A
      *-------------------------------------------------------------
     C           #WRT1     BEGSR
      *
     C                     ENDSR
      *-------------------------------------------------------------
      *  INITIALIZE
      *-------------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
      *
     C           K#DATE    KLIST
     C                     KFLD           @DATYY
     C                     KFLD           @DATMM
     C                     KFLD           @DATDD
      *
     C           K#01      KLIST
     C                     KFLD           KCNONY  40
     C                     KFLD           KCODRN 20
     C                     KFLD           KCBIN   20
     C                     KFLD           KCMHN1  5
     C                     KFLD           KCMHN2  5
     C                     KFLD           KCMHN3  5
     C                     KFLD           KCMHN4  5
      *
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C           $DATE     OREQ *ZERO
     C                     Z-ADDTODAY     @DATE
     C                     ELSE
     C                     MOVEL$DATE     @DATE
     C                     ENDIF
      *
     C                     Z-ADD0         CNT1    40
      *
     C                     ENDSR
