     H            Y.
      ** AB#R13A  ***********************************************
      *  SET ASN 824 STATUS IN AB#EP14                          *
      *  J.WATANABE   2025.05.09                                *
      ***********************************************************
     FAB#EP14 UF  E           K        DISK
      ***********************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      ** PARAMETER
     C           *ENTRY    PLIST
     C                     PARM           $DATE   8
     C                     TIME           SDATE
     C           $DATE     IFEQ *BLANK
     C                     Z-ADDTODAY     @DATE   80
     C                     ELSE
     C                     MOVEL$DATE     @DATE
     C                     ENDIF
      ***********************************************************
      * MAIN ROUTINE
      ***********************************************************
      * READ AB#EP14
     C           @DATE     SETLLAB#EP14
     C                     DO   *HIVAL
     C           @DATE     READEAB#EP14                  98
     C   98                LEAVE
      * IGNORE
     C           E4ACHZ    IFNE 0
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELE4PRTN    LTR5    5
      *
     C                     SELEC
     C           LTR5      WHEQ 'HONDA'
     C                     EXSR #HOND
     C           LTR5      WHEQ 'FORD '
     C                     EXSR #FORD
     C                     OTHER
     C                     EXSR #TOYO
     C                     ENDSL
      *
     C                     SELEC
     C           $STT      WHEQ 'YES'
     C                     MOVEL'YES'     E4ACTP
     C                     MOVEL$DATE     E4ACHZ
     C                     MOVEL$TIME     E4ACTM
     C           $STT      WHEQ 'NO '
     C                     MOVEL'NO '     E4ACTP
     C                     MOVEL$DATE     E4ACHZ
     C                     MOVEL$TIME     E4ACTM
     C                     OTHER
     C                     MOVEL'---'     E4ACTP
     C                     ENDSL
      *
     C                     UPDATAB#EP141
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *=========================================
      * GET ASN STATUS FOR HONDA
      *=========================================
     C           #HOND     BEGSR
      *
     C                     MOVE *BLANK    $STT
      *
     C                     MOVELE4ASN#    LTR6    6
     C                     MOVEL'00'      LTR8    8
     C                     MOVE LTR6      LTR8
     C                     MOVELLTR8      $SHID     P
     C                     CALL 'UEXR59H'
     C                     PARM           $SHID  10
     C                     PARM           $STT    3
     C                     PARM           $DATE   8
     C                     PARM           $TIME   6
      *
     C                     ENDSR
      *=========================================
      * GET ASN STATUS FOR FORD
      *=========================================
     C           #FORD     BEGSR
      *
     C                     MOVE *BLANK    $STT
      *
     C                     MOVELE4SHID    $SHID     P
     C                     CALL 'UEXR59F'
     C                     PARM           $SHID  10
     C                     PARM           $STT    3
     C                     PARM           $DATE   8
     C                     PARM           $TIME   6
      *
     C                     ENDSR
      *=========================================
      * GET ASN STATUS FOR TOYOTA GROUP
      *=========================================
     C           #TOYO     BEGSR
      *
     C                     MOVE *BLANK    $STT
      *
     C           E4NONY    IFEQ 0323
     C                     MOVELE4REF#    $SHID     P
     C                     ELSE
     C                     MOVELE4SHID    $SHID     P
     C                     ENDIF
      *
     C                     CALL 'UEXR59T'
     C                     PARM           $SHID  10
     C                     PARM           $STT    3
     C                     PARM           $DATE   8
     C                     PARM           $TIME   6
      * SUBARU
     C           $STT      IFEQ *BLANK
     C           E4NONY    IFEQ 3611                       SUBARU,IN LAFAYETTE
     C           E4NONY    OREQ 3617                       SUBARU,KY
     C           E4NONY    OREQ 3618                       SYBARU,IN AUSTIN
     C           E4NONY    OREQ 3764                       TMMAL
     C           E4NONY    OREQ 3804                       TMMI
     C           E4NONY    OREQ 3428                       TMMMS
     C           E4NONY    OREQ 3481                       TMMBC
     C           E4NONY    OREQ 3226                       TMMGT
     C           E4NONY    OREQ 3851                       TMMTX
     C           E4NONY    OREQ 3931                       TMMWV
     C           E4NONY    OREQ 3771                       MTMUS
     C           E4NONY    OREQ 3347                       TMMK
     C           E4NONY    OREQ 3423                       TABC
     C                     MOVEL'YES'     $STT
     C                     MOVELTODAY     $DATE
     C                     MOVELNOW       $TIME
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
