     H            Y/
     F** ABAR1H ***************************************
     F*   EDI FORECAST DATA - TEXT MESSAGE        *
     F*     H-AMANO                      10.15.03     *
     F*
     F*
     F*
     F*
     F*************************************** ABAR1H **
     FABAEP30 IP  E           K        DISK
     FGADPL11 IF  E           K        DISK
     F**QPRINT  O   F     132     OF     PRINTER
JW   FQPRINT  O   F     198     OF     PRINTER
      *-------------------------------------------------------
     IABAEP301
     I                                              A3CUSTL1
     I                                              A3SHTOL1
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-------------------------------------------------------
     C           *INL1     IFEQ *ON
     C           K#GAD     CHAINGADPL11              97
     C                     ENDIF
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
%0001 *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#GAD     KLIST
     C                     KFLD           A3CUST
     C                     KFLD           A3SHTO
      *
     C                     TIME           @@TIME  60
      *
     C                     ENDSR
      *--------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  110
     O                         @@TIME   119 '  :  :  '
     O                                  121 'P.'
     O                         PAGE  Z  125
     O        E   02           @HED
     O                                   48 '**  EDI FORECAST DATA - '
     O                                   64 'TEXT MESSAGE **'
     O        E   04           @HED
     O                                   10 'CUSTOMER'
     O                                   55 'USER PART NUBER'
     O                                   66 'MESSAGE'
     O        E 1              @DTL
     O                       L1A3CUST4    6
     O                       L1A3SHTO4   12
     O**JW                   L1B5KMEI    38
     O                         A3MHIN    59
     O                         A3MSG1   129
     O        E 1              @DTL
     O                         A3MSG2   129
      *
