     H            Y.
     F** ABAR1O *************************
     F*  ..ATS FORECAST                 *
     F*          SCHEDULED DATA FILE..  *
     F*                                 *
     F*
     F*
     F*
     F*
     F************************* ABAR1O **
     FATSFCST IP  F    1024            DISK
     FAGDPL12 IF  E           K        DISK
     FFCCTL13 IF  E           K        DISK
     FAB#PP85 IF  E           K        DISK
     FABAWP10 UF  E           K        DISK                      A
     FABBPL50 IF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
      *---------------------------------------------------------
     E                    HSU        31  7 0
     E                    HYM         7  8 0
     E                    DAT        54  8 0
     E                    QTY        54  9 0
     E                    ARY       244  1
     E                    AR4         4  1
     E                    AR4X        4  1
     E                    AR12       12  1
     E                    AR9         9  1
     E                    AR9X        9  1
     E                    A21         2  1
     E                    A22         2  1
     IATSFCST AA  01
     I                                        1  12 RECNO
     I                                       13 256 DATA
     I            DS
     I                                        1 2170HSU
     I                                        1   70ABNN01
     I                                        8  140ABNN02
     I                                       15  210ABNN03
     I                                       22  280ABNN04
     I                                       29  350ABNN05
     I                                       36  420ABNN06
     I                                       43  490ABNN07
     I                                       50  560ABNN08
     I                                       57  630ABNN09
     I                                       64  700ABNN10
     I                                       71  770ABNN11
     I                                       78  840ABNN12
     I                                       85  910ABNN13
     I                                       92  980ABNN14
     I                                       99 1050ABNN15
     I                                      106 1120ABNN16
     I                                      113 1190ABNN17
     I                                      120 1260ABNN18
     I                                      127 1330ABNN19
     I                                      134 1400ABNN20
     I                                      141 1470ABNN21
     I                                      148 1540ABNN22
     I                                      155 1610ABNN23
     I                                      162 1680ABNN24
     I                                      169 1750ABNN25
     I                                      176 1820ABNN26
     I                                      183 1890ABNN27
     I                                      190 1960ABNN28
     I                                      197 2030ABNN29
     I                                      204 2100ABNN30
     I                                      211 2170ABNN31
     I            DS
     I                                        1  20 ABMHIN
     I                                        1   5 ABMHN1
     I                                        6  10 ABMHN2
     I                                       11  15 ABMHN3
     I                                       16  20 ABMHN4
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
     I            DS
     I                                        1   80@NYMD
     I                                        1   60@NYM
     I                                        7   80D
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80WSDAT
     I                                        1   40WSYY
     I                                        5   60WSMM
     I                                        7   80WSDD
     I            DS
     I                                        1  12 PSHIN
     I                                        1   5 PSHN1
     I                                        6  10 PSHN2
     I                                       11  12 PSHN3
     I            DS
     I                                        1   8 YMD
     I                                        1   4 YYY
     I                                        5   6 MMM
     I                                        7   8 DDD
     I            DS
     I                                        1   40WEEK
     I                                        1   20WY
     I                                        3   40WW
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C                     MOVEADATA      ARY
     C           *IN99     IFEQ *OFF
     C                     EXSR #DAT
     C                     MOVE *ON       *IN99
     C                     GOTO @END
     C                     ENDIF
      * PART NUMBER
     C                     MOVE *BLANK    AR12
     C                     Z-ADD*ZERO     Y
     C           1         DO   15        X
     C           ARY,X     IFNE '-'
     C           ARY,X     ANDNE','
     C                     ADD  1         Y
     C                     MOVE ARY,X     AR12,Y
     C                     ENDIF
     C           ARY,X     IFEQ ','
     C           Y         ANDGT*ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
     C                     MOVEAAR12      @12    12
     C                     MOVEL@12       WMHIN
      *  QTY
     C                     MOVEA'00'      *IN,90
     C                     Z-ADD*ZERO     QTY
     C                     MOVE *BLANK    AR9
     C                     Z-ADD*ZERO     Y
     C                     Z-ADD*ZERO     W
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           ARY,X     IFEQ *BLANK
     C           Y         ANDEQ*ZERO
     C                     LEAVE
     C                     ENDIF
     C           ARY,X     IFEQ ','
     C           Y         ANDEQ*ZERO
     C                     ITER
     C                     ENDIF
     C           ARY,X     IFEQ ','
     C           ARY,X     OREQ *BLANK
     C                     MOVE *ALL'0'   AR9X
     C                     Z-ADD9         A
     C                     Z-ADD9         B
     C                     DO   9
     C           AR9,A     IFNE *BLANK
     C                     MOVE AR9,A     AR9X,B
     C                     SUB  1         B
     C                     ENDIF
     C                     SUB  1         A
     C           A         IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAAR9X      @9      9
     C                     SELEC
     C           *IN90     WHEQ *OFF
     C                     MOVE @9        W@WYOS  90
     C                     MOVE *ON       *IN90
     C           *IN91     WHEQ *OFF
     C                     MOVE *ON       *IN91
     C                     OTHER
     C                     ADD  1         W
     C                     MOVE @9        QTY,W
     C                     ENDSL
     C                     MOVE *BLANK    AR9
     C                     Z-ADD*ZERO     Y
     C                     ITER
     C                     ELSE
     C                     ADD  1         Y
     C                     MOVE ARY,X     AR9,Y
     C                     ENDIF
      *
     C                     ENDDO
      * WRITE
     C                     MOVE '3530'    WTOKU   40
     C                     MOVE '3530'    WNONY   40
     C                     MOVE '00  '    WNUKE   4
     C                     MOVE '0'       WNKOJ   1
     C           1         DO   54        W
     C           DAT,W     IFEQ *ZERO
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDDAT,W     WSDAT
      *
     C                     Z-ADD0         B       20
     C                     Z-ADD0         HYM
     C                     Z-ADD0         WKAD    20
      *
     C                     MOVE *OFF      *IN90
     C           KEY4      SETLLAGDPL121
     C           *IN10     DOUEQ*ON
     C                     READ AGDPL121                 10
     C           *IN10     IFEQ '0'
     C           *IN90     IFEQ *ON
     C           F8YOBI    ANDEQ1
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVE *ON       *IN90
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         B
     C                     ADD  1         WKAD
     C                     Z-ADDF8KAHZ    HYM,B
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           WKAD      IFNE *ZERO
     C           QTY,W     DIV  WKAD      WKSUR   70H
      *
     C           1         DO   7         A
     C           HYM,A     IFNE 0
     C                     Z-ADDHYM,A     @NYMD
      *
     C           KEY2      CHAINABAWP10              11
     C           *IN11     IFEQ '1'
     C                     Z-ADDWTOKU     ABTOKU
     C                     Z-ADDWNONY     ABNONY
     C                     MOVE WNKOJ     ABNKOJ
     C                     MOVE WNUKE     ABNUKE
     C                     MOVE '0000'    WSBAN
     C           K#FCC     CHAINFCCTL13              95
     C           *IN95     IFEQ *OFF
     C                     MOVELB4SBAN    WSBAN   4
     C                     ENDIF
     C           K#85      CHAINAB#PP85              95
     C           *IN95     IFEQ *OFF
     C                     MOVELA5SBAN    WSBAN
     C*                    ELSE
     C                     ENDIF
     C*                    ENDIF
     C                     MOVE WSBAN     ABSBAN
     C                     MOVELWMHIN     ABMHIN
     C                     Z-ADD@NYM      ABDATE
     C                     Z-ADD0         HSU
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       ABNNSU
     C                     MOVE 'C'       ABNOKN
     C                     WRITEABAWP101
     C                     ELSE
      *
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       ABNNSU
     C                     MOVE 'C'       ABNOKN
      *
     C                     UPDATABAWP101
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           1         DO   54        W
     C           DAT,W     IFNE *ZERO
     C                     Z-ADD*DATE     WDAT8
     C                     Z-ADDQTY,W     WSURY   90
     C                     Z-ADDDAT,W     WWSDT
     C                     Z-ADDDAT,W     WSDAT
     C           K#P50     CHAINABBPL50              90
      *
     C           *IN90     IFEQ *ON
     C                     CLEARABBPP501
     C                     Z-ADDWDAT8     BBRCDT
     C                     Z-ADDWTOKU     BBTOKU
     C                     Z-ADDWNONY     BBNONY
     C                     MOVE WNKOJ     BBNKOJ
     C                     MOVE WNUKE     BBNUKE
     C                     MOVELWMHN1     BBMHN1
     C                     MOVELWMHN2     BBMHN2
     C                     MOVELWMHN3     BBMHN3
     C                     MOVELWMHN4     BBMHN4
     C                     Z-ADDDAT,W     BBSDAT
     C                     Z-ADDQTY,W     BBSQTY
      * IAF PART#
     C                     MOVE WTOKU     PTOKU
     C                     MOVE WNONY     PNONY
     C                     MOVE WNKOJ     PNKOJ
     C                     MOVE WNUKE     PNUKE
     C                     MOVE WMHIN     PMHIN
     C                     MOVE *BLANK    PSHIN
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           PSHIN  12
     C                     PARM           PFLAG   1
      *
     C                     MOVELPSHN1     BBSHN1
     C                     MOVELPSHN2     BBSHN2
     C                     MOVELPSHN3     BBSHN3
      *
     C                     WRITEABBPP501
     C                     ENDIF
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
     C                     EXCPT@DTL
     C                     ENDIF
     C                     ENDDO
      *
     C           @END      TAG
%0001 *------------------------------------------------------
     C           #DAT      BEGSR
      *
     C                     Z-ADD*ZERO     X       30
     C                     DO   3
     C                     ADD  1         X
     C           ','       LOKUPARY,X                    10
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     W       30
     C                     MOVE *BLANK    AR4
     C                     MOVE *BLANK    A21
     C                     MOVE *BLANK    A22
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD1         V       30
     C           X         ADD  1         Z       30
      *
     C           Z         DO   *HIVAL    X
     C           ARY,X     IFEQ ','
     C           ARY,X     OREQ *BLANK
     C           V         IFEQ 1
     C           ARY,X     ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C           V         IFEQ 1
     C           ARY,X     ANDEQ','
     C                     ITER
     C                     ENDIF
      *
     C           A21,2     IFEQ *BLANK
     C           A21,1     ANDNE*BLANK
     C                     MOVE A21,1     A21,2
     C                     MOVE '0'       A21,1
     C                     ENDIF
     C                     MOVEAA21       MMM
     C           A22,2     IFEQ *BLANK
     C           A22,1     ANDNE*BLANK
     C                     MOVE A22,1     A22,2
     C                     MOVE '0'       A22,1
     C                     ENDIF
     C                     MOVEAA22       DDD
     C                     MOVEAAR4       YYY
     C           MMM       IFEQ *BLANK
     C                     MOVE *ALL'0'   MMM
     C                     ENDIF
     C           DDD       IFEQ *BLANK
     C                     MOVE *ALL'0'   DDD
     C                     ENDIF
     C           YYY       IFEQ *BLANK
     C                     MOVE *ALL'0'   YYY
     C                     ENDIF
     C                     ADD  1         W
     C                     MOVE YMD       DAT,W
     C                     MOVE *BLANK    AR4
     C                     MOVE *BLANK    A21
     C                     MOVE *BLANK    A22
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD1         V       30
     C                     ITER
     C                     ENDIF
     C           ARY,X     IFEQ '/'
     C                     ADD  1         V
     C                     Z-ADD*ZERO     Y
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         Y
     C                     SELEC
     C           V         WHEQ 1
     C                     MOVE ARY,X     A21,Y
     C           V         WHEQ 2
     C                     MOVE ARY,X     A22,Y
     C           V         WHEQ 3
     C                     MOVE ARY,X     AR4,Y
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
%0001 *------------------------------------------------------
     C           #DATB     BEGSR
      *
     C                     Z-ADD*ZERO     X       30
     C                     DO   3
     C                     ADD  1         X
     C           ','       LOKUPARY,X                    10
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     W       30
     C                     MOVE *BLANK    AR4
     C                     Z-ADD*ZERO     Y       30
     C           X         ADD  1         Z       30
      *
     C           Z         DO   *HIVAL    X
     C           ARY,X     IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
     C           ARY,X     IFEQ ','
     C           Y         IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVE *ALL'0'   AR4X
     C                     Z-ADD4         A       20
     C                     Z-ADD4         B       20
     C                     DO   4
     C           AR4,A     IFNE *BLANK
     C                     MOVE AR4,A     AR4X,B
     C                     SUB  1         B
     C                     ENDIF
     C                     SUB  1         A
     C           A         IFEQ 0
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAAR4X      @4      4
     C                     MOVE @4        WEEK
     C           2000      ADD  WY        K@YY
     C           K@YY      IFNE W@YY
     C           K@YY      SETLLAGDPL12
     C                     ENDIF
      *
     C                     Z-ADDK@YY      W@YY    40
      *
     C                     ADD  1         W
     C                     Z-ADD1         Q       20
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           W         IFEQ 1
     C           WW        ANDGT1
     C           F8YOBI    IFEQ 1
     C                     ADD  1         Q
     C           Q         IFLT WW
     C                     ITER
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDF8KAYY    @@Y     20
     C           WW        IFEQ 01
     C                     Z-ADDF8KAHZ    DAT,W
     C                     LEAVE
     C                     ELSE
     C           F8YOBI    IFEQ 1
     C                     Z-ADDF8KAHZ    DAT,W
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C           W         IFEQ 54
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVE *BLANK    AR4
     C                     Z-ADD*ZERO     Y
      *
     C                     ELSE
     C                     ADD  1         Y
     C                     MOVE ARY,X     AR4,Y
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
%0001 *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCC     KLIST
     C                     KFLD           K@M     20
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C           KEY1      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNUKE
      *
     C           KEY2      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
     C                     KFLD           @NYM
      *
     C           KEY4      KLIST
     C                     KFLD           WSYY
     C                     KFLD           WSMM
     C                     KFLD           WSDD
      *
     C           KEY5      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
      *
     C           K#P50     KLIST
     C                     KFLD           WDAT8   80
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
     C                     KFLD           WWSDT   80
     C           K#85      KLIST
     C                     KFLD           WTOKU
     C                     KFLD           WNONY
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     Z-ADD*MONTH    K@M
      *
     C                     SETOF                     053020
     C                     SETOF                     40
     C                     TIME           WTIME   60
      *
     C                     ENDSR
      *---------------------------------------------------------
     OQPRINT  E  102           @HED
     O                                  131 '+-------------------+'
     O        E  1             @HED
     O                                  131 '|         |         |'
     O        E  1             @HED
     O                                   89 'TIME'
     O                         WTIME Y   98
     O                                  131 '|         |         |'
     O        E  2             @HED
     O                         #PGM      10
     O                                   65 '** ATS FORECAST LIST **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE1 Z  108
     O                                  131 '+-------------------+'
     O        E  1             @HED
     O                                   64 'IDENTIFICATION'
     O        E  2             @HED
     O                                   13 'CUSTOMER'
     O                                   28 'RECEIVING CO.'
     O                                   37 'FACTORY'
     O                                   48 'RECEIVING'
     O                                   64 'NUMBER'
     O                                   82 'USER PART NUBER'
     O                                  107 'SCHEDULED DATE'
     O                                  118 'PIECES'
     O        E  1             @DTL
     O                         WTOKU     11
     O                         WNONY     22
     O                         WNKOJ     34
     O                         WNUKE     45
     O                         WSBAN     58
     O                         WMHN1     71
     O                                   72 '-'
     O                         WMHN2     77
     O                                   78 '-'
     O                         WMHN3     83
     O                                   84 '-'
     O                         WMHN4     89
     O                         WSDAT    105 '    .  .  '
     O                         WSURY 1  118
