     H            Y.
     F** ABAR3L *********************************************
     F*  FORD EDI830 FORECAST LIST                          *
     F*      DISUSE LIST                                    *
     F*  03/01/2004 TCH
     F******************************************* ABAR2K ****
     FABAPW3L CF  E                    WORKSTN
     FABFPL14 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FQPRINT2 O   F     132     OA     PRINTER
     ********************************************************
     E                    CD         14  1
     E                    DAS        14  6 0
     E                    DAE        14  6 0
     E                    CUM        14 10 0
     E                    NET        14 10 0
     E                    BOX        14  5 0
     ********************************************************
     I* SYSTEM DATE
     I            DS
     I                                        1  120WTIME
     I                                        1   60SYTM1
     I                                        7  120SYDT1
     I* PART NUMBER OF ABFPP10
     I            DS
     I                                        1  12 FBIPAR
     I                                        1   5 #PAR1
     I                                        6  10 #PAR2
     I                                       11  12 #PAR3
     I* CHANGE DATE OF PART MASTER
     I            DS
     I                                        1   80CDATE
     I                                        1   40CDAT1
     I                                        5   60CDAT2
     I                                        7   80CDAT3
     I                                        3   80CDAT
     I            DS
     I                                        1   80WYMD
     I                                        3   80WYMD6
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C                     MOVE '1'       P@END
      *
     C           *INKE     WHEQ *ON
     C                     MOVE *ON       *IN10
     C                     WRITEDSP01
     C                     EXSR #OUT
     C                     MOVEL'99'      W@ID
      *
     C                     ENDSL
      *
     C                     ENDSR
      *-------------------------------------------------------
     C           #OUT      BEGSR
      *
     C           *IN80     DOUEQ*ON
     C                     READ ABFPL14                  80
     C           *IN80     IFEQ *OFF
     C                     MOVE FBIPAR    K@IPAR
     C                     MOVE FBDOCK    K@DOCK
     C           K#14      SETGTABFPL14
     C           K#14      REDPEABFPL14                  81
     C           *IN81     IFEQ *OFF
     C           FBSIDT    ANDGEWYMD6
      *
     C                     Z-ADDFBSIDT    K@SIDT
      *
     C                     EXSR @WRT
     C                     ENDIF
     C           K#14      SETGTABFPL14
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------
     C           @WRT      BEGSR
     C*
     C                     MOVE *BLANK    @@PART 40
     C                     Z-ADD*ZERO     I
     C           K#14X     SETLLABFPL14
     C           *IN85     DOUEQ*ON
     C           K#14X     READEABFPL14                  85
     C           *IN85     IFEQ *OFF
     C                     ADD  1         I       20
     C           I         IFGT 14
     C                     EXSR @GET
     C                     EXSR @WRT1
     C                     Z-ADD1         I
     C                     END
     C                     Z-ADDFBQTY1    CUM,I
     C                     Z-ADDFBQTY2    NET,I
     C                     MOVEAFBQTCD    CD,I
     C                     Z-ADDFBCSDT    DAS,I
     C                     Z-ADDFBCEDT    DAE,I
     C                     EXSR @SYOS
     C*
     C                     ENDIF
     C                     ENDDO
      *
     C           I         IFGT *ZERO
     C                     EXSR @GET
     C                     EXSR @WRT1
     C                     ENDIF
      *
     C                     ENDSR
     C*****************************************************************
     C*     INITIAL ROUTINE
     C*****************************************************************
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
     C           K#14      KLIST
     C                     KFLD           K@IPAR 12
     C                     KFLD           K@DOCK  5
     C           K#14X     KLIST
     C                     KFLD           K@IPAR 12
     C                     KFLD           K@DOCK  5
     C                     KFLD           K@SIDT  60
     C           KEY2      KLIST
     C                     KFLD           #PAR1   5
     C                     KFLD           #PAR2   5
     C                     KFLD           #PAR3   2
      *
     C                     MOVE *ALL'-'   @LINE 132
     C                     TIME           WTIME
     C                     Z-ADD*DATE     WYMD
     C                     SUB  1         WMM
     C           WMM       IFEQ *ZERO
     C                     ADD  12        WMM
     C                     SUB  1         WYY
     C                     ENDIF
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
     C*****************************************************************
     C*     @GET : GET QTY / CONTAINERS
     C*****************************************************************
     C           @GET      BEGSR
     C*
     C                     SETOF                     31
     C*
     C           KEY2      CHAINFCEPL011             93
     C           *IN93     IFEQ '0'
     C                     MOVE A2SYYY    CDAT1
     C                     MOVE A2SYMM    CDAT2
     C                     MOVE A2SYDD    CDAT3
     C*
     C* IF THE CHANGE DATE OF PART MASTER IS IN
     C*    BETWEEN START-END SCHEDULE ISSUE DATE,
     C*    PRINT BOTH PREVIOU AND CURRENT UNIT QTY..
     C           CDAT      IFGE FBHSDT
     C           CDAT      ANDLEFBHEDT
     C                     SETON                     31
     C                     MOVELA2SSYS    WSYDT   50
     C                     MOVE CDAT      WLCDT   60
     C*
     C                     END
     C                     MOVELA2KSYS    WSYSU   50
     C*
     C                     END
     C*
     C                     ENDSR
     C*****************************************************************
     C*     @SYOS:CALCULATION WITH REMAINDER
     C*****************************************************************
     C           @SYOS     BEGSR
     C*
     C           KEY2      CHAINFCEPL011             93
     C           *IN93     IFEQ '0'
     C                     MOVE A2SYYY    CDAT1
     C                     MOVE A2SYMM    CDAT2
     C                     MOVE A2SYDD    CDAT3
     C*
     C* SAVE UNIT QTY.
     C* CALUCULATE THE NUMBER OF CONTAINER
     C           DAE,I     IFLT CDAT
     C                     MOVE A2KSYS    WSYOS   50
     C                     ELSE
     C                     MOVE A2SSYS    WSYOS
     C                     END
     C*
     C           NET,I     IFNE *ZERO
     C           WSYOS     ANDNE*ZERO
     C           NET,I     DIV  WSYOS     BOX,I
     C                     MVR            P1      30
     C*
     C           P1        IFGT 0
     C           BOX,I     ANDGE0
     C                     ADD  1         BOX,I
     C                     END
     C*
     C           P1        IFLT 0
     C           BOX,I     ANDLE0
     C                     SUB  1         BOX,I
     C                     END
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     BOX,I
     C                     END
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     WSYOS
     C                     Z-ADD*ZERO     WSYSU
     C                     Z-ADD*ZERO     WSYDT
     C                     Z-ADD*ZERO     WLCDT
     C                     Z-ADD*ZERO     BOX,I
     C                     END
     C*
     C                     ENDSR
     C*****************************************************************
     C*     @WRT1:WRITE NOTE(ABFPP10)
     C*********************************************************
     C           @WRT1     BEGSR
     C*
     C                     TIME           WTIME
      *
     C                     Z-ADD*ZERO     W@CUM  100
     C                     MOVE *OFF      *IN97
     C                     Z-ADD14        I
     C                     DO   14
     C           CD,I      IFEQ 'M'
     C           CUM,I     ANDNE*ZERO
     C                     Z-ADDCUM,I     @@CUM  100
     C                     LEAVE
     C                     ENDIF
     C                     SUB  1         I
     C                     ENDDO
      *
     C           1         DO   14        I
     C           CD,I      IFEQ 'M'
     C           W@CUM     IFNE *ZERO
     C           CUM,I     ANDEQW@CUM
     C           CUM,I     ANDEQ@@CUM
     C                     EXSR #DISU
     C                     ENDIF
     C                     Z-ADDCUM,I     W@CUM
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     CUM
     C                     Z-ADD*ZERO     NET
     C                     MOVE *BLANK    CD
     C                     Z-ADD*ZERO     DAS
     C                     Z-ADD*ZERO     DAE
     C                     Z-ADD*ZERO     BOX
     C                     Z-ADD*ZERO     I
     C*
     C                     ENDSR
     C*****************************************************************
     C*  DISUSE
     C*********************************************************
     C           #DISU     BEGSR
     C*
     C           *IN98     IFEQ *OFF
     C           *INOA     OREQ *ON
     C                     EXCPT@HEDE
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
     C           *IN97     IFEQ *OFF
     C   OA                EXCPT@HEDE
     C                     EXCPT@DTL1
     C           I         SUB  1         Z       20
     C   OA                EXCPT@HEDE
     C                     EXCPT@DTLE
     C                     MOVE *ON       *IN97
     C                     ENDIF
     C                     Z-ADDI         Z
     C   OA                EXCPT@HEDE
     C                     EXCPT@DTLE
      *
     C                     ENDSR
     C********************************************************
     OQPRINT2 E    2           @HEDE
     O                                   50 'EDI FORD 830 FORECAST <<'
     O                                   70 'DISUSE INFORMATION>>'
     O                                   89 'DATE'
     O                         SYDT1 Y   98
     O                                  104 'PAGE'
     O                         PAGE1 Z  108
     O        E    3           @HEDE
     O                                   89 'TIME'
     O                         SYTM1     98 '  :  :  '
     O        E    4           @HEDE
     O                                   16 'SCHEDULE ISSUE'
     O                                   34 'PART NUMBER'
     O                                   55 'DELIVERY CODE'
     O                                   62 'CODE'
     O                                   75 'START DATE'
     O                                   87 'END DATE'
     O                                  104 'CUM QUANTITY'
     O                                  121 'QUANTITY'
     O                                  130 'BOXES'
     O        E 1              @DTL1
     O                         @LINE    132
     O        E 1              @DTLE
     O                         K@SIDT    14 '0 /  /  '
     O                         K@IPAR    35
     O                         K@DOCK    50
     O                         CD,Z      62
     O                         DAS,Z     75 '0 /  /  '
     O                         DAE,Z     87 '0 /  /  '
     O                         CUM,Z    104 ' ,   ,   ,   '
     O                         NET,Z    121 ' ,   ,   ,   '
     O                         BOX,Z    130 '  ,   '
