     H            Y.
     F** ABAR1J ***************************************
     F*  ..ARJ AND OTHERS FORECAST                    *
     F*                                               *
     F*                                               *
TCHK F* TCHK  09/12/05 CHG TAKATA MULTI NONY           *
TCHK1F* TCHK1 02/12/08 ADD TAKATA MULTI NONY           *
     F*************************************** ABAR1J **
     FABAWP10 IF  E           K        DISK
     FABAWP25 O   F     318            DISK
     E                    HYM         7  6 0
     E                    HIS        31  7 0
     E                    HWS        31  7 0
     I            DS
     I                                        1 2170HIS
     I                                        1   70ABNN01
     I                                        8  140ABNN02
     I                                       15  210ABNN03
     I                                       22  280ABNN04
     I                                       29  350ABNN05
     I                                       36  420ABNN06
     I                                       43  490ABNN07
     I                                       50  560ABNN08
     I                                       57  630ABNN09
     I                                       64  700ABNN10
     I                                       71  770ABNN11
     I                                       78  840ABNN12
     I                                       85  910ABNN13
     I                                       92  980ABNN14
     I                                       99 1050ABNN15
     I                                      106 1120ABNN16
     I                                      113 1190ABNN17
     I                                      120 1260ABNN18
     I                                      127 1330ABNN19
     I                                      134 1400ABNN20
     I                                      141 1470ABNN21
     I                                      148 1540ABNN22
     I                                      155 1610ABNN23
     I                                      162 1680ABNN24
     I                                      169 1750ABNN25
     I                                      176 1820ABNN26
     I                                      183 1890ABNN27
     I                                      190 1960ABNN28
     I                                      197 2030ABNN29
     I                                      204 2100ABNN30
     I                                      211 2170ABNN31
     I            DS
     I                                        1   80UYMD
     I                                        1   60UYM
     I                                        1   40UYY
     I                                        5   60UMM
      *--------------------------------------------------
TCHK C  N89      K#25      SETLLABAWP10
TCHK C   89      K@TOKU    SETLLABAWP10
TCHK  *
     C           *IN90     DOUEQ*ON
TCHK  *
TCHK C  N89      K#25      READEABAWP10                  90
TCHK C   89      K@TOKU    READEABAWP10                  90
TCHK  *
     C           *IN90     IFEQ *OFF
     C                     Z-ADDABTOKU    K@TOKU
     C                     Z-ADDABNONY    K@NONY
     C                     MOVE ABNKOJ    K@NKOJ
     C                     MOVE ABNUKE    K@NUKE
     C                     MOVE ABMHN1    K@MHN1
     C                     MOVE ABMHN2    K@MHN2
     C                     MOVE ABMHN3    K@MHN3
     C                     MOVE ABMHN4    K@MHN4
     C                     Z-ADD0         WNJS1   90
     C                     Z-ADD0         WNJS2   90
     C                     Z-ADD0         WNJS3   90
     C                     Z-ADD0         WNJS4   90
     C                     Z-ADD0         WNJS5   90
JW   C                     Z-ADD0         WNJS6   90
JW   C                     Z-ADD0         WNJS7   90
     C                     Z-ADD0         HWS
     C                     MOVE *OFF      *IN96
     C           1         DO   7         X       20
     C                     Z-ADDHYM,X     K@NYM
      *
     C           K#KEY     CHAINABAWP10              95
      *
     C           *IN95     IFEQ *OFF
      *
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABNNSU    WNJS1
     C                     Z-ADDHIS       HWS
     C           X         WHEQ 2
     C                     Z-ADDABNNSU    WNJS2
     C           X         WHEQ 3
     C                     Z-ADDABNNSU    WNJS3
     C           X         WHEQ 4
     C                     Z-ADDABNNSU    WNJS4
     C           X         WHEQ 5
     C                     Z-ADDABNNSU    WNJS5
JW   C           X         WHEQ 6
     C                     Z-ADDABNNSU    WNJS6
JW   C           X         WHEQ 7
     C                     Z-ADDABNNSU    WNJS7
     C                     ENDSL
     C  N96                MOVE *ON       *IN96
      *
     C                     ENDIF
     C                     ENDDO
     C   96                EXCPTDT
      *
     C           K#KEYX    SETGTABAWP10
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *---------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PNONY   4
     C                     PARM           PYYMM   6
      *
     C           K#25      KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
      *
     C           K#KEY     KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@NYM   60
      *
     C           K#KEYX    KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
      *
     C                     MOVE PNONY     K@TOKU
     C                     MOVE PNONY     K@NONY
     C           PNONY     IFEQ '5672'
     C                     MOVE 5671      K@TOKU
     C                     ENDIF
TCHK C* TAKATA MULTI NONY (*IN89=ON)
TCHK C           PNONY     IFEQ '3712'
TCHK1C           PNONY     OREQ '3656'
TCHK1C           PNONY     OREQ '3682'
TCHK1C           PNONY     OREQ '3824'
TCHK1C           PNONY     OREQ '3842'
TCHK1C           PNONY     OREQ '3713'
JW   C           PNONY     OREQ '3714'
TCHK C                     Z-ADD3656      K@TOKU
TCHK C                     MOVEL*ON       *IN89
TCHK C                     ELSE
TCHK C                     MOVEL*OFF      *IN89
TCHK C                     END
      *
     C                     Z-ADD*DATE     UYMD
     C                     MOVE PYYMM     UYM
     C                     Z-ADD0         HYM
      *
     C           1         DO   6         X       20
     C                     Z-ADDUYM       HYM,X
      *
     C                     ADD  1         UMM
     C           UMM       IFGT 12
     C                     SUB  12        UMM
     C                     ADD  1         UYY
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------------
     OABAWP25 E                DT
     O                         ABTOKU     4
     O                         ABNONY     8
     O                         ABNKOJ     9
     O                         ABNUKE    13
     O                         ABSBAN    17
     O                         ABMHN1    22
     O                         ABMHN2    27
     O                         ABMHN3    32
     O                         ABMHN4    37
     O                         WNJS1     46
     O                         WNJS2     55
     O                         WNJS3     64
     O                         HWS      281
     O                         ABNOKN   282
     O                         WNJS4    291
     O                         WNJS5    300
JW   O                         WNJS6    309
JW   O                         WNJS7    318
