     H            Y.
     F** ABAR33 *************************************************************
     F*  ..EDI ORDER FORECAST                                               *
     F*                                                                     *
     F* TCHK1 08/11/08 RE-MAKE(UPDATE ONLY)
     F* TCHK2 08/27/08 ADD TBCA
     F* TCHK3 11/06/09 RMV ATS,TMI,TBCA
     F* TCHK4 01/02/12 RMV FUTABA
JW1  F* JW    08/20/18 CHG TAKATA
     F***********************************************************************
     FABAPW33 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FABBPL52 IF  E           K        DISK
     E*****************************************************************
     E                    ER      1   1 78
     E                    KEY     1   1 78
TCHK4E                    NAM     1   3 32
     I*****************************************************************
     I            DS
     I                                        1  140WYMD
     I                                        7  120WYYMM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C***********************************************************************
     C* PARM                                                                *
     C***********************************************************************
     C           *ENTRY    PLIST
     C                     PARM           @END    1
     C                     PARM           @SLC    4
      *
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C           *NAMVAR   DEFN ABADS1    DDS    48
     C           *LOCK     IN   DDS                    99
     C           6         SUBSTDDS:1     @YYMM   6
     C                     OUT  DDS
     C                     MOVE @YYMM     @@YYMM  60
      *
     C                     TIME           WYMD
     C                     Z-ADD@@YYMM    D@DATE
     C                     MOVE '01'      W@ID    2
     C                     EXSR #SET
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* SET DATA
      *------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     Z-ADD*ZERO     RRN1    40
TCHK4C           1         DO   3         X       30
     C                     CLEARSFL01
     C                     MOVELNAM,X     S@NAME
     C                     MOVE NAM,X     S@INTV
      *
     C                     ADD  1         RRN1
     C                     MOVEL*OFF      *IN01
      *
     C                     SELEC
      * ATS
TCHK3C*          RRN1      WHEQ 1
TCHK3C*                    Z-ADD3530      K@NONY  40
TCHK3C*                    EXSR #DAT
      * TMI
TCHK3C*          RRN1      WHEQ 2
TCHK3C*                    Z-ADD3540      K@NONY
TCHK3C*                    EXSR #DAT
      * TAKATA MEXICO 3842
TCHK3C           RRN1      WHEQ 1
     C                     Z-ADD3842      K@NONY  40       *KEEP NONY SEQ
     C                     EXSR #DAT1
     C                     Z-ADD3682      K@NONY           *KEEP NONY SEQ
     C                     EXSR #DAT1
     C                     Z-ADD3712      K@NONY           *KEEP NONY SEQ
     C                     EXSR #DAT1
TCHK4 * FUTABA TEXAS
TCHK4C*TCHK3     RRN1      WHEQ 2
TCHK4C*                    Z-ADD0578      K@NONY
TCHK4C*                    EXSR #DAT
TCHK4 * FUTABA INDIANA
TCHK4C*          RRN1      WHEQ 3
TCHK4C*                    Z-ADD0567      K@NONY
TCHK4C*                    EXSR #DAT
TCHK4 * FUTABA CANADA
TCHK4C*TCHK3     RRN1      WHEQ 4
TCHK4C*                    Z-ADD0579      K@NONY
TCHK4C*                    EXSR #DAT
TCHK4 * FUTABA CHICAGO
TCHK4C*TCHK3     RRN1      WHEQ 5
TCHK4C*                    Z-ADD0556      K@NONY
TCHK4C*                    EXSR #DAT
      * JTEKT TEXAS
TCHK4C           RRN1      WHEQ 2
     C                     Z-ADD3832      K@NONY
     C                     EXSR #DAT1
      * JTEKT VIRGINIA
TCHK4C           RRN1      WHEQ 3
     C                     Z-ADD3891      K@NONY
     C                     EXSR #DAT1
TCHK2 * TBCA
TCHK3C*TCHK2     RRN1      WHEQ 10
TCHK3C*TCHK2               Z-ADD3318      K@NONY
TCHK3C*TCHK2               EXSR #DAT
      *
     C                     ENDSL
      *
     C                     MOVELK@NONY    H@NONY
     C                     MOVEL*IN01     H@IN01
     C                     WRITESFL01
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C* RECEIVED DATE
      *------------------------------------------------------
     C           #DAT      BEGSR
      *
     C           K@NONY    SETGTABBPL52
     C           K@NONY    REDPEABBPL52                  90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDBBRCDT    S@UPDT
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C* RECEIVED DATE
      *------------------------------------------------------
     C           #DAT1     BEGSR
      *
     C           K@NONY    SETGTABBPL52
     C           K@NONY    REDPEABBPL52                  90
     C           *IN90     IFEQ *OFF
     C           BBRCDT    IFGT @@RCDT
     C                     Z-ADDBBRCDT    S@UPDT
     C                     Z-ADDBBRCDT    @@RCDT  80
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE KEY,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '1'       @END
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     MOVE *ON       *IN22
     C                     WRITEDSP99
     C                     EXSR #WRT
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
     C* CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     6199
     C                     MOVE *BLANK    MSG
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C           *IN90     DOUEQ*ON
      *
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
      *
     C           *IN90     IFEQ *OFF
      *
     C                     MOVE *OFF      *IN61
      *
     C           S@OPT     IFNE 'Y'
     C           S@OPT     ANDNE*BLANK
     C                     MOVE ER,1      MSG
     C                     SETON                     6199
     C                     ENDIF
      *
     C                     MOVELH@IN01    *IN01
      *
     C                     UPDATSFL01
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C* WRITE
      *------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
      *
     C           *IN90     IFEQ *OFF
     C           S@OPT     ANDEQ'Y'
     C                     MOVELH@NONY    @SLC
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
** ER
E-01 OPTION CODE ERROR
** KEY
F1:END     F5:PROCESS
** NAM
TAKATA/JOYSON
JTEKT TEXAS
JTEKT VIRGINIA
