     H            Y.
     F** ABAR35 *************************************************************
     F*  FORECAST PROCESS MENU                                              *
     F*  ------------------------------------------------                   *
     F* TCHK1 2009/25/08 CREATE                                             *
     F* TCHK2 2003/06/09 ADD FUNCTION                                       *
     F* TCHK3 2008/04/10 RMV FUNCTION                                       *
JW1  F* JW    2024.06.03 ADD OPT 7 UPLOAD IFS(CSV) FORECAST <AFFC70>        *
JW2   * JW    2024.12.09 CHG ABBR29A TO ABBR29B
     F***********************************************************************
     FABAPW35 CF  E                    WORKSTN
     E*****************************************************************
     E                    ERR     1   5 78
     I*****************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(8)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMHH
     I                                        3   40WTIMMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
     C* INITIAL ROUTINE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           WWTIME
     C                     MOVE '01'      W@ID    2
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C           P@CL34    PLIST
     C                     PARM           P@AR34  1
     C*
     C                     ENDSR
      *------------------------------------------------------
     C* 1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    D@MSG
     C                     MOVEL*OFF      *IN41
     C*
     C                     SELEC
     C*
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C*
     C                     OTHER
     C                     EXSR #CHK1
     C*
     C           *IN41     IFEQ *OFF
     C                     SELEC
     C           D@SLCT    WHEQ 01
     C                     MOVEL*BLANK    P@AR34
     C                     CALL 'ABAR34'  P@CL34
     C           D@SLCT    WHEQ 02
     C                     CALL 'ABACP3'
     C           D@SLCT    WHEQ 03
     C                     CALL 'ABBC60'
     C           D@SLCT    WHEQ 04
     C**                   CALL 'ABBR29'
JW1  C**                   CALL 'ABBR29A'
JW2  C                     CALL 'ABBR29B'
TCHK2C           D@SLCT    WHEQ 05
TCHK2C                     CALL 'ABBC25'
TCHK2C           D@SLCT    WHEQ 06
TCHK2C                     CALL 'ABBC26'
      *
     C*TCHK2     D@SLCT    WHEQ 07
     C*TCHK2               CALL 'ABBC27'
JW1  C           D@SLCT    WHEQ 07
     C                     CALL 'AFFC70'
      *
     C           D@SLCT    WHEQ 09
     C                     CALL 'ABBC35'
     C                     ENDSL
     C                     Z-ADD*ZERO     D@SLCT
     C                     END
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C*------------------------------------------------------
     C* 1ST SCREEN CHECK
     C*------------------------------------------------------
     C           #CHK1     BEGSR
     C*
     C                     DO
     C*
     C           D@SLCT    IFEQ *ZERO
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,1     D@MSG
     C                     LEAVE
     C                     END
     C*
     C           D@SLCT    IFEQ 01
     C           D@SLCT    OREQ 02
     C           D@SLCT    OREQ 03
     C           D@SLCT    OREQ 04
TCHK2C           D@SLCT    OREQ 05
TCHK2C           D@SLCT    OREQ 06
JW   C           D@SLCT    OREQ 07
     C           D@SLCT    OREQ 09
     C                     ELSE
     C                     MOVEL*ON       *IN41
     C                     MOVELERR,2     D@MSG
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
** ERR
SELECTION IS REQUIRED.
SELECTION IS INVALID.



