     H            Y.
     F** ABAR2J *********************************/
     F* ..LIST OF FORD EDI(830) DATA..          */
     F*       CREATE DATE : 2000.03.14          */
     F*       CODING      : K.OKACHI.           */
     F*    TCH        2001.11.07 CHANGE WSURY POSITON.           *
     F*               BECAUSE WSURY HAS OVERRIDDEN THE PREVIOUS  *
     F*               DATE FIELD.                                *
     F*******************************************/
     FINFILE  IP  F     256            DISK
     FFCEPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OA     PRINTER
     FQPRINT2 O   F     198     OB     PRINTER
     FQPRINT3 O   F     132     OC     PRINTER
     E                    CMT     1   4 50
     IINFILE  AA
     I                                        1   4 ITOKU
     I                                        5   8 INONY L1
     I                                        9   9 INKOJ
     I                                       10  13 INUKE
     I                                       14  17 ISBAN
     I                                       18  37 IMHIN
     I                                       18  24 IMHN1
     I                                       25  28 IMHN2
     I                                       29  32 IMHN3
     I                                       33  37 IMHN4
     I                                       38  450INYMD
     I                                       46  550ISURY
     I                                       56  570IERCD
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      * SYSTEM TIME & DATE
     I            DS
     I                                        1  140WTMDT
     I                                        1   60WTIME
     I                                        1   20WTIHH
     I                                        3   40WTIMM
     I                                        5   60WTISS
     I                                        7  140WDATE
     I                                        9  140WDAT6
     I                                        7  100WDAY4
     I                                        9  100WDAYY
     I                                       11  120WDAMM
     I                                       13  140WDADD
      *
     C                     TIME           WTMDT
      *
     C           *IN77     IFEQ '0'
     C                     SETON                     77
     C                     TIME           WTIME   60
     C                     SETOF                     101112
     C                     END
      *
     C           *INOA     IFEQ '1'
     C                     EXCPTHD
     C                     SETOF                     OA
     C                     END
     C           *INOB     IFEQ '1'
     C                     EXCPTHDE
     C                     SETOF                     OB
     C                     END
     C           *INOC     IFEQ '1'
     C                     EXCPTHDA
     C                     SETOF                     OC
     C                     END
      *
     C                     MOVE *BLANK    ECMT   50
     C           IERCD     IFEQ 0
     C                     EXSR #SUB01
     C                     ELSE
     C           INUKE     IFNE 'APNA'
     C           IERCD     IFEQ 1
     C                     MOVELCMT,1     ECMT
     C                     END
     C           IERCD     IFEQ 2
     C                     MOVELCMT,2     ECMT
     C                     END
     C           IERCD     IFEQ 3
     C                     MOVELCMT,3     ECMT
     C                     END
     C           *IN11     IFEQ '0'
     C                     SETON                     11
     C                     EXCPTHDE
     C                     END
     C                     EXCPTDATER
     C                     ELSE
     C           *IN12     IFEQ '0'
     C                     SETON                     12
     C                     EXCPTHDA
     C                     END
     C                     EXCPTDATA
     C                     END
     C                     END
      *
     CL1 72                SETON                     OA
      *-----------------------------------------------------*
     C           #SUB01    BEGSR
     C                     MOVELITOKU     PTOKU   4
     C                     MOVELINONY     PNONY   4
     C                     MOVELINKOJ     PNKOJ   1
     C                     MOVELINUKE     PNUKE   4
     C                     MOVELIMHIN     @MHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
     C           @FLG      IFEQ '*'
     C                     MOVELIMHIN     @SHIN
     C                     END
     C           KEY1      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
      *
     C                     Z-ADD0         WSYS    50
     C                     MOVE *BLANK    TANI    1
     C                     SETOF                     71
     C           KEY1      CHAINFCEPL011             71
     C           *IN71     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLEWDATE
     C                     SETON                     71
     C                     END
     C                     END
     C           *IN71     IFEQ '0'
     C           A2SYHZ    IFGT INYMD
     C                     Z-ADDA2KSYS    WSYS
     C                     MOVELA2KSYT    TANI
     C                     ELSE
     C                     Z-ADDA2SSYS    WSYS
     C                     MOVELA2SSYT    TANI
     C                     END
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     EXCPTHD
     C                     END
     C                     EXCPTDAT
     C                     SETON                     72
     C                     END
     C           *IN71     IFEQ '1'
     C           *IN11     IFEQ '0'
     C                     SETON                     11
     C                     EXCPTHDE
     C                     END
     C                     MOVELCMT,4     ECMT
     C                     EXCPTDATER
     C                     END
     C           EXIT01    ENDSR
     OQPRINT  E  102           HD
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                                   12 'ABAR2J-1'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O                                   40 '** EDI(FILEOUT) DATA'
     O                                   55 'PRELIMINARY'
     O                                   76 'FORECAST LIST **'
     O                                   89 'DATE'
     O                         WDAT6 Y   98
     O                                  104 'PAGE'
     O                         PAGE1 Z  108
     O                                  131 '.....................'
     O        E  1             HD
     O                                   64 'IDENTIFICATION'
     O        E  2             HD
     O                                   13 'CUSTOMER'
     O                                   28 'RECEIVING CO.'
     O                                   37 'FACTORY'
     O                                   48 'RECEIVING'
     O                                   59 'NUMBER'
     O                                   82 'USER PART NUBER'
     O                                  107 'SCHEDULED DATE'
     O                                  118 'PIECES'
     O                                  129 'CONT. QTY'
     O        E  1             DAT
     O                         ITOKU     11
     O                         INONY     22
     O                         INKOJ     34
     O                         INUKE     45
     O                         ISBAN     58
     O                         IMHN1     73
     O                                   74 '-'
     O                         IMHN2     78
     O                                   79 '-'
     O                         IMHN3     83
     O                                   84 '-'
     O                         IMHN4     89
     O                         INYMD    105 '    .  .  '
     O                         ISURY 1  118
     O                         WSYS  Z  127
     OQPRINT2 E  102           HDE
     O                                  190 '.....................'
     O        E  1             HDE
     O                                  190 '.         .         .'
     O        E  1             HDE
     O                                   12 'ABAR2J-2'
     O                                  148 'TIME'
     O                         WTIME    157 '  :  :  '
     O                                  190 '.         .         .'
     O        E  2             HDE
     O                                   40 '** EDI(FILEOUT) DATA'
     O                                   54 'ERROR LIST **'
     O                                  148 'DATE'
     O                         WDAT6 Y  157
     O                                  163 'PAGE'
     O                         PAGE2 Z  167
     O                                  190 '.....................'
     O        E  1             HDE
     O                                   64 'IDENTIFICATION'
     O        E  2             HDE
     O                                   13 'CUSTOMER'
     O                                   28 'RECEIVING CO.'
     O                                   37 'FACTORY'
     O                                   48 'RECEIVING'
     O                                   59 'NUMBER'
     O                                   82 'USER PART NUBER'
     O                                  107 'SCHEDULED DATE'
     O                                  118 'PIECES'
     O                                  135 'ERROR COMMENT'
     O        E  1             DATER
     O                         ITOKU     11
     O                         INONY     22
     O                         INKOJ     34
     O                         INUKE     45
     O                         ISBAN     58
     O                         IMHN1     73
     O                                   74 '-'
     O                         IMHN2     78
     O                                   79 '-'
     O                         IMHN3     83
     O                                   84 '-'
     O                         IMHN4     89
     O                         INYMD    105 '    .  .  '
     O                         ISURY 1  118
     O                         ECMT     173
     OQPRINT3 E  102           HDA
     O                                  131 '.....................'
     O        E  1             HDA
     O                                  131 '.         .         .'
     O        E  1             HDA
     O                                   12 'ABAR2J-3'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HDA
     O                                   40 '** EDI(FILEOUT) DATA'
     O                                   46 'APNAT'
     O                                   63 'FORECAST LIST **'
     O                                   89 'DATE'
     O                         WDAT6 Y   98
     O                                  104 'PAGE'
     O                         PAGE3 Z  108
     O                                  131 '.....................'
     O        E  1             HDA
     O                                   64 'IDENTIFICATION'
     O        E  2             HDA
     O                                   13 'CUSTOMER'
     O                                   28 'RECEIVING CO.'
     O                                   37 'FACTORY'
     O                                   48 'RECEIVING'
     O                                   59 'NUMBER'
     O                                   82 'USER PART NUBER'
     O                                  107 'SCHEDULED DATE'
     O                                  118 'PIECES'
     O        E  1             DATA
     O                         ITOKU     11
     O                         INONY     22
     O                         INKOJ     34
     O                         INUKE     45
     O                         ISBAN     58
     O                         IMHN1     73
     O                                   74 '-'
     O                         IMHN2     78
     O                                   79 '-'
     O                         IMHN3     83
     O                                   84 '-'
     O                         IMHN4     89
     O                         INYMD    105 '    .  .  '
     O                         ISURY 1  118
** <CMT>
NOT IN EDI IN-HOUSE CODE CONVERSION M/F
NOT IN SHIPING M/F
NOT IN EDI IN-HOUSE CODE CNV. M/F & SHIPING M/F
NOT IN PART INFORMATION M/F
