     H            Y.
     F** ABAR02C *********************************************************
     F*  ADJUST FORECAST DATA (ABAEP20) - CHANGE QTY BY CUMULATIVE QTY   *
     F*  JW     2025.12.03                                               *
     F********************************************************************
     FABAEL20 UF  E                    DISK
      *-------------------------------------------------------------------
     C                     MOVE *BLANK    SVMHIN 30
     C                     Z-ADD0         CUMQTY  70
     C                     Z-ADD0         SVQTY   70
      *
     C                     DO   *HIVAL
     C                     READ ABAEL20                  98
     C   98                LEAVE
      *
     C           AENONY    IFNE '5211'                     HOLLINGSWORTH
     C                     ITER
     C                     ENDIF
      * SAME MHIN
     C           AEMHIN    IFEQ SVMHIN
     C                     Z-ADDAEEQTY    SVQTY
     C           AEEQTY    SUB  CUMQTY    AEEQTY
      *
     C           AEORID    IFEQ 'C'
     C                     DELETABAEP201
     C                     ADD  SVQTY     CUMQTY
     C                     ELSE
     C                     UPDATABAEP201
     C                     ADD  AEEQTY    CUMQTY
     C                     ENDIF
      *
      * FIRST MHIN
     C                     ELSE
     C                     Z-ADDAECQTY    CUMQTY
     C                     Z-ADDAEEQTY    SVQTY
     C           AEEQTY    SUB  CUMQTY    AEEQTY
      *
     C           AEORID    IFEQ 'C'
     C                     DELETABAEP201
     C                     ADD  SVQTY     CUMQTY
     C                     ELSE
     C                     UPDATABAEP201
     C                     ADD  AEEQTY    CUMQTY
     C                     ENDIF
      *
     C                     MOVELAEMHIN    SVMHIN
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
