     H            Y.
     F** ABBR45 *****************************************
     F*  UPDATE FC FILE (ABBPP01) FROM ABAWP2U          *
     F*  (COPIED FROM ABAR32)                           *
     F*  J.WATANABE 2017.06.12                          *
     F***************************************************
     FABAWP2U IF  E                    DISK
     F**FCCPL11 UF  E           K        DISK                      A
JW   FFCCPL11 IF  E           K        DISK
      *
     FFCCPL13 IF  E           K        DISK
     FABBPL01 UF  E           K        DISK                      A
     FABBNL01 IF  E           K        DISK                      A
     FFCCNP32 UF  F      10            DISK
     FFCCPL32 UF  E           K        DISK
     FFCCPL33 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FA@DPL12 IF  E           K        DISK
     FAGDPL31 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FABBPL51 IF  E           K        DISK
     FMITANKF O   F     300            DISK                      A
     F**ABAWP72 O   F     384            DISK
     F**ABAWP32 O   F      37            DISK
     E                    HIZ1       31  2 1             WORKING DAYS
     E                    HIZ2       31  2 1               WORKING DAYS N+1
     E                    FNS        31  7 0             FC QTY
     E                    AN2        31  7 0             FC QTY N-2
     E                    AN1        31  7 0             FC QTY N-1
     E                    ANN        31  7 0             FC QTY N
      ********************************************************************
     IFCCNP32 BB  13
     I                                        1   6 B4PROG
     I            DS
     I                                        1 2170FNS
     I                                        1   70ABNN01
     I                                        8  140ABNN02
     I                                       15  210ABNN03
     I                                       22  280ABNN04
     I                                       29  350ABNN05
     I                                       36  420ABNN06
     I                                       43  490ABNN07
     I                                       50  560ABNN08
     I                                       57  630ABNN09
     I                                       64  700ABNN10
     I                                       71  770ABNN11
     I                                       78  840ABNN12
     I                                       85  910ABNN13
     I                                       92  980ABNN14
     I                                       99 1050ABNN15
     I                                      106 1120ABNN16
     I                                      113 1190ABNN17
     I                                      120 1260ABNN18
     I                                      127 1330ABNN19
     I                                      134 1400ABNN20
     I                                      141 1470ABNN21
     I                                      148 1540ABNN22
     I                                      155 1610ABNN23
     I                                      162 1680ABNN24
     I                                      169 1750ABNN25
     I                                      176 1820ABNN26
     I                                      183 1890ABNN27
     I                                      190 1960ABNN28
     I                                      197 2030ABNN29
     I                                      204 2100ABNN30
     I                                      211 2170ABNN31
     I            DS
     I                                        1 2170ANN
     I                                        1   70Q5NN01
     I                                        8  140Q5NN02
     I                                       15  210Q5NN03
     I                                       22  280Q5NN04
     I                                       29  350Q5NN05
     I                                       36  420Q5NN06
     I                                       43  490Q5NN07
     I                                       50  560Q5NN08
     I                                       57  630Q5NN09
     I                                       64  700Q5NN10
     I                                       71  770Q5NN11
     I                                       78  840Q5NN12
     I                                       85  910Q5NN13
     I                                       92  980Q5NN14
     I                                       99 1050Q5NN15
     I                                      106 1120Q5NN16
     I                                      113 1190Q5NN17
     I                                      120 1260Q5NN18
     I                                      127 1330Q5NN19
     I                                      134 1400Q5NN20
     I                                      141 1470Q5NN21
     I                                      148 1540Q5NN22
     I                                      155 1610Q5NN23
     I                                      162 1680Q5NN24
     I                                      169 1750Q5NN25
     I                                      176 1820Q5NN26
     I                                      183 1890Q5NN27
     I                                      190 1960Q5NN28
     I                                      197 2030Q5NN29
     I                                      204 2100Q5NN30
     I                                      211 2170Q5NN31
     I            DS
     I                                        1 2170AN1
     I                                        1   70Q5N101
     I                                        8  140Q5N102
     I                                       15  210Q5N103
     I                                       22  280Q5N104
     I                                       29  350Q5N105
     I                                       36  420Q5N106
     I                                       43  490Q5N107
     I                                       50  560Q5N108
     I                                       57  630Q5N109
     I                                       64  700Q5N110
     I                                       71  770Q5N111
     I                                       78  840Q5N112
     I                                       85  910Q5N113
     I                                       92  980Q5N114
     I                                       99 1050Q5N115
     I                                      106 1120Q5N116
     I                                      113 1190Q5N117
     I                                      120 1260Q5N118
     I                                      127 1330Q5N119
     I                                      134 1400Q5N120
     I                                      141 1470Q5N121
     I                                      148 1540Q5N122
     I                                      155 1610Q5N123
     I                                      162 1680Q5N124
     I                                      169 1750Q5N125
     I                                      176 1820Q5N126
     I                                      183 1890Q5N127
     I                                      190 1960Q5N128
     I                                      197 2030Q5N129
     I                                      204 2100Q5N130
     I                                      211 2170Q5N131
     I            DS
     I                                        1 2170AN2
     I                                        1   70Q5N201
     I                                        8  140Q5N202
     I                                       15  210Q5N203
     I                                       22  280Q5N204
     I                                       29  350Q5N205
     I                                       36  420Q5N206
     I                                       43  490Q5N207
     I                                       50  560Q5N208
     I                                       57  630Q5N209
     I                                       64  700Q5N210
     I                                       71  770Q5N211
     I                                       78  840Q5N212
     I                                       85  910Q5N213
     I                                       92  980Q5N214
     I                                       99 1050Q5N215
     I                                      106 1120Q5N216
     I                                      113 1190Q5N217
     I                                      120 1260Q5N218
     I                                      127 1330Q5N219
     I                                      134 1400Q5N220
     I                                      141 1470Q5N221
     I                                      148 1540Q5N222
     I                                      155 1610Q5N223
     I                                      162 1680Q5N224
     I                                      169 1750Q5N225
     I                                      176 1820Q5N226
     I                                      183 1890Q5N227
     I                                      190 1960Q5N228
     I                                      197 2030Q5N229
     I                                      204 2100Q5N230
     I                                      211 2170Q5N231
     I            DS
     I                                        1   80B4SKHZ
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
     I            DS
     I                                        1   80B4KOHZ
     I                                        1   40B4KOYY
     I                                        5   60B4KOMM
     I                                        7   80B4KODD
     I            DS
     I                                        1   60B4TIME
     I                                        1   40B4KOTM
     I                                        1   20B4KOJI
     I                                        3   40B4KOFN
     I            DS
     I                                        1  20 B4MHIN
     I                                        1   5 B4MHN1
     I                                        6  10 B4MHN2
     I                                       11  15 B4MHN3
     I                                       16  20 B4MHN4
     I                                       11  11 WMHN4
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
     I            DS
     I                                        1  12 B4SHIN
     I                                        1   5 B4SHN1
     I                                        6  10 B4SHN2
     I                                       11  12 B4SHN3
     I            DS
     I                                        1   80B4SRHZ
     I                                        1   40B4SRYY
     I                                        5   60B4SRMM
     I                                        7   80B4SRDD
     I            DS
     I                                        1   80B4HUHZ
     I                                        1   40B4HUYY
     I                                        5   60B4HUMM
     I                                        7   80B4HUDD
     I            DS
     I                                        1   4 B4NKAS
     I                                        1   1 B4NOHI
     I                                        2   3 B4NOKI
     I                                        4   4 B4NOGO
     I            DS
     I                                        1   60B4NNHZ
     I                                        1   40B4NNYY
     I                                        5   60B4NNMM
     I            DS
     I                                        1   60B4N1HZ
     I                                        1   40B4N1YY
     I                                        5   60B4N1MM
     I            DS
     I                                        1   60B4N2HZ
     I                                        1   40B4N2YY
     I                                        5   60B4N2MM
     I            DS
     I                                        1  12 B4HIBN
     I                                        1   5 B4HIN1
     I                                        6  10 B4HIN2
     I                                       11  12 B4HIN3
     I            DS
     I                                        1   80B4KNHZ
     I                                        1   40B4KNYY
     I                                        5   60B4KNMM
     I                                        7   80B4KNDD
     I            DS
     I                                        1   80B4GNHZ
     I                                        1   40B4GNYY
     I                                        5   60B4GNMM
     I                                        7   80B4GNDD
     I            DS
     I                                        1   80B4TAHZ
     I                                        1   40B4TAYY
     I                                        5   60B4TAMM
     I                                        7   80B4TADD
     I            DS
     I                                        1   80B4URHZ
     I                                        1   40B4URYY
     I                                        5   60B4URMM
     I                                        7   80B4URDD
     I            DS
     I                                        1   60B4MAHZ
     I                                        1   40B4MAYY
     I                                        5   60B4MAMM
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   80B7SKHZ
     I                                        1   40B7SKYY
     I                                        5   60B7SKMM
     I                                        7   80B7SKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   60UYM1
     I                                        1   40UYY1
     I                                        5   60UMM1
     I            DS
     I                                        1   60UYM2
     I                                        1   40UYY2
     I                                        5   60UMM2
     I            DS
     I                                        1   60UYM3
     I                                        1   40UYY3
     I                                        5   60UMM3
     I            DS
     I                                        1   60UYM4
     I                                        1   40UYY4
     I                                        5   60UMM4
     I            DS
     I                                        1   60UYM5
     I                                        1   40UYY5
     I                                        5   60UMM5
     I            DS
     I                                        1   60UDHZ
     I            DS
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   60F8KAYM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I            DS
     I                                        1   80Q5NHHZ
     I                                        1   40Q5NHYY
     I                                        5   60Q5NHMM
     I                                        7   80Q5NHDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   60A2TAYM
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I            DS
     I                                        1  20 FMHN
     I                                        1   5 FMHN1
     I                                        6  10 FMHN2
     I                                       11  15 FMHN3
     I                                       16  20 FMHN4
      *
     I            DS
     I                                        1  20 ABMHIN
     I                                        1   5 ABMHN1
     I                                        6  10 ABMHN2
     I                                       11  15 ABMHN3
     I                                       16  20 ABMHN4
     I            DS
     I                                        1  12 FSHN
     I                                        1   5 FSHN1
     I                                        6  10 FSHN2
     I                                       11  12 FSHN3
     I            DS
     I                                        1   80FNOYMD
     I                                        1   40FNOYY
     I                                        5   60FNOMM
     I                                        7   80FNODD
      ********************************************************
      *          MAIN
      ********************************************************
     C                     EXSR #INIT
      *
     C           STP1      TAG
     C           *IN91     DOWEQ*OFF
     C                     SETOF                     910409
     C                     SETOF                     0314
     C                     READ ABAWP2U                  91
     C** 02                GOTO ENDIF
     C           *IN91     IFEQ *OFF
      * CHECK VALIDITY
     C                     MOVELABMHIN    K@MHIN
     C           K@P50     SETGTABBPL51
     C           K@P50     REDPEABBPL51                  99
      *
     C           *IN99     IFEQ *OFF
     C**JW1      BBFLG2    ANDNE*BLANK
JW1  C           BBFLG1    ANDNE*BLANK
     C                     ITER
     C                     ENDIF
     C*----------------------------------------------*
     C* CALCULATE WEEKLY TOTAL                       *
     C*----------------------------------------------*
     C                     EXSR #ADJ1
     C*----------------------------------------------*
     C* N MONTH WORKING DAYS                         *
     C* USER WORKING DAYS, IAF WORKING DAYS          *
     C*----------------------------------------------*
     C           ABTOKU    IFEQ @TOKU1
     C           ABNKOJ    ANDEQ@NKOJ1
     C                     ELSE
      *
     C                     Z-ADDABTOKU    @TOKU1
     C                     MOVE ABNKOJ    @NKOJ1
      *
     C*--------------------------------------------*
     C* CHECK CUSTOMER/DELIVERY                    *
     C*--------------------------------------------*
     C                     SETOF                     03
     C           K@AGD2    CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR #CT1
     C                     ELSE
      *
     C*--------------------------------*
     C* CHECK CUSTOMER                             *
     C*--------------------------------*
     C                     SETOF                     03
     C                     MOVE *BLANK    WWNKOJ  1
     C           K@AGD3    CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR #CT2
     C                     ELSE
      *
     C*----------------*
     C* IAF            *
     C*----------------*
     C           @TKBN     IFNE 'A'
     C                     EXSR #CT3
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C*----------------------------------------------*
     C* N+1 MONTH WORKING DAYS                       *
     C* USER WORKING DAYS, IAF WORKING DAYS          *
     C*----------------------------------------------*
     C           ABTOKU    IFEQ @TOKU2
     C           ABNKOJ    ANDEQ@NKOJ2
     C                     ELSE
      *
     C                     Z-ADDABTOKU    @TOKU2
     C                     MOVE ABNKOJ    @NKOJ2
      *
     C*--------------------------------------------*
     C* CHECK CUSTOMER/DELIVERY                    *
     C*--------------------------------------------*
     C                     SETOF                     03
     C           K@AGD6    CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR #CY1
     C                     ELSE
      *
     C*--------------------------------*
     C* CHECK CUSTOMER                 *
     C*--------------------------------*
     C                     SETOF                     03
     C                     MOVE *BLANK    WWNKOJ
     C           K@AGD7    CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR #CY2
     C                     ELSE
      *
     C*----------------*
     C* IAF            *
     C*----------------*
     C           @YKBN     IFNE 'A'
     C                     EXSR #CY3
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADD1         B       20
     C           1         DO   31        B
     C           FNS,B     IFNE 0
     C                     GOTO SAP1
     C                     ENDIF
     C                     ENDDO
      *
     C           FS1       DIV  WCD       WSUR1   70
     C                     MVR            WSUR2   70
     C           WSUR2     IFNE 0
     C                     ADD  1         WSUR1
     C                     ENDIF
      *
     C                     Z-ADD1         B
     C           1         DO   31        B
     C           HIZ1,B    IFNE 0
     C           HIZ1,B    IFEQ 1
     C                     Z-ADDWSUR1     FNS,B
     C                     ELSE
     C           WSUR1     DIV  2         FNS,B
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C           SAP1      TAG
     C*----------------------------------------------*
     C* READ FCCP                                    *
     C*----------------------------------------------*
     C                     EXSR #FCCP
     C*----------------------------------------------*
     C* READ ABBP                                    *
     C*----------------------------------------------*
     C                     EXSR #ABBP
      * READ ABB
     C                     SETOF                     03
     C           K@ABB1    CHAINABBNL011             03
     C           *IN03     IFEQ *ON
     C                     MOVE Q5SHN1    Q5HSH1
     C                     MOVE Q5SHN2    Q5HSH2
     C                     MOVE Q5SHN3    Q5HSH3
     C                     WRITEABBNL011
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*==============================================*
     C* ADJUST DATA                                  *
     C*==============================================*
     C           #ADJ1     BEGSR
      *
     C                     Z-ADDABNJS1    FS1     70
     C                     Z-ADDABNJS2    FS2     70
     C                     Z-ADDABNJS3    FS3     70
     C                     Z-ADDABNJS4    FS4     70
     C                     Z-ADDABNJS5    FS5     70
     C                     Z-ADD0         ABSYOS  50
      *
     C                     ENDSR
     C*==============================================*
     C* READ FCCPP11                                 *
     C*==============================================*
     C           #FCCP     BEGSR
      *
     C                     Z-ADDABTOKU    B4TOKU
     C                     Z-ADDABNONY    B4NONY
     C                     MOVE ABNKOJ    B4NKOJ
     C                     MOVE ABNUKE    B4NUKE
     C                     MOVE ABSBAN    B4SBAN
     C                     MOVELABMHIN    B4MHIN
      *
     C                     SETOF                     04
     C                     Z-ADDUYM1      B4MAHZ
     C           K@FCC1    CHAINFCCPL111             04
      *
     C                     EXSR #SUB
      *
     C                     Z-ADDABSYOS    FNSY    50
     C                     Z-ADDABSYOS    WSYOS   50
     C                     MOVE 'C'       FNST    1
      *
     C           B4TOKU    IFEQ B4NONY
     C                     MOVE B4NKOJ    B4TKOJ
     C                     MOVE B4NUKE    B4TUKE
     C                     ELSE
     C                     MOVE *BLANK    B4TKOJ
     C                     MOVE *BLANK    B4TUKE
     C                     ENDIF
      *
     C                     SETOF                     03
     C                     MOVE *BLANK    B4TMEI
     C           B4TOKU    CHAINFGBPL011             03
     C           *IN03     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     ENDIF
     C           *IN03     IFEQ '0'
     C                     MOVELB2SMEI    B4TMEI
     C                     ENDIF
      *
     C                     SETOF                     03
     C                     MOVE *BLANK    B4NMEI
     C           B4NONY    CHAINFGBPL011             03
     C           *IN03     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     ENDIF
     C           *IN03     IFEQ '0'
     C                     MOVELB2SMEI    B4NMEI
     C                     ENDIF
      *
     C                     MOVE *BLANK    B4SKBN
     C                     Z-ADD0         B4SKHZ
     C                     Z-ADD*DATE     B4KOHZ
     C                     TIME           B4TIME
     C                     MOVE *BLANK    B4KONA
     C                     Z-ADDUYM1      B4NNHZ
     C                     Z-ADDUYM2      B4N1HZ
     C                     Z-ADDUYM3      B4N2HZ
     C                     Z-ADDFS1       B4NNNA
     C                     Z-ADDFS2       B4N1NA
     C                     Z-ADDFS3       B4N2NA
     C                     MOVE '*'       B4NAIJ
     C                     MOVE ABNOKN    B4NOKN
      *
     C                     SETOF                     03
     C                     Z-ADD0         WHIZK   20
     C                     Z-ADD0         WKAIS   20
     C                     Z-ADD0         WNBIN   20
     C           K@GAD1    CHAINGADPL111             03
     C           *IN03     IFEQ '0'
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     ENDIF
     C           *IN03     IFEQ '0'
     C                     Z-ADDB5HIZK    WHIZK
     C                     Z-ADDB5KAIS    WKAIS
     C                     Z-ADDB5NBIN    WNBIN
     C                     ENDIF
      *
     C*----------------------*
     C* READ FCCPL11         *
     C*----------------------*
     C           *IN04     IFEQ '1'
      *
     C           ABSYOS    IFEQ 0
     C                     SETOF                     03
     C           SKEY      CHAINFCEPL011             03
     C           *IN03     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     03
     C                     ENDIF
     C           *IN03     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    FNSY
     C                     ELSE
     C                     Z-ADDA2SSYS    FNSY
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADD1         B4MAST
      *
     C           @SXX1     TAG
     C                     SETOF                     03
     C           K@FCC2    CHAINFCCPL131             03
     C           *IN03     IFEQ '0'
      *
     C                     SETOF                     03
     C           1         CHAINFCCNP32              03
     C           *IN03     IFEQ '0'
     C                     MOVE *BLANK    XRKBN   1
      *
     C                     SETOF                     03
     C           K@FCC3    CHAINFCCPL331             03
     C           *IN03     IFEQ '0'
     C                     Z-ADDB4RECD    B4MAST
     C                     MOVE '*'       B4RKBN
     C                     UPDATFCCPL331
     C                     ENDIF
      *
     C                     EXCPT@UP
     C                     ENDIF
     C  N03                GOTO @SXX1
     C                     ELSE
      *
     C                     SETOF                     03
     C           1         CHAINFCCNP32              03
     C           *IN03     IFEQ '0'
     C                     SETOF                     03
     C           K@FCC2    CHAINFCCPL321             03
     C           *IN03     IFEQ '0'
     C                     MOVE '*'       B4RKBN
     C                     UPDATFCCPL321
     C                     ENDIF
      *
     C                     EXCPT@UP
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    B4KANR
     C                     Z-ADD0         B4OSRO
     C                     MOVE *BLANK    B4OTNI
     C                     Z-ADDFNSY      B4NSRO
     C                     MOVE FNST      B4NTNI
     C                     Z-ADD*DATE     B4SRHZ
     C                     MOVE *BLANK    B4NISU
     C                     Z-ADD0         B4UTIS
     C                     Z-ADD0         B4UTI
     C                     Z-ADD0         B4HUHZ
     C                     Z-ADD0         B4UBIN
     C                     MOVE *BLANK    B4BUKN
     C                     MOVE *BLANK    B4UTAN
     C                     MOVE *BLANK    B4NKAS
     C                     MOVE *BLANK    B4SOKN
     C                     Z-ADD0         B4TKMM
     C                     Z-ADD0         B4TKJN
     C                     Z-ADD0         B4TSMM
     C                     Z-ADD0         B4TSJN
     C                     Z-ADD0         B4CARD
     C                     Z-ADD0         B4KAMS
     C                     MOVE *BLANK    B4KASI
     C                     Z-ADD0         B4KAZS
     C                     MOVE *BLANK    B4KUBN
     C                     MOVE *BLANK    B4HIBN
     C                     Z-ADD0         B4URHZ
     C                     Z-ADD0         B4URMS
     C                     MOVE *BLANK    B4SIRE
     C                     MOVE *BLANK    B4SMEI
     C                     MOVE *BLANK    B4SKYU
     C                     MOVE *BLANK    B4BUSY
     C                     MOVE *BLANK    B4RNBN
     C                     MOVE *BLANK    B4KNBS
     C                     Z-ADD0         B4KNHZ
     C                     Z-ADD0         B4KBIN
     C                     Z-ADD0         B4KNMI
     C                     Z-ADD0         B4KINP
     C                     Z-ADD0         B4KSRO
     C                     Z-ADD0         B4KURS
     C                     MOVE *BLANK    B4GNBN
     C                     Z-ADD0         B4GNHZ
     C                     Z-ADD0         B4GBIN
     C                     Z-ADD0         B4GKMI
     C                     Z-ADD0         B4GINP
     C                     Z-ADD0         B4GSRO
     C                     Z-ADD0         B4GURS
     C                     Z-ADD0         B4KAIK
     C                     Z-ADD0         B4RUIK
     C                     Z-ADD0         B4TAHZ
      *
     C                     Z-ADDABTOKU    B4TOKU
     C                     Z-ADDABNONY    B4NONY
     C                     MOVE ABNKOJ    B4NKOJ
     C                     MOVE ABNUKE    B4NUKE
     C                     MOVE ABSBAN    B4SBAN
     C                     MOVELABMHIN    B4MHIN
     C                     Z-ADDUYM1      B4MAHZ
      *
     C**TEMP               WRITEFCCPL111
     C                     ELSE
      *
     C           WSYOS     IFNE 0
     C                     Z-ADDWSYOS     B4NSRO
     C                     MOVE FNST      B4NTNI
     C                     ENDIF
      *
     C**TEMP               UPDATFCCPL111
     C                     ENDIF
      *
     C                     ENDSR
     C*==============================================*
     C* READ ABBPP01                                 *
     C*==============================================*
     C           #ABBP     BEGSR
      *
      *
     C                     SETOF                     03
     C           K@ABB2    CHAINABBPL011             03
      *
     C                     Z-ADDB4TOKU    Q5TOKU
     C                     Z-ADDB4NONY    Q5NONY
     C                     MOVE B4NKOJ    Q5NKOJ
     C                     MOVE B4NKOJ    Q5GKOJ
     C                     MOVE B4NUKE    Q5NUKE
     C                     MOVE B4NUKE    Q5GUKE
     C                     MOVE B4SBAN    Q5SEBN
     C                     MOVE B4MHN1    Q5MHN1
     C                     MOVE B4MHN2    Q5MHN2
     C                     MOVE B4MHN3    Q5MHN3
     C                     MOVE B4MHN4    Q5MHN4
     C                     MOVE B4SHN1    Q5SHN1
     C                     MOVE B4SHN2    Q5SHN2
     C                     MOVE B4SHN3    Q5SHN3
      *
     C           *IN03     IFEQ '1'
     C                     MOVE *BLANK    Q5CHK1
     C                     Z-ADD0         Q5CHS1
     C                     MOVE *BLANK    Q5CHK2
     C                     Z-ADD0         Q5CHS2
     C                     MOVE *BLANK    Q5N2NK
     C                     Z-ADD0         Q5N2NM
     C                     Z-ADD0         AN2
     C                     MOVE *BLANK    Q5N1NK
     C                     Z-ADD0         Q5N1NM
     C                     Z-ADD0         Q5NNNM
     C                     Z-ADD0         Q5NNOM
     C                     Z-ADD0         Q51NNM
     C                     Z-ADD0         Q51NOM
     C                     Z-ADD0         Q52NNM
     C                     Z-ADD0         Q52NOM
     C                     Z-ADD0         AN1
     C                     Z-ADD0         Q5N4GM
     C                     Z-ADD0         Q5N4ND
     C                     Z-ADD0         Q5N3GM
     C                     Z-ADD0         Q5N3ND
     C                     Z-ADD0         Q5N2GM
     C                     Z-ADD0         Q5N2ND
     C                     Z-ADD0         Q5N1GM
     C                     Z-ADD0         Q5N1ND
     C                     MOVE *BLANK    Q5NSYR
     C                     ENDIF
      *
     C           UYM1      IFLT UDHZ
     C                     MOVE 'N'       Q5N1NK
     C                     MOVE FS1       Q5N1NM
     C                     Z-ADDFNS       AN1
      *
     C           Q5NSYR    IFNE '*'
     C                     Z-ADDQ5NNNM    Q5NNOM
     C                     Z-ADDQ51NNM    Q51NOM
     C                     ENDIF
      *
     C                     MOVE 'N'       Q5NNNK
     C                     Z-ADDFS2       Q5NNNM
     C                     Z-ADD0         ANN
      *
     C           FS2       DIV  WDD       WSUR1
     C                     MVR            WSUR2
     C           WSUR2     IFNE 0
     C                     ADD  1         WSUR1
     C                     ENDIF
      *
     C                     Z-ADD1         B
     C           1         DO   31        B
     C           HIZ2,B    IFNE 0
     C           HIZ2,B    IFEQ 1
     C                     Z-ADDWSUR1     ANN,B
     C                     ELSE
     C           WSUR1     DIV  2         ANN,B
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE 'N'       Q51NNK
     C                     Z-ADDFS3       Q51NNM
     C                     ELSE
      *
     C           Q5NSYR    IFNE '*'
     C                     Z-ADDQ5NNNM    Q5NNOM
     C                     Z-ADDQ51NNM    Q51NOM
     C                     Z-ADDQ52NNM    Q52NOM
     C                     ENDIF
      *
     C                     MOVE 'N'       Q5NNNK
     C                     MOVE FS1       Q5NNNM
     C                     Z-ADDFNS       ANN
     C                     MOVE 'N'       Q51NNK
     C                     Z-ADDFS2       Q51NNM
     C                     MOVE 'N'       Q52NNK
     C                     Z-ADDFS3       Q52NNM
     C                     ENDIF
      *
     C                     MOVE ABNOKN    Q5NOKU
     C                     Z-ADDWHIZK     Q5MHIZ
     C                     Z-ADDWKAIS     Q5MKAI
     C                     Z-ADDWNBIN     Q5MATO
     C                     Z-ADDB4NSRO    Q5SYUY
     C                     MOVE B4NTNI    Q5TANI
     C                     Z-ADDUYM1      Q5NTYM
     C                     Z-ADD*DATE     Q5NHHZ
     C                     MOVE *BLANK    Q5NSYR
      *
     C           Q5NAIG    IFNE 9
     C           PSIGO     IFEQ '0'
     C           Q5NAIG    CABNE0         XX4
     C                     ELSE
     C           Q5NAIG    CABGE3         XX1
     C                     ENDIF
      *
     C           FS1       IFEQ 0
     C           FS2       IFEQ 0
     C           FS3       IFEQ 0
     C                     GOTO XX1
     C                     ENDIF
      *
     C                     Z-ADD1         Q5NAIG
     C                     GOTO XX1
     C                     ENDIF
      *
     C                     Z-ADD2         Q5NAIG
     C                     GOTO XX1
     C                     ENDIF
      *
     C                     Z-ADD3         Q5NAIG
     C                     GOTO XX1
     C           XX4       TAG
      *
     C                     ADD  1         Q5NAIG
     C           XX1       TAG
     C                     ENDIF
      *
     C           *IN03     IFEQ '0'
     C                     MOVE '*'       Q5NSYR
     C                     UPDATABBPL011
     C                     ELSE
     C                     WRITEABBPL011
     C                     ENDIF
     C**                   EXCPT@DT2
      * PART MASTER UNMATCHED LIST *
     C                     MOVE *BLANK    @@ERCD  1
     C           Q5NNNM    IFEQ 0
     C           Q51NNM    ANDEQ0
     C           Q52NNM    ANDEQ0
     C           FS4       ANDEQ0
     C           FS5       ANDEQ0
     C                     ELSE
     C                     MOVE *BLANK    W2TEHI  1
     C                     SETOF                     72
     C                     SETOF                     73
     C           K@ABB1    CHAINFCEPL011             72
     C           *IN72     IFEQ '1'
     C                     MOVE '1'       @@ERCD  1
     C**                   EXCPT@DT
     C                     MOVE *ON       *IN73
     C                     ELSE
     C           Q5NONY    IFNE 0323
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     MOVE '2'       @@ERCD  1
     C**                   EXCPT@DT
     C                     MOVE *ON       *IN73
     C                     ELSE
     C                     MOVE A2TEHI    W2TEHI
     C                     SELEC
     C           A2TAHZ    WHEQ 0
     C                     MOVE '3'       @@ERCD  1
     C**                   EXCPT@DT
     C                     MOVE *ON       *IN73
     C           A2TEHI    WHNE 'G'
     C                     MOVE '4'       @@ERCD  1
     C**                   EXCPT@DT
     C                     MOVE *ON       *IN73
     C           A2TAHZ    WHGT *DATE
     C                     MOVE '5'       @@ERCD  1
     C**                   EXCPT@DT
     C                     MOVE *ON       *IN73
     C                     ENDSL
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN73     IFEQ *OFF
     C           K@ABB1    CHAINAGAPL31              73
     C           *IN73     IFEQ *ON
      *
     C           K@ABB1    SETLLAAPTL01
     C           *IN73     DOUEQ*ON
     C           K@ABB1    READEAAPTL01                  73
     C           *IN73     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ99999999
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN73     IFEQ *ON
     C                     MOVE '6'       @@ERCD  1
     C**                   EXCPT@DT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
     C*==============================================*
     C* CHECK COMMON MASTER              *
     C*==============================================*
     C           #SUB      BEGSR
     C                     MOVELABTOKU    P@TOKU
     C                     MOVELABNONY    P@NONY
     C                     MOVELABNKOJ    P@NKOJ
     C                     MOVELABNUKE    P@NUKE
     C                     MOVELABMHIN    P@MHIN
     C                     CALL 'BBHR50'
     C                     PARM           P@TOKU  4
     C                     PARM           P@NONY  4
     C                     PARM           P@NKOJ  1
     C                     PARM           P@NUKE  4
     C                     PARM           P@MHIN 20
     C                     PARM           P@SHIN 12
     C                     PARM           P@FLG   1
     C                     MOVELP@SHIN    B4SHIN
     C*
     C                     MOVELABTOKU    @TOKU   4
     C                     MOVELABNONY    @NONY   4
     C                     MOVELABNKOJ    @NKOJ   1
     C                     MOVELABNUKE    @NUKE   4
     C                     MOVELABMHIN    @MHIN  20
     C                     MOVEL*DATE     @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
     C           @TANK     IFEQ *ZERO
     C                     MOVELABMHIN    FMHN
     C                     MOVELP@SHIN    FSHN
     C                     MOVEL'FCST'    FCST   10 P
     C                     Z-ADD*DATE     FNOYMD
     C                     Z-ADD01        FNOBN   20
     C                     EXCPT@MITAN
     C                     ENDIF
      *
     C                     ENDSR
      *
     C*==============================================*
     C* USER WORKING DAYS (CUST/DELIVERY)            *
     C* MONTH (N)                                    *
     C*==============================================*
     C           #CT1      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE *BLANK    @TKBN
     C                     Z-ADD0         WCD     31
     C                     Z-ADD0         HIZ1
     C           K@AGD2    SETLLAGDPL311
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD2    READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
      *
     C*==============================================*
     C* USER WORKING DAYS (CUST)                     *
     C* MONTH (N)                                    *
     C*==============================================*
     C           #CT2      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE *BLANK    @TKBN
     C                     Z-ADD0         WCD
     C                     Z-ADD0         HIZ1
     C           K@AGD3    SETLLAGDPL311
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD3    READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
      *
     C*==============================================*
     C* IAF WORKING DAYS                             *
     C* MONTH (N)                                    *
     C*==============================================*
     C           #CT3      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE 'A'       @TKBN
     C                     Z-ADD0         WCD
     C                     Z-ADD0         HIZ1
     C           K@AGD1    SETLLA@DPL12
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD1    READEA@DPL12                  03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
      *
     C*==============================================*
     C* USER WORKING DAYS (CUST/DELIVERY)            *
     C* MONTH (N+1)                                  *
     C*==============================================*
     C           #CY1      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE *BLANK    @YKBN
     C                     Z-ADD0         WDD     31
     C                     Z-ADD0         HIZ2
     C           K@AGD6    SETLLAGDPL311
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD6    READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
      *
     C*==============================================*
     C* USER WORKING DAYS (CUST)                     *
     C* MONTH (N+1)                                  *
     C*==============================================*
     C           #CY2      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE *BLANK    @YKBN
     C                     Z-ADD0         WDD
     C                     Z-ADD0         HIZ2
     C           K@AGD7    SETLLAGDPL311
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD7    READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
      *
     C*==============================================*
     C* IAF  WORKING DAYS                            *
     C* MONTH (N+1)                                  *
     C*==============================================*
     C           #CY3      BEGSR
      *
     C                     SETOF                     02
     C                     SETOF                     03
     C                     MOVE 'A'       @YKBN
     C                     Z-ADD0         WDD
     C                     Z-ADD0         HIZ2
     C           K@AGD4    SETLLA@DPL12
      *
     C**                   DO   *HIVAL
     C**                   SETOF                     03
     C           *IN03     DOWEQ*OFF
     C           K@AGD4    READEA@DPL12                  03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     ENDIF
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C**N03                END
     C                     ENDDO
      *
     C                     ENDSR
     C*==============================================*
     C* INITIALIZATION                               *
     C*==============================================*
     C           #INIT     BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           PSIGO   1
     C                     PARM           PHIZK   6
     C                     PARM           PDYM    6
     C* GET FC YEAR/MM
     C                     MOVE PHIZK     UYM1
     C                     Z-ADD0         UDHZ
     C                     MOVE PDYM      UDHZ
      *
     C           UMM1      IFEQ 12
     C           UYY1      ADD  1         UYY2
     C                     Z-ADD01        UMM2
     C                     ELSE
     C                     Z-ADDUYY1      UYY2
     C           UMM1      ADD  1         UMM2
     C                     ENDIF
      *
     C           UMM2      IFEQ 12
     C           UYY2      ADD  1         UYY3
     C                     Z-ADD01        UMM3
     C                     ELSE
     C                     Z-ADDUYY2      UYY3
     C           UMM2      ADD  1         UMM3
     C                     ENDIF
      *
     C           UMM1      IFEQ 01
     C           UYY1      SUB  1         WYY
     C                     Z-ADD12        WMM
     C                     ELSE
     C                     Z-ADDUYY1      WYY
     C           UMM1      SUB  1         WMM
     C                     ENDIF
      *--------
      * KLIST
      *--------
     C           K@AGD1    KLIST
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           K@AGD2    KLIST
     C                     KFLD           ABTOKU
     C                     KFLD           ABNKOJ
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           K@AGD3    KLIST
     C                     KFLD           ABTOKU
     C                     KFLD           WWNKOJ
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           K@AGD4    KLIST
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           K@AGD6    KLIST
     C                     KFLD           ABTOKU
     C                     KFLD           ABNKOJ
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           K@AGD7    KLIST
     C                     KFLD           ABTOKU
     C                     KFLD           WWNKOJ
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           K@FCC1    KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
     C                     KFLD           B4SBAN
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     KFLD           B4MHN3
     C                     KFLD           B4MHN4
      *
     C           K@GAD1    KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
      *
     C           K@FCC2    KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           B4MAST
      *
     C           K@FCC3    KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           XRKBN
      *
     C           K@ABB2    KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
     C                     KFLD           B4SBAN
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     KFLD           B4MHN3
     C                     KFLD           B4MHN4
      *
     C           K@ABB1    KLIST
     C                     KFLD           Q5SHN1
     C                     KFLD           Q5SHN2
     C                     KFLD           Q5SHN3
      *
     C           SKEY      KLIST
     C                     KFLD           B4SHN1
     C                     KFLD           B4SHN2
     C                     KFLD           B4SHN3
      *
     C           K@P50     KLIST
     C                     KFLD           ABNONY
     C                     KFLD           ABNKOJ
     C                     KFLD           ABNUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
      *
     C                     Z-ADD0         @TOKU1  40
     C                     MOVE *BLANK    @NKOJ1  1
     C                     Z-ADD0         @TOKU2  40
     C                     MOVE *BLANK    @NKOJ2  1
     C                     MOVE *BLANK    @TKBN   1
     C                     MOVE *BLANK    @YKBN   1
      *
     C                     ENDSR
      **************************************************
      * OUTPUT                                         *
      **************************************************
     OFCCNP32 E                @UP
     O                                    6 'ABAR64'
      *
     O**ABAWP72 E                @DT
     O**                       Q5TOKU     4
     O**                       Q5NONY     8
     O**                       Q5NKOJ     9
     O**                       Q5GKOJ    10
     O**                       Q5NUKE    14
     O**                       Q5GUKE    18
     O**                       Q5SEBN    22
     O**                       Q5MHN1    27
     O**                       Q5MHN2    32
     O**                       Q5MHN3    37
     O**                       Q5MHN4    42
     O**                       Q5SHN1    47
     O**                       Q5SHN2    52
     O**                       Q5SHN3    54
     O**                       Q5NNNM    63
     O**                       Q51NNM    72
     O**                       Q52NNM    81
     O**                       Q5NOKU    82
     O**                       ANN      299
     O**                       W2TEHI   300
     O**                       @@ERCD   301
     O**                       FS4      310
     O**                       FS5      319
      *
     O**ABAWP32 E                @DT2
     O**                       Q5TOKU     4
     O**                       Q5NONY     8
     O**                       Q5GKOJ     9
     O**                       Q5GUKE    13
     O**                       Q5MHN1    18
     O**                       Q5MHN2    23
     O**                       Q5MHN3    28
     O**                       Q5MHN4    33
     O**                       Q5SEBN    37
      *
     OMITANKF EADD             @MITAN
     O                                    1 'U'
     O                                    2 'K'
     O                                    3 ' '
     O                         ABTOKU     7
     O                         ABNKOJ     8
     O                         ABNUKE    12
     O                         ABNONY    16
     O                         ABNKOJ    17
     O                         ABNUKE    21
     O                         FMHN1     26
     O                         FMHN2     31
     O                         FMHN3     36
     O                         FMHN4     41
     O                         FSHN1     46
     O                         FSHN2     51
     O                         FSHN3     53
     O                         FCST      73
     O                                   76 '000'
     O                                   84 'C'
     O                         FNOYY     88
     O                         FNOMM     90
     O                         FNODD     92
     O                         FNOBN     94
