     H            Y/
     F***************************************************
     F*  FORECAST HISTORY INQUIRY                       *
     F* TCHK1 03/06/09 RE-MAKE                          *
     F*------------------------------------------------------------------------*
     F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                                  *
     F*------------------------------------------------------------------------*
     F* 2016/04/01 | T.SAKAKI    |%0001| ADD IDENTIFICATION NUMBER             *
     F* 2016/10/30 | T.SAKAKI    |%0002| OMIT DUPLICATED FORECAST              *
     F* 2018/02/14 | J.WATA      |JW1  | ADD F3                                *
     F* 2018/07/10 | T.SAKAKI    |%0003| ADD TOYOTA BUILD OUT FLG              *
     F* 2018/08/09 | KIRI        |%04  | CALL FROM "ABBR37" PARM ADD           *
     F* 2021/08/04 | J.WATANABE  |JW1  | ADD D@MSG2                            *
     F* 2023/12/12 | J.WATANABE  |JW2  | ADD E/M                               *
     F* 2024/01/26 | J.WATANABE  |JW3  | CHG KEY FOR ABBPL02(K#ABP)            *
     F* 2024/05/24 | J.WATANABE  |JW4  | CHG RCV DATE 4(MM/DD) --> 6(YY/MM/DD) *
     F**************************************************************************
     FABBPW25 CF  E                    WORKSTN
     F                                        RRN0  KSFILE SFL00
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FABBPL51 IF  E           K        DISK
     FABBPL54 IF  E           K        DISK
     F            ABBPP501                          KRENAMEABB54R
     FABAWL10 IF  E           K        DISK
     FABBPL02 IF  E           K        DISK
     FABF9L01 IF  E           K        DISK
     FABFPL16 IF  E           K        DISK
     FABFPL14 IF  E           K        DISK
     F            ABFPP101                          KRENAMEABF14R
     FABBPL62 IF  E           K        DISK
TCHK2FFCEPL01 IF  E           K        DISK
TCHK2FFCEPL11 IF  E           K        DISK
TCHK5FGADPL11 IF  E           K        DISK
TCHK6FAGDPL12 IF  E           K        DISK
      *------------------------------------------------------------
     E                    CMD     1   5 78
     E***                 ERR     1   2 78
JW1  E                    ERR     1   3 78
     E                    MON    12  12  3
     E                    DT1         7  8 0
     E                    DT2       100  8 0
     E                    QTY         7  7 0
      *
     E**                  DTE         7  4 0
JW4  E                    DTE         7  6 0
      *
     E                    D@M         9  3
     E**                  DAT        10  8 0
JW4  E                    DAT        50  8 0
     E                    YM          9  6 0
     E                    DLV        99  9
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   9 W@DLV
     I                                        1   40W@NONY
     I                                        5   5 W@NKOJ
     I                                        6   9 W@NUKE
     I            DS
     I                                        1  49 QTY
     I                                        1   70S@QTY1
     I                                        8  140S@QTY2
     I                                       15  210S@QTY3
     I                                       22  280S@QTY4
     I                                       29  350S@QTY5
     I                                       36  420S@QTY6
     I                                       43  490S@QTY7
     I**          DS
     I**                                      1  28 DTE
     I**                                      1   40D@DAT1
     I**                                      5   80D@DAT2
     I**                                      9  120D@DAT3
     I**                                     13  160D@DAT4
     I**                                     17  200D@DAT5
     I**                                     21  240D@DAT6
     I**                                     25  280D@DAT7
     I            DS
JW4  I                                        1  42 DTE
 .   I                                        1   60D@DAT1
 .   I                                        7  120D@DAT2
 .   I                                       13  180D@DAT3
 .   I                                       19  240D@DAT4
 .   I                                       25  300D@DAT5
 .   I                                       31  360D@DAT6
JW4  I                                       37  420D@DAT7
     I            DS
     I                                        1  20 WWPRT
     I                                        1   5 BBMHN1
     I                                        6  10 BBMHN2
     I                                       11  15 BBMHN3
     I                                       16  20 BBMHN4
     I            DS
     I                                        1  20 S@MPAR
     I                                        1   5 S@MPR1
     I                                        6  10 S@MPR2
     I                                       11  15 S@MPR3
     I                                       16  20 H@MPR4
     I            DS
     I                                        1  20 D@MPAR
     I                                        1   5 D@MPR1
     I                                        6  10 D@MPR2
     I                                       11  15 D@MPR3
     I                                       16  20 D@MPR4
%04  I            DS
  |  I                                        1  12 D@PAR
  |  I                                        1   5 D@PRT1
  |  I                                        6  10 D@PRT2
%04  I                                       11  12 D@PRT3
     I            DS
     I                                        1   60@YYMM
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1   80WYMD
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80W@DT8
     I                                        1   60W@DTYM
     I                                        1   40W@DTY
     I                                        5   60W@DTM
     I                                        7   80W@DTD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1   80A2GEHZ
     I                                        1   40A2GEYY
     I                                        5   60A2GEMM
     I                                        7   80A2GEDD
TCHK3I            DS
TCHK3I                                        1  12 WPSHIN
TCHK3I                                        1   5 WPSHN1
TCHK3I                                        6  10 WPSHN2
TCHK3I                                       11  12 WPSHN3
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'00'      #SCRN0
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KEY     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@RCDT  80
      *
     C           K#KEYX    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
      *
     C           K#KEY0    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
      *
     C           K#FD10    KLIST
     C                     KFLD           F9DOCK
     C                     KFLD           K@PART 12
      *
     C           K#FD1X    KLIST
     C                     KFLD           F9DOCK
     C                     KFLD           K@PART 12
     C                     KFLD           K@CEDT  60
      *
     C           K#F14     KLIST
     C                     KFLD           K@PART 12
     C                     KFLD           F9DOCK
     C                     KFLD           K@ISDT  60
      *
     C           K#F14X    KLIST
     C                     KFLD           K@PART 12
     C                     KFLD           F9DOCK
      *
     C           K#ABP     KLIST
     C                     KFLD           D@PRT1
     C                     KFLD           D@PRT2
     C                     KFLD           D@PRT3
      *
     C           K#ABPX    KLIST
     C                     KFLD           D@PRT1
     C                     KFLD           D@PRT2
     C                     KFLD           D@PRT3
     C                     KFLD           K@RCDT  80
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
      *
     C           K#ABW     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@YYMM  60
      *
TCHK3C           *ENTRY    PLIST
TCHK3C                     PARM           PMSHIN 12
%04  C*::
  |  C                     PARM           P@MPAR 20
  |  C                     PARM           P@TOKU  4
  |  C                     PARM           P@NONY  4
  |  C                     PARM           P@NKOJ  1
  |  C                     PARM           P@NUKE  4
  |  C                     PARM           P@SEBN  4
%04  C*::
TCHK3C                     MOVELPMSHIN    WPSHIN
TCHK3C*
     C                     MOVEL'00'      W@ID    2
     C                     Z-ADD*ZERO     DTE
     C                     Z-ADD*DATE     WYMD
     C                     SUB  1         WMM
     C           WMM       IFLE *ZERO
     C                     ADD  12        WMM
     C                     SUB  1         WYY
     C                     ENDIF
      *
     C                     Z-ADD1         W@SHFT  20
%04  C*::::::::::::::::::::
  |  C           P@MPAR    IFNE *BLANK
  |  C                     EXSR ##R37
  |  C                     ENDIF
%04  C*::::::::::::::::::::
      *
     C                     ENDSR
%04  C*::::::::::::::::::::::::::::::::::::::::::::::::::::::
  |  C           ##R37     BEGSR
  |  C                     MOVE PMSHIN    D@PAR
  |  C                     MOVELP@MPAR    S@MPAR
JW2  C                     MOVELP@TOKU    S@TOKU
  |  C                     MOVELP@NONY    S@NONY
  |  C                     MOVELP@NKOJ    S@NKOJ
  |  C                     MOVELP@NUKE    S@NUKE
  |  C                     MOVELP@SEBN    S@SEBN
  |  C                     MOVE *BLANK    @FORD
  |  C                     MOVE S@MPAR    D@MPAR
  |  C                     MOVE S@NONY    @@NONY
JW2  C                     MOVE S@TOKU    D@TOKU
  |  C                     MOVE S@NONY    D@NONY
  |  C                     MOVE S@NKOJ    D@FACT
  |  C                     MOVE S@NUKE    D@DOCK
  |  C**
  |  C           K#GAD3    KLIST
  |  C                     KFLD           K$TOKU  40
  |  C                     KFLD           K$NONY  40
  |  C                     MOVE P@TOKU    K$TOKU  40
  |  C                     MOVE P@NONY    K$NONY  40
  |  C           K#GAD3    CHAINGADPL11              94
  |  C  N94                MOVELB5KMEI    S@NONM
  |  C   94                MOVEL*BLANK    S@NONM
  |  C                     MOVELS@NONM    D@NONM
  |  C**
  |  C                     MOVEL*DATE     @YYMM
  |  C           @YYMM     MULT 100       @YMD    80
  |  C                     ADD  1         @YMD
  |  C**
  |  C           @@NONY    CHAINABF9L01              91
  |   * FORD
  |  C           *IN91     IFEQ *OFF
  |  C                     MOVE '1'       @FORD   1
  |  C                     ENDIF
  |   *
  |  C           @FORD     IFEQ *BLANK
  |  C                     EXSR #SET1
  |  C                     ELSE
  |   * FORD
  |  C                     EXSR #SFRD
  |  C                     ENDIF
  |   *
  |  C           RRN1      IFEQ *ZERO
  |  C                     MOVE '99'      W@ID
  |  C                     ELSE
  |  C                     MOVE '02'      W@ID
  |  C                     ENDIF
  |  C*::::::::::::::::::::::::::::::::::::::::::::::::::::::
%04  C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN0    BEGSR
      *
TCHK3C           PMSHIN    IFEQ *BLANK
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
TCHK3C                     ELSE
TCHK3C                     MOVELWPSHN1    D@PRT1
TCHK3C                     MOVELWPSHN2    D@PRT2
TCHK3C                     MOVELWPSHN3    D@PRT3
TCHK3C                     END
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
JW   C           *INKL     OREQ *ON
     C                     MOVEL'99'      W@ID
JW7   * F7: FROM PREVIOUS MONTH
 .   C           *INKG     WHEQ *ON
 .   C           D@PAR     ANDNE*BLANK
     C                     MOVELD@PAR     $SHIN
 .   C                     CALL 'ABBC25P'
     C                     PARM           $SHIN  12
JW2  C                     MOVE '00'      W@ID
      * ENTR: PROCESS
     C                     OTHER
     C                     EXSR #CHK0
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET0
     C                     MOVEL'01'      W@ID
     C                     ELSE
     C           PMSHIN    IFNE *BLANK
     C                     MOVEL'99'      W@ID
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK
      *------------------------------------------------------
     C           #CHK0     BEGSR
      *
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN99
      *
     C           K#ABP     CHAINABBPL02              90
     C           *IN90     IFEQ *ON
     C           K#ABP     SETGTABBPL54
     C           *IN90     DOUEQ*ON
     C           K#ABP     REDPEABBPL54                  90
     C           *IN90     IFEQ *OFF
JW   C           BBFLG1    ANDEQ' '
     C*          BBSDAT    ANDGT*DATE
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN90     IFEQ *ON
     C                     MOVE ERR,1     D@MSG
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA
      *------------------------------------------------------
     C           #SET0     BEGSR
      *
     C                     Z-ADD*ZERO     RRN0    40
     C                     MOVE *ON       *IN54
     C                     WRITECTL00
     C                     MOVE *OFF      *IN54
     C                     Z-ADD*ZERO     D@MQT1
     C                     Z-ADD*ZERO     D@MQT2
     C                     Z-ADD*ZERO     D@MQT3
     C                     MOVE *BLANK    DLV
     C                     Z-ADD*ZERO     Z       40
     C                     Z-ADD*ZERO     YM
TCHK5C                     MOVEL*ON       *IN55
      *
TCHK2C           K#ABP     CHAINFCEPL01              90
TCHK2C           *IN90     IFEQ *OFF
TCHK2C                     Z-ADDA2GEKN    D@GEKN
TCHK2C                     Z-ADDA2GEHZ    D@GEHZ
TCHK5C                     Z-ADDA2SSYS    D@QPC
TCHK2C                     ELSE
TCHK2C                     Z-ADD*ZERO     D@GEKN
TCHK2C                     Z-ADD*ZERO     D@GEHZ
TCHK5C                     Z-ADD*ZERO     D@QPC
TCHK2C                     END
TCHK2C           K#ABP     CHAINFCEPL11              90
TCHK2C           *IN90     IFEQ *OFF
TCHK2C           FCCD01    ANDNE*ZERO
TCHK2C           FCGK01    DIV  FCCD01    @@GEKN  90
TCHK2C           @@GEKN    MULT 20        D@GEKN
TCHK2C                     END
      *
     C           K#ABP     SETLLABBPL02
     C           *IN90     DOUEQ*ON
     C           K#ABP     READEABBPL02                  90
     C           *IN90     IFEQ *OFF
     C*
     C                     ADD  1         RRN0
     C           RRN0      IFEQ 1
     C                     EXSR #MON
     C                     ENDIF
      *
     C                     CLEARSFL00
      * %0002 CNT
     C                     Z-ADD0         CNT1    20
      *
     C                     ADD  1         Z
     C                     MOVE Q5NONY    W@NONY
     C                     MOVE Q5NKOJ    W@NKOJ
     C                     MOVE Q5NUKE    W@NUKE
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    W@NUKE
     C                     ENDIF
     C                     MOVE W@DLV     DLV,Z
      *
JW2  C                     Z-ADDQ5TOKU    S@TOKU
     C                     Z-ADDQ5NONY    S@NONY
     C                     MOVELQ5NKOJ    S@NKOJ
     C                     MOVELQ5NUKE    S@NUKE
%0001C                     MOVELQ5SEBN    S@SEBN
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    S@NUKE
     C                     ENDIF
     C                     MOVE Q5MHN1    S@MPR1
     C                     MOVE Q5MHN2    S@MPR2
     C                     MOVE Q5MHN3    S@MPR3
     C                     MOVE Q5MHN4    H@MPR4
      * GET FORECAST ENTRY TYPE
JW2  C                     MOVELS@NONY    $NONY
 .   C                     MOVELS@NKOJ    $NKOJ
 .   C                     MOVELS@NUKE    $NUKE
 .   C                     MOVELS@MPAR    $MHIN
 .   C                     CALL 'UEXR44 '
 .   C                     PARM           $NONY   4
 .   C                     PARM           $NKOJ   1
 .   C                     PARM           $NUKE   4
 .   C                     PARM           $MHIN  20
 .   C                     PARM           $OTYP   1
JW2  C                     MOVEL$OTYP     S@OTYP
      *
     C                     Z-ADDQ5NNNM    S@MQT1
     C                     Z-ADDQ51NNM    S@MQT2
     C                     Z-ADDQ52NNM    S@MQT3
     C                     Z-ADDQ5NNNM    H@MQT1
     C                     Z-ADDQ51NNM    H@MQT2
     C                     Z-ADDQ52NNM    H@MQT3
      *
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C                     MOVE Q5NONY    K@NONY  40
     C                     MOVE Q5NKOJ    K@NKOJ  1
     C                     MOVE Q5NUKE    K@NUKE  4
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    K@NUKE
     C                     ENDIF
     C                     MOVE Q5MHN1    K@MHN1  5
     C                     MOVE Q5MHN2    K@MHN2  5
     C                     MOVE Q5MHN3    K@MHN3  5
     C                     MOVE Q5MHN4    K@MHN4  5
     C** %0001
     C           K#ABW     CHAINABAWL10              95
S1   C           *IN95     IFEQ *OFF
     C** %0001
     C           Q5SEBN    ANDEQABSBAN
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABNNSU    S@MQT1
     C                     Z-ADDABNNSU    H@MQT1
     C                     ADD  1         CNT1
     C           X         WHEQ 2
     C                     Z-ADDABNNSU    S@MQT2
     C                     Z-ADDABNNSU    H@MQT2
     C                     ADD  1         CNT1
     C           X         WHEQ 3
     C                     Z-ADDABNNSU    S@MQT3
     C                     Z-ADDABNNSU    H@MQT3
     C                     ADD  1         CNT1
     C           X         WHEQ 4
     C                     Z-ADDABNNSU    H@MQT4
     C                     ADD  1         CNT1
     C           X         WHEQ 5
     C                     Z-ADDABNNSU    H@MQT5
     C                     ADD  1         CNT1
     C           X         WHEQ 6
     C                     Z-ADDABNNSU    H@MQT6
     C                     ADD  1         CNT1
     C           X         WHEQ 7
     C                     Z-ADDABNNSU    H@MQT7
     C                     ADD  1         CNT1
     C           X         WHEQ 8
     C                     Z-ADDABNNSU    H@MQT8
     C                     ADD  1         CNT1
     C           X         WHEQ 9
     C                     Z-ADDABNNSU    H@MQT9
     C                     ADD  1         CNT1
     C                     ENDSL
     C*
 E1  C                     ENDIF
     C*
     C                     ENDDO
     C*
     C* %Q002  OMIT DUPLICATED FORECAST
     C           Q5NONY    IFEQ 0492
     C           Q5NONY    OREQ 0645
     C           Q5NONY    OREQ 3347
     C           Q5NONY    OREQ 3481
     C           Q5NONY    OREQ 3764
     C           Q5NONY    OREQ 3931
     C           Q5NONY    OREQ 3951
     C           Q5NONY    OREQ 3953
     C           Q5NONY    OREQ 3764
     C           CNT1      IFEQ *ZERO
     C                     SUB  1         RRN0
     C                     ITER
     C                     ENDIF
     C                     ENDIF
     C*
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C           K#ABW     CHAINABBPL62              95
     C           *IN95     IFEQ *OFF
TCHK4C           ABSKJY    ANDEQ*BLANK
%0001C           Q5SEBN    ANDEQABSEBN
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABGEKN    S@MQT1
     C                     Z-ADDABGEKN    H@MQT1
     C           X         WHEQ 2
     C                     Z-ADDABGEKN    S@MQT2
     C                     Z-ADDABGEKN    H@MQT2
     C           X         WHEQ 3
     C                     Z-ADDABGEKN    S@MQT3
     C                     Z-ADDABGEKN    H@MQT3
     C           X         WHEQ 4
     C                     Z-ADDABGEKN    H@MQT4
     C           X         WHEQ 5
     C                     Z-ADDABGEKN    H@MQT5
     C           X         WHEQ 6
     C                     Z-ADDABGEKN    H@MQT6
     C           X         WHEQ 7
     C                     Z-ADDABGEKN    H@MQT7
     C           X         WHEQ 8
     C                     Z-ADDABGEKN    H@MQT8
     C           X         WHEQ 9
     C                     Z-ADDABGEKN    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
      *
     C           Q5TOKU    IFEQ 5149
     C                     EXSR #SET0A
     C                     Z-ADDK@ISDT    H@ISDT
     C                     END
      *
     C                     ADD  S@MQT1    D@MQT1
     C                     ADD  S@MQT2    D@MQT2
     C                     ADD  S@MQT3    D@MQT3
      *
TCHK5C           K#GAD1    KLIST
TCHK5C                     KFLD           Q5TOKU
TCHK5C                     KFLD           Q5NONY
TCHK5C           K#GAD1    CHAINGADPL11              94
TCHK5C  N94                MOVELB5KMEI    S@NONM
TCHK5C   94                MOVEL*BLANK    S@NONM
      *
     C                     WRITESFL00
     C                     Z-ADD*ZERO     S@MQT1
     C                     Z-ADD*ZERO     S@MQT2
     C                     Z-ADD*ZERO     S@MQT3
     C                     Z-ADD*ZERO     H@MQT1
     C                     Z-ADD*ZERO     H@MQT2
     C                     Z-ADD*ZERO     H@MQT3
     C                     Z-ADD*ZERO     H@MQT4
     C                     Z-ADD*ZERO     H@MQT5
     C                     Z-ADD*ZERO     H@MQT6
     C                     Z-ADD*ZERO     H@MQT7
     C                     Z-ADD*ZERO     H@MQT8
     C                     Z-ADD*ZERO     H@MQT9
     C                     ENDIF
     C                     ENDDO
      *
     C           YM,1      IFEQ *ZERO
     C                     MOVEL*DATE     @YYMM
     C                     Z-ADD*ZERO     YM
     C           *DAY      IFLT 20
     C                     Z-ADD@MM       M       30
     C                     ELSE
     C           @MM       ADD  1         M
     C           M         IFGT 12
     C                     SUB  12        M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    D@M
     C           1         DO   9         X       30
     C                     MOVE MON,M     D@M,X
     C                     Z-ADDM         @MM
     C                     Z-ADD@YYMM     YM,X
      *
     C                     ADD  1         M
     C           M         IFGT 12
     C                     Z-ADD1         M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C           K#ABP     SETGTABBPL54
     C           *IN90     DOUEQ*ON
     C           K#ABP     REDPEABBPL54                  90
     C           *IN90     IFEQ *OFF
JW   C           BBFLG1    ANDEQ' '
     C           BBRCDT    IFLT WYMD
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVE BBNONY    W@NONY
     C                     MOVE BBNKOJ    W@NKOJ
     C                     MOVE BBNUKE    W@NUKE
     C           W@DLV     LOKUPDLV                      10
     C           *IN10     IFEQ *ON
     C                     MOVE BBNONY    K@NONY
     C                     MOVE BBNKOJ    K@NKOJ
     C                     MOVE BBNUKE    K@NUKE
     C                     Z-ADDBBRCDT    K@RCDT
     C           K#ABPX    SETLLABBPL54
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         Z
     C                     MOVE W@DLV     DLV,Z
     C                     ADD  1         RRN0
      *
     C                     CLEARSFL00
JW2  C                     Z-ADDBBTOKU    S@TOKU
     C                     Z-ADDBBNONY    S@NONY
     C                     MOVELBBNKOJ    S@NKOJ
     C                     MOVELBBNUKE    S@NUKE
%0001C                     MOVELBBSEBN    S@SEBN
     C                     MOVE BBMHN1    S@MPR1
     C                     MOVE BBMHN2    S@MPR2
     C                     MOVE BBMHN3    S@MPR3
     C                     MOVE BBMHN4    H@MPR4
      *
      * GET FORECAST ENTRY TYPE
JW2  C                     MOVELS@NONY    $NONY
 .   C                     MOVELS@NKOJ    $NKOJ
 .   C                     MOVELS@NUKE    $NUKE
 .   C                     MOVELS@MPAR    $MHIN
 .   C                     CALL 'UEXR44 '
 .   C                     PARM           $NONY   4
 .   C                     PARM           $NKOJ   1
 .   C                     PARM           $NUKE   4
 .   C                     PARM           $MHIN  20
 .   C                     PARM           $OTYP   1
JW2  C                     MOVEL$OTYP     S@OTYP
      *
     C                     MOVE BBNONY    K@NONY  40
     C                     MOVE BBNKOJ    K@NKOJ  1
     C                     MOVE BBNUKE    K@NUKE  4
     C                     MOVE BBMHN1    K@MHN1  5
     C                     MOVE BBMHN2    K@MHN2  5
     C                     MOVE BBMHN3    K@MHN3  5
     C                     MOVE BBMHN4    K@MHN4  5
      *
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C           K#ABW     CHAINABAWL10              95
     C           *IN95     IFEQ *OFF
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABNNSU    S@MQT1
     C                     Z-ADDABNNSU    H@MQT1
     C           X         WHEQ 2
     C                     Z-ADDABNNSU    S@MQT2
     C                     Z-ADDABNNSU    H@MQT2
     C           X         WHEQ 3
     C                     Z-ADDABNNSU    S@MQT3
     C                     Z-ADDABNNSU    H@MQT3
     C           X         WHEQ 4
     C                     Z-ADDABNNSU    H@MQT4
     C           X         WHEQ 5
     C                     Z-ADDABNNSU    H@MQT5
     C           X         WHEQ 6
     C                     Z-ADDABNNSU    H@MQT6
     C           X         WHEQ 7
     C                     Z-ADDABNNSU    H@MQT7
     C           X         WHEQ 8
     C                     Z-ADDABNNSU    H@MQT8
     C           X         WHEQ 9
     C                     Z-ADDABNNSU    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
     C                     ADD  S@MQT1    D@MQT1
     C                     ADD  S@MQT2    D@MQT2
     C                     ADD  S@MQT3    D@MQT3
      *
TCHK5C           K#GAD2    KLIST
TCHK5C                     KFLD           BBTOKU
TCHK5C                     KFLD           BBNONY
TCHK5C           K#GAD2    CHAINGADPL11              94
TCHK5C  N94                MOVELB5KMEI    S@NONM
TCHK5C   94                MOVEL*BLANK    S@NONM
TCHK5C*
     C                     WRITESFL00
     C                     Z-ADD*ZERO     S@MQT1
     C                     Z-ADD*ZERO     S@MQT2
     C                     Z-ADD*ZERO     S@MQT3
     C                     Z-ADD*ZERO     H@MQT1
     C                     Z-ADD*ZERO     H@MQT2
     C                     Z-ADD*ZERO     H@MQT3
     C                     Z-ADD*ZERO     H@MQT4
     C                     Z-ADD*ZERO     H@MQT5
     C                     Z-ADD*ZERO     H@MQT6
     C                     Z-ADD*ZERO     H@MQT7
     C                     Z-ADD*ZERO     H@MQT8
     C                     Z-ADD*ZERO     H@MQT9
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN0      IFEQ 0
     C                     MOVE ERR,1     D@MSG
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     Z-ADD1         W@RCNO  40
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET FORD MONTHLY FORECAST
      *------------------------------------------------------
     C           #SET0A    BEGSR
      *
     C                     DO
      *
     C                     MOVELQ5NONY    @@NONY
     C           @@NONY    CHAINABF9L01              91
     C   91                LEAVE
     C*
     C                     MOVELS@MPAR    K@PART
     C           K#F14X    SETGTABFPL14
     C           K#F14X    REDPEABFPL14                  91
     C   91                LEAVE
     C                     Z-ADDFBSIDT    K@ISDT
     C*
     C           K#F14     SETLLABFPL14
     C                     DO   *HIVAL
     C*
     C           K#F14     READEABFPL14                  91
     C   91                LEAVE
     C           FBQTCD    IFNE 'M'
     C                     ITER
     C                     END
     C*
     C           FBCEDT    ADD  20000000  W@DT8
     C           W@DTD     IFLT 7
     C                     SUB  1         W@DTM
     C           W@DTM     IFLE *ZERO
     C                     Z-ADD12        W@DTM
     C                     SUB  1         W@DTY
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C           W@DTYM    LOKUPYM,X                     95
     C           *IN95     IFEQ *ON
     C                     SELEC
     C           X         WHEQ 1
     C                     ADD  FBQTY2    S@MQT1
     C                     ADD  FBQTY2    H@MQT1
     C           X         WHEQ 2
     C                     ADD  FBQTY2    S@MQT2
     C                     ADD  FBQTY2    H@MQT2
     C           X         WHEQ 3
     C                     ADD  FBQTY2    S@MQT3
     C                     ADD  FBQTY2    H@MQT3
     C           X         WHEQ 4
     C                     ADD  FBQTY2    H@MQT4
     C           X         WHEQ 5
     C                     ADD  FBQTY2    H@MQT5
     C           X         WHEQ 6
     C                     ADD  FBQTY2    H@MQT6
     C           X         WHEQ 7
     C                     ADD  FBQTY2    H@MQT7
     C           X         WHEQ 8
     C                     ADD  FBQTY2    H@MQT8
     C           X         WHEQ 9
     C                     ADD  FBQTY2    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *------------------------------------------------------
      *   SET MONTH
      *------------------------------------------------------
     C           #MON      BEGSR
      *
     C                     Z-ADDQ5NTYM    @YYMM
     C                     Z-ADD*ZERO     YM
     C                     Z-ADD@MM       M       30
     C                     MOVE *BLANK    D@M
     C           1         DO   9         X       30
     C                     MOVE MON,M     D@M,X
     C                     Z-ADDM         @MM
     C                     Z-ADD@YYMM     YM,X
      *
     C                     ADD  1         M
     C           M         IFGT 12
     C                     Z-ADD1         M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELD@M,1     D@MON1
     C                     MOVELD@M,2     D@MON2
     C                     MOVELD@M,3     D@MON3
TCHK6C*
TCHK6C                     MOVELYM,1      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD1
TCHK6C                     MOVELYM,2      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD2
TCHK6C                     MOVELYM,3      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD3
      *
     C                     ENDSR
TCHK6C*------------------------------------------------------
TCHK6C*   2ND SCREEN
TCHK6C*------------------------------------------------------
TCHK6C           #MONS1    BEGSR
TCHK6C*
TCHK6C           K#AGD     KLIST
TCHK6C                     KFLD           K@YYYY
TCHK6C                     KFLD           K@MMMM
TCHK6C                     Z-ADD@YY       K@YYYY  40
TCHK6C                     Z-ADD@MM       K@MMMM  20
TCHK6C                     Z-ADD*ZERO     W@DCNT  31
TCHK6C*
TCHK6C           K#AGD     SETLLAGDPL12
TCHK6C*
TCHK6C                     DO   *HIVAL
TCHK6C*
TCHK6C           K#AGD     READEAGDPL12                  80
TCHK6C   80                LEAVE
TCHK6C                     SELEC
TCHK6C           F8HIRU    WHNE *BLANK
TCHK6C           F8YORU    ANDNE*BLANK
TCHK6C                     ITER
TCHK6C           F8HIRU    WHEQ *BLANK
TCHK6C           F8YORU    ANDEQ*BLANK
TCHK6C                     ADD  1         W@DCNT
TCHK6C                     OTHER
TCHK6C                     ADD  0.5       W@DCNT
TCHK6C                     ENDSL
TCHK6C*
TCHK6C                     ENDDO
TCHK6C*
TCHK6C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C           W@SHFT    IFEQ 1
     C                     MOVELCMD,4     D@CMD
     C                     ELSE
     C                     MOVELCMD,5     D@CMD
     C                     END
     C*
     C                     WRITEDSP99
     C                     WRITEDSP98
     C*
     C                     Z-ADDW@RCNO    #RCNO
     C*
     C           RRN0      IFNE 0
     C                     MOVE *ON       *IN56            SFLDSP
     C                     ENDIF
     C                     MOVE *ON       *IN53
     C                     SETOF                     88
     C                     EXFMTCTL00
     C                     MOVE *OFF      *IN53
     C                     MOVE *OFF      *IN56
      *
      * F4: 2ND LINE
TCHK5C  NKD                MOVELN#MOD1    *IN55
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@RCNO
     C                     END
     C*
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * F3: END
JW   C           *INKC     WHEQ *ON
     C                     MOVEL'00'      W@ID
      * F7: PRV_MONTH
     C           *INKG     WHEQ *ON
     C                     MOVELD@PAR     $SHIN
 .   C                     CALL 'ABBC25P'
     C                     PARM           $SHIN  12
      * F8: PREV_3MONTH
     C           *INKH     WHEQ *ON
     C                     SUB  1         W@SHFT
     C           W@SHFT    IFLE *ZERO
     C                     Z-ADD1         W@SHFT
     C                     END
     C                     EXSR @SHFT@
      * F9: NEXT_3MONTH
     C           *INKI     WHEQ *ON
     C                     ADD  1         W@SHFT
     C           W@SHFT    IFGT 3
     C                     Z-ADD3         W@SHFT
     C                     END
     C                     EXSR @SHFT@
      * F10: M.VOL_HIST
TCHK2C           *INKJ     WHEQ *ON
TCHK2C                     CALL 'AKAR35'
TCHK2C                     PARM           D@PRT1
TCHK2C                     PARM           D@PRT2
TCHK2C                     PARM           D@PRT3
      * F12: BACK
     C           *INKL     WHEQ *ON
TCHK3C           PMSHIN    IFEQ *BLANK
     C                     MOVEL'00'      W@ID
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD1         W@SHFT
TCHK3C                     ELSE
TCHK3C                     MOVEL'99'      W@ID
TCHK3C                     END
      *ENTR
     C                     OTHER
     C           RRN0      IFGE 1
     C                     EXSR #CHK1
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
     C           @SHFT@    BEGSR
     C*
     C                     Z-ADD*ZERO     Z       40
     C                     Z-ADD*ZERO     D@MQT1
     C                     Z-ADD*ZERO     D@MQT2
     C                     Z-ADD*ZERO     D@MQT3
     C                     SELEC
     C           W@SHFT    WHEQ 1
     C                     MOVELD@M,1     D@MON1
     C                     MOVELD@M,2     D@MON2
     C                     MOVELD@M,3     D@MON3
TCHK6C                     MOVELYM,1      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD1
TCHK6C                     MOVELYM,2      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD2
TCHK6C                     MOVELYM,3      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD3
     C           W@SHFT    WHEQ 2
     C                     MOVELD@M,4     D@MON1
     C                     MOVELD@M,5     D@MON2
     C                     MOVELD@M,6     D@MON3
TCHK6C                     MOVELYM,4      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD1
TCHK6C                     MOVELYM,5      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD2
TCHK6C                     MOVELYM,6      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD3
     C           W@SHFT    WHEQ 3
     C                     MOVELD@M,7     D@MON1
     C                     MOVELD@M,8     D@MON2
     C                     MOVELD@M,9     D@MON3
TCHK6C                     MOVELYM,7      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD1
TCHK6C                     MOVELYM,8      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD2
TCHK6C                     MOVELYM,9      @YYMM
TCHK6C                     EXSR #MONS1
TCHK6C                     Z-ADDW@DCNT    D@MMD3
     C                     ENDSL
     C*
     C                     DO   *HIVAL
     C*
     C                     ADD  1         Z
     C           Z         CHAINSFL00                90
     C   90                LEAVE
     C*
     C                     SELEC
     C           W@SHFT    WHEQ 1
     C                     Z-ADDH@MQT1    S@MQT1
     C                     Z-ADDH@MQT2    S@MQT2
     C                     Z-ADDH@MQT3    S@MQT3
     C           W@SHFT    WHEQ 2
     C                     Z-ADDH@MQT4    S@MQT1
     C                     Z-ADDH@MQT5    S@MQT2
     C                     Z-ADDH@MQT6    S@MQT3
     C           W@SHFT    WHEQ 3
     C                     Z-ADDH@MQT7    S@MQT1
     C                     Z-ADDH@MQT8    S@MQT2
     C                     Z-ADDH@MQT9    S@MQT3
     C                     ENDSL
     C                     ADD  S@MQT1    D@MQT1
     C                     ADD  S@MQT2    D@MQT2
     C                     ADD  S@MQT3    D@MQT3
     C                     UPDATSFL00
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     Z       40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         Z
     C           Z         CHAINSFL00                90
     C           *IN90     IFEQ *OFF
     C           S@SLCT    IFNE *BLANK
     C                     MOVE *BLANK    S@SLCT
     C                     MOVE S@MPAR    D@MPAR
     C                     UPDATSFL00
      * NOT FORD
     C                     MOVE *BLANK    @FORD   1
     C                     MOVE S@NONY    @@NONY  4
JW2  C                     MOVE S@TOKU    D@TOKU
     C                     MOVE S@NONY    D@NONY
     C                     MOVE S@NUKE    D@DOCK
     C                     MOVE S@NKOJ    D@FACT
TCHK5C                     MOVELS@NONM    D@NONM
     C           @YYMM     MULT 100       @YMD    80
     C                     ADD  1         @YMD
     C           @@NONY    CHAINABF9L01              91
      * FORD
     C           *IN91     IFEQ *OFF
     C                     MOVE '1'       @FORD   1
     C                     ENDIF
      *
     C           @FORD     IFEQ *BLANK
     C                     EXSR #SET1
     C                     ELSE
      * FORD
     C                     EXSR #SFRD
     C                     ENDIF
      *
     C           RRN1      IFEQ *ZERO
     C                     MOVELERR,2     D@MSG     P
     C                     ELSE
     C                     MOVE '02'      W@ID
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #SET1     BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     @D      20
     C                     MOVE S@MPR1    K@MHN1
     C                     MOVE S@MPR2    K@MHN2
     C                     MOVE S@MPR3    K@MHN3
     C                     MOVE H@MPR4    K@MHN4
     C                     MOVE S@NONY    K@NONY
     C                     MOVE S@NKOJ    K@NKOJ
     C                     MOVE S@NUKE    K@NUKE
%0001C                     MOVELS@SEBN    C@SEBN  4
      * RECEIVED DATE
     C                     Z-ADD*DATE     K@RCDT
      *
     C                     Z-ADD1         @PAGE   20
     C                     Z-ADD*ZERO     XXRRN1  40
     C                     EXSR #SET12
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #SET12    BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     DT1
     C                     Z-ADD*ZERO     DTE
     C                     Z-ADD99999999  DT2
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     Y       30
     C                     Z-ADD*ZERO     @PDAT   80
     C                     MOVEA'0000000' *IN,81
      *
     C           K#KEY     SETGTABBPL51
     C           *IN90     DOUEQ*ON
     C           K#KEYX    REDPEABBPL51                  90
     C           *IN90     IFEQ *OFF
%0001C**
     C           C@SEBN    IFNE BBSEBN
JW   C           BBFLG1    OREQ 'D'
     C                     ITER
     C                     ENDIF
     C**
      * RCV DATE
     C           BBRCDT    LOKUPDT1                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C           X         IFEQ 8
     C                     Z-ADDBBRCDT    @PDAT   80
     C                     LEAVE
     C                     ENDIF
     C           X         IFEQ 1
     C           BBRCDT    LOKUPDAT                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         @D
     C                     Z-ADDBBRCDT    DAT,@D
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDBBRCDT    DT1,X
     C                     Z-ADDBBRCDT    DTE,X
     C                     ENDIF
      * SHP DATE
     C           BBSDAT    LOKUPDT2                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Y
     C           Y         IFLE 100
     C                     Z-ADDBBSDAT    DT2,Y
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     SORTADT2
      *
     C           1         DO   99        Y
     C           DT2,Y     IFEQ 99999999
     C                     LEAVE
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     Z-ADDDT2,Y     S@DATE
     C                     Z-ADDDT2,Y     H@DATE
     C           H@DATE    IFLE *DATE
     C                     Z-ADDRRN1      XXRRN1  40
     C                     ENDIF
     C                     WRITESFL01
     C                     ENDDO
      *
     C           1         DO   7         X
     C           DT1,X     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDDT1,X     K@RCDT
     C           K#KEY     SETLLABBPL51
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEABBPL51                  90
     C           *IN90     IFEQ *OFF
JW   C           BBFLG1    ANDEQ' '
      *
     C                     Z-ADD1         Y
     C           BBSDAT    LOKUPDT2,Y                    10
     C           *IN10     IFEQ *ON
     C           Y         ANDLE99
     C           Y         CHAINSFL01                90
      *
     C                     Z-ADD80        X8      20
     C           BBBFLG    IFEQ '1'
     C                     ADD  X         X8
     C                     MOVEA'1'       *IN,X8
     C  N88                SETON                     88
     C                     ENDIF
      *
     C                     Z-ADD80        X8      20
     C           BBBFLG    IFNE '1'
     C                     ADD  X         X8
     C                     MOVEA'0'       *IN,X8
     C                     ENDIF
      *
     C                     ADD  BBSQTY    QTY,X
      *
     C                     UPDATSFL01
     C                     MOVEA'0'       *IN,X8
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     Z-ADDXXRRN1    W@RCN1  40
     C           W@RCN1    IFEQ *ZERO
     C                     ADD  1         W@RCN1
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #PRV      BEGSR
      *------------------------------------------------------
     C                     ADD  1         @PAGE
     C                     Z-ADD@PDAT     K@RCDT
     C                     EXSR #SET12
     C           RRN1      IFEQ *ZERO
     C                     EXSR #NXT
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #NXT      BEGSR
      *------------------------------------------------------
     C                     SUB  1         @PAGE
     C           @PAGE     IFEQ *ZERO
     C                     Z-ADD1         @PAGE
     C                     ELSE
     C                     Z-ADD@PAGE     X
     C                     Z-ADDDAT,X     K@RCDT
     C                     EXSR #SET12
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #SFRD     BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     @D      20
     C                     Z-ADD*DATE     K@ISDT
      *
     C                     Z-ADD1         @PAGE   20
     C                     EXSR #SFRD2
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #SFRD2    BEGSR
      *------------------------------------------------------
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     MOVELD@MPAR    K@PART
     C                     Z-ADD*ZERO     @PDAT
      * RECEIVED DATE
     C                     Z-ADD*ZERO     DT1
     C                     Z-ADD*ZERO     DTE
     C                     Z-ADD99999999  DT2
     C                     Z-ADD*ZERO     X       30
     C                     Z-ADD*ZERO     Y       30
14   C           K#F14     SETGTABFPL14
     C           *IN90     DOUEQ*ON
     C           K#F14X    REDPEABFPL14                  90
     C           *IN90     IFEQ *OFF
     C*          FBQTCD    ANDEQ'W'
     C           FBQTCD    IFEQ 'M'
     C           FBSIDT    IFEQ H@ISDT
     C                     ELSE
     C                     ITER
     C                     END
     C                     END
      * SHP DATE
     C           FBCEDT    ADD  20000000  W@DT8   80
     C****       W@DT8     IFGE @YMD
      *
     C           W@DT8     LOKUPDT2                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         Y
     C           Y         IFLE 99
     C                     Z-ADDW@DT8     DT2,Y
     C                     ENDIF
     C                     ENDIF
     C***                  ENDIF
      * RCV DATE
     C           FBSIDT    ADD  20000000  W@DT8   80
     C           W@DT8     LOKUPDT1                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C           X         IFEQ 8
     C                     Z-ADDW@DT8     @PDAT   80
     C                     LEAVE
     C                     ENDIF
     C           X         IFEQ 1
     C           W@DT8     LOKUPDAT                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         @D
     C                     Z-ADDW@DT8     DAT,@D
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDW@DT8     DT1,X
     C                     Z-ADDW@DT8     DTE,X
     C                     Z-ADDW@DT8     @PDAT   80
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     SORTADT2
      *
     C           1         DO   99        Y
     C           DT2,Y     IFEQ 99999999
     C                     LEAVE
     C                     ENDIF
      *
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     Z-ADDDT2,Y     S@DATE
     C                     Z-ADDDT2,Y     H@DATE
     C           H@DATE    IFLE *DATE
     C                     Z-ADDRRN1      XXRRN1  40
     C                     ENDIF
     C                     WRITESFL01
     C                     ENDDO
      *
     C           1         DO   99        X
     C           DT2,X     IFEQ 99999999
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDDT2,X     K@CEDT
     C           K#FD1X    SETLLABFPL16
     C           *IN90     DOUEQ*ON
     C           K#FD1X    READEABFPL16                  90
     C           *IN90     IFEQ *OFF
      *
     C           FBQTCD    IFEQ 'M'
     C           FBSIDT    IFEQ H@ISDT
     C                     ELSE
     C                     ITER
     C                     END
     C                     END
      *
      *  if the delivery code doesn't match, ignore and read next.
     C           FBNONY    IFNE D@NONY
     C           FBNONY    ANDNE*ZERO
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADD1         Y
     C           FBSIDT    ADD  20000000  W@DT8   80
     C           W@DT8     LOKUPDT1,Y                    10
     C           *IN10     IFEQ *ON
     C           X         CHAINSFL01                90
     C                     Z-ADDFBQTY2    QTY,Y
      *
     C**JW4      FBQTCD    IFEQ 'M'
     C**                   MOVEL'M'       S@MFST
     C**                   ELSE
     C**                   MOVEL*BLANK    S@MFST
     C**                   END
      *
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDDO
     C*                    Z-ADDXXRRN1    #RCNO1
     C*          #RCNO1    IFEQ *ZERO
     C*                    ADD  1         #RCNO1
     C*                    ENDIF
     C                     Z-ADDXXRRN1    W@RCN1
     C           W@RCN1    IFEQ *ZERO
     C                     ADD  1         W@RCN1
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #FPRV     BEGSR
      *------------------------------------------------------
     C                     ADD  1         @PAGE
     C                     Z-ADD@PDAT     K@ISDT
     C                     EXSR #SFRD2
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #FNXT     BEGSR
      *------------------------------------------------------
     C                     SUB  1         @PAGE
     C           @PAGE     IFEQ *ZERO
     C                     Z-ADD1         @PAGE
     C                     ELSE
     C                     Z-ADD@PAGE     X
     C                     Z-ADDDAT,X     K@ISDT
     C                     EXSR #SFRD2
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C           @PAGE     IFEQ 1
     C                     MOVE CMD,2     D@CMD
     C                     ELSE
     C                     MOVE CMD,3     D@CMD
     C                     ENDIF
JW1   * CHECK SHIPPING MASTER ------------------
 .   C           K#GA11    KLIST
 .   C                     KFLD           K#TOKU  40
 .   C                     KFLD           K#NONY  40
 .   C                     MOVE *BLANK    D@MSG2
 .   C                     Z-ADDD@TOKU    K#TOKU
 .   C                     Z-ADDD@NONY    K#NONY
 .   C           K#GA11    SETLLGADPL11
 .   C                     DO   *HIVAL
 .   C           K#GA11    READEGADPL11                  98
 .   C   98                LEAVE
 .    *
 .   C           B5SKJY    IFEQ 'D'
 .   C                     ITER
 .   C                     ENDIF
 .    * FACTORY
 .   C           D@FACT    IFNE ' '
 .   C           D@FACT    ANDNE'0'
 .   C           B5NKOJ    ANDNE' '
 .   C           B5NKOJ    ANDNE'0'
 .   C           B5NKOJ    ANDNED@FACT
 .   C                     ITER
 .   C                     ENDIF
 .    * DOCK
 .   C           D@DOCK    IFNE ' '
 .   C           D@DOCK    ANDNE'0'
 .   C           D@DOCK    ANDNE'00'
 .   C           B5NUKE    ANDNE' '
 .   C           B5NUKE    ANDNE'0'
 .   C           B5NUKE    ANDNE'00'
 .   C           B5NUKE    ANDNED@DOCK
 .   C                     ITER
 .   C                     ENDIF
 .    *
 .   C                     LEAVE
 .   C                     ENDDO
 .    *
 .   C           *IN98     IFEQ *ON
 .   C                     MOVELERR,3     D@MSG2
JW1  C                     ENDIF
      * ----------------------------------------
     C                     Z-ADDW@RCN1    #RCNO1
     C*
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C*                    Z-ADD@@REC     #RCNO1
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@RCN1
     C                     END
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
%04  C           P@MPAR    IFNE *BLANK
  |  C                     MOVEL'99'      W@ID
%04  C                     ENDIF
     C           *INKH     WHEQ *ON
     C           @PAGE     ANDNE1
     C           @FORD     IFEQ *BLANK
     C                     EXSR #NXT
     C                     ELSE
     C                     EXSR #FNXT
     C                     ENDIF
     C           *INKI     WHEQ *ON
     C           @FORD     IFEQ *BLANK
     C                     EXSR #PRV
     C                     ELSE
     C                     EXSR #FPRV
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
** CMD
F1:END                   F7: FROM PREVIOUS MONTH
F1:END    F12:GO BACK    F9:PREV->    PAGE UP/DWN
F1:END    F12:GO BACK    F8:<-NEXT    F9:PREV->    PAGE UP/DWN
F1:END  F9:NEXT_3MONTH  F10:M.VOL_HIST  F12:GO_BACK  F4:DISP_NAME  F7:PRV_FC
F1:END  F8:PREV_3MONTH  F9:NEXT_3MONTH  F10:M.VOL_HIST  F12:GOBACK  F4:NAME
** ERR
 NO DATA!!
 NO EDI DETAIL RECORDS!
!! SET UP SHIPPING MASTER ASAP !!
** MON
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
