     H            Y.                                    1
     F** ABBR24 ********************************
     F* .. SETTING NUMBER ABNORMALITY INCREASE AND DECREASE CHECK LIST.. *
     F* I-HASADA                   94.10.13    *
     F******************************** ABBR24 **
     FABBWP24 IP  F     100            DISK
     FABBNP09 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1   1 44               ﾒﾇnvjﾞﾆ
     E                    TK1     1   3  1   TK2    40   hﾎﾞ]xb
     IABBWP24 AA  01
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I                                       13  171IPASG
     I                                       18  221IPAS1
     I                                       23  271IPAS2
     I                                       28  321IPAS3
     I            DS
     I                                        1  12 ABSHIN
     I                                        1   5 ABSHN1
     I                                        6  10 ABSHN2
     I                                       11  12 ABSHN3
     I            DS
     I                                        1  10 ABMH12
     I                                        1   5 ABMHN1
     I                                        6  10 ABMHN2
     I            DS
     I                                        1   80WHZ1
     I                                        5   80WMD1
     I            DS
     I                                        1   80WHZ2
     I                                        5   80WMD2
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PKBN    1
     C                     PARM           PHIZ    6
     C                     PARM           PHZ1    8
     C                     PARM           PHZ2    8
     C                     PARM           PMM1    2
     C                     PARM           PMM2    2
     C                     PARM           PMM3    2
     C                     PARM           PCD1    3
     C                     PARM           PCD2    3
     C                     PARM           PCD3    3
     C                     PARM           PCD4    3
      *
     C           *IN10     IFEQ '0'
     C                     SETON                     10
      *
     C                     MOVE PHIZ      WHIZ    60
     C                     MOVE PHZ1      WHZ1
     C                     MOVE PHZ2      WHZ2
     C                     MOVE PMM1      WMM1    20
     C                     MOVE PMM2      WMM2    20
     C                     MOVE PMM3      WMM3    20
     C                     MOVE PCD1      WCD1    31
     C                     MOVE PCD2      WCD2    31
     C                     MOVE PCD3      WCD3    31
     C                     MOVE PCD4      WCD4    31
      *
     C                     TIME           WTIME   60
      *
     C                     SETOF                     12
     C                     Z-ADD1         A       10
     C                     MOVE *BLANK    WKBNM  40
     C           PKBN      LOKUPTK1,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVE TK2,A     WKBNM
     C                     END
      *
     C                     EXCPTMSH
      *
     C                     END
      *
     C                     Z-ADD0         TJISU   80
     C                     Z-ADD0         TN0SU   80
     C                     Z-ADD0         TNNSU   80
     C                     Z-ADD0         TN1SU   80
     C                     Z-ADD0         TN2SU   80
      *
     C*--------------------------------------*
     C*  ..設定数チェックリスト　データ..  *
     C*--------------------------------------*
     C           KEY1      SETLLABBNP091
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEABBNP091                 11
     C           *IN11     IFEQ '0'
      *
     C           ABDTKB    IFEQ 'T'
      *
     C                     SETOF                     020304
     C                     SETOF                     050607
      *
     C           ABTKR2    COMP *BLANK               0202
     C           ABTKR3    COMP *BLANK               0303
     C           ABTKR4    COMP *BLANK               0404
      *
     C                     Z-ADD0         WZPS1   51
     C                     Z-ADD0         WZPS2   51
     C                     Z-ADD0         WZPS3   51
      *
     C           PKBN      IFEQ '3'
     C                     SETON                     05
     C                     Z-ADDIPASG     WZPS1
     C                     ELSE
      *
     C                     Z-ADDIPAS1     WZPS1
     C                     Z-ADDIPAS2     WZPS2
     C                     Z-ADDIPAS3     WZPS3
      *
     C           PKBN      IFEQ '1'
     C           WZPS1     COMP 130                  05  05
     C           WZPS2     COMP 130                  06  06
     C           WZPS3     COMP 130                  07  07
     C                     ELSE
      *
     C           WZPS1     COMP 50                     0505
     C           WZPS2     COMP 50                     0606
     C           WZPS3     COMP 50                     0707
     C                     END
     C                     END
      *
     C                     EXCPTMST
     C                     ELSE
      *
     C                     ADD  ABJISU    TJISU
     C                     ADD  ABN0SU    TN0SU
     C                     ADD  ABNNSU    TNNSU
     C                     ADD  ABN1SU    TN1SU
     C                     ADD  ABN2SU    TN2SU
      *
     C                     SETOF                     20
     C           ABSHIN    IFNE WSHIN
     C                     SETON                     20
     C                     MOVE ABSHIN    WSHIN  12
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     SETON                     20
     C                     EXCPTMSH
     C                     END
      *
     C                     SETOF                     212223
     C           ABSHIN    COMP ABMH12               2121
     C           ABSHN3    COMP *BLANK               2222
     C           ABMHN3    COMP *BLANK               2323
      *
     C                     EXCPTMSD
      *
     C                     END
     C                     END
     C  N11                END
      *
     OQPRINT  E  102           MSH
     O                                  131 '+-------------------+'
     O        E  1             MSH
     O                         WKBNM     41
     O                                  131 '|         |         |'
     O        E  1             MSH
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '|         |         |'
     O        E  2             MSH
     O                                   10 'ABBR24-1'
     O                         WHIZ      19 '    .  '
     O                                   25 'MONTH'
     O                         TB1,1     78
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  1             MSH
     O                         WCD1  3   67
     O                                   71 'DAY'
     O                         WCD1  3   79
     O                                   83 'DAY'
     O                         WCD2  3   92
     O                                   96 'DAY'
     O                         WCD3  3  104
     O                                  108 'DAY'
     O                         WCD4  3  116
     O                                  120 'DAY'
     O        E  1             MSH
     O                         WMD1  Y   67
     O                                   70 '-'
     O                         WMD1  Y   79
     O                                   82 '-'
     O                         WMM1  Z   92
     O                                   98 'MONTH'
     O                         WMM2  Z  104
     O                                  110 'MONTH'
     O                         WMM3  Z  116
     O                                  122 'MONTH'
     O        E  2             MSH
     O                                   13 'INT CO. P/N'
     O                                   25 'USER P/N'
     O                                   42 'CUSTOMER NAME'
     O                                   50 'RCV CO.'
     O                                   55 'F'
     O                                   59 'RCV'
     O                         WMD2  Y   67
     O                                   73 'RESULT'
     O                         WMD2  Y   79
     O                                   85 'DEMAND'
     O                                   94 'EXPECT'
     O                                  106 'EXPECT'
     O                                  118 'EXPECT'
     O                                  130 'SET/DAY'
     O        E  1             MSD
     O                 20      ABJDKB     1
     O                 20      ABSHN1     7
     O                 20                 8 '-'
     O                 20      ABSHN2    13
     O                 20 22             14 '-'
     O                 20      ABSHN3    16
     O                 21      ABMHN1    22
     O                 21                23 '-'
     O                 21      ABMHN2    28
     O                 21 23             29 '-'
     O                 21      ABMHN3    31
     O                         ABSHKB    32
     O                         ABTKNM    42
     O                         ABNONM    53
     O                         ABNKOJ    55
     O                         ABNUKE    60
     O                         ABJISU1   71
     O                         ABN0KB    74
     O                         ABN0SU1   83
     O                         ABNNKB    86
     O                         ABNNSU1   95
     O                         ABN1KB    98
     O                         ABN1SU1  107
     O                         ABN2KB   110
     O                         ABN2SU1  119
     O        E  1             MST
     O                                   58 '** P/N TOTAL'
     O                         TJISU     71 '  ,   , * '
     O                         TN0SU     83 '  ,   , * '
     O                         TNNSU     95 '  ,   , * '
     O                         TN1SU    107 '  ,   , * '
     O                         TN2SU    119 '  ,   , * '
     O                         ABGEKH1  130
     O                         ABGEKB   131
     O                         ABGEHN   132
     O        E  1             MST
     O                                   13 'LOCATION'
     O                         ABTKR1    15
     O                 02                16 '-'
     O                         ABTKR2    18
     O                 03                19 '-'
     O                         ABTKR3    21
     O                 04                22 '-'
     O                         ABTKR4    23
     O                                   33 'ACCOM QTY'
     O                         ABSYOS1   40
     O                                   41 '-'
     O                         ABSYOT    42
     O                                   58 '** +/- RATIO'
     O                         ABJIPS3   67
     O                                   68 '%'
     O                         ABJICM    72
     O                         ABN0PS3   79
     O                                   80 '%'
     O                         ABN0CM    84
     O                         ABNNPS3   91
     O                                   92 '%'
     O                         ABNNCM    96
     O                         ABN1PS3  103
     O                                  104 '%'
     O                         ABN1CM   108
     O                         ABN2PS3  115
     O                                  116 '%'
     O                         ABN2CM   120
     O        E  3             MST
     O                 05      WZPS1 3   91
     O                 05                92 '%'
     O                 06      WZPS2 3  103
     O                 06               104 '%'
     O                 07      WZPS3 3  115
     O                 07               116 '%'
      *
** TB1
* ABNORMAL INCREASE & DECREASE CHECK LIST *
** TK1.TK2
1N - N+2 DEMAND FORECAST NBR  + OVER 30%                               +2 MONTH
2N - N+2 DEMAND FORECAST NBR  - UNDER 50%                              +2 MONTH
3N MONTH RESULT NBR           + OVER 50%
