     H            Y.                                    1
     H***ABBR9A1 ***************************************************************
     H* FLAG INVENTORY DATA AUTO DELETE & CREATE ACCUMULATE                    *
     H*                                                                        *
     H* RUN AS FLG@INVT  BY WRKJOBSCDE AT 12:00:02 EVERY NOON                  *
     H* RUN AS FLG@INVT2 BY WRKJOBSCDE AT 00:00:02 EVERY NIGHT                 *
     H*                                                                        *
     H* TCHK1 11/09/09 CREATE
     H**************************************************************************
     FABBPP9A UF  E           K        DISK
     FABBPP9B O   E                    DISK
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C*
     C                     EXSR #MAIN
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     ENDSR
     C*************************************************************************
     C*          MAIN
     C**************************************************************************
     C           #MAIN     BEGSR
     C*
     C           *LOVAL    SETLLABBPP9A
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ABBPP9A                  99
     C   99                LEAVE
     C*
     C                     WRITEABBPP9BR
     C                     DELETABBPP9AR
     C*
     C                     ENDDO
     C*
     C                     ENDSR
