     H            Y/
     F**************************************************************************
     F*  SHIPMENT HISTORY & FORECAST AVERAGE(EXCLUDE FORD                      *
     F*                                                                        *
     F*------------------------------------------------------------------------*
     F* 2016/01/15 | JW (SRA)    | JW1 | CHG THE WAY CALCULATE HIGH FCST       *
     F* 2016/01/20 | JW (SRA)    | JW2 | ADD 2 NEW FIELDS IN ABBWP69           *
     F* 2022/08/31 | JW (SRA)    | JW3 | FIX BUG (NUMERIC CONVERSION)          *
     F**************************************************************************
     FABBWP68 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FFCEPL40 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FGDKPL03 IF  E           K        DISK
     FABBWP69 IF  E                    DISK                      A    UC
     FABBWP6A O   E                    DISK
      *------------------------------------------------------------
     E                    TT#     1  52  3   TTL    30
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
JW1  I            DS
     I                                        1  12 @D1
     I                                        1  10 @D1A
     I                                       11  11 @D1C
     I                                       12  120@D1B
JW1  I            DS
     I                                        1  13 @D2
     I                                        1  10 @D2A
     I                                       11  11 @D2C
     I                                       12  130@D2B
     I            DS
     I                                        1   60W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I            DS
     I                                        1  12 W@SHIN
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     OPEN ABBWP69
      *
     C           *LOVAL    SETLLABBWP68
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ABBWP68                  98
     C   98                LEAVE
     C*
     C           T6NNNM    DIV  W@1CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        W@DIF3 112H
     C           W@DIF3    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    T6NDF1    H
      *
     C           T61NNM    DIV  W@2CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        W@DIF3 112H
     C           W@DIF3    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    T61DF1    H
      *
     C           T62NNM    DIV  W@3CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        W@DIF3 112H
     C           W@DIF3    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    T62DF1    H
     C*
     C                     MOVEL*BLANK    T6MRK2
     C           T6SHP1    IFGT *ZERO
     C           T6SHP2    ORGT *ZERO
     C           T6SHP3    ORGT *ZERO
     C           T6SHP4    ORGT *ZERO
     C           T6SHP5    ORGT *ZERO
     C           T6SHP6    ORGT *ZERO
     C           T6MRKA    IFNE *BLANK
     C                     MOVEL'*'       T6MRK2
     C                     END
     C           T6MRKA    IFEQ *BLANK
     C           T6MRKB    ANDNE*BLANK
     C           T6MRKC    ANDEQ*BLANK
     C                     MOVEL'*'       T6MRK2
     C                     END
     C                     END
     C*
     C                     Z-ADD*ZERO     TFFQ01
     C                     Z-ADD*ZERO     TFFQ02
     C                     Z-ADD*ZERO     TFFQ03
     C                     Z-ADD*ZERO     TFSQ0A
     C                     Z-ADD*ZERO     TFSQ01
     C                     Z-ADD*ZERO     TFSQ02
     C                     Z-ADD*ZERO     TFSQ03
     C                     Z-ADD*ZERO     TFFF01
     C                     Z-ADD*ZERO     TFDF01
     C                     Z-ADD*ZERO     TFFF02
     C                     Z-ADD*ZERO     TFDF02
     C                     Z-ADD*ZERO     TFFF03
     C                     Z-ADD*ZERO     TFDF03
     C*
     C           T6FQ01    DIV  W@1CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        TFFQ01    H
     C                     ADD  TFFQ01    TFFF01
     C           T6FQ02    DIV  W@2CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        TFFQ02    H
     C                     ADD  TFFQ02    TFFF02
     C           T6FQ03    DIV  W@3CNT    W@DIF2 123H
     C           W@DIF2    MULT 20        TFFQ03    H
     C                     ADD  TFFQ03    TFFF03
     C*
     C           T6SQ01    DIV  W@PMD1    W@DIF2 123H
     C           W@DIF2    MULT 20        TFSQ01    H
     C           T6SQ02    DIV  W@PMD2    W@DIF2 123H
     C           W@DIF2    MULT 20        TFSQ02    H
     C           T6SQ03    DIV  W@PMD3    W@DIF2 123H
     C           W@DIF2    MULT 20        TFSQ03    H
     C*
     C           TFSQ01    IFGT TFSQ0A
     C                     Z-ADDTFSQ01    TFSQ0A
     C                     END
     C           TFSQ02    IFGT TFSQ0A
     C                     Z-ADDTFSQ02    TFSQ0A
     C                     END
     C           TFSQ03    IFGT TFSQ0A
     C                     Z-ADDTFSQ03    TFSQ0A
     C                     END
     C*
     C                     ADD  TFSQ0A    TFFF01
     C                     ADD  TFSQ0A    TFFF02
     C                     ADD  TFSQ0A    TFFF03
     C*
     C           TFFF01    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    TFDF01    H
     C           TFFF02    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    TFDF02    H
     C           TFFF03    SUB  T6SETQ    W@DIF4 112
     C           W@DIF4    DIV  20        W@DIF5 112H
     C           W@DIF5    DIV  T6BOXQ    TFDF03    H
     C*
     C                     MOVEL*BLANK    T6PTYP
     C*
     C           K#FCEA    KLIST
     C                     KFLD           T6SHN1
     C                     KFLD           T6SHN2
     C                     KFLD           T6SHN3
     C* PASS THROUGH
     C           K#FCEA    SETLLAAPTL01
     C           *IN96     DOUEQ*ON
     C           K#FCEA    READEAAPTL01                  96
     C           *IN96     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STYY    ANDEQ9999
     C                     MOVEL'PT '     T6PTYP
     C                     LEAVE
     C                     END
     C                     ENDDO
     C* HALF FINISHED
     C           *IN96     IFEQ *ON
     C           K#FCEA    SETLLFCEPL40
     C           *IN96     DOUEQ*ON
     C           K#FCEA    READEFCEPL40                  96
     C           *IN96     IFEQ *OFF
     C           F4GSKD    ANDEQ*BLANK
     C           K#L40     KLIST
     C                     KFLD           F4HPR1
     C                     KFLD           F4HPR2
     C                     KFLD           F4HPR3
     C           K#L40     SETGTAANPL06
     C                     DO   *HIVAL
     C           K#L40     REDPEAANPL06                  94
     C   94                LEAVE
     C           L7SKJY    IFEQ *BLANK
     C           L7STYY    ANDEQ9999
     C                     MOVEL'BPT'     T6PTYP
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     LEAVE
     C                     END
     C                     ENDDO
     C                     END
     C*
     C                     MOVEL*BLANK    T6PRDT
     C           T6PTYP    IFNE *BLANK
     C           T6PTYP    IFEQ 'PT '
     C                     MOVELT6SHN1    W@SHN1
     C                     MOVELT6SHN2    W@SHN2
     C                     MOVELT6SHN3    W@SHN3
     C                     ELSE
     C                     MOVELF4HPR1    W@SHN1
     C                     MOVELF4HPR2    W@SHN2
     C                     MOVELF4HPR3    W@SHN3
     C                     END
     C                     MOVELW@SHIN    K@SHIN 20 P
     C           K@SHIN    SETGTGDKPL03
     C                     DO   *HIVAL
     C           K@SHIN    REDPEGDKPL03                  95
     C   95                LEAVE
     C           ISSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C                     MOVELISENHZ    T6PRDT
     C                     LEAVE
     C                     ENDDO
     C                     END
     C*
     C                     Z-ADD*ZERO     T6HIFQ
     C           T6NNNM    DIV  W@1CNT    W#FCST 123H
     C           W#FCST    MULT 20        W@FCST 112H
     C           W@FCST    IFGT T6HIFQ
     C                     Z-ADDW@FCST    T6HIFQ
     C                     Z-ADDT6NDF1    T6HIDF
     C                     END
     C           T61NNM    DIV  W@2CNT    W#FCST    H
     C           W#FCST    MULT 20        W@FCST    H
     C           W@FCST    IFGT T6HIFQ
     C                     Z-ADDW@FCST    T6HIFQ
     C                     Z-ADDT61DF1    T6HIDF
     C                     END
     C           T62NNM    DIV  W@3CNT    W#FCST    H
     C           W#FCST    MULT 20        W@FCST    H
     C           W@FCST    IFGT T6HIFQ
     C                     Z-ADDW@FCST    T6HIFQ
     C                     Z-ADDT62DF1    T6HIDF
     C                     END
     C**JW1      TFFF01    IFGT T6HIFQ
     C**                   Z-ADDTFFF01    T6HIFQ
     C**                   Z-ADDTFDF01    T6HIDF
     C**                   END
     C**         TFFF02    IFGT T6HIFQ
     C**                   Z-ADDTFFF02    T6HIFQ
     C**                   Z-ADDTFDF02    T6HIDF
     C**                   END
     C**         TFFF03    IFGT T6HIFQ
     C**                   Z-ADDTFFF03    T6HIFQ
     C**                   Z-ADDTFDF03    T6HIDF
     C**                   END
JW2  C* BOX/DAY (T6BOXD)
JW2  C           T6SETQ    DIV  20        T6BOXD    H
JW2  C           T6BOXQ    IFNE 0
JW2  C           T6BOXD    DIV  T6BOXQ    T6BOXD    H
JW2  C                     ENDIF
JW2  C           T6BOXD    IFEQ 0
JW2  C                     Z-ADD0.1       T6BOXD
JW2  C                     ENDIF
JW2  C* RATIO   (T6RATI)
JW2  C           T6HIFQ    MULT 100       NUM11  110H
JW2  C           T6SETQ    IFEQ 0
JW2  C                     Z-ADD0         T6RATI
JW2  C                     ELSE
JW2  C           NUM11     DIV  T6SETQ    T6RATI    H
JW2  C                     ENDIF
JW2  C*
     C                     WRITEABBWP69R
     C*
     C                     ENDDO
      *
JW2  C                     CLOSEABBWP69
JW2  C                     EXSR #HDR1
JW2  C                     EXSR #HDR2
JW2  C                     EXSR #DTL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  HEADER1
      *------------------------------------------------------
     C           #HDR1     BEGSR
      *
     C                     CLEARABBWP6AR
     C           'AS OF '  CAT  @DATE8    LINE1  14
     C                     MOVELLINE1     X6SHIN
     C                     WRITEABBWP6AR
      *DUMMY FOR COMPILE 20L
     C                     MOVELTT#,01    JW      1
      *
     C                     ENDSR
      *------------------------------------------------------
      *  HEADER2
      *------------------------------------------------------
     C           #HDR2     BEGSR
      *
     C                     CLEARABBWP6AR
     C                     MOVELTTL,01    X6SHIN
     C                     MOVELTTL,02    X6MRK2
     C                     MOVELTTL,03    X6PTYP
     C                     MOVELTTL,04    X6PRDT
     C                     MOVELTTL,05    X6ZANM
     C                     MOVELTTL,06    X6KAZI                  X6SETQ
     C                     MOVELTTL,07    X6SOZI
     C                     MOVELTTL,08    X6LOC
     C                     MOVELTTL,09    X6SYHZ
     C                     MOVELTTL,10    X6BOXD
     C                     MOVELTTL,11    X6SETQ
     C                     MOVELTTL,12    X6HIFQ
     C                     MOVELTTL,13    X6HIDF
     C                     MOVELTTL,14    X6RATI
     C                     MOVELTTL,15    X6BOXQ
     C                     MOVELTTL,16    X6NNNM
     C                     MOVELTTL,17    X6NDF1
     C                     MOVELTTL,18    X61NNM
     C                     MOVELTTL,19    X61DF1
     C                     MOVELTTL,20    X62NNM
     C                     MOVELTTL,21    X62DF1
     C                     MOVELTTL,22    X6SHP1
     C                     MOVELTTL,23    X6SHP2
     C                     MOVELTTL,24    X6SHP3
     C                     MOVELTTL,25    X6SHP4
     C                     MOVELTTL,26    X6SHP5
     C                     MOVELTTL,27    X6SHP6
     C                     MOVELTTL,28    XFFQ01
     C                     MOVELTTL,29    XFFQ02
     C                     MOVELTTL,30    XFFQ03
     C                     MOVELTTL,31    XFSQ0A
     C                     MOVELTTL,32    XFSQ01
     C                     MOVELTTL,33    XFSQ02
     C                     MOVELTTL,34    XFSQ03
     C                     MOVELTTL,35    XFFF01
     C                     MOVELTTL,36    XFDF01
     C                     MOVELTTL,37    XFFF02
     C                     MOVELTTL,38    XFDF02
     C                     MOVELTTL,39    XFFF03
     C                     MOVELTTL,40    XFDF03
     C                     MOVELTTL,41    X6CMP1
     C                     MOVELTTL,42    X6CMP2
     C                     MOVELTTL,43    X6CMP3
     C                     MOVELTTL,44    X6CMP4
     C                     WRITEABBWP6AR
      *
     C                     ENDSR
      *------------------------------------------------------
      *  MOVE DETAIL DATA
      *------------------------------------------------------
     C           #DTL      BEGSR
      *
     C                     MOVE *OFF      *IN91
     C                     OPEN ABBWP69
      *
     C           *IN91     DOWEQ*OFF
     C                     READ ABBWP69                  91
     C           *IN91     IFEQ *OFF
      *
     C                     CLEARABBWP6AR
     C                     MOVELT6SHIN    X6SHIN
     C                     MOVELT6MRK2    X6MRK2
     C                     MOVELT6PTYP    X6PTYP
     C                     MOVELT6PRDT    X6PRDT
     C                     MOVELT6ZANM    X6ZANM
     C                     Z-ADDT6KAZI    NUM122 122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X6KAZI
     C**                   MOVELT6SOZI    NUM122
JW3  C                     Z-ADDT6SOZI    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X6SOZI
     C                     MOVELT6LOC     X6LOC
     C                     MOVELT6SETQ    X6SETQ
     C                     MOVELT6SYHZ    X6SYHZ
     C                     Z-ADDT6BOXD    NUM111 111
     C                     EXSR #CONV1
     C                     MOVELNUMX      X6BOXD
     C                     MOVELT6HIFQ    X6HIFQ
     C                     Z-ADDT6HIDF    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X6HIDF
     C                     Z-ADDT6RATI    NUM111
     C                     EXSR #CONV1
     C                     MOVELNUMX      X6RATI
     C                     MOVELT6BOXQ    X6BOXQ
     C                     MOVELT6NNNM    X6NNNM
     C                     Z-ADDT6NDF1    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X6NDF1
     C                     MOVELT61NNM    X61NNM
     C                     Z-ADDT61DF1    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X61DF1
     C                     MOVELT62NNM    X62NNM
     C                     Z-ADDT62DF1    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      X62DF1
     C                     MOVELT6SHP1    X6SHP1
     C                     MOVELT6SHP2    X6SHP2
     C                     MOVELT6SHP3    X6SHP3
     C                     MOVELT6SHP4    X6SHP4
     C                     MOVELT6SHP5    X6SHP5
     C                     MOVELT6SHP6    X6SHP6
     C                     MOVELTFFQ01    XFFQ01
     C                     MOVELTFFQ02    XFFQ02
     C                     MOVELTFFQ03    XFFQ03
     C                     MOVELTFSQ0A    XFSQ0A
     C                     MOVELTFSQ01    XFSQ01
     C                     MOVELTFSQ02    XFSQ02
     C                     MOVELTFSQ03    XFSQ03
     C                     MOVELTFFF01    XFFF01
     C                     Z-ADDTFDF01    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      XFDF01
     C                     MOVELTFFF02    XFFF02
     C                     Z-ADDTFDF02    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      XFDF02
     C                     MOVELTFFF03    XFFF03
     C                     Z-ADDTFDF03    NUM122
     C                     EXSR #CONV2
     C                     MOVELNUMX      XFDF03
     C                     MOVELT6CMP1    X6CMP1
     C                     MOVELT6CMP2    X6CMP2
     C                     MOVELT6CMP3    X6CMP3
     C                     MOVELT6CMP4    X6CMP4
     C                     WRITEABBWP6AR
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CONVERT DECIMAL 1
      *------------------------------------------------------
     C           #CONV1    BEGSR
     C                     MOVE *BLANK    NUMX   15
     C                     MOVEL*OFF      MINUS   1
     C           NUM111    IFLT 0
     C                     MULT -1        NUM111
     C                     MOVE *ON       MINUS
     C                     ENDIF
     C                     MOVELNUM111    @D1A
     C                     MOVE NUM111    @D1B
     C                     MOVEL@D1       NUMX
      *
     C           MINUS     IFEQ *ON
     C                     MOVEL'-'       NUMX
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CONVERT DECIMAL 2
      *------------------------------------------------------
     C           #CONV2    BEGSR
     C                     MOVE *BLANK    NUMX   15
     C                     MOVEL*OFF      MINUS   1
     C           NUM122    IFLT 0
     C                     MULT -1        NUM122
     C                     MOVE *ON       MINUS
     C                     ENDIF
     C                     MOVELNUM122    @D2A
     C                     MOVE NUM122    @D2B
     C                     MOVEL@D2       NUMX
      *
     C           MINUS     IFEQ *ON
     C                     MOVEL'-'       NUMX
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           PMYYMM  6
     C                     PARM           PMD1    6
     C                     MOVELPMD1      W@YMD
     C* DECIDE MONTH
     C           PMYYMM    IFEQ *BLANK
     C                     TIME           WSDT
     C                     Z-ADDWSSMMM    K@MMMM
     C                     Z-ADDWSSYYY    K@YYYY
     C           WSSDDD    IFGE 20
     C                     ADD  1         K@MMMM
     C                     END
     C           K@MMMM    IFGT 12
     C                     ADD  1         K@YYYY
     C                     SUB  12        K@MMMM
     C                     END
     C                     ELSE
     C                     MOVELPMYYMM    K@YYYY  40
     C                     MOVE PMYYMM    K@MMMM  20
     C                     END
     C* 1ST MONTH
     C           K#AGD     KLIST
     C                     KFLD           K@YYYY
     C                     KFLD           K@MMMM
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@1CNT  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@1CNT
     C                     ITER
     C                     END
     C                     ADD  0.5       W@1CNT
     C                     ENDDO
     C* 2ND MONTH
     C                     ADD  1         K@MMMM
     C           K@MMMM    IFGT 12
     C                     ADD  1         K@YYYY
     C                     SUB  12        K@MMMM
     C                     END
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@2CNT  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@2CNT
     C                     ITER
     C                     END
     C                     ADD  0.5       W@2CNT
     C                     ENDDO
     C* 3RD MONTH
     C                     ADD  1         K@MMMM
     C           K@MMMM    IFGT 12
     C                     ADD  1         K@YYYY
     C                     SUB  12        K@MMMM
     C                     END
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@3CNT  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@3CNT
     C                     ITER
     C                     END
     C                     ADD  0.5       W@3CNT
     C                     ENDDO
     C* SHIP CLOSE YYMM ------------------------------------
     C* 1ST MONTH
     C                     Z-ADDW@YY      K@YYYY
     C                     Z-ADDW@MM      K@MMMM
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@PMD1  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@PMD1
     C                     ITER
     C                     END
     C                     ADD  0.5       W@PMD1
     C                     ENDDO
     C* 2ND MONTH
     C                     SUB  1         K@MMMM
     C           K@MMMM    IFLE *ZERO
     C                     SUB  1         K@YYYY
     C                     ADD  12        K@MMMM
     C                     END
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@PMD2  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@PMD2
     C                     ITER
     C                     END
     C                     ADD  0.5       W@PMD2
     C                     ENDDO
     C* 3RD MONTH
     C                     SUB  1         K@MMMM
     C           K@MMMM    IFLE *ZERO
     C                     SUB  1         K@YYYY
     C                     ADD  12        K@MMMM
     C                     END
     C           K#AGD     SETLLAGDPL12
     C                     Z-ADD*ZERO     W@PMD3  31
     C                     DO   *HIVAL
     C           K#AGD     READEAGDPL12                  97
     C   97                LEAVE
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C                     ITER
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         W@PMD3
     C                     ITER
     C                     END
     C                     ADD  0.5       W@PMD3
     C                     ENDDO
      *JW2
     C                     MOVE '.'       @D1C
     C                     MOVE '.'       @D2C
     C                     MOVE *DATE     @DATE   80
     C                     MOVEL@DATE     @DATE8  8
      *
     C                     ENDSR
**
A1 IAF PART#
B2 TOYOTA GOING
C3 PROD TYPE
D4 PRICE END
E5 MATERIAL NAME
F6 M.DIME
G7 M.WGHT
H8 F.LOCATION
I9 MVOL CHANGE DATE
J  BOX/DAY
K  MONTHLY VOL
L  HIGH FCST
M  HIGH FCST DIF
N  RATIO
O  QPC
P  N+0 FCST
Q  N+0 FCST DIF
R  N+1 FCST
S  N+1 FCST DIF
T  N+2 FCST
U  N+2 FCST DIF
V  N-1 SHIP
W  N-2 SHIP
X  N-3 SHIP
Y  N-4 SHIP
Z  N-5 SHIP
AA N-6 SHIP
AB N+0 HND & TYT FCST
AC N+1 HND & TYT FCST
AD N+3 HND & TYT FCST
AE HIGH SHIP OTHER
AF N-1  SHIP OTHER
AG N-2  SHIP OTHER
AH N-3  SHIP OTHER
AI N+0  FCST H&T+SHP OTH HGH
AJ N+0  FCST H&T+SHP OTH HGH D
AK N+1  FCST H&T+SHP OTH HGH
AL N+1  FCST H&T+SHP OTH HGH D
AM N+2  FCST H&T+SHP OTH HGH
AN N+2  FCST H&T+SHP OTH HGH D
AO COMP#1
AP COMP#2
AQ COMP#3
AR COMP#4
AS
AT
AU
AV
AW
AX
AY
AZ
