     H            Y.
     F*** ABBR40 ********************************
     F* FORECAST FILE UPDATE PROCESS            *
     F*                A-MAMIYA   2000.11.25    *
     F******************************* ABBR40 ****
     FABBPW40 CF  E                    WORKSTN
     FIZAPL01 IF  E           K        DISK
     FIZBPL01 IF  E           K        DISK
     FABBPL40 UF  E           K        DISK                      A
     E                    ER      1  20 60
     E                    WKJ1    1   3  1   WKJ2   10
     I            DS
     I                                        1   80A4SKHZ
     I                                        1   40A4SKYY
     I                                        5   60A4SKMM
     I                                        7   80A4SKDD
     I            DS
     I                                        1   80A4KOHZ
     I                                        1   40A4KOYY
     I                                        5   60A4KOMM
     I                                        7   80A4KODD
     I            DS
     I                                        1   60A4KOTI
     I                                        1   20A4KOHH
     I                                        3   40A4KOSS
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I            DS
     I                                        1   80ZDUKHZ
     I                                        1   40ZDUKYY
     I                                        5   60ZDUKMM
     I                                        7   80ZDUKDD
     I            DS
     I                                        1   80ZDSTHZ
     I                                        1   40ZDSTYY
     I                                        5   60ZDSTMM
     I                                        7   80ZDSTDD
     I            DS
     I                                        1  84 @JRYO
     I                                        1   70@JRY01
     I                                        8  140@JRY02
     I                                       15  210@JRY03
     I                                       22  280@JRY04
     I                                       29  350@JRY05
     I                                       36  420@JRY06
     I                                       43  490@JRY07
     I                                       50  560@JRY08
     I                                       57  630@JRY09
     I                                       64  700@JRY10
     I                                       71  770@JRY11
     I                                       78  840@JRY12
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
     C           KEY1      KLIST
     C                     KFLD           @ZAIS
     C                     KFLD           @ZAIK
     C                     KFLD           @UKEI
     C                     KFLD           @SIRE
      *
     C           KEY2      KLIST
     C                     KFLD           @KYY
     C                     KFLD           @SIRE
     C                     KFLD           @UKEI
     C                     KFLD           @PTCD
     C                     KFLD           @ZAIS
     C                     KFLD           @ZAIK
     C*----------------------------------------------------*
     C*                   １画面                         *
     C*----------------------------------------------------*
      *
     C           STP1      TAG
     C                     MOVE *BLANK    @KOKU
     C                     MOVE *BLANK    @KYY
     C                     MOVE *BLANK    @ZAIS
     C                     Z-ADD0         @ZAIK
     C                     Z-ADD0111      @UKEI
     C                     Z-ADD0         @SIRE
     C                     MOVE 'W'       @PTCD
      *
     C           STP2      TAG
     C                     EXFMTABBPW401
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     0799
      *-------*
      * CMD-1 *
      *-------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *------*
      *更新*
      *------*
     C           @KOKU     IFNE '0'
     C           @KOKU     ANDNE'1'
     C           @KOKU     ANDNE'2'
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     SETOF                     01
     C                     Z-ADD1         A       20
     C           @KOKU     LOKUPWKJ1,A                   01
     C           *IN01     IFEQ '1'
     C                     MOVE WKJ2,A    WKSNM
     C                     SETOF                     01
     C                     END
      *------------*
      *計画予定日*
      *------------*
     C           @KYY      IFLT *YEAR
     C                     SETON                     0299
     C                     MOVELER,3      MSG
     C                     GOTO STP2
     C                     END
      *------------*
      *材質・材経*
      *------------*
     C           @ZAIS     IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVELER,4      MSG
     C                     GOTO STP2
     C                     END
     C           @ZAIK     IFEQ 0
     C                     SETON                     0499
     C                     MOVELER,10     MSG
     C                     GOTO STP2
     C                     END
     C           @PTCD     IFNE 'W'
     C           @PTCD     ANDNE'R'
     C                     SETON                     0799
     C                     MOVELER,14     MSG
     C                     GOTO STP2
     C                     END
     C           @PTCD     IFEQ 'W'
     C                     MOVEL'WIRE'    @TYPE
     C                     END
     C           @PTCD     IFEQ 'R'
     C                     MOVEL'ROD '    @TYPE
     C                     END
     C           @SIRE     IFEQ 0
     C                     SETON                     0599
     C                     MOVELER,11     MSG
     C                     GOTO STP2
     C                     END
     C           @UKEI     IFEQ 0
     C                     SETON                     0699
     C                     MOVELER,12     MSG
     C                     GOTO STP2
     C                     END
      *--------------------------------------*
      *母材・完成材かんばんマスターチェック*
      *--------------------------------------*
     C                     MOVEL*BLANK    @DATA   1
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C           @PTCD     IFEQ 'W'
     C                     SETOF                     50
     C           KEY1      SETGTIZAPL011
     C                     DO   *HIVAL
     C           KEY1      REDPEIZAPL011                 50
      *
     C           *IN50     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N50                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     030405
     C                     SETON                     060799
     C                     MOVELER,5      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *------------*
      * ROD KANBAN *
      *------------*
     C           @PTCD     IFEQ 'R'
     C                     SETOF                     50
     C           KEY1      SETGTIZBPL011
     C                     DO   *HIVAL
     C           KEY1      REDPEIZBPL011                 50
      *
     C           *IN50     IFEQ '0'
     C           ZDSKJY    IFEQ 'D'
     C           ZDSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZDUKHZ    IFLE *DATE
     C           ZDSTHZ    ANDGT*DATE
     C                     MOVEL'*'       @DATA
     C                     END
     C                     END
     C                     END
     C  N50                ENDDO
      *
     C           @DATA     IFEQ *BLANK
     C                     SETON                     030405
     C                     SETON                     060799
     C                     MOVELER,13     MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *----------------------------------*
      * MATERIAL FORECAST FILE
      *----------------------------------*
     C                     SETOF                     98
     C           KEY2      CHAINABBPL401             98
      *
     C*取消OR変更
     C           @KOKU     IFEQ '0'
     C           @KOKU     OREQ '1'
     C           *IN98     IFEQ '1'
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     0799
     C                     MOVELER,6      MSG
     C                     GOTO STP2
     C                     END
      *
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    ANDLE*DATE
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     0799
     C                     MOVELER,7      MSG
     C                     GOTO STP2
     C                     END
     C                     Z-ADDA4JRY1    @JRY01
     C                     Z-ADDA4JRY2    @JRY02
     C                     Z-ADDA4JRY3    @JRY03
     C                     Z-ADDA4JRY4    @JRY04
     C                     Z-ADDA4JRY5    @JRY05
     C                     Z-ADDA4JRY6    @JRY06
     C                     Z-ADDA4JRY7    @JRY07
     C                     Z-ADDA4JRY8    @JRY08
     C                     Z-ADDA4JRY9    @JRY09
     C                     Z-ADDA4JRYA    @JRY10
     C                     Z-ADDA4JRYB    @JRY11
     C                     Z-ADDA4JRYC    @JRY12
     C                     END
      *
     C*追加
     C           @KOKU     IFEQ '2'
     C           *IN98     IFEQ '0'
     C           A4SKJY    IFEQ 'D'
     C           A4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     0799
     C                     MOVELER,8      MSG
     C                     GOTO STP2
     C                     END
     C                     END
     C                     MOVEL*ALL'0'   @JRYO
     C                     END
      *
     C                     MOVEA'00000000'*IN,21
     C                     MOVEA'0000'    *IN,29
     C           @KYY      IFEQ *YEAR
     C                     Z-ADD20        ZZ      20
     C           UMONTH    SUB  1         @KMM    20
     C           1         DO   @KMM
     C                     ADD  1         ZZ
     C                     MOVEA'1'       *IN,ZZ
     C                     ENDDO
     C                     END
      *
     C*----------------------------------------------------*
     C*                   ２画面                         *
     C*----------------------------------------------------*
      *
     C           STP4      TAG
     C                     EXFMTABBPW402
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'0000'    *IN,09
     C                     SETOF                     99
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP1
     C                     END
      *
     C           @JRYO     IFEQ *ALL'0'
     C                     MOVEA'11111111'*IN,01
     C                     MOVEA'1111'    *IN,09
     C                     SETON                     99
     C                     MOVELER,9      MSG
     C           @KYY      IFEQ *YEAR
     C                     Z-ADD0         ZZ
     C           UMONTH    SUB  1         @KMM    20
     C           1         DO   @KMM
     C                     ADD  1         ZZ
     C                     MOVEA'0'       *IN,ZZ
     C                     ENDDO
     C                     END
     C                     GOTO STP4
     C                     END
     C  NKE                GOTO STP4
      *
     C*----------------------------------------------------*
     C*                   データ更新                     *
     C*----------------------------------------------------*
     C                     Z-ADD*DATE     A4KOHZ
     C                     TIME           A4KOTI
     C                     MOVE PUS       A4KOME
      *
     C           @KOKU     IFEQ '0'
     C                     MOVE 'D'       A4SKJY
     C                     Z-ADD*DATE     A4SKHZ
     C                     ELSE
     C                     MOVE *BLANK    A4SKJY
     C                     Z-ADD0         A4SKHZ
     C                     END
      *
     C                     MOVE @KYY      A4KEYY
     C                     Z-ADD@SIRE     A4SIRE
     C                     Z-ADD@UKEI     A4UKEI
     C                     MOVE @PTCD     A4PTCD
     C                     MOVE @ZAIS     A4ZAIS
     C                     Z-ADD@ZAIK     A4ZAIK
     C                     Z-ADD@JRY01    A4JRY1
     C                     Z-ADD@JRY02    A4JRY2
     C                     Z-ADD@JRY03    A4JRY3
     C                     Z-ADD@JRY04    A4JRY4
     C                     Z-ADD@JRY05    A4JRY5
     C                     Z-ADD@JRY06    A4JRY6
     C                     Z-ADD@JRY07    A4JRY7
     C                     Z-ADD@JRY08    A4JRY8
     C                     Z-ADD@JRY09    A4JRY9
     C                     Z-ADD@JRY10    A4JRYA
     C                     Z-ADD@JRY11    A4JRYB
     C                     Z-ADD@JRY12    A4JRYC
      *
     C           *IN98     IFEQ '0'
     C                     UPDATABBPL401
     C                     ELSE
     C                     WRITEABBPL401
     C                     END
      *
      *
      *
**  ERR-MSG
E-01 UPDATE INSTRUCTION IS WRONG.
E-02 PLAN DATE IS LOGICAL ERROR.
E-03 PLAN DATE IS SMALLER THAN TODAY.
E-04 INPUT WIRE.
E-05 THIS DATA IS NOT IN WIRE KANBAN MASTER FILE.
E-06 THERE ISN'T IT IN MATERIAL FORECAST FILE.
E-07 IT IS CANCELLED ALREADY.
E-08 THERE IS DATA.
E-09 INPUT FORECAST WEIGHT.
E-10 INPUT WIRE DIAMETER.
E-11 INPUT SUPPLIER CODE.
E-12 INPUT RECEIVING CODE.
E-13 THIS DATA IS NOT IN ROD KANBAN MASTER FILE.
E-14 INPUT MATERIAL CDOE IS DIFFERENT.
**  WKJ1/WKJ2(FACTORY)
00-CANCEL
11-CHANGE
22-ADD
