     H            Y/
     F** ABBR97 *****************************************
     F*  TRANSFER INVENTORY DATA TO IFS.CSV             *
     F*  JW   2021.09.07                                *
     F***************************************************
     FABBWP90 IF  E           K        DISK
     FADHPL01 IF  E           K        DISK
     FABBWP97 O   E                    DISK
     FABBWP97BO   E                    DISK
      *------------------------------------------------------------
     E                    MSG     1   2 34
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        1   20NHH
     I                                        3   40NJJ
     I                                        7  140TODAY
     I                                        7  100TYY
     I                                       11  120TMM
     I                                       13  140TDD
     I            DS
     I                                        1   8 WTIME8
     I                                        1   5 WTIME5
     I                                        1   2 WHH
     I                                        3   3 T1
     I                                        4   5 WJJ
     I                                        6   6 T2
     I                                        7   8 WSS
     I            DS
     I                                        1  10 WDATE
     I                                        1   4 WYY
     I                                        5   5 D1
     I                                        6   7 WMM
     I                                        8   8 D2
     I                                        9  10 WDD
     I            DS
     I                                        1   80A9DATE
     I                                        1   40A9YY
     I                                        5   60A9MM
     I                                        7   80A9DD
     I            DS
     I                                        1   60A9TIME
     I                                        1   20A9HH
     I                                        3   40A9JJ
     I                                        5   60A9SS
     I            DS
     I                                        1  14 WSHIN
     I                                        1   5 WSHN1
     I                                        6   6 P1
     I                                        7  11 WSHN2
     I                                       12  12 P2
     I                                       13  14 WSHN3
     I            DS
     I                                        1   9 WLOC
     I                                        1   1 WLOC1
     I                                        2   2 L1
     I                                        3   4 WLOC2
     I                                        5   5 L2
     I                                        6   7 WLOC3
     I                                        8   8 L3
     I                                        9   9 WLOC4
     I            DS
     I                                        1  12 A9SHIN
     I                                        1   5 A9PRT1
     I                                        6  10 A9PRT2
     I                                       11  12 A9PRT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     READ ABBWP90                  98
     C   98                LEAVE
      *
     C                     CLEARABBWP971
      *
     C                     MOVELA9YY      WYY
     C                     MOVE '/'       D1
     C                     MOVELA9MM      WMM
     C                     MOVELA9DD      WDD
     C                     MOVELWDATE     B9DATE
      *
     C                     MOVELA9HH      WHH
     C                     MOVELA9JJ      WJJ
     C                     MOVELA9SS      WSS
     C                     MOVELWTIME8    B9TIME
      *
     C                     MOVELA9LCID    B9LCID
      * GET NAME
     C                     EXSR #NAME
     C                     MOVEL@NAME     B9LCNM
      *
     C                     MOVELA9PRT1    WSHN1
     C                     MOVELA9PRT2    WSHN2
     C                     MOVELA9PRT3    WSHN3
     C                     MOVELWSHIN     B9PRT
     C                     MOVELA9QTY     B9QTY
     C                     MOVELA9BRCD    B9BAR
      * RETRIEVE VALUES
     C                     MOVELA9PRT1    K#SHN1
     C                     MOVELA9PRT2    K#SHN2
     C                     MOVELA9PRT3    K#SHN3
     C                     Z-ADD9999      K#STYY
     C                     Z-ADD99        K#STMM
     C                     Z-ADD99        K#STDD
     C           K#PL01    SETLLADHPL01
     C                     DO   *HIVAL
     C           K#PL01    READEADHPL01                  97
     C   97                LEAVE
      *
     C           J6SKJY    IFEQ 'D'
     C           B9MCN     ANDEQ*BLANK
     C           J6SKJY    OREQ ' '
     C                     EXSR #GET
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     WRITEABBWP971
     C                     EXSR #W97B
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *************************************************************
      * GET LOCATION NAME
      *************************************************************
     C           #NAME     BEGSR
      *
     C                     MOVE '     '   @NAME   5
     C                     SELEC
     C           A9LCID    WHEQ '0'
     C                     MOVEL'HD   '   @NAME
     C           A9LCID    WHEQ '1'
     C                     MOVEL'LAN  '   @NAME
     C           A9LCID    WHEQ '2'
     C                     MOVEL'RL   '   @NAME
     C           A9LCID    WHEQ '3'
     C                     MOVEL'OQ-PL'   @NAME
     C           A9LCID    WHEQ '4'
     C                     MOVEL'BZ1  '   @NAME
     C           A9LCID    WHEQ '5'
     C                     MOVEL'BZ2  '   @NAME
     C           A9LCID    WHEQ '6'
     C                     MOVEL'DS   '   @NAME
     C           A9LCID    WHEQ '7'
     C                     MOVEL'MAGNI'   @NAME
     C           A9LCID    WHEQ '8'
     C                     MOVEL'BZ3  '   @NAME
     C           A9LCID    WHEQ '9'
     C                     MOVEL'OQ   '   @NAME
     C           A9LCID    WHEQ 'A'
     C                     MOVEL'SB   '   @NAME
     C           A9LCID    WHEQ 'B'
     C                     MOVEL'BZ4  '   @NAME
     C           A9LCID    WHEQ 'C'
     C                     MOVEL'JC-PL'   @NAME
     C           A9LCID    WHEQ 'D'
     C                     MOVEL'JC   '   @NAME
     C           A9LCID    WHEQ 'E'
     C                     MOVEL'QD   '   @NAME
     C           A9LCID    WHEQ 'F'
     C                     MOVEL'BZ5  '   @NAME
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************
      * GET DATA
      *************************************************************
     C           #GET      BEGSR
      *
     C                     MOVELJ6RONO    B9MCN
     C                     MOVELJ6ONDO    B9TMP
     C                     MOVELJ6LOTO    B9LOT
      * TYPE
     C                     SELEC
     C           J6SSKB    WHEQ '1'
     C                     MOVEL'REG     'B9TYP
     C           J6SSKB    WHEQ '2'
     C                     MOVEL'SS      'B9TYP
     C           J6SSKB    WHEQ '3'
     C                     MOVEL'KEEP 120'B9TYP
     C           J6SSKB    WHEQ '4'
     C                     MOVEL'WSHR SET'B9TYP
     C           J6SSKB    WHEQ '5'
     C                     MOVEL'1 / 4W  'B9TYP
     C                     ENDSL
      *
     C                     MOVELJ6MTK1    WLOC1
     C                     MOVELJ6MTK2    WLOC2
     C                     MOVELJ6MTK3    WLOC3
     C                     MOVELJ6MTK4    WLOC4
     C                     MOVELWLOC      B9PLOC
      *
     C                     MOVELJ6ATK1    WLOC1
     C                     MOVELJ6ATK2    WLOC2
     C                     MOVELJ6ATK3    WLOC3
     C                     MOVELJ6ATK4    WLOC4
     C                     MOVELWLOC      B9LOC
      *
     C                     ENDSR
      *************************************************************
      * OUTPUT ABBWP97B
      *************************************************************
     C           #W97B     BEGSR
      * GET QPC
     C                     MOVE *BLANK    $TOKU
     C                     MOVE *BLANK    $NONY
     C                     MOVELA9SHIN    $MHIN     P
     C                     MOVEL'IAF'     $HTYP
     C                     MOVELTODAY     $DATE
     C                     CALL 'UTLR35'
     C                     PARM           $TOKU   4
     C                     PARM           $NONY   4
     C                     PARM           $MHIN  20
     C                     PARM           $HTYP   3
     C                     PARM           $DATE   8
     C                     PARM           $SYOS   6
     C                     PARM           $RTN1   1
     C                     MOVEL$SYOS     @SYOS   60
      *
     C                     Z-ADD0         @BOX    60
     C           @SYOS     IFEQ 0
     C                     Z-ADD0         @BOX
     C                     ELSE
     C           A9QTY     DIV  @SYOS     @BOX
     C                     MVR            @REM    60
     C           @REM      IFNE 0
     C                     ADD  1         @BOX
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVEL@SYOS     B9QPC
     C                     MOVEL@BOX      B9BOX
     C                     WRITEABBW97B1
      *
     C                     ENDSR
      *************************************************************
      * INITIAL SET
      *************************************************************
     C           #INIT     BEGSR
      *
     C           K#PL01    KLIST
     C                     KFLD           K#SHN1  5
     C                     KFLD           K#SHN2  5
     C                     KFLD           K#SHN3  2
     C                     KFLD           K#STYY  40
     C                     KFLD           K#STMM  20
     C                     KFLD           K#STDD  20
      *
     C                     TIME           SDATE
     C                     MOVELNHH       WHH
     C                     MOVE ':'       T1
     C                     MOVELNJJ       WJJ
     C                     MOVE ':'       T2
      *
     C                     MOVELTYY       WYY
     C                     MOVE '/'       D1
     C                     MOVELTMM       WMM
     C                     MOVE '/'       D2
     C                     MOVELTDD       WDD
      *
     C                     MOVE ' '       P1
     C                     MOVE ' '       P2
     C                     MOVE '-'       L1
     C                     MOVE '-'       L2
     C                     MOVE '-'       L3
      * SET HEADER
     C                     EXSR #HEAD
     C                     ENDSR
      *************************************************************
      * WRITE HEADER
      *************************************************************
     C           #HEAD     BEGSR
      * HEADER
     C                     CLEARABBWP971
     C                     MOVEL'DATE    'B9DATE
     C                     MOVEL'TIME    'B9TIME
     C                     MOVEL'LOC ID  'B9LCID
     C                     MOVEL'NAME    'B9LCNM
     C                     MOVEL'IAF PART'B9PRT
     C                     MOVEL'QTY     'B9QTY
     C                     MOVEL'BARCODE 'B9BAR
     C                     MOVEL'MACHINE 'B9MCN
     C                     MOVEL'TEMP    'B9TMP
     C                     MOVEL'LOT     'B9LOT
     C                     MOVEL'TYPE    'B9TYP
     C                     MOVEL'PRE-LOC 'B9PLOC
     C                     MOVEL'LOCATION'B9LOC
      * PGM NOTE
     C                     MOVELMSG,1     LTR34  34
     C                     MOVELWDATE     LTR16  16
     C                     MOVE WTIME5    LTR16
     C                     MOVE LTR16     LTR34
     C                     MOVELLTR34     B9PGM
      *
     C                     WRITEABBWP971
      *
     C                     MOVEL'BOX     'B9BOX
     C                     MOVEL'QPC     'B9QPC
     C                     WRITEABBW97B1
      *
     C                     ENDSR
      **************************************************************
** MSG(34A) .......2.........3...>
PGM: ABBR97 AS OF 2018/11/05 10:47
'
