     H            Y.                                    1
     H***ABBR911 ***************************************************************
     H* DAILY INVENTORY DATA AUTO DELETE & CREATE ACCUMULATE                   *
     H*
     H* TCHK1 01/06/09 CREATE
     H* TCHK2 12/18/12 REMAKE 2/DAY --> 3/DAY
     H**************************************************************************
     FABBPL90 UF  E           K        DISK
     FABBPP91 O   E                    DISK
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@SHFT  1
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C*
     C                     EXSR #MAIN
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     ENDSR
     C*************************************************************************
     C*          MAIN
     C**************************************************************************
     C           #MAIN     BEGSR
     C*
     C           *LOVAL    SETLLABBPL90
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ABBPL90                  99
     C   99                LEAVE
     C*
     C                     MOVELP@SHFT    A9SHFT
     C                     WRITEABBPP911
     C                     DELETABBPP901
     C*
     C                     ENDDO
     C*
     C                     ENDSR
