     H            Y.                                    1
     F** ABBR13 *************************************
     F* .. MATERIAL TOTALIZATION LIST & COMPONENTS TOTALIZATION LIST || *.
     F*     I-HASADA                 00.06.22       *
     F* UPDATE:K.OKACHI           2000.11.21  %0001 *
     F* UPDATE:A.MAMIYA           2000.12.04  %0002 *
     F*        K.OKACHI           2000.12.15  %0003 *
     F* UPDATE:A.MAMIYA           2001.01.25  %0004 *
      *- MSK 2007.11.02 ----------------------------*
      * CHANGED WORKING DAYS TO 20 (CONSTANT)       *
JW1  C* JW   2020.12.14 CALCULETE WITH WORKING DAYS FOR MONTH N
     F************************************* ABBR13 **
     FFCEPP01 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAKEPL01 IF  E           K        DISK
     FMBEPL02 IF  E           K        DISK
%0001FGKBPL01 IF  E           K        DISK
%0001FABBPL40 IF  E           K        DISK
%0002FABBWP131O   F     256            DISK
     FABBWP132O   F     100            DISK
%0002FABBWP133O   F     256            DISK
     FABMPPD1 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FBTBPL08 IF  E           K        DISK
     FBTBPL41 IF  E           K        DISK
     E                    JIU         6  9 0
     E                    NAI         6  9 0
     E                    NYM         3  6 0
     E                    NCD         3  3 1
      *
     E                    HR1      2000 16
     E                    HR2      2000 79
     E                    HR3      1000 24
%0002E                    HR4      1000129
%0001 *
     E                    HR5      1000 28
%0002E                    HR6      1000129
%0001 *
     E                    HIN         4 12
     E                    HYM         4  6 0
     E                    HCD         4  3 1
%0002 *
     E                    JRY        12  7 0
     E                    WJI         6  9 0
     E                    WWJI        6  9 0
     E                    @JI         6  7 0
     E                    @@JI        6  7 0
%0002 *
%0003E                    SYK         4  1 0             USE QTY
     E                    HTP        31  3 0             +箱数BTAPP04
     E                    HTM        31  3 0             -箱数BTAPP04
     E                    HTZ        31  1               割振BTAPP04
      *
     I            DS
     I                                        1   60YYMM
     I                                        1   40YY
     I                                        5   60MM
     I            DS
     I                                        1   60YYMM1
     I                                        1   40YY1
     I                                        5   60MM1
     I            DS
     I                                        1   60YYMM2
     I                                        1   40YY2
     I                                        5   60MM2
     I            DS
     I                                        1   60WWYM
     I                                        1   40WWYY
     I                                        5   60WWMM
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  48 HIN
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
     I                                       13  17 A24HB5
     I                                       18  22 A25HB5
     I                                       23  24 A26HB2
     I                                       25  29 A27HB5
     I                                       30  34 A28HB5
     I                                       35  36 A29HB2
     I                                       37  41 A210H5
     I                                       42  46 A211H5
     I                                       47  48 A212H2
     I            DS
     I                                        1  79 WK
     I                                        1  12 WK1
     I                                        1   5 WK11
     I                                        6  10 WK12
     I                                       11  12 WK13
     I                                       13  210WNA1
     I                                       22  300WNA2
     I                                       31  390WNA3
     I                                       40  480WNA4
     I                                       49  570WNA5
     I                                       58  660WNA6
     I                                       67  700WSIRE
     I                                       71  790WNZSU
     I            DS
     I                                        1 129 WZ
%0002I                                        1  15 #WZ1
     I                                        1  15 WZ1
%0002I                                       16 129 #WZ2
     I                                       16  202WZ2
     I                                       21  740WJI
     I                                       21  290WJI1
     I                                       30  380WJI2
     I                                       39  470WJI3
     I                                       48  560WJI4
     I                                       57  650WJI5
     I                                       66  740WJI6
     I                                       75  780WSIRE1
     I                                       79  870WJISU
%0002I                                       88 1290@JI
%0002I                                       88  940@JI1
%0002I                                       95 1010@JI2
%0002I                                      102 1080@JI3
%0002I                                      109 1150@JI4
%0002I                                      116 1220@JI5
%0002I                                      123 1290@JI6
     I            DS
     I                                        1  24 WKEY
     I                                        1  15 A2ZANM
     I                                       16  202A2KAZI
     I                                       21  240A2SIRE
%0002 *
     I            DS
     I                                        1  24 FKEY
     I                                        1  15 A4ZAIS
     I                                       16  202A4ZAIK
     I                                       21  240A4SIRE
%0002 *
     I            DS
     I                                        1  16 CKEY
     I                                        1  12 CKHIN
     I                                        1   5 CKHN1
     I                                        6  10 CKHN2
     I                                       11  12 CKHN3
     I                                       13  160CSIRE
%0001 *
     I            DS
%0002I                                        1 129 WWZ
%0002I                                        1  15 #WWZ1
     I                                        1  15 WWZ1
%0002I                                       16 129 #WWZ2
     I                                       16  202WWZ2
     I                                       21  740WWJI
     I                                       21  290WWJI1
     I                                       30  380WWJI2
     I                                       39  470WWJI3
     I                                       48  560WWJI4
     I                                       57  650WWJI5
     I                                       66  740WWJI6
     I                                       75  780WWSIRE
     I                                       79  870WWWJIS
%0002I                                       88 1290@@JI
%0002I                                       88  940@@JI1
%0002I                                       95 1010@@JI2
%0002I                                      102 1080@@JI3
%0002I                                      109 1150@@JI4
%0002I                                      116 1220@@JI5
%0002I                                      123 1290@@JI6
     I            DS
     I                                        1  28 ZKEY
     I                                        1  15 WBOZN
     I                                       16  202WKAZI
     I                                       21  240WKAUK
     I                                       25  280WKASI
%0002 *
     I            DS
     I                                        1  28 XKEY
     I                                        1  15 W4ZAIS
     I                                       16  202W4ZAIK
     I                                       21  240W4UKEI
     I                                       25  280W4SIRE
%0002 *
%0002 *
     I            DS
     I                                        1  840JRY
     I                                        1   70A4JRY1
     I                                        8  140A4JRY2
     I                                       15  210A4JRY3
     I                                       22  280A4JRY4
     I                                       29  350A4JRY5
     I                                       36  420A4JRY6
     I                                       43  490A4JRY7
     I                                       50  560A4JRY8
     I                                       57  630A4JRY9
     I                                       64  700A4JRYA
     I                                       71  770A4JRYB
     I                                       78  840A4JRYC
%0002 *
%0001 *
%0003 *
     I            DS
     I                                        1   40SYK
     I                                        1   10A2SYK1
     I                                        2   20A2SYK2
     I                                        3   30A2SYK3
     I                                        4   40A2SYK4
%0003 *
%0004 *
     I            DS
     I                                        1   80A4SKHZ
     I                                        1   40A4SKYY
     I                                        5   60A4SKMM
     I                                        7   80A4SKDD
      *
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
      *
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
      *
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
      *
     I            DS
     I                                        1  93 HTP
     I                                        1   30BTPH01
     I                                        4   60BTPH02
     I                                        7   90BTPH03
     I                                       10  120BTPH04
     I                                       13  150BTPH05
     I                                       16  180BTPH06
     I                                       19  210BTPH07
     I                                       22  240BTPH08
     I                                       25  270BTPH09
     I                                       28  300BTPH10
     I                                       31  330BTPH11
     I                                       34  360BTPH12
     I                                       37  390BTPH13
     I                                       40  420BTPH14
     I                                       43  450BTPH15
     I                                       46  480BTPH16
     I                                       49  510BTPH17
     I                                       52  540BTPH18
     I                                       55  570BTPH19
     I                                       58  600BTPH20
     I                                       61  630BTPH21
     I                                       64  660BTPH22
     I                                       67  690BTPH23
     I                                       70  720BTPH24
     I                                       73  750BTPH25
     I                                       76  780BTPH26
     I                                       79  810BTPH27
     I                                       82  840BTPH28
     I                                       85  870BTPH29
     I                                       88  900BTPH30
     I                                       91  930BTPH31
     I            DS
     I                                        1  93 HTM
     I                                        1   30BTMH01
     I                                        4   60BTMH02
     I                                        7   90BTMH03
     I                                       10  120BTMH04
     I                                       13  150BTMH05
     I                                       16  180BTMH06
     I                                       19  210BTMH07
     I                                       22  240BTMH08
     I                                       25  270BTMH09
     I                                       28  300BTMH10
     I                                       31  330BTMH11
     I                                       34  360BTMH12
     I                                       37  390BTMH13
     I                                       40  420BTMH14
     I                                       43  450BTMH15
     I                                       46  480BTMH16
     I                                       49  510BTMH17
     I                                       52  540BTMH18
     I                                       55  570BTMH19
     I                                       58  600BTMH20
     I                                       61  630BTMH21
     I                                       64  660BTMH22
     I                                       67  690BTMH23
     I                                       70  720BTMH24
     I                                       73  750BTMH25
     I                                       76  780BTMH26
     I                                       79  810BTMH27
     I                                       82  840BTMH28
     I                                       85  870BTMH29
     I                                       88  900BTMH30
     I                                       91  930BTMH31
     I            DS
     I                                        1  31 HTZ
     I                                        1   1 BTZM01
     I                                        2   2 BTZM02
     I                                        3   3 BTZM03
     I                                        4   4 BTZM04
     I                                        5   5 BTZM05
     I                                        6   6 BTZM06
     I                                        7   7 BTZM07
     I                                        8   8 BTZM08
     I                                        9   9 BTZM09
     I                                       10  10 BTZM10
     I                                       11  11 BTZM11
     I                                       12  12 BTZM12
     I                                       13  13 BTZM13
     I                                       14  14 BTZM14
     I                                       15  15 BTZM15
     I                                       16  16 BTZM16
     I                                       17  17 BTZM17
     I                                       18  18 BTZM18
     I                                       19  19 BTZM19
     I                                       20  20 BTZM20
     I                                       21  21 BTZM21
     I                                       22  22 BTZM22
     I                                       23  23 BTZM23
     I                                       24  24 BTZM24
     I                                       25  25 BTZM25
     I                                       26  26 BTZM26
     I                                       27  27 BTZM27
     I                                       28  28 BTZM28
     I                                       29  29 BTZM29
     I                                       30  30 BTZM30
     I                                       31  31 BTZM31
     I            DS
     I                                        1   80BTSKH8
     I                                        1   40BTSKYY
     I                                        5   60BTSKMM
     I                                        7   80BTSKDD
     I            DS
     I                                        1   80B4SKH8
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
%0004 *
     C           KEY1      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEY2      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           YYMM
      *
     C           KEY3      KLIST
     C                     KFLD           WWYY
     C                     KFLD           WWMM
      *
     C           KEY4      KLIST
     C                     KFLD           CKHN1
     C                     KFLD           CKHN2
     C                     KFLD           CKHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIZ    6
     C                     PARM           PYM1    6
     C                     PARM           PYM2    6
     C                     PARM           PYM3    6
     C                     PARM           PYM4    6
     C                     PARM           PYM5    6
     C                     PARM           PYM6    6
      *
     C                     MOVE PHIZ      YYMM
     C                     TIME           WTIME   60
      *
     C*----------------------------------------------*
     C* GET DATE FOR CURRENT, NEXT AND NEXT 2 MONTH  *
     C*----------------------------------------------*
     C                     Z-ADDYYMM      YYMM1
     C                     ADD  1         MM1
     C           MM1       IFGT 12
     C                     ADD  1         YY1
     C                     SUB  12        MM1
     C                     END
     C                     Z-ADDYYMM      YYMM2
     C                     ADD  2         MM2
     C           MM2       IFGT 12
     C                     ADD  1         YY2
     C                     SUB  12        MM2
     C                     END
      *
     C*------------------------------------------------------*
     C* GET DATE FOR N+1, N+2 AND N+3                        *
     C*------------------------------------------------------*
     C                     Z-ADD0         HYM
     C                     Z-ADDYYMM      HYM,1
      *
     C                     Z-ADDYYMM2     WWYM
     C                     Z-ADD1         F       10
     C           2         DO   4         F
     C           WWMM      IFEQ 12
     C                     ADD  1         WWYY
     C                     Z-ADD01        WWMM
     C                     ELSE
     C                     ADD  1         WWMM
     C                     END
     C                     Z-ADDWWYM      HYM,F
     C                     END
      *
     C                     MOVE YYMM      PYM1
     C                     MOVE YYMM1     PYM2
     C                     MOVE YYMM2     PYM3
     C                     MOVE HYM,2     PYM4
     C                     MOVE HYM,3     PYM5
     C                     MOVE HYM,4     PYM6
      *
     C                     Z-ADDYYMM      NYM,1
     C                     Z-ADDYYMM1     NYM,2
     C                     Z-ADDYYMM2     NYM,3
      *
     C*---------------------------------------------------------*
     C* GET WORKING DAYS FOR N+1, N+2 AND N+3                   *
     C*---------------------------------------------------------*
     C                     Z-ADD1         F
     C                     Z-ADD0         NCD
     C           1         DO   3         F
     C                     Z-ADDNYM,F     WWYM
     C                     Z-ADD0         WCD     31
      *
     C           KEY3      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY3      READEAGDPL121                 01
     C           *IN01     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WCD
     C                     ELSE
     C                     ADD  0.5       WCD
     C                     END
      *
     C                     END
     C                     END
     C  N01                END
     C                     Z-ADDWCD       NCD,F
     C                     END
      *
     C*---------------------------------------------------------*
     C* GET WORKING DAYS FOR N+1, N+2 AND N+3                   *
     C*---------------------------------------------------------*
     C                     Z-ADD1         F
     C                     Z-ADD0         HCD
     C           1         DO   4         F
     C                     Z-ADDHYM,F     WWYM
     C                     Z-ADD0         WCD     31
      *
     C           KEY3      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY3      READEAGDPL121                 01
     C           *IN01     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WCD
     C                     ELSE
     C                     ADD  0.5       WCD
     C                     END
      *
     C                     END
     C                     END
     C  N01                END
     C                     Z-ADDWCD       HCD,F
     C                     END
      *
     C                     Z-ADD1         B
     C           1         DO   2000      B
     C                     MOVEL''       HR2,B
     C           B         IFLE 1000
     C                     MOVEL''       HR4,B
     C                     MOVEL''       HR6,B
     C                     END
     C                     END
      *
     C           STP1      TAG
     C                     SETOF                     01
     C                     READ FCEPP011                 01
     C           *IN01     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     GOTO STP1
     C                     END
     C           A2TEHI    IFNE 'G'
     C                     GOTO STP1
     C                     END
      *
     C*------------------------------------------------------*
     C* CHECK FILES FOR SETTING QTY 3 MONTHS                 *
     C*------------------------------------------------------*
     C                     MOVEL*BLANK    W@ZANM 15
     C                     Z-ADD0         W@KAZI  52
     C                     Z-ADD0         W@STAT  60
     C                     Z-ADD0         W@END   60
     C                     Z-ADD0         W@QTY   90
     C           KEY1      CHAINABMPPD11             73
     C           *IN73     IFEQ '0'
     C           DDSKJY    ANDEQ'D'
     C           DDSKHZ    ANDLE*DATE
     C                     SETON                     73
     C                     ENDIF
     C           *IN73     IFEQ '0'
     C                     MOVELDDZANM    W@ZANM
     C                     Z-ADDDDKAZI    W@KAZI
     C                     Z-ADDDDSTAT    W@STAT
     C                     Z-ADDDDEND     W@END
     C                     Z-ADDDDQTY     W@QTY
     C                     ENDIF
      *
     C                     SETOF                     01
JW1  C                     Z-ADD0         WN0NM   90       MONTH N
     C                     Z-ADD0         WN1NM   90
     C                     Z-ADD0         WN2NM   90
     C                     Z-ADD0         #2GEKN 122
     C                     Z-ADDYYMM      P@DTYM
     C                     CALL 'ABMR49'
     C                     PARM           P@DTYM  60
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           P@KSSU  90
     C                     PARM           P@KTSU  90
     C           KEY2      CHAINABBPL211             01
     C           *IN01     IFEQ '1'
JW1   * MONTH N
 .   C                     Z-ADDP@KTSU    #2GEKN
 .   C           #2GEKN    MULT NCD,1     WN0NM
 .   C           NYM,1     IFGE W@STAT
 .   C           NYM,1     ANDLEW@END
 .   C           W@QTY     DIV  20        QTY20   90
 .   C           QTY20     MULT NCD,1     QTY20
 .   C                     ADD  QTY20     WN0NM
 .   C                     ENDIF
 .   C           WN0NM     IFLT 0
 .   C                     Z-ADD0         WN0NM
JW1  C                     ENDIF
      * MSK 2007.11.02
     C*****      A2GEKN    DIV  20        #2GEKN
     C                     Z-ADDP@KTSU    #2GEKN
     C           #2GEKN    MULT NCD,2     WN1NM
     C           NYM,2     IFGE W@STAT
     C           NYM,2     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT NCD,2     QTY20
     C                     ADD  QTY20     WN1NM
     C                     ENDIF
     C           WN1NM     IFLT 0
     C                     Z-ADD0         WN1NM
     C                     ENDIF
      *
     C           #2GEKN    MULT NCD,3     WN2NM
     C           NYM,3     IFGE W@STAT
     C           NYM,3     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT NCD,3     QTY20
     C                     ADD  QTY20     WN2NM
     C                     ENDIF
     C           WN2NM     IFLT 0
     C                     Z-ADD0         WN2NM
     C                     ENDIF
     C**                   Z-ADDA2GEKN    WN1NM
     C**                   Z-ADDA2GEKN    WN2NM
      *---------*
     C                     ELSE
      *
     C           U1NGKB    IFEQ 'N'
JW1  C                     Z-ADDU1NNNM    WN0NM
     C                     Z-ADDU1N1NM    WN1NM
     C                     Z-ADDU1N2NM    WN2NM
     C                     ELSE
JW1  C                     Z-ADDU1SNNM    WN0NM
     C                     Z-ADDU1S1NM    WN1NM
     C                     Z-ADDU1S2NM    WN2NM
     C                     END
      *
     C****       A2GEKN    DIV  20        #2GEKN
      *
JW1  C                     Z-ADDP@KTSU    #2GEKN
 .   C           #2GEKN    MULT NCD,1     WN0NM
 .   C           NYM,1     IFGE W@STAT
 .   C           NYM,1     ANDLEW@END
 .   C           W@QTY     DIV  20        QTY20   90
 .   C           QTY20     MULT NCD,1     QTY20
 .   C                     ADD  QTY20     WN0NM
JW1  C                     ENDIF
      *
     C                     Z-ADDP@KTSU    #2GEKN
     C           #2GEKN    MULT NCD,2     WN1NM
     C           NYM,2     IFGE W@STAT
     C           NYM,2     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT NCD,2     QTY20
     C                     ADD  QTY20     WN1NM
     C                     ENDIF
      *
     C           #2GEKN    MULT NCD,3     WN2NM
     C           NYM,3     IFGE W@STAT
     C           NYM,3     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT NCD,3     QTY20
     C                     ADD  QTY20     WN2NM
     C                     ENDIF
      *
     C                     END
      *
     C                     Z-ADD0         WWNZSU  90
     C           KEY1      SETLLMBEPL021
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY1      READEMBEPL021                 01
     C           *IN01     IFEQ '0'
     C                     ADD  F2GOKE    WWNZSU
     C                     END
     C  N01                END
      * MSK 2007.11.02
     C***        A2GEKN    DIV  20        #2GEKN
     C*****                Z-ADDP@KTSU    #2GEKN
     C*JW1                 Z-ADDA2GEKN    NAI,1
     C******     #2GEKN    MULT NCD,1     NAI,1
     C*JW1       NYM,1     IFGE W@STAT
     C* .        NYM,1     ANDLEW@END
     C* .        W@QTY     DIV  20        QTY20   90
     C* .        QTY20     MULT NCD,1     QTY20
     C* .                  ADD  QTY20     NAI,1
     C* .                  ENDIF
     C* .        NAI,1     IFLT 0
     C* .                  Z-ADD0         NAI,1
     C*JW1                 ENDIF
      *---------*
JW1  C           WN0NM     IFLT 0
 .   C                     Z-ADD0         WN0NM
JW1  C                     ENDIF
     C           WN1NM     IFLT 0
     C                     Z-ADD0         WN1NM
     C                     ENDIF
     C           WN2NM     IFLT 0
     C                     Z-ADD0         WN2NM
     C                     ENDIF
JW1  C                     Z-ADDWN0NM     NAI,1
     C                     Z-ADDWN1NM     NAI,2
     C                     Z-ADDWN2NM     NAI,3
     C           #2GEKN    MULT HCD,2     NAI,4
     C           #2GEKN    MULT HCD,3     NAI,5
     C           #2GEKN    MULT HCD,4     NAI,6
     C           HYM,2     IFGE W@STAT
     C           HYM,2     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT HCD,2     QTY20
     C                     ADD  QTY20     NAI,4
     C                     ENDIF
     C           HYM,3     IFGE W@STAT
     C           HYM,3     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT HCD,3     QTY20
     C                     ADD  QTY20     NAI,5
     C                     ENDIF
     C           HYM,4     IFGE W@STAT
     C           HYM,4     ANDLEW@END
     C           W@QTY     DIV  20        QTY20   90
     C           QTY20     MULT HCD,4     QTY20
     C                     ADD  QTY20     NAI,6
     C                     ENDIF
      *
     C                     Z-ADD1         A       10
     C           1         DO   6         A
     C           NAI,A     MULT A2SOZI    WG2    162
     C           WG2       DIV  1000      JIU,A     H
     C                     END
     C                     Z-ADD1         E       40
     C           WKEY      LOKUPHR3,E                    01
     C           *IN01     IFEQ '0'
     C******               EXSR #IZA
     C******               EXSR #BTB1
     C******               EXSR #BTB41
     C                     ENDIF
      *
     C           WWNZSU    MULT A2SOZI    WG2       H
     C           WG2       DIV  1000      WWJISU  90H
      *
     C*------------------------------------*
     C* LIST COMPONENTS SUMMARY            *
     C*------------------------------------*
     C                     Z-ADD1         A
     C           1         DO   4         A
     C           HIN,A     IFNE *BLANK
      *
     C                     MOVE HIN,A     CKHIN
     C                     Z-ADD0         CSIRE
      *
     C                     SETOF                     01
     C           KEY4      CHAINAKEPL011             01
     C           *IN01     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
      *
     C           *IN01     IFEQ '0'
     C                     MOVELM3HZ01    WWHZ01  80
     C           WWHZ01    IFGT *DATE
     C                     Z-ADDM3QB01    CSIRE
     C                     ELSE
     C                     Z-ADDM3BM01    CSIRE
     C                     END
     C                     END
      *
     C                     SETOF                     01
     C                     Z-ADD1         B       40
     C           CKEY      LOKUPHR1,B                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR2,B     WK
%0003 *
     C           NAI,1     MULT SYK,A     WNAI    90
     C                     ADD  WNAI      WNA1
     C           NAI,2     MULT SYK,A     WNAI
     C                     ADD  WNAI      WNA2
     C           NAI,3     MULT SYK,A     WNAI
     C                     ADD  WNAI      WNA3
     C           NAI,4     MULT SYK,A     WNAI
     C                     ADD  WNAI      WNA4
     C           NAI,5     MULT SYK,A     WNAI
     C                     ADD  WNAI      WNA5
     C           NAI,6     MULT SYK,A     WNAI
     C                     ADD  WNAI      WNA6
      *
     C*                    ADD  NAI,1     WNA1
     C*                    ADD  NAI,2     WNA2
     C*                    ADD  NAI,3     WNA3
%0003 *
     C****                 Z-ADD0         WNA4
     C****                 Z-ADD0         WNA5
     C****                 Z-ADD0         WNA6
     C                     ADD  WWNZSU    WNZSU
     C                     MOVE WK        HR2,B
     C                     ELSE
      *
     C                     ADD  1         C       40
     C                     MOVE CKEY      HR1,C
     C                     MOVE HIN,A     WK1
%0003 *
     C           NAI,1     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA1
     C           NAI,2     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA2
     C           NAI,3     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA3
     C           NAI,4     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA4
     C           NAI,5     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA5
     C           NAI,6     MULT SYK,A     WNAI
     C                     Z-ADDWNAI      WNA6
      *
     C*                    Z-ADDNAI,1     WNA1
     C*                    Z-ADDNAI,2     WNA2
     C*                    Z-ADDNAI,3     WNA3
%0003 *
     C****                 Z-ADD0         WNA4
     C****                 Z-ADD0         WNA5
     C****                 Z-ADD0         WNA6
     C                     Z-ADDCSIRE     WSIRE
     C                     Z-ADDWWNZSU    WNZSU
     C                     MOVE WK        HR2,C
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------------*
     C* LIST MATERIALS SUMMARY           *
     C*----------------------------------*
     C                     SETOF                     01
     C                     Z-ADD1         E       40
     C           WKEY      LOKUPHR3,E                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR4,E     WZ
     C                     ADD  JIU,1     WJI1
     C                     ADD  JIU,2     WJI2
     C                     ADD  JIU,3     WJI3
     C                     ADD  JIU,4     WJI4
     C                     ADD  JIU,5     WJI5
     C                     ADD  JIU,6     WJI6
     C***                  Z-ADD0         WJI4
     C***                  Z-ADD0         WJI5
     C***                  Z-ADD0         WJI6
%0002C                     Z-ADD0         @JI
     C                     ADD  WWJISU    WJISU
     C                     MOVE WZ        HR4,E
     C                     ELSE
      *
     C                     ADD  1         D       40
     C                     MOVE WKEY      HR3,D
     C                     MOVE A2ZANM    WZ1
     C                     Z-ADDA2KAZI    WZ2
     C                     Z-ADDJIU,1     WJI1
     C                     Z-ADDJIU,2     WJI2
     C                     Z-ADDJIU,3     WJI3
     C                     Z-ADDJIU,4     WJI4
     C                     Z-ADDJIU,5     WJI5
     C                     Z-ADDJIU,6     WJI6
     C***                  Z-ADD0         WJI4
     C***                  Z-ADD0         WJI5
     C***                  Z-ADD0         WJI6
%0002C                     Z-ADD0         @JI
     C                     Z-ADDA2SIRE    WSIRE1
     C                     Z-ADDWWJISU    WJISU
     C                     MOVE WZ        HR4,D
     C                     END
%0001 *
     C*-------------------------------------------*
     C* LIST MATERIALS SUMMARY (MOTHER MATERIALS) *
     C*-------------------------------------------*
     C           A2ZAIR    IFEQ '01'
     C           A2ZAIR    OREQ '02'
     C           KEY5      KLIST
     C                     KFLD           A2ZANM
     C                     KFLD           A2KAZI
     C                     KFLD           A2SIRE
     C                     KFLD           A2UKER
     C                     SETOF                     55
     C           KEY5      CHAINGKBPL011             55
     C           *IN55     IFEQ '0'
     C           X3SKJY    IFEQ 'D'
     C           X3SKHZ    ANDLE*DATE
     C                     SETON                     55
     C                     ELSE
     C                     MOVE X3BOZN    WBOZN
     C                     Z-ADDX3BOZI    WKAZI
     C                     Z-ADDX3BOUK    WKAUK
     C                     Z-ADDX3BOSI    WKASI
     C                     END
     C                     END
      *
     C           *IN55     IFEQ '0'
     C                     SETOF                     01
     C                     Z-ADD1         G       40
     C           ZKEY      LOKUPHR5,G                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR6,G     WWZ
     C                     ADD  JIU,1     WWJI1
     C                     ADD  JIU,2     WWJI2
     C                     ADD  JIU,3     WWJI3
     C                     ADD  JIU,4     WWJI4
     C                     ADD  JIU,5     WWJI5
     C                     ADD  JIU,6     WWJI6
     C***                  Z-ADD0         WWJI4
     C***                  Z-ADD0         WWJI5
     C***                  Z-ADD0         WWJI6
%0002C                     Z-ADD0         @@JI
     C                     ADD  WWJISU    WWWJIS
     C                     MOVE WWZ       HR6,G
     C                     ELSE
      *
     C                     ADD  1         H       40
     C                     MOVE ZKEY      HR5,H
     C                     MOVE X3BOZN    WWZ1
     C                     Z-ADDX3BOZI    WWZ2
     C                     Z-ADDJIU,1     WWJI1
     C                     Z-ADDJIU,2     WWJI2
     C                     Z-ADDJIU,3     WWJI3
     C                     Z-ADDJIU,4     WWJI4
     C                     Z-ADDJIU,5     WWJI5
     C                     Z-ADDJIU,6     WWJI6
     C***                  Z-ADD0         WWJI4
     C***                  Z-ADD0         WWJI5
     C***                  Z-ADD0         WWJI6
%0002C                     Z-ADD0         @@JI
     C                     Z-ADDX3BOSI    WWSIRE
     C                     Z-ADDWWJISU    WWWJIS
     C                     MOVE WWZ       HR6,H
     C                     END
     C                     END
     C                     END
%0001 *
     C                     GOTO STP1
     C                     END
%0002 *
     C*----------------------------------*
     C* REFER FORECAST QTY MASTER        *
     C*----------------------------------*
     C                     SETOF                     20
     C           YY        SETLLABBPL401
     C                     DO   *HIVAL
     C           YY        READEABBPL401                 20
     C           *IN20     IFEQ '0'
%0004C           A4SKJY    IFEQ 'D'
%0004C           A4SKHZ    ANDLE*DATE
%0004C                     ELSE
     C                     Z-ADD0         K       20
     C           MM        SUB  1         J       20
      * FINISH MATERIAL
     C           A4PTCD    IFEQ 'W'
     C           MM        DO   12
     C                     ADD  1         K
     C           K         IFGT 6
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         J
     C           JRY,J     IFNE 0
     C                     SETOF                     01
     C                     Z-ADD1         E       40
     C           FKEY      LOKUPHR3,E                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR4,E     WZ
     C                     ADD  JRY,J     WJI,K
     C                     ADD  JRY,J     @JI,K
     C                     MOVE WZ        HR4,E
     C                     ELSE
      *
     C                     MOVEL*BLANK    #WZ1
     C                     MOVEL*ALL'0'   #WZ2
     C                     ADD  1         D       40
     C                     MOVE FKEY      HR3,D
     C                     MOVE A4ZAIS    WZ1
     C                     Z-ADDA4ZAIK    WZ2
     C                     Z-ADDJRY,J     WJI,K
     C                     Z-ADDJRY,J     @JI,K
     C                     Z-ADDA4SIRE    WSIRE1
     C                     MOVE WZ        HR4,D
     C                     END
     C                     END
     C                     ENDDO
     C                     END
      * MOTHER MATERIAL
     C           A4PTCD    IFEQ 'R'
     C                     MOVE A4ZAIS    W4ZAIS
     C                     Z-ADDA4ZAIK    W4ZAIK
     C                     Z-ADDA4UKEI    W4UKEI
     C                     Z-ADDA4SIRE    W4SIRE
     C           MM        DO   12
     C                     ADD  1         K
     C           K         IFGT 6
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         J
     C           JRY,J     IFNE 0
     C                     SETOF                     01
     C                     Z-ADD1         G       40
     C           XKEY      LOKUPHR5,G                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR6,G     WWZ
     C                     ADD  JRY,J     WWJI,K
     C                     ADD  JRY,J     @@JI,K
     C                     MOVE WWZ       HR6,G
     C                     ELSE
      *
     C                     MOVEL*BLANK    #WWZ1
     C                     MOVEL*ALL'0'   #WWZ2
     C                     ADD  1         H       40
     C                     MOVE XKEY      HR5,H
     C                     MOVE A4ZAIS    WWZ1
     C                     Z-ADDA4ZAIK    WWZ2
     C                     Z-ADDJRY,J     WWJI,K
     C                     Z-ADDJRY,J     @@JI,K
     C                     Z-ADDA4SIRE    WWSIRE
     C                     MOVE WWZ       HR6,H
     C                     END
     C                     END
     C                     ENDDO
     C                     END
%0004C                     END
      *
     C                     END
     C  N20                ENDDO
      * YY+1
     C           MM        SUB  7         ZZ      20
     C           ZZ        IFGT 0
     C           YY        ADD  1         NYY     40
     C                     SETOF                     20
     C           NYY       SETLLABBPL401
     C                     DO   *HIVAL
     C           NYY       READEABBPL401                 20
     C           *IN20     IFEQ '0'
%0004C           A4SKJY    IFEQ 'D'
%0004C           A4SKHZ    ANDLE*DATE
%0004C                     ELSE
     C           6         SUB  ZZ        K       20
     C                     Z-ADD0         Z       20
      * FINISH MATERIAL
     C           A4PTCD    IFEQ 'W'
     C           1         DO   ZZ
     C                     ADD  1         K
     C           K         IFGT 6
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         Z
     C           JRY,Z     IFNE 0
     C                     SETOF                     01
     C                     Z-ADD1         E       40
     C           FKEY      LOKUPHR3,E                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR4,E     WZ
     C                     ADD  JRY,Z     WJI,K
     C                     ADD  JRY,Z     @JI,K
     C                     MOVE WZ        HR4,E
     C                     ELSE
      *
     C                     MOVEL*BLANK    #WZ1
     C                     MOVEL*ALL'0'   #WZ2
     C                     ADD  1         D       40
     C                     MOVE FKEY      HR3,D
     C                     MOVE A4ZAIS    WZ1
     C                     Z-ADDA4ZAIK    WZ2
     C                     Z-ADDJRY,Z     WJI,K
     C                     Z-ADDJRY,Z     @JI,K
     C                     Z-ADDA4SIRE    WSIRE1
     C                     MOVE WZ        HR4,D
     C                     END
     C                     END
     C                     ENDDO
     C                     END
      * MOTHER MATERIAL
     C           A4PTCD    IFEQ 'R'
     C                     MOVE A4ZAIS    W4ZAIS
     C                     Z-ADDA4ZAIK    W4ZAIK
     C                     Z-ADDA4UKEI    W4UKEI
     C                     Z-ADDA4SIRE    W4SIRE
     C           1         DO   ZZ
     C                     ADD  1         K
     C           K         IFGT 6
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         Z
     C           JRY,Z     IFNE 0
     C                     SETOF                     01
     C                     Z-ADD1         G       40
     C           XKEY      LOKUPHR5,G                    01
     C           *IN01     IFEQ '1'
     C                     MOVE HR6,G     WWZ
     C                     ADD  JRY,Z     WWJI,K
     C                     ADD  JRY,Z     @@JI,K
     C                     MOVE WWZ       HR6,G
     C                     ELSE
      *
     C                     MOVEL*BLANK    #WWZ1
     C                     MOVEL*ALL'0'   #WWZ2
     C                     ADD  1         H       40
     C                     MOVE XKEY      HR5,H
     C                     MOVE A4ZAIS    WWZ1
     C                     Z-ADDA4ZAIK    WWZ2
     C                     Z-ADDJRY,Z     WWJI,K
     C                     Z-ADDJRY,Z     @@JI,K
     C                     Z-ADDA4SIRE    WWSIRE
     C                     MOVE WWZ       HR6,H
     C                     END
     C                     END
     C                     ENDDO
     C                     END
%0004C                     END
      *
     C                     END
     C  N20                ENDDO
     C                     END
%0002 *
     C*------------------------------------------*
     C* LIST UP COMPONENTS SUMMARY               *
     C*------------------------------------------*
     C                     Z-ADD1         B
     C           1         DO   2000      B
     C                     MOVELHR2,B     WHR2    1
     C           WHR2      IFEQ ''
     C                     GOTO STP3
     C                     END
     C                     MOVE HR2,B     WK
      *
     C*******    WNA1      DIV  HCD,1     WNAIJ   90H
     C           WNA1      DIV  20        WNAIJ   90H
     C***        WNAIJ     MULT HCD,2     WNA4
     C***        WNAIJ     MULT HCD,3     WNA5
     C***        WNAIJ     MULT HCD,4     WNA6
      *
     C                     EXCPTDK1
     C                     END
     C           STP3      TAG
      *
     C*----------------------------------------*
     C* LIST UP MATERIALS SUMMARY              *
     C*----------------------------------------*
     C                     Z-ADD1         E
     C           1         DO   1000      E
     C                     MOVELHR4,E     WHR4    1
     C           WHR4      IFEQ ''
     C                     GOTO STP4
     C                     END
     C                     MOVE HR4,E     WZ
     C                     MOVELWZ1       @2ZANM 15
     C                     Z-ADDWZ2       @2KAZI  52
     C                     EXSR #IZA
     C                     EXSR #BTB41
     C           WJI1      IFLT 0
     C                     Z-ADD0         WJI1
     C                     ENDIF
     C           WJI2      IFLT 0
     C                     Z-ADD0         WJI2
     C                     ENDIF
     C           WJI3      IFLT 0
     C                     Z-ADD0         WJI3
     C                     ENDIF
     C           WJI4      IFLT 0
     C                     Z-ADD0         WJI4
     C                     ENDIF
     C           WJI5      IFLT 0
     C                     Z-ADD0         WJI5
     C                     ENDIF
     C           WJI6      IFLT 0
     C                     Z-ADD0         WJI6
     C                     ENDIF
      *
     C******     WJI1      DIV  HCD,1     WJURY   90H
     C           WJI1      DIV  20        WJURY   90H
%0002 *
     C           WJURY     MULT HCD,2     #JI4    90
     C           WJURY     MULT HCD,3     #JI5    90
     C           WJURY     MULT HCD,4     #JI6    90
     C***                  ADD  #JI4      WJI4
     C***                  ADD  #JI5      WJI5
     C***                  ADD  #JI6      WJI6
%0002 *
     C                     EXCPTDZ1
     C                     END
     C           STP4      TAG
%0001C*----------------------------------------------*
     C* LIST UP MATERIALS SUMMARY (MOTHER MATERIAL)  *
     C*----------------------------------------------*
     C                     Z-ADD1         G
     C           1         DO   1000      G
     C                     MOVELHR6,G     WHR6    1
     C           WHR6      IFEQ ''
     C                     GOTO STP5
     C                     END
     C                     MOVE HR6,G     WWZ
     C                     MOVELWWZ1      @2ZANM 15
     C                     Z-ADDWWZ2      @2KAZI  52
     C                     EXSR #IZA
     C                     EXSR #BTB42
     C           WWJI1     IFLT 0
     C                     Z-ADD0         WWJI1
     C                     ENDIF
     C           WWJI2     IFLT 0
     C                     Z-ADD0         WWJI2
     C                     ENDIF
     C           WWJI3     IFLT 0
     C                     Z-ADD0         WWJI3
     C                     ENDIF
     C           WWJI4     IFLT 0
     C                     Z-ADD0         WWJI4
     C                     ENDIF
     C           WWJI5     IFLT 0
     C                     Z-ADD0         WWJI5
     C                     ENDIF
     C           WWJI6     IFLT 0
     C                     Z-ADD0         WWJI6
     C                     ENDIF
      *
     C******     WWJI1     DIV  HCD,1     WWJURY  90H
     C           WWJI1     DIV  20        WWJURY  90H
%0002 *
     C           WWJURY    MULT HCD,2     ##JI4   90
     C           WWJURY    MULT HCD,3     ##JI5   90
     C           WWJURY    MULT HCD,4     ##JI6   90
     C***                  ADD  ##JI4     WWJI4
     C***                  ADD  ##JI5     WWJI5
     C***                  ADD  ##JI6     WWJI6
%0002 *
     C                     EXCPTDZ2
     C                     END
     C           STP5      TAG
%0001 *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------*
      *                                              *
      *----------------------------------------------*
     CSR         #IZA      BEGSR
      *
     C           KEYIZA    KLIST
     C                     KFLD           @2ZANM
     C                     KFLD           @2KAZI  52
     C                     Z-ADD0         W@TKJR  50
     C           KEYIZA    SETLLIZAPL011
     C           KEYIZA    READEIZAPL011                 74
     C           *IN74     DOWEQ'0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     Z-ADDZCTKJR    W@TKJR
     C                     ENDIF
     C                     ENDIF
     C           KEYIZA    READEIZAPL011                 74
     C                     ENDDO
      *
     CSR         EIZA      ENDSR
      *----------------------------------------------*
      *                                              *
      *----------------------------------------------*
     CSR         #BTB1     BEGSR
      *
     C           KEYBT1    KLIST
     C                     KFLD           W8KAYM  60
     C                     KFLD           A2ZANM
     C                     KFLD           @2KAZI  52
     C                     Z-ADD1         AB      20
     C           AB        DOWLE6
      *
     C                     SELEC
     C           AB        WHLE 3
     C                     Z-ADDNYM,AB    W8KAYM
     C           AB        WHEQ 4
     C                     Z-ADDHYM,2     W8KAYM
     C           AB        WHEQ 5
     C                     Z-ADDHYM,3     W8KAYM
     C           AB        WHEQ 6
     C                     Z-ADDHYM,4     W8KAYM
     C                     ENDSL
     C           KEYBT1    CHAINBTBPL081             74
     C           *IN74     IFEQ '0'
     C           BTSKJY    ANDEQ'D'
     C           BTSKH8    ANDLE*DATE
     C                     SETON                     74
     C                     ENDIF
     C           *IN74     IFEQ '0'
     C                     EXSR #BTB2
     C                     ENDIF
      *
     C                     ADD  1         AB
     C                     ENDDO
      *
     CSR         EBTB1     ENDSR
      *----------------------------------------------*
      *                                              *
      *----------------------------------------------*
     CSR         #BTB2     BEGSR
      *
     C                     Z-ADD0         PLS     50
     C                     Z-ADD0         MNS     50
     C                     Z-ADD1         AC      30
     C           AC        DOWLE31
     C           HTZ,AC    IFEQ *BLANK
     C                     ADD  HTP,AC    PLS
     C                     ADD  HTM,AC    MNS
     C                     ENDIF
     C                     ADD  1         AC
     C                     ENDDO
      *
     C           PLS       MULT W@TKJR    PLSJU   90
     C           MNS       MULT W@TKJR    MNSJU   90
     C                     ADD  PLSJU     JIU,AB
     C                     SUB  MNSJU     JIU,AB
     C           JIU,AB    IFLT 0
     C******               Z-ADD0         JIU,AB
     C                     ENDIF
      *
     CSR         EBTB2     ENDSR
      *----------------------------------------------*
      *                                              *
      *----------------------------------------------*
     CSR         #BTB41    BEGSR
      *
     C           KEYBT4    KLIST
     C                     KFLD           @2ZANM
     C                     KFLD           @2KAZI  52
     C                     Z-ADD0         MNS     50
     C           KEYBT4    CHAINBTBPP411             74
     C           *IN74     IFEQ '0'
     C           B4SKJY    ANDEQ'D'
     C           B4SKH8    ANDLE*DATE
     C                     SETON                     74
     C                     ENDIF
     C           *IN74     IFEQ '0'
     C                     Z-ADDB4MAIS    MNS
     C                     ENDIF
     C           MNS       MULT W@TKJR    MNSJU   90
      *
     C           MNSJU     IFGT 0
     C           WJI1      IFGE MNSJU
     C                     SUB  MNSJU     WJI1
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI1      MNSJU
     C                     Z-ADD0         WJI1
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WJI2      IFGE MNSJU
     C                     SUB  MNSJU     WJI2
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI2      MNSJU
     C                     Z-ADD0         WJI2
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WJI3      IFGE MNSJU
     C                     SUB  MNSJU     WJI3
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI3      MNSJU
     C                     Z-ADD0         WJI3
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WJI4      IFGE MNSJU
     C                     SUB  MNSJU     WJI4
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI4      MNSJU
     C                     Z-ADD0         WJI4
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WJI5      IFGE MNSJU
     C                     SUB  MNSJU     WJI5
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI5      MNSJU
     C                     Z-ADD0         WJI5
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WJI6      IFGE MNSJU
     C                     SUB  MNSJU     WJI6
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WJI6      MNSJU
     C                     Z-ADD0         WJI6
     C                     ENDIF
     C                     ENDIF
      *
     CSR         EBTB41    ENDSR
      *----------------------------------------------*
      *                                              *
      *----------------------------------------------*
     CSR         #BTB42    BEGSR
      *
     C                     Z-ADD0         MNS     50
     C           KEYBT4    CHAINBTBPP411             74
     C           *IN74     IFEQ '0'
     C           B4SKJY    ANDEQ'D'
     C           B4SKH8    ANDLE*DATE
     C                     SETON                     74
     C                     ENDIF
     C           *IN74     IFEQ '0'
     C                     Z-ADDB4MAIS    MNS
     C                     ENDIF
     C           MNS       MULT W@TKJR    MNSJU   90
      *
     C           MNSJU     IFGT 0
     C           WWJI1     IFGE MNSJU
     C                     SUB  MNSJU     WWJI1
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI1     MNSJU
     C                     Z-ADD0         WWJI1
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WWJI2     IFGE MNSJU
     C                     SUB  MNSJU     WWJI2
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI2     MNSJU
     C                     Z-ADD0         WWJI2
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WWJI3     IFGE MNSJU
     C                     SUB  MNSJU     WWJI3
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI3     MNSJU
     C                     Z-ADD0         WWJI3
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WWJI4     IFGE MNSJU
     C                     SUB  MNSJU     WWJI4
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI4     MNSJU
     C                     Z-ADD0         WWJI4
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WWJI5     IFGE MNSJU
     C                     SUB  MNSJU     WWJI5
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI5     MNSJU
     C                     Z-ADD0         WWJI5
     C                     ENDIF
     C                     ENDIF
      *
     C           MNSJU     IFGT 0
     C           WWJI6     IFGE MNSJU
     C                     SUB  MNSJU     WWJI6
     C                     Z-ADD0         MNSJU
     C                     ELSE
     C                     SUB  WWJI6     MNSJU
     C                     Z-ADD0         WWJI6
     C                     ENDIF
     C                     ENDIF
      *
     CSR         EBTB42    ENDSR
      *
     OABBWP131E                DZ1
%0002O                         WZ       129
      *
     OABBWP132E                DK1
     O                         WK        79
      *
     OABBWP133E                DZ2
%0002O                         WWZ      129
