     H            Y.
     F** ABBRSC *********************************************
     F*Ｎ月からＮ＋１、Ｎ＋２月を算出する　ＹＹＹＹＭＭ   *
     F* T.SAKASHITA 2010.07.28                              *
     F*-----------------------------------------------------*
JW   F* THIS PGM WAS COPIED TO UTLR02B
     F** ABBRSB *********************************************
      * 日付（６桁）
     I            DS
     I                                        1   6 WKYMD6
     I                                        1   4 WKYM
     I                                        5   6 WKDD
      * 日付（８桁）
     I            DS
     I                                        1   80W$YMD
     I                                        1   60W$YM
     I                                        1   40W$YY
     I                                        5   60W$MM
     I                                        7   80W$DD
     C*
     C           *ENTRY    PLIST
     C                     PARM           P@N0    6        N
     C                     PARM           P@N1    6        N-1
     C                     PARM           P@N2    6        N-2
     C*   ｎ月、ｎ＋１月、ｎ＋２月を計算する..............
     C*
     C                     MOVELP@N0      WKYMD8  8
     C                     MOVE '01'      WKYMD8
     C*
     C                     MOVE WKYMD8    W$YMD
     C                     Z-ADDW$YM      $$N     60       ｎ月
     C*
     C                     ADD  1         W$MM
     C           W$MM      IFGT 12
     C                     Z-ADD1         W$MM
     C                     ADD  1         W$YY
     C                     ENDIF
     C                     Z-ADDW$YM      $$N1    60       ｎ＋１月
     C                     MOVE $$N1      P@N1             ｎ＋１月
     C*
     C                     ADD  1         W$MM
     C           W$MM      IFGT 12
     C                     Z-ADD1         W$MM
     C                     ADD  1         W$YY
     C                     ENDIF
     C                     Z-ADDW$YM      $$N2    60       ｎ＋２月
     C                     MOVE $$N2      P@N2             ｎ＋２月
     C*
     C                     SETON                     LR
     C                     RETRN
