     H            Y.
     F** ABBR63 *****************************************
     F*  CREATE FORECAST DATA (ABBPP01) FROM ABVPP25    *
     F*  (COPIED FROM ABAR32)                           *
     F*  J.WATANABE 2017.06.09                          *
     F***************************************************
     FABAWP42 IF  F     318            DISK
     FFCCPL11 UF  E           K        DISK                      A
     FABBPL01 UF  E           K        DISK                      A
     FFCCNP32 UF  F      10            DISK
     FFCCPL32 UF  E           K        DISK
     FFCCPL33 UF  E           K        DISK
     FABBNL01 IF  E           K        DISK                      A
     FFCCPL13 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
TCHK1F*FAAPL02 IF  E           K        DISK
TCHK1F*FAAPL06 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAGDPL31 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FABBPL51 IF  E           K        DISK
TCHK5FMITANKF O   F     300            DISK                      A
     FABAWP72 O   F     384            DISK
     FABAWP32 O   F      37            DISK
     E                    HIZ1       31  2 1             青山稼動日数Nlg
     E                    HIZ2       31  2 1             青山稼動日数N+1
     E                    FNS        31  7 0             日当内示数WORK
     E                    AN2        31  7 0             日当内示数N-2
     E                    AN1        31  7 0             日当内示数N-1
     E                    ANN        31  7 0             日当内示数N
     IABAWP42 AA  01
     I                                        1   40FTOKU
     I                                        5   80FNONY
     I                                        9   9 FNKOJ
     I                                       10  13 FNUKE
     I                                       14  17 FSBAN
     I                                       18  37 FMHIN
     I                                       38  420FSYOS
     I                                       43  43 FNOKN
     I                                       44  520FS1
     I                                    P  53  560W01
     I                                    P  57  600W02
     I                                    P  61  640W03
     I                                    P  65  680W04
     I                                    P  69  720W05
     I                                    P  73  760W06
     I                                    P  77  800W07
     I                                    P  81  840W08
     I                                    P  85  880W09
     I                                    P  89  920W10
     I                                    P  93  960W11
     I                                    P  97 1000W12
     I                                    P 101 1040W13
     I                                    P 105 1080W14
     I                                    P 109 1120W15
     I                                    P 113 1160W16
     I                                    P 117 1200W17
     I                                    P 121 1240W18
     I                                    P 125 1280W19
     I                                    P 129 1320W20
     I                                    P 133 1360W21
     I                                    P 137 1400W22
     I                                    P 141 1440W23
     I                                    P 145 1480W24
     I                                    P 149 1520W25
     I                                    P 153 1560W26
     I                                    P 157 1600W27
     I                                    P 161 1640W28
     I                                    P 165 1680W29
     I                                    P 169 1720W30
     I                                    P 173 1760W31
     I                                      177 1850FS2
     I                                      186 1940FS3
     I                                      195 2030FS4
     I                                      204 2120FS5
JW1  I                                      213 2210FS6
     I                                      222 2300FS7
     I******  00/05/04
     I******                                195 204 FUTKR
     IFCCNP32 BB  13
     I                                        1   6 B4PROG
     I            DS
     I                                        1 2170FNS
     I                                        1   70W01
     I                                        8  140W02
     I                                       15  210W03
     I                                       22  280W04
     I                                       29  350W05
     I                                       36  420W06
     I                                       43  490W07
     I                                       50  560W08
     I                                       57  630W09
     I                                       64  700W10
     I                                       71  770W11
     I                                       78  840W12
     I                                       85  910W13
     I                                       92  980W14
     I                                       99 1050W15
     I                                      106 1120W16
     I                                      113 1190W17
     I                                      120 1260W18
     I                                      127 1330W19
     I                                      134 1400W20
     I                                      141 1470W21
     I                                      148 1540W22
     I                                      155 1610W23
     I                                      162 1680W24
     I                                      169 1750W25
     I                                      176 1820W26
     I                                      183 1890W27
     I                                      190 1960W28
     I                                      197 2030W29
     I                                      204 2100W30
     I                                      211 2170W31
     I            DS
     I                                        1 2170ANN
     I                                        1   70Q5NN01
     I                                        8  140Q5NN02
     I                                       15  210Q5NN03
     I                                       22  280Q5NN04
     I                                       29  350Q5NN05
     I                                       36  420Q5NN06
     I                                       43  490Q5NN07
     I                                       50  560Q5NN08
     I                                       57  630Q5NN09
     I                                       64  700Q5NN10
     I                                       71  770Q5NN11
     I                                       78  840Q5NN12
     I                                       85  910Q5NN13
     I                                       92  980Q5NN14
     I                                       99 1050Q5NN15
     I                                      106 1120Q5NN16
     I                                      113 1190Q5NN17
     I                                      120 1260Q5NN18
     I                                      127 1330Q5NN19
     I                                      134 1400Q5NN20
     I                                      141 1470Q5NN21
     I                                      148 1540Q5NN22
     I                                      155 1610Q5NN23
     I                                      162 1680Q5NN24
     I                                      169 1750Q5NN25
     I                                      176 1820Q5NN26
     I                                      183 1890Q5NN27
     I                                      190 1960Q5NN28
     I                                      197 2030Q5NN29
     I                                      204 2100Q5NN30
     I                                      211 2170Q5NN31
     I            DS
     I                                        1 2170AN1
     I                                        1   70Q5N101
     I                                        8  140Q5N102
     I                                       15  210Q5N103
     I                                       22  280Q5N104
     I                                       29  350Q5N105
     I                                       36  420Q5N106
     I                                       43  490Q5N107
     I                                       50  560Q5N108
     I                                       57  630Q5N109
     I                                       64  700Q5N110
     I                                       71  770Q5N111
     I                                       78  840Q5N112
     I                                       85  910Q5N113
     I                                       92  980Q5N114
     I                                       99 1050Q5N115
     I                                      106 1120Q5N116
     I                                      113 1190Q5N117
     I                                      120 1260Q5N118
     I                                      127 1330Q5N119
     I                                      134 1400Q5N120
     I                                      141 1470Q5N121
     I                                      148 1540Q5N122
     I                                      155 1610Q5N123
     I                                      162 1680Q5N124
     I                                      169 1750Q5N125
     I                                      176 1820Q5N126
     I                                      183 1890Q5N127
     I                                      190 1960Q5N128
     I                                      197 2030Q5N129
     I                                      204 2100Q5N130
     I                                      211 2170Q5N131
     I            DS
     I                                        1 2170AN2
     I                                        1   70Q5N201
     I                                        8  140Q5N202
     I                                       15  210Q5N203
     I                                       22  280Q5N204
     I                                       29  350Q5N205
     I                                       36  420Q5N206
     I                                       43  490Q5N207
     I                                       50  560Q5N208
     I                                       57  630Q5N209
     I                                       64  700Q5N210
     I                                       71  770Q5N211
     I                                       78  840Q5N212
     I                                       85  910Q5N213
     I                                       92  980Q5N214
     I                                       99 1050Q5N215
     I                                      106 1120Q5N216
     I                                      113 1190Q5N217
     I                                      120 1260Q5N218
     I                                      127 1330Q5N219
     I                                      134 1400Q5N220
     I                                      141 1470Q5N221
     I                                      148 1540Q5N222
     I                                      155 1610Q5N223
     I                                      162 1680Q5N224
     I                                      169 1750Q5N225
     I                                      176 1820Q5N226
     I                                      183 1890Q5N227
     I                                      190 1960Q5N228
     I                                      197 2030Q5N229
     I                                      204 2100Q5N230
     I                                      211 2170Q5N231
     I            DS
     I                                        1   80B4SKHZ
     I                                        1   40B4SKYY
     I                                        5   60B4SKMM
     I                                        7   80B4SKDD
     I            DS
     I                                        1   80B4KOHZ
     I                                        1   40B4KOYY
     I                                        5   60B4KOMM
     I                                        7   80B4KODD
     I            DS
     I                                        1   60B4TIME
     I                                        1   40B4KOTM
     I                                        1   20B4KOJI
     I                                        3   40B4KOFN
     I            DS
     I                                        1  20 B4MHIN
     I                                        1   5 B4MHN1
     I                                        6  10 B4MHN2
     I                                       11  15 B4MHN3
     I                                       16  20 B4MHN4
     I                                       11  11 WMHN4
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
     I            DS
     I                                        1  12 B4SHIN
     I                                        1   5 B4SHN1
     I                                        6  10 B4SHN2
     I                                       11  12 B4SHN3
     I            DS
     I                                        1   80B4SRHZ
     I                                        1   40B4SRYY
     I                                        5   60B4SRMM
     I                                        7   80B4SRDD
     I            DS
     I                                        1   80B4HUHZ
     I                                        1   40B4HUYY
     I                                        5   60B4HUMM
     I                                        7   80B4HUDD
     I            DS
     I                                        1   4 B4NKAS
     I                                        1   1 B4NOHI
     I                                        2   3 B4NOKI
     I                                        4   4 B4NOGO
     I            DS
     I                                        1   60B4NNHZ
     I                                        1   40B4NNYY
     I                                        5   60B4NNMM
     I            DS
     I                                        1   60B4N1HZ
     I                                        1   40B4N1YY
     I                                        5   60B4N1MM
     I            DS
     I                                        1   60B4N2HZ
     I                                        1   40B4N2YY
     I                                        5   60B4N2MM
     I            DS
     I                                        1  12 B4HIBN
     I                                        1   5 B4HIN1
     I                                        6  10 B4HIN2
     I                                       11  12 B4HIN3
     I            DS
     I                                        1   80B4KNHZ
     I                                        1   40B4KNYY
     I                                        5   60B4KNMM
     I                                        7   80B4KNDD
     I            DS
     I                                        1   80B4GNHZ
     I                                        1   40B4GNYY
     I                                        5   60B4GNMM
     I                                        7   80B4GNDD
     I            DS
     I                                        1   80B4TAHZ
     I                                        1   40B4TAYY
     I                                        5   60B4TAMM
     I                                        7   80B4TADD
     I            DS
     I                                        1   80B4URHZ
     I                                        1   40B4URYY
     I                                        5   60B4URMM
     I                                        7   80B4URDD
     I            DS
     I                                        1   60B4MAHZ
     I                                        1   40B4MAYY
     I                                        5   60B4MAMM
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   80B7SKHZ
     I                                        1   40B7SKYY
     I                                        5   60B7SKMM
     I                                        7   80B7SKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   60UYM1
     I                                        1   40UYY1
     I                                        5   60UMM1
     I            DS
     I                                        1   60UYM2
     I                                        1   40UYY2
     I                                        5   60UMM2
     I            DS
     I                                        1   60UYM3
     I                                        1   40UYY3
     I                                        5   60UMM3
     I            DS
     I                                        1   60UYM4
     I                                        1   40UYY4
     I                                        5   60UMM4
     I            DS
     I                                        1   60UYM5
     I                                        1   40UYY5
     I                                        5   60UMM5
     I            DS
     I                                        1   60UDHZ
     I            DS
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   60F8KAYM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I            DS
     I                                        1   80Q5NHHZ
     I                                        1   40Q5NHYY
     I                                        5   60Q5NHMM
     I                                        7   80Q5NHDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   60A2TAYM
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
TCHK5 *
TCHK5I            DS
TCHK5I                                        1  20 FMHN
TCHK5I                                        1   5 FMHN1
TCHK5I                                        6  10 FMHN2
TCHK5I                                       11  15 FMHN3
TCHK5I                                       16  20 FMHN4
TCHK5I            DS
TCHK5I                                        1  12 FSHN
TCHK5I                                        1   5 FSHN1
TCHK5I                                        6  10 FSHN2
TCHK5I                                       11  12 FSHN3
TCHK5I            DS
TCHK5I                                        1   80FNOYMD
TCHK5I                                        1   40FNOYY
TCHK5I                                        5   60FNOMM
TCHK5I                                        7   80FNODD
      *
     C           HKEY      KLIST
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           TKEY1     KLIST
     C                     KFLD           FTOKU
     C                     KFLD           FNKOJ
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           TKEY2     KLIST
     C                     KFLD           FTOKU
     C                     KFLD           WWNKOJ
     C                     KFLD           UYY1
     C                     KFLD           UMM1
      *
     C           XKEY      KLIST
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           YKEY1     KLIST
     C                     KFLD           FTOKU
     C                     KFLD           FNKOJ
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           YKEY2     KLIST
     C                     KFLD           FTOKU
     C                     KFLD           WWNKOJ
     C                     KFLD           UYY2
     C                     KFLD           UMM2
      *
     C           KEY4      KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
     C                     KFLD           B4SBAN
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     KFLD           B4MHN3
     C                     KFLD           B4MHN4
      *
     C           KEY5      KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
      *
     C           YK1       KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           B4MAST
      *
     C           YK2       KLIST
     C                     KFLD           B4MAMM
     C                     KFLD           XRKBN
      *
     C           KY1       KLIST
     C                     KFLD           B4TOKU
     C                     KFLD           B4NONY
     C                     KFLD           B4NKOJ
     C                     KFLD           B4NUKE
     C                     KFLD           B4SBAN
     C                     KFLD           B4MHN1
     C                     KFLD           B4MHN2
     C                     KFLD           B4MHN3
     C                     KFLD           B4MHN4
      *
     C           KY2       KLIST
     C                     KFLD           Q5SHN1
     C                     KFLD           Q5SHN2
     C                     KFLD           Q5SHN3
      *
TCHK1C*          FKEY      KLIST
TCHK1C*                    KFLD           KTOKU
TCHK1C*                    KFLD           KNONY
TCHK1C*                    KFLD           KMHN1
TCHK1C*                    KFLD           KMHN2
      *
TCHK1C*          B4BUFK    KLIST
TCHK1C*                    KFLD           B4KTOK
TCHK1C*                    KFLD           B4KNOY
TCHK1C*                    KFLD           B4KKOJ
TCHK1C*                    KFLD           B4KUKE
TCHK1C*                    KFLD           B4KHN1
TCHK1C*                    KFLD           B4KHN2
TCHK1C*                    KFLD           B4KHN3
TCHK1C*                    KFLD           B4KHN4
      *
     C           SKEY      KLIST
     C                     KFLD           B4SHN1
     C                     KFLD           B4SHN2
     C                     KFLD           B4SHN3
     C           K#P50     KLIST
     C                     KFLD           FNONY
     C                     KFLD           FNKOJ
     C                     KFLD           FNUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
      *
     C*----------------------------*
     C*  ..内示の年月を求める..  *
     C*----------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PSIGO   1
     C                     PARM           PHIZK   6
     C                     PARM           PDYM    6
     C                     MOVE PHIZK     UYM1
     C                     Z-ADD0         UDHZ
     C                     MOVE PDYM      UDHZ
      *
     C           UMM1      IFEQ 12
     C           UYY1      ADD  1         UYY2
     C                     Z-ADD01        UMM2
     C                     ELSE
     C                     Z-ADDUYY1      UYY2
     C           UMM1      ADD  1         UMM2
     C                     END
      *
     C           UMM2      IFEQ 12
     C           UYY2      ADD  1         UYY3
     C                     Z-ADD01        UMM3
     C                     ELSE
     C                     Z-ADDUYY2      UYY3
     C           UMM2      ADD  1         UMM3
     C                     END
      *
     C           UMM1      IFEQ 01
     C           UYY1      SUB  1         WYY
     C                     Z-ADD12        WMM
     C                     ELSE
     C                     Z-ADDUYY1      WYY
     C           UMM1      SUB  1         WMM
     C                     END
      *
     C                     Z-ADD0         @TOKU1  40
     C                     MOVE *BLANK    @NKOJ1  1
     C                     Z-ADD0         @TOKU2  40
     C                     MOVE *BLANK    @NKOJ2  1
     C                     MOVE *BLANK    @TKBN   1
     C                     MOVE *BLANK    @YKBN   1
      *
      *
     C           STP1      TAG
     C                     SETOF                     020409
     C                     SETOF                     0314
     C                     READ ABAWP42                  02
     C   02                GOTO END
      *
      * CHECK VALIDITY
     C                     MOVELFMHIN     K@MHIN
     C           K#P50     SETGTABBPL51
     C           K#P50     REDPEABBPL51                  90
     C           *IN90     IFEQ *OFF
     C**         BBFLG2    ANDNE*BLANK
JW1  C           BBFLG1    ANDNE*BLANK
     C                     GOTO STP1
     C                     ENDIF
     C*----------------------------------------------*
     C*  ...Ｎ月　稼動日数...                      *
     C*  ...ユーザー稼動日数・青山稼動日数         *
     C*----------------------------------------------*
     C           FTOKU     IFEQ @TOKU1
     C           FNKOJ     ANDEQ@NKOJ1
     C                     ELSE
      *
     C                     Z-ADDFTOKU     @TOKU1
     C                     MOVE FNKOJ     @NKOJ1
      *
     C*--------------------------------------------*
     C*  ...ユーザー　（得意先・納入先工場）...  *
     C*--------------------------------------------*
     C                     SETOF                     03
     C           TKEY1     CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR SBCT1
     C                     ELSE
      *
     C*--------------------------------*
     C*  ...ユーザー　（得意先）...  *
     C*--------------------------------*
     C                     SETOF                     03
     C                     MOVE *BLANK    WWNKOJ  1
     C           TKEY2     CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR SBCT2
     C                     ELSE
      *
     C*----------------*
     C*  ...青山...  *
     C*----------------*
     C           @TKBN     IFNE 'A'
     C                     EXSR SBCT3
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------------------------*
     C*  ...Ｎ＋１月　稼動日数...                  *
     C*  ...ユーザー稼動日数・青山稼動日数         *
     C*----------------------------------------------*
     C           FTOKU     IFEQ @TOKU2
     C           FNKOJ     ANDEQ@NKOJ2
     C                     ELSE
      *
     C                     Z-ADDFTOKU     @TOKU2
     C                     MOVE FNKOJ     @NKOJ2
      *
     C*--------------------------------------------*
     C*  ...ユーザー　（得意先・納入先工場）...  *
     C*--------------------------------------------*
     C                     SETOF                     03
     C           YKEY1     CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR SBCY1
     C                     ELSE
      *
     C*--------------------------------*
     C*  ...ユーザー　（得意先）...  *
     C*--------------------------------*
     C                     SETOF                     03
     C                     MOVE *BLANK    WWNKOJ
     C           YKEY2     CHAINAGDPL311             03
     C           *IN03     IFEQ '0'
     C                     EXSR SBCY2
     C                     ELSE
      *
     C*----------------*
     C*  ...青山...  *
     C*----------------*
     C           @YKBN     IFNE 'A'
     C                     EXSR SBCY3
     C                     END
      *
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD1         B       20
     C           1         DO   31        B
     C           FNS,B     IFNE 0
     C                     GOTO SAP1
     C                     END
     C                     END
      *
     C           FS1       DIV  WCD       WSUR1   70
     C                     MVR            WSUR2   70
     C           WSUR2     IFNE 0
     C                     ADD  1         WSUR1
     C                     END
      *
     C                     Z-ADD1         B
     C           1         DO   31        B
     C           HIZ1,B    IFNE 0
     C           HIZ1,B    IFEQ 1
     C                     Z-ADDWSUR1     FNS,B
     C                     ELSE
     C           WSUR1     DIV  2         FNS,B
     C                     END
     C                     END
     C                     END
     C           SAP1      TAG
      *
     C                     Z-ADDFTOKU     B4TOKU
     C                     Z-ADDFNONY     B4NONY
     C                     MOVE FNKOJ     B4NKOJ
     C                     MOVE FNUKE     B4NUKE
     C                     MOVE FSBAN     B4SBAN
     C                     MOVELFMHIN     B4MHIN
      *
     C                     SETOF                     04
     C                     Z-ADDUYM1      B4MAHZ
     C           KEY4      CHAINFCCPL111             04
      *
     C                     EXSR SUBRTN
      *
     C                     Z-ADDFSYOS     FNSY    50
     C                     Z-ADDFSYOS     WSYOS   50
     C                     MOVE 'C'       FNST    1
      *
B0   C           B4TOKU    IFEQ B4NONY
     C                     MOVE B4NKOJ    B4TKOJ
     C                     MOVE B4NUKE    B4TUKE
     C                     ELSE
     C                     MOVE *BLANK    B4TKOJ
     C                     MOVE *BLANK    B4TUKE
E0   C                     END
      *
     C                     SETOF                     03
     C                     MOVE *BLANK    B4TMEI
     C           B4TOKU    CHAINFGBPL011             03
B0   C           *IN03     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     03
E0   C                     END
B0   C           *IN03     IFEQ '0'
     C                     MOVELB2SMEI    B4TMEI
E0   C                     END
      *
     C                     SETOF                     03
     C                     MOVE *BLANK    B4NMEI
     C           B4NONY    CHAINFGBPL011             03
B0   C           *IN03     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     03
E0   C                     END
B0   C           *IN03     IFEQ '0'
     C                     MOVELB2SMEI    B4NMEI
E0   C                     END
      *
     C                     MOVE *BLANK    B4SKBN
     C                     Z-ADD0         B4SKHZ
     C                     Z-ADD*DATE     B4KOHZ
     C                     TIME           B4TIME
     C                     MOVE *BLANK    B4KONA
     C                     Z-ADDUYM1      B4NNHZ
     C                     Z-ADDUYM2      B4N1HZ
     C                     Z-ADDUYM3      B4N2HZ
     C                     Z-ADDFS1       B4NNNA
     C                     Z-ADDFS2       B4N1NA
     C                     Z-ADDFS3       B4N2NA
     C                     MOVE '*'       B4NAIJ
     C                     MOVE FNOKN     B4NOKN
      *
     C                     SETOF                     03
     C                     Z-ADD0         WHIZK   20
     C                     Z-ADD0         WKAIS   20
     C                     Z-ADD0         WNBIN   20
     C           KEY5      CHAINGADPL111             03
 B0  C           *IN03     IFEQ '0'
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     03
 E0  C                     END
 B0  C           *IN03     IFEQ '0'
     C                     Z-ADDB5HIZK    WHIZK
     C                     Z-ADDB5KAIS    WKAIS
     C                     Z-ADDB5NBIN    WNBIN
 E0  C                     END
      *
     C*----------------------*
     C*  .. FCCPL11 CAHIN..  *
     C*----------------------*
B0   C           *IN04     IFEQ '1'
      *
B1   C           FSYOS     IFEQ 0
     C                     SETOF                     03
     C           SKEY      CHAINFCEPL011             03
B2   C           *IN03     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     03
E2   C                     END
B2   C           *IN03     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    FNSY
     C                     ELSE
     C                     Z-ADDA2SSYS    FNSY
     C                     END
E2   C                     END
E1   C                     END
      *
     C                     Z-ADD1         B4MAST
      *
     C           @SXX1     TAG
     C                     SETOF                     03
     C           YK1       CHAINFCCPL131             03
B1   C           *IN03     IFEQ '0'
      *
     C                     SETOF                     03
     C           1         CHAINFCCNP32              03
B2   C           *IN03     IFEQ '0'
     C                     MOVE *BLANK    XRKBN   1
      *
     C                     SETOF                     03
     C           YK2       CHAINFCCPL331             03
B3   C           *IN03     IFEQ '0'
     C                     Z-ADDB4RECD    B4MAST
     C                     MOVE '*'       B4RKBN
     C                     UPDATFCCPL331
E3   C                     END
      *
     C                     EXCPTUP
E2   C                     END
     C  N03                GOTO @SXX1
X1   C                     ELSE
      *
     C                     SETOF                     03
     C           1         CHAINFCCNP32              03
B2   C           *IN03     IFEQ '0'
     C                     SETOF                     03
     C           YK1       CHAINFCCPL321             03
B3   C           *IN03     IFEQ '0'
     C                     MOVE '*'       B4RKBN
     C                     UPDATFCCPL321
E3   C                     END
      *
     C                     EXCPTUP
E2   C                     END
E1   C                     END
      *
     C                     MOVE *BLANK    B4KANR
     C                     Z-ADD0         B4OSRO
     C                     MOVE *BLANK    B4OTNI
     C                     Z-ADDFNSY      B4NSRO
     C                     MOVE FNST      B4NTNI
     C                     Z-ADD*DATE     B4SRHZ
     C                     MOVE *BLANK    B4NISU
     C                     Z-ADD0         B4UTIS
     C                     Z-ADD0         B4UTI
     C                     Z-ADD0         B4HUHZ
     C                     Z-ADD0         B4UBIN
     C                     MOVE *BLANK    B4BUKN
     C                     MOVE *BLANK    B4UTAN
     C                     MOVE *BLANK    B4NKAS
     C                     MOVE *BLANK    B4SOKN
     C                     Z-ADD0         B4TKMM
     C                     Z-ADD0         B4TKJN
     C                     Z-ADD0         B4TSMM
     C                     Z-ADD0         B4TSJN
     C                     Z-ADD0         B4CARD
     C                     Z-ADD0         B4KAMS
     C                     MOVE *BLANK    B4KASI
     C                     Z-ADD0         B4KAZS
     C                     MOVE *BLANK    B4KUBN
     C                     MOVE *BLANK    B4HIBN
     C                     Z-ADD0         B4URHZ
     C                     Z-ADD0         B4URMS
     C                     MOVE *BLANK    B4SIRE
     C                     MOVE *BLANK    B4SMEI
     C                     MOVE *BLANK    B4SKYU
     C                     MOVE *BLANK    B4BUSY
     C                     MOVE *BLANK    B4RNBN
     C                     MOVE *BLANK    B4KNBS
     C                     Z-ADD0         B4KNHZ
     C                     Z-ADD0         B4KBIN
     C                     Z-ADD0         B4KNMI
     C                     Z-ADD0         B4KINP
     C                     Z-ADD0         B4KSRO
     C                     Z-ADD0         B4KURS
     C                     MOVE *BLANK    B4GNBN
     C                     Z-ADD0         B4GNHZ
     C                     Z-ADD0         B4GBIN
     C                     Z-ADD0         B4GKMI
     C                     Z-ADD0         B4GINP
     C                     Z-ADD0         B4GSRO
     C                     Z-ADD0         B4GURS
     C                     Z-ADD0         B4KAIK
     C                     Z-ADD0         B4RUIK
     C                     Z-ADD0         B4TAHZ
      ***** 00/05/04
TCHK2C                     Z-ADDFTOKU     B4TOKU
TCHK2C                     Z-ADDFNONY     B4NONY
TCHK2C                     MOVE FNKOJ     B4NKOJ
TCHK2C                     MOVE FNUKE     B4NUKE
TCHK2C                     MOVE FSBAN     B4SBAN
TCHK2C                     MOVELFMHIN     B4MHIN
TCHK2C                     Z-ADDUYM1      B4MAHZ
TCHK2 *
     C*****                MOVELFUTKR     B4UTKR
     C                     WRITEFCCPL111
X0   C                     ELSE
      *
B1   C           WSYOS     IFNE 0
     C                     Z-ADDWSYOS     B4NSRO
     C                     MOVE FNST      B4NTNI
E1   C                     END
     C*****
     C*****                MOVELFUTKR     B4UTKR
      *
     C                     UPDATFCCPL111
     C                     END
      *
     C                     SETOF                     03
     C           KY1       CHAINABBPL011             03
      *
     C                     Z-ADDB4TOKU    Q5TOKU
     C                     Z-ADDB4NONY    Q5NONY
     C                     MOVE B4NKOJ    Q5NKOJ
     C                     MOVE B4NKOJ    Q5GKOJ
     C                     MOVE B4NUKE    Q5NUKE
     C                     MOVE B4NUKE    Q5GUKE
     C                     MOVE B4SBAN    Q5SEBN
     C                     MOVE B4MHN1    Q5MHN1
     C                     MOVE B4MHN2    Q5MHN2
     C                     MOVE B4MHN3    Q5MHN3
     C                     MOVE B4MHN4    Q5MHN4
     C                     MOVE B4SHN1    Q5SHN1
     C                     MOVE B4SHN2    Q5SHN2
     C                     MOVE B4SHN3    Q5SHN3
      *
     C           *IN03     IFEQ '1'
     C                     MOVE *BLANK    Q5CHK1
     C                     Z-ADD0         Q5CHS1
     C                     MOVE *BLANK    Q5CHK2
     C                     Z-ADD0         Q5CHS2
     C                     MOVE *BLANK    Q5N2NK
     C                     Z-ADD0         Q5N2NM
     C                     Z-ADD0         AN2
     C                     MOVE *BLANK    Q5N1NK
     C                     Z-ADD0         Q5N1NM
%0001C                     Z-ADD0         Q5NNNM
%0001C                     Z-ADD0         Q5NNOM
%0001C                     Z-ADD0         Q51NNM
%0001C                     Z-ADD0         Q51NOM
%0001C                     Z-ADD0         Q52NNM
%0001C                     Z-ADD0         Q52NOM
     C                     Z-ADD0         AN1
     C                     Z-ADD0         Q5N4GM
     C                     Z-ADD0         Q5N4ND
     C                     Z-ADD0         Q5N3GM
     C                     Z-ADD0         Q5N3ND
     C                     Z-ADD0         Q5N2GM
     C                     Z-ADD0         Q5N2ND
     C                     Z-ADD0         Q5N1GM
     C                     Z-ADD0         Q5N1ND
%0001C                     MOVE *BLANK    Q5NSYR
     C                     END
      *
     C           UYM1      IFLT UDHZ
     C                     MOVE 'N'       Q5N1NK
     C                     MOVE FS1       Q5N1NM
     C                     Z-ADDFNS       AN1
%0001 *
%0001C           Q5NSYR    IFNE '*'
%0001C                     Z-ADDQ5NNNM    Q5NNOM
%0001C                     Z-ADDQ51NNM    Q51NOM
%0001C                     ENDIF
%0001 *
     C                     MOVE 'N'       Q5NNNK
     C                     Z-ADDFS2       Q5NNNM
     C                     Z-ADD0         ANN
      *
     C           FS2       DIV  WDD       WSUR1
     C                     MVR            WSUR2
     C           WSUR2     IFNE 0
     C                     ADD  1         WSUR1
     C                     END
      *
     C                     Z-ADD1         B
     C           1         DO   31        B
     C           HIZ2,B    IFNE 0
     C           HIZ2,B    IFEQ 1
     C                     Z-ADDWSUR1     ANN,B
     C                     ELSE
     C           WSUR1     DIV  2         ANN,B
     C                     END
     C                     END
     C                     END
      *
     C                     MOVE 'N'       Q51NNK
     C                     Z-ADDFS3       Q51NNM
     C                     ELSE
%0001 *
%0001C           Q5NSYR    IFNE '*'
%0001C                     Z-ADDQ5NNNM    Q5NNOM
%0001C                     Z-ADDQ51NNM    Q51NOM
%0001C                     Z-ADDQ52NNM    Q52NOM
%0001C                     ENDIF
%0001 *
     C                     MOVE 'N'       Q5NNNK
     C                     MOVE FS1       Q5NNNM
     C                     Z-ADDFNS       ANN
     C                     MOVE 'N'       Q51NNK
     C                     Z-ADDFS2       Q51NNM
     C                     MOVE 'N'       Q52NNK
     C                     Z-ADDFS3       Q52NNM
     C                     END
      *
     C                     MOVE FNOKN     Q5NOKU
     C                     Z-ADDWHIZK     Q5MHIZ
     C                     Z-ADDWKAIS     Q5MKAI
     C                     Z-ADDWNBIN     Q5MATO
     C                     Z-ADDB4NSRO    Q5SYUY
     C                     MOVE B4NTNI    Q5TANI
TCHK3C*                    Z-ADDUDHZ      Q5NTYM
TCHK3C                     Z-ADDUYM1      Q5NTYM
     C                     Z-ADD*DATE     Q5NHHZ
%0001C                     MOVE *BLANK    Q5NSYR
      *
     C           Q5NAIG    IFNE 9
     C           PSIGO     IFEQ '0'
     C           Q5NAIG    CABNE0         XX4
     C                     ELSE
     C           Q5NAIG    CABGE3         XX1
     C                     END
      *
     C           FS1       IFEQ 0
     C           FS2       IFEQ 0
     C           FS3       IFEQ 0
     C                     GOTO XX1
     C                     END
      *
     C                     Z-ADD1         Q5NAIG
     C                     GOTO XX1
     C                     END
      *
     C                     Z-ADD2         Q5NAIG
     C                     GOTO XX1
     C                     END
      *
     C                     Z-ADD3         Q5NAIG
     C                     GOTO XX1
     C           XX4       TAG
      *
     C                     ADD  1         Q5NAIG
     C           XX1       TAG
     C                     END
      *
     C           *IN03     IFEQ '0'
     C                     UPDATABBPL011
     C                     ELSE
     C                     WRITEABBPL011
     C                     END
     C                     EXCPTDT2
      ****** 部品マスターアンマッチリスト1997.9.26
     C                     MOVE *BLANK    @@ERCD  1
B01  C           Q5NNNM    IFEQ 0
     C           Q51NNM    ANDEQ0
     C           Q52NNM    ANDEQ0
     C           FS4       ANDEQ0
     C           FS5       ANDEQ0
JW1  C           FS6       ANDEQ0
     C           FS7       ANDEQ0
X01  C                     ELSE
     C                     MOVE *BLANK    W2TEHI  1
     C                     SETOF                     72
     C                     SETOF                     73
     C           KY2       CHAINFCEPL011             72
B02  C           *IN72     IFEQ '1'
     C                     MOVE '1'       @@ERCD  1
     C                     EXCPTDT
     C                     MOVE *ON       *IN73
X02  C                     ELSE
     C           Q5NONY    IFNE 0323
TCHK4C*TCH73     Q5NONY    ANDNE0275
B03  C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     MOVE '2'       @@ERCD  1
     C                     EXCPTDT
     C                     MOVE *ON       *IN73
X03  C                     ELSE
     C                     MOVE A2TEHI    W2TEHI
     C                     SELEC
B04  C           A2TAHZ    WHEQ 0
     C                     MOVE '3'       @@ERCD  1
     C                     EXCPTDT
     C                     MOVE *ON       *IN73
     C           A2TEHI    WHNE 'G'
     C                     MOVE '4'       @@ERCD  1
     C                     EXCPTDT
     C                     MOVE *ON       *IN73
     C           A2TAHZ    WHGT *DATE
     C                     MOVE '5'       @@ERCD  1
     C                     EXCPTDT
     C                     MOVE *ON       *IN73
E04  C                     ENDSL
      *
B04  C*          A2TAYM    IFGE UYM1
     C*          A2TEHI    ANDEQ'G'
B05  C*          A2TAYM    IFGE UYM1
     C*          FS1       ANDNE0
     C*                    SETOF                     72
B06  C*          1         DO   A2TADD    I       20
B07  C*          ANN,I     IFNE 0
     C*          *IN73     ANDEQ*OFF
     C*          I         ANDNEA2TADD
     C*                    EXCPTDT
     C*                    MOVE *ON       *IN73
     C*                    SETON                     72
E07  C*                    END
E06  C* N72                ENDDO
X05  C*                    ELSE
B06  C*          A2TAYM    IFGE UYM2
     C*          FS2       ANDNE0
     C*          *IN73     ANDEQ*OFF
     C*                    EXCPTDT
     C*                    MOVE *ON       *IN73
X06  C*                    ELSE
B07  C*          A2TAYM    IFGE UYM3
     C*          FS3       ANDNE0
     C*          *IN73     ANDEQ*OFF
     C*                    EXCPTDT
     C*                    MOVE *ON       *IN73
E07  C*                    END
E06  C*                    END
E05  C*                    END
E04  C********             END
E03  C                     END
E02  C                     END
     C                     ENDIF
      *
     C           *IN73     IFEQ *OFF
     C           KY2       CHAINAGAPL31              73
     C           *IN73     IFEQ *ON
      *
     C           KY2       SETLLAAPTL01
     C           *IN73     DOUEQ*ON
     C           KY2       READEAAPTL01                  73
     C           *IN73     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
     C           L5STHZ    ANDEQ99999999
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN73     IFEQ *ON
     C                     MOVE '6'       @@ERCD  1
     C                     EXCPTDT
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
      *
E01  C                     END
      ******************************
      *
     C                     SETOF                     03
     C           KY2       CHAINABBNL011             03
     C           *IN03     IFEQ '1'
      *
     C                     MOVE Q5SHN1    Q5HSH1
     C                     MOVE Q5SHN2    Q5HSH2
     C                     MOVE Q5SHN3    Q5HSH3
     C                     WRITEABBNL011
     C                     END
      *
     C                     GOTO STP1
      *
     C           END       TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*----------------------------------*
     C*        ...ﾅ ﾎﾞ ﾓ ｰ k ]...        *
     C*  ..共通品マスター　チェック..  *
     C*----------------------------------*
     C           SUBRTN    BEGSR
      *
TCHK1C*                    SETOF                     06
TCHK1C*                    Z-ADD1         A       10
TCHK1C*          1         DO   2         A
TCHK1C*          A         IFEQ 1
TCHK1C*                    Z-ADDB4TOKU    KTOKU   40
TCHK1C*                    Z-ADDB4NONY    KNONY   40
TCHK1C*                    ELSE
TCHK1C*                    Z-ADD0111      KTOKU
TCHK1C*                    Z-ADD0111      KNONY
TCHK1C*                    END
      *
TCHK1C*                    MOVE B4MHN1    KMHN1   5
TCHK1C*                    MOVE B4MHN2    KMHN2   5
      *
TCHK1C*                    SETOF                     03
TCHK1C*          FKEY      CHAINFAAPL061             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*                    GOTO FP1
TCHK1C*                    END
TCHK1C*                    END
TCHK1C*                    GOTO FP2
TCHK1C*          FP1       TAG
      *
TCHK1C*                    SETON                     06
TCHK1C*                    Z-ADD1         A
TCHK1C*          1         DO   3         A
TCHK1C*                    Z-ADDB4TOKU    B4KTOK  40
TCHK1C*                    Z-ADDB4NONY    B4KNOY  40
TCHK1C*                    MOVE B4NKOJ    B4KKOJ  1
TCHK1C*                    MOVE B4NUKE    B4KUKE  4
TCHK1C*                    MOVE B4MHN1    B4KHN1  5
TCHK1C*                    MOVE B4MHN2    B4KHN2  5
TCHK1C*                    MOVE *BLANK    B4KHN3  5
TCHK1C*                    MOVE *BLANK    B4KHN4  5
      *
TCHK1C*          A         IFEQ 1
TCHK1C*                    MOVELB4MHN3    B4KHN3
TCHK1C*                    MOVELB4MHN4    B4KHN4
TCHK1C*                    END
      *
TCHK1C*          A         IFEQ 2
TCHK1C*                    MOVELWMHN4     B4KHN3
TCHK1C*                    END
      *
TCHK1C*                    SETOF                     03
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    CABNE'D'       STX3
TCHK1C*          B7SKHZ    CABGT*DATE     STX3
TCHK1C*                    END
      *
      * NAPL
TCHK1C*          B4KNOY    IFEQ 0323
TCHK1C*          A         ANDEQ1
TCHK1C*          B4KHN3    ANDEQ*BLANK
TCHK1C*                    MOVEL'00   '   B4KHN3
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    ANDEQ*BLANK
TCHK1C*                    GOTO STX3
TCHK1C*                    ENDIF
TCHK1C*                    ENDIF
      *
TCHK1C*                    SETOF                     03
      *
TCHK1C*                    MOVE *BLANK    B4KKOJ
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    CABNE'D'       STX3
TCHK1C*          B7SKHZ    CABGT*DATE     STX3
TCHK1C*                    END
      *
TCHK1C*                    SETOF                     03
TCHK1C*                    MOVE B4NKOJ    B4KKOJ
TCHK1C*                    MOVEL*BLANK    B4KUKE
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    CABNE'D'       STX3
TCHK1C*          B7SKHZ    CABGT*DATE     STX3
TCHK1C*                    END
      *
TCHK1C*                    SETOF                     03
TCHK1C*                    MOVE *BLANK    B4KKOJ
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    CABNE'D'       STX3
TCHK1C*          B7SKHZ    CABGT*DATE     STX3
TCHK1C*                    END
      *
TCHK1C*                    SETOF                     03
TCHK1C*                    Z-ADD0111      B4KTOK
TCHK1C*                    Z-ADD0111      B4KNOY
TCHK1C*          B4BUFK    CHAINFAAPL021             03
TCHK1C*          *IN03     IFEQ '0'
TCHK1C*          B7SKBN    CABNE'D'       STX3
TCHK1C*          B7SKHZ    CABGT*DATE     STX3
TCHK1C*                    END
TCHK1C*                    END
TCHK1C*          FP2       TAG
      *
TCHK1C*                    MOVE B4MHN1    B4SHN1
TCHK1C*                    MOVE B4MHN2    B4SHN2
TCHK1C*                    MOVE *BLANK    B4SHN3
TCHK1C*                    GOTO ATP9
      *
TCHK1C*          STX3      TAG
TCHK1C*                    MOVE B7SHN1    B4SHN1
TCHK1C*                    MOVE B7SHN2    B4SHN2
TCHK1C*                    MOVE B7SHN3    B4SHN3
      *
TCHK1C                     MOVELFTOKU     P@TOKU
TCHK1C                     MOVELFNONY     P@NONY
TCHK1C                     MOVELFNKOJ     P@NKOJ
TCHK1C                     MOVELFNUKE     P@NUKE
TCHK1C                     MOVELFMHIN     P@MHIN
TCHK1C                     CALL 'BBHR50'
TCHK1C                     PARM           P@TOKU  4
TCHK1C                     PARM           P@NONY  4
TCHK1C                     PARM           P@NKOJ  1
TCHK1C                     PARM           P@NUKE  4
TCHK1C                     PARM           P@MHIN 20
TCHK1C                     PARM           P@SHIN 12
TCHK1C                     PARM           P@FLG   1
TCHK1C                     MOVELP@SHIN    B4SHIN
TCHK5C*
TCHK5C                     MOVELFTOKU     @TOKU   4
TCHK5C                     MOVELFNONY     @NONY   4
TCHK5C                     MOVELFNKOJ     @NKOJ   1
TCHK5C                     MOVELFNUKE     @NUKE   4
TCHK5C                     MOVELFMHIN     @MHIN  20
TCHK5C                     MOVEL*DATE     @HIZK   8
TCHK5C                     Z-ADD0         @TANK  105
TCHK5C                     MOVE *BLANK    @CHEK   1
TCHK5C                     CALL 'FBCR10'
TCHK5C                     PARM           @TOKU
TCHK5C                     PARM           @NONY
TCHK5C                     PARM           @NKOJ
TCHK5C                     PARM           @NUKE
TCHK5C                     PARM           @MHIN
TCHK5C                     PARM           @HIZK
TCHK5C                     PARM           @TANK
TCHK5C                     PARM           @CHEK
TCHK5C           @TANK     IFEQ *ZERO
TCHK5C                     MOVELFMHIN     FMHN
TCHK5C                     MOVELP@SHIN    FSHN
TCHK5C                     MOVEL'FCST'    FCST   10 P
TCHK5C                     Z-ADD*DATE     FNOYMD
TCHK5C                     Z-ADD01        FNOBN   20
TCHK5C                     EXCPTMITAN
TCHK5C                     END
      *
     C           ATP9      ENDSR
      *
      *
     C*----------------------------------------------------*
     C*               ...ﾅ ﾎﾞ ﾓ - k ]...                   *
     C*  ...ユーザー稼動日数　（得意先・納入先工場）...  *
     C*  ...Ｎ月                                         *
     C*----------------------------------------------------*
     C           SBCT1     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE *BLANK    @TKBN
     C                     Z-ADD0         WCD     31
     C                     Z-ADD0         HIZ1
     C           TKEY1     SETLLAGDPL311
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           TKEY1     READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
      *
     C*----------------------------------------*
     C*           ...ﾅ ﾎﾞ ﾓ - k ]...           *
     C*  ...ユーザー稼動日数　（得意先）...  *
     C*  ...Ｎ月                             *
     C*----------------------------------------*
     C           SBCT2     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE *BLANK    @TKBN
     C                     Z-ADD0         WCD
     C                     Z-ADD0         HIZ1
     C           TKEY2     SETLLAGDPL311
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           TKEY2     READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
      *
     C*-----------------------------*
     C*   ...ﾅ ﾎﾞ ﾓ - k ]...        *
     C*  ...青山稼動日数...       *
     C*  ...Ｎ月                  *
     C*-----------------------------*
     C           SBCT3     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE 'A'       @TKBN
     C                     Z-ADD0         WCD
     C                     Z-ADD0         HIZ1
     C           HKEY      SETLLAGDPL121
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           HKEY      READEAGDPL121                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ1,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WCD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ1,B
     C                     END
      *
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
      *
     C*----------------------------------------------------*
     C*               ...ﾅ ﾎﾞ ﾓ - k ]...                   *
     C*  ...ユーザー稼動日数　（得意先・納入先工場）...  *
     C*  ...Ｎ＋１月                                     *
     C*----------------------------------------------------*
     C           SBCY1     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE *BLANK    @YKBN
     C                     Z-ADD0         WDD     31
     C                     Z-ADD0         HIZ2
     C           YKEY1     SETLLAGDPL311
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           YKEY1     READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
      *
     C*----------------------------------------*
     C*           ...ﾅ ﾎﾞ ﾓ - k ]...           *
     C*  ...ユーザー稼動日数　（得意先）...  *
     C*  ...Ｎ＋１月                         *
     C*----------------------------------------*
     C           SBCY2     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE *BLANK    @YKBN
     C                     Z-ADD0         WDD
     C                     Z-ADD0         HIZ2
     C           YKEY2     SETLLAGDPL311
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           YKEY2     READEAGDPL311                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
      *
     C*-----------------------------*
     C*   ...ﾅ ﾎﾞ ﾓ - k ]...        *
     C*  ...青山稼動日数...       *
     C*  ...Ｎ＋１月              *
     C*-----------------------------*
     C           SBCY3     BEGSR
      *
     C                     SETOF                     02
     C                     MOVE 'A'       @YKBN
     C                     Z-ADD0         WDD
     C                     Z-ADD0         HIZ2
     C           XKEY      SETLLAGDPL121
      *
     C                     DO   *HIVAL
     C                     SETOF                     03
     C           XKEY      READEAGDPL121                 03
     C           *IN03     IFEQ '1'
     C           *IN02     IFEQ '0'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     SETON                     02
     C                     ADD  1         WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD1         HIZ2,B
     C                     ELSE
      *
     C                     SETON                     02
     C                     ADD  0.5       WDD
     C                     Z-ADDF8KADD    B
     C                     Z-ADD0.5       HIZ2,B
     C                     END
      *
     C                     END
     C                     END
     C  N03                END
      *
     C                     ENDSR
      *
     OFCCNP32 E                UP
     O                                    6 'ABAR32'
      *
     OABAWP72 E                DT
     O                         Q5TOKU     4
     O                         Q5NONY     8
     O                         Q5NKOJ     9
     O                         Q5GKOJ    10
     O                         Q5NUKE    14
     O                         Q5GUKE    18
     O                         Q5SEBN    22
     O                         Q5MHN1    27
     O                         Q5MHN2    32
     O                         Q5MHN3    37
     O                         Q5MHN4    42
     O                         Q5SHN1    47
     O                         Q5SHN2    52
     O                         Q5SHN3    54
     O                         Q5NNNM    63
     O                         Q51NNM    72
     O                         Q52NNM    81
     O                         Q5NOKU    82
     O                         ANN      299
     O                         W2TEHI   300
     O                         @@ERCD   301
     O                         FS4      310
     O                         FS5      319
JW1  O                         FS6      328
     O                         FS7      337
      *
     OABAWP32 E                DT2
     O                         Q5TOKU     4
     O                         Q5NONY     8
     O                         Q5GKOJ     9
     O                         Q5GUKE    13
     O                         Q5MHN1    18
     O                         Q5MHN2    23
     O                         Q5MHN3    28
     O                         Q5MHN4    33
     O                         Q5SEBN    37
      *
     OMITANKF EADD             MITAN
     O                                    1 'U'
     O                                    2 'K'
     O                                    3 ' '
     O                         FTOKU      7
     O                         FNKOJ      8
     O                         FNUKE     12
     O                         FNONY     16
     O                         FNKOJ     17
     O                         FNUKE     21
     O                         FMHN1     26
     O                         FMHN2     31
     O                         FMHN3     36
     O                         FMHN4     41
     O                         FSHN1     46
     O                         FSHN2     51
     O                         FSHN3     53
     O                         FCST      73
     O                                   76 '000'
     O                                   84 'C'
     O                         FNOYY     88
     O                         FNOMM     90
     O                         FNODD     92
     O                         FNOBN     94
