     H            Y.
     F** ABBR43 *****************************************
     F*  CREATE FC WORK FILE (ABAWP42) FROM ABVPP25     *
     F*  (COPIED FROM ABAR2P)                           *
     F*  J.WATANABE 2017.06.09                          *
     F***************************************************
     FABVPL25 UF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FABAWP2P UF  E           K        DISK                      A
      *===================================================
     E**                  CT1     1   2  4   CT2     4
     E                    HSU        31  7 0
     E                    HYM         7  8 0
      *===================================================
      * DATE
     I            DS
     I                                        1   80V2FRHZ
     I                                        1   40V2FRYY
     I                                        5   60V2FRMM
     I                                        7   80V2FRDD
     I            DS
     I                                        1 2170HSU
     I                                        1   70ABNN01
     I                                        8  140ABNN02
     I                                       15  210ABNN03
     I                                       22  280ABNN04
     I                                       29  350ABNN05
     I                                       36  420ABNN06
     I                                       43  490ABNN07
     I                                       50  560ABNN08
     I                                       57  630ABNN09
     I                                       64  700ABNN10
     I                                       71  770ABNN11
     I                                       78  840ABNN12
     I                                       85  910ABNN13
     I                                       92  980ABNN14
     I                                       99 1050ABNN15
     I                                      106 1120ABNN16
     I                                      113 1190ABNN17
     I                                      120 1260ABNN18
     I                                      127 1330ABNN19
     I                                      134 1400ABNN20
     I                                      141 1470ABNN21
     I                                      148 1540ABNN22
     I                                      155 1610ABNN23
     I                                      162 1680ABNN24
     I                                      169 1750ABNN25
     I                                      176 1820ABNN26
     I                                      183 1890ABNN27
     I                                      190 1960ABNN28
     I                                      197 2030ABNN29
     I                                      204 2100ABNN30
     I                                      211 2170ABNN31
      *
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
      *
     I            DS
     I                                        1   80@NYMD
     I                                        1   60@NYM
     I                                        7   80D
      *
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80B5SKHZ
     I                                        1   40B5SKYY
     I                                        5   60B5SKMM
     I                                        7   80B5SKDD
     I            DS
     I                                        1   80WSDAT
     I                                        1   40WSYY
     I                                        5   60WSMM
     I                                        7   80WSDD
      *====================================================
      *          MAIN
      *====================================================
     C                     EXSR #INIT
      *
     C           *IN91     DOWEQ*OFF
     C                     READ ABVPL25                  91
     C           *IN91     IFEQ *OFF
     C           V2FLG1    ANDEQ'@'
     C                     MOVE '*'       V2FLG1
     C                     UPDATABVPP251
      *
     C                     MOVELV2MHN1    K@MHN1
     C                     MOVELV2MHN2    K@MHN2
     C                     MOVELV2MHN3    K@MHN3
     C                     MOVELV2MHN4    K@MHN4
     C           V2FR01    DIV  100       WSURY   70
      * READ GADPP11
     C                     MOVELV2TOKU    K@TOKU
     C                     MOVELV2NONY    K@NONY
     C                     MOVELV2NKOJ    K@NKOJ
     C                     MOVELV2NUKE    K@NUKE
     C                     SETOF                     95
     C           K#11      CHAINGADPL11              95
     C           *IN95     IFEQ *OFF
     C           B5SKJY    ANDEQ'D'
     C           B5SKHZ    ANDLE*DATE
     C                     SETON                     95
     C                     ENDIF
      *
     C           *IN95     IFEQ *OFF
     C                     Z-ADD0         B       20
     C                     Z-ADD0         HYM
     C                     Z-ADD0         WKAD    20
      * READ AGDPP11
     C                     Z-ADDV2FRHZ    WSDAT
     C           K#12      SETLLAGDPL12
     C                     DO   7
     C                     SETOF                     96
     C                     READ AGDPL12                  96
     C           *IN96     IFEQ *OFF
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         B
     C                     ADD  1         WKAD
     C                     Z-ADDF8KAHZ    HYM,B
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           WSURY     DIV  WKAD      WKSUR   70H
      *
     C                     Z-ADD1         A       20
     C           1         DO   7         A
     C           HYM,A     IFNE 0
     C                     Z-ADDHYM,A     @NYMD
      *
     C                     SETOF                     97
     C           K#2P      CHAINABAWP2P              97
     C           *IN97     IFEQ *ON
     C                     Z-ADDK@TOKU    ABTOKU
     C                     Z-ADDK@NONY    ABNONY
     C                     MOVE K@NKOJ    ABNKOJ
     C                     MOVE K@NUKE    ABNUKE
     C                     MOVE '0000'    ABSBAN
     C                     MOVELK@MHN1    ABMHN1
     C                     MOVELK@MHN2    ABMHN2
     C                     MOVELK@MHN3    ABMHN3
     C                     MOVELK@MHN4    ABMHN4
     C                     Z-ADD@NYM      ABDATE
     C                     Z-ADD0         HSU
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       ABNNSU
     C                     MOVE 'C'       ABNOKN
     C                     WRITEABAWP2P1
      *
     C                     ELSE
     C                     Z-ADDWKSUR     HSU,D
     C                     XFOOTHSU       ABNNSU
     C                     MOVE 'C'       ABNOKN
     C                     UPDATABAWP2P1
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *===================================================================
      * INITIALIZE
      *===================================================================
     C           #INIT     BEGSR
      *
     C           K#2P      KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           @NYM
      *
     C           K#11      KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
      *
     C           K#12      KLIST
     C                     KFLD           WSYY
     C                     KFLD           WSMM
     C                     KFLD           WSDD
      *
     C                     TIME           WTIME   60
      *
     C                     ENDSR
