     H            Y/
     F*** ABBR87 ******************************************
     F*  MACHINE GROUP ENTRY                              *
     F*                                                   *
     F*                                                   *
JW1  F*  J.WATANABE 05/09/2016 CHANGED MAX MACHINE# TO 15 *
JW2  F*  J.WATANABE 10/03/2016 ADD 2'ND ENTRY SCREEN      *
     F*****************************************************
     FABBPW87 CF  E                    WORKSTN
     FABBPP81 UF  E           K        DISK                      A
      *------------------------------------------------------------
     E                    CMD     1   2 78
JW2  E                    MSG     1   4 78
JW2  E                    MG         50  1
JW2  E                    TB          3  1
     E**JW1               M01        10  3
     E**JW1               M02        10  3
     E**JW1               M03        10  3
     E**JW1               M04        10  3
     E**JW1               M05        10  3
     E**JW1               M06        10  3
     E**JW1               M07        10  3
     E**JW1               M08        10  3
     E**JW1               M09        10  3
     E**JW1               M10        10  3
     E**JW1               M11        10  3
     E**JW1               M12        10  3
     E**JW1               M13        10  3
     E**JW1               M14        10  3
     E**JW1               M15        10  3
     E**JW1               M16        10  3
     E**JW1               M17        10  3
JW1  E                    M01        15  3
JW1  E                    M02        15  3
JW1  E                    M03        15  3
JW1  E                    M04        15  3
JW1  E                    M05        15  3
JW1  E                    M06        15  3
JW1  E                    M07        15  3
JW1  E                    M08        15  3
JW1  E                    M09        15  3
JW1  E                    M10        15  3
JW1  E                    M11        15  3
JW1  E                    M12        15  3
JW1  E                    M13        15  3
JW1  E                    M14        15  3
JW1  E                    M15        15  3
JW1  E                    M16        15  3
JW1  E                    M17        15  3
      *
JW2  E                    M18        15  3
JW2  E                    M19        15  3
JW2  E                    M20        15  3
JW2  E                    M21        15  3
JW2  E                    M22        15  3
JW2  E                    M23        15  3
JW2  E                    M24        15  3
JW2  E                    M25        15  3
JW2  E                    M26        15  3
JW2  E                    M27        15  3
JW2  E                    M28        15  3
JW2  E                    M29        15  3
JW2  E                    M30        15  3
JW2  E                    M31        15  3
JW2  E                    M32        15  3
JW2  E                    M33        15  3
JW2  E                    M34        15  3
     E**JW2               NO         17  2 0
JW2  E                    NO         34  2 0
JW2  E                    WK         15  3
JW2  E                    BG        510  3
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  45 M01
     I                                        1   3 MAC011
     I                                        4   6 MAC012
     I                                        7   9 MAC013
     I                                       10  12 MAC014
     I                                       13  15 MAC015
     I                                       16  18 MAC016
     I                                       19  21 MAC017
     I                                       22  24 MAC018
     I                                       25  27 MAC019
JW1  I                                       28  30 MAC01A
JW1  I                                       31  33 MAC01B
JW1  I                                       34  36 MAC01C
JW1  I                                       37  39 MAC01D
JW1  I                                       40  42 MAC01E
JW1  I                                       43  45 MAC01F
     I            DS
     I                                        1  45 M02
     I                                        1   3 MAC021
     I                                        4   6 MAC022
     I                                        7   9 MAC023
     I                                       10  12 MAC024
     I                                       13  15 MAC025
     I                                       16  18 MAC026
     I                                       19  21 MAC027
     I                                       22  24 MAC028
     I                                       25  27 MAC029
JW1  I                                       28  30 MAC02A
JW1  I                                       31  33 MAC02B
JW1  I                                       34  36 MAC02C
JW1  I                                       37  39 MAC02D
JW1  I                                       40  42 MAC02E
JW1  I                                       43  45 MAC02F
     I            DS
     I                                        1  45 M03
     I                                        1   3 MAC031
     I                                        4   6 MAC032
     I                                        7   9 MAC033
     I                                       10  12 MAC034
     I                                       13  15 MAC035
     I                                       16  18 MAC036
     I                                       19  21 MAC037
     I                                       22  24 MAC038
     I                                       25  27 MAC039
JW1  I                                       28  30 MAC03A
JW1  I                                       31  33 MAC03B
JW1  I                                       34  36 MAC03C
JW1  I                                       37  39 MAC03D
JW1  I                                       40  42 MAC03E
JW1  I                                       43  45 MAC03F
     I            DS
     I                                        1  45 M04
     I                                        1   3 MAC041
     I                                        4   6 MAC042
     I                                        7   9 MAC043
     I                                       10  12 MAC044
     I                                       13  15 MAC045
     I                                       16  18 MAC046
     I                                       19  21 MAC047
     I                                       22  24 MAC048
     I                                       25  27 MAC049
JW1  I                                       28  30 MAC04A
JW1  I                                       31  33 MAC04B
JW1  I                                       34  36 MAC04C
JW1  I                                       37  39 MAC04D
JW1  I                                       40  42 MAC04E
JW1  I                                       43  45 MAC04F
     I            DS
     I                                        1  45 M05
     I                                        1   3 MAC051
     I                                        4   6 MAC052
     I                                        7   9 MAC053
     I                                       10  12 MAC054
     I                                       13  15 MAC055
     I                                       16  18 MAC056
     I                                       19  21 MAC057
     I                                       22  24 MAC058
     I                                       25  27 MAC059
JW1  I                                       28  30 MAC05A
JW1  I                                       31  33 MAC05B
JW1  I                                       34  36 MAC05C
JW1  I                                       37  39 MAC05D
JW1  I                                       40  42 MAC05E
JW1  I                                       43  45 MAC05F
     I            DS
     I                                        1  45 M06
     I                                        1   3 MAC061
     I                                        4   6 MAC062
     I                                        7   9 MAC063
     I                                       10  12 MAC064
     I                                       13  15 MAC065
     I                                       16  18 MAC066
     I                                       19  21 MAC067
     I                                       22  24 MAC068
     I                                       25  27 MAC069
JW1  I                                       28  30 MAC06A
JW1  I                                       31  33 MAC06B
JW1  I                                       34  36 MAC06C
JW1  I                                       37  39 MAC06D
JW1  I                                       40  42 MAC06E
JW1  I                                       43  45 MAC06F
     I            DS
     I                                        1  45 M07
     I                                        1   3 MAC071
     I                                        4   6 MAC072
     I                                        7   9 MAC073
     I                                       10  12 MAC074
     I                                       13  15 MAC075
     I                                       16  18 MAC076
     I                                       19  21 MAC077
     I                                       22  24 MAC078
     I                                       25  27 MAC079
     I                                       28  30 MAC070
JW1  I                                       28  30 MAC07A
JW1  I                                       31  33 MAC07B
JW1  I                                       34  36 MAC07C
JW1  I                                       37  39 MAC07D
JW1  I                                       40  42 MAC07E
JW1  I                                       43  45 MAC07F
     I            DS
     I                                        1  45 M08
     I                                        1   3 MAC081
     I                                        4   6 MAC082
     I                                        7   9 MAC083
     I                                       10  12 MAC084
     I                                       13  15 MAC085
     I                                       16  18 MAC086
     I                                       19  21 MAC087
     I                                       22  24 MAC088
     I                                       25  27 MAC089
     I                                       28  30 MAC080
JW1  I                                       28  30 MAC08A
JW1  I                                       31  33 MAC08B
JW1  I                                       34  36 MAC08C
JW1  I                                       37  39 MAC08D
JW1  I                                       40  42 MAC08E
JW1  I                                       43  45 MAC08F
     I            DS
     I                                        1  45 M09
     I                                        1   3 MAC091
     I                                        4   6 MAC092
     I                                        7   9 MAC093
     I                                       10  12 MAC094
     I                                       13  15 MAC095
     I                                       16  18 MAC096
     I                                       19  21 MAC097
     I                                       22  24 MAC098
     I                                       25  27 MAC099
JW1  I                                       28  30 MAC09A
JW1  I                                       31  33 MAC09B
JW1  I                                       34  36 MAC09C
JW1  I                                       37  39 MAC09D
JW1  I                                       40  42 MAC09E
JW1  I                                       43  45 MAC09F
     I            DS
     I                                        1  45 M10
     I                                        1   3 MAC101
     I                                        4   6 MAC102
     I                                        7   9 MAC103
     I                                       10  12 MAC104
     I                                       13  15 MAC105
     I                                       16  18 MAC106
     I                                       19  21 MAC107
     I                                       22  24 MAC108
     I                                       25  27 MAC109
JW1  I                                       28  30 MAC10A
JW1  I                                       31  33 MAC10B
JW1  I                                       34  36 MAC10C
JW1  I                                       37  39 MAC10D
JW1  I                                       40  42 MAC10E
JW1  I                                       43  45 MAC10F
     I            DS
     I                                        1  45 M11
     I                                        1   3 MAC111
     I                                        4   6 MAC112
     I                                        7   9 MAC113
     I                                       10  12 MAC114
     I                                       13  15 MAC115
     I                                       16  18 MAC116
     I                                       19  21 MAC117
     I                                       22  24 MAC118
     I                                       25  27 MAC119
JW1  I                                       28  30 MAC11A
JW1  I                                       31  33 MAC11B
JW1  I                                       34  36 MAC11C
JW1  I                                       37  39 MAC11D
JW1  I                                       40  42 MAC11E
JW1  I                                       43  45 MAC11F
     I            DS
     I                                        1  45 M12
     I                                        1   3 MAC121
     I                                        4   6 MAC122
     I                                        7   9 MAC123
     I                                       10  12 MAC124
     I                                       13  15 MAC125
     I                                       16  18 MAC126
     I                                       19  21 MAC127
     I                                       22  24 MAC128
     I                                       25  27 MAC129
JW1  I                                       28  30 MAC12A
JW1  I                                       31  33 MAC12B
JW1  I                                       34  36 MAC12C
JW1  I                                       37  39 MAC12D
JW1  I                                       40  42 MAC12E
JW1  I                                       43  45 MAC12F
     I            DS
     I                                        1  45 M13
     I                                        1   3 MAC131
     I                                        4   6 MAC132
     I                                        7   9 MAC133
     I                                       10  12 MAC134
     I                                       13  15 MAC135
     I                                       16  18 MAC136
     I                                       19  21 MAC137
     I                                       22  24 MAC138
     I                                       25  27 MAC139
JW1  I                                       28  30 MAC13A
JW1  I                                       31  33 MAC13B
JW1  I                                       34  36 MAC13C
JW1  I                                       37  39 MAC13D
JW1  I                                       40  42 MAC13E
JW1  I                                       43  45 MAC13F
     I            DS
     I                                        1  45 M14
     I                                        1   3 MAC141
     I                                        4   6 MAC142
     I                                        7   9 MAC143
     I                                       10  12 MAC144
     I                                       13  15 MAC145
     I                                       16  18 MAC146
     I                                       19  21 MAC147
     I                                       22  24 MAC148
     I                                       25  27 MAC149
JW1  I                                       28  30 MAC14A
JW1  I                                       31  33 MAC14B
JW1  I                                       34  36 MAC14C
JW1  I                                       37  39 MAC14D
JW1  I                                       40  42 MAC14E
JW1  I                                       43  45 MAC14F
     I            DS
     I                                        1  45 M15
     I                                        1   3 MAC151
     I                                        4   6 MAC152
     I                                        7   9 MAC153
     I                                       10  12 MAC154
     I                                       13  15 MAC155
     I                                       16  18 MAC156
     I                                       19  21 MAC157
     I                                       22  24 MAC158
     I                                       25  27 MAC159
JW1  I                                       28  30 MAC15A
JW1  I                                       31  33 MAC15B
JW1  I                                       34  36 MAC15C
JW1  I                                       37  39 MAC15D
JW1  I                                       40  42 MAC15E
JW1  I                                       43  45 MAC15F
     I            DS
     I                                        1  45 M16
     I                                        1   3 MAC161
     I                                        4   6 MAC162
     I                                        7   9 MAC163
     I                                       10  12 MAC164
     I                                       13  15 MAC165
     I                                       16  18 MAC166
     I                                       19  21 MAC167
     I                                       22  24 MAC168
     I                                       25  27 MAC169
JW1  I                                       28  30 MAC16A
JW1  I                                       31  33 MAC16B
JW1  I                                       34  36 MAC16C
JW1  I                                       37  39 MAC16D
JW1  I                                       40  42 MAC16E
JW1  I                                       43  45 MAC16F
     I            DS
     I                                        1  45 M17
     I                                        1   3 MAC171
     I                                        4   6 MAC172
     I                                        7   9 MAC173
     I                                       10  12 MAC174
     I                                       13  15 MAC175
     I                                       16  18 MAC176
     I                                       19  21 MAC177
     I                                       22  24 MAC178
     I                                       25  27 MAC179
JW1  I                                       28  30 MAC17A
JW1  I                                       31  33 MAC17B
JW1  I                                       34  36 MAC17C
JW1  I                                       37  39 MAC17D
JW1  I                                       40  42 MAC17E
JW1  I                                       43  45 MAC17F
JW2  I            DS
 |   I                                        1  45 M18
 |   I                                        1   3 MAC181
 |   I                                        4   6 MAC182
 |   I                                        7   9 MAC183
 |   I                                       10  12 MAC184
 |   I                                       13  15 MAC185
 |   I                                       16  18 MAC186
 |   I                                       19  21 MAC187
 |   I                                       22  24 MAC188
 |   I                                       25  27 MAC189
 |   I                                       28  30 MAC18A
 |   I                                       31  33 MAC18B
 |   I                                       34  36 MAC18C
 |   I                                       37  39 MAC18D
 |   I                                       40  42 MAC18E
JW2  I                                       43  45 MAC18F
JW2  I            DS
 |   I                                        1  45 M19
 |   I                                        1   3 MAC191
 |   I                                        4   6 MAC192
 |   I                                        7   9 MAC193
 |   I                                       10  12 MAC194
 |   I                                       13  15 MAC195
 |   I                                       16  18 MAC196
 |   I                                       19  21 MAC197
 |   I                                       22  24 MAC198
 |   I                                       25  27 MAC199
 |   I                                       28  30 MAC19A
 |   I                                       31  33 MAC19B
 |   I                                       34  36 MAC19C
 |   I                                       37  39 MAC19D
 |   I                                       40  42 MAC19E
JW2  I                                       43  45 MAC19F
JW2  I            DS
 |   I                                        1  45 M20
 |   I                                        1   3 MAC201
 |   I                                        4   6 MAC202
 |   I                                        7   9 MAC203
 |   I                                       10  12 MAC204
 |   I                                       13  15 MAC205
 |   I                                       16  18 MAC206
 |   I                                       19  21 MAC207
 |   I                                       22  24 MAC208
 |   I                                       25  27 MAC209
 |   I                                       28  30 MAC20A
 |   I                                       31  33 MAC20B
 |   I                                       34  36 MAC20C
 |   I                                       37  39 MAC20D
 |   I                                       40  42 MAC20E
JW2  I                                       43  45 MAC20F
JW2  I            DS
 |   I                                        1  45 M21
 |   I                                        1   3 MAC211
 |   I                                        4   6 MAC212
 |   I                                        7   9 MAC213
 |   I                                       10  12 MAC214
 |   I                                       13  15 MAC215
 |   I                                       16  18 MAC216
 |   I                                       19  21 MAC217
 |   I                                       22  24 MAC218
 |   I                                       25  27 MAC219
 |   I                                       28  30 MAC21A
 |   I                                       31  33 MAC21B
 |   I                                       34  36 MAC21C
 |   I                                       37  39 MAC21D
 |   I                                       40  42 MAC21E
JW2  I                                       43  45 MAC21F
JW2  I            DS
 |   I                                        1  45 M22
 |   I                                        1   3 MAC221
 |   I                                        4   6 MAC222
 |   I                                        7   9 MAC223
 |   I                                       10  12 MAC224
 |   I                                       13  15 MAC225
 |   I                                       16  18 MAC226
 |   I                                       19  21 MAC227
 |   I                                       22  24 MAC228
 |   I                                       25  27 MAC229
 |   I                                       28  30 MAC22A
 |   I                                       31  33 MAC22B
 |   I                                       34  36 MAC22C
 |   I                                       37  39 MAC22D
 |   I                                       40  42 MAC22E
JW2  I                                       43  45 MAC22F
JW2  I            DS
 |   I                                        1  45 M23
 |   I                                        1   3 MAC231
 |   I                                        4   6 MAC232
 |   I                                        7   9 MAC233
 |   I                                       10  12 MAC234
 |   I                                       13  15 MAC235
 |   I                                       16  18 MAC236
 |   I                                       19  21 MAC237
 |   I                                       22  24 MAC238
 |   I                                       25  27 MAC239
 |   I                                       28  30 MAC23A
 |   I                                       31  33 MAC23B
 |   I                                       34  36 MAC23C
 |   I                                       37  39 MAC23D
 |   I                                       40  42 MAC23E
JW2  I                                       43  45 MAC23F
JW2  I            DS
 |   I                                        1  45 M24
 |   I                                        1   3 MAC241
 |   I                                        4   6 MAC242
 |   I                                        7   9 MAC243
 |   I                                       10  12 MAC244
 |   I                                       13  15 MAC245
 |   I                                       16  18 MAC246
 |   I                                       19  21 MAC247
 |   I                                       22  24 MAC248
 |   I                                       25  27 MAC249
 |   I                                       28  30 MAC24A
 |   I                                       31  33 MAC24B
 |   I                                       34  36 MAC24C
 |   I                                       37  39 MAC24D
 |   I                                       40  42 MAC24E
JW2  I                                       43  45 MAC24F
JW2  I            DS
 |   I                                        1  45 M25
 |   I                                        1   3 MAC251
 |   I                                        4   6 MAC252
 |   I                                        7   9 MAC253
 |   I                                       10  12 MAC254
 |   I                                       13  15 MAC255
 |   I                                       16  18 MAC256
 |   I                                       19  21 MAC257
 |   I                                       22  24 MAC258
 |   I                                       25  27 MAC259
 |   I                                       28  30 MAC25A
 |   I                                       31  33 MAC25B
 |   I                                       34  36 MAC25C
 |   I                                       37  39 MAC25D
 |   I                                       40  42 MAC25E
JW2  I                                       43  45 MAC25F
JW2  I            DS
 |   I                                        1  45 M26
 |   I                                        1   3 MAC261
 |   I                                        4   6 MAC262
 |   I                                        7   9 MAC263
 |   I                                       10  12 MAC264
 |   I                                       13  15 MAC265
 |   I                                       16  18 MAC266
 |   I                                       19  21 MAC267
 |   I                                       22  24 MAC268
 |   I                                       25  27 MAC269
 |   I                                       28  30 MAC26A
 |   I                                       31  33 MAC26B
 |   I                                       34  36 MAC26C
 |   I                                       37  39 MAC26D
 |   I                                       40  42 MAC26E
JW2  I                                       43  45 MAC26F
JW2  I            DS
 |   I                                        1  45 M27
 |   I                                        1   3 MAC271
 |   I                                        4   6 MAC272
 |   I                                        7   9 MAC273
 |   I                                       10  12 MAC274
 |   I                                       13  15 MAC275
 |   I                                       16  18 MAC276
 |   I                                       19  21 MAC277
 |   I                                       22  24 MAC278
 |   I                                       25  27 MAC279
 |   I                                       28  30 MAC27A
 |   I                                       31  33 MAC27B
 |   I                                       34  36 MAC27C
 |   I                                       37  39 MAC27D
 |   I                                       40  42 MAC27E
JW2  I                                       43  45 MAC27F
JW2  I            DS
 |   I                                        1  45 M28
 |   I                                        1   3 MAC281
 |   I                                        4   6 MAC282
 |   I                                        7   9 MAC283
 |   I                                       10  12 MAC284
 |   I                                       13  15 MAC285
 |   I                                       16  18 MAC286
 |   I                                       19  21 MAC287
 |   I                                       22  24 MAC288
 |   I                                       25  27 MAC289
 |   I                                       28  30 MAC28A
 |   I                                       31  33 MAC28B
 |   I                                       34  36 MAC28C
 |   I                                       37  39 MAC28D
 |   I                                       40  42 MAC28E
JW2  I                                       43  45 MAC28F
JW2  I            DS
 |   I                                        1  45 M29
 |   I                                        1   3 MAC291
 |   I                                        4   6 MAC292
 |   I                                        7   9 MAC293
 |   I                                       10  12 MAC294
 |   I                                       13  15 MAC295
 |   I                                       16  18 MAC296
 |   I                                       19  21 MAC297
 |   I                                       22  24 MAC298
 |   I                                       25  27 MAC299
 |   I                                       28  30 MAC29A
 |   I                                       31  33 MAC29B
 |   I                                       34  36 MAC29C
 |   I                                       37  39 MAC29D
 |   I                                       40  42 MAC29E
JW2  I                                       43  45 MAC29F
JW2  I            DS
 |   I                                        1  45 M30
 |   I                                        1   3 MAC301
 |   I                                        4   6 MAC302
 |   I                                        7   9 MAC303
 |   I                                       10  12 MAC304
 |   I                                       13  15 MAC305
 |   I                                       16  18 MAC306
 |   I                                       19  21 MAC307
 |   I                                       22  24 MAC308
 |   I                                       25  27 MAC309
 |   I                                       28  30 MAC30A
 |   I                                       31  33 MAC30B
 |   I                                       34  36 MAC30C
 |   I                                       37  39 MAC30D
 |   I                                       40  42 MAC30E
JW2  I                                       43  45 MAC30F
JW2  I            DS
 |   I                                        1  45 M31
 |   I                                        1   3 MAC311
 |   I                                        4   6 MAC312
 |   I                                        7   9 MAC313
 |   I                                       10  12 MAC314
 |   I                                       13  15 MAC315
 |   I                                       16  18 MAC316
 |   I                                       19  21 MAC317
 |   I                                       22  24 MAC318
 |   I                                       25  27 MAC319
 |   I                                       28  30 MAC31A
 |   I                                       31  33 MAC31B
 |   I                                       34  36 MAC31C
 |   I                                       37  39 MAC31D
 |   I                                       40  42 MAC31E
JW2  I                                       43  45 MAC31F
JW2  I            DS
 |   I                                        1  45 M32
 |   I                                        1   3 MAC321
 |   I                                        4   6 MAC322
 |   I                                        7   9 MAC323
 |   I                                       10  12 MAC324
 |   I                                       13  15 MAC325
 |   I                                       16  18 MAC326
 |   I                                       19  21 MAC327
 |   I                                       22  24 MAC328
 |   I                                       25  27 MAC329
 |   I                                       28  30 MAC32A
 |   I                                       31  33 MAC32B
 |   I                                       34  36 MAC32C
 |   I                                       37  39 MAC32D
 |   I                                       40  42 MAC32E
JW2  I                                       43  45 MAC32F
JW2  I            DS
 |   I                                        1  45 M33
 |   I                                        1   3 MAC331
 |   I                                        4   6 MAC332
 |   I                                        7   9 MAC333
 |   I                                       10  12 MAC334
 |   I                                       13  15 MAC335
 |   I                                       16  18 MAC336
 |   I                                       19  21 MAC337
 |   I                                       22  24 MAC338
 |   I                                       25  27 MAC339
 |   I                                       28  30 MAC33A
 |   I                                       31  33 MAC33B
 |   I                                       34  36 MAC33C
 |   I                                       37  39 MAC33D
 |   I                                       40  42 MAC33E
JW2  I                                       43  45 MAC33F
JW2  I            DS
 |   I                                        1  45 M34
 |   I                                        1   3 MAC341
 |   I                                        4   6 MAC342
 |   I                                        7   9 MAC343
 |   I                                       10  12 MAC344
 |   I                                       13  15 MAC345
 |   I                                       16  18 MAC346
 |   I                                       19  21 MAC347
 |   I                                       22  24 MAC348
 |   I                                       25  27 MAC349
 |   I                                       28  30 MAC34A
 |   I                                       31  33 MAC34B
 |   I                                       34  36 MAC34C
 |   I                                       37  39 MAC34D
 |   I                                       40  42 MAC34E
JW2  I                                       43  45 MAC34F
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
JW2  C           W@ID      CASEQ'03'      #SCRN3
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#81      KLIST
     C                     KFLD           D@PRC   3
     C           K#81X     KLIST
     C                     KFLD           D@PRC   3
     C                     KFLD           K@GRP   2
     C           K#81Y     KLIST
     C                     KFLD           D@PRC   3
     C                     KFLD           K@GRP   2
     C                     KFLD           K@MCN   3
      *
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
     C*
     C                     MOVEL*BLANK    M01
     C                     MOVEL*BLANK    M02
     C                     MOVEL*BLANK    M03
     C                     MOVEL*BLANK    M04
     C                     MOVEL*BLANK    M05
     C                     MOVEL*BLANK    M06
     C                     MOVEL*BLANK    M07
     C                     MOVEL*BLANK    M08
     C                     MOVEL*BLANK    M09
     C                     MOVEL*BLANK    M10
     C                     MOVEL*BLANK    M11
     C                     MOVEL*BLANK    M12
     C                     MOVEL*BLANK    M13
     C                     MOVEL*BLANK    M14
     C                     MOVEL*BLANK    M15
     C                     MOVEL*BLANK    M16
     C                     MOVEL*BLANK    M17
      *
JW2  C                     MOVEL*BLANK    M18
 |   C                     MOVEL*BLANK    M19
 |   C                     MOVEL*BLANK    M20
 |   C                     MOVEL*BLANK    M21
 |   C                     MOVEL*BLANK    M22
 |   C                     MOVEL*BLANK    M23
 |   C                     MOVEL*BLANK    M24
 |   C                     MOVEL*BLANK    M25
 |   C                     MOVEL*BLANK    M26
 |   C                     MOVEL*BLANK    M27
 |   C                     MOVEL*BLANK    M28
 |   C                     MOVEL*BLANK    M29
 |   C                     MOVEL*BLANK    M30
 |   C                     MOVEL*BLANK    M31
 |   C                     MOVEL*BLANK    M32
 |   C                     MOVEL*BLANK    M33
JW2  C                     MOVEL*BLANK    M34
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
JW2  C                     MOVE *BLANK    D@MSG
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET1
     C                     MOVE '02'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *  CHECK 1
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVEA'00000000'*IN,60
     C**JW2                MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN99
      *
     C           D@PRC     IFEQ *BLANK
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA
      *------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
      *
     C                     MOVE *BLANK    @@GRP   2
     C                     Z-ADD0         NO
     C                     Z-ADD0         X       20
     C           D@PRC     SETLLABBPP81
     C                     DO   *HIVAL
     C           D@PRC     READEABBPP81                  90
     C   90                LEAVE
      *
     C                     SELEC
     C           A1GROP    WHEQ '01'
     C           NO,1      ADD  1         X
     C                     MOVELA1MCHN    M01,X
     C                     Z-ADDX         NO,1
     C           A1GROP    WHEQ '02'
     C           NO,2      ADD  1         X
     C                     MOVELA1MCHN    M02,X
     C                     Z-ADDX         NO,2
     C           A1GROP    WHEQ '03'
     C           NO,3      ADD  1         X
     C                     MOVELA1MCHN    M03,X
     C                     Z-ADDX         NO,3
     C           A1GROP    WHEQ '04'
     C           NO,4      ADD  1         X
     C                     MOVELA1MCHN    M04,X
     C                     Z-ADDX         NO,4
     C           A1GROP    WHEQ '05'
     C           NO,5      ADD  1         X
     C                     MOVELA1MCHN    M05,X
     C                     Z-ADDX         NO,5
     C           A1GROP    WHEQ '06'
     C           NO,6      ADD  1         X
     C                     MOVELA1MCHN    M06,X
     C                     Z-ADDX         NO,6
     C           A1GROP    WHEQ '07'
     C           NO,7      ADD  1         X
     C                     MOVELA1MCHN    M07,X
     C                     Z-ADDX         NO,7
     C           A1GROP    WHEQ '08'
     C           NO,8      ADD  1         X
     C                     MOVELA1MCHN    M08,X
     C                     Z-ADDX         NO,8
     C           A1GROP    WHEQ '09'
     C           NO,9      ADD  1         X
     C                     MOVELA1MCHN    M09,X
     C                     Z-ADDX         NO,9
     C           A1GROP    WHEQ '10'
     C           NO,10     ADD  1         X
     C                     MOVELA1MCHN    M10,X
     C                     Z-ADDX         NO,10
     C           A1GROP    WHEQ '11'
     C           NO,11     ADD  1         X
     C                     MOVELA1MCHN    M11,X
     C                     Z-ADDX         NO,11
     C           A1GROP    WHEQ '12'
     C           NO,12     ADD  1         X
     C                     MOVELA1MCHN    M12,X
     C                     Z-ADDX         NO,12
     C           A1GROP    WHEQ '13'
     C           NO,13     ADD  1         X
     C                     MOVELA1MCHN    M13,X
     C                     Z-ADDX         NO,13
     C           A1GROP    WHEQ '14'
     C           NO,14     ADD  1         X
     C                     MOVELA1MCHN    M14,X
     C                     Z-ADDX         NO,14
     C           A1GROP    WHEQ '15'
     C           NO,15     ADD  1         X
     C                     MOVELA1MCHN    M15,X
     C                     Z-ADDX         NO,15
     C           A1GROP    WHEQ '16'
     C           NO,16     ADD  1         X
     C                     MOVELA1MCHN    M16,X
     C                     Z-ADDX         NO,16
     C           A1GROP    WHEQ '17'
     C           NO,17     ADD  1         X
     C                     MOVELA1MCHN    M17,X
     C                     Z-ADDX         NO,17
JW2  C           A1GROP    WHEQ '18'
 |   C           NO,18     ADD  1         X
 |   C                     MOVELA1MCHN    M18,X
 |   C                     Z-ADDX         NO,18
JW2  C           A1GROP    WHEQ '19'
 |   C           NO,19     ADD  1         X
 |   C                     MOVELA1MCHN    M19,X
 |   C                     Z-ADDX         NO,19
JW2  C           A1GROP    WHEQ '20'
 |   C           NO,20     ADD  1         X
 |   C                     MOVELA1MCHN    M20,X
 |   C                     Z-ADDX         NO,20
JW2  C           A1GROP    WHEQ '21'
 |   C           NO,21     ADD  1         X
 |   C                     MOVELA1MCHN    M21,X
 |   C                     Z-ADDX         NO,21
JW2  C           A1GROP    WHEQ '22'
 |   C           NO,22     ADD  1         X
 |   C                     MOVELA1MCHN    M22,X
 |   C                     Z-ADDX         NO,22
JW2  C           A1GROP    WHEQ '23'
 |   C           NO,23     ADD  1         X
 |   C                     MOVELA1MCHN    M23,X
 |   C                     Z-ADDX         NO,23
JW2  C           A1GROP    WHEQ '24'
 |   C           NO,24     ADD  1         X
 |   C                     MOVELA1MCHN    M24,X
 |   C                     Z-ADDX         NO,24
JW2  C           A1GROP    WHEQ '25'
 |   C           NO,25     ADD  1         X
 |   C                     MOVELA1MCHN    M25,X
 |   C                     Z-ADDX         NO,25
JW2  C           A1GROP    WHEQ '26'
 |   C           NO,26     ADD  1         X
 |   C                     MOVELA1MCHN    M26,X
 |   C                     Z-ADDX         NO,26
JW2  C           A1GROP    WHEQ '27'
 |   C           NO,27     ADD  1         X
 |   C                     MOVELA1MCHN    M27,X
 |   C                     Z-ADDX         NO,27
JW2  C           A1GROP    WHEQ '28'
 |   C           NO,28     ADD  1         X
 |   C                     MOVELA1MCHN    M28,X
 |   C                     Z-ADDX         NO,28
JW2  C           A1GROP    WHEQ '29'
 |   C           NO,29     ADD  1         X
 |   C                     MOVELA1MCHN    M29,X
 |   C                     Z-ADDX         NO,29
JW2  C           A1GROP    WHEQ '30'
 |   C           NO,30     ADD  1         X
 |   C                     MOVELA1MCHN    M30,X
 |   C                     Z-ADDX         NO,30
JW2  C           A1GROP    WHEQ '31'
 |   C           NO,31     ADD  1         X
 |   C                     MOVELA1MCHN    M31,X
 |   C                     Z-ADDX         NO,31
JW2  C           A1GROP    WHEQ '32'
 |   C           NO,32     ADD  1         X
 |   C                     MOVELA1MCHN    M32,X
 |   C                     Z-ADDX         NO,32
JW2  C           A1GROP    WHEQ '33'
 |   C           NO,33     ADD  1         X
 |   C                     MOVELA1MCHN    M33,X
 |   C                     Z-ADDX         NO,33
JW2  C           A1GROP    WHEQ '34'
 |   C           NO,34     ADD  1         X
 |   C                     MOVELA1MCHN    M34,X
 |   C                     Z-ADDX         NO,34
JW2  C                     ENDSL
     C                     ENDDO
      *
      *
     C                     ENDSR
      *------------------------------------------------------
      *   2ND SCREEN
      *------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP02
JW2  C                     MOVE *BLANK    D@MSG
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL'01'      W@ID
     C           *INKE     WHEQ *ON
 |   C                     EXSR #CHK2
 |   C           EFLG      IFEQ 'N'
     C                     EXSR #UPD
     C                     MOVE '01'      W@ID
 |   C                     ELSE
JW2  C                     MOVELMSG,4     D@MSG
 |   C                     ENDIF
JW2  C           *IN86     WHEQ *ON
 |   C                     EXSR #CHK2
JW2  C                     MOVE '03'      W@ID
JW2  C           *IN87     WHEQ *ON
 |   C                     EXSR #CHK2
JW2  C                     MOVELMSG,2     D@MSG
JW2  C                     MOVE '02'      W@ID
     C                     OTHER
 |   C                     EXSR #CHK2
     C                     ENDSL
      *
     C                     ENDSR
JW2   *------------------------------------------------------
      *  CHECK 2
      *------------------------------------------------------
     C           #CHK2     BEGSR
      *
     C                     MOVE 'N'       EFLG    1
      * CLEAR INDICATOR
     C           21        DO   54        IZ      30
     C                     MOVE *OFF      *IN,IZ
     C                     ENDDO
     C           71        DO   85        IZ      30
     C                     MOVE *OFF      *IN,IZ
     C                     ENDDO
      * CREATE WORK TABLE
     C                     Z-ADD1         IX      30
     C                     MOVEAM01       WK
     C                     EXSR #BIG1
     C                     MOVEAM02       WK
     C                     EXSR #BIG1
     C                     MOVEAM03       WK
     C                     EXSR #BIG1
     C                     MOVEAM04       WK
     C                     EXSR #BIG1
     C                     MOVEAM05       WK
     C                     EXSR #BIG1
     C                     MOVEAM06       WK
     C                     EXSR #BIG1
     C                     MOVEAM07       WK
     C                     EXSR #BIG1
     C                     MOVEAM08       WK
     C                     EXSR #BIG1
     C                     MOVEAM09       WK
     C                     EXSR #BIG1
     C                     MOVEAM10       WK
     C                     EXSR #BIG1
     C                     MOVEAM11       WK
     C                     EXSR #BIG1
     C                     MOVEAM12       WK
     C                     EXSR #BIG1
     C                     MOVEAM13       WK
     C                     EXSR #BIG1
     C                     MOVEAM14       WK
     C                     EXSR #BIG1
     C                     MOVEAM15       WK
     C                     EXSR #BIG1
     C                     MOVEAM16       WK
     C                     EXSR #BIG1
     C                     MOVEAM17       WK
     C                     EXSR #BIG1
     C                     MOVEAM18       WK
     C                     EXSR #BIG1
     C                     MOVEAM19       WK
     C                     EXSR #BIG1
     C                     MOVEAM20       WK
     C                     EXSR #BIG1
     C                     MOVEAM21       WK
     C                     EXSR #BIG1
     C                     MOVEAM22       WK
     C                     EXSR #BIG1
     C                     MOVEAM23       WK
     C                     EXSR #BIG1
     C                     MOVEAM24       WK
     C                     EXSR #BIG1
     C                     MOVEAM25       WK
     C                     EXSR #BIG1
     C                     MOVEAM26       WK
     C                     EXSR #BIG1
     C                     MOVEAM27       WK
     C                     EXSR #BIG1
     C                     MOVEAM28       WK
     C                     EXSR #BIG1
     C                     MOVEAM29       WK
     C                     EXSR #BIG1
     C                     MOVEAM30       WK
     C                     EXSR #BIG1
     C                     MOVEAM31       WK
     C                     EXSR #BIG1
     C                     MOVEAM32       WK
     C                     EXSR #BIG1
     C                     MOVEAM33       WK
     C                     EXSR #BIG1
     C                     MOVEAM34       WK
     C                     EXSR #BIG1
      * CHECK DUPLICATE
     C           1         DO   510       IA      30
      * END IA?
     C           BG,IA     IFNE *BLANK
      *---------------------------------------
     C           1         DO   510       IB      30
     C           IA        IFNE IB
     C           BG,IB     ANDNE*BLANK
     C           BG,IB     ANDEQBG,IA
     C                     MOVE 'Y'       EFLG
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *----------------------------------------
     C           EFLG      IFEQ 'Y'
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
      * SET ERROR INDICATOR
     C           EFLG      IFEQ 'Y'
     C                     EXSR #BIG2
     C                     ENDIF
      *
JW2  C                     ENDSR
JW2   *------------------------------------------------------
 |    * CREATE WORK TABLE
 |    *------------------------------------------------------
 |   C           #BIG1     BEGSR
 |    *
     C           1         DO   15        IY      30
     C                     MOVELWK,IY     BG,IX
     C                     ADD  1         IX
     C                     ENDDO
      *
 |   C                     ENDSR
JW2   *------------------------------------------------------
 |    * SET INDICATOR
 |    *------------------------------------------------------
 |   C           #BIG2     BEGSR
 |    *
      * CALCULATE IA
     C           IA        DIV  15        V1      30
     C                     MVR            V2      52
     C                     Z-ADDV1        XX      30
     C           V2        IFNE 0
     C                     ADD  1         XX
     C                     ENDIF
     C                     MOVE XX        GRP1    2
     C           V1        MULT 15        WZ      30
     C           IA        SUB  WZ        YY      30
     C                     ADD  20        XX
     C                     ADD  70        YY
     C                     MOVE *ON       *IN,XX
     C                     MOVE *ON       *IN,YY
      * CALCULATE IB
     C           IB        DIV  15        V1      30
     C                     MVR            V2      52
     C                     Z-ADDV1        XX
     C           V2        IFNE 0
     C                     ADD  1         XX
     C                     ENDIF
     C                     MOVE XX        GRP2    2
      * MAKE MSG
     C                     MOVEAMSG,3     MG
     C                     MOVEABG,IA     TB
     C                     MOVE TB,1      MG,19
     C                     MOVE TB,2      MG,20
     C                     MOVE TB,3      MG,21
     C                     MOVEAGRP1      MG,39
     C                     MOVEAGRP1      TB
     C                     MOVE TB,1      MG,39
     C                     MOVE TB,2      MG,40
     C                     MOVEAGRP2      TB
     C                     MOVE TB,1      MG,46
     C                     MOVE TB,2      MG,47
     C                     MOVEAMG        D@MSG
      *
 |   C                     ENDSR
JW2   *------------------------------------------------------
 |    *   3RD SCREEN
 |    *------------------------------------------------------
 |   C           #SCRN3    BEGSR
 |    *
 |   C                     MOVE CMD,2     D@CMD
 |   C                     WRITEDSP99
 |   C                     EXFMTDSP03
 |   C                     MOVE *BLANK    D@MSG
 |   C**                   MOVE *ON       *IN01
 |   C**                   MOVE *ON       *IN22
 |    *
 |   C                     SELEC
 |   C           *INKA     WHEQ *ON
 |   C                     MOVEL'99'      W@ID
 |   C           *INKL     WHEQ *ON
 |   C                     MOVEL'01'      W@ID
 |   C           *INKE     WHEQ *ON
 |   C                     EXSR #CHK2
 |   C           EFLG      IFEQ 'N'
 |   C                     EXSR #UPD
 |   C                     MOVE '01'      W@ID
 |   C                     ELSE
JW2  C                     MOVELMSG,4     D@MSG
 |   C                     ENDIF
 |   C           *IN86     WHEQ *ON
 |   C                     EXSR #CHK2
JW2  C                     MOVELMSG,1     D@MSG
 |   C                     MOVE '03'      W@ID
 |   C           *IN87     WHEQ *ON
 |   C                     EXSR #CHK2
 |   C                     MOVE '02'      W@ID
 |   C                     OTHER
 |   C                     EXSR #CHK2
 |   C                     ENDSL
 |    *
JW2  C                     ENDSR
      *------------------------------------------------------
     C           #UPD      BEGSR
      *------------------------------------------------------
     C* DELETE
     C           D@PRC     SETLLABBPP81
     C                     DO   *HIVAL
     C           D@PRC     READEABBPP81                  90
     C   90                LEAVE
     C*
     C                     DELETABBPP811
     C                     ENDDO
     C* GROUP1
     C*JW1       1         DO   10        Y       20
JW1  C           1         DO   15        Y       20
     C           M01,Y     IFNE *BLANK
     C                     MOVEL'01'      K@GRP
     C                     MOVELM01,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP2
JW1  C           1         DO   15        Y       20
     C           M02,Y     IFNE *BLANK
     C                     MOVEL'02'      K@GRP
     C                     MOVELM02,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP3
JW1  C           1         DO   15        Y       20
     C           M03,Y     IFNE *BLANK
     C                     MOVEL'03'      K@GRP
     C                     MOVELM03,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP4
JW1  C           1         DO   15        Y       20
     C           M04,Y     IFNE *BLANK
     C                     MOVEL'04'      K@GRP
     C                     MOVELM04,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP5
JW1  C           1         DO   15        Y       20
     C           M05,Y     IFNE *BLANK
     C                     MOVEL'05'      K@GRP
     C                     MOVELM05,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP6
JW1  C           1         DO   15        Y       20
     C           M06,Y     IFNE *BLANK
     C                     MOVEL'06'      K@GRP
     C                     MOVELM06,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP7
JW1  C           1         DO   15        Y       20
     C           M07,Y     IFNE *BLANK
     C                     MOVEL'07'      K@GRP
     C                     MOVELM07,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP8
JW1  C           1         DO   15        Y       20
     C           M08,Y     IFNE *BLANK
     C                     MOVEL'08'      K@GRP
     C                     MOVELM08,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP9
JW1  C           1         DO   15        Y       20
     C           M09,Y     IFNE *BLANK
     C                     MOVEL'09'      K@GRP
     C                     MOVELM09,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP10
JW1  C           1         DO   15        Y       20
     C           M10,Y     IFNE *BLANK
     C                     MOVEL'10'      K@GRP
     C                     MOVELM10,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP11
JW1  C           1         DO   15        Y       20
     C           M11,Y     IFNE *BLANK
     C                     MOVEL'11'      K@GRP
     C                     MOVELM11,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP12
     C           1         DO   15        Y       20
JW1  C           M12,Y     IFNE *BLANK
     C                     MOVEL'12'      K@GRP
     C                     MOVELM12,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP13
JW1  C           1         DO   15        Y       20
     C           M13,Y     IFNE *BLANK
     C                     MOVEL'13'      K@GRP
     C                     MOVELM13,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP14
JW1  C           1         DO   15        Y       20
     C           M14,Y     IFNE *BLANK
     C                     MOVEL'14'      K@GRP
     C                     MOVELM14,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP15
JW1  C           1         DO   15        Y       20
     C           M15,Y     IFNE *BLANK
     C                     MOVEL'15'      K@GRP
     C                     MOVELM15,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP16
JW1  C           1         DO   15        Y       20
     C           M16,Y     IFNE *BLANK
     C                     MOVEL'16'      K@GRP
     C                     MOVELM16,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C* GROUP17
JW1  C           1         DO   15        Y       20
     C           M17,Y     IFNE *BLANK
     C                     MOVEL'17'      K@GRP
     C                     MOVELM17,Y     K@MCN
     C           K#81Y     CHAINABBPP81              95
     C           *IN95     IFEQ '1'
     C                     MOVE D@PRC     A1PROC
     C                     MOVE K@GRP     A1GROP
     C                     MOVE K@MCN     A1MCHN
     C                     WRITEABBPP811
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
JW2  C* GROUP18
 |   C           1         DO   15        Y       20
 |   C           M18,Y     IFNE *BLANK
 |   C                     MOVEL'18'      K@GRP
 |   C                     MOVELM18,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP19
 |   C           1         DO   15        Y       20
 |   C           M19,Y     IFNE *BLANK
 |   C                     MOVEL'19'      K@GRP
 |   C                     MOVELM19,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP20
 |   C           1         DO   15        Y       20
 |   C           M20,Y     IFNE *BLANK
 |   C                     MOVEL'20'      K@GRP
 |   C                     MOVELM20,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP21
 |   C           1         DO   15        Y       20
 |   C           M21,Y     IFNE *BLANK
 |   C                     MOVEL'21'      K@GRP
 |   C                     MOVELM21,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP22
 |   C           1         DO   15        Y       20
 |   C           M22,Y     IFNE *BLANK
 |   C                     MOVEL'22'      K@GRP
 |   C                     MOVELM22,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP23
 |   C           1         DO   15        Y       20
 |   C           M23,Y     IFNE *BLANK
 |   C                     MOVEL'23'      K@GRP
 |   C                     MOVELM23,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP24
 |   C           1         DO   15        Y       20
 |   C           M24,Y     IFNE *BLANK
 |   C                     MOVEL'24'      K@GRP
 |   C                     MOVELM24,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP25
 |   C           1         DO   15        Y       20
 |   C           M25,Y     IFNE *BLANK
 |   C                     MOVEL'25'      K@GRP
 |   C                     MOVELM25,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP26
 |   C           1         DO   15        Y       20
 |   C           M26,Y     IFNE *BLANK
 |   C                     MOVEL'26'      K@GRP
 |   C                     MOVELM26,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP27
 |   C           1         DO   15        Y       20
 |   C           M27,Y     IFNE *BLANK
 |   C                     MOVEL'27'      K@GRP
 |   C                     MOVELM27,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP28
 |   C           1         DO   15        Y       20
 |   C           M28,Y     IFNE *BLANK
 |   C                     MOVEL'28'      K@GRP
 |   C                     MOVELM28,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP29
 |   C           1         DO   15        Y       20
 |   C           M29,Y     IFNE *BLANK
 |   C                     MOVEL'29'      K@GRP
 |   C                     MOVELM29,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP30
 |   C           1         DO   15        Y       20
 |   C           M30,Y     IFNE *BLANK
 |   C                     MOVEL'30'      K@GRP
 |   C                     MOVELM30,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP31
 |   C           1         DO   15        Y       20
 |   C           M31,Y     IFNE *BLANK
 |   C                     MOVEL'31'      K@GRP
 |   C                     MOVELM31,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP32
 |   C           1         DO   15        Y       20
 |   C           M32,Y     IFNE *BLANK
 |   C                     MOVEL'32'      K@GRP
 |   C                     MOVELM32,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP33
 |   C           1         DO   15        Y       20
 |   C           M33,Y     IFNE *BLANK
 |   C                     MOVEL'33'      K@GRP
 |   C                     MOVELM33,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
JW2  C* GROUP34
 |   C           1         DO   15        Y       20
 |   C           M34,Y     IFNE *BLANK
 |   C                     MOVEL'34'      K@GRP
 |   C                     MOVELM34,Y     K@MCN
 |   C           K#81Y     CHAINABBPP81              95
 |   C           *IN95     IFEQ '1'
 |   C                     MOVE D@PRC     A1PROC
 |   C                     MOVE K@GRP     A1GROP
 |   C                     MOVE K@MCN     A1MCHN
 |   C                     WRITEABBPP811
 |   C                     ENDIF
 |   C                     ENDIF
JW2  C                     ENDDO
      *
     C                     ENDSR
** CMD
 F1:END
 F1:END     F5:UPDATE    F12:GO BACK   P/U:SCREEN1   P/D:SCREEN2
** MSG
 ** SCREEN REACHED END OF PAGE **
 ** SCREEN REACHED BEGINING OF PAGE **
DUPLICATE MACHINE MMM EXISTS IN GROUP XX AND YY
F5:UPDATE DOES NOT RUN BECAUSE OF ERROR!
