     H            Y.
      ** ABBR37 *******************************************************
      * BUILD OUT INFO. FROM EDI INQUIRY
      *  KIRI                                                2018.08.06
JW1   * JW    2024.12.09 CHG ABBR25 TO ABBR25A
      *****************************************************************
     FABBPW37 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFREC1
     F                                              KINFDS INFDS
      *
      * ... FORECAST HISTORYORECAST DATA ACCUMULATION FILE   *.
     FABBPL50 IF  E           K        DISK
     FABBPL51 IF  E           K        DISK
     F            ABBPP501                          KRENAMEABBPL511
      *===============================================================
     E                    ER      1  10 60
      *
     E                    @M       9999 45
      *===============================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
      *プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *
      *--------------------------------------------
      *
      * MATERIAL BARCODE 1,2
     I            DS
     I                                        1   8 J1ZBR1
     I                                        1   7 J$ZBR1
     I            DS
     I                                        1   8 J1ZBR2
     I                                        1   7 J$ZBR2
      *--------------------------------------------
     I            DS
     I                                        1   5 D2LOC
     I                                        1   2 D1LOC2
     I                                        3   3 D2LHF
     I                                        4   5 D1LOC3
      *
     I            DS
     I                                        1  14 D2SHN
     I                                        1   5 D1SHN1
     I                                        6   6 D1SF1
     I                                        7  11 D1SHN2
     I                                       12  12 D1SF2
     I                                       13  14 D1SHN3
      *
     I            DS
     I                                        1  23 D2MHN
     I                                        1   5 D1MHN1
     I                                        6   6 D1MF1
     I                                        7  11 D1MHN2
     I                                       12  12 D1MF2
     I                                       13  17 D1MHN3
     I                                       18  18 D1MF3
     I                                       19  23 D1MHN4
      *
      *
     I            DS
     I                                        1  14 S1SHN
     I                                        1   5 K$SHN1
     I                                        6   6 $SHF1
     I                                        7  11 K$SHN2
     I                                       12  12 $SHF2
     I                                       13  14 K$SHN3
      *
     I            DS
     I                                        1  23 S1MHN
     I                                        1   5 K$MHN1
     I                                        6   6 $MHF1
     I                                        7  11 K$MHN2
     I                                       12  12 $MHF2
     I                                       13  17 K$MHN3
     I                                       18  18 $MHF3
     I                                       19  23 K$MHN4
      *
      *           BBTOKU         4  0       COLHDG('CUSTOMER')
      *           BBNONY         4  0       COLHDG('DELIVERY CODE')
      *           BBNKOJ         1          COLHDG('FACTORY')
      *           BBNUKE         4          COLHDG('DOCK')
      *           BBMHN1         5          COLHDG('USER PART1')
      *           BBMHN2         5          COLHDG('USER PART2')
      *           BBMHN3         5          COLHDG('USER PART3')
      *           BBMHN4         5          COLHDG('USER PART4')
      *           BBSHN1         5          COLHDG('IAF PART1')
      *           BBSHN2         5          COLHDG('IAF PART2')
      *           BBSHN3         2          COLHDG('IAF PART3')
      *
     I            DS
     I                                        1  45 KEY
     I                                        1   40BBTOKU
     I                                        5   80BBNONY
     I                                        9   9 BBNKOJ
     I                                       10  13 BBNUKE
     I                                       14  18 BBMHN1
     I                                       19  23 BBMHN2
     I                                       24  28 BBMHN3
     I                                       29  33 BBMHN4
     I                                       34  38 BBSHN1
     I                                       39  43 BBSHN2
     I                                       44  45 BBSHN3
      *
     I            DS
     I                                        1  20 P@MHN
     I                                        1   5 P@MHN1
     I                                        6  10 P@MHN2
     I                                       11  15 P@MHN3
     I                                       16  20 P@MHN4
      *
      *
     I            DS
     I                                        1  12 P@SHN
     I                                        1   5 P@SHN1
     I                                        6  10 P@SHN2
     I                                       11  12 P@SHN3
     C*===============================================================
     C*
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVE '#INIT   '@STEP   8
      *
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * 初期ﾈｮmb
      *===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           @TIME
      *
     C                     CLEARDSP01
     C                     MOVE '#DSP1   '@STEP
      *
     C                     ENDSR
      *===============================================================
      *  指示画面
      *===============================================================
     C           #DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     SETOF                     99
     C                     MOVEA'00000000'*IN,21           21-28
     C                     MOVE *BLANK    D1ERR
      *
     C                     SELEC
     C* < F1 >
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C* <    >
     C                     OTHER
     C                     MOVE '#CHK1   '@STEP
     C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
      *  指示画面チェック
      *===============================================================
     C           #CHK1     BEGSR
      *
      * RECEIVE DATE (21 22)
      *
     C           D1DAT1    IFEQ 0
     C                     SETON                     2199
     C                     MOVELER,1      D1ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
     C*
     C                     MOVELD1DAT1    P$DATE
     C                     CALL 'DATR10'
     C                     PARM           P$DATE  8
     C                     PARM           P$RTN   1
     C*PRTN='1':NG
     C           P$RTN     IFEQ '1'
     C                     SETON                     2199
     C                     MOVELER,2      D1ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
      *
     C           D1DAT2    IFEQ 0
     C                     SETON                     2299
     C                     MOVELER,1      D1ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
     C*
     C                     MOVELD1DAT2    P$DATE
     C                     CALL 'DATR10'
     C                     PARM           P$DATE  8
     C                     PARM           P$RTN   1
     C*PRTN='1':NG
     C           P$RTN     IFEQ '1'
     C                     SETON                     2299
     C                     MOVELER,2      D1ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
     C*
     C           D1DAT1    IFGT D1DAT2
     C                     SETON                     212299
     C                     MOVELER,3      D1ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
      *
      * IFA PART # (23)
      *
     C*          D1SHN1
     C*          D1SHN2
     C*          D1SHN3
     C                     MOVE '-'       D1SF1
     C                     MOVE '-'       D1SF2
     C           D1SHN3    IFEQ *BLANK
     C                     MOVE ' '       D1SF2
     C           D1SHN2    IFEQ *BLANK
     C                     MOVE ' '       D1SF1
     C                     ENDIF
     C                     ENDIF
      *
      * CUSTOMER PART # (24)
      *
     C*          D1MHN1
     C*          D1MHN2
     C*          D1MHN3
     C*          D1MHN4
     C                     MOVE '-'       D1MF1
     C                     MOVE '-'       D1MF2
     C                     MOVE '-'       D1MF3
     C           D1MHN4    IFEQ *BLANK
     C                     MOVE ' '       D1MF3
     C           D1MHN3    IFEQ *BLANK
     C                     MOVE ' '       D1MF2
     C           D1MHN2    IFEQ *BLANK
     C                     MOVE ' '       D1MF1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      * CUSTOMER (25)
      * DELIVERY (26)
      * FACTRY   (27)
      * DOCK     (28)
      *
      *
      *
      *サブファイル作成
      *
     C           D1DAT1    SETLLABBPL50
     C                     MOVE '        '@STEP
     C                     EXSR #SFSET
      *
S1   C           ENDRRN    IFEQ 0
     C                     SETON                     99
     C                     SETON                     2122
 S2  C           D1SHN1    IFNE *BLANK
     C           D1SHN2    ORNE *BLANK
     C           D1SHN3    ORNE *BLANK
     C                     SETON                     23
 E2  C                     ENDIF
 S2  C           D1MHN1    IFNE *BLANK
     C           D1MHN2    ORNE *BLANK
     C           D1MHN3    ORNE *BLANK
     C           D1MHN4    ORNE *BLANK
     C                     SETON                     24
 E2  C                     ENDIF
      * CUSTOMER (25)
 S2  C           D1TOKU    COMP *BLANK               2525
 S2  C           D1NONY    COMP *BLANK               2626
 S2  C           D1NKOJ    COMP *BLANK               2727
 S2  C           D1NUKE    COMP *BLANK               2828
      * DELIVERY (26)
      * FACTRY   (27)
      * DOCK     (28)
     C                     MOVELER,6      D1ERR
     C                     GOTO $CHK1Z
E1   C                     ENDIF
      *-------------------------*
     C           $CHK1Z    TAG
      *-------------------------*
     C           *IN99     IFEQ *OFF
     C                     MOVE '#DSP2   '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C                     ENDSR
      *===============================================================
      *  照会画面作成(PAGE UP/DOWN)
      *===============================================================
     C           #SFSET    BEGSR
     C*
     C                     SETON                     73    SFLCLR
     C                     WRITESFCTL1
     C                     SETOF                     73
     C*
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
     C                     Z-ADD0         X       40
     C                     MOVEL*BLANK    @M
     C*-----------------------------------
      * ... FORECAST HISTORYORECAST DATA ACCUMULATION FILE   *.
     C*-----------------------------------
S1   C                     DO   *HIVAL
     C                     READ ABBPL50                  90
     C*   ( RECEIVE DATE )
     C  N90      BBRCDT    IFGT D1DAT2
     C                     SETON                     90
     C                     ENDIF
     C   90                LEAVE
     C*
     C*   ( BUILD OUT FLAG )
     C           BBBFLG    IFNE '1'
     C                     ITER
     C                     ENDIF
     C*
     C                     EXSR #SEL
     C           @NG       IFEQ '*'
     C                     ITER
     C                     ENDIF
     C*                               50:処理済
     C           KEY       LOKUP@M                       50:EQ
 S2  C           *IN50     IFEQ *ON
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVE *BLANK    S1SEL
     C                     MOVE BBTOKU    S1TOKU
     C                     MOVE BBNONY    S1NONY
     C                     MOVE BBNKOJ    S1NKOJ
     C                     MOVE BBNUKE    S1NUKE
     C                     Z-ADDBBRCDT    S1RCDT           RCV DATE
     C                     Z-ADDBBSDAT    S1SDAT           SCHEDULE DATE
     C                     Z-ADDBBRCDT    S2RCDT           RCV DATE
     C                     Z-ADDBBSDAT    S2SDAT           SCHEDULE DATE
     C                     MOVELBBSEBN    S1SEBN           ID#
     C                     EXSR ##LAST
     C                     MOVE '-'       $SHF1
     C                     MOVE '-'       $SHF2
     C           K$SHN3    IFEQ *BLANK
     C                     MOVE ' '       $SHF2
     C           K$SHN2    IFEQ *BLANK
     C                     MOVE ' '       $SHF1
     C                     ENDIF
     C                     ENDIF
     C                     MOVE '-'       $MHF1
     C                     MOVE '-'       $MHF2
     C                     MOVE '-'       $MHF3
     C           K$MHN4    IFEQ *BLANK
     C                     MOVE ' '       $MHF3
     C           K$MHN3    IFEQ *BLANK
     C                     MOVE ' '       $MHF2
     C           K$MHN2    IFEQ *BLANK
     C                     MOVE ' '       $MHF1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         X
     C                     MOVELKEY       @M,X
     C*
     C*---------------
     C*
     C                     ADD  1         RRN1
     C                     WRITESFREC1
     C*---------------
E1   C                     ENDDO
     C*-------------------------
     C*-------------------------
     C                     Z-ADDRRN1      ENDRRN  40
     C                     Z-ADD1         RRN     40
     C*--------------------
     C                     ENDSR
      *===============================================================
      *選択（第一画面条件で検索）
      *===============================================================
     C           #SEL      BEGSR
      *
     C                     MOVE ' '       @NG     1
      *
      * IAF PART#
      *
     C           D1SHN1    IFNE *BLANK
     C           D1SHN1    ANDNEBBSHN1
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C*
     C           D1SHN2    IFNE *BLANK
     C           D1SHN2    ANDNEBBSHN2
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C*
     C           D1SHN3    IFNE *BLANK
     C           D1SHN3    ANDNEBBSHN3
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
      *
      * CUSTMER PART#
      *
     C           D1MHN1    IFNE *BLANK
     C           D1MHN1    ANDNEBBMHN1
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C*
     C           D1MHN2    IFNE *BLANK
     C           D1MHN2    ANDNEBBMHN3
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C*
     C           D1MHN3    IFNE *BLANK
     C           D1MHN3    ANDNEBBMHN3
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C*
     C           D1MHN4    IFNE *BLANK
     C           D1MHN4    ANDNEBBMHN4
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
      *
      *('CUSTOMER')
      *
     C           D1TOKU    IFNE *BLANK
     C                     MOVE D1TOKU    $$TOKU  40
     C           $$TOKU    IFNE BBTOKU
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C                     ENDIF
      *
      *('DELIVERY CODE')
      *
     C           D1NONY    IFNE *BLANK
     C                     MOVE D1NONY    $$NONY  40
     C           $$NONY    IFNE BBNONY
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
     C                     ENDIF
      *
      *('FACTORY')
      *
     C           D1NKOJ    IFNE *BLANK
     C           D1NKOJ    ANDNEBBNKOJ
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
      *
      *('DOCK')
      *
     C           D1NUKE    IFNE *BLANK
     C           D1NUKE    ANDNEBBNUKE
     C                     MOVE '*'       @NG
     C                     GOTO $SELZ
     C                     ENDIF
      *
      *
     C           $SELZ     ENDSR
      *===============================================================
      *   LAST RCV,SCHEDULE DATA
      *===============================================================
     C           ##LAST    BEGSR
     C                     Z-ADDBBTOKU    K$TOKU  40
     C                     Z-ADDBBNONY    K$NONY  40       DELIVERY CODE
     C                     MOVELBBNKOJ    K$NKOJ  1        FACTORY
     C                     MOVELBBNUKE    K$NUKE  4        DOCK
     C                     MOVELBBMHN1    K$MHN1  5        USER PART1
     C                     MOVELBBMHN2    K$MHN2  5        USER PART2
     C                     MOVELBBMHN3    K$MHN3  5        USER PART3
     C                     MOVELBBMHN4    K$MHN4  5        USER PART4
     C                     Z-ADDBBRCDT    K$RCDT  80       RCV DATE
     C                     Z-ADDBBSDAT    K$SDAT  80       SCHEDULE DATE
     C                     MOVELBBSHN1    K$SHN1  5        IAF PART1
     C                     MOVELBBSHN2    K$SHN2  5        IAF PART2
     C                     MOVELBBSHN3    K$SHN3  2        IAF PART3
     C           KEY01A    KLIST
     C                     KFLD           K$NONY  40       DELIVERY CODE
     C                     KFLD           K$NKOJ  1        FACTORY
     C                     KFLD           K$NUKE  4        DOCK
     C                     KFLD           K$MHN1  5        USER PART1
     C                     KFLD           K$MHN2  5        USER PART2
     C                     KFLD           K$MHN3  5        USER PART3
     C                     KFLD           K$MHN4  5        USER PART4
     C                     KFLD           K$RCDT  80       RCV DATE
     C                     KFLD           K$SDAT  80       SCHEDULE DATE
     C           KEY01B    KLIST
     C                     KFLD           K$NONY  40       DELIVERY CODE
     C                     KFLD           K$NKOJ  1        FACTORY
     C                     KFLD           K$NUKE  4        DOCK
     C                     KFLD           K$MHN1  5        USER PART1
     C                     KFLD           K$MHN2  5        USER PART2
     C                     KFLD           K$MHN3  5        USER PART3
     C                     KFLD           K$MHN4  5        USER PART4
     C*
     C           KEY01A    SETLLABBPL51
      *-----------------------------------
S1   C                     DO   *HIVAL
     C           KEY01B    READEABBPL51                  91
     C  N91      BBRCDT    IFGT D1DAT2
     C                     SETON                     91
     C                     ENDIF
     C   91                LEAVE
     C*   ( BUILD OUT FLAG )
     C           BBBFLG    IFNE '1'
     C                     ITER
     C                     ENDIF
     C*
     C*
     C           BBTOKU    IFNE K$TOKU
     C           BBSHN1    ORNE K$SHN1                     IAF PART1
     C           BBSHN2    ORNE K$SHN2                     IAF PART2
     C           BBSHN3    ORNE K$SHN3                     IAF PART3
     C                     ITER
     C                     ENDIF
     C*
     C                     Z-ADDBBRCDT    S2RCDT           RCV DATE
     C                     Z-ADDBBSDAT    S2SDAT           SCHEDULE DATE
E1   C                     ENDDO
      *-----------------------------------
     C*
     C                     ENDSR
      *===============================================================
      *===============================================================
      *  画面２　表示
      *===============================================================
     C           #DSP2     BEGSR
     C*
     C                     WRITEDSP02
     C*
     C                     SETON                     71
     C           ENDRRN    IFNE 0
     C                     SETON                     72
     C                     ENDIF
     C                     EXFMTSFCTL1
     C                     SETOF                     717299
     C                     Z-ADD$$RRN     RRN     40
     C                     MOVE *BLANK    D2ERR
     C*
      *
S1   C                     SELEC
     C*
     C*  < F3 > 前画面
     C           *INKC     WHEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C*
     C*  < ROLL/UP DOWN >
-1   C           *IN75     WHEQ *ON
-1   C           *IN76     OREQ *ON
     C                     MOVE '#DSP2   '@STEP
     C*  <              >
     C                     OTHER
     C                     EXSR #CHK2
E1   C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
      *===============================================================
     C           #CHK2     BEGSR
      *-------------------------
     C                     DO   ENDRRN    RRN1
     C           RRN1      CHAINSFREC1               92
     C   92                LEAVE
     C*---------------
     C           S1SEL     IFEQ 'M'
     C           S1SEL     OREQ 'S'
     C                     MOVELK$MHN1    P@MHN1
     C                     MOVELK$MHN2    P@MHN2
     C                     MOVELK$MHN3    P@MHN3
     C                     MOVELK$MHN4    P@MHN4
     C                     MOVELK$SHN1    P@SHN1
     C                     MOVELK$SHN2    P@SHN2
     C                     MOVELK$SHN3    P@SHN3
     C           S1SEL     IFEQ 'S'
     C                     MOVE *BLANK    P@MHN
     C                     ENDIF
     C**                   CALL 'ABBR25'
JW1  C                     CALL 'ABBR25A'
     C                     PARM           P@SHN  12
     C                     PARM           P@MHN  20
     C                     PARM S1TOKU    P@TOKU  4
     C                     PARM S1NONY    P@NONY  4
     C                     PARM S1NKOJ    P@NKOJ  1
     C                     PARM S1NUKE    P@NUKE  4
     C                     PARM S1SEBN    P@SEBN  4
     C                     MOVE ' '       S1SEL
     C                     UPDATSFREC1
     C                     ENDIF
     C*---------------
E1   C                     ENDDO
      *-------------------------
     C                     MOVE '#DSP2   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      *===============================================================
      *===============================================================
**  ER  (ERROR MESSAGE )
E-01 INPUT ISSUE DATE
E-02 ISSUE DATE ISN'T RIGHT
E-03 DATE TIME ERROR  START > EXIT
E-04 KANBAN KIND ERROR (BLANK , A , B )
E-05 PUBLICATION KIND ERROR (BLANK , 1 , 2 )
E-06 THERE ISN'T APPLICABLE DATA.
E-07 THE FIRST DATA.
E-08 THE LAST DATA.
