     H            Y/
     F***************************************************
     F*  DEMAND QTY VS. SETTING QTY                     *
     F*                                                 *
     F*                                                 *
     F*    APR/08/02     TCH                            *
     F*          SET QTY = 20 WORK DAYS                 *
     F*    JUL/18/03     TCH                            *
     F*          ADD % UNDER                            *
     F*    AUG/08/03     TCH                            *
     F*          ADD QTY/CONT.
     F*    OCT/22/03     TCH                            *
     F*          BASE QTY = BOX/DAY
     F***************************************************
     FABBPW55 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FFCEPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FABBPL02 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFAAPL05 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FABBPL54 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *------------------------------------------------------------
     E                    TTL     1   1 45
     E                    FGK        10  9 0
     E                    FGH        10  8 0
     E                    MON         2  6 0
     E                    DAY         2  2 0
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   60@@MDY
     I                                        1   20@@MM
     I                                        3   40@@DD
     I                                        5   60@@YY
     I            DS
     I                                        1  12 Q5HIN
     I                                        1   5 Q5SHN1
     I                                        6  10 Q5SHN2
     I                                       11  12 Q5SHN3
     I            DS
     I                                        1  12 B7HIN
     I                                        1   5 B7SHN1
     I                                        6  10 B7SHN2
     I                                       11  12 B7SHN3
     I            DS
     I                                        1  900FGK
     I                                        1   90FCGK01
     I                                       10  180FCGK02
     I                                       19  270FCGK03
     I                                       28  360FCGK04
     I                                       37  450FCGK05
     I                                       46  540FCGK06
     I                                       55  630FCGK07
     I                                       64  720FCGK08
     I                                       73  810FCGK09
     I                                       82  900FCGK10
     I            DS
     I                                        1  800FGH
     I                                        1   80FCGH01
     I                                        9  160FCGH02
     I                                       17  240FCGH03
     I                                       25  320FCGH04
     I                                       33  400FCGH05
     I                                       41  480FCGH06
     I                                       49  560FCGH07
     I                                       57  640FCGH08
     I                                       65  720FCGH09
     I                                       73  800FCGH10
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I                                        1   60K@YM
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#KEY     KLIST
     C                     KFLD           K@SHN1
     C                     KFLD           K@SHN2
     C                     KFLD           K@SHN3
     C           K#FAA     KLIST
     C                     KFLD           Q5MHN1
     C                     KFLD           Q5MHN2
     C                     KFLD           Q5MHN3
     C                     KFLD           Q5MHN4
     C                     KFLD           Q5TOKU
     C                     KFLD           Q5NONY
     C                     KFLD           Q5NKOJ
     C                     KFLD           Q5NUKE
     C           K#ZKY     KLIST
     C                     KFLD           Z@SHN1
     C                     KFLD           Z@SHN2
     C                     KFLD           Z@SHN3
     C           K#QKY     KLIST
     C                     KFLD           Q5SHN1
     C                     KFLD           Q5SHN2
     C                     KFLD           Q5SHN3
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
      *
     C           *LIKE     DEFN Q5SHN1    K@SHN1
     C           *LIKE     DEFN Q5SHN2    K@SHN2
     C           *LIKE     DEFN Q5SHN3    K@SHN3
     C           *LIKE     DEFN Q5SHN1    Z@SHN1
     C           *LIKE     DEFN Q5SHN2    Z@SHN2
     C           *LIKE     DEFN Q5SHN3    Z@SHN3
      *
     C                     MOVEL'01'      W@ID    2
     C                     TIME           W@TIME
     C                     Z-ADDW@YY      @@YY
     C                     Z-ADDW@MM      @@MM
     C                     Z-ADDW@DD      @@DD
     C                     Z-ADD130       D@PCNT
      *
     C                     Z-ADD*DATE     K@YMD
     C                     Z-ADD*ZERO     MON
     C                     Z-ADD*ZERO     DAY
      *
     C           1         DO   2         X       20
     C                     Z-ADD*ZERO     @DAY    20
     C                     ADD  1         K@MM
     C           K@MM      IFGT 12
     C                     SUB  12        K@MM
     C                     ADD  1         K@YY
     C                     ENDIF
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C           K#AGD     READEAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     ADD  1         @DAY
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDK@YM      MON,X
     C                     Z-ADD@DAY      DAY,X
      *
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     EXFMTABBPW551
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #PRT
     C                     MOVEL'99'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     616299
     C                     SETOF                     63
     C           D@PCNT    IFEQ *ZERO
     C           D@PCNX    ANDEQ*ZERO
     C                     SETON                     996163
     C                     ENDIF
     C           D@PCNT    IFNE *ZERO
     C           D@PCNX    ANDNE*ZERO
     C                     SETON                     996163
     C                     ENDIF
     C           D@OPTN    IFNE *BLANK
     C           D@OPTN    ANDNE'A'
     C           D@OPTN    ANDNE'B'
     C                     SETON                     9962
     C                     ENDIF
      *
     C           D@PCNT    COMP 0                    01
     C           D@PCNX    COMP 0                    02
      *
     C                     ENDSR
      *------------------------------------------------------
      *   OUTPUT
      *------------------------------------------------------
     C           #PRT      BEGSR
      *
     C                     MOVE *ALL'-'   @@LINE132
     C                     MOVE *BLANK    WWHIN  12
     C                     Z-ADD*ZERO     WWQTY   90
     C                     Z-ADD*ZERO     WWQT1   90
     C                     Z-ADD*ZERO     WWQT2   90
     C                     Z-ADD*ZERO     WWYM    30
     C                     MOVE *OFF      *IN98
     C           *LOVAL    SETLLABBPL02
     C           *IN90     DOUEQ*ON
     C                     READ ABBPL02                  90
     C           *IN90     IFEQ *OFF
     C           WWHIN     ANDNE*BLANK
     C           WWHIN     ANDNEQ5HIN
     C           *IN90     OREQ *ON
     C           WWHIN     ANDNE*BLANK
      *
     C           WWYM      IFEQ *ZERO
     C                     Z-ADDQ5NTYM    WWYM
     C                     ENDIF
      *
     C           K#KEY     CHAINFCEPL11              91
     C           *IN91     IFEQ *OFF
     C           FCSKJY    IFEQ *BLANK
     C*******              Z-ADDFGK,1     W@NQTY  90
     C           FGK,1     DIV  FCCD01    W@ANS  112H
     C                     Z-ADDW@ANS     W@DQTY  90
     C           W@ANS     MULT 20        W@NQTY  90H
      *
     C                     ELSE
     C                     MOVE *ON       *IN91
     C                     ENDIF
     C                     ENDIF
      *
     C           XXHIN     IFNE *BLANK
     C           K#ZKY     CHAINFCEPL11              91
     C           *IN91     IFEQ *OFF
     C           FCSKJY    IFEQ *BLANK
     C*****                Z-ADDFGK,1     W@NQTY
     C           FGK,1     DIV  FCCD01    W@ANS  112H
     C           W@ANS     MULT 20        W@NQTY  90H
      *
     C                     ELSE
     C                     MOVE *ON       *IN91
     C                     ENDIF
     C                     ENDIF
      *
     C           K#ZKY     SETLLABBPL02
     C           *IN93     DOUEQ*ON
     C           K#ZKY     READEABBPL02                  93
     C           *IN93     IFEQ *OFF
     C           Q5NTYM    IFEQ MON,1
     C                     ADD  Q5NNNM    WWQT1
     C                     ADD  Q51NNM    WWQT2
     C                     ELSE
     C                     ADD  Q51NNM    WWQT1
     C                     ADD  Q52NNM    WWQT2
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN91     IFEQ *OFF
      *
     C           WWQT1     DIV  DAY,1     @@QT1   90
     C           WWQT2     DIV  DAY,2     @@QT2   90
      *
     C****       WWQT1     DIV  W@NQTY    WWPCN   52H
     C           @@QT1     DIV  W@ANS     WWPCN   52H
     C           WWPCN     MULT 100       WPCN1   50
     C***        WWQT2     DIV  W@NQTY    WWPCN   52H
     C           @@QT2     DIV  W@ANS     WWPCN   52H
     C           WWPCN     MULT 100       WPCN2   50
     C           D@PCNT    IFGT *ZERO
     C           WPCN1     ANDGED@PCNT
     C           D@PCNT    ORGT *ZERO
     C           WPCN2     ANDGED@PCNT
      *
     C           D@PCNX    ORGT *ZERO
     C           WPCN1     ANDLED@PCNX
     C           WPCN2     ANDLED@PCNX
      *
     C           D@PCNT    IFGT *ZERO
     C           WPCN1     IFGE D@PCNT
     C                     Z-ADDWWQT1     WWQTY   90
     C                     Z-ADDWPCN1     WPCNT   50
     C                     ELSE
     C                     Z-ADDWWQT2     WWQTY   90
     C                     Z-ADDWPCN2     WPCNT   50
     C                     ENDIF
     C                     ENDIF
      *
     C           D@PCNX    IFGT *ZERO
     C           WPCN1     ANDLED@PCNX
     C           WPCN2     ANDLED@PCNX
     C           WWQT1     IFGT WWQT2
     C                     Z-ADDWWQT1     WWQTY   90
     C                     Z-ADDWPCN1     WPCNT   50
     C                     ELSE
     C                     Z-ADDWWQT2     WWQTY
     C                     Z-ADDWPCN2     WPCNT
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     @@ACT   90
     C           K#KEY     SETLLMBDPL01
     C           *IN95     DOUEQ*ON
     C           K#KEY     READEMBDPL01                  95
     C           *IN95     IFEQ *OFF
     C           F3SKJY    ANDEQ*BLANK
     C                     ADD  F3TNSU    @@ACT
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     EXSR #OUT
     C                     ENDIF
     C                     ENDIF
     C   90                LEAVE
      *
     C                     Z-ADD*ZERO     WWQT1
     C                     Z-ADD*ZERO     WWQT2
     C                     MOVE *BLANK    WWHIN
     C                     MOVE *BLANK    XXHIN  12
     C           K#KEY     SETGTABBPL02
     C                     ITER
     C                     ENDIF
      *
     C           D@PCNX    IFNE *ZERO
     C           Q5TOKU    ANDNE5149
     C           K#QKY     CHAINABBPL54              95
     C           *IN95     IFEQ *ON
     C           K#QKY     SETGTABBPL02
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C           D@OPTN    IFNE *BLANK
      *
     C           K#QKY     SETGTAAPTL011
     C           *IN10     DOUEQ*ON
     C           K#QKY     REDPEAAPTL011                 10
     C           *IN10     IFEQ '0'
     C           L5SKJY    ANDEQ*BLANK
     C           L5STYY    ANDEQ9999
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN10     IFEQ *ON
     C           K#QKY     SETGTAANPL061
     C           *IN10     DOUEQ*ON
     C           K#QKY     REDPEAANPL061                 10
     C           *IN10     IFEQ '0'
     C           L7SKJY    ANDEQ*BLANK
     C           L7STYY    ANDEQ9999
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           D@OPTN    IFEQ 'A'
     C           *IN10     ANDEQ*OFF
     C           K#QKY     SETGTABBPL02
     C                     ITER
     C                     ENDIF
      *
     C           D@OPTN    IFEQ 'B'
     C           *IN10     ANDEQ*ON
     C           K#QKY     SETGTABBPL02
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    XXHIN  12
     C           K#FAA     SETLLFAAPL05
     C           *IN92     DOUEQ*ON
     C           K#FAA     READEFAAPL05                  92
     C           *IN92     IFEQ *OFF
     C           B7SKBN    ANDEQ*BLANK
     C           Q5HIN     ANDNEB7HIN
     C                     MOVE B7HIN     XXHIN
     C                     MOVE B7SHN1    Z@SHN1
     C                     MOVE B7SHN2    Z@SHN2
     C                     MOVE B7SHN3    Z@SHN3
     C*********            LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELQ5HIN     WWHIN
     C                     MOVE Q5SHN1    K@SHN1
     C                     MOVE Q5SHN2    K@SHN2
     C                     MOVE Q5SHN3    K@SHN3
     C           Q5NTYM    IFEQ MON,1
     C                     ADD  Q5NNNM    WWQT1
     C                     ADD  Q51NNM    WWQT2
     C                     ELSE
     C                     ADD  Q51NNM    WWQT1
     C                     ADD  Q52NNM    WWQT2
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR LIST
      *------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     MOVE *OFF      *IN97
     C           XXHIN     IFNE *BLANK
     C           K#ZKY     SETLLABBPL02
     C                     ELSE
     C           K#KEY     SETLLABBPL02
     C                     ENDIF
      *
     C           *IN92     DOUEQ*ON
     C           XXHIN     IFNE *BLANK
     C           K#ZKY     READEABBPL02                  92
     C                     ELSE
     C           K#KEY     READEABBPL02                  92
     C                     ENDIF
      *
     C           *IN92     IFEQ *OFF
     C           Q5NTYM    IFEQ MON,1
     C                     Z-ADDQ5NNNM    XXQT1   90
     C                     Z-ADDQ51NNM    XXQT2   90
     C                     ELSE
     C                     Z-ADDQ51NNM    XXQT1
     C                     Z-ADDQ52NNM    XXQT2
     C                     ENDIF
     C           XXQT1     IFNE *ZERO
     C           XXQT2     ORNE *ZERO
      *
     C   OF                MOVE *OFF      *IN97
     C  N98
     COR OF                EXCPT@HED
     C  N98                MOVE *ON       *IN98
      *
     C           XXHIN     IFNE *BLANK
     C                     MOVE XXHIN     Q5HIN
     C                     ENDIF
      *
     C           Q5SHN2    COMP *BLANK               1111
     C           Q5SHN3    COMP *BLANK               1212
     C           Q5MHN2    COMP *BLANK               1313
     C           Q5MHN3    COMP *BLANK               1414
     C           Q5MHN4    COMP *BLANK               1515
      *
     C                     MOVE *BLANK    WMSTM  10
     C                     MOVE *BLANK    WMSNM  10
     C           Q5TOKU    CHAINFGBPL011             04
     C  N04                MOVELB2SMEI    WMSTM
     C           Q5NONY    CHAINFGBPL011             04
     C  N04                MOVELB2SMEI    WMSNM
      *
      *
     C                     EXCPT@DTL
     C  N97                MOVE *ON       *IN97
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           K#KEY     CHAINFCEPL01              93
      *
     C           @@QT1     DIV  A2SSYS    @@BX1   92
     C           @@QT2     DIV  A2SSYS    @@BX2   92
     C           W@DQTY    DIV  A2SSYS    @@DBX   92
     C   97                EXCPT@SUBT
      *
     C                     ENDSR
      *------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         @@MDY Y   99
     O                                  102 'P.'
     O                         PAGE  Z  106
     O        E   02           @HED
     O                         TTL       65
     O                         W@HMS     99 '  :  :  '
     O        E   03           @HED
     O                       01          35 'OVER'
     O                       01D@PCNT4   39
     O                       02          35 'UNDER'
     O                       02D@PCNX4   39
     O                                   41 '%'
     O        E   05           @HED
     O                                   89 '--- DEMAND QTY ---'
     O                                  114 'SET QTY'
     O                                  131 'QTY'
     O        E   06           @HED
     O                                    6 'PART#:'
     O                                   27 'USER PART#'
     O                                   45 'CUST'
     O                                   59 'RCV CO.'
     O                                   64 'F'
     O                         MON,1     77 '    /  '
     O                         MON,2     91 '    /  '
     O                                  100 '%'
     O                                  114 '/DAY'
     O                       02         125 'ACTUAL'
     O                                  131 '/CNT'
     O        E   07           @HED
     O                         @@LINE   132
     O        E 1              @DTL
     O                      N97Q5SHN1     5
     O                    11N97           6 '-'
     O                      N97Q5SHN2    11
     O                    12N97          12 '-'
     O                      N97Q5SHN3    14
     O                         Q5MHN1    22
     O                    13             23 '-'
     O                         Q5MHN2    28
     O                    14             29 '-'
     O                         Q5MHN3    34
     O                    15             35 '-'
     O                         Q5MHN4    40
     O                         WMSTM     51
     O                         WMSNM     62
     O                         Q5NKOJ    64
     O                         XXQT1 J   78
     O                         XXQT2 J   92
     O        E 1              @SUBT
     O                                   60 'P/N TOTAL'
     O                         WWQT1     78 '   ,   , * -'
     O                         WWQT2     92 '   ,   , * -'
     O                         W@ANS 1  114
     O                         W@DQTY1  114
     O                      N93A2SSYS1  131
     O        E 1              @SUBT
     O                                   60 'BOX/DAY'
     O                         @@BX1 J   78
     O                         @@BX2 J   92
     O                         WPCNT 4  100
     O                         @@DBX 1  114
     O                       02@@ACT 1  125
     O        E 1              @SUBT
     O                         @@LINE   132
** TTL
   ** DEMAND VS. QTY SET IN MASTER FILE **
