     H            Y.
     F*** ABBR22 *********************************************
     F*      工程・工場別　集計内示（３ケ月）リスト        *
     F*          H.ITO                1991.07.11             *
     F********************************************* ABBR22 ***
     FABBWP21 IP  F     134            DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     IABBWP21 AA  01
     I                                        1   5 @SHN1
     I                                        6  10 @SHN2
     I                                       11  12 @SHN3           98
     I                                       13  180@DTYM
     I                                       13  160@DTYY
     I                                       17  180@DTMM
     I                                       19  270@ASRY
     I                                       28  360@BSRY
     I                                       37  450@CSRY
     I                                       46  540@DSRY
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   60@YM
     I                                        1   40@YY0
     I                                        5   60@MM0
     C                     SETOF                     026162
     C  N03                SETON                     0203
     C*
     C           *ENTRY    PLIST
     C                     PARM           PARM01  3        ﾃcmb
     C                     PARM           PARM02  4        ﾎﾞy]
     C                     PARM           PARM03  1        hﾎﾞ]
     C                     PARM           PARM04  1        j]ﾆﾞｬc
     C                     PARM           PARM05  6        ﾆﾞｮﾈg ﾍﾇﾞi
     C                     PARM           PARM11  3        fnﾞcpｮﾇc N-1
     C                     PARM           PARM12  3                 N
     C                     PARM           PARM13  3                 N+1
     C                     PARM           PARM14  3                 N+2
     C                     MOVE PARM01    @KTEI   3
     C                     MOVE PARM02    @BMON   40
     C                     MOVE PARM05    @YM     60
     C                     MOVE PARM11    @DAY0   31
     C                     MOVE PARM12    @DAY    31
     C                     MOVE PARM13    @DAY1   31
     C                     MOVE PARM14    @DAY2   31
     C           @DAY0     IFEQ 0
     C                     MOVE 20        @DAY0
     C                     END
     C           @DAY      IFEQ 0
     C                     MOVE 20        @DAY
     C                     END
     C           @DAY1     IFEQ 0
     C                     MOVE 20        @DAY1
     C                     END
     C           @DAY2     IFEQ 0
     C                     MOVE 20        @DAY2
     C                     END
     C*
     C           PARM03    COMP 'Y'                      50
     C*
     C           @DTMM     IFEQ 12
     C                     Z-ADD1         @MM1    20       N+1
     C           @DTYY     ADD  1         @YY1    40
     C                     ELSE
     C           @DTMM     ADD  1         @MM1
     C                     Z-ADD@DTYY     @YY1
     C                     END
     C           @MM1      IFEQ 12
     C                     Z-ADD1         @MM2    20       N+2
     C           @YY1      ADD  1         @YY2    40
     C                     ELSE
     C           @MM1      ADD  1         @MM2
     C                     Z-ADD@YY1      @YY2
     C                     END
     C*
     C           #KEY1     KLIST
     C                     KFLD           @SHN1
     C                     KFLD           @SHN2
     C                     KFLD           @SHN3
     C*
     C           *IN90     IFEQ '0'
     C                     TIME           @TIME   60
     C                     Z-ADDUDATE     @DATE   60
     C                     MOVEL'1'       *IN,90
     C*
     C                     MOVEL*BLANK    @KEMI  16
     C                     SETOF                     30
     C           @BMON     CHAINFGBPL011             30
     C           *IN30     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELB2SMEI    @KEMI
     C                     END
     C                     END
     C*
     C                     MOVEL*BLANK    @KASI   52
     C                     SETOF                     30
     C           #KEY1     CHAINFCEPL011             30
     C           *IN30     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C           PARM04    IFEQ 'S'
     C                     MOVEA'1'       *IN,61
     C                     Z-ADDA2SOZI    @KASI
     C                     ELSE
     C           PARM04    IFEQ 'K'
     C                     MOVEA'1'       *IN,62
     C                     Z-ADDA2KASI    @KASI
     C                     END
     C                     END
     C                     END
     C*
     C           @ASRY     MULT @KASI     AAAAA1 101
     C           AAAAA1    DIV  1000      AAAAA2 101
     C           AAAAA2    ADD  0.9       @AJRY   90
     C           @AJRY     DIV  @DAY      AAAAA3 101
     C           AAAAA3    ADD  0.9       #AJRY   90
     C*
     C           @BSRY     MULT @KASI     BBBBB1 101
     C           BBBBB1    DIV  1000      BBBBB2 101
     C           BBBBB2    ADD  0.9       @BJRY   90
     C           @BJRY     DIV  @DAY1     BBBBB3 101
     C           BBBBB3    ADD  0.9       #BJRY   90
     C*
     C           @CSRY     MULT @KASI     CCCCC1 101
     C           CCCCC1    DIV  1000      CCCCC2 101
     C           CCCCC2    ADD  0.9       @CJRY   90
     C           @CJRY     DIV  @DAY2     CCCCC3 101
     C           CCCCC3    ADD  0.9       #CJRY   90
     C*
     C           @DSRY     MULT @KASI     DDDDD1 101
     C           DDDDD1    DIV  1000      DDDDD2 101
     C           DDDDD2    ADD  0.9       @DJRY   90
     C           @DJRY     DIV  @DAY0     DDDDD3 101
     C           DDDDD3    ADD  0.9       #DJRY   90
     C*
     C                     ADD  @ASRY     $ASRY1  90
     C                     ADD  @BSRY     $BSRY1  90
     C                     ADD  @CSRY     $CSRY1  90
     C                     ADD  @DSRY     $DSRY1  90
     C*
     C                     ADD  @AJRY     $AJRY1  90
     C                     ADD  @BJRY     $BJRY1  90
     C                     ADD  @CJRY     $CJRY1  90
     C                     ADD  @DJRY     $DJRY1  90
     C*
     CLR         $ASRY1    DIV  @DAY      AAA    101
     CLR         AAA       ADD  0.9       $ASRY2  90
     CLR         $BSRY1    DIV  @DAY1     BBB    101
     CLR         BBB       ADD  0.9       $BSRY2  90
     CLR         $CSRY1    DIV  @DAY2     CCC    101
     CLR         CCC       ADD  0.9       $CSRY2  90
     CLR         $DSRY1    DIV  @DAY0     DDD    101
     CLR         DDD       ADD  0.9       $DSRY2  90
     C*
     CLR         $AJRY1    DIV  @DAY      AAA
     CLR         AAA       ADD  0.9       $AJRY2  90
     CLR         $BJRY1    DIV  @DAY1     BBB
     CLR         BBB       ADD  0.9       $BJRY2  90
     CLR         $CJRY1    DIV  @DAY2     CCC
     CLR         CCC       ADD  0.9       $CJRY2  90
     CLR         $DJRY1    DIV  @DAY0     DDD
     CLR         DDD       ADD  0.9       $DJRY2  90
     C*
     OQPRINT  H 1102   02
     O       OR        OF
     O                                  131 '､､､､､､､､､､､､､､､､､､､､､'
     O        H  1     02
     O       OR        OF
     O                 61                17 'WEIGHT:MATERIAL '
     O                 62                17 'WEIGHT:FINISHED '
     O                                   98 'PGM = ABBR22'
     O                                  131 '､         ､　　　 ､'
     O        H  1     02
     O       OR        OF
     O                                   89 'TIME'
     O                         @TIME     98 '  :  :  '
     O                                  111 '､'
     O                                  121 '､'
     O                                  131 '､'
     O        H  1     02
     O       OR        OF
     O                                    7 'PROCESS'
     O                         @KTEI     11
     O                                   18 'CODE'
     O                         @BMON     24
     O                                   48 '** PROCESS/SECTION'
     O                                 +  1 'TOTAL FORCAST LIST **'
     O                                   89 'DATE'
     O                         @DATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '､､､､､､､､､､､､､､､､､､､､､'
     O        H  1     02
     O       OR        OF
     O                                   19 'SECTION'
     O                         @KEMI     36
     O        H  1     02
     O       OR        OF
     O                         @MM0      25
     O                                   37 '  ACTUAL/M  '
     O                         @DTMM     54
     O                                   67 ' FORCAST/M  '
     O                         @MM1      83
     O                                   95 ' FORCAST/M  '
     O                         @MM2     112
     O                                  124 ' FORCAST/M  '
     O        H  2     02
     O       OR        OF
     O                         @DAY0 1   32
     O                         @DAY  1   62
     O                         @DAY1 1   90
     O                         @DAY2 1  119
     O                                   27 '('
     O                                   34 ')'
     O                                   57 '('
     O                                   64 ')'
     O                                   85 '('
     O                                   92 ')'
     O                                  114 '('
     O                                  121 ')'
     O        D  2     01 50
     O                         @SHN1      6
     O                                    7 '-'
     O                         @SHN2     12
     O                N98                13 '-'
     O                         @SHN3     15
     O                         @DSRY 1B  28
     O                         @DJRY 1B  40
     O                                   43 'KG'
     O                         @ASRY 1B  57
     O                         @AJRY 1B  69
     O                                   72 'KG'
     O                         @BSRY 1B  86
     O                         @BJRY 1B  98
     O                                  101 'KG'
     O                         @CSRY 1B 115
     O                         @CJRY 1B 127
     O                                  130 'KG'
     O        T  2     LR
     O                                    9 'SETTING/M'
     O                         $DSRY1 B  28 '   ,   , * '
     O                         $DJRY1 B  40 '   ,   , * '
     O                                   43 'KG'
     O                         $ASRY1 B  57 '   ,   , * '
     O                         $AJRY1 B  69 '   ,   , * '
     O                                   72 'KG'
     O                         $BSRY1 B  86 '   ,   , * '
     O                         $BJRY1 B  98 '   ,   , * '
     O                                  101 'KG'
     O                         $CSRY1 B 115 '   ,   , * '
     O                         $CJRY1 B 127 '   ,   , * '
     O                                  130 'KG'
     O        T  2     LR
     O                                    9 'SETTING/D'
     O                         $DSRY2 B  28 '   ,   , * '
     O                         $DJRY2 B  40 '   ,   , * '
     O                                   43 'KG'
     O                         $ASRY2 B  57 '   ,   , * '
     O                         $AJRY2 B  69 '   ,   , * '
     O                                   72 'KG'
     O                         $BSRY2 B  86 '   ,   , * '
     O                         $BJRY2 B  98 '   ,   , * '
     O                                  101 'KG'
     O                         $CSRY2 B 115 '   ,   , * '
     O                         $CJRY2 B 127 '   ,   , * '
     O                                  130 'KG'
