     H            Y.
     F*** ABBR22 *********************************************
     F*      工程・工場別　集計内示（３ケ月）リスト        *
     F*          H.ITO                1991.07.11             *
     F* TCHK  11/30/2014 RE-MAKE                               *
JW1  F* JW    04/20/2017 ADD NAME FIELD TO ABBWP27           *
     F********************************************* ABBR22 ***
     FABBWP21 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
JW1  FEDIPL40 IF  E           K        DISK
     FABBWP27 O   E                    DISK
     I*
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   60@YM
     I                                        1   40@DTYY
     I                                        5   60@DTMM
     C                     SETOF                     026162
     C  N03                SETON                     0203
     C*
     C           *ENTRY    PLIST
     C                     PARM           PARM03  1        hﾎﾞ]
     C                     PARM           PARM04  1        j]ﾆﾞｬc
     C                     PARM           PARM05  6        ﾆﾞｮﾈg ﾍﾇﾞi
     C                     PARM           PARM11  3        fnﾞcpｮﾇc N-1
     C                     PARM           PARM12  3                 N
     C                     PARM           PARM13  3                 N+1
     C                     PARM           PARM14  3                 N+2
T    C                     PARM           PARM15  3                 N+3
T    C                     PARM           PARM16  3                 N+4
T    C                     PARM           PARM17  3                 N+5
     C                     MOVE PARM05    @YM     60
     C                     MOVE PARM11    @DAY0   31
     C                     MOVE PARM12    @DAY    31
     C                     MOVE PARM13    @DAY1   31
     C                     MOVE PARM14    @DAY2   31
T    C                     MOVE PARM15    @DAY3   31
T    C                     MOVE PARM16    @DAY4   31
T    C                     MOVE PARM17    @DAY5   31
     C*
     C           PARM03    COMP 'Y'                      50
     C*
T    C*          @DTMM     IFEQ 12
T    C*                    Z-ADD1         @MM1    20       N+1
T    C*          @DTYY     ADD  1         @YY1    40
T    C*                    ELSE
T    C*          @DTMM     ADD  1         @MM1
T    C*                    Z-ADD@DTYY     @YY1
T    C*                    END
T    C*          @MM1      IFEQ 12
T    C*                    Z-ADD1         @MM2    20       N+2
T    C*          @YY1      ADD  1         @YY2    40
T    C*                    ELSE
T    C*          @MM1      ADD  1         @MM2
T    C*                    Z-ADD@YY1      @YY2
T    C*                    END
     C*
     C           #KEY1     KLIST
     C                     KFLD           CKHIN1
     C                     KFLD           CKHIN2
     C                     KFLD           CKHIN3
     C                     MOVELCKHIN1    @SHN1
     C                     MOVELCKHIN2    @SHN2
     C                     MOVELCKHIN3    @SHN3
     C*
     C                     Z-ADD@NNNM     @ASRY   90
     C                     Z-ADD@N1NM     @BSRY   90
     C                     Z-ADD@N2NM     @CSRY   90
T    C                     Z-ADD@N3NM     @ESRY   90
T    C                     Z-ADD@N4NM     @FSRY   90
T    C                     Z-ADD@N5NM     @GSRY   90
     C                     Z-ADD@SRYO     @DSRY   90
     C*
T    C*                    MOVEL*BLANK    @KEMI  16
     C                     SETOF                     30
     C           @BMON     CHAINFGBPL011             30
     C           *IN30     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
T    C*          *IN30     IFEQ '0'
T    C*                    MOVELB2SMEI    @KEMI
T    C*                    END
     C*
     C                     Z-ADD*ZERO     @KASI   52
     C                     SETOF                     30
     C           #KEY1     CHAINFCEPL011             30
     C           *IN30     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C           PARM04    IFEQ 'S'
     C                     MOVEA'1'       *IN,61
     C                     Z-ADDA2SOZI    @KASI
     C                     ELSE
     C           PARM04    IFEQ 'K'
     C                     MOVEA'1'       *IN,62
     C                     Z-ADDA2KASI    @KASI
     C                     END
     C                     END
     C                     END
     C*
     C           @ASRY     MULT @KASI     AAAAA1 101
     C           AAAAA1    DIV  1000      AAAAA2 101
     C           AAAAA2    ADD  0.9       @AJRY   90
     C           @AJRY     DIV  @DAY      AAAAA3 101
     C           AAAAA3    ADD  0.9       #AJRY   90
     C*
     C           @BSRY     MULT @KASI     BBBBB1 101
     C           BBBBB1    DIV  1000      BBBBB2 101
     C           BBBBB2    ADD  0.9       @BJRY   90
     C           @BJRY     DIV  @DAY1     BBBBB3 101
     C           BBBBB3    ADD  0.9       #BJRY   90
     C*
     C           @CSRY     MULT @KASI     CCCCC1 101
     C           CCCCC1    DIV  1000      CCCCC2 101
     C           CCCCC2    ADD  0.9       @CJRY   90
     C           @CJRY     DIV  @DAY2     CCCCC3 101
     C           CCCCC3    ADD  0.9       #CJRY   90
     C*
     C           @DSRY     MULT @KASI     DDDDD1 101
     C           DDDDD1    DIV  1000      DDDDD2 101
     C           DDDDD2    ADD  0.9       @DJRY   90
     C           @DJRY     DIV  @DAY0     DDDDD3 101
     C           DDDDD3    ADD  0.9       #DJRY   90
     C*
     C           @ESRY     MULT @KASI     EEEEE1 101
     C           EEEEE1    DIV  1000      EEEEE2 101
     C           EEEEE2    ADD  0.9       @EJRY   90
     C           @EJRY     DIV  @DAY3     EEEEE3 101
     C           EEEEE3    ADD  0.9       #EJRY   90
     C*
     C           @FSRY     MULT @KASI     FFFFF1 101
     C           FFFFF1    DIV  1000      FFFFF2 101
     C           FFFFF2    ADD  0.9       @FJRY   90
     C           @FJRY     DIV  @DAY4     FFFFF3 101
     C           FFFFF3    ADD  0.9       #FJRY   90
     C*
     C           @GSRY     MULT @KASI     GGGGG1 101
     C           GGGGG1    DIV  1000      GGGGG2 101
     C           GGGGG2    ADD  0.9       @GJRY   90
     C           @GJRY     DIV  @DAY5     GGGGG3 101
     C           GGGGG3    ADD  0.9       #GJRY   90
JW1   * GET SUPPLIER NAME
 |   C                     MOVE *BLANK    @NAME
 |   C                     MOVEL@BMON     LTR4    4
 |   C           LTR4      CHAINEDIPL40              99
 |   C           *IN99     IFEQ *OFF
 |   C                     MOVELE4ADD1    @NAME
JW1  C                     ENDIF
     C*
T    C*                    ADD  @ASRY     $ASRY1  90
T    C*                    ADD  @BSRY     $BSRY1  90
T    C*                    ADD  @CSRY     $CSRY1  90
T    C*                    ADD  @DSRY     $DSRY1  90
     C*
T    C*                    ADD  @AJRY     $AJRY1  90
T    C*                    ADD  @BJRY     $BJRY1  90
T    C*                    ADD  @CJRY     $CJRY1  90
T    C*                    ADD  @DJRY     $DJRY1  90
     C*
     C                     WRITEABBWP271
     C*
