     H            Y.                                    1
     F** ABBR14 *************************************
     F* .. MATERIAL TOTALIZATION LIST & COMPONENTS TOTALIZATION LIST || *.
     F*     I-HASADA                 00.06.22       *
     F*    %00001    A.MAMIYA      2000.12.05       *
     F*    N.HYOTO   2001.06.09 CREATE WORK FILE    *
JW1  F*    J.W       2017.04.20 CHANGE SUPPLIER NAME*
     F************************************* ABBR14 **
%0001FABBWP14 IP  F     256            DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
JW1  FEDIPL40 IF  E           K        DISK
     FABBWP19 O   E                    DISK
     FQPRINT  O   F     156     OF     PRINTER
     E                    HYM         6  6 0             DATE(YM)
     E                    HCD         6  3 1
     IABBWP14 AA  01
     I                                        1  15 IZ1
     I                                       16  202IZ2
     I                                       21  290IJI1
     I                                       30  380IJI2
     I                                       39  470IJI3
     I                                       48  560IJI4
     I                                       57  650IJI5
     I                                       66  740IJI6
     I                                       75  780ISIRE L1
     I                                       79  870IJISU
%0001I                                       88  940@JI1
%0001I                                       95 1010@JI2
%0001I                                      102 1080@JI3
%0001I                                      109 1150@JI4
%0001I                                      116 1220@JI5
%0001I                                      123 1290@JI6
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  360HYM
     I                                        1   60WYM1
     I                                        5   60WMM1
     I                                        7  120WYM2
     I                                       11  120WMM2
     I                                       13  180WYM3
     I                                       17  180WMM3
     I                                       19  240WYM4
     I                                       23  240WMM4
     I                                       25  300WYM5
     I                                       29  300WMM5
     I                                       31  360WYM6
     I                                       35  360WMM6
     I            DS
     I                                        1   60WWYM
     I                                        1   40WWYY
     I                                        5   60WWMM
      *
     C           KEY3      KLIST
     C                     KFLD           WWYY
     C                     KFLD           WWMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PYM1    6
     C                     PARM           PYM2    6
     C                     PARM           PYM3    6
     C                     PARM           PYM4    6
     C                     PARM           PYM5    6
     C                     PARM           PYM6    6
      *
B01  C           *IN20     IFEQ '0'
     C                     SETON                     20
      *
     C                     MOVE PYM1      WYM1
     C                     MOVE PYM2      WYM2
     C                     MOVE PYM3      WYM3
     C                     MOVE PYM4      WYM4
     C                     MOVE PYM5      WYM5
     C                     MOVE PYM6      WYM6
      *
     C                     Z-ADD1         F       20
     C                     Z-ADD0         HCD
B02  C           1         DO   6         F
     C                     Z-ADDHYM,F     WWYM
     C                     Z-ADD0         WCD     31
      *
     C           KEY3      SETLLAGDPL121
B03  C                     DO   *HIVAL
     C                     SETOF                     21
     C           KEY3      READEAGDPL121                 21
B04  C           *IN21     IFEQ '0'
      *
B05  C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
B06  C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WCD
     C                     ELSE
     C                     ADD  0.5       WCD
E06  C                     END
      *
E05  C                     END
E04  C                     END
E03  C  N21                END
      *
     C                     Z-ADDWCD       HCD,F
E02  C                     END
      *
      *
     C                     CLEARABBWP191
     C                     MOVE ISIRE     UUSUPP
     C                     Z-ADDHYM,1     UUQTY1
     C                     Z-ADDHYM,2     UUQTY2
     C                     Z-ADDHYM,3     UUQTY3
     C                     Z-ADDHYM,4     UUQTY4
     C                     Z-ADDHYM,5     UUQTY5
     C                     Z-ADDHYM,6     UUQTY6
JW1   * GET SUPPLIER NAME
 |   C                     MOVE *BLANK    UUNAM
 |   C           UUSUPP    CHAINEDIPL40              99
 |   C           *IN99     IFEQ *OFF
 |   C                     MOVELE4ADD1    UUNAM
JW1  C                     ENDIF
      *
     C                     WRITEABBWP191
      *
     C                     CLEARABBWP191
     C                     MOVE ISIRE     UUSUPP
     C                     Z-ADDHCD,1     UUQTY1
     C                     Z-ADDHCD,2     UUQTY2
     C                     Z-ADDHCD,3     UUQTY3
     C                     Z-ADDHCD,4     UUQTY4
     C                     Z-ADDHCD,5     UUQTY5
     C                     Z-ADDHCD,6     UUQTY6
     C                     WRITEABBWP191
      *
     C                     TIME           WTIME   60
      *
E01  C                     END
      *
     C           *INL1     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    WSMEI  15
     C           ISIRE     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLT*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVE B2SMEI    WSMEI
     C                     END
     C                     END
     C                     EXSR @WRT
     C**************************************************************
     C* CREATE WORK FILE
     C**************************************************************
     C           @WRT      BEGSR
     C                     CLEARABBWP191
     C                     MOVE ISIRE     UUSUPP
     C**JW1                MOVELWSMEI     UUNAM
JW1   * GET SUPPLIER NAME
 |   C                     MOVE *BLANK    UUNAM
 |   C           UUSUPP    CHAINEDIPL40              99
 |   C           *IN99     IFEQ *OFF
 |   C                     MOVELE4ADD1    UUNAM
JW1  C                     ENDIF
      *
     C                     MOVE IZ1       UUZAIS
     C                     Z-ADDIZ2       UUDIA
     C                     Z-ADDIJISU     UUQTY0
     C                     Z-ADDIJI1      UUQTY1
     C                     Z-ADDIJI2      UUQTY2
     C                     Z-ADDIJI3      UUQTY3
     C                     Z-ADDIJI4      UUQTY4
     C                     Z-ADDIJI5      UUQTY5
     C                     Z-ADDIJI6      UUQTY6
     C                     WRITEABBWP191
     C*
     C                     ENDSR
     C*****************************************************************
      *
     OQPRINT  H  102   L1
     O       OR        OFNL1
     O                                  150 '+-------------------+'
     O        H  1     L1
     O       OR        OFNL1
     O                                  130 '|'
     O                                  140 '|'
     O                                  150 '|'
     O        H  1     L1
     O       OR        OFNL1
     O                                  103 'TIME'
     O                         WTIME    112 '  :  :  '
     O                                  130 '|'
     O                                  140 '|'
     O                                  150 '|'
     O        H  2     L1
     O       OR        OFNL1
     O                                   10 'ABBR14-1'
     O*                                  53 '** MATERIAL '
     O*                                  73 'TOTALIZATION LIST **'
     O                                   53 '** OPEN PURC'
     O                                   73 'HASE ORDER   LIST **'
     O                                 +  2 '(WIRE)'
     O                                  103 'DATE'
     O                         UDATE Y  112
     O                                  120 'PAGE'
     O                         PAGE  Z  124
     O                                  150 '+-------------------+'
     O        H  1     L1
     O       OR        OFNL1
     O                                   11 'MAT NAME'
     O                                   31 'CPLT W_DIAM'
     O                                   55 'WEIGHT SOLD LAST MONTH'
     O                         WMM1  Z   59
     O                                   71 'PROD_D_F WG'
     O                         WMM2  Z   75
     O                                   87 'PROD_D_F WG'
     O                         WMM3  Z   91
     O                                  103 'PROD_D_F WG'
     O                         WMM4  Z  107
     O                                  119 'PROD_D_F WG'
     O                         WMM5  Z  123
     O                                  135 'PROD_D_F WG'
     O                         WMM6  Z  139
     O                                  151 'PROD_D_F WG'
     O        H  2     L1
     O       OR        OFNL1
     O                                   64 '('
     O                         HCD,1 2   69
     O                                   71 ')'
     O                                   80 '('
     O                         HCD,2 2   85
     O                                   87 ')'
     O                                   96 '('
     O                         HCD,3 2  101
     O                                  103 ')'
     O                                  112 '('
     O                         HCD,4 2  117
     O                                  119 ')'
     O                                  128 '('
     O                         HCD,5 2  133
     O                                  135 ')'
     O                                  144 '('
     O                         HCD,6 2  149
     O                                  151 ')'
     O        H  2     L1
     O       OR        OFNL1
     O                         ISIRE      7
     O                                    8 '-'
     O                         WSMEI     23
     O        D  1     01
     O                         IZ1       18
     O                         IZ2   1   29
     O                         IJISU 1   49
     O                                   51 'KG'
     O                         IJI1  1   69
     O                                   71 'KG'
     O                         IJI2  1   85
     O                                   87 'KG'
     O                         IJI3  1  101
     O                                  103 'KG'
     O                         IJI4  1  117
     O                                  119 'KG'
     O                         IJI5  1  133
     O                                  135 'KG'
     O                         IJI6  1  149
     O                                  151 'KG'
%0001 *
     O        D  1     01
     O                                   60 '('
     O                         @JI1  1   69
     O                                   72 'KG)'
     O                                   76 '('
     O                         @JI2  1   85
     O                                   88 'KG)'
     O                                   92 '('
     O                         @JI3  1  101
     O                                  104 'KG)'
     O                                  108 '('
     O                         @JI4  1  117
     O                                  120 'KG)'
     O                                  124 '('
     O                         @JI5  1  133
     O                                  136 'KG)'
     O                                  140 '('
     O                         @JI6  1  149
     O                                  152 'KG)'
%0001 *
