     H            Y.
     F** ABBR7L **************************************
     F*   ITS.             2013.12.16                *
JW1  F*   JW      2017.01.30 FIX BUG                 *
     F************************************************
     FABBPW7L CF  E                    WORKSTN
     FABBPP7G UF  E           K        DISK                      A
     E                    ER      1  19 65
      *
      *
     I            DS
     I                                        1   1 TEST
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *----------------------------------------------------*
      *
      *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
      *
     C                     MOVEL*BLANK    @KOSN
     C                     MOVEL*BLANK    @MCN#
     C                     MOVEL*BLANK    @LOCT
      *
     CSR         #S100E    ENDSR
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         #S200E    ENDSR
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         #S300E    ENDSR
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTABBPW7L1
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     99
     C                     MOVEL*BLANK    @ERR
     C                     MOVEL*BLANK    @SIZE
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO #S210E
     C                     ENDIF
      * F12
     C           *IN12     IFEQ '1'
     C                     MOVE @MCN#     P@MANO
     C                     MOVE @LOCT     P@LOCT
     C                     CALL 'ABBR7M'
     C                     PARM           P@MANO  3
     C                     PARM           P@LOCT  6
     C           P@MANO    IFNE *BLANK
     C           P@LOCT    ORNE *BLANK
     C                     MOVE P@MANO    @MCN#
     C                     MOVE P@LOCT    @LOCT
     C                     ENDIF
     C                     GOTO #S210E
     C                     ENDIF
      *
     C           @KOSN     IFEQ *BLANK
     C**JW1                MOVELER,1      @ERR
JW1  C                     MOVELER,2      @ERR
     C                     SETON                     3199
     C                     GOTO #S210E
     C                     ENDIF
      *
     C           @KOSN     IFEQ '0'
     C           @KOSN     OREQ '1'
     C           @KOSN     OREQ '2'
     C                     ELSE
     C                     MOVELER,2      @ERR
     C                     SETON                     3199
     C                     GOTO #S210E
     C                     ENDIF
      *
     C           @MCN#     IFEQ *BLANK
     C           @LOCT     ANDEQ*BLANK
     C                     MOVELER,1      @ERR
     C                     SETON                     323399
     C                     GOTO #S210E
     C                     ENDIF
     C           @MCN#     IFNE *BLANK
     C           @LOCT     ANDNE*BLANK
     C**JW1                MOVELER,1      @ERR
JW1  C                     MOVELER,8      @ERR
     C                     SETON                     323399
     C                     GOTO #S210E
     C                     ENDIF
     C*
     C           KEY01     KLIST
     C                     KFLD           @MCN#
     C                     KFLD           @LOCT
     C           KEY01     CHAINABBPP7G1             21
     C           *IN21     IFEQ '0'
     C           A#SKJY    ANDEQ'D'
     C                     SETON                     21
     C                     ENDIF
      *
     C           *IN21     IFEQ '1'
     C           @KOSN     IFEQ '0'
     C           @KOSN     OREQ '1'
     C                     MOVELER,6      @ERR
     C                     SETON                     3199
     C                     GOTO #S210E
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN21     IFEQ '0'
     C           @KOSN     IFEQ '2'
     C                     MOVELER,7      @ERR
     C                     SETON                     3199
     C                     GOTO #S210E
     C                     ENDIF
     C                     ENDIF
     C*
     C           @KOSN     IFEQ '0'
     C           @KOSN     OREQ '1'
     C           A#SIZE    IFEQ 'M6 '
     C                     MOVEL'1'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'M8 '
     C                     MOVEL'2'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'M10'
     C                     MOVEL'3'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'NUT'
     C                     MOVEL'4'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'TS '
     C                     MOVEL'5'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'H/V'
     C                     MOVEL'6'       @SIZE
     C                     ENDIF
     C           A#SIZE    IFEQ 'E/G'
     C                     MOVEL'7'       @SIZE
     C                     ENDIF
     C*
     C                     ENDIF
     C*
     C                     MOVEL'02'      DSPSW
      *
     CSR         #S210E    ENDSR
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTABBPW7L2
     C                     SETOF                     34
     C                     SETOF                     99
     C                     MOVEL*BLANK    @ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVEL*BLANK    @KOSN
     C                     MOVEL*BLANK    @MCN#
     C                     MOVE '01'      DSPSW
     C                     GOTO #S220E
     C                     ENDIF
      *
     C           @SIZE     IFEQ *BLANK
     C                     MOVELER,4      @ERR
     C                     SETON                     3499
     C                     GOTO #S220E
     C                     ENDIF
     C*
     C           @SIZE     IFNE '1'
     C           @SIZE     ANDNE'2'
     C           @SIZE     ANDNE'3'
     C           @SIZE     ANDNE'4'
     C           @SIZE     ANDNE'5'
     C           @SIZE     ANDNE'6'
     C           @SIZE     ANDNE'7'
     C                     MOVELER,5      @ERR
     C                     SETON                     3499
     C                     GOTO #S220E
     C                     ENDIF
      *
     C           *IN05     IFEQ '0'
     C                     GOTO #S220E
     C                     ENDIF
      *
     C           KEY01     CHAINABBPP7G1             21
     C                     SELEC
     C           @KOSN     WHEQ '0'
     C                     EXSR #DLT
     C           @KOSN     WHEQ '1'
     C                     EXSR #UPD
     C           @KOSN     WHEQ '2'
     C                     EXSR #WRT
     C                     ENDSL
      *
     C                     MOVEL*BLANK    @KOSN
     C                     MOVEL*BLANK    @MCN#
     C                     MOVE '01'      DSPSW   2
      *
     CSR         #S220E    ENDSR
      *----------------------------------------------------*
      *DELETE                                              *
      *----------------------------------------------------*
     CSR         #DLT      BEGSR
      *
     C           *IN21     IFEQ '0'
     C                     MOVEL'D'       A#SKJY
     C                     Z-ADDWTIHZ     A#DATE
     C                     MOVELWJFB      A#TIME
     C                     MOVELW#USER    A#USER
     C                     MOVELW#PGM     A#PGID
     C*
     C                     UPDATABBPP7G1
     C                     ENDIF
      *
     CSR         EDLT      ENDSR
      *----------------------------------------------------*
      *CHANGE                                              *
      *----------------------------------------------------*
     CSR         #UPD      BEGSR
      *
     C           *IN21     IFEQ '0'
     C*
     C                     Z-ADDWTIHZ     A#DATE
     C                     MOVELWJFB      A#TIME
     C                     MOVELW#USER    A#USER
     C                     MOVELW#PGM     A#PGID
     C                     MOVEL@MCN#     A#MANO
     C                     MOVEL@LOCT     A#LOCT
     C*                    MOVEL@SIZE     A#SIZE
     C           @SIZE     IFEQ '1'
     C                     MOVEL'M6 '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '2'
     C                     MOVEL'M8 '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '3'
     C                     MOVEL'M10'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '4'
     C                     MOVEL'NUT'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '5'
     C                     MOVEL'TS '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '6'
     C                     MOVEL'H/V'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '7'
     C                     MOVEL'E/G'     A#SIZE
     C                     ENDIF
     C*
     C                     UPDATABBPP7G1
     C                     ENDIF
      *
     CSR         EUPD      ENDSR
      *----------------------------------------------------*
      *ADD                                                 *
      *----------------------------------------------------*
     CSR         #WRT      BEGSR
      *
     C                     CLEARABBPP7G1
     C*
     C                     Z-ADDWTIHZ     A#DATE
     C                     MOVELWJFB      A#TIME
     C                     MOVELW#USER    A#USER
     C                     MOVELW#PGM     A#PGID
     C                     MOVEL@MCN#     A#MANO
     C                     MOVEL@LOCT     A#LOCT
     C*                    MOVEL@SIZE     A#SIZE
     C*
     C           @SIZE     IFEQ '1'
     C                     MOVEL'M6 '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '2'
     C                     MOVEL'M8 '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '3'
     C                     MOVEL'M10'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '4'
     C                     MOVEL'NUT'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '5'
     C                     MOVEL'TS '     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '6'
     C                     MOVEL'H/V'     A#SIZE
     C                     ENDIF
     C           @SIZE     IFEQ '7'
     C                     MOVEL'E/G'     A#SIZE
     C                     ENDIF
     C*
     C           *IN21     IFEQ '0'
     C                     UPDATABBPP7G1
     C                     ELSE
     C                     WRITEABBPP7G1
     C                     ENDIF
      *
     CSR         EWRT      ENDSR
      *
**
ER-01 ENTER MACHINE# OR LOCATION!
ER-02 THE CODE SHOULD BE 0, 1 OR 2!
ER-03 MACHINE# IS INCORRECT!
ER-04 ENTER PART SIZE!
ER-05 PART SIZE SHOULD BE 1 TO 7!
ER-06 MCN/LOC IS NOT IN MASTER FILE!
ER-07 MCN/LOC IS ALREADY ADDED!
ER-08 DO NOT ENTER MACHINE# AND LOCATION BOTH!
ER-09
