     H            Y/
     F** ABBR32 ***************************************************
     F*  FORECAST BY CUST/DELIV/FACTORY/DOCK (OUT ABBWP29)        *
     F*  (COPIED FROM ABBR29)                                     *
     F*  JW    2019.02.28                                         *
     F*************************************************************
     FABBPW32 CF  E                    WORKSTN
     F                                        RRN0  KSFILE SFL00
     F                                              KINFDS @INFDS
     FABBPL54 IF  E           K        DISK
     F            ABBPP501                          KRENAMEABB54R
     FABAWL10 IF  E           K        DISK
     FABBPL04 IF  E           K        DISK
     F            ABBPP011                          KRENAMEABBPL04R
     FABBPL05 IF  E           K        DISK
     F            ABBPP011                          KRENAMEABBPL05R
     FABF9L01 IF  E           K        DISK
     FABFPL14 IF  E           K        DISK
     F            ABFPP101                          KRENAMEABF14R
     FFCEPL01 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FABBPL62 IF  E           K        DISK
JW1  FABBWP29 O   E                    DISK
      *------------------------------------------------------------
     E**                  CMD     1   5 78
     E**                  ERR     1   3 78
     E                    MON    12  12  3
     E                    DT1         7  8 0
     E                    DT2       100  8 0
     E                    QTY         7  7 0
     E                    DTE         7  4 0
     E                    D@M         9  3
     E                    DAT        10  8 0
     E                    YM          9  6 0
JW1  E                    W9YM        9  6 0
     E                    DLV        50  9
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
JW1  I            DS
 |   I                                        1  540W9YM
 |   I                                        1   60W9YM01
 |   I                                        7  120W9YM02
 |   I                                       13  180W9YM03
 |   I                                       19  240W9YM04
 |   I                                       25  300W9YM05
 |   I                                       31  360W9YM06
 |   I                                       37  420W9YM07
 |   I                                       43  480W9YM08
JW1  I                                       49  540W9YM09
     I            DS
     I                                        1   9 W@DLV
     I                                        1   40W@NONY
     I                                        5   5 W@NKOJ
     I                                        6   9 W@NUKE
     I            DS
     I                                        1  49 QTY
     I                                        1   70S@QTY1
     I                                        8  140S@QTY2
     I                                       15  210S@QTY3
     I                                       22  280S@QTY4
     I                                       29  350S@QTY5
     I                                       36  420S@QTY6
     I                                       43  490S@QTY7
     I            DS
     I                                        1  28 DTE
     I                                        1   40D@DAT1
     I                                        5   80D@DAT2
     I                                        9  120D@DAT3
     I                                       13  160D@DAT4
     I                                       17  200D@DAT5
     I                                       21  240D@DAT6
     I                                       25  280D@DAT7
     I            DS
     I                                        1  20 WWPRT
     I                                        1   5 BBMHN1
     I                                        6  10 BBMHN2
     I                                       11  15 BBMHN3
     I                                       16  20 BBMHN4
     I            DS
     I                                        1  20 S@MPAR
     I                                        1   5 S@MPR1
     I                                        6  10 S@MPR2
     I                                       11  15 S@MPR3
     I                                       16  20 S@MPR4
     I            DS
     I                                        1  20 D@MPAR
     I                                        1   5 D@MPR1
     I                                        6  10 D@MPR2
     I                                       11  15 D@MPR3
     I                                       16  20 D@MPR4
     I            DS
     I                                        1  12 S@SPR
     I                                        1   5 S@SPR1
     I                                        6  10 S@SPR2
     I                                       11  12 S@SPR3
     I            DS
     I                                        1  12 D@PRT
     I                                        1   5 D@PRT1
     I                                        6  10 D@PRT2
     I                                       11  12 D@PRT3
     I            DS
     I                                        1   60@YYMM
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1   80WYMD
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80W@DT8
     I                                        1   60W@DTYM
     I                                        1   40W@DTY
     I                                        5   60W@DTM
     I                                        7   80W@DTD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #INIT
      *
     C                     EXSR #SET0
      *
     C                     EXSR #MOVE
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           $CUST   4
     C                     PARM           $NONY   4
     C                     PARM           $NKOJ   1
     C                     PARM           $NUKE   4
      *
     C           $CUST     IFEQ *BLANK
     C                     Z-ADD0         D@CUST  40
     C                     ELSE
     C                     MOVEL$CUST     D@CUST
     C                     ENDIF
      *
     C           $NONY     IFEQ *BLANK
     C                     Z-ADD0         D@NONY  40
     C                     ELSE
     C                     MOVEL$NONY     D@NONY
     C                     ENDIF
      *
     C                     MOVEL$NKOJ     D@NKOJ  1
     C                     MOVEL$NUKE     D@NUKE  4
      *
     C           K#KEY     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@RCDT  80
      *
     C           K#KEYX    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
      *
     C           K#KEY0    KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
      *
     C           K#FD10    KLIST
     C                     KFLD           F9DOCK
     C                     KFLD           K@PART 12
      *
     C           K#FD1X    KLIST
     C                     KFLD           F9DOCK
     C                     KFLD           K@PART 12
     C                     KFLD           K@CEDT  60
      *
     C           K#F14     KLIST
     C                     KFLD           K@PART 12
     C                     KFLD           F9DOCK
     C                     KFLD           K@ISDT  60
      *
     C           K#F14X    KLIST
     C                     KFLD           K@PART 12
     C                     KFLD           F9DOCK
      *
     C           K#ABW     KLIST
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@MHN1  5
     C                     KFLD           K@MHN2  5
     C                     KFLD           K@MHN3  5
     C                     KFLD           K@MHN4  5
     C                     KFLD           K@YYMM  60
      *
     C                     MOVEL'00'      W@ID    2
     C                     Z-ADD*ZERO     DTE
     C                     Z-ADD*DATE     WYMD
     C                     SUB  1         WMM
     C           WMM       IFLE *ZERO
     C                     ADD  12        WMM
     C                     SUB  1         WYY
     C                     ENDIF
      *
     C                     Z-ADD1         W@SHFT  20
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN0    BEGSR
      *
     C                     EXSR #SET0
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA
      *------------------------------------------------------
     C           #SET0     BEGSR
      *
     C                     Z-ADD*ZERO     RRN0    40
     C                     MOVE *ON       *IN54
     C                     WRITECTL00
     C                     MOVE *OFF      *IN54
     C                     Z-ADD*ZERO     Z       40
     C                     Z-ADD*ZERO     YM
     C*
     C                     MOVEL*ON       *IN56
     C                     MOVEL*ON       N#MODE
      *
     C           D@CUST    IFNE *ZERO
      *
JW2  C           D@CUST    IFEQ 9999
 |   C           0000      SETLLABBPL04
 |   C                     ELSE
 |   C           D@CUST    SETLLABBPL04
JW2  C                     ENDIF
      *
     C                     ELSE
     C           D@NONY    SETLLABBPL05
     C                     END
      *
     C           *IN90     DOUEQ*ON
      *
     C           D@CUST    IFNE *ZERO
      *
JW2  C           D@CUST    IFEQ 9999
 |   C                     READ ABBPL04                  90
 |   C                     ELSE
 |   C           D@CUST    READEABBPL04                  90
JW2  C                     ENDIF
      *
     C                     ELSE
     C           D@NONY    READEABBPL05                  90
     C                     END
     C   90                LEAVE
      *
     C           D@NONY    IFNE *ZERO
     C           D@NONY    IFNE Q5NONY
     C                     ITER
     C                     END
     C                     END
     C           D@NKOJ    IFNE *BLANK
     C           D@NKOJ    IFNE Q5NKOJ
     C                     ITER
     C                     END
     C                     END
     C           D@NUKE    IFNE *BLANK
     C           D@NUKE    IFNE Q5NUKE
     C                     ITER
     C                     END
     C                     END
     C*
     C                     ADD  1         RRN0
     C           RRN0      IFEQ 1
     C                     EXSR #MON
     C                     END
      *
     C                     CLEARSFL00
     C                     MOVE Q5NONY    W@NONY
     C                     MOVE Q5NKOJ    W@NKOJ
     C                     MOVE Q5NUKE    W@NUKE
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    W@NUKE
     C                     END
      *
JW   C                     Z-ADDQ5TOKU    S@CUST
     C                     Z-ADDQ5NONY    S@NONY
     C                     MOVELQ5NKOJ    S@NKOJ
     C                     MOVELQ5NUKE    S@NUKE
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    S@NUKE
     C                     END
     C                     MOVE Q5MHN1    S@MPR1
     C                     MOVE Q5MHN2    S@MPR2
     C                     MOVE Q5MHN3    S@MPR3
     C                     MOVE Q5MHN4    S@MPR4
     C                     Z-ADDQ5NNNM    S@MQT1
     C                     Z-ADDQ51NNM    S@MQT2
     C                     Z-ADDQ52NNM    S@MQT3
      *
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C                     MOVE Q5NONY    K@NONY  40
     C                     MOVE Q5NKOJ    K@NKOJ  1
     C                     MOVE Q5NUKE    K@NUKE  4
     C           Q5TOKU    IFEQ 5149
     C                     MOVE Q5GUKE    K@NUKE
     C                     ENDIF
     C                     MOVE Q5MHN1    K@MHN1  5
     C                     MOVE Q5MHN2    K@MHN2  5
     C                     MOVE Q5MHN3    K@MHN3  5
     C                     MOVE Q5MHN4    K@MHN4  5
     C           K#ABW     CHAINABAWL10              95
     C           *IN95     IFEQ *OFF
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABNNSU    S@MQT1
     C                     Z-ADDABNNSU    H@MQT1
     C           X         WHEQ 2
     C                     Z-ADDABNNSU    S@MQT2
     C                     Z-ADDABNNSU    H@MQT2
     C           X         WHEQ 3
     C                     Z-ADDABNNSU    S@MQT3
     C                     Z-ADDABNNSU    H@MQT3
     C           X         WHEQ 4
     C                     Z-ADDABNNSU    H@MQT4
     C           X         WHEQ 5
     C                     Z-ADDABNNSU    H@MQT5
     C           X         WHEQ 6
     C                     Z-ADDABNNSU    H@MQT6
     C           X         WHEQ 7
     C                     Z-ADDABNNSU    H@MQT7
     C           X         WHEQ 8
     C                     Z-ADDABNNSU    H@MQT8
     C           X         WHEQ 9
     C                     Z-ADDABNNSU    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
     C*
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C           K#ABW     CHAINABBPL62              95
     C           *IN95     IFEQ *OFF
     C           ABSKJY    ANDEQ*BLANK
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABGEKN    S@MQT1
     C                     Z-ADDABGEKN    H@MQT1
     C           X         WHEQ 2
     C                     Z-ADDABGEKN    S@MQT2
     C                     Z-ADDABGEKN    H@MQT2
     C           X         WHEQ 3
     C                     Z-ADDABGEKN    S@MQT3
     C                     Z-ADDABGEKN    H@MQT3
     C           X         WHEQ 4
     C                     Z-ADDABGEKN    H@MQT4
     C           X         WHEQ 5
     C                     Z-ADDABGEKN    H@MQT5
     C           X         WHEQ 6
     C                     Z-ADDABGEKN    H@MQT6
     C           X         WHEQ 7
     C                     Z-ADDABGEKN    H@MQT7
     C           X         WHEQ 8
     C                     Z-ADDABGEKN    H@MQT8
     C           X         WHEQ 9
     C                     Z-ADDABGEKN    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
      * FORD
     C           Q5TOKU    IFEQ 5149
     C                     EXSR #SET0A
     C                     Z-ADDK@ISDT    H@ISDT
     C                     END
      *
     C                     MOVELQ5SHN1    S@SPR1
     C                     MOVELQ5SHN2    S@SPR2
     C                     MOVELQ5SHN3    S@SPR3
     C                     MOVELQ5SEBN    S@SEBN
     C*
     C                     Z-ADD*ZERO     W@GEKN  90
     C           K#FCEP    KLIST
     C                     KFLD           Q5SHN1
     C                     KFLD           Q5SHN2
     C                     KFLD           Q5SHN3
     C           K#FCEP    CHAINFCEPL01              92
     C           *IN92     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C                     Z-ADDA2SSYS    S@SSYS
     C                     Z-ADDA2GEKN    W@GEKN
     C                     END
     C           K#FCEP    CHAINFCEPL11              92
     C           *IN92     IFEQ *OFF
     C           FCCD01    ANDNE*ZERO
     C           FCGK01    DIV  FCCD01    @@QTY   90
     C           @@QTY     MULT 20        W@GEKN
     C                     END
     C                     Z-ADDW@GEKN    S@MVOL
     C*
     C                     WRITESFL00
     C                     Z-ADD*ZERO     S@MQT1
     C                     Z-ADD*ZERO     S@MQT2
     C                     Z-ADD*ZERO     S@MQT3
     C                     Z-ADD*ZERO     H@MQT1
     C                     Z-ADD*ZERO     H@MQT2
     C                     Z-ADD*ZERO     H@MQT3
     C                     Z-ADD*ZERO     H@MQT4
     C                     Z-ADD*ZERO     H@MQT5
     C                     Z-ADD*ZERO     H@MQT6
     C                     Z-ADD*ZERO     H@MQT7
     C                     Z-ADD*ZERO     H@MQT8
     C                     Z-ADD*ZERO     H@MQT9
     C                     ENDDO
     C*
     C           YM,1      IFEQ *ZERO
     C                     MOVEL*DATE     @YYMM
     C                     Z-ADD*ZERO     YM
     C           *DAY      IFLT 20
     C                     Z-ADD@MM       M       30
     C                     ELSE
     C           @MM       ADD  1         M
     C           M         IFGT 12
     C                     SUB  12        M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    D@M
     C           1         DO   9         X       30
     C                     MOVE MON,M     D@M,X
     C                     Z-ADDM         @MM
     C                     Z-ADD@YYMM     YM,X
      *
     C                     ADD  1         M
     C           M         IFGT 12
     C                     Z-ADD1         M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C           K#ABP     KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
      *
     C           K#ABPX    KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
     C                     KFLD           K@RCDT  80
     C                     KFLD           K@NONY  40
     C                     KFLD           K@NKOJ  1
     C                     KFLD           K@NUKE  4
      *
     C           K#ABP     SETGTABBPL54
     C           *IN90     DOUEQ*ON
     C           K#ABP     REDPEABBPL54                  90
     C           *IN90     IFEQ *OFF
     C           BBRCDT    IFLT WYMD
     C                     LEAVE
     C                     ENDIF
     C*
     C                     MOVE BBNONY    W@NONY
     C                     MOVE BBNKOJ    W@NKOJ
     C                     MOVE BBNUKE    W@NUKE
     C           W@DLV     LOKUPDLV                      10
     C           *IN10     IFEQ *ON
     C                     MOVE BBNONY    K@NONY
     C                     MOVE BBNKOJ    K@NKOJ
     C                     MOVE BBNUKE    K@NUKE
     C                     Z-ADDBBRCDT    K@RCDT
     C           K#ABPX    SETLLABBPL54
     C                     ITER
     C                     ENDIF
     C*
     C                     ADD  1         Z
     C                     MOVE W@DLV     DLV,Z
     C                     ADD  1         RRN0
     C*
     C                     CLEARSFL00
JW   C                     Z-ADDBBTOKU    S@CUST
     C                     Z-ADDBBNONY    S@NONY
     C                     MOVELBBNKOJ    S@NKOJ
     C                     MOVELBBNUKE    S@NUKE
     C                     MOVE BBMHN1    S@MPR1
     C                     MOVE BBMHN2    S@MPR2
     C                     MOVE BBMHN3    S@MPR3
     C                     MOVE BBMHN4    S@MPR4
     C                     MOVE BBNONY    K@NONY  40
     C                     MOVE BBNKOJ    K@NKOJ  1
     C                     MOVE BBNUKE    K@NUKE  4
     C                     MOVE BBMHN1    K@MHN1  5
     C                     MOVE BBMHN2    K@MHN2  5
     C                     MOVE BBMHN3    K@MHN3  5
     C                     MOVE BBMHN4    K@MHN4  5
     C*
     C           1         DO   9         X
     C                     Z-ADDYM,X      K@YYMM
     C           K#ABW     CHAINABAWL10              95
     C           *IN95     IFEQ *OFF
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDABNNSU    S@MQT1
     C                     Z-ADDABNNSU    H@MQT1
     C           X         WHEQ 2
     C                     Z-ADDABNNSU    S@MQT2
     C                     Z-ADDABNNSU    H@MQT2
     C           X         WHEQ 3
     C                     Z-ADDABNNSU    S@MQT3
     C                     Z-ADDABNNSU    H@MQT3
     C           X         WHEQ 4
     C                     Z-ADDABNNSU    H@MQT4
     C           X         WHEQ 5
     C                     Z-ADDABNNSU    H@MQT5
     C           X         WHEQ 6
     C                     Z-ADDABNNSU    H@MQT6
     C           X         WHEQ 7
     C                     Z-ADDABNNSU    H@MQT7
     C           X         WHEQ 8
     C                     Z-ADDABNNSU    H@MQT8
     C           X         WHEQ 9
     C                     Z-ADDABNNSU    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C                     ENDDO
      *
     C                     WRITESFL00
     C                     Z-ADD*ZERO     S@MQT1
     C                     Z-ADD*ZERO     S@MQT2
     C                     Z-ADD*ZERO     S@MQT3
     C                     Z-ADD*ZERO     H@MQT1
     C                     Z-ADD*ZERO     H@MQT2
     C                     Z-ADD*ZERO     H@MQT3
     C                     Z-ADD*ZERO     H@MQT4
     C                     Z-ADD*ZERO     H@MQT5
     C                     Z-ADD*ZERO     H@MQT6
     C                     Z-ADD*ZERO     H@MQT7
     C                     Z-ADD*ZERO     H@MQT8
     C                     Z-ADD*ZERO     H@MQT9
     C                     ENDIF
     C                     ENDDO
     C*
     C           RRN0      IFEQ 0
     C**                   MOVE ERR,1     D@MSG
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN99
     C                     ELSE
     C                     Z-ADDD@CUST    W@CUST  40
     C                     Z-ADDD@NONY    W@NONY  40
     C                     MOVELD@NKOJ    W@NKOJ  1
     C                     MOVELD@NUKE    W@NUKE  4
     C                     ENDIF
      *
     C                     Z-ADD1         W@RCNO  40
     C*
     C                     ENDSR
      *------------------------------------------------------
      *   SET FORD MONTHLY FORECAST
      *------------------------------------------------------
     C           #SET0A    BEGSR
      *
     C                     DO
      *
     C                     MOVELQ5NONY    @@NONY  4
     C           @@NONY    CHAINABF9L01              91
     C   91                LEAVE
     C*
     C                     MOVELS@MPAR    K@PART
     C           K#F14X    SETGTABFPL14
     C           K#F14X    REDPEABFPL14                  91
     C   91                LEAVE
     C                     Z-ADDFBSIDT    K@ISDT
     C*
     C           K#F14     SETLLABFPL14
     C                     DO   *HIVAL
     C*
     C           K#F14     READEABFPL14                  91
     C   91                LEAVE
     C           FBQTCD    IFNE 'M'
     C                     ITER
     C                     END
     C*
     C           FBCEDT    ADD  20000000  W@DT8
     C           W@DTD     IFLT 7
     C                     SUB  1         W@DTM
     C           W@DTM     IFLE *ZERO
     C                     Z-ADD12        W@DTM
     C                     SUB  1         W@DTY
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C           W@DTYM    LOKUPYM,X                     95
     C           *IN95     IFEQ *ON
     C                     SELEC
     C           X         WHEQ 1
     C                     ADD  FBQTY2    S@MQT1
     C                     ADD  FBQTY2    H@MQT1
     C           X         WHEQ 2
     C                     ADD  FBQTY2    S@MQT2
     C                     ADD  FBQTY2    H@MQT2
     C           X         WHEQ 3
     C                     ADD  FBQTY2    S@MQT3
     C                     ADD  FBQTY2    H@MQT3
     C           X         WHEQ 4
     C                     ADD  FBQTY2    H@MQT4
     C           X         WHEQ 5
     C                     ADD  FBQTY2    H@MQT5
     C           X         WHEQ 6
     C                     ADD  FBQTY2    H@MQT6
     C           X         WHEQ 7
     C                     ADD  FBQTY2    H@MQT7
     C           X         WHEQ 8
     C                     ADD  FBQTY2    H@MQT8
     C           X         WHEQ 9
     C                     ADD  FBQTY2    H@MQT9
     C                     ENDSL
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *------------------------------------------------------
      *   SET MONTH
      *------------------------------------------------------
     C           #MON      BEGSR
      *
     C                     Z-ADDQ5NTYM    @YYMM
     C                     Z-ADD*ZERO     YM
     C                     Z-ADD@MM       M       30
     C                     MOVE *BLANK    D@M
     C           1         DO   9         X       30
     C                     MOVE MON,M     D@M,X
     C                     Z-ADDM         @MM
     C                     Z-ADD@YYMM     YM,X
      *
     C                     ADD  1         M
     C           M         IFGT 12
     C                     Z-ADD1         M
     C                     ADD  1         @YY
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVELD@M,1     D@MON1
     C                     MOVELD@M,2     D@MON2
     C                     MOVELD@M,3     D@MON3
      *
     C                     ENDSR
      *------------------------------------------------------
JW1   * MOVE FC DADA AND CREATE WF
 |    *------------------------------------------------------
 |   C           #MOVE     BEGSR
 .    *
 .   C                     Z-ADD0         RRN0
     C                     DO   *HIVAL
     C                     ADD  1         RRN0
     C           RRN0      CHAINSFL00                98
     C   98                LEAVE
      *
     C                     CLEARABBWP291
     C                     Z-ADDD@CUST    WKTOKU           CUST#
     C                     Z-ADDD@NONY    WKNONY           DELIV#
     C                     MOVELD@NKOJ    WKNKOJ           FACTORY
     C                     MOVELD@NUKE    WKNUKE           DOCK
      *
     C                     Z-ADDS@CUST    W9TOKU           CUST#
     C                     Z-ADDS@NONY    W9NONY           DELIV#
     C                     MOVELS@NKOJ    W9NKOJ           FACTORY
     C                     MOVELS@NUKE    W9NUKE           DOCK
      *
     C                     MOVELS@MPAR    W9MHIN           USR PART
     C                     MOVELS@SPR     W9SHIN           IAF PART
     C                     Z-ADDS@MVOL    W9MSET           MONTH SET
     C                     Z-ADDS@SSYS    W9QPC            Q/C
     C                     Z-ADDH@MQT1    W9FQ01           FC QTY01
     C                     Z-ADDH@MQT2    W9FQ02           FC QTY02
     C                     Z-ADDH@MQT3    W9FQ03           FC QTY03
     C                     Z-ADDH@MQT4    W9FQ04           FC QTY04
     C                     Z-ADDH@MQT5    W9FQ05           FC QTY05
     C                     Z-ADDH@MQT6    W9FQ06           FC QTY06
     C                     Z-ADDH@MQT7    W9FQ07           FC QTY07
     C                     Z-ADDH@MQT8    W9FQ08           FC QTY08
     C                     Z-ADDH@MQT9    W9FQ09           FC QTY09
      *
     C                     Z-ADDYM        W9YM
      *
     C                     WRITEABBWP291
     C                     ENDDO
      *
     C                     ENDSR
** MON
JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC
