     H            Y.
     F** ABBR03 **********************************
     F* .. PRODUCT DEMAND FORECAST ACCUMULATION DATA *
     F* .. DATA CHANGE  THIS MONTH TO NEXT MONTH
     F* I-HASADA                     86.09.29    *
     F* A.INOUE          %0001       02.03.25    *
     F* H.AMANO                      03.03.20    *
     F* A.HOTTA          %0002       18.07.10    *
     F*----------------------------------------- *
JW1  F* JW          2023.08.07 ADD ABBPP01S (LOG)*
     F********************************************
     FABBPP01 UP  E                    DISK
%0001FAGDPL12 IF  E           K        DISK
%0002FABAWL15 IF  E           K        DISK
JW1  FABBPP01SO   E                    DISK
      *-------------------------------------
%0001E                    HCD        31  2 1
     E                    N2         31  7 0             N-2 日当内示数
     E                    N1         31  7 0             N-1 日当内示数
     E                    NN         31  7 0             N   日当内示数
     I            DS
     I                                        1   80Q5NHHZ
     I                                        1   40Q5NHYY
     I                                        5   60Q5NHMM
     I                                        7   80Q5NHDD
     I            DS
     I                                        1 2170N2
     I                                        1   70Q5N201
     I                                        8  140Q5N202
     I                                       15  210Q5N203
     I                                       22  280Q5N204
     I                                       29  350Q5N205
     I                                       36  420Q5N206
     I                                       43  490Q5N207
     I                                       50  560Q5N208
     I                                       57  630Q5N209
     I                                       64  700Q5N210
     I                                       71  770Q5N211
     I                                       78  840Q5N212
     I                                       85  910Q5N213
     I                                       92  980Q5N214
     I                                       99 1050Q5N215
     I                                      106 1120Q5N216
     I                                      113 1190Q5N217
     I                                      120 1260Q5N218
     I                                      127 1330Q5N219
     I                                      134 1400Q5N220
     I                                      141 1470Q5N221
     I                                      148 1540Q5N222
     I                                      155 1610Q5N223
     I                                      162 1680Q5N224
     I                                      169 1750Q5N225
     I                                      176 1820Q5N226
     I                                      183 1890Q5N227
     I                                      190 1960Q5N228
     I                                      197 2030Q5N229
     I                                      204 2100Q5N230
     I                                      211 2170Q5N231
     I            DS
     I                                        1 2170N1
     I                                        1   70Q5N101
     I                                        8  140Q5N102
     I                                       15  210Q5N103
     I                                       22  280Q5N104
     I                                       29  350Q5N105
     I                                       36  420Q5N106
     I                                       43  490Q5N107
     I                                       50  560Q5N108
     I                                       57  630Q5N109
     I                                       64  700Q5N110
     I                                       71  770Q5N111
     I                                       78  840Q5N112
     I                                       85  910Q5N113
     I                                       92  980Q5N114
     I                                       99 1050Q5N115
     I                                      106 1120Q5N116
     I                                      113 1190Q5N117
     I                                      120 1260Q5N118
     I                                      127 1330Q5N119
     I                                      134 1400Q5N120
     I                                      141 1470Q5N121
     I                                      148 1540Q5N122
     I                                      155 1610Q5N123
     I                                      162 1680Q5N124
     I                                      169 1750Q5N125
     I                                      176 1820Q5N126
     I                                      183 1890Q5N127
     I                                      190 1960Q5N128
     I                                      197 2030Q5N129
     I                                      204 2100Q5N130
     I                                      211 2170Q5N131
     I            DS
     I                                        1 2170NN
     I                                        1   70Q5NN01
     I                                        8  140Q5NN02
     I                                       15  210Q5NN03
     I                                       22  280Q5NN04
     I                                       29  350Q5NN05
     I                                       36  420Q5NN06
     I                                       43  490Q5NN07
     I                                       50  560Q5NN08
     I                                       57  630Q5NN09
     I                                       64  700Q5NN10
     I                                       71  770Q5NN11
     I                                       78  840Q5NN12
     I                                       85  910Q5NN13
     I                                       92  980Q5NN14
     I                                       99 1050Q5NN15
     I                                      106 1120Q5NN16
     I                                      113 1190Q5NN17
     I                                      120 1260Q5NN18
     I                                      127 1330Q5NN19
     I                                      134 1400Q5NN20
     I                                      141 1470Q5NN21
     I                                      148 1540Q5NN22
     I                                      155 1610Q5NN23
     I                                      162 1680Q5NN24
     I                                      169 1750Q5NN25
     I                                      176 1820Q5NN26
     I                                      183 1890Q5NN27
     I                                      190 1960Q5NN28
     I                                      197 2030Q5NN29
     I                                      204 2100Q5NN30
     I                                      211 2170Q5NN31
%0001I*
%0001I            DS
%0001I                                        1   60WWYM
%0001I                                        1   40WWYY
%0001I                                        5   60WWMM
     I            DS
     I                                        1   60K@N2
     I                                        1   40@@YY
     I                                        5   60@@MM
      * SYSTEM TIME & DATE
     I            DS
     I                                        1  140WTMDT
     I                                        1   60WTIME
     I                                        1   20WTIHH
     I                                        3   40WTIMM
     I                                        5   60WTISS
     I                                        7  140WDATE
     I                                        9  140WDAT6
     I                                        7  100WDAY4
     I                                        9  100WDAYY
     I                                       11  120WDAMM
     I                                       13  140WDADD
JW1  I            DS
 .   I                                        1  140SDATE
 .   I                                        1   60NOW
 .   I                                        7  140TODAY
 .   I           SDS
 .   I                                        1   8 #PGM
 .   I                                      244 253 #WSID
JW1  I                                      254 263 #USER
      *=====================================================
     C           *ENTRY    PLIST
     C                     PARM           PHIZ    6
      *
     C           K#AB      KLIST
     C                     KFLD           Q5TOKU
     C                     KFLD           Q5NONY
     C                     KFLD           Q5NKOJ
     C                     KFLD           Q5NUKE
%0002C                     KFLD           Q5SEBN
     C                     KFLD           Q5MHN1
     C                     KFLD           Q5MHN2
     C                     KFLD           Q5MHN3
     C                     KFLD           Q5MHN4
     C                     KFLD           K@N2    60
      *
     C                     TIME           WTMDT
      *
%0001C           *IN10     IFEQ '0'
%0001C                     SETON                     10
     C                     MOVE PHIZ      WHIZ    60
     C                     MOVE PHIZ      K@N2
     C                     ADD  2         @@MM
     C           @@MM      IFGT 12
     C                     ADD  1         @@YY
     C                     SUB  12        @@MM
     C                     ENDIF
%0001C*
%0001C                     Z-ADD0         WCD     31
%0001C                     Z-ADD0         HCD
%0001C                     Z-ADDWHIZ      WWYM
%0001C           KEY1      KLIST
%0001C                     KFLD           WWYY
%0001C                     KFLD           WWMM
%0001 *
%0001C           KEY1      SETLLAGDPL121
%0001C                     DO   *HIVAL
%0001C                     SETOF                     21
%0001C           KEY1      READEAGDPL121                 21
%0001C           *IN21     IFEQ '0'
%0001 *
%0001C           F8HIRU    IFEQ '*'
%0001C           F8YORU    ANDEQ'*'
%0001C                     ELSE
%0001 *
%0001C                     Z-ADDF8KADD    #D      20
%0001C           F8HIRU    IFEQ *BLANK
%0001C           F8YORU    ANDEQ*BLANK
%0001C                     ADD  2         WCD
%0001C                     Z-ADD2         HCD,#D
%0001C                     ELSE
%0001C                     ADD  1         WCD
%0001C                     Z-ADD1         HCD,#D
%0001C                     END
%0001 *
%0001C                     END
%0001C                     END
%0001C  N21                END
%0001C*
%0001C                     ENDIF
      *
     C                     MOVE Q5CHK2    Q5CHK1
     C                     Z-ADDQ5CHS2    Q5CHS1
     C                     MOVE *BLANK    Q5CHK2
     C                     Z-ADD0         Q5CHS2
     C                     MOVE Q5N1NK    Q5N2NK
     C                     Z-ADDQ5N1NM    Q5N2NM
     C                     Z-ADDN1        N2
     C                     MOVE Q5NNNK    Q5N1NK
     C                     Z-ADDQ5NNNM    Q5N1NM
     C                     Z-ADDNN        N1
     C** %0001             MOVE *BLANK    Q5NNNK
     C** %0001             Z-ADD0         Q5NNNM
%0001C                     MOVE Q51NNK    Q5NNNK
%0001C                     Z-ADDQ51NNM    Q5NNNM
%0001C                     Z-ADDQ51NNM    Q5NNOM
     C** %0001             Z-ADD0         NN
     C** %0001             MOVE *BLANK    Q51NNK
     C** %0001             Z-ADD0         Q51NNM
%0001C*
%0001C           Q51NNM    DIV  WCD       WDNNM   90
%0001C                     MVR            WAMARI  90
%0001C                     Z-ADD1         #D
%0001C           1         DO   31        #D
%0001C           WDNNM     MULT HCD,#D    NN,#D
%0001C           WAMARI    IFNE 0
%0001C           HCD,#D    ANDNE0
%0001C           WAMARI    IFEQ 1
%0001C                     ADD  1         NN,#D
%0001C                     SUB  1         WAMARI
%0001C                     ELSE
%0001C                     ADD  HCD,#D    NN,#D
%0001C                     SUB  HCD,#D    WAMARI
%0001C                     ENDIF
%0001C                     ENDIF
%0001C                     ENDDO
%0001C*
%0001C                     MOVE Q52NNK    Q51NNK
%0001C                     Z-ADDQ52NNM    Q51NNM
%0001C                     Z-ADDQ52NNM    Q51NOM
     C                     MOVE *BLANK    Q52NNK
%0001C                     Z-ADD0         Q52NOM
     C                     Z-ADD0         Q52NNM
      *
     C           K#AB      CHAINABAWP101             90
     C           *IN90     IFEQ *OFF
     C                     Z-ADDABNNSU    Q52NNM
     C                     ENDIF
      *
     C                     Z-ADDQ5N3GM    Q5N4GM
     C                     Z-ADDQ5N3ND    Q5N4ND
     C                     Z-ADDQ5N2GM    Q5N3GM
     C                     Z-ADDQ5N2ND    Q5N3ND
     C                     Z-ADDQ5N1GM    Q5N2GM
     C                     Z-ADDQ5N1ND    Q5N2ND
     C                     Z-ADD0         Q5N1GM
     C                     Z-ADD0         Q5N1ND
     C                     Z-ADDWHIZ      Q5NTYM
     C                     Z-ADDWDATE     Q5NHHZ
%0001C                     MOVE '*'       Q5NSYR
      *
     C           Q5CHS1    IFEQ 0
     C           Q5CHS2    ANDEQ0
     C           Q5N2NM    ANDEQ0
     C           Q5N1NM    ANDEQ0
     C           Q5NNNM    ANDEQ0
     C           Q51NNM    ANDEQ0
     C           Q52NNM    ANDEQ0
     C           Q5N4GM    ANDEQ0
     C           Q5N3GM    ANDEQ0
     C           Q5N2GM    ANDEQ0
     C           Q5N1GM    ANDEQ0
     C                     DELETABBPP011
      * LOG
JW1  C                     TIME           SDATE
 .   C                     MOVEL'DLT'     Q5TYP
 .   C                     Z-ADDTODAY     Q5KOHZ
 .   C                     Z-ADDNOW       Q5KOTM
 .   C                     MOVEL#USER     Q5KOUS
 .   C                     MOVEL#PGM      Q5KOPG
JW1  C                     WRITEABBPP01R
     C                     ELSE
      *
     C                     UPDATABBPP011
JW1  C                     TIME           SDATE
 .   C                     MOVEL'CHG'     Q5TYP
 .   C                     Z-ADDTODAY     Q5KOHZ
 .   C                     Z-ADDNOW       Q5KOTM
 .   C                     MOVEL#USER     Q5KOUS
 .   C                     MOVEL#PGM      Q5KOPG
JW1  C                     WRITEABBPP01R
     C                     END
