     H            Y/
     F***************************************************
     F*   PRIORITY LIST                                 *
     F*       APR/28/04  TCH                            *
     F*                                                 *
     F***************************************************
     FINPUT1  IP  F     512            DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FAB#PL12 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
      *------------------------------------------------------------
     E                    DAT         8  8 0
     E                    DT4         8  4 0
     E                    QT1         8  7 0
     E                    QT2         8  7 0
     E                    BX1         8  7 0
     E                    BX2         8  7 0
      *------------------------------------------------------------
     IINPUT1  AA  01
     I                                        1   8 I1DATE
     I                                        9  14 I1TIME
     I                                       15  24 I1USER
     I                                       25  34 I1WSID
     I                                       35  44 I1PGID
     I                                       45  50 I1LOCT
     I                                       45  45 I1LOC1
     I                                       46  47 I1LOC2
     I                                       48  49 I1LOC3
     I                                       50  50 I1LOC4
     I                                       51  65 I1BRCD
     I                                       66  70 I1PRT1
     I                                       71  75 I1PRT2
     I                                       76  77 I1PRT3
     I                                       78  80 I1KQTY
     I                                       81  81 I1KNID
     I                                       82  890I1ISDT
     I                                       90  92 I1MCHN
     I                                       93 112 I1CMNT
     I*****                                  93 111 I1CMNT
     I                                      113 114 I1LOTS
     I                                      115 115 I1AKBN
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80BADAT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80F8DAT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        1   20W@HH
     I                                        3   40W@MN
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   60@@MDY
     I                                        1   20@@MM
     I                                        3   40@@DD
     I                                        5   60@@YY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
      *
     C                     Z-ADD*ZERO     QT1
     C                     Z-ADD*ZERO     QT2
     C                     Z-ADD*ZERO     BX1
     C                     Z-ADD*ZERO     BX2
     C           K#AB      SETLLAB#PL18
     C           *IN81     DOUEQ*ON
     C           K#FCE     READEAB#PL18                  81
     C           *IN81     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BADAT     IFGT DAT,8
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADD1         X
     C           BADAT     LOKUPDAT,X                    10
     C                     Z-ADD*ZERO     WWQTY   70
     C                     MOVE BANONY    @@NONY
     C                     MOVE BANOBN    K@NOBN
     C                     MOVELBAODRN    @@ODRN    P
     C           K#AP70    SETLLAB#PL70
     C           *IN82     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  82
     C           *IN82     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    WWQTY
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           WWQTY     IFEQ *ZERO
     C                     MOVELBAINVN    @@ODRN    P
     C           K#AP70    SETLLAB#PL70
     C           *IN82     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  82
     C           *IN82     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    WWQTY
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ADD  BASRYO    QT1,X
     C           WWQTY     IFLT BASRYO
     C           BASRYO    SUB  WWQTY     @@BAL   90
     C                     ADD  @@BAL     QT2,X
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED2
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
     C           I1PRT3    COMP *BLANK               1111
      *
     C           K#FCE     CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C           A2GSKD    ANDEQ*BLANK
     C                     XFOOTQT2       @@TOTL  90
     C           QT1       DIV  A2SSYS    BX1
     C           QT2       DIV  A2SSYS    BX2
     C           @@TOTL    DIV  A2SSYS    @TOTB   70
      *
     C           *DATE     IFGE A2TRHZ
     C                     MOVE A2STRK    LOC1    1
     C                     MOVE A2STRT    LOC2    2
     C                     MOVE A2STRR    LOC3    2
     C                     MOVE A2STRD    LOC4    1
     C                     ELSE
     C                     MOVE A2KTRK    LOC1
     C                     MOVE A2KTRT    LOC2
     C                     MOVE A2KTRR    LOC3
     C                     MOVE A2KTRD    LOC4
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXCPT@DTL2
      *
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PDAT    8
     C           K#AB      KLIST
     C                     KFLD           I1PRT1
     C                     KFLD           I1PRT2
     C                     KFLD           I1PRT3
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#AP70    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           @@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           @@ODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C           K#FCE     KLIST
     C                     KFLD           I1PRT1
     C                     KFLD           I1PRT2
     C                     KFLD           I1PRT3
      *
     C                     MOVE PDAT      K@YMD
      *
     C                     Z-ADD*ZERO     DAT
     C                     Z-ADD*ZERO     X       20
     C           K#AGD     SETLLAB#PL12
     C           *IN80     DOUEQ*ON
     C                     READ AB#PL12                  80
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ' '
     C                     ADD  1         X
     C                     MOVE BANOHZ    DAT,X
     C           X         IFEQ 8
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDBANOHZ    K@YMD
     C           K#AGD     SETGTAB#PL12
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDDAT       DT4
     C                     MOVE *OFF      *IN98
     C                     TIME           W@TIME
     C                     MOVE *ALL'-'   @LIN  198
      *
     C                     Z-ADDW@YY      @@YY
     C                     Z-ADDW@MM      @@MM
     C                     Z-ADDW@DD      @@DD
     C                     MOVE PDAT      K@YMD
      *
     C                     ENDSR
      *
     OQPRINT  E   01           @HED2
     O                         #PGM       8
     O                         @@MDY Y  185
     O                                  188 'P.'
     O                         PAGE  Z  192
     O        E   02           @HED2
     O                                   89 '<< PRIORITY LIST >>'
     O                         W@HMS    185 '  :  :  '
     O        E   04           @HED2
     O                                   29 ':'
     O                         DT4,1     40 '  /  '
     O                                   48 ':'
     O                         DT4,2     59 '  /  '
     O                                   67 ':'
     O                         DT4,3     78 '  /  '
     O                                   86 ':'
     O                         DT4,4     97 '  /  '
     O                                  105 ':'
     O                         DT4,5    116 '  /  '
     O                                  124 ':'
     O                         DT4,6    135 '  /  '
     O                                  143 ':'
     O                         DT4,7    154 '  /  '
     O                                  162 ':'
     O                         DT4,8    173 '  /  '
     O                                  181 ':'
     O                                  192 'NO SCAN'
     O        E   05           @HED2
     O                                   29 ':'
     O                                   38 'SHP QTY'
     O                                   47 'NO SCAN'
     O                                   48 ':'
     O                                   57 'SHP QTY'
     O                                   66 'NO SCAN'
     O                                   67 ':'
     O                                   76 'SHP QTY'
     O                                   85 'NO SCAN'
     O                                   86 ':'
     O                                   95 'SHP QTY'
     O                                  104 'NO SCAN'
     O                                  105 ':'
     O                                  114 'SHP QTY'
     O                                  123 'NO SCAN'
     O                                  124 ':'
     O                                  133 'SHP QTY'
     O                                  142 'NO SCAN'
     O                                  143 ':'
     O                                  152 'SHP QTY'
     O                                  161 'NO SCAN'
     O                                  162 ':'
     O                                  171 'SHP QTY'
     O                                  180 'NO SCAN'
     O                                  181 ':'
     O                                  192 'TOTAL'
     O        E   06           @HED2
     O                                    7 'LOC'
     O                                   19 'PART#'
     O                                   29 ':'
     O                                   38 'CNT'
     O                                   47 'CNT'
     O                                   48 ':'
     O                                   57 'CNT'
     O                                   66 'CNT'
     O                                   67 ':'
     O                                   76 'CNT'
     O                                   85 'CNT'
     O                                   86 ':'
     O                                   95 'CNT'
     O                                  104 'CNT'
     O                                  105 ':'
     O                                  114 'CNT'
     O                                  123 'CNT'
     O                                  124 ':'
     O                                  133 'CNT'
     O                                  142 'CNT'
     O                                  143 ':'
     O                                  152 'CNT'
     O                                  161 'CNT'
     O                                  162 ':'
     O                                  171 'CNT'
     O                                  180 'CNT'
     O                                  181 ':'
     O                                  192 'CNT'
     O        E   07           @HED2
     O                         @LIN     198
     O        E 1              @DTL2
     O                         LOC1       5
     O                                    6 '-'
     O                         LOC2       8
     O                                    9 '-'
     O                         LOC3      11
     O                                   12 '-'
     O                         LOC4      13
     O                         I1PRT1    19
     O                                   20 '-'
     O                         I1PRT2    25
     O                       11          26 '-'
     O                         I1PRT3    28
     O                                   29 ':'
     O                         QT1,1 2   38
     O                         QT2,1 2   47
     O                                   48 ':'
     O                         QT1,2 2   57
     O                         QT2,2 2   66
     O                                   67 ':'
     O                         QT1,3 2   76
     O                         QT2,3 2   85
     O                                   86 ':'
     O                         QT1,4 2   95
     O                         QT2,4 2  104
     O                                  105 ':'
     O                         QT1,5 2  114
     O                         QT2,5 2  123
     O                                  124 ':'
     O                         QT1,6 2  133
     O                         QT2,6 2  142
     O                                  143 ':'
     O                         QT1,7 2  152
     O                         QT2,7 2  161
     O                                  162 ':'
     O                         QT1,8 2  171
     O                         QT2,8 2  180
     O                                  181 ':'
     O                         @@TOTL2  192
     O        E 1              @DTL2
     O                                   29 ':'
     O                         BX1,1 2   38
     O                         BX2,1 2   47
     O                                   48 ':'
     O                         BX1,2 2   57
     O                         BX2,2 2   66
     O                                   67 ':'
     O                         BX1,3 2   76
     O                         BX2,3 2   85
     O                                   86 ':'
     O                         BX1,4 2   95
     O                         BX2,4 2  104
     O                                  105 ':'
     O                         BX1,5 2  114
     O                         BX2,5 2  123
     O                                  124 ':'
     O                         BX1,6 2  133
     O                         BX2,6 2  142
     O                                  143 ':'
     O                         BX1,7 2  152
     O                         BX2,7 2  161
     O                                  162 ':'
     O                         BX1,8 2  171
     O                         BX2,8 2  180
     O                                  181 ':'
     O                         @TOTB 2  192
