     H            Y.                                    1
     H***ABBR90*****************************************************************
     H* DAILY INVENTORY SCAN                                                   *
     H*        12/22/03(TCH)
     H*
     H* TCHK1 01/09/13 ADD KANBAN TYPE='B'
     H* TCHK2 09/10/13 ADD LOCATION 'A'=SB
     H* TCHK3 10/21/13 ADD LOCATION 'B'=BZ4
     H* TCHK4 01/16/14 BUG FIX
     H* TCHK5 06/26/14 ADD LOCATION 'C'=JC PRE-LOAD
     H*                ADD LOCATION 'D'=JC
     H*                ADD LOCATION 'E'=QD
     H* LEC   11/13/15 ADD LOCATION 'F'=BZ5
     H* JW1   04/13/16 READ AAHPP01 IF ADHPP01 NOT EXIST
     H*                ADD SPECIAL PART 'U1026-B1082' BY MAMIYA SAN'S REQ
     H*                ADD SPECIAL PART 'U1026-B1083'
     H*                ADD SPECIAL PART 'U1026-B1084'
     H* JW2   12/11/19 ADD LOCATION 'G'=OQ-PL PRE-LOAD
     H*                ADD LOCATION 'H'=OQ-ZZ PRE-INSPECTION
     H**************************************************************************
     FABBPW90 CF  E                    WORKSTN
     FFCETL11 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
TCHK1FADHPL03 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FABBPL90 UF  E           K        DISK                      A
      **************************************************************************
TCHK5E                    ERR     1   9 15
     E                    PRT        15 12               PART NUMBER
     E                    NCKQ       15  1                KANABA TYPE
     E                    NPRC       15  3                KANABA TYPE
     E                    NTKR       15  6                    LOCATION
      **************************************************************************
     I* KANBAN TYPE,ABSOLUTE#,ORDER#,SEHIN KUBUN,LOT#
     I            DS
     I                                        1  15 WBAR
     I                                        1   1 WWKANS
     I                                        2   5 WWZETI
     I                                        6   8 WWORDR
     I                                        8   8 WWID
     I                                        9  11 WWPROC
     I                                       15  15 WWCHK
     I                                       10  15 WWBCHK
     I            DS
     I                                        1   80M6LPDT
     I                                        1   40M6STYY
     I                                        5   60M6STMM
     I                                        7   80M6STDD
     I            DS
     I                                        1   6 W7LOC
     I                                        1   1 W7L1
     I                                        2   3 W7L2
     I                                        4   5 W7L3
     I                                        6   6 W7L4
     I            DS
     I                                        1  12 W@CPRT
     I                                        1   5 W@CPR1
     I                                        6  10 W@CPR2
     I                                       11  12 W@CPR3
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 NCKQ
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 NPRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1 180 PRT
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  12 A2HIN
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'00'      #SCRN0
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
      *
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
     C           K#AP11    KLIST
     C                     KFLD           WWZETI
     C                     KFLD           WWORDR
      *
     C           K#KEY     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#ABB     KLIST
     C                     KFLD           K@DATE  80
     C                     KFLD           D@LOC
     C                     KFLD           WBAR
     C           K#ABH     KLIST
     C                     KFLD           K@FCT   40
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#LOC     KLIST
     C                     KFLD           W7L1
     C                     KFLD           W7L2
     C                     KFLD           W7L3
     C                     KFLD           W7L4
      *
     C                     Z-ADD*DATE     K@DATE
     C                     Z-ADD0111      K@FCT
      *
     C                     MOVE '00'      @@ID    2
      *
     C*
     C                     ENDSR
     C*************************************************************************
     C*     LOCATION ENTRY
     C**************************************************************************
     C           #SCRN0    BEGSR
      *
     C                     Z-ADD0         D@RCNT
      *
     C                     EXFMTDSP00
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
      *
     C                     OTHER
     C                     EXSR #CHK0
     C           *IN99     IFEQ *OFF
     C                     MOVE '01'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C*************************************************************************
     C*     SHIFT ENTRY
     C**************************************************************************
     C           #CHK0     BEGSR
      *
     C                     SETOF                     6199
      *
TCHK2C           D@LOC     IFEQ 'A'
TCHK3C           D@LOC     OREQ 'B'
TCHK5C           D@LOC     OREQ 'C'
TCHK5C           D@LOC     OREQ 'D'
TCHK5C           D@LOC     OREQ 'E'
     C           D@LOC     OREQ 'F'
JW2  C           D@LOC     OREQ 'G'
"    C           D@LOC     OREQ 'H'
TCHK3C                     ELSE
     C           D@LOC     IFLT '0'
     C           D@LOC     ORGT '9'
     C                     SETON                     6199
     C                     ENDIF
TCHK2C                     END
      *
      *
     C                     MOVEL*BLANK    D@LOCN
     C                     SELEC
     C           D@LOC     WHEQ '0'
     C                     MOVEL'HD'      D@LOCN
     C           D@LOC     WHEQ '1'
     C                     MOVEL'LAN'     D@LOCN
     C           D@LOC     WHEQ '2'
     C                     MOVEL'RL '     D@LOCN
     C           D@LOC     WHEQ '3'
     C**                   MOVEL'OQ'      D@LOCN
JW2  C                     MOVEL'OQ-PL'   D@LOCN
     C           D@LOC     WHEQ '4'
     C**                   MOVEL'BZ '     D@LOCN
JW2  C                     MOVEL'BZ1'     D@LOCN
     C           D@LOC     WHEQ '5'
     C                     MOVEL'BZ2'     D@LOCN
     C           D@LOC     WHEQ '6'
     C**                   MOVEL'DC1'     D@LOCN
JW2  C                     MOVEL'DS '     D@LOCN
     C           D@LOC     WHEQ '7'
     C**                   MOVEL'DC2'     D@LOCN
JW2  C                     MOVEL'MAGNI'   D@LOCN
     C           D@LOC     WHEQ '8'
     C                     MOVEL'BZ3'     D@LOCN
     C           D@LOC     WHEQ '9'
     C**                   MOVEL'TC '     D@LOCN
JW2  C                     MOVEL'OQ '     D@LOCN
     C           D@LOC     WHEQ 'A'
     C                     MOVEL'SB '     D@LOCN
     C           D@LOC     WHEQ 'B'
     C                     MOVEL'BZ4'     D@LOCN
     C           D@LOC     WHEQ 'C'
     C                     MOVEL'JC-PL'   D@LOCN
     C           D@LOC     WHEQ 'D'
     C                     MOVEL'JC'      D@LOCN
     C           D@LOC     WHEQ 'E'
     C                     MOVEL'QD'      D@LOCN
     C           D@LOC     WHEQ 'F'
     C                     MOVEL'BZ5'     D@LOCN
JW2  C           D@LOC     WHEQ 'G'
"    C                     MOVEL'OQ-IN'   D@LOCN
JW2  C           D@LOC     WHEQ 'H'
"    C                     MOVEL'OQ-ZZ'   D@LOCN
     C                     ENDSL
      *
     C                     ENDSR
     C*************************************************************************
     C*          IST SCREEN
     C**************************************************************************
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
      * F3:BACK
     C           *INKC     WHEQ *ON
     C                     MOVE '00'      @@ID
     C                     CLEARDSP00
     C                     CLEARDSP01
     C                     CLEARDSP11
     C* F7:CANCEL
     C           *INKG     WHEQ *ON
     C                     MOVE '02'      @@ID
     C                     CLEARDSP02
     C*** F5:CHANGE KANBAN KIND - NO USED
     C***        *INKE     WHEQ *ON
     C***        @@K       IFEQ 'A'
     C***                  MOVE 'P'       @@K
     C***                  ELSE
     C***                  MOVE 'A'       @@K
     C***                  ENDIF
      *
     C                     OTHER
      * CHECK
     C                     EXSR #CHK1
      *
     C           WWKANS    IFGE '0'
     C           WWKANS    ANDLE'9'
     C                     MOVEL'P'       @@K     1        IN-PROCESS
     C                     ELSE
     C                     MOVE 'A'       @@K              A-PICS
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
      * GO TO 2ND SCREEN TO ENTER # OF CONTAINER
     C           D@LOC     IFEQ 'E'                        QD
     C           D@LOC     OREQ 'C'                        JC-PL
     C           D@LOC     OREQ 'D'                        JC
     C                     EXSR #SCRNB
     C                     ELSE
     C                     EXSR #WRT
     C***                  CLEARDSP01
     C                     MOVEL*BLANK    D@KNBN
     C                     MOVEL*BLANK    D@ERR
     C                     SETOF                     616299
     C***                  CLEARDSP11
     C                     Z-ADD0         D@HAKO
     C                     END
     C                     ELSE
     C                     EXFMTERR01
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK
     C**************************************************************************
     C           #CHK1     BEGSR
     C*
     C                     MOVE *BLANK    ERR1                         F5
     C                     MOVE *BLANK    ERR2                         F5
     C                     SETOF                     996162
      *
     C           D@KNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     ERR1
     C                     ELSE
     C**
     C                     MOVE D@KNBN    WBAR
     C           WWBCHK    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,9     ERR1
     C                     ENDIF
      *
     C           WWZETI    CHAINFCETL11              90
B01  C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,1     ERR1
     C                     ENDIF
      *
     C           K#ABB     CHAINABBPL90              90
     C  N99      *IN90     IFEQ *OFF
     C                     SETON                     9961
     C                     MOVELERR,2     ERR1
     C                     MOVELERR,3     ERR2
     C                     ENDIF
      * CHECK DIGIT
#### C           #USER     IFNE 'TEST'
#### C           #USER     ANDNE'I0777'
     C                     MOVELWBAR      PMAREA    P
     C                     MOVE '014'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C           PMRTCD    IFNE *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     ERR1
     C                     ELSE
     C           PMCHK     IFNE WWCHK
     C                     SETON                     9961
     C                     MOVELERR,1     ERR1
     C                     ENDIF
     C                     ENDIF
#### C                     END
     C                     ENDIF
      *
     C                     ENDSR
TCHK5C*************************************************************************
TCHK5C*          11  SCREEN
TCHK5C**************************************************************************
     C           #SCRNB    BEGSR
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTDSP11
      *
     C                     SELEC
     C***        *INKC     WHEQ *ON
     C***                  MOVE '99'      @@ID
     C***                  LEAVE
     C           *INKC     WHEQ *ON
     C                     MOVE '01'      @@ID
     C**                   CLEARDSP00
     C***                  CLEARDSP01
     C                     MOVEL*BLANK    D@KNBN
     C                     MOVEL*BLANK    D@ERR
     C                     SETOF                     616299
     C***                  CLEARDSP11
     C                     Z-ADD0         D@HAKO
     C                     LEAVE
     C           *INKG     WHEQ *ON
     C                     MOVE '02'      @@ID
     C                     CLEARDSP02
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHKB
     C           *IN99     IFEQ *OFF
     C                     EXSR #WRT
     C***                  CLEARDSP01
     C                     MOVEL*BLANK    D@KNBN
     C                     MOVEL*BLANK    D@ERR
     C                     SETOF                     616299
     C***                  CLEARDSP11
     C                     Z-ADD0         D@HAKO
     C                     LEAVE
     C                     ELSE
     C                     EXFMTERR01
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK
     C**************************************************************************
     C           #CHKB     BEGSR
     C*
     C                     MOVE *BLANK    ERR1                         F5
     C                     MOVE *BLANK    ERR2                         F5
     C                     SETOF                     996162
      *
     C           D@HAKO    IFEQ *ZERO
     C                     SETON                     9962
     C                     MOVELERR,7     ERR1
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*       WRITE A RECORD
     C**************************************************************************
     C           #WRT      BEGSR
     C*
     C                     CLEARABBPP901
     C                     Z-ADD*DATE     A9DATE
     C                     TIME           A9TIME
     C                     MOVELD@LOC     A9LCID
     C                     MOVELD@KNBN    A9BRCD
     C                     MOVELA2BHB1    A9PRT1
     C                     MOVELA2BHB2    A9PRT2
     C                     MOVELA2BHB3    A9PRT3
      * A-PICS
1    C           @@K       IFEQ 'A'
|     *
|2   C           D@LOC     IFEQ 'E'
||   C           D@LOC     OREQ 'C'
||   C           D@LOC     OREQ 'D'
||   C           A2SSYS    MULT D@HAKO    A9QTY
||   C                     Z-ADDD@HAKO    A9BOX
|2   C                     ELSE
||   C           A2SSYS    MULT 4         A9QTY
||   C                     Z-ADD4         A9BOX
|2   C                     END
|     * IN-PROCESS
1    C                     ELSE
|    C           K#KEY     CHAINAAMPL11              90
|    C                     Z-ADD1         W       20
|    C           WWPROC    LOKUPNPRC,W                   10
|     *
|     * IN CASE OF 3 SPECIAL PARTS, PASS THE PROCESS CHECK
|2   C           A9PRT1    IFEQ 'U1026'
||   C           A9PRT2    ANDEQ'B1082'
||   C           A9PRT1    OREQ 'U1026'
||   C           A9PRT2    ANDEQ'B1083'
||   C           A9PRT1    OREQ 'U1026'
||   C           A9PRT2    ANDEQ'B1084'
||   C                     MOVE *ON       *IN10
|2   C                     ENDIF
|     *
|2   C           *IN10     IFEQ *ON
||   C                     MOVE NTKR,W    W7LOC
||   C                     MOVE PRT,W     W@CPRT 12
||   C                     SELEC
||3  C           NCKQ,W    WHEQ 'C'
|||  C           K#LOC     SETLLAAFPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     READEAAFPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           A31HB5    ANDEQA9PRT1
|||  C           A32HB5    ANDEQA9PRT2
|||  C           A33HB2    ANDEQA9PRT3
|||  C           A3SKJY    IFEQ 'D'
|||  C           A3STHZ    ORNE 99999999
|||  C                     ITER
|||  C                     ENDIF
|||  C                     Z-ADDA3BARA    @BARL   20
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||   *
|||  C           NCKQ,W    WHEQ 'D'
|||  C           K#LOC     SETLLAAGPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     READEAAGPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           O4SHN1    ANDEQA9PRT1
|||  C           O4SHN2    ANDEQA9PRT2
|||  C           O4SHN3    ANDEQA9PRT3
|||  C           O4SKJY    IFEQ 'D'
|||  C           O4STHZ    ORNE 99999999
|||  C                     ITER
|||  C                     ENDIF
|||  C                     Z-ADDO4BARA    @BARL
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||   *
|||  C           NCKQ,W    WHEQ 'E'
|||  C           K#LOC     SETLLAAHPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     READEAAHPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           L6SHN1    ANDEQA9PRT1
|||  C           L6SHN2    ANDEQA9PRT2
|||  C           L6SHN3    ANDEQA9PRT3
|||  C           L6SKJY    IFEQ 'D'
|||  C           L6STHZ    ORNE 99999999
|||  C                     ITER
|||  C                     ENDIF
|||  C                     Z-ADDL6LOTO    @BARL
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||  C*
|||  C           NCKQ,W    WHEQ 'B'
|||   *
|||  C           K#LOC     SETLLADHPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     READEADHPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           J6SHN1    ANDEQA9PRT1
|||  C           J6SHN2    ANDEQA9PRT2
|||  C           J6SHN3    ANDEQA9PRT3
|||  C           J6SKJY    IFEQ 'D'
|||  C           J6STHZ    ORNE 99999999
|||  C                     ITER
|||  C                     ENDIF
|||  C                     Z-ADDJ6LOTO    @BARL
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||   *
|||  C           NCKQ,W    WHEQ 'E'
|||  C           K#LOC     SETLLAAHPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     READEAAHPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           L6SHN1    ANDEQA9PRT1
|||  C           L6SHN2    ANDEQA9PRT2
|||  C           L6SHN3    ANDEQA9PRT3
|||  C           L6SKJY    IFEQ 'D'
|||  C           L6STHZ    ORNE 99999999
|||  C                     ITER
|||  C                     ENDIF
|||  C                     Z-ADDL6LOTO    @BARL
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||   *
|||  C           NCKQ,W    WHEQ 'A'
|||  C           K#LOC     SETGTABHPL03
|||  C           *IN95     DOUEQ*ON
|||  C           K#LOC     REDPEABHPL03                  95
|||  C           *IN95     IFEQ *OFF
|||  C           M6SKJY    ANDEQ*BLANK
|||  C           M6LPDT    ANDEQ*ALL'9'
|||  C                     Z-ADDM6LOTK    @BARL
|||  C                     LEAVE
|||  C                     ENDIF
|||  C                     ENDDO
|||   *
||3  C                     ENDSL
||3  C           D@LOC     IFEQ 'E'
|||  C           D@LOC     OREQ 'C'
|||  C           D@LOC     OREQ 'D'
|||  C           D@HAKO    MULT A2SSYS    A9QTY
||   C                     Z-ADDD@HAKO    A9BOX
||3  C                     ELSE
|||  C           @BARL     MULT A2SSYS    A9QTY
||   C                     Z-ADD@BARL     A9BOX
||3  C                     END
||    *
|2   C                     ENDIF
1    C                     ENDIF
      *
     C                     WRITEABBPP901
      *
     C                     ADD  1         D@RCNT
      *
     C                     ENDSR
     C**************************************************************************
     C*    CANCEL
     C**************************************************************************
     C           #SCRN2    BEGSR
      *
     C                     EXFMTDSP02
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C***                  CLEARDSP01
     C                     MOVEL*BLANK    D@KNBN
     C                     MOVEL*BLANK    D@ERR
     C                     SETOF                     616299
     C                     MOVE '01'      @@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *ON
     C                     EXFMTERR01
     C                     ELSE
     C                     EXSR #DLT
     C                     MOVEL*BLANK    D@KNBN
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     CHECK
     C**************************************************************************
     C           #CHK2     BEGSR
     C*
     C                     MOVE *BLANK    ERR1                         F5
     C                     MOVE *BLANK    ERR2                         F5
     C                     SETOF                     996162
      *
     C           D@KNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,1     ERR1
     C                     ELSE
      *
     C                     MOVE D@KNBN    WBAR
     C           K#ABB     CHAINABBPL90              90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,6     ERR1
     C                     MOVELERR,8     ERR2
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*     DELETE
     C**************************************************************************
     C           #DLT      BEGSR
     C*
     C           K#ABB     CHAINABBPL90              90
     C           *IN90     IFEQ *OFF
     C                     DELETABBPP901
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
** ERR
KANBAN ERROR
  ALREADY
  SCANNED
PLASTIC ???
APICS ???
NOT SCANNED
ENTER #OF CONT
YET
NOT KANBAN
