     H            Y.                                    1
     F** ABBR2B *************************************
     F* .. MATERIAL   TOTALIZATION DATA             *                   *.
     F*     A.MAMIYA               2004.10.09       *
     F************************************* ABBR2B **
     FABBWP14 IP  F     256            DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FABBWP2B O   F     256            DISK
     E                    HYM         6  6 0             DATE(YM)
     E                    HCD         6  3 1
     IABBWP14 AA  01
     I                                        1  15 IZ1
     I                                       16  202IZ2
     I                                       21  290IJI1
     I                                       30  380IJI2
     I                                       39  470IJI3
     I                                       48  560IJI4
     I                                       57  650IJI5
     I                                       66  740IJI6
     I                                       75  780ISIRE
     I                                       79  870IJISU
     I                                       88  940@JI1
     I                                       95 1010@JI2
     I                                      102 1080@JI3
     I                                      109 1150@JI4
     I                                      116 1220@JI5
     I                                      123 1290@JI6
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1  360HYM
     I                                        1   60WYM1
     I                                        5   60WMM1
     I                                        7  120WYM2
     I                                       11  120WMM2
     I                                       13  180WYM3
     I                                       17  180WMM3
     I                                       19  240WYM4
     I                                       23  240WMM4
     I                                       25  300WYM5
     I                                       29  300WMM5
     I                                       31  360WYM6
     I                                       35  360WMM6
     I            DS
     I                                        1   60WWYM
     I                                        1   40WWYY
     I                                        5   60WWMM
     I            DS
     I                                        1   80WYMD
     I                                        1   40MCYY
     I                                        5   60MCMM
     I                                        7   80MCDD
      * ﾎﾟﾜhﾞ[w情報DS
     IINFDSP     SDS
     I                                        1  10 PGMNM
     I                                      254 263 USID
      *
     C           KEY1      KLIST
     C                     KFLD           MCYY
     C                     KFLD           MCMM
      *
     C           KEY3      KLIST
     C                     KFLD           WWYY
     C                     KFLD           WWMM
     C           KEY4      KLIST
     C                     KFLD           IZ1
     C                     KFLD           IZ2
      *
     C           *ENTRY    PLIST
     C                     PARM           PYM1    6
     C                     PARM           PYM2    6
     C                     PARM           PYM3    6
     C                     PARM           PYM4    6
     C                     PARM           PYM5    6
     C                     PARM           PYM6    6
     C                     PARM           PSYS    8
     C                     PARM           PYMD    8
      *
     C           *IN20     IFEQ '0'
     C                     SETON                     20
      *
     C                     MOVE PYMD      WYMD
     C                     Z-ADD0         @CD     31
     C           KEY1      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           KEY1      READEAGDPL121                 21
     C           *IN21     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @CD
     C                     ELSE
     C                     ADD  0.5       @CD
     C                     END
      *
     C                     END
     C                     END
     C  N21                END
      *
     C                     EXSR #RGA
      *-------------------------------------------------------*
     C                     MOVE PYM1      WYM1
     C                     MOVE PYM2      WYM2
     C                     MOVE PYM3      WYM3
     C                     MOVE PYM4      WYM4
     C                     MOVE PYM5      WYM5
     C                     MOVE PYM6      WYM6
      *
     C                     Z-ADD1         F       20
     C                     Z-ADD0         HCD
     C           1         DO   6         F
     C                     Z-ADDHYM,F     WWYM
     C                     Z-ADD0         WCD     31
      *
     C           KEY3      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     21
     C           KEY3      READEAGDPL121                 21
     C           *IN21     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WCD
     C                     ELSE
     C                     ADD  0.5       WCD
     C                     END
      *
     C                     END
     C                     END
     C  N21                END
      *
     C                     Z-ADDWCD       HCD,F
     C                     END
     C                     END
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    WSMEI  15
     C           ISIRE     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLT*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVE B2SMEI    WSMEI
     C                     END
      *
     C                     MOVEL*BLANK    WKNO2   1
     C                     MOVEL*BLANK    WKNO3   4
     C                     SETOF                     10
     C           KEY4      SETLLIZAPL01
     C                     DO   *HIVAL
     C           KEY4      READEIZAPL011                 10
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C           ZCKAKE    IFEQ 8990
     C           ZCKAKE    OREQ 0002
     C                     SETON                     10
     C                     MOVELZCKNO2    WKNO2
     C                     MOVELZCKNO3    WKNO3
     C                     END
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C                     Z-ADDIJI1      WJI1    70
     C                     Z-ADDIJI2      WJI2    70
     C                     Z-ADDIJI3      WJI3    70
     C                     Z-ADDIJI4      WJI4    70
     C                     Z-ADDIJI5      WJI5    70
     C                     Z-ADDIJI6      WJI6    70
      *
     C                     EXCPTDT
      *
     C           #RGA      BEGSR
     C           APLR00    PLIST
     C                     PARM           R@US   10
     C                     PARM           R@USNM 15
     C                     MOVELUSID      R@US
     C                     MOVEL*BLANK    R@USNM
     C                     CALL 'APLR00'  APLR00
     C           ERGA      ENDSR
     OABBWP2B E                DT
     O                         ISIRE      4
     O                         WSMEI     19
     O                         IZ1       34
     O                         IZ2       39
     O                         IJISU     48
     O                         WJI1      55
     O                         WJI2      62
     O                         WJI3      69
     O                         WJI4      76
     O                         WJI5      83
     O                         WJI6      90
     O                         WYM1      96
     O                         WYM2     102
     O                         WYM3     108
     O                         WYM4     114
     O                         WYM5     120
     O                         WYM6     126
     O                         HCD,1    129
     O                         HCD,2    132
     O                         HCD,3    135
     O                         HCD,4    138
     O                         HCD,5    141
     O                         HCD,6    144
     O                         @JI1     151
     O                         @JI2     158
     O                         @JI3     175
     O                         @JI4     182
     O                         @JI5     189
     O                         @JI6     196
     O                         PSYS     204
     O                                  208 '0111'
     O                                  212 '0111'
     O                                  213 '1'
     O                                  217 '00  '
     O                         @CD      220
     O                         R@USNM   235
     O                         WKNO2    236
     O                         WKNO3    240
