     H            Y.
     F** ABBR71 *************************
     F*  PRIORITY KANBAN LIST           *
     F*    09/27/01                     *
     F*                                 *
     F*
     F*                                 *
     F************************* ABBR71 **
     FABBPW7D CF  E                    WORKSTN
     FABBPL71 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FABBWP7D UF  E           K        DISK                      A
      *--------------------------------------------------
     E                    QTY        31  5 0
      *--------------------------------------------------
     I            DS
     I                                        1 155 QTY
     I                                        1   50ADQT01
     I                                        6  100ADQT02
     I                                       11  150ADQT03
     I                                       16  200ADQT04
     I                                       21  250ADQT05
     I                                       26  300ADQT06
     I                                       31  350ADQT07
     I                                       36  400ADQT08
     I                                       41  450ADQT09
     I                                       46  500ADQT10
     I                                       51  550ADQT11
     I                                       56  600ADQT12
     I                                       61  650ADQT13
     I                                       66  700ADQT14
     I                                       71  750ADQT15
     I                                       76  800ADQT16
     I                                       81  850ADQT17
     I                                       86  900ADQT18
     I                                       91  950ADQT19
     I                                       96 1000ADQT20
     I                                      101 1050ADQT21
     I                                      106 1100ADQT22
     I                                      111 1150ADQT23
     I                                      116 1200ADQT24
     I                                      121 1250ADQT25
     I                                      126 1300ADQT26
     I                                      131 1350ADQT27
     I                                      136 1400ADQT28
     I                                      141 1450ADQT29
     I                                      146 1500ADQT30
     I                                      151 1550ADQT31
     I            DS
     I                                        1   6 A7LOCT
     I                                        2   2 A702
     I                                        2   3 A7L1
     I                                        4   5 A7L2
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   5 @LOCT
     I                                        1   2 @LOC1
     I I            '-'                       3   3 @HFN
     I                                        4   5 @LOC2
     I                                        1   1 @@LL
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C           K#7D      KLIST
     C                     KFLD           K@LCID  2
     C                     KFLD           K@LOC   5
     C                     KFLD           A7PRT1
     C                     KFLD           A7PRT2
     C                     KFLD           A7PRT3
     C           K#ADG     KLIST
     C                     KFLD           W@YY
     C                     KFLD           W@MM
     C                     KFLD           W@DD
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE '3'       D@SHFT
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------
      *
     C                     EXFMTDSP01
      *
     C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@ID
     C                     ELSE
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------
      *
     C                     SETOF                     619962
     C                     SETOF                     6364
     C           D@YYMM    IFEQ *ZERO
     C                     SETON                     6199
     C                     ELSE
     C           D@YYMM    MULT 100       W@YMD
     C                     ADD  1         W@YMD
     C           K#ADG     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
     C                     ENDIF
      *
     C           D@LOC     IFGT '3'
     C                     SETON                     6399
     C                     ENDIF
      *
     C           D@SHFT    IFLT '1'
     C           D@SHFT    ORGT '3'
     C                     SETON                     6499
     C                     ENDIF
      *
     C           D@LOC     COMP '1'                      11
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #WRT      BEGSR
      *-----------------------------------------------
      *
     C           W@YMD     ADD  30        W@END   80
      *
     C           W@YMD     SETLLABBPL71
     C           *IN80     DOUEQ*ON
     C                     READ ABBPL71                  80
     C  N80      A7DATE    COMP W@END                80
     C           *IN80     IFEQ *OFF
     C           A7KQTY    ANDNE*ZERO
     C           A7SHFT    ANDEQD@SHFT
      *
     C                     SELEC
     C           D@LOC     WHEQ '1'
     C           A702      ANDNE'H'
     C           A702      ANDNE'N'
     C           A702      ANDNE'S'
     C                     ITER
      *
     C           D@LOC     WHEQ '2'
     C           A702      ANDNE'T'
     C           A702      ANDNE'L'
     C           A702      ANDNE'J'
     C           A702      ANDNE'F'
     C                     ITER
      *
     C           D@LOC     WHEQ '3'
     C           A702      ANDNE'E'
     C           A702      ANDNE'G'
     C                     ITER
     C                     ENDSL
      *
     C                     Z-ADDA7DATE    W       20
      *
     C                     MOVE A7L1      @LOC1
     C                     MOVE A7L2      @LOC2
     C                     MOVE @LOCT     K@LOC
      *
     C                     SELEC
     C           A702      WHEQ 'H'
     C           A702      OREQ 'N'
     C           A702      OREQ 'S'
     C                     MOVE '10'      K@LCID
      *
     C           A702      WHEQ 'T'
     C                     MOVE '20'      K@LCID
     C           A702      WHEQ 'L'
     C                     MOVE '21'      K@LCID
     C           A702      WHEQ 'J'
     C                     MOVE '22'      K@LCID
     C           A702      WHEQ 'F'
     C                     MOVE '23'      K@LCID
      *
     C           A702      WHEQ 'E'
     C                     MOVE '30'      K@LCID
     C           A702      WHEQ 'G'
     C                     MOVE '31'      K@LCID
     C                     ENDSL
      *
     C           K#7D      CHAINABBWP7D              90
     C           *IN90     IFEQ *ON
     C                     CLEARABBWP7D1
     C                     MOVE K@LCID    ADLCID
     C                     MOVE K@LOC     ADLOC
     C                     MOVE A7PRT1    ADPRT1
     C                     MOVE A7PRT2    ADPRT2
     C                     MOVE A7PRT3    ADPRT3
      *
     C           K@LCID    IFEQ '10'
     C                     MOVE A7MCHN    ADMCHN
     C                     MOVE A7NPRC    ADNXPR
     C                     ELSE
     C                     MOVE A7MCHN    ADRLMC
     C                     ENDIF
     C                     Z-ADDA7LOTS    ADLOT
      *
     C                     ADD  A7KQTY    QTY,W
     C                     WRITEABBWP7D1
     C                     ELSE
     C                     ADD  A7KQTY    QTY,W
     C                     UPDATABBWP7D1
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
