     H            Y.
     F*** ABCR13 ********************************
     F* A CALCULATION OF INSTRUCTION KANBAN SHEETS *
     F*       H.ITO         1991.06.27          *
     F* %0001 T.SAKAKI      2021.05.12          *
     F******************************** ABCR13 ***
     C           *ENTRY    PLIST
     C                     PARM           PARM01  2        LR
     C                     PARM           PARM02  90       QTY/DAY
     C                     PARM           PARM03  50       QPC.
     C                     PARM           PARM04  41       TOTAL L.T
NO USC                     PARM           PARM05  20       BARREL A
     C                     PARM           PARM06  32       COEFFICIENT
NO USC                     PARM           PARM07  20       OQ LOT
     C                     PARM           PARM08  30       MAX BOXES
NO USC                     PARM           PARM09  1        NEW CAR TYPE
NO USC                     PARM           PARM10  20       SHELF
     C                     PARM           PARM11  20       PROD. LOT
     C                     PARM           PARM12  50       # OF KANBAN
      *
      *****  NOT USED      PARM           PARM05  20       BARREL A
      *****  NOT USED      PARM           PARM07  20       OQ LOT
     C*****  NOT USED      PARM           PARM09  1        NEW CAR TYPE
     C*****  NOT USED      PARM           PARM10  20       SHELF
      *
      *
     C           PARM01    IFEQ 'LR'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
      *  IF QPC. IS 0, THEN SKIP
     C           PARM03    CABEQ0         @END
      *
      *
      *--------------------------------------------------
      * SKIP ALL OLD CALCULATION
      *--------------------------------------------------
     C* 1.  DDDDD = ﾍajﾒﾇcﾒｭc MULT ﾌﾞ[lgibﾇc DIV ﾆｬcﾑcﾇc
     C*          QTY/DAY   *    COEEFICIENT / QPC.
     C*
     C           PARM02    MULT PARM04    AAAAA   90
     C           AAAAA     MULT PARM06    BBBBB   91
     C* 2.
     C           BBBBB     ADD  0.9       CCCCC   90
     C* 3.
     C           CCCCC     DIV  PARM03    DDDDD   90
     C                     MVR            EEEEE   90
     C* 4.
     C           EEEEE     IFNE 0
     C                     ADD  1         DDDDD
     C                     END
     C*
     C* 5.  PRODUCTION LOT - 1
     C*
     C           PARM11    SUB  1         FFFFF   20
      *
     C* 6.
     C* HHHHH<ﾆ]ﾆｫgﾒfd ﾆﾞｭcﾇc> = ﾆ]ﾆｫhﾎﾞ]-A ﾉng
     C*                              ﾍajﾒﾇcﾒｭc DIV ﾆｬcﾑcﾇc < 1 = 2
     C*                          ﾆ]ﾆｫhﾎﾞ]-B ﾉng
     C*                              ﾍajﾒﾇcﾒｭc DIV ﾆｬcﾑcﾇc < 2 = 1
     C***        PARM09    IFEQ 'A'
     C***        PARM02    DIV  PARM03    HHHHH   90
     C***        HHHHH     IFLT 1
     C***                  Z-ADD2         IIIII   10
     C***                  END
     C***                  END
     C***        PARM09    IFEQ 'B'
     C***        PARM02    DIV  PARM03    HHHHH
     C***        HHHHH     IFLT 2
     C***                  Z-ADD1         IIIII
     C***                  END
     C***                  END
      *
     C* < # OF KANBAN>
     C*    MMMMM = 4.DDDDD   + 5.FFFFF
     C*           (BOX/DAY)+(PRODUCTION LOT - 1)
     C*
     C******     JJJJJ     ADD  IIIII     LLLLL   90
     C******     LLLLL     ADD  PARM10    MMMMM   90
      **
     C           DDDDD     ADD  FFFFF     MMMMM   90
     C                     Z-ADDMMMMM     PARM12
      ** MINIMUM IS 2
     C           PARM12    IFLT 2
     C                     Z-ADD2         PARM12
     C                     END
     C*
     C* IF # OF KANBAN <= PRODUCTION LOT
     C*
     C           PARM12    IFLE PARM11
     C           PARM11    ADD  1         PARM12
     C                     END
     C*
     C* f]ﾌﾞ]ubﾇc + MAX
     C*
     C                     ADD  PARM08    PARM12
      *--------------------------------------------------
      *--------------------------------------------------
      *
     C           @END      TAG
      *
     C                     RETRN
