     H            Y.
     F** ABCR01 ********************
     F* .. KANBAN INCREASE AND DECREASE HANDLING || *.
     F* I-HASADA 86.12.18 *
     F******************** ABCR01 **
     FABBWP16 IP  F      12            DISK
     FAAMPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FAAUPL01 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FGHCPL22 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FAAJTL14 IF  E           K        DISK
     FABHPL03 UF  E           K        DISK
     FAAFPL03 UF  E           K        DISK
     FADHPL03 UF  E           K        DISK
     FAAGPL03 UF  E           K        DISK
     FAAHPL03 UF  E           K        DISK
     FAAPPL03 UF  E           K        DISK
     FAAOPL03 UF  E           K        DISK
     FAAYPL03 UF  E           K        DISK
     FAANPL03 UF  E           K        DISK
     FAAXPL10 UF  E           K        DISK
     FAEAPL03 UF  E           K        DISK
     FAECPL03 UF  E           K        DISK
     FAU#NP11 UF  F       9            DISK                      A
     FAU#PP51 O   E                    DISK                      A
     FABCWP01 O   F     350            DISK                      A
     FABCWP1Y O   F     200            DISK                      A
     FABCWP1Z O   F     200            DISK                      A
     FABCWPR1 O   F     100            DISK                      A
     FABCWP1X O   F     250            DISK                      A
     E                    HTY     1  12  1               f]ﾌﾞ]ﾆｬﾓb(mfﾞg)
     E                    TB1     1   1  4 0 TB2     4 0 udﾃcmb
     E                    KOT        15  3               ﾃcmb CD
     E                    BUM        15  4 0             ﾎﾞy] CD
     E                    KTY        15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    TKR        15  6               nﾃﾜ ﾌﾞ]k
     E                    KHN        15 12               ﾃcmb ﾍ]ﾌﾞ]
     E                    SUR        15  9 0             ﾃcmb ﾈｮmbﾇc
     E                    HIZ         4  8 0             ﾍﾇﾞi
     E                    CKKO       15  3               ﾃcmb (NEW)
     E                    CKBM       15  4 0             ﾎﾞy] (NEW)
     E                    CKTY       15  1               f]ﾌﾞ] ﾆｬﾓb (NEW)
     E                    CKNB       15  6               nﾃﾜ ﾌﾞ]k (NEW)
     E                    CKHB       15 12               ﾃcmb ﾍ]ﾌﾞ] (NEW)
     E                    CKSU       15  9 0             ﾃcmb ﾈｮmbﾇc (NEW)
     E                    @HZ         2  6 0             nclg.ﾑhlg.ﾑhﾑhlg
     E                    @CD         4  3 1             ﾃcmbob f]ﾌﾞ] ﾍﾇﾞi
     E                    #HIN      100 12               ﾃcmbobf]ﾌﾞ] kｩｮh
     E                    #SRY       12  9 0             ﾃcmbobf]ﾌﾞ] ﾆﾞｮﾈg
     IABBWP16 AA  91
     I                                        1  12 ASHIN
     I                                        1   5 ASHN1
     I                                        6  10 ASHN2
     I                                       11  12 ASHN3
     IAU#NP11 BB  90
     I                                        1   20AHZMM
     I                                        3   90ARECD
      *
     I            DS
     I                                        1  45 CKKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600CKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  90 CKNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 180 CKHB
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1 1350CKSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1 1080#SRY
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1   6 WTKR
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1  12 WKHIN
     I                                        1   5 WKHN1
     I                                        6  10 WKHN2
     I                                       11  12 WKHN3
     I            DS
     I                                        1   60HMS
     I                                        1   20HOUR
     I                                        3   40MINUTE
     I                                        5   60SECOND
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     I            DS
     I                                        1   80F8KAYM
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80CQURHZ
     I                                        1   40CQURYY
     I                                        5   60CQURMM
     I                                        7   80CQURDD
     I            DS
     I                                        1   80CQTHHZ
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   6 CQTKR
     I                                        1   1 CQSBKJ
     I                                        2   3 CQSBRO
     I                                        4   5 CQSBRT
     I                                        6   6 CQSBDN
     I            DS
     I                                        1   80CQNOHZ
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     I            DS
     I                                        1  100KUKBI
     I                                        1   80KUYMD
     I                                        9  100KUBIN
     I            DS
     I                                        1  100CJCHHB
     I                                        1   80CJCHHZ
     I                                        9  100CJCHBI
     I            DS
     I                                        1   60#YM
     I                                        1   40#YY
     I                                        5   60#MM
     I            DS
     I                                        1   60##YM
     I                                        1   40##YY
     I                                        5   60##MM
     I            DS
     I                                        1   60#JYM
     I                                        1   40#JYY
     I                                        5   60#JMM
     I            DS
     I                                        1  12 MMJHIN
     I                                        1   5 MMJHN1
     I                                        6  10 MMJHN2
     I                                       11  12 MMJHN3
     I            DS
     I                                        1   6 @TKR
     I                                        1   1 @TKR1
     I                                        2   3 @TKR2
     I            DS
     I                                        1   80C7KEHZ
     I                                        1   40C7KEYY
     I                                        5   60C7KEMM
     I                                        7   80C7KEDD
      *
     C           KEYA      KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
     C                     KFLD           WDD
      *
     C           KEYB      KLIST
     C                     KFLD           ASHN1
     C                     KFLD           ASHN2
     C                     KFLD           ASHN3
      *
     C           KEYC      KLIST
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEYD      KLIST
     C                     KFLD           L5BMON
     C                     KFLD           L5TAIP
      *
     C           #KEY      KLIST
     C                     KFLD           L7BMON
     C                     KFLD           L7TAIP
      *
     C           KEY1      KLIST
     C                     KFLD           WDHN1
     C                     KFLD           WDHN2
     C                     KFLD           WDHN3
      *
     C           KEY2      KLIST
     C                     KFLD           #YY
     C                     KFLD           #MM
      *
     C           KEY3      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
     C                     KFLD           ##YM
      *
     C           KEY4      KLIST
     C                     KFLD           WKHN1
     C                     KFLD           WKHN2
     C                     KFLD           WKHN3
     C                     KFLD           WKOTI
     C                     KFLD           WBMON
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEY5      KLIST
     C                     KFLD           #JYY
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEY6      KLIST
     C                     KFLD           @TKR1
     C                     KFLD           @TKR2
      *
     C           KEY7      KLIST
     C                     KFLD           MMJHN1
     C                     KFLD           MMJHN2
     C                     KFLD           MMJHN3
      *
     C           KEY8      KLIST
     C                     KFLD           M6NKOJ
     C                     KFLD           M6JBN1
     C                     KFLD           M6JBN2
     C                     KFLD           M6JBN3
     C                     KFLD           M6JBN4
      *
     C           L5KEY     KLIST
     C                     KFLD           L5TKR1
     C                     KFLD           L5TKR2
     C                     KFLD           L5TKR3
     C                     KFLD           L5TKR4
      *
     C           L7KEY     KLIST
     C                     KFLD           L7TKR1
     C                     KFLD           L7TKR2
     C                     KFLD           L7TKR3
     C                     KFLD           L7TKR4
      *
     C           T1KEY     KLIST
     C                     KFLD           T1TKR1
     C                     KFLD           T1TKR2
     C                     KFLD           T1TKR3
     C                     KFLD           T1TKR4
      *
     C           L8KEY     KLIST
     C                     KFLD           L8TKR1
     C                     KFLD           L8TKR2
     C                     KFLD           L8TKR3
     C                     KFLD           L8TKR4
      *
     C           KEYE      KLIST
     C                     KFLD           T1BMON
     C                     KFLD           T1TAIP
      *
     C           KEYF      KLIST
     C                     KFLD           L8BMON
     C                     KFLD           L8TAIP
      *
     C           KEYS      KLIST
     C                     KFLD           T1SBMN
     C                     KFLD           T1STAP
      *
     C           KEYG      KLIST
     C                     KFLD           L8SBMN
     C                     KFLD           L8STAP
      *
     C           *ENTRY    PLIST
     C                     PARM           PKBN    1
     C                     PARM           PYM     6
     C                     PARM           PJYM    6
     C                     PARM           PCD     3
     C                     PARM           PCD1    3
     C                     PARM           PCD2    3
     C                     PARM           PCD3    3
     C                     PARM           PCD4    3
      *
     C                     MOVE PYM       #YM
     C                     MOVE PYM       ##YM
     C                     MOVE PJYM      #JYM
     C                     MOVE PCD       WCD     31
      *
     C           *IN01     IFEQ '0'
     C                     SETON                     01
      *
     C                     Z-ADD*DATE     WYMD
     C           PKBN      IFEQ 'B'
     C           PKBN      OREQ 'C'
     C           PKBN      OREQ 'D'
     C                     SETON                     99
     C                     END
      *
     C                     Z-ADD0         HIZ
     C           KEYA      SETGTAGDPL111
     C                     SETOF                     02
     C                     READ AGDPL111                 02
     C           *IN02     IFEQ '1'
     C                     SETON                       U1LR
     C                     RETRN
     C                     END
     C                     Z-ADDF8KAYM    WYMD1   80
      *
     C           KEYA      SETGTAGDPL111
     C                     Z-ADD1         A       40
     C                     Z-ADD0         B       10
      *
     C           1         DO   6         A
     C                     SETOF                     02
     C                     READ AGDPL111                 02
     C           *IN02     IFEQ '1'
     C                     SETON                       U1LR
     C                     RETRN
     C                     END
     C           A         IFGE 3
     C                     ADD  1         B
     C                     Z-ADDF8KAYM    HIZ,B
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD0         @HZ
     C           1         DO   2         A
     C           #MM       IFEQ 12
     C                     ADD  1         #YY
     C                     Z-ADD01        #MM
     C                     ELSE
     C                     ADD  1         #MM
     C                     END
     C                     Z-ADD#YM       @HZ,A
     C                     END
      *
     C                     Z-ADD0         @CD
     C                     Z-ADD0         #CD     31
     C                     Z-ADD#JYM      #YM
      *
     C           KEY2      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY2      READEAGDPL121                 02
     C           *IN02     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         #CD
     C                     ELSE
     C                     ADD  0.5       #CD
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
     C                     Z-ADD#CD       @CD,3
      *
     C                     Z-ADD0         #CD
     C                     Z-ADDWYM       #YM
      *
     C           KEY2      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY2      READEAGDPL121                 02
     C           *IN02     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         #CD
     C                     ELSE
     C                     ADD  0.5       #CD
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
     C                     Z-ADD#CD       @CD,4
      *
     C                     Z-ADD1         A
     C           1         DO   2         A
     C                     Z-ADD0         #CD
     C                     Z-ADD@HZ,A     #YM
      *
     C           KEY2      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY2      READEAGDPL121                 02
     C           *IN02     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         #CD
     C                     ELSE
     C                     ADD  0.5       #CD
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
     C                     Z-ADD#CD       @CD,A
     C                     END
      *
     C                     MOVE @CD,4     PCD1
     C                     MOVE @CD,3     PCD2
     C                     MOVE @CD,1     PCD3
     C                     MOVE @CD,2     PCD4
      *
     C                     END
      *
      *
     C*------------------------------*
     C*     ...かんばん増減...     *
     C*------------------------------*
     C                     SETOF                     10
     C                     MOVE *BLANK    ASURI   2
     C           KEYB      CHAINAAMPL111             10
     C           *IN10     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C   10                GOTO END
      *
     C                     MOVE *BLANK    KOT
     C                     Z-ADD0         BUM
     C                     MOVE *BLANK    KTY
     C                     MOVE *BLANK    TKR
     C                     MOVE *BLANK    KHN
     C                     Z-ADD0         SUR
     C                     MOVE *BLANK    @TKR
      *
     C                     Z-ADD1         I
     C                     Z-ADD0         X       20
     C           1         DO   15        I
     C           CKKO,I    IFNE *BLANK
     C                     ADD  1         X
     C                     MOVE CKKO,I    KOT,X
     C                     Z-ADDCKBM,I    BUM,X
     C                     MOVE CKTY,I    KTY,X
     C                     MOVE CKNB,I    TKR,X
     C                     MOVE CKHB,I    KHN,X
     C                     Z-ADDCKSU,I    SUR,X
     C                     MOVE CKNB,I    @TKR
     C                     END
     C                     END
      *
     C                     Z-ADD1         E       20
     C                     Z-ADD16        I       20
     C           1         DO   15        E
     C                     SUB  1         I
     C           SUR,I     IFNE 0
      *
     C                     Z-ADDSUR,I     WSUROK  90
      *
     C           SUR,I     DIV  WCD       WRURO   90
     C                     MVR            WRURO1  90
     C           WRURO1    IFNE 0
     C                     ADD  1         WRURO
     C                     END
     C           WRURO     IFEQ 0
     C                     Z-ADD1         WRURO
     C                     END
      *
     C           WRURO     MULT 20        WSURO   90
     C           WSURO     IFEQ 0
     C                     Z-ADD1         WSURO
     C                     END
      *
      *
     C*--------------------------------*
     C*     ... ABHPL03                *
     C*     ...工程内かんばん...     *
     C*--------------------------------*
     C           KTY,I     IFEQ 'A'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI   3
     C                     Z-ADDBUM,I     WBMON   40
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLABHPL031
      *
     C           YYP0      TAG
     C                     SETOF                     10
     C                     READ ABHPL031                 10
     C           *IN10     IFEQ '0'
     C           M6SKJY    ANDEQ'D'
     C           M6SKHZ    CABLE*DATE     YYP0
     C                     END
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
      *
     C           M6JBAN    IFNE TKR,I
     C                     GOTO AP1
     C                     END
     C           M6STHZ    CABLE*DATE     YYP0
      *
     C           M6DTKO    IFEQ '2'
     C           M6DTKO    OREQ 'D'
     C                     Z-ADDWSURO     M6KTSU
     C                     GOTO YYP01
     C                     END
     C           M6SYUY    IFEQ 0
     C                     Z-ADDWSURO     M6KTSU
     C                     GOTO YYP01
     C                     END
      *
     C           M6KTSU    IFEQ WSURO
     C                     GOTO YYP01
     C                     END
      *
     C*------------------------------------------*
     C*  ..増減箱数・増減比率　の　チェック..  *
     C*------------------------------------------*
     C           M6KTSU    DIV  20        XKTSU   90H
     C           WSURO     DIV  20        XSURO   90H
      *
     C           XKTSU     DIV  M6SYUY    WMO    102H
     C           XSURO     DIV  M6SYUY    WMN    102H
     C                     Z-ADD0         WMON1   93
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON    51
     C           WMON1     MULT 100       $$WMON  40H
      *
     C                     MOVE 'Z'       #ZOGN   1
     C                     MOVE '+'       $$ZOGN  1
     C           WMN       IFLT WMO
     C                     MOVE 'G'       #ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           #ZOGN     ANDEQ'G'
     C                     GOTO YYP01
     C                     END
      *
     C*-----------------------------------------------*
     C*     ...増減比率　＋－２５％未満処理しない   *
     C*-----------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YYP01
     C                     END
      *
     C                     MOVE M6BMON    XBMN    4
     C                     MOVE WSURO     XKTS    9
     C                     MOVE M6SYUY    XSYU    7
     C                     MOVE M6LIGK    XGLT    4
     C                     MOVE M6ANZN    XANZ    3
     C                     MOVE M6BRAH    XBRA    3
     C                     MOVE M6SETO    XSET    3
     C                     MOVE M6ATLT    XALT    2
     C                     MOVE M6UKYY    XUYY    4
     C                     MOVE M6UKMM    XUMM    2
     C                     MOVE M6UKDD    XUDD    2
     C                     MOVE M6UBIN    XUBN    2
     C                     MOVE M6KJNK    PKJY    3
     C                     MOVE M6LOTK    PLOT    3
     C                     MOVE '000'     PMIS    3
     C                     MOVE *BLANK    ERR     1
      *
     C*------------------------------------------*
     C*     ... ABCR20                           *
     C*     ...工程内かんばん枚数　計算...     *
     C*------------------------------------------*
     C                     CALL 'ABCR20'
     C                     PARM           XBMN    4        部門
     C                     PARM           M6HIN1  5        品番・１
     C                     PARM           M6HIN2  5        　　・２
     C                     PARM           M6HIN3  2        　　・３
     C                     PARM           M6KSN1  1        計算区分１
     C                     PARM           M6KSN2  1        　　　　２
     C                     PARM           XKTS    9        確定設定数
     C                     PARM           XSYU    7        自工程収容数
     C                     PARM           XGLT    4        合計Ｌ・Ｔ
     C                     PARM           XANZ    3        安全率
     C                     PARM           XBRA    3        バラツキ箱数
     C                     PARM           XSET    3        セット数
     C                     PARM           XALT    2        後工程ロット
     C                     PARM           M6JBN1  1        所番地・１
     C                     PARM           M6JBN2  2        　　　・２
     C                     PARM           M6JBN3  2        　　　・３
     C                     PARM           M6JBN4  1        　　　・４
     C                     PARM           XUYY    4        有効日　年
     C                     PARM           XUMM    2        有効日　月
     C                     PARM           XUDD    2        有効日　日
     C                     PARM           XUBN    2        有効日　便
     C                     PARM           PKJY    3        基準値
     C                     PARM           PLOT    3        生産ロット
     C                     PARM           PMIS    3        かんばん枚数
     C                     PARM           ERR     1        エラー
      *
     C                     MOVE PKJY      WKJNK   30
     C                     MOVE PLOT      WLOTK   30
     C                     MOVE PMIS      WKMAX   30
      *
     C                     Z-ADD0         #KSTS   90
     C                     Z-ADD0         #KHTS   62
     C                     Z-ADD0         #ZSTS   90
     C                     Z-ADD0         #ZHTS   62
     C                     Z-ADD0         ##N1SU  90
     C                     Z-ADD0         #N1HS   62
     C                     Z-ADD0         ##N2SU  90
     C                     Z-ADD0         #N2HS   62
     C                     Z-ADD0         ##ZGSU  90
     C                     Z-ADD0         #ZGHS   62
     C                     Z-ADD0         #TENS   30
      *
     C                     Z-ADDWSUROK    ##KSTS  90
     C                     Z-ADDWSURO     #KSTS
     C           WSURO     DIV  20        WKTE    90H
     C           M6SYUY    IFNE 0
     C           WKTE      DIV  M6SYUY    #KHTS     H
     C                     END
      *
     C                     Z-ADDM6KTSU    #ZSTS
     C           M6KTSU    DIV  20        WKTE      H
     C           M6SYUY    IFNE 0
     C           WKTE      DIV  M6SYUY    #ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W       40
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    ##N1SU
     C                     ADD  U1N2NM    ##N2SU
     C                     ELSE
     C                     ADD  U1S1NM    ##N1SU
     C                     ADD  U1S2NM    ##N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U       20
     C                     ADD  #SRY,U    ##ZGSU
     C                     ADD  1         #TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           ##N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        #N1SU   90
     C           M6SYUY    IFNE 0
     C           WKTE      DIV  M6SYUY    #N1HS     H
     C                     END
      *
     C           ##N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        #N2SU   90
     C           M6SYUY    IFNE 0
     C           WKTE      DIV  M6SYUY    #N2HS     H
     C                     END
      *
     C           ##ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        #ZGSU   90
     C           M6SYUY    IFNE 0
     C           WKTE      DIV  M6SYUY    #ZGHS     H
     C                     END
      *
     C                     Z-ADD0         #KHPS   61
     C           #ZHTS     IFNE 0
     C           #KHTS     DIV  #ZHTS     #KHPS1  83H
     C           #KHPS1    MULT 100       #KHPS     H
     C                     END
      *
     C                     SETON                     U3
     C                     EXCPTKDT
      *
     C                     MOVE M6SHIN    $$SHIN 12
     C                     MOVE M6JBAN    $$TKRO  6
     C                     MOVE 'A'       $$KCOD  1
     C                     Z-ADDM6BMON    $$BMON  40
     C                     EXCPTRDT1
      *
     C           YYP01     TAG
     C                     Z-ADDWSURO     M6KSSU
     C                     UPDATABHPL031
     C                     GOTO YYP0
      *
     C                     END
      *
      *
     C*------------------------------*
     C*     ... ADHPL03              *
     C*     ...焼入かんばん...     *
     C*------------------------------*
     C           KTY,I     IFEQ 'B'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLADHPL031
      *
     C           YYP1      TAG
     C                     SETOF                     10
     C                     READ ADHPL031                 10
     C           *IN10     IFEQ '0'
     C           J6SKJY    ANDEQ'D'
     C           J6SKHZ    CABLE*DATE     YYP1
     C                     END
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
      *
     C           J6ATKR    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           J6STHZ    CABLE*DATE     YYP1
      *
     C           J6DTKO    IFEQ '2'
     C           J6DTKO    OREQ 'D'
     C                     Z-ADDWSURO     J6KTSU
     C                     GOTO YYP11
     C                     END
     C           J6SYOS    IFEQ 0
     C                     Z-ADDWSURO     J6KTSU
     C                     GOTO YYP11
     C                     END
      *
     C           J6KEI2    IFEQ 'E'
     C                     GOTO YYP11
     C                     END
      *
     C           J6KTSU    IFEQ WSURO
     C                     GOTO YYP11
     C                     END
      *
     C           J6KTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  J6SYOS    WMO       H
     C           XSURO     DIV  J6SYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       @ZOGN   1
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       @ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           @ZOGN     ANDEQ'G'
     C                     GOTO YYP11
     C                     END
      *
     C*-----------------------------------------------*
     C*     ...増減比率　＋－２５％未満処理しない   *
     C*-----------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YYP11
     C                     END
      *
     C                     MOVE '000'     YWMISU  3
     C                     MOVELJ6KTSU    YWKTSU  9
     C                     MOVELJ6SYOS    YWSYOS  7
     C                     MOVELJ6KAKE    YWKAKE  2
     C                     MOVELJ6NKOJ    YWATOB  4
     C                     MOVELJ6HKLT    YWHKLT  2
     C                     MOVELJ6LOTO    YWLOTO  2
     C                     MOVELJ6TOLT    YWTOLT  3
     C                     MOVELJ6ANZR    YWANZR  3
     C                     MOVELJ6SETO    YWSETO  2
     C                     MOVELJ6BRAH    YWBRAH  2
     C                     MOVELJ6UKYY    YWUKYY  4
     C                     MOVELJ6UKMM    YWUKMM  2
     C                     MOVELJ6UKDD    YWUKDD  2
     C                     MOVELJ6UBIN    YWUBIN  2
     C                     MOVELJ6MAKB    YWMAKB  4
     C                     MOVEL*BLANK    YWERR   1
      *
     C*----------------------------------------*
     C*     ... ABCR21                         *
     C*     ...焼入かんばん枚数　計算...     *
     C*----------------------------------------*
     C                     CALL 'ABCR21'
     C                     PARM           J6KEI1
     C                     PARM           J6KEI2
     C                     PARM           YWKTSU
     C                     PARM           YWSYOS
     C                     PARM           YWKAKE
     C                     PARM           J6SHN1
     C                     PARM           J6SHN2
     C                     PARM           J6SHN3
     C                     PARM           YWATOB
     C                     PARM           J6ATOK
     C                     PARM           J6ATK1
     C                     PARM           J6ATK2
     C                     PARM           J6ATK3
     C                     PARM           J6ATK4
     C                     PARM           YWHKLT
     C                     PARM           YWLOTO
     C                     PARM           YWTOLT
     C                     PARM           YWANZR
     C                     PARM           YWSETO
     C                     PARM           YWBRAH
     C                     PARM           YWUKYY
     C                     PARM           YWUKMM
     C                     PARM           YWUKDD
     C                     PARM           YWUBIN
     C                     PARM           YWMAKB
     C                     PARM           J6MTYP
     C                     PARM           YWMISU
     C                     PARM           YWERR
      *
     C                     MOVELYWMISU    @NMAS   30
     C                     Z-ADDJ6KMAX    @OMAS   30
      *
     C                     Z-ADD0         @KSTS   90
     C                     Z-ADD0         @KHTS   62
     C                     Z-ADD0         @ZSTS   90
     C                     Z-ADD0         @ZHTS   62
     C                     Z-ADD0         @@N1SU  90
     C                     Z-ADD0         @N1HS   62
     C                     Z-ADD0         @@N2SU  90
     C                     Z-ADD0         @N2HS   62
     C                     Z-ADD0         @@ZGSU  90
     C                     Z-ADD0         @ZGHS   62
     C                     Z-ADD0         @TENS   30
      *
     C                     Z-ADDWSUROK    @@KSTS  90
     C                     Z-ADDWSURO     @KSTS
     C           WSURO     DIV  20        WKTE      H
     C           J6SYOS    IFNE 0
     C           WKTE      DIV  J6SYOS    @KHTS     H
     C                     END
      *
     C                     Z-ADDJ6KTSU    @ZSTS
     C           J6KTSU    DIV  20        WKTE      H
     C           J6SYOS    IFNE 0
     C           WKTE      DIV  J6SYOS    @ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    @@N1SU
     C                     ADD  U1N2NM    @@N2SU
     C                     ELSE
     C                     ADD  U1S1NM    @@N1SU
     C                     ADD  U1S2NM    @@N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    @@ZGSU
     C                     ADD  1         @TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           @@N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        @N1SU   90
     C           J6SYOS    IFNE 0
     C           WKTE      DIV  J6SYOS    @N1HS     H
     C                     END
      *
     C           @@N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        @N2SU   90
     C           J6SYOS    IFNE 0
     C           WKTE      DIV  J6SYOS    @N2HS     H
     C                     END
      *
     C           @@ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        @ZGSU   90
     C           J6SYOS    IFNE 0
     C           WKTE      DIV  J6SYOS    @ZGHS     H
     C                     END
      *
     C                     SETON                     U5
     C                     EXCPTYDT
      *
     C                     MOVE J6SHIN    $$SHIN
     C                     MOVE J6ATKR    $$TKRO
     C                     MOVE 'B'       $$KCOD
     C                     Z-ADDJ6ATOB    $$BMON
     C                     EXCPTRDT1
      *
     C           YYP11     TAG
     C                     Z-ADDWSURO     J6KSSU
     C                     UPDATADHPL031
     C                     GOTO YYP1
      *
     C                     END
      *
      *
     C*--------------------------------*
     C*     ... AAFPL03                *
     C*     ...メッキかんばん...     *
     C*--------------------------------*
     C           KTY,I     IFEQ 'C'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE *BLANK    WSY     1
     C                     Z-ADD0         WSTHZ   80
     C                     MOVE *BLANK    WKC     1
     C                     MOVE *BLANK    WKC1    1
      *
     C           KEYC      SETLLAAFPL031
      *
     C           YP2       TAG
     C                     SETOF                     10
     C                     READ AAFPL031                 10
     C           *IN10     IFEQ '0'
     C           A3SKJY    ANDEQ'D'
     C           A3SKHZ    CABLE*DATE     YP2
     C                     END
      *
     C           *IN10     IFEQ '1'
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           A3ATKR    IFNE TKR,I
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           A3STHZ    CABLE*DATE     YP2
      *
     C           A3DTKO    IFEQ '2'
     C           A3DTKO    OREQ 'D'
     C                     GOTO YP21
     C                     END
     C           A3SSYS    IFEQ 0
     C                     GOTO YP21
     C                     END
     C           A3KTSU    IFEQ WRURO
     C                     GOTO YP22
     C                     END
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳＩ平準化確定発注ファイル..  *
     C*----------------------------------------------*
     C           WKC1      IFEQ *BLANK
     C                     MOVE '*'       WKC1
      *
     C                     SETOF                     10
     C                     MOVE A31HB5    WDHN1   5
     C                     MOVE A32HB5    WDHN2   5
     C                     MOVE A33HB2    WDHN3   2
     C           KEY1      CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           CBKDAI    ANDEQ'C'
      *
     C                     SETOF                     10
     C                     Z-ADD1         F       20
     C           A3ATKR    LOKUPTKR,F                    10
     C           *IN10     IFEQ '1'
     C           'C'       ANDEQKTY,F
      *
     C                     ADD  1         F
     C           F         IFGT 15
     C                     MOVE '*'       WKC
     C                     ELSE
      *
     C                     SETOF                     10
     C                     Z-ADD1         G       20
     C           F         DO   15        G
     C           KOT,G     IFEQ *BLANK
     C                     SETON                     10
     C                     MOVE '*'       WKC
     C                     ELSE
     C           KTY,G     IFNE *BLANK
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..Ａ－ＰＩＣＳでない..  *
     C*----------------------------*
     C           WKC       IFNE '*'
      *
     C           WRURO     DIV  A3KTSU    WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE '+'       $$ZOGN
     C           WRURO     IFLT A3KTSU
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP22
     C                     END
     C                     END
      *
     C                     Z-ADD0         WMAIS   40
      *
     C*------------------------------------------*
     C*     ... ABCR05                           *
     C*     ...メッキかんばん枚数　計算...     *
     C*------------------------------------------*
     C                     CALL 'ABCR05'
     C                     PARM           ASURI
     C                     PARM           WRURO
     C                     PARM           A3SSYS
     C                     PARM           A3KEIS
     C                     PARM           A3READ
     C                     PARM           A3BARA
     C                     PARM           A3CBKO
     C                     PARM           A3LOTO
     C                     PARM           A3MAXH
     C                     PARM           WMAIS
      *
     C                     Z-ADDA3KMAX    @ZMIS   30
     C                     Z-ADDWMAIS     @KMIS   30
      *
     C           WMAIS     IFEQ A3KMAX
     C                     Z-ADDWRURO     A3KTSU
     C                     GOTO YP22
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           WMAIS     ANDLTA3KMAX
     C                     GOTO YP22
     C                     END
      *
     C           WMAIS     IFGT A3KMAX
     C                     MOVE '8'       A3DTKO
     C                     ELSE
     C                     MOVE '9'       A3DTKO
     C                     END
      *
     C           A3DTKO    IFEQ 'E'
     C           WMAIS     SUB  A3JDMS    SJDMS   30
     C                     MOVE '1'       A3DTKO
     C                     Z-ADD0         A3JDMS
     C                     ELSE
     C           WMAIS     SUB  A3KMAX    SJDMS
     C                     END
      *
     C           A3DOUT    IFNE *BLANK
     C           A3KALL    ANDLTA3KMAX
     C                     Z-ADDA3KMAX    A3KALL
     C                     END
      *
     C                     Z-ADDA3KMAX    A3KMIN
     C                     Z-ADDA3KMAX    A3KAIS
     C                     Z-ADDWMAIS     A3KMAX
      *
     C*----------------------*
     C*  ..Ａ－ＰＩＣＳ..  *
     C*----------------------*
     C           WKC       IFEQ '*'
     C                     Z-ADDCBMBMN    @MBMN   40
     C                     Z-ADDA3STHZ    WSTHZ
     C                     MOVE A31HB5    WRHN1   5
     C                     MOVE A32HB5    WRHN2   5
     C                     MOVE A33HB2    WRHN3   2
     C                     MOVE A3ATKR    WRTKR   6
     C                     Z-ADDA3BARA    WBARA   20
     C                     Z-ADDSJDMS     WJDMS   30
     C                     Z-ADDA3SSYS    WSSYS   50
     C                     MOVE A33HB2    WHIN3   2
     C                     MOVE *BLANK    A3KOUT
     C                     MOVE 'Y'       A3DOUT
     C                     MOVE 'Y'       WSY
      *
     C           A3STHZ    IFEQ 99999999
      *
     C           @KMIS     DIV  @ZMIS     WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     ELSE
      *
     C                     MOVE '+'       $$ZOGN
     C           @KMIS     IFLT @ZMIS
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C                     MOVE A3SHIN    $$SHIN
     C                     MOVE A3ATKR    $$TKRO
     C                     MOVE 'C'       $$KCOD
     C                     Z-ADDA3ATOB    $$BMON
     C                     EXCPTRDT1
     C                     END
     C                     END
      *
     C                     GOTO YP21
     C                     END
      *
     C                     MOVE 'Y'       A3KOUT
     C                     MOVE *BLANK    A3DOUT
      *
     C                     MOVE A3SHIN    $$SHIN
     C                     MOVE A3ATKR    $$TKRO
     C                     MOVE 'C'       $$KCOD
     C                     Z-ADDA3ATOB    $$BMON
     C                     EXCPTRDT1
      *
     C           YP21      TAG
     C                     Z-ADDWRURO     A3KTSU
     C                     Z-ADD*YEAR     A3KOYY
     C                     Z-ADDUMONTH    A3KOMM
     C                     Z-ADDUDAY      A3KODD
     C                     TIME           HMS
     C                     Z-ADDHOUR      A3KOHH
     C                     Z-ADDMINUTE    A3KOSS
     C                     MOVE *BLANK    A3KOME
     C                     MOVEL'ZOUGEN'  A3KOME
      *
     C           YP22      TAG
     C                     Z-ADDWRURO     A3KSSU
     C                     UPDATAAFPL031
     C                     GOTO YP2
      *
     C                     END
      *
      *
     C*----------------------------------*
     C*     ... AAGPL03                  *
     C*     ...トンネルかんばん...     *
     C*----------------------------------*
     C           KTY,I     IFEQ 'D'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE *BLANK    WSY
     C                     Z-ADD0         WSTHZ
     C                     MOVE *BLANK    WKD     1
     C                     MOVE *BLANK    WKD1    1
      *
     C           KEYC      SETLLAAGPL031
      *
     C           YP3       TAG
     C                     SETOF                     10
     C                     READ AAGPL031                 10
     C           *IN10     IFEQ '0'
     C           O4SKJY    ANDEQ'D'
     C           O4SKHZ    CABLE*DATE     YP3
     C                     END
      *
     C           *IN10     IFEQ '1'
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           O4AKRO    IFNE TKR,I
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           O4STHZ    CABLE*DATE     YP3
      *
     C           O4DTKO    IFEQ '2'
     C           O4DTKO    OREQ 'D'
     C                     GOTO YP31
     C                     END
     C           O4SYOS    IFEQ 0
     C                     GOTO YP31
     C                     END
     C           O4KTSU    IFEQ WRURO
     C                     GOTO YP32
     C                     END
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳＩ平準化確定発注ファイル..  *
     C*----------------------------------------------*
     C           WKD1      IFEQ *BLANK
     C                     MOVE '*'       WKD1
      *
     C                     SETOF                     10
     C                     MOVE O4SHN1    WDHN1
     C                     MOVE O4SHN2    WDHN2
     C                     MOVE O4SHN3    WDHN3
     C           KEY1      CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           CBKDAI    ANDEQ'D'
      *
     C                     SETOF                     10
     C                     Z-ADD1         F
     C           O4AKRO    LOKUPTKR,F                    10
     C           *IN10     IFEQ '1'
     C           'D'       ANDEQKTY,F
      *
     C                     ADD  1         F
     C           F         IFGT 15
     C                     MOVE '*'       WKD
     C                     ELSE
      *
     C                     SETOF                     10
     C                     Z-ADD1         G
     C           F         DO   15        G
     C           KOT,G     IFEQ *BLANK
     C                     SETON                     10
     C                     MOVE '*'       WKD
     C                     ELSE
     C           KTY,G     IFNE *BLANK
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..Ａ－ＰＩＣＳでない..  *
     C*----------------------------*
     C           WKD       IFNE '*'
      *
     C           WRURO     DIV  O4KTSU    WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE '+'       $$ZOGN
     C           WRURO     IFLT O4KTSU
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP32
     C                     END
     C                     END
      *
     C                     Z-ADD0         WMAIS
      *
     C*--------------------------------------------*
     C*     ... ABCR06                             *
     C*     ...トンネルかんばん枚数　計算...     *
     C*--------------------------------------------*
     C                     CALL 'ABCR06'
     C                     PARM           ASURI
     C                     PARM           WRURO
     C                     PARM           O4SYOS
     C                     PARM           O4KEIS
     C                     PARM           O4LTIM
     C                     PARM           O4BARA
     C                     PARM           O4CBKO
     C                     PARM           O4LOTO
     C                     PARM           O4MAXH
     C                     PARM           WMAIS
      *
     C                     Z-ADDO4KMAX    @ZMIS
     C                     Z-ADDWMAIS     @KMIS
      *
     C           WMAIS     IFEQ O4KMAX
     C                     Z-ADDWRURO     O4KTSU
     C                     GOTO YP32
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           WMAIS     ANDLTO4KMAX
     C                     GOTO YP32
     C                     END
      *
     C           WMAIS     IFGT O4KMAX
     C                     MOVE '8'       O4DTKO
     C                     ELSE
     C                     MOVE '9'       O4DTKO
     C                     END
      *
     C           O4DTKO    IFEQ 'E'
     C           WMAIS     SUB  O4JDMS    SJDMS
     C                     MOVE '1'       O4DTKO
     C                     Z-ADD0         O4JDMS
     C                     ELSE
     C           WMAIS     SUB  O4KMAX    SJDMS
     C                     END
      *
     C           O4DOUT    IFNE *BLANK
     C           O4KALL    ANDLTO4KMAX
     C                     Z-ADDO4KMAX    O4KALL
     C                     END
      *
     C                     Z-ADDO4KMAX    O4KMIN
     C                     Z-ADDO4KMAX    O4MAIS
     C                     Z-ADDWMAIS     O4KMAX
      *
     C*----------------------*
     C*  ..Ａ－ＰＩＣＳ..  *
     C*----------------------*
     C           WKD       IFEQ '*'
     C                     Z-ADDCBMBMN    @MBMN
     C                     Z-ADDO4STHZ    WSTHZ
     C                     MOVE O4SHN1    WRHN1
     C                     MOVE O4SHN2    WRHN2
     C                     MOVE O4SHN3    WRHN3
     C                     MOVE O4AKRO    WRTKR
     C                     Z-ADDO4BARA    WBARA
     C                     Z-ADDSJDMS     WJDMS
     C                     Z-ADDO4SYOS    WSSYS
     C                     MOVE O4SHN3    WHIN3
     C                     MOVE *BLANK    O4KOUT
     C                     MOVE 'Y'       O4DOUT
     C                     MOVE 'Y'       WSY
      *
     C           O4STHZ    IFEQ 99999999
      *
     C           @KMIS     DIV  @ZMIS     WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     ELSE
      *
     C                     MOVE '+'       $$ZOGN
     C           @KMIS     IFLT @ZMIS
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C                     MOVE O4SHIN    $$SHIN
     C                     MOVE O4AKRO    $$TKRO
     C                     MOVE 'D'       $$KCOD
     C                     Z-ADDO4BMON    $$BMON
     C                     EXCPTRDT1
     C                     END
     C                     END
      *
     C                     GOTO YP31
     C                     END
      *
     C                     MOVE 'Y'       O4KOUT
     C                     MOVE *BLANK    O4DOUT
      *
     C                     MOVE O4SHIN    $$SHIN
     C                     MOVE O4AKRO    $$TKRO
     C                     MOVE 'D'       $$KCOD
     C                     Z-ADDO4BMON    $$BMON
     C                     EXCPTRDT1
      *
     C           YP31      TAG
     C                     Z-ADDWRURO     O4KTSU
     C                     Z-ADD*YEAR     O4KOYY
     C                     Z-ADDUMONTH    O4KOMM
     C                     Z-ADDUDAY      O4KODD
     C                     TIME           HMS
     C                     Z-ADDHOUR      O4KOHH
     C                     Z-ADDMINUTE    O4KOSS
     C                     MOVE *BLANK    O4KOME
     C                     MOVEL'ZOUGEN'  O4KOME
      *
     C           YP32      TAG
     C                     Z-ADDWRURO     O4KSSU
     C                     UPDATAAGPL031
     C                     GOTO YP3
      *
     C                     END
      *
      *
     C*------------------------------*
     C*     ... AAHPL03              *
     C*     ...引取かんばん...     *
     C*------------------------------*
     C           KTY,I     IFEQ 'E'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE *BLANK    WSY
     C                     Z-ADD0         WSTHZ
     C                     MOVE *BLANK    WKE     1
     C                     MOVE *BLANK    WKE1    1
      *
     C           KEYC      SETLLAAHPL031
      *
     C           YP4       TAG
     C                     SETOF                     10
     C                     READ AAHPL031                 10
     C           *IN10     IFEQ '0'
     C           L6SKJY    ANDEQ'D'
     C           L6SKHZ    CABLE*DATE     YP4
     C                     END
      *
     C           *IN10     IFEQ '1'
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           L6ATKR    IFNE TKR,I
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           L6STHZ    CABLE*DATE     YP4
      *
     C           L6DTKO    IFEQ '2'
     C           L6DTKO    OREQ 'D'
     C                     GOTO YP41
     C                     END
     C           L6SYOS    IFEQ 0
     C                     GOTO YP41
     C                     END
     C           L6KTSU    IFEQ WRURO
     C                     GOTO YP42
     C                     END
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳＩ平準化確定発注ファイル..  *
     C*----------------------------------------------*
     C           WKE1      IFEQ *BLANK
     C                     MOVE '*'       WKE1
      *
     C                     SETOF                     10
     C                     MOVE L6SHN1    WDHN1
     C                     MOVE L6SHN2    WDHN2
     C                     MOVE L6SHN3    WDHN3
     C           KEY1      CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           CBKDAI    ANDEQ'E'
      *
     C                     SETOF                     10
     C                     Z-ADD1         F
     C           L6ATKR    LOKUPTKR,F                    10
     C           *IN10     IFEQ '1'
     C           'E'       ANDEQKTY,F
      *
     C                     ADD  1         F
     C           F         IFGT 15
     C                     MOVE '*'       WKE
     C                     ELSE
      *
     C                     SETOF                     10
     C                     Z-ADD1         G
     C           F         DO   15        G
     C           KOT,G     IFEQ *BLANK
     C                     SETON                     10
     C                     MOVE '*'       WKE
     C                     ELSE
     C           KTY,G     IFNE *BLANK
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..Ａ－ＰＩＣＳでない..  *
     C*----------------------------*
     C           WKE       IFNE '*'
      *
     C           WRURO     DIV  L6KTSU    WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE '+'       $$ZOGN
     C           WRURO     IFLT L6KTSU
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP42
     C                     END
     C                     END
      *
     C                     Z-ADD0         WMAIS
      *
     C*----------------------------------------*
     C*     ... ABCR07                         *
     C*     ...引取かんばん枚数　計算...     *
     C*----------------------------------------*
     C                     CALL 'ABCR07'
     C                     PARM           ASURI
     C                     PARM           WRURO
     C                     PARM           L6KEIS
     C                     PARM           L6LTIM
     C                     PARM           L6SYOS
     C                     PARM           L6LOTO
     C                     PARM           L6MAXH
     C                     PARM           WMAIS
      *
     C                     Z-ADDL6KMAX    @ZMIS
     C                     Z-ADDWMAIS     @KMIS
      *
     C           WMAIS     IFEQ L6KMAX
     C                     Z-ADDWRURO     L6KTSU
     C                     GOTO YP42
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           WMAIS     ANDLTL6KMAX
     C                     GOTO YP42
     C                     END
      *
     C           WMAIS     IFGT L6KMAX
     C                     MOVE '8'       L6DTKO
     C                     ELSE
     C                     MOVE '9'       L6DTKO
     C                     END
      *
     C           L6DTKO    IFEQ 'E'
     C           WMAIS     SUB  L6JDMS    SJDMS
     C                     MOVE '1'       L6DTKO
     C                     Z-ADD0         L6JDMS
     C                     ELSE
     C           WMAIS     SUB  L6KMAX    SJDMS
     C                     END
      *
     C           L6DOUT    IFNE *BLANK
     C           L6KALL    ANDLTL6KMAX
     C                     Z-ADDL6KMAX    L6KALL
     C                     END
      *
     C                     Z-ADDL6KMAX    L6KMIN
     C                     Z-ADDL6KMAX    L6KAIS
     C                     Z-ADDWMAIS     L6KMAX
      *
     C*----------------------*
     C*  ..Ａ－ＰＩＣＳ..  *
     C*----------------------*
     C           WKE       IFEQ '*'
     C                     Z-ADDCBMBMN    @MBMN
     C                     Z-ADDL6STHZ    WSTHZ
     C                     MOVE L6SHN1    WRHN1
     C                     MOVE L6SHN2    WRHN2
     C                     MOVE L6SHN3    WRHN3
     C                     MOVE L6ATKR    WRTKR
     C                     Z-ADDL6LOTO    WBARA
     C                     Z-ADDSJDMS     WJDMS
     C                     Z-ADDL6SYOS    WSSYS
     C                     MOVE L6SHN3    WHIN3
     C                     MOVE *BLANK    L6KOUT
     C                     MOVE 'Y'       L6DOUT
     C                     MOVE 'Y'       WSY
      *
     C           L6STHZ    IFEQ 99999999
      *
     C           @KMIS     DIV  @ZMIS     WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     ELSE
      *
     C                     MOVE '+'       $$ZOGN
     C           @KMIS     IFLT @ZMIS
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C                     MOVE L6SHIN    $$SHIN
     C                     MOVE L6ATKR    $$TKRO
     C                     MOVE 'E'       $$KCOD
     C                     Z-ADDL6ATOB    $$BMON
     C                     EXCPTRDT1
     C                     END
     C                     END
      *
     C                     GOTO YP41
     C                     END
      *
     C                     MOVE 'Y'       L6KOUT
     C                     MOVE *BLANK    L6DOUT
      *
     C                     MOVE L6SHIN    $$SHIN
     C                     MOVE L6ATKR    $$TKRO
     C                     MOVE 'E'       $$KCOD
     C                     Z-ADDL6ATOB    $$BMON
     C                     EXCPTRDT1
      *
     C           YP41      TAG
     C                     Z-ADDWRURO     L6KTSU
     C                     Z-ADD*YEAR     L6KOYY
     C                     Z-ADDUMONTH    L6KOMM
     C                     Z-ADDUDAY      L6KODD
     C                     TIME           HMS
     C                     Z-ADDHOUR      L6KOHH
     C                     Z-ADDMINUTE    L6KOSS
     C                     MOVE *BLANK    L6KOME
     C                     MOVEL'ZOUGEN'  L6KOME
      *
     C           YP42      TAG
     C                     Z-ADDWRURO     L6KSSU
     C                     UPDATAAHPL031
     C                     GOTO YP4
      *
     C                     END
      *
      *
     C*------------------------------------*
     C*     ... AAPPL03                    *
     C*     ...完成品かんばん...         *
     C*------------------------------------*
      *
     C           KTY,I     IFEQ '0'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
     C                     MOVE *BLANK    WSY
     C                     Z-ADD0         WSTHZ
     C                     MOVE *BLANK    WK0     1
     C                     MOVE *BLANK    WK01    1
      *
     C           KEYC      SETLLAAPPL031
      *
     C           YP5       TAG
     C                     SETOF                     10
     C                     READ AAPPL031                 10
     C           *IN10     IFEQ '0'
     C           L5SKJY    ANDEQ'D'
     C           L5SKHZ    CABLE*DATE     YP5
     C                     END
      *
     C           *IN10     IFEQ '1'
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           L5TKRO    IFNE TKR,I
     C           WSY       IFEQ 'Y'
     C           WSTHZ     IFEQ 99999999
     C                     EXSR SUBRTN
     C                     END
     C                     END
     C                     GOTO AP1
     C                     END
      *
     C           L5STHZ    CABLE*DATE     YP5
      *
     C           L5DTKO    IFEQ '2'
     C           L5DTKO    OREQ 'D'
     C                     GOTO YP52
     C                     END
     C           L5SYOS    IFEQ 0
     C                     GOTO YP52
     C                     END
     C           L5KTSU    IFEQ WRURO
     C                     GOTO YP51
     C                     END
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳＩ平準化確定発注ファイル..  *
     C*----------------------------------------------*
     C           WK01      IFEQ *BLANK
     C                     MOVE '*'       WK01
      *
     C                     SETOF                     10
     C                     MOVE L5SHN1    WDHN1
     C                     MOVE L5SHN2    WDHN2
     C                     MOVE L5SHN3    WDHN3
     C           KEY1      CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
      *
     C           *IN10     IFEQ '0'
     C           CBKDAI    ANDEQ'0'
      *
     C                     SETOF                     10
     C                     Z-ADD1         F
     C           L5TKRO    LOKUPTKR,F                    10
     C           *IN10     IFEQ '1'
     C           '0'       ANDEQKTY,F
      *
     C                     ADD  1         F
     C           F         IFGT 15
     C                     MOVE '*'       WK0
     C                     ELSE
      *
     C                     SETOF                     10
     C                     Z-ADD1         G
     C           F         DO   15        G
     C           KOT,G     IFEQ *BLANK
     C                     SETON                     10
     C                     MOVE '*'       WK0
     C                     ELSE
     C           KTY,G     IFNE *BLANK
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
      *
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..Ａ－ＰＩＣＳでない..  *
     C*----------------------------*
     C           WK0       IFNE '*'
      *
     C           WRURO     DIV  L5KTSU    WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN   1
     C                     MOVE '+'       $$ZOGN
     C           WRURO     IFLT L5KTSU
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP51
     C                     END
     C                     END
      *
     C                     Z-ADD0         WLTM1   31
     C                     Z-ADD0         WLTM2   31
      *
     C                     SETOF                     10
     C           KEYD      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
     C                     END
      *
     C                     Z-ADD0         XHITO   90
     C           L5UKHZ    IFGT *DATE
     C                     Z-ADDL5UKHZ    KUYMD
     C                     Z-ADDL5UBIN    KUBIN
     C                     ELSE
     C                     Z-ADD*DATE     KUYMD
     C                     Z-ADD01        KUBIN
     C                     END
      *
     C           L5KEY     SETLLAAJTL141
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           L5KEY     READEAAJTL141                 10
     C           *IN10     IFEQ '0'
     C           CJCHHB    IFGT KUKBI
     C           CJSLOT    IFGT XHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           XHITO     DIV  L5SYOS    L5HITO
     C                     MVR            XHI     30
     C           XHI       IFNE 0
     C                     ADD  1         L5HITO
     C                     END
     C                     MOVE L5HITO    ZHITO   3
     C           L5HITO    IFEQ 0
     C                     Z-ADD1         L5HITO
     C                     END
      *
     C                     Z-ADD0         WMAIS
     C                     MOVE L5HITO    WHITO   3
      *
     C*----------------------------------------------*
     C*     ... ABCR09                               *
     C*     ...完成品かんばん枚数　計算...         *
     C*----------------------------------------------*
     C                     CALL 'ABCR09'
     C                     PARM           ASURI
     C                     PARM           L5TKR1
     C                     PARM           L5TKR2
     C                     PARM           L5TKR3
     C                     PARM           L5TKR4
     C                     PARM           WSURO
     C                     PARM           L5SYOS
     C                     PARM           WLTM1
     C                     PARM           WLTM2
     C                     PARM           L5BMON
     C                     PARM           L5SKCD
     C                     PARM           WHITO
     C                     PARM           ZHITO
     C                     PARM           L5KCD1
     C                     PARM           L5KCD2
     C                     PARM           L5UZAR
     C                     PARM           WMAIS
     C                     PARM           PYM
     C                     PARM           L5HKSU
      *
     C*----------------------------*
     C*  ..Ａ－ＰＩＣＳでない..  *
     C*----------------------------*
     C           WK0       IFNE '*'
      *
     C           WMAIS     IFEQ L5KMAX
     C                     Z-ADDWRURO     L5KTSU
     C                     GOTO YP51
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           WMAIS     ANDLTL5KMAX
     C                     GOTO YP51
     C                     END
      *
     C                     MOVE L5KCD1    $KCD1   1
     C                     MOVE L5TKRO    $TKRO   6
     C                     MOVE L5SHIN    $SHIN  12
     C                     Z-ADDL5HKSU    $NLOT   30
     C                     Z-ADDWMAIS     $NMAS   30
     C                     Z-ADDL5KMAX    $OMAS   30
     C                     Z-ADDL5SYOS    $SYOS   50
     C                     MOVE L5KTEI    $KOT1   3
     C                     MOVE *BLANK    $KOT2   3
     C                     MOVE *BLANK    $KOT3   3
     C                     MOVE *BLANK    $KOT4   3
     C                     Z-ADDL5BMON    $BMON   40
     C                     Z-ADDL5UKOJ    $UKOJ   40
      *
     C                     Z-ADD0         $KSTS   90
     C                     Z-ADD0         $KHTS   62
     C                     Z-ADD0         $ZSTS   90
     C                     Z-ADD0         $ZHTS   62
     C                     Z-ADD0         $$N1SU  90
     C                     Z-ADD0         $N1HS   62
     C                     Z-ADD0         $$N2SU  90
     C                     Z-ADD0         $N2HS   62
     C                     Z-ADD0         $$ZGSU  90
     C                     Z-ADD0         $ZGHS   62
     C                     Z-ADD0         $TENS   30
      *
     C                     Z-ADDWSUROK    $$KSTS  90
     C           WRURO     MULT 20        $KSTS     H
     C           L5SYOS    IFNE 0
     C           WRURO     DIV  L5SYOS    $KHTS     H
     C                     END
      *
     C           L5KTSU    MULT 20        $ZSTS     H
     C           L5SYOS    IFNE 0
     C           L5KTSU    DIV  L5SYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU   90
     C           L5SYOS    IFNE 0
     C           WKTE      DIV  L5SYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU   90
     C           L5SYOS    IFNE 0
     C           WKTE      DIV  L5SYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU   90
     C           L5SYOS    IFNE 0
     C           WKTE      DIV  L5SYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE L5SHIN    $$SHIN
     C                     MOVE L5TKRO    $$TKRO
     C                     MOVE '0'       $$KCOD
     C                     Z-ADDL5BMON    $$BMON
     C                     EXCPTRDT1
      *
     C                     ELSE
      *
     C*----------------------*
     C*  ..Ａ－ＰＩＣＳ..  *
     C*----------------------*
      *
     C                     Z-ADDL5KMAX    @ZMIS
     C                     Z-ADDWMAIS     @KMIS
      *
     C           WMAIS     IFEQ L5KMAX
     C                     Z-ADDWRURO     L5KTSU
     C                     GOTO YP51
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           WMAIS     ANDLTL5KMAX
     C                     GOTO YP51
     C                     END
      *
     C           WMAIS     IFGT L5KMAX
     C                     MOVE '8'       L5DTKO
     C                     ELSE
     C                     MOVE '9'       L5DTKO
     C                     END
      *
     C           L5DTKO    IFEQ 'E'
     C           WMAIS     SUB  L5JDMS    SJDMS
     C                     MOVE '1'       L5DTKO
     C                     Z-ADD0         L5JDMS
     C                     ELSE
     C           WMAIS     SUB  L5KMAX    SJDMS
     C                     END
      *
     C           L5DOUT    IFNE *BLANK
     C           L5KALL    ANDLTL5KMAX
     C                     Z-ADDL5KMAX    L5KALL
     C                     END
      *
     C                     Z-ADDL5KMAX    L5KMIN
     C                     Z-ADDL5KMAX    L5MAIS
     C                     Z-ADDWMAIS     L5KMAX
      *
     C                     Z-ADDCBMBMN    @MBMN
     C                     Z-ADDL5STHZ    WSTHZ
     C                     MOVE L5SHN1    WRHN1
     C                     MOVE L5SHN2    WRHN2
     C                     MOVE L5SHN3    WRHN3
     C                     MOVE L5TKRO    WRTKR
     C                     Z-ADDL5HKSU    WBARA
     C                     Z-ADDSJDMS     WJDMS
     C                     Z-ADDL5SYOS    WSSYS
     C                     MOVE L5SHN3    WHIN3
     C                     MOVE *BLANK    L5KOUT
     C                     MOVE 'Y'       L5DOUT
     C                     MOVE 'Y'       WSY
      *
     C           L5STHZ    IFEQ 99999999
      *
     C           @KMIS     DIV  @ZMIS     WMON1     H
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     ELSE
      *
     C                     MOVE '+'       $$ZOGN
     C           @KMIS     IFLT @ZMIS
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C                     MOVE L5SHIN    $$SHIN
     C                     MOVE L5TKRO    $$TKRO
     C                     MOVE '0'       $$KCOD
     C                     Z-ADDL5BMON    $$BMON
     C                     EXCPTRDT1
     C                     END
     C                     END
      *
     C           YP52      TAG
     C                     Z-ADDWRURO     L5KTSU
     C                     Z-ADD*YEAR     L5KOYY
     C                     Z-ADDUMONTH    L5KOMM
     C                     Z-ADDUDAY      L5KODD
     C                     TIME           HMS
     C                     Z-ADDHOUR      L5KOHH
     C                     Z-ADDMINUTE    L5KOSS
     C                     MOVE *BLANK    L5KOME
     C                     MOVEL'ZOUGEN'  L5KOME
     C                     END
      *
     C           YP51      TAG
     C                     Z-ADDWRURO     L5KSSU
     C                     UPDATAAPPL031
     C                     GOTO YP5
      *
     C                     END
      *
      *
     C*--------------------------------*
     C*     ... AAOPL03                *
     C*     ...小工程かんばん...     *
     C*--------------------------------*
     C           KTY,I     IFEQ '1'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAAOPL031
      *
     C           YP6       TAG
     C                     SETOF                     10
     C                     READ AAOPL031                 10
     C           *IN10     IFEQ '0'
     C           T1SKJY    ANDEQ'D'
     C           T1SKHZ    CABLE*DATE     YP6
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           T1TKRO    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           T1STHZ    CABLE*DATE     YP6
      *
     C           T1DTKO    IFEQ '2'
     C           T1DTKO    OREQ 'D'
     C                     Z-ADDWSURO     T1KTSU
     C                     GOTO YP61
     C                     END
     C           T1SYOS    IFEQ 0
     C                     Z-ADDWSURO     T1KTSU
     C                     GOTO YP61
     C                     END
     C           T1KTSU    IFEQ WSURO
     C                     GOTO YP61
     C                     END
      *
     C           T1KTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  T1SYOS    WMO       H
     C           XSURO     DIV  T1SYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP61
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP61
     C                     END
      *
     C                     SETOF                     10
     C                     Z-ADD0         WLTM1
     C                     Z-ADD0         WLTM2
     C                     Z-ADD0         BLT     31
     C           KEYE      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
     C                     END
      *
     C                     SETOF                     10
     C           KEYS      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C           T2LTM1    ADD  T2LTM2    BLT
     C                     END
      *
     C                     Z-ADD0         XHITO
     C           T1UKHZ    IFGT *DATE
     C                     Z-ADDT1UKHZ    KUYMD
     C                     Z-ADDT1UBIN    KUBIN
     C                     ELSE
     C                     Z-ADD*DATE     KUYMD
     C                     Z-ADD01        KUBIN
     C                     END
      *
     C           T1KEY     SETLLAAJTL141
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           T1KEY     READEAAJTL141                 10
     C           *IN10     IFEQ '0'
     C           CJCHHB    IFGT KUKBI
     C           CJSLOT    IFGT XHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           XHITO     DIV  T1SYOS    T1HITO
     C                     MVR            XHI
     C           XHI       IFNE 0
     C                     ADD  1         T1HITO
     C                     END
     C                     MOVE T1HITO    ZHITO
     C           T1HITO    IFEQ 0
     C                     Z-ADD1         T1HITO
     C                     END
      *
     C                     Z-ADD0         WMAIS
     C                     MOVE T1HITO    WHITO   3
      *
     C*------------------------------------------*
     C*     ... ABCR08                           *
     C*     ...小工程かんばん枚数　計算...     *
     C*------------------------------------------*
     C                     CALL 'ABCR08'
     C                     PARM           ASURI
     C                     PARM           WSURO
     C                     PARM           T1SYOS
     C                     PARM           WLTM1
     C                     PARM           WLTM2
     C                     PARM           BLT
     C                     PARM           WHITO
     C                     PARM           ZHITO
     C                     PARM           T1KCD1
     C                     PARM           T1KCD2
     C                     PARM           T1UZAR
     C                     PARM           WMAIS
     C                     PARM           T1HKSU
     C                     PARM           PYM
      *
     C                     MOVE T1KCD1    $KCD1
     C                     MOVE T1TKRO    $TKRO
     C                     MOVE T1SHIN    $SHIN
     C                     Z-ADDT1HKSU    $NLOT
     C                     Z-ADDWMAIS     $NMAS
     C                     Z-ADDT1KMAX    $OMAS
     C                     Z-ADDT1SYOS    $SYOS
     C                     MOVE T1SKT1    $KOT1
     C                     MOVE T1SKT2    $KOT2
     C                     MOVE T1SKT3    $KOT3
     C                     MOVE T1SKT4    $KOT4
     C                     Z-ADDT1BMON    $BMON
     C                     Z-ADDT1UKOJ    $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C                     Z-ADDWSURO     $KSTS
     C           WSURO     DIV  20        WKTE      H
     C           T1SYOS    IFNE 0
     C           WKTE      DIV  T1SYOS    $KHTS     H
     C                     END
      *
     C                     Z-ADDT1KTSU    $ZSTS
     C           T1KTSU    DIV  20        WKTE      H
     C           T1SYOS    IFNE 0
     C           WKTE      DIV  T1SYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           T1SYOS    IFNE 0
     C           WKTE      DIV  T1SYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           T1SYOS    IFNE 0
     C           WKTE      DIV  T1SYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           T1SYOS    IFNE 0
     C           WKTE      DIV  T1SYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE T1SHIN    $$SHIN
     C                     MOVE T1TKRO    $$TKRO
     C                     MOVE '1'       $$KCOD
     C                     Z-ADDT1BMON    $$BMON
     C                     EXCPTRDT1
      *
     C           YP61      TAG
     C                     Z-ADDWSURO     T1KSSU
     C                     UPDATAAOPL031
     C                     GOTO YP6
      *
     C                     END
      *
      *
     C*--------------------------------------*
     C*     ... AAYPL03                      *
     C*     ...小工程熱処理かんばん...     *
     C*--------------------------------------*
     C           KTY,I     IFEQ '2'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAAYPL031
      *
     C           YP8       TAG
     C                     SETOF                     10
     C                     READ AAYPL031                 10
     C           *IN10     IFEQ '0'
     C           L8SKJY    ANDEQ'D'
     C           L8SKHZ    CABLE*DATE     YP8
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           L8TKRO    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           L8STHZ    CABLE*DATE     YP8
      *
     C           L8DTKO    IFEQ '2'
     C           L8DTKO    OREQ 'D'
     C                     Z-ADDWSURO     L8KTSU
     C                     GOTO YP81
     C                     END
     C           L8SYOS    IFEQ 0
     C                     Z-ADDWSURO     L8KTSU
     C                     GOTO YP81
     C                     END
     C           L8KTSU    IFEQ WSURO
     C                     GOTO YP81
     C                     END
      *
     C           L8KTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  L8SYOS    WMO       H
     C           XSURO     DIV  L8SYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP81
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP81
     C                     END
      *
     C                     SETOF                     10
     C                     Z-ADD0         WLTM1
     C                     Z-ADD0         WLTM2
     C                     Z-ADD0         BLT     31
     C           KEYF      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
     C                     END
      *
     C                     SETOF                     10
     C           KEYG      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C           T2LTM1    ADD  T2LTM2    BLT
     C                     END
      *
     C                     Z-ADD0         XHITO
     C           L8UKHZ    IFGT *DATE
     C                     Z-ADDL8UKHZ    KUYMD
     C                     Z-ADDL8UBIN    KUBIN
     C                     ELSE
     C                     Z-ADD*DATE     KUYMD
     C                     Z-ADD01        KUBIN
     C                     END
      *
     C           L8KEY     SETLLAAJTL141
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           L8KEY     READEAAJTL141                 10
     C           *IN10     IFEQ '0'
     C           CJCHHB    IFGT KUKBI
     C           CJSLOT    IFGT XHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           XHITO     DIV  L8SYOS    L8HITO
     C                     MVR            XHI
     C           XHI       IFNE 0
     C                     ADD  1         L8HITO
     C                     END
     C                     MOVE L8HITO    ZHITO
     C           L8HITO    IFEQ 0
     C                     Z-ADD1         L8HITO
     C                     END
      *
     C                     Z-ADD0         WMAIS
     C                     MOVE L8HITO    WHITO   3
      *
     C*------------------------------------------------*
     C*     ... ABCR12                                 *
     C*     ...小工程熱処理かんばん枚数　計算...     *
     C*------------------------------------------------*
     C                     CALL 'ABCR12'
     C                     PARM           ASURI
     C                     PARM           WSURO
     C                     PARM           L8SYOS
     C                     PARM           WLTM1
     C                     PARM           WLTM2
     C                     PARM           BLT
     C                     PARM           WHITO
     C                     PARM           ZHITO
     C                     PARM           L8KCD1
     C                     PARM           L8KCD2
     C                     PARM           L8UZAR
     C                     PARM           WMAIS
     C                     PARM           L8HKSU
     C                     PARM           PYM
      *
     C                     MOVE L8KCD1    $KCD1
     C                     MOVE L8TKRO    $TKRO
     C                     MOVE L8SHIN    $SHIN
     C                     Z-ADDL8HKSU    $NLOT
     C                     Z-ADDWMAIS     $NMAS
     C                     Z-ADDL8KMAX    $OMAS
     C                     Z-ADDL8SYOS    $SYOS
     C                     MOVE L8SKT1    $KOT1
     C                     MOVE L8SKT2    $KOT2
     C                     MOVE L8SKT3    $KOT3
     C                     MOVE L8SKT4    $KOT4
     C                     Z-ADDL8BMON    $BMON
     C                     Z-ADDL8UKOJ    $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C                     Z-ADDWSURO     $KSTS
     C           WSURO     DIV  20        WKTE      H
     C           L8SYOS    IFNE 0
     C           WKTE      DIV  L8SYOS    $KHTS     H
     C                     END
      *
     C                     Z-ADDL8KTSU    $ZSTS
     C           L8KTSU    DIV  20        WKTE      H
     C           L8SYOS    IFNE 0
     C           WKTE      DIV  L8SYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           L8SYOS    IFNE 0
     C           WKTE      DIV  L8SYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           L8SYOS    IFNE 0
     C           WKTE      DIV  L8SYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           L8SYOS    IFNE 0
     C           WKTE      DIV  L8SYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE L8SHIN    $$SHIN
     C                     MOVE L8TKRO    $$TKRO
     C                     MOVE '2'       $$KCOD
     C                     Z-ADDL8BMON    $$BMON
     C                     EXCPTRDT1
      *
     C           YP81      TAG
     C                     Z-ADDWSURO     L8KSSU
     C                     UPDATAAYPL031
     C                     GOTO YP8
      *
     C                     END
      *
      *
     C*------------------------------------*
     C*     ... AANPL03                    *
     C*     ...半製品かんばん...         *
     C*------------------------------------*
     C           KTY,I     IFEQ '6'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAANPL031
      *
     C           YP7       TAG
     C                     SETOF                     10
     C                     READ AANPL031                 10
     C           *IN10     IFEQ '0'
     C           L7SKJY    ANDEQ'D'
     C           L7SKHZ    CABLE*DATE     YP7
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           L7TKRO    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           L7STHZ    CABLE*DATE     YP7
      *
     C           L7DTKO    IFEQ '2'
     C           L7DTKO    OREQ 'D'
     C                     Z-ADDWRURO     L7KTSU
     C                     GOTO YP71
     C                     END
     C           L7SYOS    IFEQ 0
     C                     Z-ADDWRURO     L7KTSU
     C                     GOTO YP71
     C                     END
     C           L7KTSU    IFEQ WRURO
     C                     GOTO YP71
     C                     END
      *
     C           L7KTSU    DIV  L7SYOS    WMO       H
     C           WRURO     DIV  L7SYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP71
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP71
     C                     END
      *
     C                     Z-ADD0         WLTM1
     C                     Z-ADD0         WLTM2
      *
     C                     SETOF                     10
     C           #KEY      CHAINGCKPL211             10
     C           *IN10     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADDT2LTM1    WLTM1
     C                     Z-ADDT2LTM2    WLTM2
     C                     END
      *
     C                     Z-ADD0         XHITO
     C           L7UKHZ    IFGT *DATE
     C                     Z-ADDL7UKHZ    KUYMD
     C                     Z-ADDL7UBIN    KUBIN
     C                     ELSE
     C                     Z-ADD*DATE     KUYMD
     C                     Z-ADD01        KUBIN
     C                     END
      *
     C           L7KEY     SETLLAAJTL141
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           L7KEY     READEAAJTL141                 10
     C           *IN10     IFEQ '0'
     C           CJCHHB    IFGT KUKBI
     C           CJSLOT    IFGT XHITO
     C                     Z-ADDCJSLOT    XHITO
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           XHITO     DIV  L7SYOS    L7HITO
     C                     MVR            XHI
     C           XHI       IFNE 0
     C                     ADD  1         L7HITO
     C                     END
     C                     MOVE L7HITO    ZHITO
     C           L7HITO    IFEQ 0
     C                     Z-ADD1         L7HITO
     C                     END
      *
     C                     Z-ADD0         WMAIS
     C                     MOVE L7HITO    WHITO
      *
     C*----------------------------------------------*
     C*     ... ABCR10                               *
     C*     ...半製品かんばん枚数　計算...         *
     C*----------------------------------------------*
     C                     CALL 'ABCR10'
     C                     PARM           ASURI
     C                     PARM           L7TKR1
     C                     PARM           L7TKR2
     C                     PARM           L7TKR3
     C                     PARM           L7TKR4
     C                     PARM           WSURO
     C                     PARM           L7SYOS
     C                     PARM           WLTM1
     C                     PARM           WLTM2
     C                     PARM           L7BMON
     C                     PARM           L7SKCD
     C                     PARM           WHITO
     C                     PARM           ZHITO
     C                     PARM           L7KCD1
     C                     PARM           L7KCD2
     C                     PARM           L7UZAR
     C                     PARM           WMAIS
     C                     PARM           L7HKSU
     C                     PARM           PYM
      *
     C                     MOVE L7KCD1    $KCD1
     C                     MOVE L7TKRO    $TKRO
     C                     MOVE L7SHIN    $SHIN
     C                     Z-ADDL7HKSU    $NLOT
     C                     Z-ADDWMAIS     $NMAS
     C                     Z-ADDL7KMAX    $OMAS
     C                     Z-ADDL7SYOS    $SYOS
     C                     MOVE L7SKT1    $KOT1
     C                     MOVE L7SKT2    $KOT2
     C                     MOVE L7SKT3    $KOT3
     C                     MOVE L7SKT4    $KOT4
     C                     Z-ADDL7BMON    $BMON
     C                     Z-ADDL7UKOJ    $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C           WRURO     MULT 20        $KSTS     H
     C           L7SYOS    IFNE 0
     C           WRURO     DIV  L7SYOS    $KHTS     H
     C                     END
      *
     C           L7KTSU    MULT 20        $ZSTS     H
     C           L7SYOS    IFNE 0
     C           L7KTSU    DIV  L7SYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           L7SYOS    IFNE 0
     C           WKTE      DIV  L7SYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           L7SYOS    IFNE 0
     C           WKTE      DIV  L7SYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           L7SYOS    IFNE 0
     C           WKTE      DIV  L7SYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE L7SHIN    $$SHIN
     C                     MOVE L7TKRO    $$TKRO
     C                     MOVE '6'       $$KCOD
     C                     Z-ADDL7BMON    $$BMON
     C                     EXCPTRDT1
      *
     C           YP71      TAG
     C                     Z-ADDWRURO     L7KSSU
     C                     UPDATAANPL031
     C                     GOTO YP7
      *
     C                     END
      *
      *
     C*--------------------------------------*
     C*     ... AAXPL10                      *
     C*     ...熱処理メッキかんばん...     *
     C*--------------------------------------*
     C           KTY,I     IFEQ '7'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAAXPL101
      *
     C           YP10      TAG
     C                     SETOF                     10
     C                     READ AAXPL101                 10
     C           *IN10     IFEQ '0'
     C           L9SKJY    ANDEQ'D'
     C           L9SKHZ    CABLE*DATE     YP10
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           L9TKRO    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           L9STHZ    CABLE*DATE     YP10
      *
     C           L9DTKO    IFEQ '2'
     C           L9DTKO    OREQ 'D'
     C                     Z-ADDWSURO     L9KTSU
     C                     GOTO YP101
     C                     END
     C           L9SYOS    IFEQ 0
     C                     Z-ADDWSURO     L9KTSU
     C                     GOTO YP101
     C                     END
     C           L9KTSU    IFEQ WSURO
     C                     GOTO YP101
     C                     END
      *
     C           L9KTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  L9SYOS    WMO       H
     C           XSURO     DIV  L9SYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP101
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP101
     C                     END
      *
     C                     Z-ADD0         WMAIS
      *
     C*------------------------------------------------*
     C*     ... ABCR15                                 *
     C*     ...熱処理メッキかんばん枚数　計算...     *
     C*------------------------------------------------*
     C                     CALL 'ABCR15'
     C                     PARM           ASURI
     C                     PARM           WSURO
     C                     PARM           L9SYOS
     C                     PARM           L9SBMN
     C                     PARM           L9LOTO
     C                     PARM           L9BARA
     C                     PARM           L9CBKO
     C                     PARM           L9KISU
     C                     PARM           L9UZAR
     C                     PARM           WMAIS
     C                     PARM           PYM
     C                     PARM           L9MKLT
     C                     PARM           L9YKLT
      *
     C                     MOVE L9KCD1    $KCD1
     C                     MOVE L9TKRO    $TKRO
     C                     MOVE L9SHIN    $SHIN
     C                     Z-ADDL9LOTO    $NLOT
     C                     Z-ADDWMAIS     $NMAS
     C                     Z-ADDL9KMAX    $OMAS
     C                     Z-ADDL9SYOS    $SYOS
     C                     MOVE *BLANK    $KOT1
     C                     MOVE *BLANK    $KOT2
     C                     MOVE *BLANK    $KOT3
     C                     MOVE *BLANK    $KOT4
     C                     Z-ADDL9BMON    $BMON
     C                     Z-ADD0111      $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C                     Z-ADDWSURO     $KSTS
     C           WSURO     DIV  20        WKTE      H
     C           L9SYOS    IFNE 0
     C           WKTE      DIV  L9SYOS    $KHTS     H
     C                     END
      *
     C                     Z-ADDL9KTSU    $ZSTS
     C           L9KTSU    DIV  20        WKTE      H
     C           L9SYOS    IFNE 0
     C           WKTE      DIV  L9SYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           L9SYOS    IFNE 0
     C           WKTE      DIV  L9SYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           L9SYOS    IFNE 0
     C           WKTE      DIV  L9SYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           L9SYOS    IFNE 0
     C           WKTE      DIV  L9SYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE L9SHIN    $$SHIN
     C                     MOVE L9TKRO    $$TKRO
     C                     MOVE '7'       $$KCOD
     C                     Z-ADDL9BMON    $$BMON
     C                     EXCPTRDT1
      *
     C           YP101     TAG
     C                     Z-ADDWSURO     L9KSSU
     C                     UPDATAAXPL101
     C                     GOTO YP10
      *
     C                     END
      *
      *
     C*--------------------------------------*
     C*     ... AEAPL03                      *
     C*     ...購買トンネルかんばん...     *
     C*--------------------------------------*
     C           KTY,I     IFEQ '4'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAEAPL031
      *
     C           YP9       TAG
     C                     SETOF                     10
     C                     READ AEAPL031                 10
     C           *IN10     IFEQ '0'
     C           AESKJY    ANDEQ'D'
     C           AESKHZ    CABLE*DATE     YP9
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           AEATKR    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           AESTHZ    CABLE*DATE     YP9
      *
     C           AEDTKO    IFEQ '2'
     C           AEDTKO    OREQ 'D'
     C                     Z-ADDWSURO     AEKTSU
     C                     GOTO YP91
     C                     END
     C           AESYOS    IFEQ 0
     C                     Z-ADDWSURO     AEKTSU
     C                     GOTO YP91
     C                     END
     C           AEKTSU    IFEQ WSURO
     C                     GOTO YP91
     C                     END
      *
     C           AEKTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  AESYOS    WMO       H
     C           XSURO     DIV  AESYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP91
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP91
     C                     END
      *
     C                     MOVE '4'       $KCD1
     C                     MOVE AEATKR    $TKRO
     C                     MOVE AESHIN    $SHIN
     C                     Z-ADD0         $NLOT
     C                     Z-ADDAEKMAX    $NMAS
     C                     Z-ADDAEKMAX    $OMAS
     C                     Z-ADDAESYOS    $SYOS
     C                     MOVE *BLANK    $KOT1
     C                     MOVE *BLANK    $KOT2
     C                     MOVE *BLANK    $KOT3
     C                     MOVE *BLANK    $KOT4
     C                     Z-ADD0         $BMON
     C                     Z-ADDAEUKOJ    $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C                     Z-ADDWSURO     $KSTS
     C           WSURO     DIV  20        WKTE      H
     C           AESYOS    IFNE 0
     C           WKTE      DIV  AESYOS    $KHTS     H
     C                     END
      *
     C                     Z-ADDAEKTSU    $ZSTS
     C           AEKTSU    DIV  20        WKTE      H
     C           AESYOS    IFNE 0
     C           WKTE      DIV  AESYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           AESYOS    IFNE 0
     C           WKTE      DIV  AESYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           AESYOS    IFNE 0
     C           WKTE      DIV  AESYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           AESYOS    IFNE 0
     C           WKTE      DIV  AESYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE AESHIN    $$SHIN
     C                     MOVE AEATKR    $$TKRO
     C                     MOVE '4'       $$KCOD
     C                     Z-ADDAEATOB    $$BMON
     C                     EXCPTRDT1
      *
     C           YP91      TAG
     C                     Z-ADDWSURO     AEKSSU
     C                     UPDATAEAPL031
     C                     GOTO YP9
      *
     C                     END
      *
      *
     C*------------------------------*
     C*     ... AECPL03              *
     C*     ...樹脂かんばん...     *
     C*------------------------------*
     C           KTY,I     IFEQ 'G'
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C           KEYC      SETLLAECPL031
      *
     C           YP13      TAG
     C                     SETOF                     10
     C                     READ AECPL031                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    ANDEQ'D'
     C           AFSKHZ    CABLE*DATE     YP13
     C                     END
      *
     C           *IN10     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C           AFATKR    IFNE TKR,I
     C                     GOTO AP1
     C                     END
      *
     C           AFSTHZ    CABLE*DATE     YP13
      *
     C           AFDTKO    IFEQ '2'
     C           AFDTKO    OREQ 'D'
     C                     Z-ADDWSURO     AFKTSU
     C                     GOTO YP131
     C                     END
     C           AFSYOS    IFEQ 0
     C                     Z-ADDWSURO     AFKTSU
     C                     GOTO YP131
     C                     END
     C           AFKTSU    IFEQ WSURO
     C                     GOTO YP131
     C                     END
      *
     C           AFKTSU    DIV  20        XKTSU     H
     C           WSURO     DIV  20        XSURO     H
      *
     C           XKTSU     DIV  AFSYOS    WMO       H
     C           XSURO     DIV  AFSYOS    WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       $ZOGN
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       $ZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           $ZOGN     ANDEQ'G'
     C                     GOTO YP131
     C                     END
      *
     C*--------------------------------------------*
     C*  ..増減比率　＋－２５％未満処理しない..  *
     C*--------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YP131
     C                     END
      *
     C                     MOVE 'G'       $KCD1
     C                     MOVE AFATKR    $TKRO
     C                     MOVE AFSHIN    $SHIN
     C                     Z-ADD0         $NLOT
     C                     Z-ADDAFKMAX    $NMAS
     C                     Z-ADDAFKMAX    $OMAS
     C                     Z-ADDAFSYOS    $SYOS
     C                     MOVE *BLANK    $KOT1
     C                     MOVE *BLANK    $KOT2
     C                     MOVE *BLANK    $KOT3
     C                     MOVE *BLANK    $KOT4
     C                     Z-ADD0         $BMON
     C                     Z-ADD0111      $UKOJ
      *
     C                     Z-ADD0         $KSTS
     C                     Z-ADD0         $KHTS
     C                     Z-ADD0         $ZSTS
     C                     Z-ADD0         $ZHTS
     C                     Z-ADD0         $$N1SU
     C                     Z-ADD0         $N1HS
     C                     Z-ADD0         $$N2SU
     C                     Z-ADD0         $N2HS
     C                     Z-ADD0         $$ZGSU
     C                     Z-ADD0         $ZGHS
     C                     Z-ADD0         $TENS
      *
     C                     Z-ADDWSUROK    $$KSTS
     C                     Z-ADDWSURO     $KSTS
     C           WSURO     DIV  20        WKTE      H
     C           AFSYOS    IFNE 0
     C           WKTE      DIV  AFSYOS    $KHTS     H
     C                     END
      *
     C                     Z-ADDAFKTSU    $ZSTS
     C           AFKTSU    DIV  20        WKTE      H
     C           AFSYOS    IFNE 0
     C           WKTE      DIV  AFSYOS    $ZHTS     H
     C                     END
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    $$N1SU
     C                     ADD  U1N2NM    $$N2SU
     C                     ELSE
     C                     ADD  U1S1NM    $$N1SU
     C                     ADD  U1S2NM    $$N2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    $$ZGSU
     C                     ADD  1         $TENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           $$N1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        $N1SU
     C           AFSYOS    IFNE 0
     C           WKTE      DIV  AFSYOS    $N1HS     H
     C                     END
      *
     C           $$N2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        $N2SU
     C           AFSYOS    IFNE 0
     C           WKTE      DIV  AFSYOS    $N2HS     H
     C                     END
      *
     C           $$ZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        $ZGSU
     C           AFSYOS    IFNE 0
     C           WKTE      DIV  AFSYOS    $ZGHS     H
     C                     END
      *
     C                     SETON                     U4
     C                     EXCPTGDT
      *
     C                     MOVE AFSHIN    $$SHIN
     C                     MOVE AFATKR    $$TKRO
     C                     MOVE 'G'       $$KCOD
     C                     Z-ADDAFATOB    $$BMON
     C                     EXCPTRDT1
      *
     C           YP131     TAG
     C                     Z-ADDWSURO     AFKSSU
     C                     UPDATAECPL031
     C                     GOTO YP13
      *
     C                     END
      *
     C           AP1       TAG
     C                     END
      *
     C                     END
      *
      *
     C*------------------------------------*
     C*  ..手書きかんばん　増減リスト..  *
     C*------------------------------------*
     C                     Z-ADD1         I
     C           1         DO   15        I
     C           KTY,I     IFNE *BLANK
      *
     C                     SETOF                     10
     C           KTY,I     LOKUPHTY                      10
     C           *IN10     IFEQ '1'
     C                     GOTO YPTE
     C                     END
      *
     C           YPTF      TAG
     C                     Z-ADD0         TSYOS   50
     C                     Z-ADD0         TTKSTS  90
     C                     Z-ADD0         TKHTS   62
     C                     Z-ADD0         TTZSTS  90
     C                     Z-ADD0         TZHTS   62
     C                     Z-ADD0         TTN1SU  90
     C                     Z-ADD0         TN1HS   62
     C                     Z-ADD0         TTN2SU  90
     C                     Z-ADD0         TN2HS   62
     C                     Z-ADD0         TTZGSU  90
     C                     Z-ADD0         TZGHS   62
     C                     Z-ADD0         TTENS   30
      *
     C                     MOVE TKR,I     WTKR
     C                     MOVE KOT,I     WKOTI
     C                     Z-ADDBUM,I     WBMON
     C                     MOVE KHN,I     WKHIN
      *
     C                     Z-ADD0         W
     C                     MOVE *BLANK    #HIN
     C           KEY4      SETLLGHCPL221
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY4      READEGHCPL221                 02
     C           *IN02     IFEQ '0'
      *
     C                     SETOF                     04
     C                     Z-ADD1         A
     C           MMJHIN    LOKUP#HIN,A                   04
     C           *IN04     IFEQ '0'
     C                     ADD  1         W
     C                     MOVE MMJHIN    #HIN,W
      *
     C                     SETOF                     04
     C           KEY7      CHAINAAUPL011             04
     C           *IN04     IFEQ '0'
     C           J1SKJY    ANDEQ'D'
     C           J1SKHZ    ANDLE*DATE
     C                     SETON                     04
     C                     END
     C           *IN04     IFEQ '0'
     C                     Z-ADDJ1NSYS    TSYOS
     C                     ADD  J1NGEK    TTKSTS
     C                     ADD  J1OGEK    TTZSTS
     C                     END
      *
     C                     SETOF                     04
     C           KEY3      CHAINABBPL211             04
     C           *IN04     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    TTN1SU
     C                     ADD  U1N2NM    TTN2SU
     C                     ELSE
     C                     ADD  U1S1NM    TTN1SU
     C                     ADD  U1S2NM    TTN2SU
     C                     END
     C                     END
      *
     C                     SETOF                     04
     C           KEY5      CHAINMBEPL051             04
     C           *IN04     IFEQ '0'
     C                     Z-ADD#JMM      U
     C                     ADD  #SRY,U    TTZGSU
     C                     ADD  1         TTENS
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           PKBN      IFEQ 'C'
     C           TTZSTS    DIV  @CD,4     XKTSU     H
     C                     ELSE
     C           TTZSTS    DIV  WCD       XKTSU     H
     C                     END
      *
     C           TTKSTS    DIV  WCD       XSURO     H
      *
     C           XKTSU     MULT 20        TZSTS   90
     C           XSURO     MULT 20        TKSTS   90
      *
     C           *IN99     IFEQ '1'
     C           TKSTS     ANDLTTZSTS
     C                     GOTO YPTE
     C                     END
      *
     C           XKTSU     DIV  TSYOS     WMO       H
     C           XSURO     DIV  TSYOS     WMN       H
     C                     Z-ADD0         WMON1
     C           WMO       IFNE 0
     C           WMN       DIV  WMO       WMON1     H
     C                     END
     C           WMON1     MULT 100       WMON
     C           WMON1     MULT 100       $$WMON    H
      *
     C                     MOVE 'Z'       TZOGN   1
     C                     MOVE '+'       $$ZOGN
     C           WMN       IFLT WMO
     C                     MOVE 'G'       TZOGN
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           $$WMON    IFEQ 0
     C                     MOVE '-'       $$ZOGN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           TZOGN     ANDEQ'G'
     C                     GOTO YPTE
     C                     END
      *
     C*-----------------------------------------------*
     C*     ...増減比率　＋－２５％未満処理しない   *
     C*-----------------------------------------------*
     C           WMON      IFGE 75.0
     C           WMON      ANDLE125.0
     C                     GOTO YPTE
     C                     END
      *
     C           TKSTS     DIV  20        WKTE      H
     C           TSYOS     IFNE 0
     C           WKTE      DIV  TSYOS     TKHTS     H
     C                     END
      *
     C           TZSTS     DIV  20        WKTE      H
     C           TSYOS     IFNE 0
     C           WKTE      DIV  TSYOS     TZHTS     H
     C                     END
      *
     C           TTN1SU    DIV  @CD,1     WKTE      H
     C           WKTE      MULT 20        TN1SU   90
     C           TSYOS     IFNE 0
     C           WKTE      DIV  TSYOS     TN1HS     H
     C                     END
      *
     C           TTN2SU    DIV  @CD,2     WKTE      H
     C           WKTE      MULT 20        TN2SU   90
     C           TSYOS     IFNE 0
     C           WKTE      DIV  TSYOS     TN2HS     H
     C                     END
      *
     C           TTZGSU    DIV  @CD,3     WKTE      H
     C           WKTE      MULT 20        TZGSU   90
     C           TSYOS     IFNE 0
     C           WKTE      DIV  TSYOS     TZGHS     H
     C                     END
      *
     C                     SETON                     U2
     C                     EXCPTF01
      *
     C                     MOVE WKHIN     $$SHIN
     C                     MOVE WTKR      $$TKRO
     C                     MOVE *BLANK    $$KCOD
     C                     Z-ADDWBMON     $$BMON
     C                     EXCPTRDT1
      *
     C           YPTE      TAG
     C                     END
     C                     END
      *
     C           END       TAG
      *
      *
     C*------------------------------------------*
     C*     ... A-PICS1                          *
     C*     ... AU#PP51 UPDAT                    *
     C*     ...受注データ累積ファイル...       *
     C*------------------------------------------*
     C           SUBRTN    BEGSR
      *
     C                     MOVE WRHN1     CQSHN1
     C                     MOVE WRHN2     CQSHN2
     C                     MOVE WRHN3     CQSHN3
     C                     Z-ADD08        CQTHJI
     C                     Z-ADD00        CQTHPN
     C                     Z-ADD*DATE     CQURHZ
     C                     MOVE 'K'       CQSKKB
     C                     MOVE 'G'       CQTHAI
     C                     Z-ADD01        CQCIC1
     C                     Z-ADD01        CQCIC2
     C                     Z-ADD01        CQCIC3
     C                     Z-ADD01        CQNOBB
     C                     MOVE 'Q'       CQDTSY
     C                     Z-ADDHOUR      CQURJI
     C                     Z-ADDMINUTE    CQURPN
     C                     MOVE 'B'       CQBNKA
     C                     MOVE WHIN3     CQHBSB
     C                     Z-ADDWMON      CQPAST
      *
     C                     Z-ADD@ZMIS     CQZMIS
     C                     Z-ADD@KMIS     CQKMIS
      *
     C                     SETOF                     10
     C                     Z-ADD1         X       20
     C                     Z-ADD0         CQMBMN
     C           @MBMN     LOKUPTB1,X                    10
     C           *IN10     IFEQ '1'
     C                     Z-ADDTB2,X     CQMBMN
     C                     ELSE
     C                     Z-ADD0111      CQMBMN
     C                     END
      *
     C                     MOVE '2'       CQDTSO
     C                     MOVE '15'      CQGYOM
     C           PKBN      IFEQ 'A'
     C                     MOVE '5'       CQDTSO
     C                     MOVE '14'      CQGYOM
     C                     END
     C           PKBN      IFEQ 'C'
     C                     MOVE '6'       CQDTSO
     C                     MOVE '14'      CQGYOM
     C                     END
      *
     C                     Z-ADDWSSYS     CQSYUY
     C                     MOVE WRTKR     CQTKR
      *
     C                     Z-ADDWJDMS     ZJDMS   30
     C           WJDMS     IFLT 0
     C           WJDMS     MULT -1        ZJDMS
     C                     END
      *
     C           WBARA     IFGE ZJDMS
      *
     C                     Z-ADDWYMD1     CQTHHZ
     C                     Z-ADDWYMD1     CQNOHZ
     C           WJDMS     MULT WSSYS     CQSRYO
     C           CQSRYO    DIV  WSSYS     CQHAKO
     C                     MVR            WS1     30
      *
     C           WS1       IFNE 0
     C           WS1       IFLT 0
     C                     SUB  1         CQHAKO
     C                     ELSE
     C                     ADD  1         CQHAKO
     C                     END
     C                     END
      *
     C                     SETOF                     10
     C           1         CHAINAU#NP11              10
     C           *IN10     IFEQ '0'
     C           AHZMM     IFNE UMONTH
     C                     Z-ADDUMONTH    AHZMM
     C                     Z-ADD7000001   ARECD
     C                     ELSE
     C                     ADD  1         ARECD
     C                     END
      *
     C                     EXCPTUP
     C                     ELSE
      *
     C                     Z-ADDUMONTH    AHZMM
     C                     Z-ADD7000001   ARECD
     C                     EXCPTWT
     C                     END
      *
     C                     Z-ADDARECD     CQJTNO
     C                     WRITEAU#PP511
     C                     ELSE
      *
     C           WJDMS     DIV  4         WA1     52
     C           WA1       MULT WSSYS     CQSRYO
     C           CQSRYO    DIV  WSSYS     CQHAKO
     C                     MVR            WS1
      *
     C           WS1       IFNE 0
     C           WS1       IFLT 0
     C                     SUB  1         CQHAKO
     C                     ELSE
     C                     ADD  1         CQHAKO
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C           1         DO   4         A
     C                     Z-ADDHIZ,A     CQTHHZ
     C                     Z-ADDHIZ,A     CQNOHZ
      *
     C                     SETOF                     10
     C           1         CHAINAU#NP11              10
     C           *IN10     IFEQ '0'
     C           AHZMM     IFNE UMONTH
     C                     Z-ADDUMONTH    AHZMM
     C                     Z-ADD7000001   ARECD
     C                     ELSE
     C                     ADD  1         ARECD
     C                     END
      *
     C                     EXCPTUP
     C                     ELSE
      *
     C                     Z-ADDUMONTH    AHZMM
     C                     Z-ADD7000001   ARECD
     C                     EXCPTWT
     C                     END
      *
     C                     Z-ADDARECD     CQJTNO
     C                     WRITEAU#PP511
      *
     C                     END
     C                     END
      *
     C                     ENDSR
      *
      *
     OAU#NP11 E                UP
     O                         AHZMM      2
     O                         ARECD      9
     O        EADD             WT
     O                         AHZMM      2
     O                         ARECD      9
      *
     OABCWP01 EADD             F01
     O                         WBMON      4
     O                         TZOGN      5
     O                         WTKR      11
     O                         WKHIN     23
     O                         TKSTS     32
     O                         TZSTS     41
     O                         TZGSU     50
     O                         TN1SU     59
     O                         TN2SU     68
     O                         TSYOS     73
     O                         KOT      118
     O                         BUM      178
     O                         TKR      268
     O                         TTENS    271
     O                         TKHTS    277
     O                         TZHTS    283
     O                         TZGHS    289
     O                         TN1HS    295
     O                         TN2HS    301
     O                         TTKSTS   310
     O                         TTN1SU   319
     O                         TTN2SU   328
     O                         TTZGSU   337
      *
     OABCWP1X EADD             KDT
     O                         M6NKOJ     4
     O                         #ZOGN      5
     O                         M6JBAN    11
     O                         M6SHIN    23
     O                         #KSTS     32
     O                         #KHTS     38
     O                         #ZSTS     47
     O                         #ZHTS     53
     O                         #N1SU     62
     O                         #N1HS     68
     O                         #N2SU     77
     O                         #N2HS     83
     O                         WLOTK     86
     O                         WKJNK     89
     O                         WKMAX     92
     O                         M6LOTK    95
     O                         M6KJNK    98
     O                         M6KMAX   101
     O                         M6AKT1   104
     O                         M6AKT2   107
     O                         M6AKT3   110
     O                         M6AKT4   113
     O                         M6KBN1   116
     O                         M6KIB1   117
     O                         M6KBN2   120
     O                         M6KIB2   121
     O                         M6KBN3   124
     O                         M6KIB3   125
     O                         M6KBN4   128
     O                         M6KIB4   129
     O                         M6SYUY   136
     O                         #ZGSU    145
     O                         #TENS    148
     O                         #ZGHS    154
     O                         ASHIN    166
     O                         ##KSTS   175
     O                         ##N1SU   184
     O                         ##N2SU   193
     O                         ##ZGSU   202
      *
     OABCWP1Y EADD             GDT
     O                         $KCD1      1
     O                         $ZOGN      2
     O                         $TKRO      8
     O                         $SHIN     20
     O                         $KSTS     29
     O                         $ZSTS     38
     O                         $ZGSU     47
     O                         $N1SU     56
     O                         $N2SU     65
     O                         $NLOT     68
     O                         $NMAS     71
     O                         $OMAS     74
     O                         $SYOS     79
     O                         $KOT1     82
     O                         $KOT2     85
     O                         $KOT3     88
     O                         $KOT4     91
     O                         $TENS     94
     O                         $KHTS    100
     O                         $ZHTS    106
     O                         $ZGHS    112
     O                         $N1HS    118
     O                         $N2HS    124
     O                         $BMON    128
     O                         $UKOJ    132
     O                         $$KSTS   141
     O                         $$N1SU   150
     O                         $$N2SU   159
     O                         $$ZGSU   168
      *
     OABCWP1Z EADD             YDT
     O                         J6ATOB     4
     O                         @ZOGN      5
     O                         J6ATKR    11
     O                         J6SHIN    23
     O                         @KSTS     32
     O                         @ZSTS     41
     O                         @ZGSU     50
     O                         @N1SU     59
     O                         @N2SU     68
     O                         J6LOTO    70
     O                         @NMAS     73
     O                         @OMAS     76
     O                         J6SYOS    83
     O                         J6MAEK    86
     O                         J6MAKB    90
     O                         J6KEI1    91
     O                         J6KEI2    92
     O                         @TENS     95
     O                         @KHTS    101
     O                         @ZHTS    107
     O                         @ZGHS    113
     O                         @N1HS    119
     O                         @N2HS    125
     O                         @@KSTS   134
     O                         @@N1SU   143
     O                         @@N2SU   152
     O                         @@ZGSU   161
      *
     OABCWPR1 EADD             RDT1
     O                         $$SHIN    12
     O                         $$TKRO    18
     O                         $$KCOD    19
     O                         $$ZOGN    20
     O                         $$WMON    24
     O                         $$BMON    28
      *
** HTY (KANBAN KIND .. HANDWRITING KANBAN..)
A
B
C
D
E
G
0
1
2
4
6
7
** TB1.TB2 ( PRECEDING PROCESS SECTION )
01110111
