     H            Y.
     F** ABCR14 ********************************
     F* .. SUPPLIER KANBAN SETTING NUMBER INCREASE AND DECREASE LIST.. *
     F* I-HASADA                92.03.06       *
     F******************************** ABCR14 **
     FABCWP2Y IP  F     200            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     156     OF     PRINTER
     E                    TB1     1   7  1   TB2    22   f]ﾌﾞ]ﾆｬﾓb xb
     E                    TB3     1   1  4 0 TB4    12   ﾃcﾆﾞｭc xb
     E                    TBL     1   2 46               ﾒﾇnxb
     IABCWP2Y AA  01
     I                                        1   1 IKCD1 L3
     I                                        2   2 IZOGN
     I                                        3   8 ITKRO
     I                                        3   3 ITKR1
     I                                        4   5 ITKR2           02
     I                                        6   7 ITKR3           03
     I                                        8   8 ITKR4           04
     I                                        9  20 ISHIN L1
     I                                        9  13 ISHN1
     I                                       14  18 ISHN2           05
     I                                       19  20 ISHN3           06
     I                                       21  290IKSTS
     I                                       30  380IZSTS
     I                                       39  470IZGSU
     I                                       48  560IN1SU
     I                                       57  650IN2SU
     I                                       66  680INLOT
     I                                       69  710INMAS
     I                                       72  740IOMAS
     I                                       75  790ISYOS
     I                                       80  82 IKOT1
     I                                       83  85 IKOT2
     I                                       86  88 IKOT3
     I                                       89  91 IKOT4
     I                                       92  940ITENS
     I                                       95 1002IKHTS
     I                                      101 1062IZHTS
     I                                      107 1122IZGHS
     I                                      113 1182IN1HS
     I                                      119 1242IN2HS
     I                                      125 1280IBMON L2        07
     I                                      129 1320IUKOJ L4
     I                                      133 1410IIKSTS
     I                                      142 1500IIN1SU
     I                                      151 1590IIN2SU
     I                                      160 1680IIZGSU
      *
     C           *ENTRY    PLIST
     C                     PARM           PCD1    3
     C                     PARM           PCD2    3
     C                     PARM           PCD3    3
     C                     PARM           PCD4    3
     C                     PARM           PCD5    3
     C                     MOVE PCD1      WCD1    31
     C                     MOVE PCD2      WCD2    31
     C                     MOVE PCD3      WCD3    31
     C                     MOVE PCD4      WCD4    31
     C                     MOVE PCD5      WCD5    31
      *
     C                     TIME           WTIME   60
     C                     MOVE *ALL'-'   WLIN  127
      *
     C           *INL4     IFEQ '1'
     C                     SETOF                     10
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WUKNM  12
     C           IUKOJ     LOKUPTB3,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB4,A     WUKNM
     C                     END
     C                     END
      *
     C           *INL3     IFEQ '1'
     C                     SETOF                     10
     C                     Z-ADD1         A
     C                     MOVE *BLANK    WSRNM  22
     C           IKCD1     LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVE TB2,A     WSRNM
     C                     END
     C                     END
      *
     C           *INL2     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    WSMEI  15
     C           IBMON     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
     C                     END
      *
     C           *INL1     IFEQ '1'
      *
     C           IZOGN     IFEQ 'Z'
     C                     MOVE ' +  '    WZONM   4
     C                     ELSE
     C                     MOVE ' -  '    WZONM
     C                     END
      *
     C*----------------------------*
     C*  ..今回設定数　増減率..  *
     C*----------------------------*
     C                     Z-ADD0         WPAR1   61
     C                     MOVE *BLANK    WPZG1   1
     C           IZHTS     IFNE 0
     C           IKHTS     DIV  IZHTS     WKTE    83H
     C           WKTE      MULT 100       WPAR1     H
     C           WPAR1     IFGE 100
     C                     MOVE '+'       WPZG1
     C           WPAR1     SUB  100       WPAR1
     C                     ELSE
     C                     MOVE '-'       WPZG1
     C           100       SUB  WPAR1     WPAR1
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..翌月内示数　増減率..  *
     C*----------------------------*
     C                     Z-ADD0         WPAR2   61
     C                     MOVE *BLANK    WPZG2   1
     C           IZHTS     IFNE 0
     C           IN1HS     DIV  IZHTS     WKTE      H
     C           WKTE      MULT 100       WPAR2     H
     C           WPAR2     IFGE 100
     C                     MOVE '+'       WPZG2
     C           WPAR2     SUB  100       WPAR2
     C                     ELSE
     C                     MOVE '-'       WPZG2
     C           100       SUB  WPAR2     WPAR2
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..翌々月内示数　増減率..  *
     C*------------------------------*
     C                     Z-ADD0         WPAR3   61
     C                     MOVE *BLANK    WPZG3   1
     C           IZHTS     IFNE 0
     C           IN2HS     DIV  IZHTS     WKTE      H
     C           WKTE      MULT 100       WPAR3     H
     C           WPAR3     IFGE 100
     C                     MOVE '+'       WPZG3
     C           WPAR3     SUB  100       WPAR3
     C                     ELSE
     C                     MOVE '-'       WPZG3
     C           100       SUB  WPAR3     WPAR3
     C                     END
     C                     END
      *
     C                     END
      *
     OQPRINT  H  103   L3
     O       OR        OFNL3
     O                                   14 'RCV FACTORY'
     O                         WUKNM     29
     O        H  1     L3
     O       OR        OFNL3
     O                                   14 'KANBAN KIND'
     O                         IKCD1     18
     O                         WSRNM     41
     O                                  103 'TIME'
     O                         WTIME    112 '  :  :  '
     O        H  2     L3
     O       OR        OFNL3
     O                                   13 'PGM-ABCR14'
     O                                   25 'HANDL DATE'
     O                         UDATE Y   34
     O                                   70 '*** SETTING NBR +/- '
     O                                   78 'LIST ***'
     O                                  103 'DATE'
     O                         UDATE Y  112
     O                                  120 'PAGE'
     O                         PAGE  Z  124
     O        H  1     L3
     O       OR        OFNL3
     O                         TBL,1     82
     O        H  1     L3
     O       OR        OFNL3
     O                                    6 '+/-'
     O                                   17 'LOCATION'
     O                                   30 'INT CO.P/N'
     O                                   47 'THIS SET NBR'
     O                                   59 '-1 SET NBR'
     O                                   70 '-1M RSLT'
     O                                   82 '+1M DMND'
     O                                   96 '+2M DMND'
     O                                  102 'LOT'
     O                                  112 'NEW SHEET'
     O                                  122 'ACCOM QTY'
     O                                  127 'PROC'
     O                                  133 'PROC'
     O                                  139 'PROC'
     O                                  145 'PROC'
     O                                  156 'COMMON CNT'
     O        H  1     L3
     O       OR        OFNL3
     O                                   47 'BOX / DAY'
     O                                   59 'BOX / DAY'
     O                                   72 'BOX / DAY'
     O                                   85 'BOX / DAY'
     O                                   98 'BOX / DAY'
     O                                  112 'OLD SHEET'
     O        H  2     L3
     O       OR        OFNL3
     O                                   47 '+/- RATE'
     O                                   85 '+/- RATE'
     O                                   98 '+/- RATE'
     O        D  2     L2
     O       OR        OFNL2
     O                N07      IBMON      5
     O                         WSMEI     23
     O        D  1     L1
     O                         WZONM      7
     O                         ITKR1     10
     O                N02                11 '-'
     O                         ITKR2     13
     O                N03                14 '-'
     O                         ITKR3     16
     O                N04                17 '-'
     O                         ITKR4     18
     O                         ISHN1     25
     O                N05                26 '-'
     O                         ISHN2     31
     O                N06                32 '-'
     O                         ISHN3     34
     O                         IKSTS 1   47
     O                         IZSTS 1   59
     O                         IZGSU 1   72
     O                         IN1SU 1   85
     O                         IN2SU 1   97
     O                         INLOT 3  102
     O                         INMAS 3  109
     O                         ISYOS 1  121
     O                         IKOT1    126
     O                         IKOT2    132
     O                         IKOT3    138
     O                         IKOT4    144
     O                         ITENS 3  149
     O                                  155 'POINT'
     O        D  1     L1
     O                         IKHTS 1   47
     O                         IZHTS 1   59
     O                         IZGHS 1   72
     O                         IN1HS 1   85
     O                         IN2HS 1   97
     O                         IOMAS 3  109
     O        D  1     L1
     O                                   37 '('
     O                         WPZG1     38
     O                         WPAR1 1   46
     O                                   47 '%'
     O                                   48 ')'
     O                                   75 '('
     O                         WPZG2     76
     O                         WPAR2 1   84
     O                                   85 '%'
     O                                   86 ')'
     O                                   87 '('
     O                         WPZG3     88
     O                         WPAR3 1   96
     O                                   97 '%'
     O                                   98 ')'
     O        D  1     L1
     O                         WLIN     144
     O        D  2     L1
     O                                   33 'SET NBR AT OPERATE DATE'
     O                                   35 '('
     O                         IIKSTS1   47
     O                         IIZGSU1   72
     O                         IIN1SU1   85
     O                         IIN2SU1   97
     O                         TBL,2    144
      *
** TB1.TB2
0COMPLET PART KANBAN
1SMALL PROCESS KANBAN
2SMAL PROC HEAT KANBAN
4PURCHASE TUNNEL KANBAN
6HALF-FINISHED KANBAN
7HEAT PLATING KANBAN
GRESIN KANBAN
** TB3.TB4
0111IAF
** TBL
EACH SETTING NBR IS 20 DAYS WORKS----->
DON'T USE IT FOR SETTING NBR OF M/F. )
