     H            Y.
     F** ABCR17 ********************************
     F* .. QUENCHING KANBAN SETTING NUMBER INCREASE AND DECREASE LIST || *.
     F* I-HASADA                94.03.23       *
     F******************************** ABCR17 **
     FABCWP2Z IP  F     200            DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
     E                    TBL     1   2 46               ﾒﾇnxb
     IABCWP2Z AA  01
     I                                        1   40IATOB L3
     I                                        5   5 IZOGN
     I                                        6  11 ITKRO L2
     I                                        6   6 ITKR1
     I                                        7   8 ITKR2           02
     I                                        9  10 ITKR3           03
     I                                       11  11 ITKR4           04
     I                                       12  23 ISHIN
     I                                       12  16 ISHN1
     I                                       17  21 ISHN2           05
     I                                       22  23 ISHN3           06
     I                                       24  320IKSTS
     I                                       33  410IZSTS
     I                                       42  500IZGSU
     I                                       51  590IN1SU
     I                                       60  680IN2SU
     I                                       69  700ILOTO
     I                                       71  730INMAS
     I                                       74  760IOMAS
     I                                       77  830ISYOS
     I                                       84  86 IMAEK
     I                                       87  900IMAKB L1
     I                                       91  91 IKEI1
     I                                       92  92 IKEI2
     I                                       93  950ITENS
     I                                       96 1012IKHTS
     I                                      102 1072IZHTS
     I                                      108 1132IZGHS
     I                                      114 1192IN1HS
     I                                      120 1252IN2HS
     I                                      126 1340IIKSTS
     I                                      135 1430IIN1SU
     I                                      144 1520IIN2SU
     I                                      153 1610IIZGSU
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PCD1    3
     C                     PARM           PCD2    3
     C                     PARM           PCD3    3
     C                     PARM           PCD4    3
     C                     PARM           PCD5    3
     C                     MOVE PCD1      WCD1    31
     C                     MOVE PCD2      WCD2    31
     C                     MOVE PCD3      WCD3    31
     C                     MOVE PCD4      WCD4    31
     C                     MOVE PCD5      WCD5    31
      *
     C                     TIME           WTIME   60
     C                     MOVE *ALL'-'   WLIN  127
      *
     C*--------------------*
     C*  ..自工程部門..  *
     C*--------------------*
     C           *INL3     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    WKJNM  15
     C           IATOB     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    WKJNM
     C                     END
     C                     END
      *
     C           *INL2     IFEQ '1'
      *
     C*--------------------*
     C*  ..前工程部門..  *
     C*--------------------*
     C           *INL1     IFEQ '1'
     C                     SETOF                     10
     C                     MOVE *BLANK    WMENM  15
     C           IMAKB     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    WMENM
     C                     END
     C                     END
      *
     C           IZOGN     IFEQ 'Z'
     C                     MOVE ' +  '    WZONM   4
     C                     ELSE
     C                     MOVE ' -  '    WZONM
     C                     END
      *
     C*----------------------------*
     C*  ..今回設定数　増減率..  *
     C*----------------------------*
     C                     Z-ADD0         WPAR1   61
     C                     MOVE *BLANK    WPZG1   1
     C           IZHTS     IFNE 0
     C           IKHTS     DIV  IZHTS     WKTE    83H
     C           WKTE      MULT 100       WPAR1     H
     C           WPAR1     IFGE 100
     C                     MOVE '+'       WPZG1
     C           WPAR1     SUB  100       WPAR1
     C                     ELSE
     C                     MOVE '-'       WPZG1
     C           100       SUB  WPAR1     WPAR1
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..翌月内示数　増減率..  *
     C*----------------------------*
     C                     Z-ADD0         WPAR2   61
     C                     MOVE *BLANK    WPZG2   1
     C           IZHTS     IFNE 0
     C           IN1HS     DIV  IZHTS     WKTE      H
     C           WKTE      MULT 100       WPAR2     H
     C           WPAR2     IFGE 100
     C                     MOVE '+'       WPZG2
     C           WPAR2     SUB  100       WPAR2
     C                     ELSE
     C                     MOVE '-'       WPZG2
     C           100       SUB  WPAR2     WPAR2
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..翌々月内示数　増減率..  *
     C*------------------------------*
     C                     Z-ADD0         WPAR3   61
     C                     MOVE *BLANK    WPZG3   1
     C           IZHTS     IFNE 0
     C           IN2HS     DIV  IZHTS     WKTE      H
     C           WKTE      MULT 100       WPAR3     H
     C           WPAR3     IFGE 100
     C                     MOVE '+'       WPZG3
     C           WPAR3     SUB  100       WPAR3
     C                     ELSE
     C                     MOVE '-'       WPZG3
     C           100       SUB  WPAR3     WPAR3
     C                     END
     C                     END
      *
     C                     END
      *
     OQPRINT  H  103   L3
     O       OR        OFNL3
     O                                   20 'PRESENT PROC SEC'
     O                         WKJNM     37
     O        H  1     L3
     O       OR        OFNL3
     O                                   20 'QUENCHING KANBAN'
     O                                  139 'TIME'
     O                         WTIME    148 '  :  :  '
     O        H  2     L3
     O       OR        OFNL3
     O                                   14 'PGM-ABCR17'
     O                                   28 'HANDL DATE'
     O                         UDATE Y   37
     O                                   77 '* SETTING NUMBER '
     O                                   99 'INCREASE AND DECREASE '
     O                                  105 'LIST *'
     O                                  139 'DATE'
     O                         UDATE Y  148
     O                                  157 'PAGE'
     O                         PAGE  Z  161
     O        H  1     L3
     O       OR        OFNL3
     O                         TBL,1     82
     O        H  1     L3
     O       OR        OFNL3
     O                                    6 '+/-'
     O                                   17 'LOCATION'
     O                                   30 'INT CO P/N'
     O                                   47 'THIS SET NBR'
     O                                   60 'LAST SET NBR'
     O                                   72 '-1MM RESULT'
     O                                   84 '+1 MM P_D_F'
     O                                   97 '+2 MM P_D_F'
     O                                  106 'OLD'
     O                                  117 'OLD'
     O                                  129 'ACCOM'
     O                                  140 'PRE PROC'
     O                                  165 'CALC'
     O                                  178 'COMMON'
     O        H  1     L3
     O       OR        OFNL3
     O                                   47 'BOX/DAY'
     O                                   59 'BOX/DAY'
     O                                   71 'BOX/DAY'
     O                                   83 'BOX/DAY'
     O                                   97 'BOX/DAY'
     O                                  108 'QUENCH'
     O                                  118 'KANBAN'
     O                                  128 'QTY'
     O                                  165 'INST'
     O                                  178 'COUNT'
     O        H  2     L3
     O       OR        OFNL3
     O                                   47 '+/- RATE'
     O                                   83 '+/- RATE'
     O                                   97 '+/- RATE'
     O                                  106 'LOT'
     O                                  118 'SHEET'
     O        D  1     L2
     O                         WZONM      7
     O                         ITKR1     10
     O                N02                11 '-'
     O                         ITKR2     13
     O                N03                14 '-'
     O                         ITKR3     16
     O                N04                17 '-'
     O                         ITKR4     18
     O                         ISHN1     25
     O                N05                26 '-'
     O                         ISHN2     31
     O                N06                32 '-'
     O                         ISHN3     34
     O                         IKSTS 1   47
     O                         IZSTS 1   59
     O                         IZGSU 1   71
     O                         IN1SU 1   83
     O                         IN2SU 1   97
     O                         ILOTO 3  105
     O                         IOMAS 3  117
     O                         ISYOS 1  130
     O                         IMAEK    135
     O                                  136 '-'
     O                         IMAKB    140
     O                         WMENM    157
     O                         IKEI1    161
     O                                  163 '-'
     O                         IKEI2    165
     O                         ITENS 3  174
     O                                  180 'POINT'
     O        D  1     L2
     O                         IKHTS 1   47
     O                         IZHTS 1   59
     O                         IZGHS 1   71
     O                         IN1HS 1   83
     O                         IN2HS 1   97
     O        D  1     L2
     O                                   37 '('
     O                         WPZG1     38
     O                         WPAR1 1   46
     O                                   47 '%'
     O                                   48 ')'
     O                                   73 '('
     O                         WPZG2     74
     O                         WPAR2 1   82
     O                                   83 '%'
     O                                   84 ')'
     O                                   87 '('
     O                         WPZG3     88
     O                         WPAR3 1   96
     O                                   97 '%'
     O                                   98 ')'
     O        D  1     L2
     O                         WLIN     144
     O        D  2     L2
     O                                   35 'SET NBR AT OPE DAY ('
     O                         IIKSTS1   47
     O                         IIZGSU1   71
     O                         IIN1SU1   83
     O                         IIN2SU1   97
     O                         TBL,2    144
      *
** TBL
 EACH SETTING NUMBER IS 20 DAYS WORKING ---->
DON'T USE IT FOR SETTING NUMBER OF M/F. )
