     H            Y.
     F** ABDR01 ***********************************
     F*INCREASE & DECREASE NBR OF SHEETS LIST     *
     F*BY EACH FOCTORY SETT NBR AUTOMATIC HANDLING*
     F* A-PICS1                                   *
     F* PROGRAM ID.  : ABDR01. <RPG>              *
     F* CREATE DATE. : NOV.28,'90.                *
     F* AUTHOR.      : KOHHY.                     *
     F*********************************** ABDR01 **
     FAU#PP51 IP  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    AAA        10  6 0             + ﾎｧｰﾓnﾞ
     E                    BBB        10  6 0             - ﾎｧｰﾓnﾞ
     E                    CCC        10  6 0             ﾅb ﾎｧｰﾓnﾞ
     E                    HAA        10  7 2             + ﾎｧｰﾓnﾞ X.XX
     E                    HBB        10  7 2             - ﾎｧｰﾓnﾞ X.XX
     E                    HCC        10  7 2             ﾅb ﾎｧｰﾓnﾞ X.XX
     E                    TB1     1   1  4 0             ﾃcﾆﾞｭc
     IAU#PP511    01
     I            DS
     I                                        1   80CQSKHZ
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
     I            DS
     I                                        1   70YMJ
     I                                        1   60YYMM
     I                                        3   60YYMM2
     I                                        1   40YY
     I                                        5   60MM
     I                                        7   70JUN
     I            DS
     I                                        1   80HIZ
     I                                        3   80HIZ6
     I                                        1   40@YY
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   80DAY
     I                                        1   40DAYYY
     I                                        5   60DAYMM
     I                                        7   80DAYDD
     I            DS
     I                                        1   80DAYL
     I                                        1   40YYL
     I                                        5   60MML
     I                                        7   80DDL
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     C           KEY1      KLIST
     C                     KFLD           YY
     C                     KFLD           MM
      *
     C           KEY2      KLIST
     C                     KFLD           DAYYY
     C                     KFLD           DAYMM
     C                     KFLD           DAYDD
      *
     C           *ENTRY    PLIST
     C                     PARM           @YMJ    7
     C                     PARM           @HIZ    8
      *
     C           *IN90     IFEQ '0'
     C                     MOVEL@YMJ      YMJ     70
     C                     MOVEL@HIZ      HIZ     80
     C                     Z-ADDYY        DAYYY
     C                     Z-ADDMM        DAYMM
      *
     C           MM        IFEQ 08
     C           JUN       ANDEQ2
     C                     Z-ADD3         JUN
     C                     END
      *
     C           JUN       IFEQ 1
     C                     Z-ADD1         DAYDD
     C                     Z-ADD10        DDL
     C                     END
      *
     C           JUN       IFEQ 2
     C                     Z-ADD11        DAYDD
     C                     Z-ADD20        DDL
     C                     END
      *
     C           JUN       IFEQ 3
     C                     Z-ADD21        DAYDD
     C                     Z-ADD31        DDL
     C                     END
      *  fnﾞcﾍﾞ 1.2
     C                     Z-ADD0         @DD1    31
     C                     Z-ADD0         @DD2    31
     C           KEY1      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAGDPL121                 10
     C           *IN10     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @DD1
     C                     ELSE
     C                     ADD  0.5       @DD1
     C                     END
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     Z-ADDDAYYY     YYL
     C                     Z-ADDDAYMM     MML
     C           KEY2      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     20
     C                     READ AGDPL121                 20
     C           *IN20     IFEQ '0'
      *
     C           F8KAHZ    IFGT DAYL
     C                     SETON                     20
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @DD2
     C                     ELSE
     C                     ADD  0.5       @DD2
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N20                END
      *
     C                     TIME           WTIME   60
     C                     MOVE '1'       *IN90
     C                     MOVEL'1'       *INOF
     C                     Z-ADD0         AAA
     C                     Z-ADD0         BBB
     C                     Z-ADD0         HAA
     C                     Z-ADD0         HBB
     C                     END
      *
     C           CQSKJY    IFEQ 'D'
     C           CQSKHZ    ANDLE*DATE
     C                     GOTO @EXIT
     C                     END
      *
     C           CQMBMN    IFNE 0111
     C                     GOTO @EXIT
     C                     END
      *
     C                     SETOF                     30
     C                     Z-ADD1         A       50
     C           CQMBMN    LOKUPTB1,A                    30
     C           *IN30     IFEQ '1'
      *
     C           CQSRYO    IFLT 0
     C                     ADD  CQHAKO    BBB,A
     C           CQSRYO    DIV  CQSYUY    WHMIS   72H
     C                     ADD  WHMIS     HBB,A
     C                     ELSE
      *
     C                     ADD  CQHAKO    AAA,A
     C           CQSRYO    DIV  CQSYUY    WHMIS     H
     C                     ADD  WHMIS     HAA,A
     C                     END
     C                     END
      *
     C           @EXIT     TAG
      *
     CLR                   XFOOTAAA       AKEI    60
     CLR                   XFOOTBBB       BKEI    60
     CLR                   XFOOTHAA       HAKI    72
     CLR                   XFOOTHBB       HBKI    72
      *
     CLR                   DO   10        I       50
     CLR         AAA,I     ADD  BBB,I     CCC,I
     CLR         HAA,I     ADD  HBB,I     HCC,I
     CLR                   END
      *
     CLR                   EXCPTALL
      *
     OQPRINT  E   03           ALL
     O                                   16 'HANDL DATE'
     O                         HIZ6  Y   25
     O                                  106 'PGM  ABDR01-1'
     O                                  131 '+-------------------+'
     O        E   04           ALL
     O                                   97 'DATE'
     O                         UDATE Y  106
     O                                  131 '|         |         |'
     O        E   05           ALL
     O                                   75 '**  A-PICS  1  **'
     O                                   97 'TIME'
     O                         WTIME Y  106
     O                                  131 '|         |         |'
     O        E   06           ALL
     O                                   40 '* SET NBR AUTOMATIC '
     O                                   62 'HANDL BY EACH FACTORY '
     O                                   79 '+/- SHEETS LIST *'
     O                                   97 'PAGE'
     O                         PAGE  Z  106
     O                                  131 '+-------------------+'
     O        E   08           ALL
     O                                   21 'IAF'
     O                                   33 '       '
     O                                   45 '       '
     O                                   57 '       '
     O                                   69 '     '
     O                                   81 '      '
     O                                   93 '         '
     O                                  108 '             '
     O                                  118 '        '
     O                                  130 '          '
     O        E   10           ALL
     O                                   14 'INCREASE SHEET'
     O                         AAA,1 1   22
     O                         AAA,2 1   34
     O                         AAA,3 1   46
     O                         AAA,4 1   58
     O                         AAA,5 1   70
     O                         AAA,6 1   82
     O                         AAA,7 1   94
     O                         AAA,8 1  106
     O                         AAA,9 1  118
     O                         AAA,101  130
     O        E   11           ALL
     O                                   13 '('
     O                         HAA,1 1   22
     O                                   23 ')'
     O                                   25 '('
     O                         HAA,2 1   34
     O                                   35 ')'
     O                                   37 '('
     O                         HAA,3 1   46
     O                                   47 ')'
     O                                   49 '('
     O                         HAA,4 1   58
     O                                   59 ')'
     O                                   61 '('
     O                         HAA,5 1   70
     O                                   71 ')'
     O                                   73 '('
     O                         HAA,6 1   82
     O                                   83 ')'
     O                                   85 '('
     O                         HAA,7 1   94
     O                                   95 ')'
     O                                   97 '('
     O                         HAA,8 1  106
     O                                  107 ')'
     O                                  109 '('
     O                         HAA,9 1  118
     O                                  119 ')'
     O                                  121 '('
     O                         HAA,101  130
     O                                  131 ')'
     O        E   14           ALL
     O                                   14 'DECREASE SHEET'
     O                         BBB,1 1   22
     O                         BBB,2 1   34
     O                         BBB,3 1   46
     O                         BBB,4 1   58
     O                         BBB,5 1   70
     O                         BBB,6 1   82
     O                         BBB,7 1   94
     O                         BBB,8 1  106
     O                         BBB,9 1  118
     O                         BBB,101  130
     O        E   15           ALL
     O                                   13 '('
     O                         HBB,1 1   22
     O                                   23 ')'
     O                                   25 '('
     O                         HBB,2 1   34
     O                                   35 ')'
     O                                   37 '('
     O                         HBB,3 1   46
     O                                   47 ')'
     O                                   49 '('
     O                         HBB,4 1   58
     O                                   59 ')'
     O                                   61 '('
     O                         HBB,5 1   70
     O                                   71 ')'
     O                                   73 '('
     O                         HBB,6 1   82
     O                                   83 ')'
     O                                   85 '('
     O                         HBB,7 1   94
     O                                   95 ')'
     O                                   97 '('
     O                         HBB,8 1  106
     O                                  107 ')'
     O                                  109 '('
     O                         HBB,9 1  118
     O                                  119 ')'
     O                                  121 '('
     O                         HBB,101  130
     O                                  131 ')'
     O        E   18           ALL
     O                                   14 '**DIFFER TOTAL'
     O                         CCC,1 N   22
     O                         CCC,2 N   34
     O                         CCC,3 N   46
     O                         CCC,4 N   58
     O                         CCC,5 N   70
     O                         CCC,6 N   82
     O                         CCC,7 N   94
     O                         CCC,8 N  106
     O                         CCC,9 N  118
     O                         CCC,10N  130
     O        E   19           ALL
     O                                   12 '('
     O                         HCC,1 N   22
     O                                   23 ')'
     O                                   24 '('
     O                         HCC,2 N   34
     O                                   35 ')'
     O                                   36 '('
     O                         HCC,3 N   46
     O                                   47 ')'
     O                                   48 '('
     O                         HCC,4 N   58
     O                                   59 ')'
     O                                   60 '('
     O                         HCC,5 N   70
     O                                   71 ')'
     O                                   72 '('
     O                         HCC,6 N   82
     O                                   83 ')'
     O                                   84 '('
     O                         HCC,7 N   94
     O                                   95 ')'
     O                                   96 '('
     O                         HCC,8 N  106
     O                                  107 ')'
     O                                  108 '('
     O                         HCC,9 N  118
     O                                  119 ')'
     O                                  120 '('
     O                         HCC,10N  130
     O                                  131 ')'
     O        E   22           ALL
     O                                   82 '** INCREASE SHEET TOTAL'
     O                         AKEI  1   91
     O                                   94 '('
     O                         HAKI  1  104
     O                                  106 ')'
     O        E   25           ALL
     O                                   82 '** DECREASE SHEET TOTAL'
     O                         BKEI  1   91
     O                                   94 '('
     O                         HBKI  1  104
     O                                  106 ')'
     O        E   33           ALL
     O                                  110 '----------'
     O                                  120 '----------'
     O                                  130 '----------'
     O        E   34           ALL
     O                                  101 '|'
     O                                  130 '|'
     O        E   35           ALL
     O                                  101 '|'
     O                                  118 'SET NBR CHG SHEET'
     O                                  120 '+'
     O                                  129 'SHEET'
     O                                  130 '|'
     O        E   36           ALL
     O                                  101 '|'
     O                                  117 '(HAND WRITING)'
     O                                  130 '|'
     O        E   37           ALL
     O                                  101 '|'
     O                                  120 '-'
     O                                  129 'SHEET'
     O                                  130 '|'
     O        E   38           ALL
     O                                  101 '|'
     O                                  130 '|'
     O        E   39           ALL
     O                                  101 '|'
     O                                  116 'SET NBR UPD P/N'
     O                                  129 'COUNT'
     O                                  130 '|'
     O        E   40           ALL
     O                                  101 '|'
     O                                  130 '|'
     O        E   41           ALL
     O                                  110 '----------'
     O                                  120 '----------'
     O                                  130 '----------'
     O        E   44           ALL
     O                                  110 '---------'
     O                                  120 '----------'
     O                                  130 '----------'
     O        E   45           ALL
     O                                  109 '| VICE |'
     O                                  116 'SUBSEC|'
     O                                  123 'SUBSEC|'
     O                                  130 'CHARGE|'
     O        E   46           ALL
     O                                  109 '|      |'
     O                                  116 '      |'
     O                                  123 '      |'
     O                                  130 '      |'
     O        E   47           ALL
     O                                  109 '|      |'
     O                                  116 '      |'
     O                                  123 '      |'
     O                                  130 '      |'
     O        E   48           ALL
     O                                  109 '|      |'
     O                                  116 '      |'
     O                                  123 '      |'
     O                                  130 '      |'
     O        E   49           ALL
     O                                  110 '---------'
     O                                  120 '----------'
     O                                  130 '----------'
      *
**  TB1
0111
