     H            Y.
     F** ABDR03 **********************************
     F* SETTING NBR AUTOMATIC HANDLING A-PICS FIXED INCREASE AND DECREASE LIST *
     F* A-PICS1                                *
     F* PROGRAM ID. : ABDR03. <RPG> *
     F* CREATE DATE. : NOV.28,'90.               *
     F* AUTHOR.         : KOHHY.                 *
     F********************************** ABDR03 **
     FABDWP03 IP  F     100            DISK
     FAGDPL12 IF  E           K        DISK
     FAH#TL20 IF  E           K        DISK
     FDAGPL02 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1   2  1   TB2    12
     IABDWP03 NS  01
     I                                        1   30CQZMIS
     I                                        4   60CQKMIS
     I                                        7  12 $TKR
     I                                        7   7 CQSBKJL1
     I                                        8   9 CQSBROL1
     I                                       10  11 CQSBRTL1
     I                                       12  12 CQSBDNL1
     I                                       13  17 CQSHN1
     I                                       18  22 CQSHN2
     I                                       23  24 CQSHN3
     I                                       25  270CQHAKO
     I                                       28  340CQSRYO
     I                                       35  420CQTHHZ
     I                                       43  44 CQGYOM
     I                                       45  45 $KUBN L2
     I                                       46  500CQSYUY
     I                                       51  551CQPAST
     I            DS
     I                                        1   80CQTHHZ
     I                                        3   80CQTHH6
     I            DS
     I                                        1   9 TKR
     I                                        1   1 TKR1
     I                                        2   2 TKRA
     I                                        3   4 TKR2
     I                                        5   5 TKRB
     I                                        6   7 TKR3
     I                                        8   8 TKRC
     I                                        9   9 TKR4
     I            DS
     I                                        1  14 HIN
     I                                        1   5 HIN1
     I                                        6   6 HINA
     I                                        7  11 HIN2
     I                                       12  12 HINB
     I                                       13  14 HIN3
     I            DS
     I                                        1   70YMJ
     I                                        1   60YYMM
     I                                        3   60YYMM2
     I                                        1   40YY
     I                                        5   60MM
     I                                        7   70JUN
     I            DS
     I                                        1   80HIZ
     I                                        3   80HIZ6
     I                                        1   40@YY
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   80DAY
     I                                        1   40DAYYY
     I                                        5   60DAYMM
     I                                        7   80DAYDD
     I            DS
     I                                        1   80DAYL
     I                                        1   40YYL
     I                                        5   60MML
     I                                        7   80DDL
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80FROM
     I                                        5   80FRMD
     I                                        1   40FRYY
     I                                        5   60FRMM
     I                                        7   80FRDD
     I            DS
     I                                        1   80TO
     I                                        5   80TOMD
     I                                        1   40TOYY
     I                                        5   60TOMM
     I                                        7   80TODD
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80E4MIHZ
     I                                        1   40E4MIYY
     I                                        5   60E4MIMM
     I                                        7   80E4MIDD
      *
     C           KEY1      KLIST
     C                     KFLD           YY
     C                     KFLD           MM
      *
     C           KEY2      KLIST
     C                     KFLD           DAYYY
     C                     KFLD           DAYMM
     C                     KFLD           DAYDD
      *
     C           KEY3      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
     C                     KFLD           @DD
      *
     C           KEY4      KLIST
     C                     KFLD           CQSHN1
     C                     KFLD           CQSHN2
     C                     KFLD           CQSHN3
     C                     KFLD           FRYY
     C                     KFLD           FRMM
     C                     KFLD           FRDD
      *
     C           KEY5      KLIST
     C                     KFLD           CQSHN1
     C                     KFLD           CQSHN2
     C                     KFLD           CQSHN3
      *
     C           KEY6      KLIST
     C                     KFLD           CQSHN1
     C                     KFLD           CQSHN2
     C                     KFLD           CQSHN3
     C                     KFLD           FROM
      *
     C           *ENTRY    PLIST
     C                     PARM           @YMJ    7
     C                     PARM           @HIZ    8
      *
     C           *IN90     IFEQ '0'
     C                     MOVE *BLANK    @TKR    6
     C                     MOVEL@YMJ      YMJ     70
     C                     MOVEL@HIZ      HIZ     80
     C                     Z-ADDYY        DAYYY
     C                     Z-ADDMM        DAYMM
      *
     C           MM        IFEQ 08
     C           JUN       ANDEQ2
     C                     Z-ADD3         JUN
     C                     END
      *
     C           JUN       IFEQ 1
     C                     Z-ADD1         DAYDD
     C                     Z-ADD10        DDL
     C                     END
      *
     C           JUN       IFEQ 2
     C                     Z-ADD11        DAYDD
     C                     Z-ADD20        DDL
     C                     END
      *
     C           JUN       IFEQ 3
     C                     Z-ADD21        DAYDD
     C                     Z-ADD31        DDL
     C                     END
      *
     C*  fnﾞcﾍﾞ 1.2
     C                     Z-ADD0         @DD1    31
     C                     Z-ADD0         @DD2    31
     C           KEY1      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAGDPL121                 10
     C           *IN10     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @DD1
     C                     ELSE
     C                     ADD  0.5       @DD1
     C                     END
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     Z-ADDDAYYY     YYL
     C                     Z-ADDDAYMM     MML
     C           KEY2      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     20
     C                     READ AGDPL121                 20
     C           *IN20     IFEQ '0'
      *
     C           F8KAHZ    IFGT DAYL
     C                     SETON                     20
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         @DD2
     C                     ELSE
     C                     ADD  0.5       @DD2
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N20                END
      *
     C                     TIME           WTIME   60
     C                     MOVEA'1'       *IN,90
     C                     MOVEL'1'       *INOF
      *
     C                     Z-ADD0         FROM    80
     C                     Z-ADD0         TO      80
     C                     Z-ADD0         X       50
     C           KEY3      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     READPAGDPL121                 30
     C           *IN30     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C                     ADD  1         X
     C           X         IFEQ 5
     C                     Z-ADDF8KAHZ    FROM
     C                     Z-ADDHIZ       TO
     C                     MOVEA'1'       *IN,30
     C                     END
      *
     C                     END
     C                     END
     C  N30                END
     C                     END
      *
     C******************************************************
     C*  LET'S  PRINT-OUT                                  *
     C******************************************************
     C           *INL2     IFEQ '1'
     C                     SETOF                     05
     C                     Z-ADD1         A       10
     C                     MOVE *BLANK    WKJNM  12
     C           $KUBN     LOKUPTB1,A                    05
     C           *IN05     IFEQ '1'
     C                     MOVELTB2,A     WKJNM
     C                     END
     C                     END
      *
     C           *INL2     IFEQ '1'
     C           *INOF     OREQ '1'
     C                     MOVE *BLANK    @TKR
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
     C                     END
      *
     C                     Z-ADD0         USR     40
     C           KEY4      SETLLDAGPL021
     C                     DO   *HIVAL
     C           KEY5      READEDAGPL021                 40
     C           *IN40     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLE*DATE
     C                     GOTO $EXIT1
     C                     END
      *
     C           E4MIHZ    IFGE FROM
     C           E4MIHZ    ANDLETO
     C                     ADD  1         USR
     C                     END
     C           E4MIHZ    IFGT TO
     C                     MOVEA'1'       *IN,40
     C                     END
     C                     END
     C           $EXIT1    TAG
     C  N40                END
      *
     C                     Z-ADD0         BMON    40
     C           KEY6      SETLLAH#TL201
     C                     DO   *HIVAL
     C           KEY5      READEAH#TL201                 60
     C           *IN60     IFEQ '0'
     C           CFMNHZ    IFGE FROM
     C           CFMNHZ    ANDLETO
     C                     ADD  1         BMON
     C                     END
     C           CFMNHZ    IFGT TO
     C                     MOVEA'1'       *IN,60
     C                     END
     C                     END
     C  N60                END
      *
     C                     MOVE *BLANK    AST     2
     C           CQPAST    IFGE 75.0
     C           CQPAST    ANDLE125.0
     C                     ELSE
     C                     MOVEL'**'      AST
     C                     END
      *
     C                     MOVE *BLANK    TKR
     C                     MOVELCQSBKJ    TKR1
     C                     MOVELCQSBRO    TKR2
     C                     MOVELCQSBRT    TKR3
     C                     MOVELCQSBDN    TKR4
     C           TKR2      IFNE *BLANK
     C                     MOVEL'-'       TKRA
     C                     END
      *
     C           TKR3      IFNE *BLANK
     C                     MOVEL'-'       TKRB
     C                     END
      *
     C           TKR4      IFNE *BLANK
     C                     MOVEL'-'       TKRC
     C                     END
      *
     C                     MOVE *BLANK    HIN
     C                     MOVELCQSHN1    HIN1
     C                     MOVELCQSHN2    HIN2
     C                     MOVELCQSHN3    HIN3
     C           HIN2      IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
      *
     C           HIN3      IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
      *
     C           CQSRYO    DIV  CQSYUY    WHHAK   52H
      *
     C           CQHAKO    IFLT 0
     C                     ADD  CQHAKO    MINS    60
     C                     ADD  WHHAK     TMINS   82
     C                     ELSE
     C                     ADD  CQHAKO    PLS     60
     C                     ADD  WHHAK     TPLS    82
     C                     END
      *
     C           $TKR      COMP @TKR                     22
     C                     EXCPTDET
     C                     MOVEL$TKR      @TKR
      *
     CL1                   EXCPTDMY
      *
     CL2         PLS       ADD  MINS      GKEI    60
     CL2         TPLS      ADD  TMINS     TGKEI   82
     CL2                   EXCPTKEI
      *
     OQPRINT  E   03           HED
     O                                  130 '----------------------'
     O        E   04           HED
     O                                  130 '|VICE-C|SUBSEC|CHARGE|'
     O        E   05           HED
     O                                   15 'HANDL DATE'
     O                         HIZ6  Y   24
     O                                  106 'PGM  ABDR03-1'
     O                                  130 '|      |      |      |'
     O        E   06           HED
     O                                   97 'DATE'
     O                         UDATE Y  106
     O                                  130 '|      |      |      |'
     O        E   07           HED
     O                                   79 '**  A-PICS 1  **'
     O                                   97 'TIME'
     O                         WTIME Y  106
     O                                  130 '|      |      |      |'
     O        E   08           HED
     O                                   53 '* SETTING NBR AUTOMATIC '
     O                                   62 'HANDLING '
     O                                   75 'A-PICS FIXED '
     O                                   85 '+/- LIST *'
     O                                   97 'PAGE'
     O                         PAGE  Z  106
     O                                  130 '----------------------'
     O        E   09           HED
     O                         FRMD       7 '  .  '
     O                                    9 '-'
     O                         TOMD      15 '  .  '
     O        E   10           HED
     O                                   13 'UNDELV INFO'
     O                                   56 'LAST'
     O                                   66 'THIS'
     O                                   75 '+/-'
     O        E   11           HED
     O                                   14 'USER PRE PROC'
     O                                   24 '+/- RATE'
     O                                   34 'LOCATION'
     O                                   49 'INT CO. P/N'
     O                                   59 'K SHEET'
     O                                   69 'K SHEET'
     O                                   76 'SHEET'
     O                                   97 '+/- QTY'
     O                                  111 'PROD ORD DATE'
     O                                  114 'GC'
     O                                  129 'CONFIRM MARK'
     O        E   1315         HED
     O                         WKJNM     16
     O        E  1             DET
     O                N22      AST        2
     O                N22      USR   4    8
     O                N22      BMON  4   14
     O                N22      CQPAST3   22
     O                N22                23 '%'
     O                N22      TKR       35
     O                N22      HIN       52
     O                N22      CQZMIS4   57
     O                N22      CQKMIS4   66
     O                         CQHAKON   75
     O                                   77 '-'
     O                                   79 '('
     O                         WHHAK N   86
     O                                   87 ')'
     O                         CQSRYON   98
     O                         CQTHH6   109 '  .  .  '
     O                         CQGYOM   114
     O                                  131 '(            )'
     O        E  1             DMY
     O                                   10 ' '
     O        E  1             KEI
     O                                   33 '*** PULAS TOTAL'
     O                         PLS   2B  41
     O                                   59 '*** MINUS TOTAL'
     O                         MINS  2B  67
     O                                   86 '*** DIFFER TOTAL'
     O                         GKEI  NB  95
     O        E  2             KEI
     O                                   30 '('
     O                         TPLS  2B  41
     O                                   42 ')'
     O                                   56 '('
     O                         TMINS 2B  67
     O                                   68 ')'
     O                                   84 '('
     O                         TGKEI NB  95
     O                                   96 ')'
      *
** TB1.TB2
1HEAD OFFIC F
2HEAD OFFIC F
