     H            Y.
     F** ABDR02 **********************************
     F* SETTING NBR AUTOMATIC HANDLING A-PICS FIXED INCREASE AND DECREASE LIST *
     F* A-PICS1                                *
     F* PROGRAM ID. : ABDR02. <RPG> *
     F* CREATE DATE. : NOV.28,'90.               *
     F* AUTHOR.         : KOHHY.                 *
     F********************************** ABDR02 **
     FAU#PP51 IP  E                    DISK
     FALAPP06 IF  E           K        DISK
     FABDWP02 O   F     100            DISK
     I            DS
     I                                        1   80CQSKHZ
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
     I            DS
     I                                        1   80CQTHHZ
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   80TQSKHZ
     I                                        1   40TQSKYY
     I                                        5   60TQSKMM
     I                                        7   80TQSKDD
      *
     C           KEY       KLIST
     C                     KFLD           CQSBKJ
     C                     KFLD           CQSBRO
      *
     C           CQSKJY    IFEQ 'D'
     C           CQSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETOF                     10
     C                     MOVE '1'       WKUBN   1
     C           KEY       CHAINALAPP061             10
     C           *IN10     IFEQ '0'
     C           TQSKJY    ANDEQ'D'
     C           TQSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C           TQYSCD    IFEQ '2'
     C                     MOVE TQYSCD    WKUBN
     C                     END
     C                     END
      *
     C                     SETON                     U1
     C                     EXCPTF01
      *
     C                     END
      *
     OABDWP02 E                F01
     O                         CQZMIS     3
     O                         CQKMIS     6
     O                         CQSBKJ     7
     O                         CQSBRO     9
     O                         CQSBRT    11
     O                         CQSBDN    12
     O                         CQSHN1    17
     O                         CQSHN2    22
     O                         CQSHN3    24
     O                         CQHAKO    27
     O                         CQSRYO    34
     O                         CQTHHZ    42
     O                         CQGYOM    44
     O                         WKUBN     45
     O                         CQSYUY    50
     O                         CQPAST    55
