     H            Y.
     F** ABER05 **************************************
     F* .. SETTING NUMBER AUTOMATIC HANDLING     *
     F* ..  MONTHLY  WORK FILE BY COMPONENTS PROCESS*
     F* .. FOR THE KEY,  MONTHLY TOTAL CALCULATIONS  *
     F* WHEN IT CHANGES,  AKHR02 CHANGES, TOO
     F* WHEN IT CHANGES, AKHRA2 CHANGES, TOO
     F* I-HASADA                      92.10.01       *
     F************************************** ABER05 **
     FAKDPL02 IF  E           K        DISK
     FAEBPL11 IF  E           K        DISK
     FAEBPL02 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FMBEPL05 IF  E           K        DISK
     FABEWP04 IF  E           K        DISK                      A
     FABEWP05 UF  E           K        DISK                      A
     E                    TB1     1   1  4 0             ﾃcﾌﾞbxｰfｰ
     E                    HSR        12  9 0             実績数
     I            DS
     I                                        1 1080HSR
     I                                        1   90I6SRO1
     I                                       10  180I6SRO2
     I                                       19  270I6SRO3
     I                                       28  360I6SRO4
     I                                       37  450I6SRO5
     I                                       46  540I6SRO6
     I                                       55  630I6SRO7
     I                                       64  720I6SRO8
     I                                       73  810I6SRO9
     I                                       82  900I6SROA
     I                                       91  990I6SROB
     I                                      100 1080I6SROC
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1  20 A@KEY
     I                                        1  12 AGKHIN
     I                                        1   5 AGKHN1
     I                                        6  10 AGKHN2
     I                                       11  12 AGKHN3
     I                                       13  160@KBMN
     I                                       17  20 @UKER
     I            DS
     I                                        1  12 A@KHIN
     I                                        1   5 A@KHN1
     I                                        6  10 A@KHN2
     I                                       11  12 A@KHN3
     I            DS
     I                                        1   60#JYM
     I                                        1   40#JYY
     I                                        5   60#JMM
      *
     C           KEY1      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           PKOTI
     C                     KFLD           WKBMN
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEY2      KLIST
     C                     KFLD           MNJHN1
     C                     KFLD           MNJHN2
     C                     KFLD           MNJHN3
      *
     C           KEY3      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           @KBMN
     C                     KFLD           @UKER
      *
     C           KEY4      KLIST
     C                     KFLD           AGKHN1
     C                     KFLD           AGKHN2
     C                     KFLD           AGKHN3
      *
     C           KEY5      KLIST
     C                     KFLD           AFSHN1
     C                     KFLD           AFSHN2
     C                     KFLD           AFSHN3
     C                     KFLD           ##YM
      *
     C           KEY6      KLIST
     C                     KFLD           #JYY
     C                     KFLD           AFSHN1
     C                     KFLD           AFSHN2
     C                     KFLD           AFSHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PYM     6
     C                     PARM           PJYM    6
     C                     PARM           PSHIN  12
     C                     PARM           PKOTI   3
     C                     PARM           PKBMN   4
     C                     PARM           PTKRO   6
     C                     PARM           PKBMK   1
     C                     MOVE PYM       ##YM    60
     C                     MOVE PJYM      #JYM
     C                     MOVE PSHIN     WSHIN
     C                     MOVE PKBMN     WKBMN   40
     C                     MOVE PTKRO     WTKRO
     C                     MOVE *BLANK    W@KEY  20
      *
     C*--------------------------------*
     C*  ..構成品番　工程マスター..  *
     C*--------------------------------*
     C           KEY1      SETLLAKDPL021
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAKDPL021                 10
     C           *IN10     IFEQ '0'
      *
     C*------------------------------------------*
     C*  ..構成品工程別　月間必要数ファイル..  *
     C*------------------------------------------*
     C           KEY2      SETLLAEBPL111
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY2      READEAEBPL111                 20
     C           *IN20     IFEQ '0'
     C           AGNGEK    IFNE 0
      *
     C                     Z-ADD0         $KBMN   40
     C                     MOVE *BLANK    $UKER   4
     C                     Z-ADDAGKBMN    @KBMN
     C                     MOVE AGUKER    @UKER
      *
     C           PKBMK     IFEQ 'P'
     C                     Z-ADD@KBMN     $KBMN
     C                     MOVE @UKER     $UKER
     C                     Z-ADD0111      @KBMN
     C                     MOVE '01  '    @UKER
     C                     ELSE
      *
     C                     SETOF                     21
     C           AGKBMN    LOKUPTB1                      21
     C           *IN21     IFEQ '0'
     C                     Z-ADD@KBMN     $KBMN
     C                     MOVE @UKER     $UKER
     C                     Z-ADD0111      @KBMN
     C                     MOVE '01  '    @UKER
     C                     END
     C                     END
      *
     C                     Z-ADD0         WN1NM   90
     C                     Z-ADD0         WN2NM   90
     C                     Z-ADD0         WZGSU   90
     C                     Z-ADD0         WTENS   30
      *
     C           A@KEY     IFNE W@KEY
     C                     MOVE A@KEY     W@KEY
      *
     C*----------------------------*
     C*  ..構成品番　マスター..  *
     C*----------------------------*
     C           KEY4      SETLLAEBPL021
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY4      READEAEBPL021                 40
     C           *IN40     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     Z-ADDAFKBMN    #KBMN   40
     C                     MOVE AFUKER    #UKER   4
      *
     C                     SETOF                     21
     C           AFKBMN    LOKUPTB1                      21
     C           *IN21     IFEQ '0'
     C                     Z-ADD0111      #KBMN
     C                     MOVE '01  '    #UKER
     C                     END
      *
     C           @KBMN     IFEQ #KBMN
     C           @UKER     ANDEQ#UKER
      *
     C*----------------------------------------------*
     C*  ..設定数予想社内品番別　３ケ月ファイル..  *
     C*----------------------------------------------*
     C                     SETOF                     41
     C           KEY5      CHAINABBPL211             41
     C           *IN41     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    WN1NM
     C                     ADD  U1N2NM    WN2NM
     C                     ELSE
     C                     ADD  U1S1NM    WN1NM
     C                     ADD  U1S2NM    WN2NM
     C                     END
     C                     END
      *
     C*--------------------------------*
     C*  ..品番別売上集計ファイル..  *
     C*--------------------------------*
     C                     SETOF                     41
     C           KEY6      CHAINMBEPL051             41
     C           *IN41     IFEQ '0'
     C                     Z-ADD#JMM      A       20
     C                     ADD  HSR,A     WZGSU
     C                     Z-ADD1         WTENS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N40                END
     C                     END
      *
     C*----------------------------------------*
     C*  ..構成品工程別　チェックファイル    *
     C*----------------------------------------*
     C                     SETOF                     11
     C           AGKHIN    CHAINABEWP041             11
     C           *IN11     IFEQ '1'
     C                     MOVE AGKHIN    A#KHIN
     C                     WRITEABEWP041
     C                     END
      *
     C*------------------------------------------*
     C*  ..構成品工程別　月間必要数ファイル    *
     C*------------------------------------------*
     C                     SETOF                     30
     C           KEY3      CHAINABEWP051             30
     C           *IN30     IFEQ '1'
      *
     C                     MOVE WSHIN     A@KHIN
     C                     MOVE AGKOTI    A@KOTI
     C                     Z-ADD@KBMN     A@KBMN
     C                     MOVE @UKER     A@UKER
     C                     Z-ADDAGNGEK    A@GEKN
     C                     Z-ADDWN1NM     A@N1NM
     C                     Z-ADDWN2NM     A@N2NM
     C                     Z-ADDWZGSU     A@ZGSU
     C                     Z-ADDWTENS     A@TENS
     C                     WRITEABEWP051
     C                     ELSE
      *
     C           *IN11     IFEQ '1'
     C                     ADD  WN1NM     A@N1NM
     C                     ADD  WN2NM     A@N2NM
     C                     ADD  WZGSU     A@ZGSU
     C                     ADD  WTENS     A@TENS
     C                     END
      *
     C                     ADD  AGNGEK    A@GEKN
     C                     UPDATABEWP051
     C                     END
      *
     C*----------------------------*
     C*  ..仕入先コードの場合..  *
     C*----------------------------*
     C           $KBMN     IFNE 0
     C                     Z-ADD$KBMN     @KBMN
     C                     MOVE $UKER     @UKER
      *
     C                     Z-ADD0         WN1NM   90
     C                     Z-ADD0         WN2NM   90
     C                     Z-ADD0         WZGSU   90
     C                     Z-ADD0         WTENS   30
      *
     C           A@KEY     IFNE W@KEY
     C                     MOVE A@KEY     W@KEY
      *
     C*----------------------------*
     C*  ..構成品番　マスター..  *
     C*----------------------------*
     C           KEY4      SETLLAEBPL021
     C                     DO   *HIVAL
     C                     SETOF                     40
     C           KEY4      READEAEBPL021                 40
     C           *IN40     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     Z-ADDAFKBMN    #KBMN   40
     C                     MOVE AFUKER    #UKER   4
      *
     C           @KBMN     IFEQ #KBMN
     C           @UKER     ANDEQ#UKER
      *
     C*----------------------------------------------*
     C*  ..設定数予想社内品番別　３ケ月ファイル..  *
     C*----------------------------------------------*
     C                     SETOF                     41
     C           KEY5      CHAINABBPL211             41
     C           *IN41     IFEQ '0'
     C           U1NGKB    IFEQ 'N'
     C                     ADD  U1N1NM    WN1NM
     C                     ADD  U1N2NM    WN2NM
     C                     ELSE
     C                     ADD  U1S1NM    WN1NM
     C                     ADD  U1S2NM    WN2NM
     C                     END
     C                     END
      *
     C*--------------------------------*
     C*  ..品番別売上集計ファイル..  *
     C*--------------------------------*
     C                     SETOF                     41
     C           KEY6      CHAINMBEPL051             41
     C           *IN41     IFEQ '0'
     C                     Z-ADD#JMM      A       20
     C                     ADD  HSR,A     WZGSU
     C                     Z-ADD1         WTENS
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N40                END
     C                     END
      *
     C*----------------------------------------*
     C*  ..構成品工程別　チェックファイル    *
     C*----------------------------------------*
     C                     SETOF                     11
     C           AGKHIN    CHAINABEWP041             11
     C           *IN11     IFEQ '1'
     C                     MOVE AGKHIN    A#KHIN
     C                     WRITEABEWP041
     C                     END
      *
     C*------------------------------------------*
     C*  ..構成品工程別　月間必要数ファイル    *
     C*------------------------------------------*
     C                     SETOF                     30
     C           KEY3      CHAINABEWP051             30
     C           *IN30     IFEQ '1'
      *
     C                     MOVE WSHIN     A@KHIN
     C                     MOVE AGKOTI    A@KOTI
     C                     Z-ADD@KBMN     A@KBMN
     C                     MOVE @UKER     A@UKER
     C                     Z-ADDAGNGEK    A@GEKN
     C                     Z-ADDWN1NM     A@N1NM
     C                     Z-ADDWN2NM     A@N2NM
     C                     Z-ADDWZGSU     A@ZGSU
     C                     Z-ADDWTENS     A@TENS
     C                     WRITEABEWP051
     C                     ELSE
      *
     C           *IN11     IFEQ '1'
     C                     ADD  WN1NM     A@N1NM
     C                     ADD  WN2NM     A@N2NM
     C                     ADD  WZGSU     A@ZGSU
     C                     ADD  WTENS     A@TENS
     C                     END
      *
     C                     ADD  AGNGEK    A@GEKN
     C                     UPDATABEWP051
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C  N20                END
      *
     C                     END
     C  N10                END
      *
     C                     SETON                     LR
     C                     RETRN
      *
** TB1
0111
