     H            Y.
     F** ABER02 **************************
     F* .. SETTING NUMBER AUTOMATIC HANDLING *
     F* ..  SETTING NUMBER CHANGE BY COMPONENTS PROCESS *
     F* I-HASADA            92.10.01     *
     F************************** ABER02 **
     FAEBPP11 UP  E                    DISK
     FAEBPL02 IF  E           K        DISK
      *
     C           KEY1      KLIST
     C                     KFLD           AGKHN1
     C                     KFLD           AGKHN2
     C                     KFLD           AGKHN3
     C                     KFLD           AGKBMN
     C                     KFLD           AGUKER
      *
     C*----------------------------*
     C*  ..構成品番　マスター..  *
     C*----------------------------*
     C                     Z-ADD0         WNGEK   90
     C           KEY1      SETLLAEBPL021
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAEBPL021                 10
     C           *IN10     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     ADD  AFGEKN    WNGEK
     C                     END
     C                     END
     C  N10                END
      *
     C           AGIKOU    IFEQ '#'
     C                     Z-ADDAGNGEK    AGOGEK
     C                     MOVE *BLANK    AGGEKH
     C                     MOVE *BLANK    AGIKOU
     C                     END
      *
     C                     Z-ADDWNGEK     AGNGEK
     C           AGOGEK    IFNE AGNGEK
     C                     MOVE '*'       AGGEKH
     C                     ELSE
     C                     MOVE *BLANK    AGGEKH
     C                     END
      *
     C           AGLIST    IFEQ *BLANK
     C           AGOGEK    IFEQ AGNGEK
     C                     MOVE '#'       AGLIST
     C                     END
     C                     END
      *
     C                     UPDATAEBPP111
