     H            Y.
     F** ABER01 ******************************
     F* .. SETTING NUMBER AUTOMATIC HANDLING *
     F* .. COMPONENT M/F SETTING NUMBER CHANGE *
     F* I-HASADA                92.10.01     *
     F****************************** ABER01 **
     FAEBPP01 UP  E                    DISK
     FFCEPL01 IF  E           K        DISK
     I            DS
     I                                        1   80AFSKHZ
     I                                        1   40AFSKYY
     I                                        5   60AFSKMM
     I                                        7   80AFSKDD
     I            DS
     I                                        1   80AFKOHZ
     I                                        1   40AFKOYY
     I                                        5   60AFKOMM
     I                                        7   80AFKODD
     I            DS
     I                                        1   60AFTIME
     I                                        1   20AFKOHH
     I                                        3   40AFKOSS
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     C           KEY1      KLIST
     C                     KFLD           AFSHN1
     C                     KFLD           AFSHN2
     C                     KFLD           AFSHN3
      *
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           AFGEKN    IFNE 0
      *
     C                     SETOF                     10
     C                     Z-ADD0         WGEKN   90
     C           KEY1      CHAINFCEPL011             10
     C           *IN10     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     Z-ADDA2GEKN    WGEKN
     C                     END
      *
     C           WGEKN     IFNE AFGEKN
     C                     Z-ADD*DATE     AFKOHZ
     C                     TIME           AFTIME
     C                     MOVEL'ZIDOU'   AFKOME
     C                     Z-ADDWGEKN     AFGEKN
     C                     UPDATAEBPP011
     C                     END
      *
     C                     END
     C                     END
