     H            Y.
     F** ABFR41 **************************************************
     F*  FORD EDI(856) ASN RECEIVED FROM FORD                    *
     F*                                                          *
JW1  F*  JW   2016/04.11 FIX BUG (INCORRECT YEAR)                *
     F************************************************************
     FAB#EP41 IF  E           K        DISK
     FABFPP41 O   E           K        DISK
     F****************************************************
      * SYSTEM TIME & DATE
     I            DS
     I                                        1  120WTMDT
     I                                        1   20WTIHH
     I                                        3   40WTIMM
     I**JW1                                   5   80WDAYY
JW1  I                                        7   80WDAYY
     I                                        9  100WDAMM
     I                                       11  120WDADD
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------------
      *     MAIN ROUTINE
      *--------------------------------------------------------------
      *
     C                     TIME           WTMDT
      *
     C                     READ AB#EP41                  50
      *
     C           *IN50     DOWEQ*OFF
      *
     C                     MOVE A5TPCD    AHTPCD
     C                     MOVE A5TSID    AHTSID
     C                     MOVE A5SPCD    AHSPCD
     C                     MOVE A5REF#    AHREF#
     C                     MOVE A5POR#    AHPOR#
     C                     MOVE A5SIDT    AHSIDT
     C                     MOVE A5STIQ    AHSTIQ
     C                     MOVE A5STID    AHSTID
     C                     MOVE A5IDCD    AHIDCD
     C                     MOVE A5PART    AHPART
     C                     MOVE A5UBM1    AHUBM1
     C                     MOVE A5PKCD    AHPKCD
     C                     MOVE A5QTY1    AHQTY1
     C                     MOVE A5WEIT    AHWEIT
     C                     MOVE A5UBM2    AHUBM2
     C                     MOVE A5EQMT    AHEQMT
     C                     MOVE A5QTY2    AHQTY2
     C                     MOVE A5DLDT    AHDLDT
     C                     MOVE A5TIME    AHTIME
     C                     MOVE A5DATE    AHDATE
     C                     MOVE A5IPAR    AHIPAR
     C                     MOVE A5GWGT    AHGWGT
     C                     MOVE A5CRCD    AHCRCD
     C                     MOVE A5ROSQ    AHROSQ
     C                     MOVE A5ROIQ    AHROIQ
     C                     MOVE A5ROID    AHROID
     C                     MOVE A5ROMC    AHROMC
     C                     MOVE A5ROLQ    AHROLQ
     C                     MOVE A5ROLO    AHROLO
     C                     MOVE A5BOLN    AHBOLN
     C                     MOVE A5PKLS    AHPKLS
     C                     MOVE A5QTY3    AHQTY3
      *
     C**JW1                Z-ADDWDAYY     AHUPDY
JW1  C           2000      ADD  WDAYY     AHUPDY
     C                     Z-ADDWDAMM     AHUPDM
     C                     Z-ADDWDADD     AHUPDD
     C                     Z-ADDWTIHH     AHUPTH
     C                     Z-ADDWTIMM     AHUPTM
      *
     C                     WRITEABFPP411
     C                     CLEARABFPP411
      *
     C                     READ AB#EP41                  50
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*****************************************************************
