     H            Y.
      ** ABFR43 **********************************************
      *  FORD ASN INQUIRY                                    *
      *  JW.      2020.11.16                                 *
      ********************************* ABFR42 ***************
      * F3 - EXIT
      * F12- PREVIOUS SCREEN
      ********************************* AB#RFR ***************
     FABFPW43 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FABFPL42 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
      *
     E                    ERR     1   4 60
      *
     I            DS
     I                                        1   60FDTIME
     I                                        1   20HH1
     I                                        3   40MM1
     I                                        5   60SS1
     I            DS
     I                                        1   80DATE
     I                                        1   20W@CT
     I                                        3   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80DATE2
     I                                        1   40W@YY2
     I                                        5   60W@MM2
     I                                        7   80W@DD2
     I            DS
     I                                        1   80KDATE2
     I                                        1   40KW@YY
     I                                        5   60KW@MM
     I                                        7   80KW@DD
     I            DS
     I                                        1  120#TIME
     I                                        1   20W@HH
     I                                        3   40W@MIN
     I                                        5   60W@SS
      *
      *-----------------------------------------------------------*
      *     M  A  I  N  L  I  N  E                                *
      *-----------------------------------------------------------*
      *
     C                     EXSR @INIT
      *
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      @DSP1
     C           W@ID      CASEQ'02'      @DSP2
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *************************************************************
      * Purpose: Initialize variables.
      *
     C           @INIT     BEGSR
      *
     C                     MOVEL*BLANKS   XMSG1
     C                     MOVEL*BLANKS   XMSG2
     C                     MOVEL'01'      W@ID    2
     C                     TIME           #TIME
     C                     MOVE *DATE     DATE
     C                     Z-ADD2000      W@YY4   40
     C                     ADD  W@YY      W@YY4
     C                     Z-ADD0         RRN     50
      *
     C           KEY12     KLIST
     C                     KFLD           KW@YY   40
     C                     KFLD           KW@MM   20
     C                     KFLD           KW@DD   20
      *
     C                     ENDSR
      *************************************************************
      * Purpose: Display Screen 1 to get Date Range.
      *
     C           @DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANKS   XMSG1
     C                     MOVE *OFF      *IN99
     C                     MOVE *OFF      *IN30
     C                     MOVE *OFF      *IN31
     C                     MOVE *OFF      *IN32
      *
     C           *INKC     IFEQ *ON
     C                     MOVEL'99'      W@ID
     C                     GOTO @END1
     C                     ENDIF
      *
     C                     EXSR CHKSC1
      *
      * if no errors on screen 1, fill subfile
     C           *IN99     IFEQ *OFF
     C                     EXSR FILSFL
      *
     C           RRN       IFGT 0
     C                     MOVEL'02'      W@ID
     C                     ELSE
     C                     MOVELERR,4     XMSG1
     C                     SETON                     313299
     C                     ENDIF
     C                     ENDIF
      *
     C           @END1     ENDSR
      *************************************************************
      * Purpose: Check Screen When ENTER is Pressed.
      *
     C           CHKSC1    BEGSR
      *
      *  check from date...
     C                     MOVE XFMDT     KDATE2
     C           KEY12     CHAINAGDPL12              50
     C           *IN50     IFEQ *ON
     C                     MOVELERR,1     XMSG1
     C                     SETON                     3199
     C                     GOTO @EDSP1
     C                     ENDIF
      *
      *  check to date...
     C                     MOVE XTODT     KDATE2
     C           KEY12     CHAINAGDPL12              50
     C           *IN50     IFEQ *ON
     C                     MOVELERR,2     XMSG1
     C                     SETON                     3299
     C                     GOTO @EDSP1
     C                     ENDIF
      *
      *  compare from date with to date...
     C           XFMDT     IFGT XTODT
     C                     MOVELERR,3     XMSG1
     C                     SETON                     313299
     C                     ENDIF
      *
     C           @EDSP1    ENDSR
      *************************************************************
      * Purpose: Fill subfile with detail within date range.
      *
     C           FILSFL    BEGSR
      *
      * look for records within the specified date range.
     C           XFMDT     SETLLABFPL42
     C                     READ ABFPL42                  51
      *
     C           *IN51     DOWEQ*OFF
      *
      * once the schedule issue date is beyond the specified date range,
      * stop reading records from file.
      *
     C           AHSIDT    IFGT XTODT
     C                     MOVE *ON       *IN51
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         RRN
      *
      * displayed subfile fields...
     C                     MOVELAHREF#    @REF#
     C                     MOVE AHSIDT    @SIDT
     C                     MOVELAHIDCD    @IDCD
     C                     MOVELAHEQMT    @EQMT
     C                     Z-ADDAHQTY3    @QTY3
     C                     MOVELAHUBM2    @UBM2
     C                     Z-ADDAHGWGT    @GWGT
     C                     MOVELAHROID    @ROID
      *
      * hidden fields...
     C                     MOVELAHTPCD    @TPCD
     C                     MOVELAHTSID    @TSID
     C                     MOVELAHSTID    @STID
     C                     MOVELAHPART    @PART
     C                     MOVELAHPKCD    @PKCD
     C                     Z-ADDAHQTY1    @QTY1
     C                     Z-ADDAHWEIT    @WEIT
     C                     Z-ADDAHQTY2    @QTY2
     C                     Z-ADDAHDLDT    @DLDT
     C                     Z-ADDAHTIME    @TIME
     C                     Z-ADDAHDATE    @DATE
     C                     MOVELAHROMC    @ROMC
     C                     MOVELAHROLO    @ROLO
     C                     MOVELAHBOLN    @BOLN
     C                     MOVELAHPKLS    @PKLS
      *
     C                     WRITESFL01
      *
     C                     READ ABFPL42                  51
      *
     C                     ENDDO
      *
     C                     Z-ADDRRN       COUNT   60
      *
     C                     ENDSR
      ************************************************************
      * Purpose: Display Screen 2.
      *
     C           @DSP2     BEGSR
      *
     C                     WRITEFMT90
     C                     MOVEL'1'       *IN70
     C                     EXFMTSFLCTL
     C                     MOVEL*BLANKS   XMSG2
     C                     MOVEL'0'       *IN99
     C                     MOVEL'0'       *IN70
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C           *INKL     WHEQ *ON
     C                     EXSR @CLRSR
     C                     Z-ADD0         RRN
     C                     MOVEL'01'      W@ID
     C                     OTHER
     C                     EXSR CHKSFL
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************
      * Purpose: Clear Subfile.
      *
     C           @CLRSR    BEGSR
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     71
     C                     Z-ADD0         RRN
      *
     C                     ENDSR
      *************************************************************
      * Purpose: Check Subfile for Selected Detail.
      *
     C           CHKSFL    BEGSR
      *
      *
     C           1         DO   COUNT     RRN
      *
     C           RRN       CHAINSFL01                50
     C           *IN50     IFEQ *OFF
     C           SEL       ANDEQ'X'
     C                     EXSR @DSP3
     C           *IN03     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE *BLANK    SEL
     C                     UPDATSFL01
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************
      * Purpose: Display Detail on Screen 3.
      *
     C           @DSP3     BEGSR
      *
     C                     CLEARDSP03
      *
     C                     MOVEL@REF#     SCREF#
     C                     Z-ADD@SIDT     SCSIDT
     C                     MOVEL@IDCD     SCIDCD
     C                     MOVEL@EQMT     SCEQMT
     C                     Z-ADD@QTY3     SCQTY3
     C                     Z-ADD@GWGT     SCGWGT
     C                     MOVEL@UBM2     SCUBM2
     C                     MOVEL@ROID     SCROID
      *
     C                     MOVEL@TPCD     SCTPCD
     C                     MOVEL@TSID     SCTSID
     C                     MOVEL@STID     SCSTID
     C                     MOVEL@PART     SCPART
     C                     MOVEL@PKCD     SCPKCD
     C                     MOVEL@ROMC     SCROMC
     C                     MOVEL@ROLO     SCROLO
     C                     MOVEL@BOLN     SCBOLN
     C                     MOVEL@PKLS     SCPKLS
      *
     C                     Z-ADD@QTY1     SCQTY1
     C                     Z-ADD@QTY2     SCQTY2
     C                     Z-ADD@WEIT     SCWEIT
     C                     Z-ADD@DATE     SCDATE
     C                     Z-ADD@TIME     SCTIME
     C                     Z-ADD@DLDT     SCDLDT
      *
     C                     EXFMTDSP03
      *
     C                     ENDSR
      *************************************************************
** (ERR)
INVALID FROM DATE.
INVALID TO DATE.
FROM DATE SHOULD NOT BE GREATER THAN TO DATE.
THERE IS NO DATA IN THIS DATE RANGE.
