     H            Y.
     F** ABRR04 ********************************************************
     F*  FORD SHIPPING BIN MASTER MAINTENANCE                          *
     F******************************************************************
     FABFPW04 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FABFDL01BIF  E           K        DISK
     FABFBP10 UF  E           K        DISK                      A
JW   FABFBP10BO   E                    DISK
      *------------------------------------------------------------
     E                    CMD     1   1 78
     E                    RUT        50  4
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@DYMD
     I                                        1   40K@DEYY
     I                                        5   60K@DEMM
     I                                        7   80K@DEDD
     I            DS
     I                                        1   80K@NYMD
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1   80@@SYMD
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------------
      *   MAIN
      *------------------------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           K#ADF     KLIST
JW   C                     KFLD           K@ROUT  4
     C                     KFLD           K@NONY  40
     C                     KFLD           K@DOCK  4
      *
     C                     MOVE '01'      @@ID    2
      *
     C                     EXSR #SET
      *
     C           RRN1      IFEQ *ZERO
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #SET      BEGSR
      *-----------------------------------------------
     C                     MOVE *BLANK    RUT
     C                     Z-ADD*ZERO     X       30
     C           *LOVAL    SETLLABFDL01B
     C           *IN90     DOUEQ*ON
     C                     READ ABFDL01B                 90
B01  C           *IN90     IFEQ *OFF
      *
JW   C                     MOVELQAROUT    K@ROUT
     C                     Z-ADDQANONY    K@NONY
     C                     MOVE QADOCK    K@DOCK
      *
     C           K#ADF     SETGTABFDL01B
     C           *IN88     DOUEQ*ON
     C           K#ADF     REDPEABFDL01B                 88
     C           *IN88     IFEQ *ON
     C           K#ADF     SETGTABFDL01B
     C                     LEAVE
     C                     ELSE
%0001C           QASKJY    IFEQ 'D'
%0001C                     ITER
     C                     ENDIF
     C           QAROUT    LOKUPRUT                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C                     MOVE QAROUT    RUT,X
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           K#ADF     SETGTABFDL01B
%0001 *
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C                     MOVE *BLANK    W@ROUT  4
     C           1         DO   50        X
     C           RUT,X     IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     MOVE RUT,X     S@ROUT
     C           S@ROUT    CHAINABFBP10              95
     C           *IN95     IFEQ *OFF
     C                     Z-ADDB1BINN    S@BIN
     C                     ENDIF
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------
     C           #SCRN1    BEGSR
      *-----------------------------------------------
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #CHK1     BEGSR
      *-----------------------------------------------------
     C                     SETOF                     9961
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
      *
     C                     MOVE *OFF      *IN61
     C           S@BIN     IFLT *ZERO
     C           S@BIN     ORGT 9
     C                     SETON                     9961
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #UPD      BEGSR
      *-----------------------------------------------------
     C                     SETOF                     9961
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
      *
     C           S@ROUT    CHAINABFBP10              95
      *
     C                     SELEC
     C           S@BIN     WHEQ *ZERO
     C           *IN95     ANDEQ*OFF
     C                     DELETABFBP101
JW   C                     MOVEL#PGM      B1UPDP
JW   C                     MOVE 'D'       B1UPDP
JW   C                     WRITEABFB10B1                   SAVE
      *
     C           S@BIN     WHNE *ZERO
     C                     MOVE S@ROUT    B1ROUT
     C                     Z-ADDS@BIN     B1BINN
     C                     MOVEL#USER     B1USER
     C                     Z-ADD*DATE     B1UPDT
     C                     TIME           B1UPTM
     C  N95                UPDATABFBP101
     C   95                WRITEABFBP101
      *
JW   C                     MOVEL#PGM      B1UPDP
JW   C  N95                MOVE 'U'       B1UPDP
JW   C   95                MOVE 'A'       B1UPDP
JW   C                     WRITEABFB10B1                   SAVE
     C                     ENDSL
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
** CMD
 F1:END    F5:UPDATE
