     H            Y.
     F** ABHR24 ********************************************
     F*PUBLICATION DATA CHECK  BY INTRA-PROCESS KANBAN EACH CONDITION
     F* A.IDOTA                           1995.06.02       *
     F******************************************** ABHR24 **
      *かんばん発行データ*
     FABHWPIA IF  F     512            DISK
     FABHWPIB IF  F     512            DISK
      *
     IABHWPIA AA
     I                                        1 512 AAA
     IABHWPIB AA
     I                                        1 512 BBB
      *****************************************************************
      * ＰＡＲＭ                                             MAIN   *
      *****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           NBMN    4
     C                     PARM           CHEK    1
      *****************************************************************
      * 初期設定                                             MAIN   *
      *****************************************************************
     C                     MOVE *BLANK    CHEK
     C                     SETOF                     01
      *****************************************************************
      * データ有無ＣＨＥＫ                                   MAIN   *
      *****************************************************************
     C           NBMN      IFNE '0111'
     C                     GOTO END
     C                     END
      *
     C           NBMN      IFEQ '0111'
     C                     READ ABHWPIA                  01
     C                     READ ABHWPIB                  02
     C                     END
      *
     C           *IN01     IFEQ '0'
     C           *IN02     OREQ '0'
     C                     MOVE '*'       CHEK
     C                     SETON                     U1
     C                     END
      *
     C           END       TAG
     C                     SETON                     LR
     C                     RETRN
