     H            Y.
     F** ABHR60 ******************************************************
     F*  ENTER THE BREAKDOWN OF THE ISSUANCE                         *
     F*       SEEK                      2023.03.27                   *
     F****************************************************************
     FABHPW60 CF  E                    WORKSTN
      ****************************************************************
      * 使用標識                                                   *
      *        KC(F3)   : 終了                                     *
      *        KE(F5)   : 選択確定                                 *
      *        31-32    : 入力値エラー（反転表示）                 *
      *        90       : 汎用標識                                 *
      *        99       : 画面エラー代表標識                       *
      ****************************************************************
     E                    MSG     1   9 70               エラーＭＳＧ
     E                    TAB1    1   8  1 0 TAB1X  20   理由
     E                    TAB2    1  15  2 0 TAB2X  10   部署
     E                    A16        16  1               ワーク
      ****************************************************************
      * パラメータ                                                 *
      ****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           P0LOTH 15        前回その他理由
     C                     PARM           P0RENO  10       今回理由№
     C                     PARM           P0RES  20        今回理由
     C                     PARM           P0SEC  16        今回部署
     C                     PARM           P0FKY   3        Ｆキー
      ****************************************************************
      * キーリスト                                                 *
      ****************************************************************
     C*
      ****************************************************************
      * メイン                                                     *
      ****************************************************************
     C* 初期処理
     C                     EXSR #INIT
     C* 処理
B01  C                     DO   *HIVAL
B02  C                     SELEC
     C           W0CTL     WHEQ '*END'
     C                     LEAVE
     C           W0CTL     WHEQ '*DSP1'
     C                     EXSR #DSP1
     C           W0CTL     WHEQ '*DSP2'
     C                     EXSR #DSP2
     C           W0CTL     WHEQ '*DSP3'
     C                     EXSR #DSP3
E02  C                     ENDSL
E01  C                     ENDDO
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVEL'F03'     P0FKY            Ｆキー
     C           *INKE     WHEQ *ON
     C                     MOVEL'F05'     P0FKY            Ｆキー
     C                     ENDSL
     C* 終了
     C                     MOVE *ON       *INLR
     C                     RETRN
      ****************************************************************
      * 初期処理                                                   *
      ****************************************************************
     C           #INIT     BEGSR
     C* 画面１＿セット
     C                     EXSR #SET1
     C*
     C                     MOVEL'*DSP1'   W0CTL   5        処理制御
     C*
     C                     ENDSR
      ****************************************************************
      * 画面１                                                     *
      ****************************************************************
     C           #DSP1     BEGSR
     C* 画面１＿表示
B01  C                     DO   *HIVAL
     C                     EXFMTDSP1
     C* 前画面
B02  C           *INKC     IFEQ *ON
     C                     MOVEL'*END '   W0CTL
     C                     LEAVE
E02  C                     ENDIF
     C*
     C                     MOVE *OFF      *IN31
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C* 画面１＿チェック
     C                     EXSR #CHK1
     C   99                ITER
     C* 画面２，３＿セット
B02  C           D1NO      IFEQ 8
     C                     MOVEL'*DSP3'   W0CTL
     C                     EXSR #SET3
X02  C                     ELSE
     C                     MOVEL'*DSP2'   W0CTL
     C                     EXSR #SET2
E02  C                     ENDIF
     C                     LEAVE
     C*
E01  C                     ENDDO
     C*
     C                     ENDSR
      ****************************************************************
      * 画面２                                                     *
      ****************************************************************
     C           #DSP2     BEGSR
     C* 画面２＿表示
B01  C                     DO   *HIVAL
     C                     EXFMTDSP2
     C*
     C                     MOVEA'00'      *IN,31            *IN31-*IN32
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C* 前画面
B02  C           *INKC     IFEQ *ON
B03  C           D1NO      IFEQ 8
     C                     MOVEL'*DSP3'   W0CTL
X03  C                     ELSE
     C                     MOVEL'*DSP1'   W0CTL
E03  C                     ENDIF
     C                     LEAVE
E02  C                     ENDIF
     C* 画面２＿チェック
     C                     EXSR #CHK2
     C   99                ITER
     C  NKE                ITER
     C* パラーメータ＿セット
     C                     EXSR #PRM
     C                     MOVEL'*END '   W0CTL
     C                     LEAVE
     C*
E01  C                     ENDDO
     C*
     C                     ENDSR
      ****************************************************************
      * 画面３                                                     *
      ****************************************************************
     C           #DSP3     BEGSR
     C* 画面３＿表示
B01  C                     DO   *HIVAL
     C                     EXFMTDSP3
     C*
     C                     MOVEA'00'      *IN,31            *IN31-*IN32
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C* 前画面
B02  C           *INKC     IFEQ *ON
     C                     MOVEL'*DSP1'   W0CTL
     C                     LEAVE
E02  C                     ENDIF
     C* 画面３＿チェック
     C                     EXSR #CHK3
     C   99                ITER
     C  NKE                ITER
     C* 画面２＿セット
     C                     EXSR #SET2
     C                     MOVEL'*DSP2'   W0CTL
     C                     LEAVE
     C*
E01  C                     ENDDO
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面１のセット                                             *
     C****************************************************************
     C           #SET1     BEGSR
     C*
     C                     Z-ADD*ZERO     D1NO              NO-1
     C*
     C                     MOVE *OFF      *IN31
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面１のチェック                                           *
     C****************************************************************
     C           #CHK1     BEGSR
     C*  NO-1
     C                     MOVE *BLANK    W0RES  20        理由
B01  C           D1NO      IFEQ *ZERO
     C                     MOVE *ON       *IN31
B02  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,1     DXERR
     C                     MOVE *ON       *IN99
E02  C                     ENDIF
X01  C                     ELSE
     C* ＿有効値
     C           D1NO      LOKUPTAB1      TAB1X          90*EQ
B02  C           *IN90     IFEQ *OFF
     C                     MOVE *ON       *IN31
B03  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,2     DXERR
     C                     MOVE *ON       *IN99
E03  C                     ENDIF
X02  C                     ELSE
     C                     MOVELTAB1X     W0RES
E02  C                     ENDIF
E01  C                     ENDIF
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面２のセット                                             *
     C****************************************************************
     C           #SET2     BEGSR
     C*
     C                     Z-ADD*ZERO     D2NO              NO-2
     C                     MOVE *BLANK    D2SEC             SECTION
     C*
     C                     MOVEA'00'      *IN,31            *IN31-*IN32
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面２のチェック                                           *
     C****************************************************************
     C           #CHK2     BEGSR
     C*  NO-2
     C                     MOVE *BLANK    W0SEC  16        部署
B01  C           D2NO      IFEQ *ZERO
     C                     MOVE *ON       *IN31
B02  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,3     DXERR
     C                     MOVE *ON       *IN99
E02  C                     ENDIF
X01  C                     ELSE
     C* ＿有効値
     C           D2NO      LOKUPTAB2      TAB2X          90*EQ
B02  C           *IN90     IFEQ *OFF
     C                     MOVE *ON       *IN31
B03  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,4     DXERR
     C                     MOVE *ON       *IN99
E03  C                     ENDIF
X02  C                     ELSE
     C                     MOVELTAB2X     W0SEC
E02  C                     ENDIF
E01  C                     ENDIF
     C*  SECTION
B01  C                     SELEC
     C           D2NO      WHEQ 15
B02  C           D2SEC     IFEQ *BLANK
     C                     MOVE *ON       *IN32
B03  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,5     DXERR
     C                     MOVE *ON       *IN99
E03  C                     ENDIF
X02  C                     ELSE
     C* ＿画面１_№= 4(OVERHAUL...)のときの入力値調整
B03  C           D1NO      IFEQ 4
     C                     MOVEAD2SEC     A16
     C                     MOVEA*BLANK    A16,12
     C                     MOVEAA16       D2SEC
E03  C                     ENDIF
     C                     MOVELD2SEC     W0SEC
E02  C                     ENDIF
     C*
     C                     OTHER
B02  C           D2SEC     IFNE *BLANK
     C                     MOVE *ON       *IN32
B03  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,6     DXERR
     C                     MOVE *ON       *IN99
E03  C                     ENDIF
E02  C                     ENDIF
E01  C                     ENDSL
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面３のセット                                             *
     C****************************************************************
     C           #SET3     BEGSR
     C*
     C                     MOVE *BLANK    D3NO              NO-3
     C                     MOVE *BLANK    D3RES             REASON
     C*
     C                     MOVEA'00'      *IN,31            *IN31-*IN32
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    DXERR            エラーＭＳＧ
     C*
     C                     ENDSR
     C****************************************************************
     C* 画面３のチェック                                           *
     C****************************************************************
     C           #CHK3     BEGSR
     C*  NO-3
B01  C           D3NO      IFEQ *BLANK
     C                     MOVE *ON       *IN31
B02  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,7     DXERR
     C                     MOVE *ON       *IN99
E02  C                     ENDIF
X01  C                     ELSE
     C* ＿有効値
B02  C           D3NO      IFNE '0'
     C           D3NO      ANDNE'1'
     C                     MOVE *ON       *IN31
B03  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,8     DXERR
     C                     MOVE *ON       *IN99
E03  C                     ENDIF
E02  C                     ENDIF
E01  C                     ENDIF
     C*  REASON
B01  C           D3NO      IFEQ '1'
     C           D3RES     ANDEQ*BLANK
     C                     MOVELP0LOTH    D3RES
E01  C                     ENDIF
     C*
B01  C           D3RES     IFEQ *BLANK
     C                     MOVE *ON       *IN32
B02  C           *IN99     IFEQ *OFF
     C                     MOVELMSG,9     DXERR
     C                     MOVE *ON       *IN99
E02  C                     ENDIF
E01  C                     ENDIF
     C*
     C                     MOVE *BLANK    W0RES
     C                     MOVELD3RES     W0RES
     C*
     C                     ENDSR
     C****************************************************************
     C* パラメータのセット                                         *
     C****************************************************************
     C           #PRM      BEGSR
     C*
     C                     Z-ADDD1NO      P0RENO           今回理由№
     C                     MOVELW0RES     P0RES            今回理由
     C                     MOVELW0SEC     P0SEC            今回部署
     C*
     C                     ENDSR
**  MSG (エラーＭＳＧ)
INPUT NUMBER.                                                             1
INVALID NUMBER.                                                           2
INPUT NUMBER.                                                             3
INVALID NUMBER.                                                           4
INPUT OTHER SECTION.                                                      5
WHEN THE NUMBER IS OTHER THAN 1, IT CANNOT BE ENTERED.                    6
PLEASE ENTER "1" OR "0"                                                   7
INVALID.                                                                  8
INPUT OTHER REASON.                                                       9
**  TAB1/TAB1X (理由)
1MACHINE BEHIND                                                           1
2SAFETY STOCK                                                             2
3WIRE USE UP                                                              3
4OVERHAUL/BUILD AHEAD                                                     4
5DEFECT CHECK                                                             5
6LOCATION CHANGE                                                          6
7VOLUME CHANGE                                                            7
8OTHER                                                                    8
**  TAB2/TAB2X (部署)
01M6                                                                      1
02M8                                                                      2
03M10                                                                     3
04NF/TP/INJ                                                               4
05BZ                                                                      5
06DS                                                                      6
07JC                                                                      7
08HT                                                                      8
09QD                                                                      9
10PC                                                                     10
11PM                                                                     11
12TPS                                                                    12
13SALES                                                                  13
14TOOL ROOM                                                              14
15OTHER                                                                  15
