     H            Y.
     F** ABHR10 ****************************
     F* INQUIRY OF PRECEDING PROCESS PICK-UP LOT QUANTITY *
     F* 1995.01.11 A.IDOTA *
     F**************************** ABHR10 **
     FABHPW10 CF  E                    WORKSTN
     FAAJTL14 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     E                    ER      1   5 60               d[ｰ xｮﾈｰﾆﾞ
      **
     E                    HIN         7 14               設定品番
     E                    SET         7  9 0             設定数
     E                    KNN         7 16               かんばん種類
     E                    BMN         7  4 0             部門コード
     E                    SYO         7  5 0             収容数
     E                    LOT         7  9 0             ロット数量
      **
     I            DS
     I                                        1  14 HINBAN
     I                                        1   5 CJHIN1
     I                                        6   6 B01
     I                                        7  11 CJHIN2
     I                                       12  12 B02
     I                                       13  14 CJHIN3
     I            DS
     I                                        1   6 BANCH
     I                                        1   1 BANCH1
     I                                        2   3 BANCH2
     I                                        4   5 BANCH3
     I                                        6   6 BANCH4
     I            DS
     I                                        1  100YUKOHZ
     I                                        3   80YUKDAY
     I                                        1   40YUKOYY
     I                                        5   60YUKOMM
     I                                        7   80YUKODD
     I                                        9  100YUKOBN
     I            DS
     I                                        1  100ZERO8
     I                                        1   40ZERO1
     I                                        5   60ZERO2
     I                                        7   80ZERO3
     I                                        9  100ZERO4
     I            DS
     I                                        1  20 T3NAMK
     I                                        1  15 KANJI1
     I            DS
     I                                        1  16 KANNA
     I                                        1  16 KANJI2
     I            DS
     I                                        1   6 MBANCH
     I                                        1   1 CJMBN1
     I                                        2   3 CJMBN2
     I                                        4   5 CJMBN3
     I                                        6   6 CJMBN4
     I            DS
     I                                        1   80A2SKHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      **設定品番**
     I            DS
     I                                        1  98 HIN
     I                                        1  14 HINB01
     I                                       15  28 HINB02
     I                                       29  42 HINB03
     I                                       43  56 HINB04
     I                                       57  70 HINB05
     I                                       71  84 HINB06
     I                                       85  98 HINB07
      **月間設定数**
     I            DS
     I                                        1  630SET
     I                                        1   90SETI01
     I                                       10  180SETI02
     I                                       19  270SETI03
     I                                       28  360SETI04
     I                                       37  450SETI05
     I                                       46  540SETI06
     I                                       55  630SETI07
      **かんばん種類**
     I            DS
     I                                        1 112 KNN
     I                                        1  16 KANN01
     I                                       17  32 KANN02
     I                                       33  48 KANN03
     I                                       49  64 KANN04
     I                                       65  80 KANN05
     I                                       81  96 KANN06
     I                                       97 112 KANN07
      **部門コード**
     I            DS
     I                                        1  280BMN
     I                                        1   40BMON01
     I                                        5   80BMON02
     I                                        9  120BMON03
     I                                       13  160BMON04
     I                                       17  200BMON05
     I                                       21  240BMON06
     I                                       25  280BMON07
      **収容数**
     I            DS
     I                                        1  350SYO
     I                                        1   50SYUY01
     I                                        6  100SYUY02
     I                                       11  150SYUY03
     I                                       16  200SYUY04
     I                                       21  250SYUY05
     I                                       26  300SYUY06
     I                                       31  350SYUY07
      **ロット数量**
     I            DS
     I                                        1  630LOT
     I                                        1   90LOTS01
     I                                       10  180LOTS02
     I                                       19  270LOTS03
     I                                       28  360LOTS04
     I                                       37  450LOTS05
     I                                       46  540LOTS06
     I                                       55  630LOTS07
      ****************************
      *     PARAMATER CECTION    *
      ****************************
     C           *ENTRY    PLIST
     C                     PARM           BNCH1   1
     C                     PARM           BNCH2   2
     C                     PARM           BNCH3   2
     C                     PARM           BNCH4   1
     C                     PARM           YUKOY   4
     C                     PARM           YUKOM   2
     C                     PARM           YUKOD   2
     C                     PARM           YUKOB   2
     C                     PARM           @WNKOJ  4
     C                     PARM           @WNMEI 16
     C                     PARM           @DSDI  14
     C                     PARM           @DSPL   9
     C                     PARM           @KMEI  10
     C                     PARM           @MKOT   3
     C                     PARM           @WMMEI 16
     C                     PARM           @MKBN   3
     C                     PARM           @WMTK   9
      **
     C                     MOVE BNCH1     BANCH1
     C                     MOVE BNCH2     BANCH2
     C                     MOVE BNCH3     BANCH3
     C                     MOVE BNCH4     BANCH4
     C                     MOVE YUKOY     YUKOYY
     C                     MOVE YUKOM     YUKOMM
     C                     MOVE YUKOD     YUKODD
     C                     MOVE YUKOB     YUKOBN
     C                     MOVE @WNKOJ    WNKOJ
     C                     MOVE @WNMEI    WNMEI
     C                     MOVE @DSDI     DSDI
     C                     MOVE @DSPL     DSPL
     C                     MOVE @KMEI     M6KMEI
     C                     MOVE @MKOT     M6MKOT
     C                     MOVE @WMMEI    WMMEI
     C                     MOVE M6MKBN    @MKBN
     C                     MOVE @WMTK     WMTK
      ****************************
      *  MOVE CHARACTER FOR DS   *
      ****************************
     C                     MOVE '-'       B01
     C                     MOVE '-'       B02
     C                     BITOF'01237'   OE      1
     C                     BITON'456'     OE
     C                     BITOF'0123'    OF      1
     C                     BITON'4567'    OF
      ****************************
      *        CLEAR FIELD       *
      ****************************
     C           STEP1     TAG
     C                     SETOF                     101112
     C                     MOVE *BLANK    HIN
     C                     MOVE *BLANK    KNN
     C                     Z-ADD0         SYO
     C                     Z-ADD0         LOT
     C                     Z-ADD0         SET
     C                     Z-ADD0         BMN
      ********* POINTER SET ********
     C           KEY2      KLIST
     C                     KFLD           BANCH1
     C                     KFLD           BANCH2
     C                     KFLD           BANCH3
     C                     KFLD           BANCH4
     C                     KFLD           BLNK1
     C                     KFLD           BLNK2
     C                     KFLD           BLNK3
     C                     KFLD           ZERO1
     C                     KFLD           ZERO2
     C                     KFLD           ZERO3
     C                     KFLD           ZERO4
     C                     MOVE *BLANK    BLNK1   5
     C                     MOVE *BLANK    BLNK2   5
     C                     MOVE *BLANK    BLNK3   2
     C                     Z-ADD0         ZERO1
     C                     Z-ADD0         ZERO2
     C                     Z-ADD0         ZERO3
     C                     Z-ADD0         ZERO4
     C                     MOVE *BLANK    SW      1
     C           KEY2      SETLLAAJTL141
      **
     C           STEP6     TAG
     C                     Z-ADD0         I
      **
     C           STEP5     TAG
     C                     READ AAJTL14                  10
     C           *IN10     CABEQ'1'       STEP2
      *****  NOT SAME BANCHI  *****
     C                     SETOF                     06
     C           BANCH     IFNE MBANCH
     C                     SETON                     06    CHANGE BANCH
     C           I         SUB  1         I
     C                     READPAAJTL14                  05NOT USE
     C           I         IFEQ 0
     C           SW        IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     END
     C                     END
     C                     GOTO STEP3
     C                     END
      ******   SAME HINBAN   ******
     C           CJAKHZ    IFNE 0
     C           CJAKHZ    CABLEYUKDAY    STEP5
     C                     END
     C           CJCHHZ    CABLTYUKDAY    STEP5
     C           I         ADD  1         I       20
      **
     C           KEY1      KLIST
     C                     KFLD           CJKDAI
     C                     KFLD           CJKSYO
     C           KEY1      CHAINGCMPL311             11
     C           *IN11     IFEQ '0'
     C                     MOVELT3NAMN    KANJI2
     C           T3SKJY    IFEQ 'D'
     C                     MOVEL'INDSCT'  KNN,I
     C                     ELSE
     C                     MOVELKANNA     KNN,I
     C                     END
     C                     ELSE
     C                     MOVEL'INDSCT'  KNN,I
     C                     END
     C                     MOVELHINBAN    HIN,I
     C                     Z-ADDCJBMON    BMN,I
     C                     Z-ADDCJSYUY    SYO,I
     C                     Z-ADDCJSLOT    LOT,I
      **月間設定数量**
     C           KEY3      KLIST
     C                     KFLD           CJHIN1
     C                     KFLD           CJHIN2
     C                     KFLD           CJHIN3
      *
     C                     SETOF                     50
     C           KEY3      CHAINFCEPL011             50
     C           A2GSKD    IFEQ 'D'
     C           A2SKHZ    ANDLE*DATE
      *
     C                     ELSE
     C                     Z-ADDA2GEKN    SET,I
     C                     END
      **
     C                     MOVE '*'       SW
     C           I         CABGE7         STEP3
     C                     GOTO STEP5
     C********* (*IN10='1') ********
     C           STEP2     TAG
     C           *HIVAL    SETLLAAJTL141
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C********* OUT GAMEN ********
     C           STEP3     TAG
     C                     EXFMTABHPW101
     C                     SETOF                     99
     C********* (CMD3='1') RETURN GAMEN1 **********
     C           *INKC     IFEQ '1'
     C                     GOTO PGMEND
     C                     END
     C********* (*IN03='1') R-UP **********
     C           *IN03     IFEQ '1'
     C           *IN06     CABEQ'1'       STEP3
     C           *IN10     CABEQ'1'       STEP2
     C                     GOTO STEP6
     C                     END
     C********* (*IN04='1') R-DWN **********
     C           *IN04     IFEQ '1'
     C           *IN06     CABEQ'1'       STEP3
     C           I         ADD  7         J       20
     C           STEP4     TAG
     C                     READPAAJTL14                  12
     C           *IN12     IFEQ '1'
     C           *LOVAL    SETGTAAJTL141
     C                     SETON                     99
     C                     MOVELER,4      MSG
     C                     GOTO STEP3
     C                     END
     C           CJAKHZ    IFNE 0
     C           CJAKHZ    CABLEYUKDAY    STEP4
     C                     END
     C           CJCHHZ    CABLTYUKDAY    STEP4
     C           J         SUB  1         J
     C           J         CABGE1         STEP4
     C                     GOTO STEP6
     C                     END
     C********* ENTER **********
     C                     GOTO STEP3
     C**************************
     C*   PROGRAM       END    *
     C**************************
     C           PGMEND    TAG
     C                     SETON                     LR
     C                     RETRN
**  MSG (MESAAGE)
E-01 SETTING PART NO RETRIEVAL LOCATION CODE ISN'T INPUT
E-02 EFFECTIVE KANBAN DAY IS WRONG
M-03 THIS SCREEN IS THE LAST DATA OF A FILE.
M-04 THIS SCREEN IS THE FIRST DATA OF A FILE.
E-05 IN THIS SETTING P/N RETRIEVAL LOC CD,NO APPLICABLE P/N
