     H            Y.
     F** ABMR25 *********************************************
     F*設定数自動処理　工程内かんばんマスタ更新           *
     F*     HOTTA.              2018.06.11                  *
     F*******************************************************
     FABHPP01 IF  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FABHWP9A O   F    1024            DISK
      *
     E                    KO          4  3               工程
     E******              WIR         4  1               箱色
     I            DS
     I                                        1  12 KO
     I                                        1   3 M6AKT1
     I                                        4   6 M6AKT2
     I                                        7   9 M6AKT3
     I                                       10  12 M6AKT4
     I******                                 13  15 M6AKT5
     I******      DS
     I******                                  1   4 WIR
     I******                                  1   1 M6IRO1
     I******                                  2   2 M6IRO2
     I******                                  3   3 M6IRO3
     I******                                  4   4 M6IRO4
     C           1         SETLLABHPP011
     C                     READ ABHPP011                 21
     C           *IN21     DOWEQ'0'
     C           M6SKJY    IFEQ ' '
     C           M6STMM    ANDEQ99
     C                     EXSR #SB200
     C                     ENDIF
     C                     READ ABHPP011                 21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *工程内かんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
      **箱色**
     C           KEYFC1    KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
      *
     C                     SETOF                     90
     C                     Z-ADD1         X       10
     C                     Z-ADD4         Z       10
     C           1         DO   4         X
     C           KEYFC1    CHAINFCEPL01              90
     C           *IN90     IFEQ '0'
     C           A2GSKD    ANDEQ' '
     C           KO,Z      IFNE *BLANK
     C*****      WIR,Z     IFEQ *BLANK
     C                     EXSR #SB400
     C                     EXCPTDT
     C                     LEAVE
     C*****                ELSE
     C*****                LEAVE
     C*****                END
     C                     END
     C                     END
     C                     SUB  1         Z
     C                     END
     C*
     CSR         ESB200    ENDSR
      *---------------------------*
      *工程マスター検索　       *
      *---------------------------*
     CSR         #SB400    BEGSR
      *
     C           AAMRSX    PLIST
     C                     PARM           O@HIN1  5
     C                     PARM           O@HIN2  5
     C                     PARM           O@HIN3  2
     C                     PARM           O@JBN1  1
     C                     PARM           O@JBN2  2
     C                     PARM           O@JBN3  2
     C                     PARM           O@JBN4  1
     C                     PARM           PZBMON  4
     C                     PARM           PZKOTE  3
      *
     C                     MOVE M6HIN1    O@HIN1  5
     C                     MOVE M6HIN2    O@HIN2  5
     C                     MOVE M6HIN3    O@HIN3  2
     C                     MOVE M6JBN1    O@JBN1  1
     C                     MOVE M6JBN2    O@JBN2  2
     C                     MOVE M6JBN3    O@JBN3  2
     C                     MOVE M6JBN4    O@JBN4  1
     C*
     C                     MOVE *BLANK    PZBMON
     C                     MOVE *BLANK    PZKOTE
     C                     CALL 'AAMRSX'  AAMRSX
     C                     MOVELPZBMON    W1BMON  4
     C                     MOVELPZKOTE    W1KOTE  3
     C***
     C*
     CSR         ESB400    ENDSR
     OABHWP9A E                DT
     O                                      '="'
     O                         M6JBN1
     O                         M6JBN2
     O                         M6JBN3
     O                         M6JBN4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M6HIN1
     O                         M6HIN2
     O                         M6HIN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M6BMON
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         M6MTK1
     O                         M6MTK2
     O                         M6MTK3
     O                         M6MTK4
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         W1BMON
     O                                      '"'
     O                                      ','
     O                         W1KOTE
     O                                      ','
     O                         M6AKT1
     O                                      ','
     O                         M6AKT2
     O                                      ','
     O                         M6AKT3
     O                                      ','
     O                         M6AKT4
     O                                      ','
     O                         M6IRO1
     O                                      ','
     O                         M6IRO2
     O                                      ','
     O                         M6IRO3
     O                                      ','
     O                         M6IRO4
