     H            Y.
     F** ABMR55 ***************************
     F* NO PART M/F LIST
     F*    HOTTA.         2018.10.16      *
     F*************************************
     FABMWP54 IF  E           K        DISK
     FABMPR55 O   E             55     PRINTER
      *
      *--------------------------------------------------------*
      *    パラメータＴＲＡＮＳＵＦＥＲ
      *--------------------------------------------------------*
      *
     C                     Z-ADDUDATE     @HYMD
     C                     WRITEABMPR551
     C                     SETOF                     55
      *
     C                     READ ABMWP541                 80
     C           *IN80     DOWEQ'0'
     C           *IN55     IFEQ '1'
     C                     WRITEABMPR551
     C                     SETOF                     55
     C                     ENDIF
     C                     EXSR #DTOUT
     C                     READ ABMWP541                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*
      *--------------------------------------------------------*
      *                                                        *
      *--------------------------------------------------------*
     CSR         #DTOUT    BEGSR
      *
     C                     MOVELW1TOKU    @TOKU
     C                     MOVELW1NONY    @NOYN
     C                     MOVELW1NKOJ    @KOJ
     C                     MOVELW1NUKE    @UKEC
     C                     MOVEL*BLANK    @MHIN
     C           W1MHN1    CAT  '-':0     @MHIN
     C           @MHIN     CAT  W1MHN2:0  @MHIN
     C           @MHIN     CAT  '-':0     @MHIN
     C           @MHIN     CAT  W1MHN3:0  @MHIN
     C                     MOVEL*BLANK    @SHIN
     C           W1SHN1    CAT  '-':0     @SHIN
     C           @SHIN     CAT  W1SHN2:0  @SHIN
     C           @SHIN     CAT  '-':0     @SHIN
     C           @SHIN     CAT  W1SHN3:0  @SHIN
     C                     Z-ADDW1NNNM    @NNNM
     C                     Z-ADDW11NNM    @1NNM
     C                     Z-ADDW12NNM    @2NNM
      *
     C                     WRITEABMPR552
      *
     CSR         EDTOUT    ENDSR
