     H            Y.
      ** ABMRB5 ********************************************
      *  LOT SIZE SETTING
      *       HOTTA.            2018.09.19
      ******************************************************
     FABMPWC5 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FABMPPC5 UF  E           K        DISK                      A
      *---------------------------------------------------
     E                    ERR     1  15 60
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        1   20WTIMH
     I                                        3   40WTIMM
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      * ----------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P1BMON  4
     C                     PARM           P1KOTE  3
      *
     C           KEYB51    KLIST
     C                     KFLD           K1BMON  4
     C                     KFLD           K1KOTE  3
     C           KEYB52    KLIST
     C                     KFLD           K1BMON  4
     C                     KFLD           K1KOTE  3
     C                     KFLD           K2HTSU  51
     C                     MOVELP1BMON    K1BMON
     C                     MOVELP1KOTE    K1KOTE
      *
     C                     TIME           WWTIME
      ******************************************************
      *  MAIN
      ******************************************************
     C*
     C                     EXSR @S1INT
     C                     EXSR @S1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITEFMT090
     C                     Z-ADDW#RCN1    #RCN01
     C                     EXFMTCTL010
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RCN1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
      * add new
     C           *INKH     IFEQ *ON
     C                     EXSR @S2ADD
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
     C                     END
      * change
     C                     EXSR @S2CHG
     C   KA                LEAVE
     C                     EXSR @S1INT
     C                     EXSR @S1SET
     C                     ITER
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*----------------------------------------------------*
      *  1ST SCREEN INITIALIZE
     C*----------------------------------------------------*
     C           @S1INT    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
      *
     C                     Z-ADD1         W#RCN1  40
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN69
     C                     MOVELP1BMON    C1BMON
     C                     MOVELP1KOTE    C1KOTE
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  SET
     C*----------------------------------------------------*
     C           @S1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C           KEYB51    SETLLABMPPC5
      *
     C                     DO   *HIVAL
      *
     C           KEYB51    READEABMPPC5             N    98
     C   98                LEAVE
     C           BHSKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     CLEARSFL010
     C*
     C                     MOVELBHPTAN    S1PTAN
     C                     Z-ADDBHHTSU    S1HTSU
     C                     SELEC
     C           BHFUGO    WHEQ '1'
     C                     MOVEL'< '      S1FUGO
     C           BHFUGO    WHEQ '2'
     C                     MOVEL'> '      S1FUGO
     C           BHFUGO    WHEQ '3'
     C                     MOVEL'= '      S1FUGO
     C           BHFUGO    WHEQ '4'
     C                     MOVEL'<='      S1FUGO
     C           BHFUGO    WHEQ '5'
     C                     MOVEL'>='      S1FUGO
     C           BHFUGO    WHEQ '6'
     C                     MOVEL'<>'      S1FUGO
     C                     ENDSL
     C                     MOVELBHFUGO    H1FUGO
     C                     Z-ADDBHLOT     S1LOT
     C*
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C*
     C                     ENDDO
     C*
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL010
     C                     Z-ADD1         RRN1
     C                     MOVEL*ON       *IN31
     C                     WRITESFL010
     C                     MOVEL*ON       *IN69
     C                     MOVELERR,1     MSG
     C                     MOVEL*OFF      *IN31
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  ADD NEW RECORD
     C*----------------------------------------------------*
     C           @S2ADD    BEGSR
      *
     C                     EXSR @S2INT
     C                     MOVEL'ADD'     F2ACTN    P
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C                     MOVEL*OFF      *IN69
     C                     EXSR @S2CHK
     C           *IN69     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR @ADDF
     C           *IN69     IFEQ *OFF
     C                     LEAVE
     C                     END
     C                     END
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITIAL SET TO FMT020
     C*----------------------------------------------------*
     C           @S2INT    BEGSR
     C*
     C                     SETOF                     515253
     C                     SETOF                     546162
     C                     SETOF                     636469
     C*
     C                     MOVEL*BLANK    F2PTAN
     C                     Z-ADD*ZERO     F2HTSU
     C                     MOVEL*BLANK    F2FUGO
     C                     Z-ADD*ZERO     F2LOT
     C*
     C                     MOVEL*BLANK    MSG
     C*
     C                     ENDSR
     C*----------------------------------------------------*
     C*  CHECK FMT020
     C*----------------------------------------------------*
     C           @S2CHK    BEGSR
     C*
     C                     SETOF                     515253
     C                     SETOF                     54
     C                     MOVEL*BLANK    MSG
     C*
     C                     DO
     C*
     C           F2PTAN    IFEQ *BLANK
     C                     SETON                     5169
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C*
     C           F2HTSU    IFEQ *ZERO
     C                     SETON                     5269
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     END
     C                     END
     C*
     C           F2FUGO    IFGE '1'
     C           F2FUGO    ANDLE'6'
     C                     ELSE
     C                     SETON                     5369
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
     C                     END
     C                     END
     C*
     C           F2LOT     IFEQ *ZERO
     C                     SETON                     5469
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,5     MSG
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  WRITE NEW RECORD
     C*----------------------------------------------------*
     C           @ADDF     BEGSR
      *
     C                     DO
      *
TCHK1C*
TCHK1C                     MOVEL*OFF      W@IN98  1
     C                     Z-ADDF2HTSU    K2HTSU
TCHK1C           KEYB52    SETLLABMPPC5
TCHK1C                     DO   *HIVAL
TCHK1C           KEYB52    READEABMPPC5                  98
TCHK1C   98                LEAVE
TCHK1C           F2FUGO    IFEQ BHFUGO
TCHK1C           F2LOT     ANDEQBHLOT
TCHK1C           BHSKJY    IFNE *BLANK
TCHK1C                     MOVEL*ON       W@IN98
TCHK1C                     MOVEL*ON       *IN98
TCHK1C                     END
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C                     ENDDO
TCHK1C           *IN98     IFEQ *OFF
     C                     SETON                     515253
     C                     SETON                     5469
     C                     MOVELERR,6     MSG
     C                     LEAVE
     C                     END
     C*
     C                     CLEARABMPPC51
     C*
     C                     EXSR @EDTF
      *
TCHK1C*          *IN98     IFEQ *OFF
TCHK1C           W@IN98    IFEQ *ON
     C                     UPDATABMPPC51
     C                     ELSE
     C                     WRITEABMPPC51
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  EDIT RECORD (NEW/CHANGE)
     C*----------------------------------------------------*
     C           @EDTF     BEGSR
     C*
     C                     TIME           WWTIME
     C                     Z-ADD@@YY      BHKOYY
     C                     Z-ADD@@MM      BHKOMM
     C                     Z-ADD@@DD      BHKODD
     C                     Z-ADDWTIMH     BHKOHH
     C                     Z-ADDWTIMM     BHKOSS
     C                     MOVEL#PGM      BHPGMN
     C                     MOVEL#USER     BHKOME
      *
     C                     MOVELP1BMON    BHBMON
     C                     MOVELP1KOTE    BHKOTE
     C*
     C                     MOVELF2PTAN    BHPTAN
     C                     Z-ADDF2HTSU    BHHTSU
     C                     MOVELF2FUGO    BHFUGO
     C                     Z-ADDF2LOT     BHLOT
     C*
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE MAIN
     C*----------------------------------------------------*
     C           @S2CHG    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               98
     C   98                LEAVE
     C           S1SEL     IFEQ *BLANK
     C                     ITER
     C                     END
      *
     C                     EXSR @S2CDP
     C   KA                LEAVE
      *
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*ON       *IN32
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN32
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHANGE/DELETE SET
     C*----------------------------------------------------*
     C           @S2CDP    BEGSR
      *
     C                     EXSR @S2INT
     C           S1SEL     IFEQ 'C'
     C                     MOVEL'CHANGE'  F2ACTN    P
     C                     SETON                     62
     C                     SETOF                     616364
     C                     ELSE
     C                     MOVEL'DELETE'  F2ACTN    P
     C                     SETON                     616263
     C                     SETON                     64
     C                     END
     C                     MOVELS1PTAN    F2PTAN
     C                     Z-ADDS1HTSU    F2HTSU
     C                     MOVELH1FUGO    F2FUGO
     C                     Z-ADDS1LOT     F2LOT
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTFMT020
     C   KA
     COR KL                LEAVE
      *
     C           *INKE     IFEQ *ON
     C                     EXSR @CHGF
     C                     LEAVE
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  UPDAT
     C*----------------------------------------------------*
     C           @CHGF     BEGSR
      *
     C                     DO
      *
TCHK1C*
     C                     Z-ADDF2HTSU    K2HTSU
TCHK1C           KEYB52    SETLLABMPPC5
TCHK1C                     DO   *HIVAL
TCHK1C           KEYB52    READEABMPPC5                  98
TCHK1C   98                LEAVE
TCHK1C           BHSKJY    IFNE *BLANK
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           S1PTAN    IFEQ BHPTAN
TCHK1C           H1FUGO    ANDEQBHFUGO
TCHK1C           S1LOT     ANDEQBHLOT
TCHK1C                     LEAVE
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     END
TCHK1C                     ENDDO
TCHK1C   98                LEAVE
      *
     C           S1SEL     IFEQ 'D'
     C                     TIME           WWTIME
     C                     MOVEL'D'       BHSKJY
     C                     Z-ADD@@YY      BHSKYY
     C                     Z-ADD@@MM      BHSKMM
     C                     Z-ADD@@DD      BHSKDD
     C                     Z-ADD@@YY      BHKOYY
     C                     Z-ADD@@MM      BHKOMM
     C                     Z-ADD@@DD      BHKODD
     C                     Z-ADDWTIMH     BHKOHH
     C                     Z-ADDWTIMM     BHKOSS
     C                     MOVEL#PGM      BHPGMN
     C                     MOVEL#USER     BHKOME
     C                     ELSE
     C                     EXSR @EDTF
     C                     END
      *
     C                     UPDATABMPPC51
      *
     C                     ENDDO
      *
     C                     ENDSR
** ERR
NO DATA FOUND.
SEQ#  BLANK.
#OF BOX ZERO.
CONDITION CODE INVALID.
RATE ZERO.
SOMEBODY ELSE ALREADY CREATE. NEED CHECK(DUPLICATE).
07
08
09
10
11
12
13
14
15
