     H            Y.
     F** ABMR43 **********************************
     F*最終工程情報の取得                      *
     F*    HOTTA.    2018.08.29                  *
     F********************************************
     FAGAPL31 IF  E           K        DISK
     E                    OKT        15  3               工程
     E                    OTK        15  6               所番地
     E                    OSY        15  1               か種
     E                    OBM        15  4               部門
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  100WKAP
     I                                        1   80WKAPHZ
     I                                        9  100WKAPBN
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WDATE
     C           *ENTRY    PLIST
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P9BMON  40
     C                     PARM           P9PROC  3
     C                     PARM           P9TKR   6
     C                     PARM           P9SHR   1
      *
     C           KEY31     KLIST
     C                     KFLD           P1SHN1
     C                     KFLD           P1SHN2
     C                     KFLD           P1SHN3
     C                     MOVEL*BLANK    W@KDAI  1
     C           KEY31     CHAINAGAPL311             23
     C           *IN23     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     23
     C                     ENDIF
     C           *IN23     IFEQ '0'
     C                     MOVELCBKDAI    W@KDAI
     C                     ENDIF
      *
     C                     Z-ADD0         P9BMON
     C                     MOVEL*BLANK    P9PROC
     C                     MOVEL*BLANK    P9TKR
     C                     MOVEL*BLANK    P9SHR
     C                     MOVEL'1'       OPNCLS
      *
     C                     EXSR #SB390
      *
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRS0'
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------*
      *工程情報                         *
      *-----------------------------------*
     CSR         #SB390    BEGSR
      *
     C                     CLEAROKT
     C                     CLEAROTK
     C                     CLEAROSY
     C                     CLEAROBM
     C                     MOVELP1SHN1    CBSHN1  5
     C                     MOVELP1SHN2    CBSHN2  5
     C                     MOVELP1SHN3    CBSHN3  2
     C                     MOVEL*DATE     INYMDB
     C                     MOVE '01'      INYMDB
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           CBSHN1
     C                     PARM           CBSHN2
     C                     PARM           CBSHN3
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C           STATUS    IFEQ '9'
     C                     GOTO ESB390
     C                     ENDIF
      *
     C                     MOVEAPKOT      OKT
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSY
     C                     MOVEAPBMN      OBM
      *
     C                     Z-ADD0         P9BMON
     C                     MOVEL*BLANK    P9PROC
     C                     MOVEL*BLANK    P9TKR
     C                     MOVEL*BLANK    P9SHR
      *最終工程
     C                     Z-ADD15        X       30
     C                     MOVEL'0'       ENDSW   1
     C           X         DOWGE1
     C           ENDSW     ANDEQ'0'
     C           OSY,X     IFEQ W@KDAI
     C                     MOVE OBM,X     P9BMON
     C                     MOVELOKT,X     P9PROC
     C                     MOVELOTK,X     P9TKR
     C                     MOVELOSY,X     P9SHR
     C                     MOVEL'1'       ENDSW   1
     C                     ENDIF
     C                     SUB  1         X
     C                     ENDDO
      *
     CSR         ESB390    ENDSR
