     H            Y.
     F** ABMRD2 **************************************
     F* INQ MONTHLY QTY ADJUST DATA                  *
     F*    HOTTA.          2018.08.01                *
     F************************************************
     FABMPWD2 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                              KINFDS INFDS
     FABMPPD1 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMRHPL21 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
      *
     I            DS
     I                                        1  12 WKSHN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
      *
     I            DS
     I                                        1  12 A21HB
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
      *
     I            DS
     I                                        1  12 A22HB
     I                                        1   5 A24HB5
     I                                        6  10 A25HB5
     I                                       11  12 A26HB2
      *
     I            DS
     I                                        1  12 A23HB
     I                                        1   5 A27HB5
     I                                        6  10 A28HB5
     I                                       11  12 A29HB2
      *
     I            DS
     I                                        1  12 A24HB
     I                                        1   5 A210H5
     I                                        6  10 A211H5
     I                                       11  12 A212H2
      *
     I            DS
     I                                        1  12 EAKH1
     I                                        1   5 EAKH11
     I                                        6  10 EAKH12
     I                                       11  12 EAKH13
      *
     I            DS
     I                                        1  12 EAKH2
     I                                        1   5 EAKH21
     I                                        6  10 EAKH22
     I                                       11  12 EAKH23
      *
     I            DS
     I                                        1  12 EAKH3
     I                                        1   5 EAKH31
     I                                        6  10 EAKH32
     I                                       11  12 EAKH33
      *
     I            DS
     I                                        1  12 EAKH4
     I                                        1   5 EAKH41
     I                                        6  10 EAKH42
     I                                       11  12 EAKH43
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 ##USER
     I                                      264 269 W#JBNO
      *
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * INQ                                                *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLABMPPD11
     C                     READ ABMPPD11                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ABMPPD11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * SFL                                                *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEABMPWD29
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      * F11 WASHER TOTAL
     C           *IN11     IFEQ '1'
     C                     CALL 'ABMCD7'
     C                     GOTO ESB220
     C                     ENDIF
      * F12 WIRE TOTAL
     C           *IN12     IFEQ '1'
     C                     CALL 'ABMCD8'
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTABMPPD11
     C                     READPABMPPD11                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  16        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPABMPPD11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLABMPPD11
     C                     READ ABMPPD11                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ABMPPD11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ ABMPPD11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     SETOF                     3099
     C                     Z-ADD1         X       20
     C           X         DOWLE16
     C           *IN99     ANDEQ'0'
     C           X         CHAINSFL                  27
     C           *IN27     IFEQ '0'
     C                     SELEC
     C           S1SEL     WHEQ ' '
     C           S1SEL     WHEQ 'M'
     C                     EXSR #SB230
     C                     MOVEL*BLANK    S1SEL
     C           S1SEL     WHEQ '1'
     C           KEYCN     CHAINFCEPL011             20
     C                     MOVEL*BLANK    P1KH1
     C                     MOVEL*BLANK    P1KH2
     C                     MOVEL*BLANK    P1KH3
     C                     MOVEL*BLANK    P1KH4
     C           *IN20     IFEQ '0'
     C                     MOVELA21HB     P1KH1
     C                     MOVELA22HB     P1KH2
     C                     MOVELA23HB     P1KH3
     C                     MOVELA24HB     P1KH4
     C                     ENDIF
     C                     CALL 'ABMRD3'
     C                     PARM           H1SHN1  5
     C                     PARM           H1SHN2  5
     C                     PARM           H1SHN3  2
     C                     PARM           H1ZANM 15
     C                     PARM           H1KAZI  52
     C                     PARM           P1KH1  12
     C                     PARM           P1KH2  12
     C                     PARM           P1KH3  12
     C                     PARM           P1KH4  12
     C                     MOVEL*BLANK    S1SEL
     C           S1SEL     WHEQ '2'
     C                     CALL 'ABMRD4'
     C                     PARM           H1SHN1  5
     C                     PARM           H1SHN2  5
     C                     PARM           H1SHN3  2
     C                     PARM           H1ZANM 15
     C                     PARM           H1KAZI  52
     C                     MOVEL*BLANK    S1SEL
     C                     OTHER
     C                     SETON                     3099
     C                     MOVELER,2      D9ERR
     C                     ENDSL
     C                     UPDATSFL
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * DETAIL                                             *
      *----------------------------------------------------*
     CSR         #SB230    BEGSR
      *
     C           KEYCN     KLIST
     C                     KFLD           H1SHN1
     C                     KFLD           H1SHN2
     C                     KFLD           H1SHN3
      *
     C           KEYCN     CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2TAHZ    D2TAHZ
     C           A21HB     IFNE *BLANK
     C                     MOVELA21HB     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH1
     C                     ENDIF
     C           A22HB     IFNE *BLANK
     C                     MOVELA22HB     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH2
     C                     ENDIF
     C           A23HB     IFNE *BLANK
     C                     MOVELA23HB     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH3
     C                     ENDIF
     C           A24HB     IFNE *BLANK
     C                     MOVELA24HB     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH4
     C                     ENDIF
     C                     MOVELA2ZANM    D2ZANM
     C                     Z-ADDA2KAZI    D2KAZI
     C                     ENDIF
      *
     C           KEYCN     CHAINMRHPL211             21
     C           *IN21     IFEQ '0'
     C           EAGSJY    ANDEQ'D'
     C           EAGSHZ    ANDLE*DATE
     C                     SETON                     21
     C                     ENDIF
     C           *IN21     IFEQ '0'
     C           *IN20     ANDEQ'1'
     C                     Z-ADD0         D2TAHZ
     C           EAKH1     IFNE *BLANK
     C                     MOVELEAKH1     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH1
     C                     ENDIF
     C           EAKH2     IFNE *BLANK
     C                     MOVELEAKH2     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH2
     C                     ENDIF
     C           EAKH3     IFNE *BLANK
     C                     MOVELEAKH3     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH3
     C                     ENDIF
     C           EAKH4     IFNE *BLANK
     C                     MOVELEAKH4     WKSHN
     C                     EXSR #SB211
     C                     MOVELP@SHNA    D2KH4
     C                     ENDIF
     C                     MOVELEAZANM    D2ZANM
     C                     Z-ADDEAKAZI    D2KAZI
     C                     ENDIF
      *
     C                     MOVELH1SHN1    D1SHN1
     C                     MOVELH1SHN2    D1SHN2
     C                     MOVELH1SHN3    D1SHN3
     C                     MOVELH1ZANM    D2ZANM
     C                     Z-ADDH1KAZI    D2KAZI
     C                     Z-ADDH1STAT    D2STAT
     C                     Z-ADDH1END     D2END
     C                     Z-ADDH1QTY     D2QTY
     C                     Z-ADDH1INPT    D2INPT
     C                     MOVELH1USER    D2USER
      *
     C                     EXFMTABMPWD22
      *
     CSR         ESB230    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB211    BEGSR
      *
     C                     CALL 'APLR30'
     C                     PARM           WKSHN1  5
     C                     PARM           WKSHN2  5
     C                     PARM           WKSHN3  2
     C                     PARM           P@SHNA 14
      *
     CSR         ESB211    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 16
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C           DDSKJY    IFEQ 'D'
     C           DDSKHZ    ANDLE*DATE
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR                                              *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C           KEYDN     KLIST
     C                     KFLD           DDSHN1
     C                     KFLD           DDSHN2
     C                     KFLD           DDSHN3
     C                     Z-ADD0         S1GEKN
     C           KEYDN     CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2GEKN    S1GEKN
     C                     ENDIF
     C                     MOVEL*BLANK    S1SHN
     C           DDSHN1    CAT  '-':0     S1SHN
     C           S1SHN     CAT  DDSHN2:0  S1SHN
     C           DDSHN3    IFNE *BLANK
     C           S1SHN     CAT  '-':0     S1SHN
     C           S1SHN     CAT  DDSHN3:0  S1SHN
     C                     ENDIF
     C                     MOVELDDZANM    S1ZANM
     C                     Z-ADDDDKAZI    S1KAZI
     C                     Z-ADDDDSTAT    S1STAT
     C                     Z-ADDDDEND     S1END
     C                     Z-ADDDDQTY     S1QTY
     C                     MOVELDDSHN1    H1SHN1
     C                     MOVELDDSHN2    H1SHN2
     C                     MOVELDDSHN3    H1SHN3
     C                     MOVELDDZANM    H1ZANM
     C                     Z-ADDDDKAZI    H1KAZI
     C                     Z-ADDDDSTAT    H1STAT
     C                     Z-ADDDDEND     H1END
     C                     Z-ADDDDQTY     H1QTY
     C                     Z-ADDDDINPT    H1INPT
     C                     MOVELDDUSER    H1USER
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT                                               *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ ABMPPD11                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV                                                *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPABMPPD11                 81
      *
     CSR         ENEXTP    ENDSR
**
ER-1 NO DATA.
ER-2 DETAIL 'M'.
