     H            Y.
     F** ABMRDA *********************************************
     F* MONTHLY QTY ADJUST DATA (WIRE ALL)
     F*   HOTTA.          2018.10.31                        *
     F*******************************************************
     FABMPPD1 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FMRHPL21 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FABMPPL1 IF  E           K        DISK
     FABMWPDA UF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
      *
     I            DS
     I                                        1  12 WKSHN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   60W@DTYM
     I                                        1   40W@DTYY
     I                                        5   60W@DTMM
     I                                        7   80W@DTDD
      *
     I            DS
     I                                        1   60W@P1YM
     I                                        1   40W@P1YY
     I                                        5   60W@P1MM
      *
     I            DS
     I                                        1   60W@P2YM
     I                                        1   40W@P2YY
     I                                        5   60W@P2MM
      *
     I            DS
     I                                        1   60W@P3YM
     I                                        1   40W@P3YY
     I                                        5   60W@P3MM
      *
     I            DS
     I                                        1   60W@P4YM
     I                                        1   40W@P4YY
     I                                        5   60W@P4MM
      *
     I            DS
     I                                        1   60W@P5YM
     I                                        1   40W@P5YY
     I                                        5   60W@P5MM
      *
     I            DS
     I                                        1   60W@P6YM
     I                                        1   40W@P6YY
     I                                        5   60W@P6MM
      *
     I            DS
     I                                        1   60#KYM
     I                                        1   40#KYY
     I                                        5   60#KMM
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      * N
     C                     Z-ADD*DATE     W@DATE
     C                     Z-ADDW@DTYM    D1YMN   60
      * N+1
     C                     Z-ADDW@DTYM    W@P1YM
     C           W@DTMM    IFEQ 12
     C                     ADD  1         W@P1YY
     C                     Z-ADD1         W@P1MM
     C                     ELSE
     C                     ADD  1         W@P1MM
     C                     ENDIF
     C                     Z-ADDW@P1YM    D1YMN1  60
      * N+2
     C                     Z-ADDW@P1YM    W@P2YM
     C           W@P1MM    IFEQ 12
     C                     ADD  1         W@P2YY
     C                     Z-ADD1         W@P2MM
     C                     ELSE
     C                     ADD  1         W@P2MM
     C                     ENDIF
     C                     Z-ADDW@P2YM    D1YMN2  60
      * N+3
     C                     Z-ADDW@P2YM    W@P3YM
     C           W@P2MM    IFEQ 12
     C                     ADD  1         W@P3YY
     C                     Z-ADD1         W@P3MM
     C                     ELSE
     C                     ADD  1         W@P3MM
     C                     ENDIF
     C                     Z-ADDW@P3YM    D1YMN3  60
      * N+4
     C                     Z-ADDW@P3YM    W@P4YM
     C           W@P3MM    IFEQ 12
     C                     ADD  1         W@P4YY
     C                     Z-ADD1         W@P4MM
     C                     ELSE
     C                     ADD  1         W@P4MM
     C                     ENDIF
     C                     Z-ADDW@P4YM    D1YMN4  60
      * N+5
     C                     Z-ADDW@P4YM    W@P5YM
     C           W@P4MM    IFEQ 12
     C                     ADD  1         W@P5YY
     C                     Z-ADD1         W@P5MM
     C                     ELSE
     C                     ADD  1         W@P5MM
     C                     ENDIF
     C                     Z-ADDW@P5YM    D1YMN5  60
      * N+6
     C                     Z-ADDW@P5YM    W@P6YM
     C           W@P5MM    IFEQ 12
     C                     ADD  1         W@P6YY
     C                     Z-ADD1         W@P6MM
     C                     ELSE
     C                     ADD  1         W@P6MM
     C                     ENDIF
     C                     Z-ADDW@P6YM    D1YMN6  60
      *稼働日数
     C                     Z-ADD0         D1KDN   31
     C                     Z-ADD0         D1KDN1  31
     C                     Z-ADD0         D1KDN2  31
     C                     Z-ADD0         D1KDN3  31
     C                     Z-ADD0         D1KDN4  31
     C                     Z-ADD0         D1KDN5  31
      *
     C                     Z-ADDD1YMN     #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN
      *
     C                     Z-ADDD1YMN1    #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN1
      *
     C                     Z-ADDD1YMN2    #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN2
      *
     C                     Z-ADDD1YMN3    #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN3
      *
     C                     Z-ADDD1YMN4    #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN4
      *
     C                     Z-ADDD1YMN5    #KYM    60
     C                     EXSR #SBAGD
     C                     Z-ADDWKADO     D1KDN5
      *
      *****************
      *
     C           *LOVAL    SETLLABMPPD11
     C                     READ ABMPPD11                 24
     C           *IN24     DOWEQ'0'
     C           DDSKJY    IFEQ 'D'
     C           DDSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDDDSTAT    D2STAT  60
     C                     Z-ADDDDEND     D2END   60
     C                     Z-ADDDDQTY     D2QTY  110
     C                     EXSR #SB150
     C                     EXSR #SB200
     C           FCE       IFEQ '0'
     C                     EXSR #SB150
     C                     EXSR #SB210
     C                     ENDIF
     C                     ENDIF
     C                     READ ABMPPD11                 24
     C                     ENDDO
      *****************
      *構成品１
      *構成品２
      *構成品３
      *構成品４
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB150    BEGSR
      *
     C                     Z-ADD0         SRY1N   70
     C                     Z-ADD0         SRY1N1  70
     C                     Z-ADD0         SRY1N2  70
     C                     Z-ADD0         SRY1N3  70
     C                     Z-ADD0         SRY1N4  70
     C                     Z-ADD0         SRY1N5  70
     C                     Z-ADD0         XRY1N   70
     C                     Z-ADD0         XRY1N1  70
     C                     Z-ADD0         XRY1N2  70
     C                     Z-ADD0         XRY1N3  70
     C                     Z-ADD0         XRY1N4  70
     C                     Z-ADD0         XRY1N5  70
      *
     C                     Z-ADD0         JRY1N  112
     C                     Z-ADD0         JRY1N1 112
     C                     Z-ADD0         JRY1N2 112
     C                     Z-ADD0         JRY1N3 112
     C                     Z-ADD0         JRY1N4 112
     C                     Z-ADD0         JRY1N5 112
      *
     CSR         ESB150    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYFCE    KLIST
     C                     KFLD           DDSHN1
     C                     KFLD           DDSHN2
     C                     KFLD           DDSHN3
      *
     C                     MOVEL'0'       FCE     1
     C           KEYFCE    CHAINFCEPL011             81
     C           *IN81     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       FCE
     C**         A2GEKN    MULT A2SOZI    WKSRY  162
     C                     Z-ADD0         WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    JRY1N
     C                     ADD  WKSRY@    JRY1N1
     C                     ADD  WKSRY@    JRY1N2
     C                     ADD  WKSRY@    JRY1N3
     C                     ADD  WKSRY@    JRY1N4
     C                     ADD  WKSRY@    JRY1N5
     C                     MOVELA2ZANM    W@ZANM 15
     C                     Z-ADDA2KAZI    W@KAZI  52
     C                     Z-ADDA2SOZI    W@SOZI  72
     C                     EXSR #PPD1@
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C           KEYMRH    KLIST
     C                     KFLD           DDSHN1  5
     C                     KFLD           DDSHN2  5
     C                     KFLD           DDSHN3  2
      *
     C                     Z-ADD0         EAGEKN 110
     C           KEYMRH    CHAINMRHPL211             81
     C           *IN81     IFEQ '0'
     C           EAGSJY    IFEQ 'D'
     C           EAGSHZ    ANDLE*DATE
     C                     ELSE
     C******     EAGEKN    MULT EASOZI    WKSRY  162
     C                     Z-ADD0         WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    JRY1N
     C                     ADD  WKSRY@    JRY1N1
     C                     ADD  WKSRY@    JRY1N2
     C                     ADD  WKSRY@    JRY1N3
     C                     ADD  WKSRY@    JRY1N4
     C                     ADD  WKSRY@    JRY1N5
     C                     MOVELEAZANM    W@ZANM 15
     C                     Z-ADDEAKAZI    W@KAZI  52
     C                     Z-ADDEASOZI    W@SOZI  72
     C                     EXSR #PPD1@
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * ABMPPD1                                            *
      *----------------------------------------------------*
     CSR         #PPD1@    BEGSR
      *
     C           D1YMN     IFGE D2STAT
     C           D1YMN     ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN     QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N
     C                     ENDIF
      *
     C           D1YMN1    IFGE D2STAT
     C           D1YMN1    ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN1    QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N1
     C                     ENDIF
      *
     C           D1YMN2    IFGE D2STAT
     C           D1YMN2    ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN2    QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N2
     C                     ENDIF
      *
     C           D1YMN3    IFGE D2STAT
     C           D1YMN3    ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN3    QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N3
     C                     ENDIF
      *
     C           D1YMN4    IFGE D2STAT
     C           D1YMN4    ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN4    QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N4
     C                     ENDIF
      *
     C           D1YMN5    IFGE D2STAT
     C           D1YMN5    ANDLED2END
     C           D2QTY     DIV  20        QTY20   90
     C           QTY20     MULT D1KDN5    QTY20
     C           QTY20     MULT W@SOZI    WKSRY  162
     C           WKSRY     DIV  1000      WKSRY@  90H
     C                     ADD  WKSRY@    XRY1N5
     C                     ENDIF
      *
     C           JRY1N     DIV  20        SRY1N
     C                     MULT D1KDN     SRY1N
     C                     ADD  XRY1N     SRY1N
      *
     C           JRY1N1    DIV  20        SRY1N1
     C                     MULT D1KDN1    SRY1N1
     C                     ADD  XRY1N1    SRY1N1
      *
     C           JRY1N2    DIV  20        SRY1N2
     C                     MULT D1KDN2    SRY1N2
     C                     ADD  XRY1N2    SRY1N2
      *
     C           JRY1N3    DIV  20        SRY1N3
     C                     MULT D1KDN3    SRY1N3
     C                     ADD  XRY1N3    SRY1N3
      *
     C           JRY1N4    DIV  20        SRY1N4
     C                     MULT D1KDN4    SRY1N4
     C                     ADD  XRY1N4    SRY1N4
      *
     C           JRY1N5    DIV  20        SRY1N5
     C                     MULT D1KDN5    SRY1N5
     C                     ADD  XRY1N5    SRY1N5
      *
     CSR         EPPD1@    ENDSR
      *----------------------------------------------------*
      *稼働日数                                          *
      *----------------------------------------------------*
     CSR         #SBAGD    BEGSR
      *
     C           KEYF8     KLIST
     C                     KFLD           #KKAYY  40
     C                     KFLD           #KKAMM  20
     C                     Z-ADD#KYY      #KKAYY
     C                     Z-ADD#KMM      #KKAMM
     C                     Z-ADD0         WKADO   31
     C           KEYF8     SETLLAGDPL121
     C           KEYF8     READEAGDPL121                 77
     C           *IN77     DOWEQ'0'
     C           F8HIRU    IFEQ *BLANK
     C                     ADD  0.5       WKADO
     C                     ENDIF
     C           F8YORU    IFEQ *BLANK
     C                     ADD  0.5       WKADO
     C                     ENDIF
     C           KEYF8     READEAGDPL121                 77
     C                     ENDDO
      *
     C           KEYF8     SETLLABMPPL11
     C           KEYF8     READEABMPPL11                 77
     C           *IN77     DOWEQ'0'
     C                     Z-ADDLLKADO    WKADO
     C           KEYF8     READEABMPPL11                 77
     C                     ENDDO
      *
     CSR         ESBAGD    ENDSR
      *----------------------------------------------------*
      *ワーク
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYWK     KLIST
     C                     KFLD           W@ZANM 15
     C                     KFLD           W@KAZI  52
     C           KEYWK     CHAINABMWPDA1             85
     C           *IN85     IFEQ '0'
     C                     ADD  SRY1N     W1S1N
     C                     ADD  SRY1N1    W1S1N1
     C                     ADD  SRY1N2    W1S1N2
     C                     ADD  SRY1N3    W1S1N3
     C                     ADD  SRY1N4    W1S1N4
     C                     ADD  SRY1N5    W1S1N5
     C                     UPDATABMWPDA1
     C                     ELSE
     C                     CLEARABMWPDA1
     C                     MOVELW@ZANM    W1ZANM
     C                     Z-ADDW@KAZI    W1KAZI
     C                     Z-ADDSRY1N     W1S1N
     C                     Z-ADDSRY1N1    W1S1N1
     C                     Z-ADDSRY1N2    W1S1N2
     C                     Z-ADDSRY1N3    W1S1N3
     C                     Z-ADDSRY1N4    W1S1N4
     C                     Z-ADDSRY1N5    W1S1N5
     C                     WRITEABMWPDA1
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
