     H            Y.
     F** ABMR4H *********************************************
     F* FCEPP40検索→実績取得
     F*   SAKAKI.       2019.09.23                          *
     F*******************************************************
     FFCEPL41 IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        5   60WTITS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I            DS
     I                                        1   60@@YM
     I                                        1   40@YY
     I                                        5   60@MM
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           PKMHN1  5
     C                     PARM           PKMHN2  5
     C                     PARM           PKMHN3  2
     C                     PARM           PKHAKO  90
      *
     C                     MOVELPKMHN1    #KMHN1
     C                     MOVELPKMHN2    #KMHN2
     C                     MOVELPKMHN3    #KMHN3
     C                     Z-ADD0         PKHAKO
     C                     EXSR #SB400
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      * FCEPL41より完成品       *
      *---------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYMD1    KLIST
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  2
      *
     C           KEYMD1    SETLLFCEPL41
     C           KEYMD1    READEFCEPL41                  83
     C           *IN83     DOWEQ'0'
     C                     EXSR #SB700
     C           KEYMD1    READEFCEPL41                  83
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *---------------------------*
      * A-PICS 最大日当り出荷（売上実績　未来受注）
      *---------------------------*
     CSR         #SB700    BEGSR
      * N-1,N-2,N-3 SALES DATA
     C                     CALL 'ABMR44'
     C                     PARM           F4PRT1
     C                     PARM           F4PRT2
     C                     PARM           F4PRT3
     C                     PARM           P9NOHZ  80
     C                     PARM           P9HAKO  90
      * N,N+1 ORDER DATA
     C                     CALL 'ABMR4E'
     C                     PARM           F4PRT1
     C                     PARM           F4PRT2
     C                     PARM           F4PRT3
     C                     PARM           P9NOHZ  80
     C                     PARM           P8HAKO  90
      *
     C           P9HAKO    IFGT P8HAKO
     C                     ADD  P9HAKO    PKHAKO
     C                     ELSE
     C                     ADD  P8HAKO    PKHAKO
     C                     ENDIF
      *
     CSR         ESB700    ENDSR
