     H            Y.
     F** ABMRF0 *********************************************
     F*副資材　品番データ
     F*   HOTTA.          2018.10.04                        *
     F*******************************************************
     FFCEPL01 IF  E           K        DISK
     FMCENP13 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FABMWPF0 IF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2TAHZ
     I                                        1   40A2TAYY
     I                                        5   60A2TAMM
     I                                        7   80A2TADD
      *
     I            DS
     I                                        1  12 WKSHN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
      *
     I            DS
     I                                        1  12 A2BHB
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
      *
     I            DS
     I                                        1  12 MCKHN
     I                                        1   5 MCKHN1
     I                                        6  10 MCKHN2
     I                                       11  12 MCKHN3
      *
     I            DS
     I                                        1  12 A21HB
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
      *
     I            DS
     I                                        1  12 A22HB
     I                                        1   5 A24HB5
     I                                        6  10 A25HB5
     I                                       11  12 A26HB2
      *
     I            DS
     I                                        1  12 A23HB
     I                                        1   5 A27HB5
     I                                        6  10 A28HB5
     I                                       11  12 A29HB2
      *
     I            DS
     I                                        1  12 A24HB
     I                                        1   5 A210H5
     I                                        6  10 A211H5
     I                                       11  12 A212H2
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB200
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C                     MOVEL'S'       WKSEHI  1
     C           *LOVAL    SETLLFCEPL011
     C                     READ FCEPL011                 20
     C           *IN20     DOWEQ'0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELA2BHB     WKSHN
     C                     Z-ADDA2SSYS    WKSSYS  70
     C                     EXSR #SB211
     C                     ENDIF
     C                     READ FCEPL011                 20
     C                     ENDDO
      *
     C           KEYAKC    KLIST
     C                     KFLD           MCKHN1
     C                     KFLD           MCKHN2
     C                     KFLD           MCKHN3
     C                     MOVEL'K'       WKSEHI  1
     C           *LOVAL    SETLLMCENP131
     C                     READ MCENP131                 20
     C           *IN20     DOWEQ'0'
     C                     MOVELMCKHN     WKSHN
     C           KEYAKC    CHAINAKCPL011             19
     C           *IN19     IFEQ '0'
     C                     Z-ADDM1SSYS    WKSSYS  70
     C                     ENDIF
     C                     EXSR #SB211
     C                     READ MCENP131                 20
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB211    BEGSR
      *
     C           KEYW      KLIST
     C                     KFLD           WKSHN1
     C                     KFLD           WKSHN2
     C                     KFLD           WKSHN3
     C                     KFLD           WKSEHI
      *
     C           KEYW      CHAINABMWPF01             74
     C           *IN74     IFEQ '1'
     C                     CLEARABMWPF01
     C                     MOVELWKSHN1    W0SHN1
     C                     MOVELWKSHN2    W0SHN2
     C                     MOVELWKSHN3    W0SHN3
     C                     MOVELWKSEHI    W0SEHI
     C                     Z-ADDWKSSYS    W0SSYS
     C                     WRITEABMWPF01
     C                     ENDIF
      *
     CSR         ESB211    ENDSR
