     H            Y.
     F** ABMR70 *********************************************
     F* NON UPDATE DATA LIST (PT BPT)
     F*    HOTTA.               2018.06.07                  *
     F*******************************************************
     FABMPL21 IF  E           K        DISK
     FABMWP70 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@DAYY
     I                                        5   60W@DAMM
     I                                        7   80W@DADD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I            DS
     I                                        1   8 CTIHZ
     I                                        1   2 CTIMM
     I                                        3   4 CTIDD
     I                                        5   8 CTIYY
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              'PT KANBAN SET#'      C         FNAM11
     I              'CHECK LIST'          C         FNAM12
     I              'BPT KANBAN SET#'     C         FNAM21
     I              'CHECK LIST'          C         FNAM22
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
     C                     PARM           P@PAS   1
     C                     PARM           P@FNAM 30
      *
     C                     TIME           WTIME
      *
     C                     MOVE WTIMM     CTIMM
     C                     MOVE WTIDD     CTIDD
     C                     MOVE WTIYY     CTIYY
     C                     MOVEL*BLANK    P@FNAM
     C                     SELEC
     C           P@PAS     WHEQ '1'
     C           FNAM11    CAT  FNAM12:1  P@FNAM
     C           P@PAS     WHEQ '2'
     C           FNAM21    CAT  FNAM22:1  P@FNAM
     C                     ENDSL
      *
     C                     Z-ADDP@DTYM    K@DTYM  60
     C           K@DTYM    SETLLABMPL211
     C           K@DTYM    READEABMPL211                 87
     C           *IN87     DOWEQ'0'
     C           S4PAS     IFEQ P@PAS
     C                     EXSR #SB001
     C                     ENDIF
     C           K@DTYM    READEABMPL211                 87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * FCEPP01                                          *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C                     CLEARABMWP701
     C                     Z-ADDS4CRDT    W0CRDT
     C                     MOVELS4SHN1    W0SHN1
     C                     MOVELS4SHN2    W0SHN2
     C                     MOVELS4SHN3    W0SHN3
     C                     Z-ADDS4NSRY    W0NSRY
     C                     Z-ADDS4NSRD    W0NSRD
     C                     Z-ADDS4NBXD    W0NBXD
     C                     Z-ADDS4NTYM    W0NTYM
     C                     MOVELS4OMIT    W0OMIT
     C                     Z-ADDS4FSMN    W0FSMN
     C                     Z-ADDS4FSM1    W0FSM1
     C                     Z-ADDS4USM1    W0USM1
     C                     Z-ADDS4USM2    W0USM2
     C                     Z-ADDS4USM3    W0USM3
     C                     Z-ADDS4FSDN    W0FSDN
     C                     Z-ADDS4FSD1    W0FSD1
     C                     Z-ADDS4USD1    W0USD1
     C                     Z-ADDS4USD2    W0USD2
     C                     Z-ADDS4USD3    W0USD3
     C                     Z-ADDS4NWDY    W0NWDY
     C                     Z-ADDS41WDY    W01WDY
     C                     MOVELS4PAS     W0PAS
     C                     Z-ADDS4GEKN    W0GEKN
     C                     Z-ADDS4HIKN    W0HIKN
     C                     Z-ADDS4STDY    W0STDY
     C                     Z-ADDS4BOXD    W0BOXD
     C                     Z-ADDS4SSYS    W0SSYS
     C                     Z-ADDS4BOXP    W0BOXP
     C                     Z-ADDS4BOXS    W0BOXS
     C                     Z-ADDS4YMD3    W0YMD3
     C                     Z-ADD0         W0RITU
     C           S4BOXP    IFGE 1
     C           S4BOXP    SUB  1         W0RITU
     C                     ELSE
     C           1         SUB  S4BOXP    W0RITU
     C                     ENDIF
     C                     WRITEABMWP701
      *
     CSR         ESB001    ENDSR
