     H            Y.
     F** ABMR12 *********************************************
     F* CREATE FORECAST USER PART NO.
     F*    HOTTA.               2018.06.05                  *
     F*******************************************************
     FABMWP11 IF  E                    DISK
     FABMPP11 O   E                    DISK                      A
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C                     READ ABMWP111                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ ABMWP111                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------------------------*
      * FORECAST ABMPP11                            *
      *---------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARABMPP111
     C                     Z-ADD*DATE     S3KOHZ
     C                     TIME           S3KOTI
     C                     MOVELW#USER    S3KOME
     C                     Z-ADDW1CRDT    S3CRDT
     C                     Z-ADDW1TOKU    S3TOKU
     C                     Z-ADDW1NONY    S3NONY
     C                     MOVELW1NKOJ    S3NKOJ
     C                     MOVELW1NUKE    S3NUKE
     C                     MOVELW1MHN1    S3MHN1
     C                     MOVELW1MHN2    S3MHN2
     C                     MOVELW1MHN3    S3MHN3
     C                     MOVELW1MHN4    S3MHN4
     C                     MOVELW1SHN1    S3SHN1
     C                     MOVELW1SHN2    S3SHN2
     C                     MOVELW1SHN3    S3SHN3
     C                     MOVELW1OHN1    S3OHN1
     C                     MOVELW1OHN2    S3OHN2
     C                     MOVELW1OHN3    S3OHN3
     C                     Z-ADDW1NSRY    S3NSRY
     C                     Z-ADDW1NSRD    S3NSRD
     C                     Z-ADDW1NTYM    S3NTYM
     C                     Z-ADDW1URY1    S3URY1
     C                     Z-ADDW1URY2    S3URY2
     C                     Z-ADDW1URY3    S3URY3
     C                     MOVELW1NKBN    S3NKBN
     C                     MOVELW1OMIT    S3OMIT
     C                     Z-ADDW1FSMN    S3FSMN
     C                     Z-ADDW1FSM1    S3FSM1
     C                     Z-ADDW1FSM2    S3FSM2
     C                     Z-ADDW1USM1    S3USM1
     C                     Z-ADDW1USM2    S3USM2
     C                     Z-ADDW1USM3    S3USM3
     C                     Z-ADDW1FSDN    S3FSDN
     C                     Z-ADDW1FSD1    S3FSD1
     C                     Z-ADDW1FSD2    S3FSD2
     C                     Z-ADDW1USD1    S3USD1
     C                     Z-ADDW1USD2    S3USD2
     C                     Z-ADDW1USD3    S3USD3
     C                     Z-ADDW1NWDY    S3NWDY
     C                     Z-ADDW1AWDY    S3AWDY
     C                     Z-ADDW1BWDY    S3BWDY
     C                     Z-ADDW11WDY    S31WDY
     C                     Z-ADDW12WDY    S32WDY
     C                     Z-ADDW13WDY    S33WDY
     C                     MOVELW1PAS     S3PAS
     C                     Z-ADDW1GEKN    S3GEKN
     C                     Z-ADDW1HIKN    S3HIKN
     C                     Z-ADDW1STDY    S3STDY
     C                     Z-ADDW1SSYS    S3SSYS
     C                     WRITEABMPP111
      *
     CSR         ESB500    ENDSR
