     H            Y.
     F** ABMR32 *********************************************
     F*設定数変更リスト
     F*    HOTTA.               2018.09.14                  *
     F*******************************************************
     FABMPL31 IF  E           K        DISK
     FABMWP32 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@DAYY
     I                                        5   60W@DAMM
     I                                        7   80W@DADD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I            DS
     I                                        1   8 CTIHZ
     I                                        1   2 CTIMM
     I                                        3   4 CTIDD
     I                                        5   8 CTIYY
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              'A-PICS SET# CHANGE'  C         FNAM11
     I              'LIST'                C         FNAM12
     I              'NON A-PICS SET#'     C         FNAM01
     I              'CHANGE'              C         FNAM02
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
     C                     PARM           P@APCS  1
     C                     PARM           P@FNAM 30
      *
     C                     TIME           WTIME
      *
     C                     MOVE WTIMM     CTIMM
     C                     MOVE WTIDD     CTIDD
     C                     MOVE WTIYY     CTIYY
     C                     MOVEL*BLANK    P@FNAM
     C                     SELEC
     C           P@APCS    WHEQ '1'
     C                     MOVELFNAM11    P@FNAM
     C           P@FNAM    CAT  FNAM12:1  P@FNAM
     C           P@APCS    WHEQ '0'
     C           FNAM01    CAT  FNAM02:1  P@FNAM
     C                     ENDSL
      *
     C                     Z-ADDP@DTYM    K@DTYM  60
     C           K@DTYM    SETLLABMPL311
     C                     DO   *HIVAL
     C           K@DTYM    READEABMPL311                 87
     C   87                LEAVE
      *
     C           S5PICS    IFNE P@APCS
     C                     ITER
     C                     ENDIF
      * A-PICS
     C           P@APCS    IFEQ '1'
     C           S5KCD1    ANDNE'E'
     C           S5KCD1    ANDNE'C'
     C                     ITER
     C                     ENDIF
      *
     C                     EXSR #SB001
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * FCEPP01                                          *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C                     CLEARABMWP321
      *
     C                     Z-ADDS5CRDT    W0CRDT
     C                     Z-ADDS5NTYM    W0NTYM
     C                     MOVELS5SHN1    W0SHN1
     C                     MOVELS5SHN2    W0SHN2
     C                     MOVELS5SHN3    W0SHN3
     C                     MOVELS5ATOB    W0ATOB
     C                     MOVELS5ATOK    W0ATOK
     C                     MOVELS5ATK1    W0ATK1
     C                     MOVELS5ATK2    W0ATK2
     C                     MOVELS5ATK3    W0ATK3
     C                     MOVELS5ATK4    W0ATK4
     C                     Z-ADDS5SSYS    W0SSYS
     C                     MOVELS5KCD1    W0KCD1
     C                     MOVELS5KCD2    W0KCD2
     C                     Z-ADDS5BRYO    W0BRYO
     C                     Z-ADDS5MAGS    W0MAGS
     C                     Z-ADDS5KTSU    W0KTSU
     C                     Z-ADDS5KMAX    W0KMAX
     C                     Z-ADDS5KLOT    W0KLOT
     C                     Z-ADDS5MAXH    W0MAXH
     C                     Z-ADDS5PADJ    W0PADJ
     C                     Z-ADDS5AUAJ    W0AUAJ
     C                     Z-ADDS5DUPH    W0DUPH
     C                     Z-ADDS5OTHH    W0OTHH
     C                     Z-ADDS5BOXM    W0BOXM
     C                     Z-ADDS5KTSA    W0KTSA
     C                     Z-ADDS5KMAA    W0KMAA
     C                     Z-ADDS5KLOA    W0KLOA
     C                     Z-ADDS5MAXA    W0MAXA
     C                     Z-ADDS5PADA    W0PADA
     C                     Z-ADDS5AUAA    W0AUAA
     C                     Z-ADDS5DUPA    W0DUPA
     C                     Z-ADDS5OTHA    W0OTHA
     C                     MOVELS5CMTA    W0CMTA
     C                     Z-ADDS5MAXD    W0MAXD
     C                     Z-ADDS5MAX     W0MAX
     C                     Z-ADDS5BOXD    W0BOXD
     C                     MOVELS5PICS    W0PICS
     C                     Z-ADDS5SA      W0SA
     C                     Z-ADDS5SA2     W0SA2
     C                     Z-ADDS5SDAI    W0SDAI
     C                     MOVELS5SSYO    W0SSYO
      *
     C                     Z-ADD0         W0BOXP
     C           S5KMAX    IFNE 0
     C           S5KMAA    DIV  S5KMAX    W0BOXP  73
     C                     ENDIF
     C                     Z-ADD0         W0RITU
     C           W0BOXP    IFGE 1
     C           W0BOXP    SUB  1         W0RITU
     C                     ELSE
     C           1         SUB  W0BOXP    W0RITU
     C                     ENDIF
     C                     MOVELS5DUP@    W0DUP@
     C                     MOVELS5KERR    W0KERR
     C                     WRITEABMWP321
      *
     CSR         ESB001    ENDSR
