     H            Y.
     F** ABMRH3 *********************************************
     F*仕入先オーダー警告リスト
     F*    HOTTA.               2018.12.13                  *
     F*******************************************************
     FABMWPH1 IF  E           K        DISK
     FABMPPH1 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@DAYY
     I                                        5   60W@DAMM
     I                                        7   80W@DADD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     C                     TIME           WTIME
      *
     C                     READ ABMWPH11                 87
     C           *IN87     DOWEQ'0'
     C                     EXSR #DTOUT
     C                     READ ABMWPH11                 87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*
      *--------------------------------------------------------*
      *                                                        *
      *--------------------------------------------------------*
     CSR         #DTOUT    BEGSR
      *
     C                     CLEARABMPPH11
     C                     Z-ADD*DATE     SHKOHZ
     C                     TIME           SHKOTI
     C                     MOVEL@@USER    SHKOME
     C                     Z-ADD*DATE     SHCRDT
     C                     MOVELW1SHN1    SHSHN1
     C                     MOVELW1SHN2    SHSHN2
     C                     MOVELW1SHN3    SHSHN3
     C                     Z-ADDW1SSYS    SHSSYS
     C                     Z-ADDW1GEKN    SHGEKN
     C                     Z-ADDW1HIKN    SHHIKN
     C                     MOVELW1MHN1    SHMHN1
     C                     MOVELW1MHN2    SHMHN2
     C                     MOVELW1MHN3    SHMHN3
     C                     MOVELW1ATOB    SHATOB
     C                     MOVELW1ATOK    SHATOK
     C                     MOVELW1ATK1    SHATK1
     C                     MOVELW1ATK2    SHATK2
     C                     MOVELW1ATK3    SHATK3
     C                     MOVELW1ATK4    SHATK4
     C                     Z-ADDW110AV    SH10AV
     C                     MOVELW1ODRN    SHODRN
     C                     Z-ADDW1SRYO    SHSRYO
     C                     Z-ADDW1DEHZ    SHDEHZ
     C                     Z-ADDW210AV    SI10AV
     C                     Z-ADDW105AL    SH05AL
     C                     Z-ADDW110AL    SH10AL
     C                     Z-ADDW120AL    SH20AL
     C                     Z-ADDW105PR    SH05PR
     C                     Z-ADDW110PR    SH10PR
     C                     Z-ADDW120PR    SH20PR
     C                     MOVELW1FLG     SHFLG
     C                     WRITEABMPPH11
      *
     CSR         EDTOUT    ENDSR
