     H            Y.
     F** ABMRZ5 *********************************************
     F*材料かんばん変更データ
     F*    HOTTA.               2018.10.25                  *
     F*******************************************************
     FABMWPZ1 IF  E                    DISK
     FABMPPZ1 O   E                    DISK                      A
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
      *
     C                     READ ABMWPZ11                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ ABMWPZ11                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------------------------*
      * FORECAST ABMPP11                            *
      *---------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARABMPPZ11
     C                     Z-ADD*DATE     I1KOHZ
     C                     TIME           I1KOTI
     C                     MOVELW#USER    I1KOME
     C                     Z-ADD*DATE     I1CRDT
     C                     Z-ADDP@DTYM    I1NTYM
      *
     C                     Z-ADDW1KOJE    I1KOJE
     C                     MOVELW1KOJK    I1KOJK
     C                     MOVELW1ZAIS    I1ZAIS
     C                     Z-ADDW1ZAIK    I1ZAIK
     C                     Z-ADDW1KAKE    I1KAKE
     C                     MOVELW1KAKK    I1KAKK
     C                     MOVELW1KNO1    I1KNO1
     C                     MOVELW1KNO2    I1KNO2
     C                     MOVELW1KNO3    I1KNO3
     C                     MOVELW1KNOE    I1KNOE
     C                     Z-ADDW1TKJR    I1TKJR
     C                     Z-ADDW1NISG    I1NISG
     C                     MOVELW1KOSN    I1KOSN
     C                     MOVELW1ZIRO    I1ZIRO
     C                     Z-ADDW1MKJR    I1MKJR
     C                     Z-ADDW1MSJR    I1MSJR
     C                     MOVELW1ADR1    I1ADR1
     C                     MOVELW1ADR2    I1ADR2
     C                     MOVELW1ADR3    I1ADR3
     C                     MOVELW1ADR4    I1ADR4
     C                     MOVELW1UKIR    I1UKIR
     C                     Z-ADDW1LOTO    I1LOTO
     C                     Z-ADDW1MSSU    I1MSSU
     C                     Z-ADDW1SLTM    I1SLTM
     C                     Z-ADDW1KEIS    I1KEIS
     C                     Z-ADDW1SETI    I1SETI
     C                     Z-ADDW1KMAL    I1KMAL
     C                     Z-ADDW1KMMN    I1KMMN
     C                     Z-ADDW1KMMX    I1KMMX
     C                     Z-ADDW1SRMS    I1SRMS
     C                     Z-ADDW1ALHK    I1ALHK
     C                     Z-ADDW1MXHK    I1MXHK
     C                     MOVELW1KSHK    I1KSHK
     C                     MOVELW1KOUT    I1KOUT
     C                     MOVELW1DOUT    I1DOUT
     C                     MOVELW1DTKO    I1DTKO
     C                     MOVELW1DTHE    I1DTHE
     C                     Z-ADDW1CHOS    I1CHOS
     C                     MOVELW1YOSI    I1YOSI
     C                     MOVELW1BAD1    I1BAD1
     C                     MOVELW1BAD2    I1BAD2
     C                     MOVELW1BAD3    I1BAD3
     C                     MOVELW1BAD4    I1BAD4
     C                     Z-ADDW1BZIK    I1BZIK
     C                     MOVELW1KIBN    I1KIBN
     C                     MOVELW1SNJ1    I1SNJ1
     C                     MOVELW1SNJ2    I1SNJ2
     C                     MOVELW1SNJ3    I1SNJ3
     C                     MOVELW1SNJ4    I1SNJ4
     C                     MOVELW1KHKO    I1KHKO
     C                     MOVELW1DHKO    I1DHKO
     C                     Z-ADDW1UKYY    I1UKYY
     C                     Z-ADDW1UKMM    I1UKMM
     C                     Z-ADDW1UKDD    I1UKDD
     C                     Z-ADDW1UBIN    I1UBIN
     C                     Z-ADDW1STYY    I1STYY
     C                     Z-ADDW1STMM    I1STMM
     C                     Z-ADDW1STDD    I1STDD
     C                     Z-ADDW1SBIN    I1SBIN
     C                     Z-ADDW1BZJR    I1BZJR
     C                     Z-ADDW2MKJR    I2MKJR
     C                     Z-ADDW2MSJR    I2MSJR
     C                     Z-ADDW2KMAL    I2KMAL
     C                     Z-ADDW2KMMN    I2KMMN
     C                     Z-ADDW2KMMX    I2KMMX
     C                     Z-ADDW2SRMS    I2SRMS
     C                     Z-ADDW2ALHK    I2ALHK
     C                     Z-ADDW2MXHK    I2MXHK
     C                     Z-ADDW2BOXP    I2BOXP
     C                     Z-ADDW2SA      I2SA
     C                     WRITEABMPPZ11
      *
     CSR         ESB500    ENDSR
