     H            Y.
     F** ABMR1A *********************************************
     F* PASS THROUGH CHECK
     F*    HOTTA.               2018.08.06                  *
     F*******************************************************
     FFCEPL40 IF  E           K        DISK
     F            FCEPP401                          KRENAMEFCEPL401
     FFCEPL41 IF  E           K        DISK
     F            FCEPP401                          KRENAMEFCEPL411
     FAAPTL01 IF  E           K        DISK
     FAANPL06 IF  E           K        DISK
     FAKBPL07 IF  E           K        DISK
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   60W@DTYM
     I                                        1   40W@DTYY
     I                                        5   60W@DTMM
     I                                        7   80W@DTDD
      *
     I            DS
     I                                        1   80L7SKHZ
     I                                        1   40L7SKYY
     I                                        5   60L7SKMM
     I                                        7   80L7SKDD
      *
     I            DS
     I                                        1   80L7STHZ
     I                                        1   40L7STYY
     I                                        5   60L7STMM
     I                                        7   80L7STDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P@SHN1  5
     C                     PARM           P@SHN2  5
     C                     PARM           P@SHN3  2
     C                     PARM           P@PAS   1
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C           KEYSHN    KLIST
     C                     KFLD           P@SHN1
     C                     KFLD           P@SHN2
     C                     KFLD           P@SHN3
     C                     MOVEL'0'       P@PAS
      * 2019.08.19
      *パススルー品も自動処理対象にするため
      *戻り値は強制的に'0'にする
      *
     C           KEYSHN    SETLLFCEPL401
     C           KEYSHN    READEFCEPL401                 80
     C           *IN80     DOWEQ'0'
     C           F4GSKD    IFEQ 'D'
     C           F4GSDT    ANDLE*DATE
     C                     ELSE
     C****                 MOVEL'1'       P@PAS
     C                     ENDIF
     C           KEYSHN    READEFCEPL401                 80
     C                     ENDDO
      *
     C           KEYSHN    SETLLFCEPL411
     C           KEYSHN    READEFCEPL411                 80
     C           *IN80     DOWEQ'0'
     C           F4GSKD    IFEQ 'D'
     C           F4GSDT    ANDLE*DATE
     C                     ELSE
     C****                 MOVEL'1'       P@PAS
     C                     ENDIF
     C           KEYSHN    READEFCEPL411                 80
     C                     ENDDO
      *
     C           KEYSHN    SETGTAAPTL011
     C           KEYSHN    REDPEAAPTL011                 82
     C           *IN82     DOWEQ'0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
     C           L5STHZ    IFEQ 99999999
     C           L5BMON    ANDEQ8990
     C                     MOVEL'1'       P@PAS
     C                     ENDIF
     C                     ENDIF
     C           KEYSHN    REDPEAAPTL011                 82
     C                     ENDDO
      *
     C           KEYSHN    SETGTAANPL061
     C           KEYSHN    REDPEAANPL061                 82
     C           *IN82     DOWEQ'0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLE*DATE
     C                     ELSE
     C           L7STHZ    IFEQ 99999999
     C           L7BMON    ANDEQ8990
     C                     MOVEL'1'       P@PAS
     C                     ENDIF
     C                     ENDIF
     C           KEYSHN    REDPEAANPL061                 82
     C                     ENDDO
      *
     C           KEYSHN    SETGTAKBPL071
     C           KEYSHN    REDPEAKBPL071                 82
     C           *IN82     DOWEQ'0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ELSE
     C           L1STHZ    IFEQ 99999999
     C           L1BMON    ANDEQ8990
     C                     MOVEL'1'       P@PAS
     C                     ENDIF
     C                     ENDIF
     C           KEYSHN    REDPEAKBPL071                 82
     C                     ENDDO
      *
     C                     CALL 'ABMR42'
     C                     PARM           P@SHN1  5
     C                     PARM           P@SHN2  5
     C                     PARM           P@SHN3  2
     C                     PARM           P9BMON  40
     C                     PARM           P9PROC  3
     C                     PARM           P9PASS  1
     C           P9PASS    IFEQ '2'
     C                     MOVELP9PASS    P@PAS
     C                     ENDIF
      * 2019.08.19
      *パススルー品も自動処理対象にするため
      *戻り値は強制的に'0'にする
     C                     MOVEL'0'       P@PAS
      *
     C                     SETON                     LR
     C                     RETRN
