     H            Y.
     F** ABMR74 *********************************************
     F* NON UPDATE DATA LIST (COMPONENTS PART)
     F*    HOTTA.               2018.06.07                  *
     F*******************************************************
     FABMWP70 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FABMWP74 O   F    0256            DISK                      A
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@DAYY
     I                                        5   60W@DAMM
     I                                        7   80W@DADD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     C                     TIME           WTIME
      *
     C                     EXCPTHD
     C           *HIVAL    SETGTABMWP701
     C                     READPABMWP701                 87
     C           *IN87     DOWEQ'0'
     C                     EXSR #SB001
     C                     READPABMWP701                 87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * FCEPP01                                          *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C           KEYFC1    KLIST
     C                     KFLD           W0SHN1
     C                     KFLD           W0SHN2
     C                     KFLD           W0SHN3
     C                     MOVEL*BLANK    WWSTRK  1
     C                     MOVEL*BLANK    WWSTRT  2
     C                     MOVEL*BLANK    WWSTRR  2
     C                     MOVEL*BLANK    WWSTRD  1
     C           KEYFC1    CHAINFCEPL011             25
     C           *IN25     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     25
     C                     ENDIF
     C           *IN25     IFEQ '0'
     C                     MOVELA2STRK    WWSTRK
     C                     MOVELA2STRT    WWSTRT
     C                     MOVELA2STRR    WWSTRR
     C                     MOVELA2STRD    WWSTRD
     C                     ENDIF
      *
     C                     EXCPTDT
      *
     CSR         ESB001    ENDSR
     OABMWP74 EADD             HD
     O                                      'LOCATION,'
     O                                      'PART NO.,'
     O                                      'BOX QTY,'
     O                                      'CURRENT SETTING,'
     O                                      'AFTER AUTO CHANGE,'
     O                                      'CURRENT SETTING BOX/DAY,'
     O                                      'AFTER AUTO CHANGE'
     O                                      ' BOX/DAY,'
     O                                      '+/- RATIO,'
     O        EADD             DT
     O                         WWSTRK
     O                                      '-'
     O                         WWSTRT
     O                                      '-'
     O                         WWSTRR
     O                                      '-'
     O                         WWSTRD
     O                                      ','
     O                         W0SHN1
     O                                      '-'
     O                         W0SHN2
     O                                      '-'
     O                         W0SHN3
     O                                      ','
     O                         W0SSYS
     O                                      ','
     O                         W0GEKN
     O                                      ','
     O                         W0NSRY
     O                                      ','
     O                         W0BOXD       '   0 . '
     O                                      ','
     O                         W0NBXD       '   0 . '
     O                                      ','
     O                         W0BOXP       '  0 .  '
     O                                      ','
