     H            Y.
     F** ABMR21 *********************************************
     F*設定数自動処理　メッキかんばんマスタ更新           *
     F* AUTO CHANGE MONTHLY SETTING # - UPDATE AAFPP01      *
     F*    HOTTA.            2018.06.11                     *
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.09|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F* CANCEL SPECIAL ADJUSTMENT                           *
     F*    C.SAKTHIP         2025.03.01                     *
     F*****************************************************************
     FABMWP21 UF  E                    DISK
     FGHCTL21 IF  E           K        DISK
     FAAFTL06 UF  E           K        DISK
     FABMWP30 O   E           K        DISK                      A
     FABMWP31 O   E                    DISK                      A
     FABMPPB5 IF  E           K        DISK
     FABMPPB6 IF  E           K        DISK
     FABMPL21 IF  E           K        DISK
      *
     I            DS
     I                                        1  100A3UKBI
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I                                        9  100A3UBIN
      *
     I            DS
     I                                        1  100A3TKBI
     I                                        1   40A3TKYY
     I                                        5   60A3TKMM
     I                                        7   80A3TKDD
     I                                        9  100A3TBIN
      *
     I            DS
     I                                        1   80A3KOHZ
     I                                        5   80A3KOMD
     I                                        1   40A3KOYY
     I                                        5   60A3KOMM
     I                                        7   80A3KODD
      *
     I            DS
     I                                        1  100A3HZBN
     I                                        1   40A3SYY
     I                                        5   60A3SMM
     I                                        7   80A3SDD
     I                                        9  100A3SBN
      *
     I            DS
     I                                        1   80AISKHZ
     I                                        1   40AISKYY
     I                                        5   60AISKMM
     I                                        7   80AISKDD
      *
     I            DS
     I                                        1   80AHSKHZ
     I                                        1   40AHSKYY
     I                                        5   60AHSKMM
     I                                        7   80AHSKDD
      *
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        5   60WTITS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I            DS
     I                                        1   9 ATKR
     I                                        1   1 ATKR1
     I                                        3   4 ATKR2
     I                                        6   7 ATKR3
     I                                        9   9 ATKR4
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              'OVER 1000'           C         ERR01
     I              'CURRENT 999'         C         ERR03
     I              'ACCOMMODATED-        C         ERR02
     I              ' QUANTITY=0'
     I              'UNDER 0'             C         ERR04
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           A3KTSU
     C                     PARM           A3SSYS
     C                     PARM           A3KEIS
     C                     PARM           A3READ
     C                     PARM           A3BARA
     C                     PARM           A3CBKO
     C                     PARM           A3LOTO
     C                     PARM           A3MAXH
     C                     PARM           WMAIS
      *
     C                     TIME           WTIME
     C           1         SETLLABMWP211
     C                     READ ABMWP211                 21
     C           *IN21     DOWEQ'0'
     C           W2OMIT    IFEQ '0'
     C           W2PAS     ANDEQ'0'
     C           W2OMIT    OREQ '1'
     C           W2PAS     ANDEQ'0'
     C                     EXSR #SB200
     C                     UPDATABMWP211
     C                     ENDIF
     C                     READ ABMWP211                 21
     C                     ENDDO
      *
     C                     MOVE 'LR'      ASTLR   2
     C                     CALL 'ABCR05'  ACALL
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *メッキかんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYA31    KLIST
     C                     KFLD           #K1HB5  5
     C                     KFLD           #K2HB5  5
     C                     KFLD           #K3HB2  2
      *
     C                     MOVELW2SHN1    #K1HB5
     C                     MOVELW2SHN2    #K2HB5
     C                     MOVELW2SHN3    #K3HB2
     C           KEYA31    SETGTAAFTL061
     C           KEYA31    REDPEAAFTL061                 82
     C           *IN82     DOWEQ'0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     ELSE
     C           A3STHZ    IFEQ 99999999
     C                     Z-ADDWTIYY     A3KOYY
     C                     Z-ADDWTIMM     A3KOMM
     C                     Z-ADDWTIDD     A3KODD
     C                     Z-ADDWTITH     A3KOHH
     C                     Z-ADDWTITM     A3KOSS
     C*                    MOVELW#USER    A3KOME
     C                     MOVEL'ZIDOU'   A3KOME    P
     C***        A3KMAX    IFEQ 999
     C           A3KMAX    IFEQ 99999
     C                     CLEARABMWP301
     C                     MOVELERR03     ABTXT
     C                     EXSR #SB800
     C                     MOVEL'6'       W2OMIT
     C                     ELSE
     C                     EXSR #SB400
     C                     EXSR #SB410
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C           KEYA31    REDPEAAFTL061                 82
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      * GHCPP21より設定数       *
      *---------------------------*
     CSR         #SB400    BEGSR
      *
     C                     SETOF                     99
     C           KEYMD1    KLIST
     C                     KFLD           #KMBN1  1
     C                     KFLD           #KMBN2  2
     C                     KFLD           #KMBN3  2
     C                     KFLD           #KMBN4  1
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  2
      *
     C                     MOVELA3ATK1    #KMBN1
     C                     MOVELA3ATK2    #KMBN2
     C                     MOVELA3ATK3    #KMBN3
     C                     MOVELA3ATK4    #KMBN4
     C                     MOVELA31HB5    #KMHN1
     C                     MOVELA32HB5    #KMHN2
     C                     MOVELA33HB2    #KMHN3
     C                     Z-ADD0         WKSRYO  90
     C           KEYMD1    SETLLGHCTL211
     C           KEYMD1    READEGHCTL211                 83
     C           *IN83     DOWEQ'0'
     C                     Z-ADDMDSRYO    WKSRYO
     C                     EXSR #SB405
     C           KEYMD1    READEGHCTL211                 83
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *---------------------------*
      * ABMPL21チェック         *
      *---------------------------*
     CSR         #SB405    BEGSR
      *
     C           KEY21     KLIST
     C                     KFLD           W2NTYM
     C                     KFLD           MDJHN1
     C                     KFLD           MDJHN2
     C                     KFLD           MDJHN3
     C                     Z-ADD0         W@FFF   90
     C                     Z-ADD0         N4FSD1  90
     C                     Z-ADD0         N4FSM1  90
     C           KEY21     CHAINABMPL211             48
     C           *IN48     IFEQ '0'
      *
     C           S4OMIT    IFEQ '0'
     C                     Z-ADDS4FSD1    N4FSD1
     C           S4FSD1    MULT 20        N4FSM1
     C                     ELSE
     C****                 SETON                     99
     C                     ENDIF
      *
     C                     ENDIF
      *
     CSR         ESB405    ENDSR
      *---------------------------*
      *かんばん枚数計算         *
      *---------------------------*
     CSR         #SB410    BEGSR
      *
     C                     MOVEL*BLANK    P@PAS
     C                     CALL 'ABMR1B'
     C                     PARM           A31HB5
     C                     PARM           A32HB5
     C                     PARM           A33HB2
     C                     PARM           P@PAS   1
      *
     C                     Z-ADDA3KSNK    KSKBN   10
     C                     Z-ADDA3SSYS    @BSSYS
     C                     MOVELA3SSYT    @BSSYT
     C                     Z-ADDA3KTSU    @BKTSU
     C                     Z-ADDA3KMAX    @BKMAX
     C                     Z-ADDA3MAXH    @BMAXH
     C                     Z-ADDA3BARA    @BKLOT
     C                     Z-ADDA3PADJ    @BPADJ
     C                     Z-ADDA3AUAJ    @BAUAJ
     C                     Z-ADDA3DUPH    @BDUPH
     C                     Z-ADDA3OTHH    @BOTHH
     C                     MOVEL*BLANK    @5DUP@
     C                     Z-ADD0         @5DUP#
     C           WKSRYO    DIV  20        @3KTSU  90
      *  PLASTIC
     C           WKSRYO    DIV  20        @4KTSU  90
     C           N4FSD1    IFGT @4KTSU
     C                     Z-ADDN4FSD1    @4KTSU
     C                     ENDIF
      * A-PICS
     C                     CALL 'ABMR43'
     C                     PARM           A31HB5  5
     C                     PARM           A32HB5  5
     C                     PARM           A33HB2  2
     C                     PARM           P9BMON  40
     C                     PARM           P9PROC  3
     C                     PARM           P9TKR   6
     C                     PARM           P9SHR   1
     C                     MOVEL'0'       APICS   1
     C           A3ATKR    IFEQ P9TKR
     C                     MOVEL'1'       APICS   1
     C                     ELSE
     C* LOCATION CODE '0' IS ALWAYS APICS
     C           A3ATK1    IFEQ '0'
     C                     MOVEL'1'       APICS   1
     C                     ENDIF
     C                     ENDIF
     C*
     C           APICS     IFEQ '1'
     C                     EXSR #SB700
     C                     ELSE
     C                     EXSR #SB710
     C                     ENDIF
      *
     C           W2OMIT    IFEQ '0'
      * A-PICS
     C           APICS     IFEQ '1'
     C                     SELEC
     C           @3KTSU    WHLT A3KTSU
     C                     MOVEL'51'      A3STI1
     C           @3KTSU    WHGT A3KTSU
     C                     MOVEL'52'      A3STI1
     C                     ENDSL
      * PLASTIC
     C                     ELSE
     C                     SELEC
     C           @4KTSU    WHLT A3KTSU
     C                     MOVEL'51'      A3STI1
     C           @4KTSU    WHGT A3KTSU
     C                     MOVEL'52'      A3STI1
     C                     ENDSL
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           W2OMIT    IFEQ '1'
     C                     MOVEL'53'      A3STI1
     C                     ENDIF
      * 確定設定数
     C           W2OMIT    IFEQ '0'
      *
     C                     Z-ADD@3KTSU    A3KTSU
      * PLASTICはN+1も比較
     C           APICS     IFEQ '0'
     C           N4FSD1    IFGT @3KTSU
     C                     Z-ADDN4FSD1    A3KTSU
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      * 計算設定数
     C           W2OMIT    IFEQ '0'
     C           WKSRYO    DIV  20        A3KSSU
     C                     ENDIF
     C                     Z-ADDA3KALL    WKALL   50
     C                     Z-ADDA3KMIN    WMIN    50
     C                     Z-ADDA3KMAX    WMAX    50
     C                     Z-ADDA3KMAX    SVKMAX  50
     C           A3KALL    IFLT A3KMAX
     C                     Z-ADDA3KMAX    WALL    50
     C                     ELSE
     C                     Z-ADDA3KALL    WALL
     C                     ENDIF
     C           A3DOUT    IFEQ 'Y'
     C                     Z-ADDA3KMAX    A3KAIS
     C                     ENDIF
      ***************************************************
 S---C           A3DTKO    IFNE '0'
      *
|    C           A3SSYS    IFEQ 0
     C                     MOVEL'6'       W2OMIT
|    C                     CLEARABMWP301
|    C                     MOVELERR02     ABTXT
|    C                     EXSR #SB800
|    C                     GOTO ESB410
|    C                     ENDIF
 |    *
 |   C                     MOVE *BLANK    ASTLR            SETON LR ﾍｭcﾆg
 |   C                     Z-ADD0         WMAIS   50
      *自動処理調整をゼロにするA-PICS以外
     C           APICS     IFEQ '0'
     C                     Z-ADD0         W1MAIS  40
     C                     ADD  A3KAIH    W1MAIS
     C                     ADD  A3SINH    W1MAIS
     C                     ADD  A3DUPH    W1MAIS
     C                     ADD  A3HRH1    W1MAIS
     C                     ADD  A3HRH2    W1MAIS
     C                     ADD  A3HRH3    W1MAIS
     C                     ADD  A3HRH4    W1MAIS
     C                     ADD  A3MNDS    W1MAIS
     C                     ADD  A3HRYO    W1MAIS
     C                     ADD  A3HLTS    W1MAIS
     C                     ADD  A3JTEI    W1MAIS
     C                     ADD  A3SKJI    W1MAIS
     C                     ADD  A3PADJ    W1MAIS
     C                     ADD  A3OTHH    W1MAIS
     C                     Z-ADDW1MAIS    A3MAXH
     C                     Z-ADDW1MAIS    A3AMXH
     C                     Z-ADD0         A3AUAJ
     C                     ENDIF
 |   C                     CALL 'ABCR05'  ACALL
     C           APICS     IFEQ '0'
     C                     EXSR #SB720
     C           WMAIS     IFLT 8
     C                     Z-ADD8         WMAIS
     C                     ENDIF
     C                     ENDIF
      *
     C*****      WMAIS     IFGT 999
     C           WMAIS     IFGT 9999
     C                     MOVEL'6'       W2OMIT
     C                     CLEARABMWP301
     C                     MOVELERR01     ABTXT
     C                     EXSR #SB800
     C                     ENDIF
 |    * ????
 |   C           WMAIS     IFGT A3KMAX
 |   C                     MOVE '8'       A3DTKO
 |   C                     ELSE
 |   C                     MOVE '9'       A3DTKO
 |   C                     ENDIF
 |    *
 |   C                     Z-ADDWMAIS     A3KMAX
 |   C                     Z-ADDA3KMAX    WKMAX   50
 | S-C           A3DTKO    IFEQ '2'
 | | C           A3DTKO    OREQ 'D'
 | | C                     GOTO CAE
 | E-C                     ENDIF
 | S-C           A3DOUT    IFNE *BLANK
 | | C                     Z-ADDWALL      A3KALL
 | | C                     Z-ADDWMAX      A3KMIN
 | E-C                     ENDIF
 |   C           *YEAR     CABEQA3KOYY    CA2
 |   C           *YEAR     SUB  A3KOYY    WYY     40
 | S-C           WYY       IFLE 01
 | | C                     Z-ADDUMONTH    XXMM
 | | C                     Z-ADDUDAY      XXDD
 | | C           XXMD      CABLEA3KOMD    CA2
 | E-C                     ENDIF
 |   C           A3KALL    CABLTA3KMIN    CA2
 |   C           A3KMIN    CABGE30        CA2
 |   C                     SETOF                     30
 |   C           CA2       TAG
 |   C                     Z-ADD0         A3SRMS
 | S-C           A3DOUT    IFNE *BLANK
 | | C                     MOVE *BLANK    A3KSHK
 | | C                     Z-ADD0         A3ALHK
 | | C                     Z-ADD0         A3MXHK
 | E-C                     ENDIF
 |S--C           A3KSNK    IFEQ KSKBN
 ||  C           A3DOUT    CABEQ'Y'       CAE
 ||  C           A3KSHK    CABEQ*BLANK    CAE
 ||  C                     Z-ADDA3ALHK    WKALL
 ||  C                     Z-ADDA3MXHK    WMAX
 |+--C                     ELSE
 ||S-C           A3KSHK    IFNE *BLANK
 ||| C                     Z-ADDA3ALHK    WKALL
 ||| C                     Z-ADDA3MXHK    WMAX
 ||E-C                     ENDIF
 |E--C                     ENDIF
 | S-C           WKALL     IFGT WMAX
 | | C           WKALL     SUB  WMAX      A3SRMS
 | E-C                     ENDIF
 |   C           CAE       TAG
 |    *
 E---C                     ENDIF
      *
S----C           A3DTKO    IFNE '0'
|     *
|    C**  ﾜｮn  **
|    C                     SETOF                     30
|    C                     SETOF                     25
|    C           A3STHZ    COMP *DATE                25  25
|    C   25                Z-ADDA3STYY    A3SYY
|    C   25                Z-ADDA3STMM    A3SMM
|    C   25                Z-ADDA3STDD    A3SDD
|    C   25                Z-ADDA3SBIN    A3SBN
|    C  N25                Z-ADD*YEAR     A3SYY
|    C  N25                Z-ADDUMONTH    A3SMM
|    C  N25                Z-ADDUDAY      A3SDD
|    C  N25                Z-ADD01        A3SBN
|     *
|  S-C           A3KSNK    IFEQ KSKBN
|  | C           A3DOUT    CABEQ'Y'       STP5
|  | C           A3KSHK    CABEQ*BLANK    STP5
|  E-C                     ENDIF
|  S-C           A3DOUT    IFNE *BLANK
|  | C                     MOVE 'H'       A3KSHK
|  | C                     Z-ADDWKALL     A3ALHK
|  | C                     Z-ADDWMAX      A3MXHK
|  E-C                     ENDIF
|    C           STP5      TAG
|S---C           A3DTKO    IFNE '2'
||   C           A3DTKO    ANDNE'D'
||S--C           KSKBN     IFEQ A3KSNK
|||S-C           A3KMIN    IFEQ A3KMAX
|||| C                     GOTO SP1
|||E-C                     ENDIF
||E--C                     ENDIF
|E---C                     ENDIF
|    C                     MOVE *BLANK    A3DOUT
|    C                     MOVE 'Y'       A3KOUT
|    C           SP1       TAG
|    C                     Z-ADDKSKBN     A3KSNK
E----C                     ENDIF
      *
     C                     MOVEL'ZIDOU'   A3KOME    P
     C                     Z-ADD*DATE     A3KOHZ
     C                     TIME           WTIME
      *
S----C           A3DTKO    IFEQ '0'
|    C                     ELSE
|S---C           A3DTKO    IFNE '6'
||   C           A3DTKO    ANDNE'2'
||   C           A3DTKO    ANDNE'D'
||   C           A3UKHZ    ANDLE*DATE
|| S-C           A3DTKO    IFNE 'E'
|| | C                     MOVE '1'       A3DTKO
|| E-C                     ENDIF
||   C                     MOVE '*'       A3DTHE
     C           *IN99     IFEQ '0'
||   C                     UPDATAAFTL061
     C                     ENDIF
     C                     EXSR #SB810
|+---C                     ELSE
||   C**  ﾇﾞx]ﾍlﾑchﾎﾞ]  **
||S--C           A3DTKO    IFEQ '2'
|||  C           A3DTKO    OREQ 'D'
|||  C                     Z-ADD0         A3TKBI
||+--C                     ELSE
|||  C                     SETON                     51
|||  C                     Z-ADD0         A3TKBI
||E--C                     ENDIF
||    *
||S--C           A3DTKO    IFNE 'E'
|||S-C           A3DTKO    IFEQ 'D'
|||| C                     MOVE 'E'       A3DTKO
|||+-C                     ELSE
|||| C                     MOVE '1'       A3DTKO
|||E-C                     ENDIF
||E--C                     ENDIF
||   C                     MOVE '*'       A3DTHE
||   C                     Z-ADDA3UKBI    A3TKBI
     C           *IN99     IFEQ '0'
||   C                     UPDATAAFTL061
     C                     ENDIF
     C                     EXSR #SB810
|E---C                     ENDIF
E----C                     ENDIF
      *
     CSR         ESB410    ENDSR
      *---------------------------*
      * A-PICS 最大日当り出荷（売上実績から）   *
      *---------------------------*
     CSR         #SB700    BEGSR
      *
     C                     MOVEL*BLANK    @5DUP@
     C                     Z-ADD0         @5DUP#
     C                     CALL 'ABMR44'
     C                     PARM           A31HB5  5
     C                     PARM           A32HB5  5
     C                     PARM           A33HB2  2
     C                     PARM           P9NOHZ  80
     C                     PARM           P9HAKO  90
      * ORDER DATA(N) ABMR4G(NOT PT)
      * ORDER DATA(N,N+1) ABMR4E(PT)
     C                     Z-ADD0         P7NOHZ
     C                     Z-ADD0         P7HAKO
     C           P@PAS     IFEQ '0'
     C                     CALL 'ABMR4G'
     C                     PARM           A31HB5  5
     C                     PARM           A32HB5  5
     C                     PARM           A33HB2  2
     C                     PARM           P7NOHZ  80
     C                     PARM           P7HAKO  90
     C                     ELSE
     C                     CALL 'ABMR4E'
     C                     PARM           A31HB5  5
     C                     PARM           A32HB5  5
     C                     PARM           A33HB2  2
     C                     PARM           P7NOHZ  80
     C                     PARM           P7HAKO  90
     C                     ENDIF
      *
     C           P7HAKO    IFGT P9HAKO
     C                     Z-ADDP7NOHZ    P9NOHZ
     C                     Z-ADDP7HAKO    P9HAKO
     C                     ENDIF
      *
     C*                    CALL 'ABMR4C'
     C*                    PARM           A31HB5  5
     C*                    PARM           A32HB5  5
     C*                    PARM           A33HB2  2
     C*                    PARM           P9TAKO 112
     C*                    PARM           P9DUPH  30
     C                     Z-ADD0         P9DUPH  30
      *
     C                     Z-ADD0         WKDUPH  51
     C                     Z-ADD0         W@HAKD  51
     C           WKSRYO    DIV  20        W@KSSU  90
     C           W2SSYS    IFNE 0
     C           W@KSSU    DIV  W2SSYS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C           P9HAKO    SUB  W@HAKD    WKDUPH
     C                     Z-ADD0         @3DUPH  30
     C           WKDUPH    IFGE 1
     C           WKDUPH    ADD  0.9       @3DUPH
     C                     ENDIF
     C                     Z-ADD0         DUPSA   30
     C                     Z-ADD0         DUPPER  71
     C                     ADD  P9DUPH    @3DUPH
     C                     Z-ADDP9DUPH    @CMAX
     C                     Z-ADD@3DUPH    @5DUP#
     C           @BDUPH    SUB  @3DUPH    DUPSA
     C           DUPSA     DIV  W@HAKD    DUPPER    H
     C           DUPSA     IFGE 16
     C           DUPPER    ANDGE5
     C           DUPSA     ORLE -16
     C           DUPPER    ANDGE5
     C                     MOVEL'@'       @5DUP@
     C                     ELSE
     C                     Z-ADD@3DUPH    A3DUPH
     C                     Z-ADD0         A3AMXH
     C                     ADD  A3KAIH    A3AMXH
     C                     ADD  A3SINH    A3AMXH
     C                     ADD  A3DUPH    A3AMXH
     C                     ADD  A3HRH1    A3AMXH
     C                     ADD  A3HRH2    A3AMXH
     C                     ADD  A3HRH3    A3AMXH
     C                     ADD  A3HRH4    A3AMXH
     C                     ADD  A3HRYO    A3AMXH
     C                     ADD  A3OTHH    A3AMXH
     C                     ADD  A3HLTS    A3AMXH
     C                     ADD  A3JTEI    A3AMXH
     C                     ADD  A3SKJI    A3AMXH
     C                     ADD  A3PADJ    A3AMXH
     C                     ADD  A3AUAJ    A3AMXH
     C                     Z-ADDA3AMXH    A3MAXH
     C                     ENDIF
      *
     CSR         ESB700    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB710    BEGSR
      *
     C                     Z-ADD0         WKADJU  30
     C           KEYB6     KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C           KEYB6     CHAINABMPPB61             94
     C           *IN94     IFEQ '0'
     C           AISKJY    ANDEQ'D'
     C           AISKHZ    ANDLE*DATE
     C                     SETON                     94
     C                     ENDIF
     C           *IN94     IFEQ '0'
     C                     Z-ADDAIADJU    WKADJU
     C                     ELSE
     C                     EXSR #SB711
     C                     ENDIF
      *
     CSR         ESB710    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB711    BEGSR
      *
     C           WKSRYO    DIV  20        W@KSSU  90
     C           N4FSD1    IFGT W@KSSU
     C                     Z-ADDN4FSD1    W@KSSU  90
     C                     ENDIF
     C                     Z-ADD0         W@HAKD  51
     C           W2SSYS    IFNE 0
     C           W@KSSU    DIV  W2SSYS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C                     Z-ADD0         WKADJU  30
     C           KEYB5     KLIST
     C                     KFLD           A3KCD1
     C                     KFLD           A3KCD2
     C                     MOVEL'0'       GET     1
     C           KEYB5     SETLLABMPPB51
     C           KEYB5     READEABMPPB51                 94
     C           *IN94     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           AHSKJY    IFEQ 'D'
     C           AHSKHZ    ANDLE*DATE
     C                     ELSE
     C                     SELEC
     C           AHFUGO    WHEQ '1'
     C           W@HAKD    IFLT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '2'
     C           W@HAKD    IFGT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '3'
     C           W@HAKD    IFEQ AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '4'
     C           W@HAKD    IFLE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '5'
     C           W@HAKD    IFGE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '6'
     C           W@HAKD    IFNE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C                     ENDSL
     C                     ENDIF
     C           KEYB5     READEABMPPB51                 94
     C                     ENDDO
      *
     CSR         ESB711    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB720    BEGSR
      *
     C                     Z-ADD0         SA@     50
      *今回ー前回　枚数
     C           WMAIS     SUB  SVKMAX    SA      50
     C                     Z-ADDSA        SA@
     C                     MULT -1        SA@
      *今回/前回
     C                     Z-ADD0         RITU    72
     C           SVKMAX    IFNE 0
     C           WMAIS     DIV  SVKMAX    RITU
     C                     ENDIF
      *
     C                     MULT 100       RITU
     C           RITU      IFGE 100
     C                     SUB  100       RITU
     C                     ELSE
     C           100       SUB  RITU      RITU
     C                     ENDIF
      *
     C           RITU      IFLT WKADJU
     C           WMAIS     ORLE 12
     C                     Z-ADDSA@       A3AUAJ
     C                     ADD  A3AUAJ    A3AMXH
     C                     ADD  A3AUAJ    A3MAXH
     C                     Z-ADD0         WMAIS
     C                     CALL 'ABCR05'  ACALL
     C                     ENDIF
      *
     CSR         ESB720    ENDSR
      *---------------------------*
      *エラーファイル           *
      *---------------------------*
     CSR         #SB800    BEGSR
      *
     C                     MOVELA31HB5    ABJHN1
     C                     MOVELA32HB5    ABJHN2
     C                     MOVELA33HB2    ABJHN3
     C                     MOVELA3ATK1    ABATK1
     C                     MOVELA3ATK2    ABATK2
     C                     MOVELA3ATK3    ABATK3
     C                     MOVELA3ATK4    ABATK4
     C                     MOVELA3KCD1    ABKCD1
     C                     MOVELA3KCD2    ABKCD2
     C                     WRITEABMWP301
      *
     CSR         ESB800    ENDSR
      *---------------------------*
      *結果                     *
      *---------------------------*
     CSR         #SB810    BEGSR
      *
     C                     MOVELA3KCD1    @BKCD1
     C                     MOVELA3KCD2    @BKCD2
     C                     MOVELA31HB5    @BJHN1
     C                     MOVELA32HB5    @BJHN2
     C                     MOVELA33HB2    @BJHN3
     C                     MOVELA3ATOB    @BATOB
     C                     MOVELA3ATOK    @BATOK
     C                     MOVELA3ATK1    @BATK1
     C                     MOVELA3ATK2    @BATK2
     C                     MOVELA3ATK3    @BATK3
     C                     MOVELA3ATK4    @BATK4
     C                     Z-ADDA3KTSU    @AKTSU
     C                     Z-ADDA3KMAX    @AKMAX
     C                     Z-ADDA3MAXH    @AMAXH
     C                     Z-ADDA3BARA    @AKLOT
     C                     Z-ADDA3PADJ    @APADJ
     C                     Z-ADDA3AUAJ    @AAUAJ
     C                     Z-ADDA3DUPH    @ADUPH
     C                     Z-ADDA3OTHH    @AOTHH
     C                     Z-ADDWKSRYO    @ANSRY
      *
     C                     Z-ADD0         @UMAXD
     C                     Z-ADD0         @UMAX
     C           APICS     IFEQ '1'
     C                     Z-ADDP9NOHZ    @UMAXD
     C                     Z-ADDP9HAKO    @UMAX
     C                     ENDIF
     C                     Z-ADDW@HAKD    @NBOXD
     C                     MOVELAPICS     @APICS
     C           @AKMAX    SUB  @BKMAX    @SA
     C                     Z-ADD0         @SA2
     C           @AKMAX    SUB  @AAUAJ    R123    30
     C           @BKMAX    IFNE 0
     C           R123      DIV  @BKMAX    @SA2
     C                     ENDIF
     C                     MOVEL' '       @AKERR
     C           *IN99     IFEQ '1'
     C                     MOVEL'*'       @AKERR
     C                     ENDIF
      *
     C                     WRITEABMWP311
      *
     CSR         ESB810    ENDSR
