     H            Y.
     F** ABMRFA *********************************************
     F*副資材　型番別設定数
     F*   HOTTA.          2018.10.04                        *
     F*******************************************************
     FABMWPF9 IF  E           K        DISK
     FABMPPF9 O   E                    DISK
      *
     I            DS
     I                                        1  12 WKSHN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      *
     C                     READ ABMWPF91                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB200
     C                     READ ABMWPF91                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C                     CLEARABMPPF91
     C                     Z-ADD*DATE     F9KOHZ
     C                     TIME           F9KOTI
     C                     MOVELW#USER    F9KOME
     C                     Z-ADD*DATE     F9CRDT
     C                     MOVELW2KATA    F9KATA
     C                     Z-ADDW2SUGE    F9SUGE
     C                     Z-ADDW2SU      F9SU
     C                     Z-ADDW2HAKD    F9HAKD
     C                     WRITEABMPPF91
      *
     CSR         ESB200    ENDSR
