     H            Y.
     F** ABMR7A *********************************************
     F* NON UPDATE DATA LIST
     F*    HOTTA.               2018.08.23                  *
     F*******************************************************
     FABMPL11 IF  E           K        DISK
     FABMWP70 O   E                    DISK                      A
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@DAYY
     I                                        5   60W@DAMM
     I                                        7   80W@DADD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I            DS
     I                                        1   8 CTIHZ
     I                                        1   2 CTIMM
     I                                        3   4 CTIDD
     I                                        5   8 CTIYY
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              'NON AUTO SETTING '   C         FNAM1
     I              'PARTS# LIST '        C         FNAM2
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
     C                     PARM           P@OMIT  1
     C                     PARM           P@FNAM 30
      *
     C                     TIME           WTIME
      *
     C                     MOVE WTIMM     CTIMM
     C                     MOVE WTIDD     CTIDD
     C                     MOVE WTIYY     CTIYY
     C                     MOVEL*BLANK    P@FNAM
     C                     SELEC
     C           P@OMIT    WHEQ '1'
     C           FNAM1     CAT  FNAM2:1   P@FNAM
     C********             MOVELFNAM1     P@FNAM
     C*****      FNAM1     CAT  CTIHZ:1   P@FNAM
     C                     ENDSL
      *
     C           KEYGT     KLIST
     C                     KFLD           S3NTYM
     C                     KFLD           S3SHN1
     C                     KFLD           S3SHN2
     C                     KFLD           S3SHN3
      *
     C                     Z-ADDP@DTYM    K@DTYM  60
     C           K@DTYM    SETLLABMPL111
     C           K@DTYM    READEABMPL111                 87
     C           *IN87     DOWEQ'0'
     C           S3OMIT    IFEQ P@OMIT
     C                     EXSR #SB001
     C           KEYGT     SETGTABMPL111
     C                     ENDIF
     C           K@DTYM    READEABMPL111                 87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * FCEPP01                                          *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C                     CLEARABMWP701
     C                     Z-ADDS3CRDT    W0CRDT
     C                     MOVELS3SHN1    W0SHN1
     C                     MOVELS3SHN2    W0SHN2
     C                     MOVELS3SHN3    W0SHN3
     C                     Z-ADDS3NSRY    W0NSRY
     C                     Z-ADDS3NSRD    W0NSRD
     C                     Z-ADDS3NTYM    W0NTYM
     C                     MOVELS3OMIT    W0OMIT
     C                     MOVELS3PAS     W0PAS
     C                     Z-ADDS3GEKN    W0GEKN
     C           S3SSYS    IFNE 0
     C           S3HIKN    DIV  S3SSYS    W0BOXD
     C                     ENDIF
     C                     Z-ADDS3SSYS    W0SSYS
     C                     WRITEABMWP701
      *
     CSR         ESB001    ENDSR
