     H            Y.
     F** ABMR46 *********************************************
     F* SALES DATA VS FORECAST
     F*    HOTTA.               2018.09.04                  *
     F*******************************************************
     FAB#PL06 IF  E           K        DISK
     FABBPL06 IF  E           K        DISK
     FABMWP46 O   F    0256            DISK                      A
      *
     I            DS
     I                                        1   80W@DATE
     I                                        1   60W@DTYM
     I                                        1   40W@DTYY
     I                                        5   60W@DTMM
     I                                        7   80W@DTDD
      *
     I            DS
     I                                        1   60W@M1YM
     I                                        1   40W@M1YY
     I                                        5   60W@M1MM
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
     C                     MOVEL*BLANK    HDF     1
     C                     Z-ADD*DATE     W@DATE
     C                     Z-ADDW@DTYM    W@NTYM  60
      * N-1
     C           W@DTMM    IFEQ 1
     C                     SUB  1         W@DTYY
     C                     Z-ADD12        W@DTMM
     C                     ELSE
     C                     SUB  1         W@DTMM
     C                     ENDIF
     C                     Z-ADDW@DTYM    W@M1YM
      *
     C           KEYAB     KLIST
     C                     KFLD           K1NOYY  40
     C                     KFLD           K1NOMM  20
     C                     Z-ADDW@M1YY    K1NOYY
     C                     Z-ADDW@M1MM    K1NOMM
      *
     C           KEYAB     SETLLAB#PL061
     C           KEYAB     READEAB#PL061                 83
     C           *IN83     DOWEQ'0'
     C           B1SKJY    IFEQ 'D'
     C           B1SKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB411
     C                     ENDIF
     C           KEYAB     READEAB#PL061                 83
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------------------------*
      * SALES DATA                                  *
      *---------------------------------------------*
     CSR         #SB411    BEGSR
      *
     C           KEYB11    KLIST
     C                     KFLD           W@NTYM  60
     C                     KFLD           B1SHN1
     C                     KFLD           B1SHN2
     C                     KFLD           B1SHN3
     C                     KFLD           B1TOKU
     C                     KFLD           B1NONY
     C           KEYB11    CHAINABBPL061             82
     C           *IN82     IFEQ '1'
     C           HDF       IFEQ *BLANK
     C                     MOVEL'1'       HDF
     C                     EXCPTHD
     C                     ENDIF
     C                     EXCPTDT
     C                     ENDIF
      *
     CSR         ESB411    ENDSR
     OABMWP46 EADD             HD
     O                                      'CUSTOMER,'
     O                                      'DELIVERY,'
     O                                      'FACTORY,'
     O                                      'DOCK,'
     O                                      'USER PART NO.,'
     O                                      'PART NO.,'
     O                                      'DELIVERY DATE,'
     O                                      'QTY,'
     O        EADD             DT
     O                         B1TOKU
     O                                      ','
     O                         B1NONY
     O                                      ','
     O                         B1NKOJ
     O                                      ','
     O                         B1NUKE
     O                                      ','
     O                         B1MHN1
     O                                      '-'
     O                         B1MHN2
     O                                      '-'
     O                         B1MHN3
     O                                      ','
     O                         B1SHN1
     O                                      '-'
     O                         B1SHN2
     O                                      '-'
     O                         B1SHN3
     O                                      ','
     O                         B1NOHZ
     O                                      ','
     O                         B1SRYO
