     H            Y.
     F** ABMR23 *********************************************
     F*設定数自動処理　完成品かんばんマスタ更新           *
     F*  HOTTA.            2018.07.05                       *
     F*******************************************************
     FABMWP31 IF  E                    DISK
     FGHCTL21 IF  E           K        DISK
     FAAPTL01 UF  E           K        DISK
      *
     I            DS
     I                                        1   80L5KOHZ
     I                                        1   40L5KOYY
     I                                        5   80L5KOMD
     I                                        5   60L5KOMM
     I                                        7   80L5KODD
      *
     I            DS
     I                                        1  100L5TKBI
     I                                        1   40L5TKYY
     I                                        5   60L5TKMM
     I                                        7   80L5TKDD
     I                                        9  100L5TBIN
      *
     I            DS
     I                                        1  100L5HZBN
     I                                        1   40L5UYY
     I                                        5   60L5UMM
     I                                        7   80L5UDD
     I                                        9  100L5UBN
      *
     I            DS
     I                                        1  100L5HIBN
     I                                        1   40L5SYY
     I                                        5   60L5SMM
     I                                        7   80L5SDD
     I                                        9  100L5SBN
      *
     I            DS
     I                                        1   60@@YM
     I                                        1   40@YY
     I                                        5   60@MM
      *
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        5   60WTITS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C           1         SETLLABMWP311
     C                     READ ABMWP311                 21
     C           *IN21     DOWEQ'0'
     C           @AKERR    IFEQ '*'
     C           @BKCD1    ANDEQ'0'
     C                     EXSR #SB200
     C                     ENDIF
     C                     READ ABMWP311                 21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *完成品かんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYL51    KLIST
     C                     KFLD           #K1HB5  5
     C                     KFLD           #K2HB5  5
     C                     KFLD           #K3HB2  2
      *
     C                     MOVEL@BJHN1    #K1HB5
     C                     MOVEL@BJHN2    #K2HB5
     C                     MOVEL@BJHN3    #K3HB2
     C           KEYL51    SETGTAAPTL011
     C           KEYL51    REDPEAAPTL011                 82
     C           *IN82     DOWEQ'0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
     C           L5STHZ    IFEQ 99999999
     C                     Z-ADDWTIYY     L5KOYY
     C                     Z-ADDWTIMM     L5KOMM
     C                     Z-ADDWTIDD     L5KODD
     C                     Z-ADDWTITH     L5KOHH
     C                     Z-ADDWTITM     L5KOSS
     C                     MOVEL'ZIDOU'   L5KOME    P
     C                     EXSR #SB400
     C           WKSRYO    DIV  20        L5KSSU
     C                     UPDATAAPTL011
     C                     ENDIF
     C                     ENDIF
     C           KEYL51    REDPEAAPTL011                 82
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      * GHCPP21より設定数       *
      *---------------------------*
     CSR         #SB400    BEGSR
      *
     C                     SETOF                     99
     C           KEYMD1    KLIST
     C                     KFLD           #KMBN1  1
     C                     KFLD           #KMBN2  2
     C                     KFLD           #KMBN3  2
     C                     KFLD           #KMBN4  1
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  2
      *
     C                     MOVELL5TKR1    #KMBN1
     C                     MOVELL5TKR2    #KMBN2
     C                     MOVELL5TKR3    #KMBN3
     C                     MOVELL5TKR4    #KMBN4
     C                     MOVELL5SHN1    #KMHN1
     C                     MOVELL5SHN2    #KMHN2
     C                     MOVELL5SHN3    #KMHN3
     C                     MOVEL'0'       FGET2   1
     C                     Z-ADD0         WKSRYO  90
     C           KEYMD1    SETLLGHCTL211
     C           KEYMD1    READEGHCTL211                 83
     C           *IN83     DOWEQ'0'
     C           FGET2     ANDEQ'0'
     C                     Z-ADDMDSRYO    WKSRYO
     C                     MOVEL'1'       FGET2
     C           KEYMD1    READEGHCTL211                 83
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
