     H            Y.
     F** ABMRF9 *********************************************
     F*副資材　型番別データ
     F*   HOTTA.          2018.10.04                        *
     F*******************************************************
     FABMWPF1 IF  E           K        DISK
     FGCQPL31 IF  E           K        DISK
     FABMWPF9 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  12 WKSHN
     I                                        1   5 WKSHN1
     I                                        6  10 WKSHN2
     I                                       11  12 WKSHN3
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      *
     C                     READ ABMWPF11                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB200
     C                     READ ABMWPF11                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C                     Z-ADD0         WKHAKD  92
     C           W1SU      DIV  20        W@SU   110
     C           W1SSYS    IFNE 0
     C           W@SU      DIV  W1SSYS    WKHAKD    H
     C                     ENDIF
      *
     C           KEYGCQ    KLIST
     C                     KFLD           W1SHN1
     C                     KFLD           W1SHN2
     C                     KFLD           W1SHN3
     C                     KFLD           W1KO
     C           KEYGCQ    SETLLGCQPL311
     C           KEYGCQ    READEGCQPL311                 74
      *
     C           *IN74     DOWEQ'0'
      *
     C           DFSKJY    IFEQ 'D'
     C           DFSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C           DFKATA    CHAINABMWPF91             37
     C           *IN37     IFEQ '0'
     C                     ADD  W1SU      W2SUGE
     C                     ADD  W@SU      W2SU
     C                     ADD  WKHAKD    W2HAKD
     C                     UPDATABMWPF91
     C                     ELSE
     C                     CLEARABMWPF91
     C                     MOVELDFKATA    W2KATA
     C                     Z-ADDW1SU      W2SUGE
     C                     Z-ADDW@SU      W2SU
     C                     Z-ADDWKHAKD    W2HAKD
     C                     WRITEABMWPF91
     C                     ENDIF
      *
     C                     ENDIF
     C           KEYGCQ    READEGCQPL311                 74
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
