     H            Y.
     F** ABMR26 *********************************************
     F*設定数自動処理　焼入れかんばんマスタ更新           *
     F* AUTO CHANGE MONTHLY SETTING # - UPDATE ADHPP01      *
     F*     HOTTA.                 2018.06.11               *
     F* %0001 02/18/20 ADD PARAMETER FOR ABCR21
     F*                CHANGE # OF KANBAN TO 4
     F*----------+-----+----------+-----------------------------------*
     F*2021.02.25|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*****************************************************************
     FABMWP21 UF  E                    DISK
     FGHCTL21 IF  E           K        DISK
     FADHTL05 UF  E           K        DISK
     FABMWP30 O   E           K        DISK                      A
     FABMWP31 O   E                    DISK                      A
     FABMPPB5 IF  E           K        DISK
     FABMPPB6 IF  E           K        DISK
     FABMPL21 IF  E           K        DISK
      *
     I            DS
     I                                        1   80AISKHZ
     I                                        1   40AISKYY
     I                                        5   60AISKMM
     I                                        7   80AISKDD
      *
     I            DS
     I                                        1   80AHSKHZ
     I                                        1   40AHSKYY
     I                                        5   60AHSKMM
     I                                        7   80AHSKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        5   60WTITS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   80J6KOHZ
     I                                        5   80J6KOMD
     I                                        1   40J6KOYY
     I                                        5   60J6KOMM
     I                                        7   80J6KODD
      *
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              'OVER 1000'           C         ERR01
     I              'ACCOMMODATED-        C         ERR02
     I              ' QUANTITY=0'
     I              'UNDER 0'             C         ERR03
     I              'KANBAN ADJUST'       C         CMT01
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C           ACALL     PLIST
     C                     PARM           J6KEI1
     C                     PARM           J6KEI2
     C                     PARM           WKTSU
     C                     PARM           WSYOS
     C                     PARM           WKAKE
     C                     PARM           J6SHN1
     C                     PARM           J6SHN2
     C                     PARM           J6SHN3
     C                     PARM           WATOB
     C                     PARM           J6ATOK
     C                     PARM           J6ATK1
     C                     PARM           J6ATK2
     C                     PARM           J6ATK3
     C                     PARM           J6ATK4
     C                     PARM           WHKLT
     C                     PARM           WLOTO
     C                     PARM           WTOLT
     C                     PARM           WANZR
     C                     PARM           WSETO
     C                     PARM           WBRAH
     C                     PARM           WUKYY
     C                     PARM           WUKMM
     C                     PARM           WUKDD
     C                     PARM           WUBIN
     C                     PARM           WMAKB
     C                     PARM           J6MTYP
%0001C                     PARM           J6RONO
%0001C                     PARM           J6HOJI
%0001C                     PARM           J6ONDO
%0001C                     PARM           J6CO2P
%0001C                     PARM           J6SSKB
     C                     PARM           WMISU
     C                     PARM           WERR
      *
     C                     SETOF                     22
     C                     TIME           WTIME
     C           1         SETLLABMWP211
     C                     READ ABMWP211                 21
     C           *IN21     DOWEQ'0'
     C           W2OMIT    IFEQ '0'
     C           W2PAS     ANDEQ'0'
     C                     EXSR #SB200
     C                     UPDATABMWP211
     C                     ENDIF
     C                     READ ABMWP211                 21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *焼入れかんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYJ61    KLIST
     C                     KFLD           #K1HB5  5
     C                     KFLD           #K2HB5  5
     C                     KFLD           #K3HB2  2
      *
     C                     MOVELW2SHN1    #K1HB5
     C                     MOVELW2SHN2    #K2HB5
     C                     MOVELW2SHN3    #K3HB2
     C           KEYJ61    SETGTADHTL051
     C           KEYJ61    REDPEADHTL051                 82
     C           *IN82     DOWEQ'0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     ELSE
     C           J6STHZ    IFEQ 99999999
     C***        J6KMAX    IFEQ 999
     C           J6KMAX    IFEQ 99999
     C                     CLEARABMWP301
     C                     MOVELERR03     ABTXT
     C                     EXSR #SB800
     C                     ELSE
     C                     EXSR #SB400
     C                     EXSR #SB410
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C           KEYJ61    REDPEADHTL051                 82
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      * GHCPP21より設定数       *
      *---------------------------*
     CSR         #SB400    BEGSR
      *
     C                     SETOF                     99
     C           KEYMD1    KLIST
     C                     KFLD           #KMBN1  1
     C                     KFLD           #KMBN2  2
     C                     KFLD           #KMBN3  2
     C                     KFLD           #KMBN4  1
     C                     KFLD           #KMHN1  5
     C                     KFLD           #KMHN2  5
     C                     KFLD           #KMHN3  2
      *
     C                     MOVELJ6ATK1    #KMBN1
     C                     MOVELJ6ATK2    #KMBN2
     C                     MOVELJ6ATK3    #KMBN3
     C                     MOVELJ6ATK4    #KMBN4
     C                     MOVELJ6SHN1    #KMHN1
     C                     MOVELJ6SHN2    #KMHN2
     C                     MOVELJ6SHN3    #KMHN3
     C                     Z-ADD0         WKSRYO  90
     C                     Z-ADD0         GHSRYO  90
     C           KEYMD1    SETLLGHCTL211
     C           KEYMD1    READEGHCTL211                 83
     C           *IN83     DOWEQ'0'
     C                     Z-ADDMDSRYO    GHSRYO
     C                     EXSR #SB405
     C           KEYMD1    READEGHCTL211                 83
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *---------------------------*
      * ABMPL21より設定数       *
      *---------------------------*
     CSR         #SB405    BEGSR
      *
     C           KEY21     KLIST
     C                     KFLD           W2NTYM
     C                     KFLD           MDJHN1
     C                     KFLD           MDJHN2
     C                     KFLD           MDJHN3
     C                     Z-ADD0         W@FFF   90
     C                     Z-ADD0         W@FFFD  90
     C           KEY21     CHAINABMPL211             48
     C           *IN48     IFEQ '0'
      *
     C           S4OMIT    IFEQ '0'
     C                     Z-ADDS4NSRD    W@FFFD
      * N > SET
     C           S4FSDN    IFGT W@FFFD
     C                     Z-ADDS4FSDN    W@FFFD
     C                     ENDIF
      * N+1 > SET
     C           S4FSD1    IFGT W@FFFD
     C                     Z-ADDS4FSD1    W@FFFD
     C                     ENDIF
     C           W@FFFD    MULT 20        W@FFF
      *
      * NON UPDATE
     C                     ELSE
     C                     Z-ADDMDSETI    W@FFF
     C*********            SETON                     99
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ADD  W@FFF     WKSRYO
      *
     CSR         ESB405    ENDSR
      *---------------------------*
      *かんばん枚数計算         *
      *---------------------------*
     CSR         #SB410    BEGSR
      *
     C                     Z-ADDJ6SYOS    @BSSYS
     C                     MOVELJ6SYOT    @BSSYT
     C                     Z-ADDJ6KTSU    @BKTSU
     C                     Z-ADDJ6KMAX    @BKMAX
     C                     Z-ADDJ6TSEI    @BMAXH
     C                     Z-ADDJ6LOTO    @BKLOT
     C                     Z-ADD0         @BPADJ
     C                     Z-ADDJ6AUAJ    @BAUAJ
     C                     Z-ADD0         @BDUPH
     C                     Z-ADDJ6OTHH    @BOTHH
      *
     C           WKSRYO    DIV  20        W@KSSU  90
     C                     Z-ADD0         W@HAKD  51
     C           W2SSYS    IFNE 0
     C           W@KSSU    DIV  W2SSYS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C                     EXSR #SB710
      *
     C                     Z-ADDJ6KALL    WKALL   50
     C                     Z-ADDJ6KMIN    WMIN    50
     C                     Z-ADDJ6KMAX    WMAX    50
     C           J6KALL    IFLT J6KMAX
     C                     Z-ADDJ6KMAX    WALL    50
     C                     ELSE
     C                     Z-ADDJ6KALL    WALL
     C                     ENDIF
      *
     C           J6SYOS    IFEQ 0
     C                     MOVEL'6'       W2OMIT
     C                     CLEARABMWP301
     C                     MOVELERR02     ABTXT
     C                     EXSR #SB800
     C                     GOTO ESB410
     C                     ENDIF
      *
     C                     SELEC
     C           WKSRYO    WHLT J6KTSU
     C                     MOVEL'51'      J6STI1
     C           WKSRYO    WHGT J6KTSU
     C                     MOVEL'52'      J6STI1
     C                     ENDSL
     C                     Z-ADDGHSRYO    J6KSSU
     C                     Z-ADDWKSRYO    J6KTSU
     C                     Z-ADDJ6KMAX    SVKMAX  50
      *
     C                     MOVE '00000'   WMISU   5
     C                     MOVE J6KTSU    WKTSU   9
     C                     MOVELJ6SYOS    WSYOS   7
     C                     MOVELJ6KAKE    WKAKE   2
     C                     MOVELJ6NKOJ    WATOB   4
     C                     MOVELJ6HKLT    WHKLT   2
     C                     MOVELJ6LOTO    WLOTO   2
     C                     MOVELJ6TOLT    WTOLT   3
     C                     MOVELJ6ANZR    WANZR   3
     C                     MOVELJ6SETO    WSETO   2
     C                     MOVELJ6BRAH    WBRAH   2
     C                     MOVELJ6UKYY    WUKYY   4
     C                     MOVELJ6UKMM    WUKMM   2
     C                     MOVELJ6UKDD    WUKDD   2
     C                     MOVELJ6UBIN    WUBIN   2
     C                     MOVELJ6MAKB    WMAKB   4
     C                     MOVEL*BLANK    WERR    1
      *自動処理調整をゼロにする
     C                     SETOF                         80
     C                     Z-ADD0         W1MAIS  40
     C                     ADD  J6DAND    W1MAIS
     C                     ADD  J6KYOT    W1MAIS
     C                     ADD  J6FRYO    W1MAIS
     C                     ADD  J6SENY    W1MAIS
     C                     ADD  J61NAI    W1MAIS
     C                     ADD  J62NAI    W1MAIS
     C                     ADD  J6JISK    W1MAIS
     C                     ADD  J6OTHH    W1MAIS
     C                     Z-ADDW1MAIS    J6CMAI
     C                     Z-ADDW1MAIS    J6TSEI
     C                     Z-ADD0         J6AUAJ
      *
     C                     CALL 'ABCR21'  ACALL
     C                     MOVE WMISU     WMAIS   50
     C                     ADD  J6TSEI    WMAIS
     C                     EXSR #SB720
     C           WMAIS     IFLE 0
     C                     Z-ADD1         WMAIS
     C                     ENDIF
      *
     C           WMAIS     IFGT 9999
     C                     MOVEL'6'       W2OMIT
     C                     CLEARABMWP301
     C                     MOVELERR01     ABTXT
     C                     EXSR #SB800
     C                     ENDIF
      *
     C                     Z-ADDWMAIS     J6MAIS
     C           J6MAIS    IFEQ 1
     C                     ADD  1         J6AUAJ
     C                     ADD  1         J6TSEI
     C                     ADD  1         J6CMAI
     C                     SETON                         80
     C           SVKMAX    IFEQ 1
     C           W@HAKD    ANDLT1.0
     C*************        SUB  1         J6OTHH
     C                     SUB  1         J6AUAJ
     C                     SUB  1         J6TSEI
     C                     SUB  1         J6CMAI
     C                     MOVEL*BLANK    J6CMT1
     C                     MOVELCMT01     J6CMT1
     C                     SETON                         80
     C                     ENDIF
     C                     ENDIF
     C           *IN80     IFEQ *ON
     C                     ADD  J6TSEI    J6MAIS
     C                     END
     C           J6MAIS    IFEQ 0
     C                     Z-ADD1         J6MAIS
     C                     ADD  1         J6AUAJ
     C                     ADD  1         J6TSEI
     C                     ADD  1         J6CMAI
     C                     ENDIF
     C           J6MAIS    IFLT 0
     C           J6MAIS    MULT -1        XXMAIS  50
     C                     ADD  1         XXMAIS
     C                     Z-ADD1         J6MAIS
     C                     ADD  XXMAIS    J6AUAJ
     C                     ADD  XXMAIS    J6TSEI
     C                     ADD  XXMAIS    J6CMAI
     C                     ENDIF
      *
     C                     MOVELWKAKE     J6KAKE
      *
     C           J6KCD2    IFNE 'B'
     C           J6KCD2    ANDNE'D'
     C                     GOTO SBP1
     C                     ENDIF
     C                     Z-ADDJ6MAIS    J6SETO
     C                     GOTO SBP1
     C           J6LOTO    IFNE 0
     C           J6MAIS    DIV  J6LOTO    J6SETO
     C                     ELSE
     C                     Z-ADDJ6MAIS    J6SETO
     C                     ENDIF
     C           SBP1      TAG
     C           J6DTKO    IFEQ '2'
     C           J6DTKO    OREQ 'D'
     C                     Z-ADDJ6MAIS    J6KMAX
     C                     GOTO CAE
     C                     ENDIF
     C           J6DOUT    IFNE *BLANK
     C                     Z-ADDWALL      J6KALL
     C                     Z-ADDWMAX      J6KMIN
     C                     ENDIF
     C                     Z-ADDJ6MAIS    J6KMAX
     C           *YEAR     CABEQJ6KOYY    CA2
     C           *YEAR     SUB  J6KOYY    WYY     40
     C           WYY       IFLE 01
     C                     Z-ADDUMONTH    XXMM
     C                     Z-ADDUDAY      XXDD
     C           XXMD      CABLEJ6KOMD    CA2
     C                     ENDIF
     C           J6KALL    CABLTJ6KMIN    CA2
     C           J6KMIN    CABGE30        CA2
     C                     SETOF                     30
     C           J6STI1    COMP 01                     30
     C  N30      J6STI1    COMP 49                   30
     C           CA2       TAG
     C                     Z-ADD0         J6SRMS
     C           J6DOUT    IFNE *BLANK
     C                     MOVE *BLANK    J6KSHK
     C                     Z-ADD0         J6ALHK
     C                     ENDIF
     C           *IN22     IFEQ '0'
     C           J6DOUT    CABEQ'Y'       CAE
     C           J6KSHK    CABEQ*BLANK    CAE
     C                     Z-ADDJ6ALHK    WKALL
     C                     Z-ADDJ6MXHK    WMAX
     C                     ELSE
     C           J6KSHK    IFNE *BLANK
     C                     Z-ADDJ6ALHK    WKALL
     C                     Z-ADDJ6MXHK    WMAX
     C                     ENDIF
     C                     ENDIF
     C           WKALL     IFGT WMAX
     C           WKALL     SUB  WMAX      J6SRMS
     C                     ENDIF
     C           CAE       TAG
      *
     C                     Z-ADDJ6KSNK    KSKBN   10
     C           J6DTKO    IFNE '0'
      **６３**
     C                     MOVE *BLANK    PTAN    1
     C           J6STI1    IFEQ 63
     C                     MOVE *BLANK    J6DOUT
     C           PTAN      IFNE 'A'
     C***********          MOVE 'Y'       J6KOUT
     C                     ENDIF
     C                     ELSE
      **以外**
     C           J6KCD2    IFNE 'Z'
     C           *IN22     IFEQ '0'
     C           J6KSNK    IFEQ KSKBN
     C           J6DOUT    CABEQ'Y'       STP5
     C           J6KSHK    CABEQ*BLANK    STP5
     C                     ENDIF
     C                     ENDIF
     C           J6DOUT    IFNE *BLANK
     C                     MOVE 'H'       J6KSHK
     C                     Z-ADDWKALL     J6ALHK
     C                     Z-ADDWMAX      J6MXHK
     C                     ENDIF
     C           STP5      TAG
     C           J6DTKO    IFNE '2'
     C           J6DTKO    ANDNE'D'
     C           J6KSNK    IFEQ KSKBN
     C           *IN22     IFEQ '0'
     C           J6KMIN    IFEQ J6KMAX
     C                     GOTO SP1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*************        MOVE *BLANK    J6DOUT
     C*************        MOVE 'Y'       J6KOUT
     C           SP1       TAG
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     MOVEL'ZIDOU'   J6KOME    P
     C                     Z-ADD*DATE     J6KOHZ
     C                     TIME           WTIME
     C                     Z-ADDWTITH     J6KOHH
     C                     Z-ADDWTITM     J6KOSS
      *
     C           J6DTKO    IFEQ '0'
     C                     ELSE
     C                     MOVE '1'       J6DTKO
     C                     MOVE '*'       J6DTHE
     C           *IN99     IFEQ '0'
     C                     MOVEL*BLANK    J6KOUT
     C                     MOVE 'Y'       J6DOUT
     C                     MOVE '*'       J6DTHE
     C                     UPDATADHTL051
     C                     ENDIF
     C                     EXSR #SB810
     C                     ENDIF
      *
     CSR         ESB410    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB710    BEGSR
      *
     C                     Z-ADD0         WKADJU  30
     C           KEYB6     KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
     C           KEYB6     CHAINABMPPB61             94
     C           *IN94     IFEQ '0'
     C           AISKJY    ANDEQ'D'
     C           AISKHZ    ANDLE*DATE
     C                     SETON                     94
     C                     ENDIF
     C           *IN94     IFEQ '0'
     C                     Z-ADDAIADJU    WKADJU
     C                     ELSE
     C                     EXSR #SB711
     C                     ENDIF
      *
     CSR         ESB710    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB711    BEGSR
      *
     C           WKSRYO    DIV  20        W@KSSU  90
     C                     Z-ADD0         W@HAKD  51
     C           W2SSYS    IFNE 0
     C           W@KSSU    DIV  W2SSYS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C                     Z-ADD0         WKADJU  30
     C           KEYB5     KLIST
     C                     KFLD           J6KCD1
     C                     KFLD           J6KCD2
     C                     MOVEL'0'       GET     1
     C           KEYB5     SETLLABMPPB51
     C           KEYB5     READEABMPPB51                 94
     C           *IN94     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           AHSKJY    IFEQ 'D'
     C           AHSKHZ    ANDLE*DATE
     C                     ELSE
     C                     SELEC
     C           AHFUGO    WHEQ '1'
     C           W@HAKD    IFLT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '2'
     C           W@HAKD    IFGT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '3'
     C           W@HAKD    IFEQ AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '4'
     C           W@HAKD    IFLE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '5'
     C           W@HAKD    IFGE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '6'
     C           W@HAKD    IFNE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C                     ENDSL
     C                     ENDIF
     C           KEYB5     READEABMPPB51                 94
     C                     ENDDO
      *
     CSR         ESB711    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB720    BEGSR
      *
     C                     Z-ADD0         SA@     40
      *今回ー前回　枚数
     C           WMAIS     SUB  SVKMAX    SA      40
     C                     Z-ADDSA        SA@
     C                     MULT -1        SA@
      *今回/前回
     C                     Z-ADD0         RITU    72
     C           SVKMAX    IFNE 0
     C           WMAIS     DIV  SVKMAX    RITU
     C                     ENDIF
      *
     C                     MULT 100       RITU
     C           RITU      IFGE 100
     C                     SUB  100       RITU
     C                     ELSE
     C           100       SUB  RITU      RITU
     C                     ENDIF
      *
     C           RITU      IFLT WKADJU
     C                     Z-ADDSA@       J6AUAJ
     C                     ADD  J6AUAJ    J6CMAI
     C                     ADD  J6AUAJ    J6TSEI
     C                     Z-ADD0         WMAIS   50
     C                     MOVE '00000'   WMISU   5
     C                     CALL 'ABCR21'  ACALL
     C                     MOVE WMISU     WMAIS   50
     C                     SETON                         80
     C                     ENDIF
      *
     CSR         ESB720    ENDSR
      *---------------------------*
      *エラーファイル           *
      *---------------------------*
     CSR         #SB800    BEGSR
      *
     C                     MOVELJ6SHN1    ABJHN1
     C                     MOVELJ6SHN2    ABJHN2
     C                     MOVELJ6SHN3    ABJHN3
     C                     MOVELJ6ATK1    ABATK1
     C                     MOVELJ6ATK2    ABATK2
     C                     MOVELJ6ATK3    ABATK3
     C                     MOVELJ6ATK4    ABATK4
     C                     MOVEL'A'       ABKCD1
     C                     MOVEL*BLANK    ABKCD2
     C                     WRITEABMWP301
      *
     CSR         ESB800    ENDSR
      *---------------------------*
      *結果                     *
      *---------------------------*
     CSR         #SB810    BEGSR
      *
     C                     MOVELJ6KCD1    @BKCD1
     C                     MOVELJ6KCD2    @BKCD2
     C                     MOVELJ6SHN1    @BJHN1
     C                     MOVELJ6SHN2    @BJHN2
     C                     MOVELJ6SHN3    @BJHN3
     C                     MOVELJ6ATOB    @BATOB
     C                     MOVELJ6ATOK    @BATOK
     C                     MOVELJ6ATK1    @BATK1
     C                     MOVELJ6ATK2    @BATK2
     C                     MOVELJ6ATK3    @BATK3
     C                     MOVELJ6ATK4    @BATK4
     C                     Z-ADDWKSRYO    @AKTSU
     C                     Z-ADDJ6KMAX    @AKMAX
     C                     Z-ADDJ6TSEI    @AMAXH
     C                     Z-ADDJ6LOTO    @AKLOT
     C                     Z-ADD0         @APADJ
     C                     Z-ADDJ6AUAJ    @AAUAJ
     C                     Z-ADD0         @ADUPH
     C                     Z-ADDJ6OTHH    @AOTHH
     C                     MOVELJ6CMT1    @ACMT1
     C                     Z-ADDW@HAKD    @NBOXD
     C                     Z-ADDWKSRYO    @ANSRY
     C                     MOVEL'0'       @APICS
     C           @AKMAX    SUB  @BKMAX    @SA
     C                     Z-ADD0         @SA2
     C           @AKMAX    SUB  @AAUAJ    R123    50
     C           @BKMAX    IFNE 0
     C           R123      DIV  @BKMAX    @SA2
     C                     ENDIF
     C                     MOVEL' '       @AKERR
     C           *IN99     IFEQ '1'
     C                     MOVEL'*'       @AKERR
     C                     ENDIF
      *
     C                     WRITEABMWP311
      *
     CSR         ESB810    ENDSR
