     H            Y.
     F** ABMR19 **************************************
     F* AUTO CHANGE MONTHLY SETTING#
     F*     HOTAA.           2018.06.18              *
     F************************************************
     FABMPP00 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
     C                     PARM           P@PGM  10
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     CLEARABMPP001
     C                     Z-ADDSDATE     S0KOHZ
     C                     Z-ADDSTIME     S0KOTI
     C                     MOVELW#USER    S0KOME
     C                     MOVELP@PGM     S0KOPG
     C                     Z-ADDP@DTYM    S0YM
     C                     WRITEABMPP001
      *
     C                     SETON                     LR
     C                     RETRN
      *
