     H            Y.
     F** ABMR15 *********************************************
     F* UPDATE FCEPP01
     F*    HOTTA.               2018.06.07                  *
     F*******************************************************
     FFCEPP01 IF  E           K        DISK
     FGHCPL21 UF  E           K        DISK
      *
      *
      *
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     C                     TIME           WTIME
      * NEXT DAY
      *
     C                     READ FCEPP011                 87
     C           *IN87     DOWEQ'0'
     C           A2GSKD    IFEQ ' '
     C           A2GKNM    ANDEQ'ZIDOU'
     C                     EXSR #SB001
     C                     ENDIF
     C                     READ FCEPP011                 87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * FCEPP01                                          *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *Ｎ月内示と実績の多い方
      *
      *
     C                     EXSR #GHC2
      *
      *
     CSR         ESB001    ENDSR
      *---------------------------------------------------------------*
      *GHCPP21 UPDATE
      *---------------------------------------------------------------*
     C           #GHC2     BEGSR
      *
     C                     SETOF                     70
     C           KEY1      SETLLGHCPL21
     C                     DO   *HIVAL
     C           KEY1      READEGHCPL211                 70
     C           *IN70     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C******               Z-ADDW2NSRY    M7SETI
     C*******    W2NSRD    MULT 20        M7SETI
     C                     Z-ADDA2GEKN    M7SETI
     C                     UPDATGHCPL211
     C  N70                ENDDO
      *
     C                     ENDSR
