     H            Y.
     F** ABMRK2 *********************************************
     F*金型必要数
     F*   HOTTA.          2018.12.24                        *
     F*******************************************************
     FABMWPK1 IF  E           K        DISK
     FABMWPK2 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SORT  1
      * 1 :過多多い順
      * 2 :不足多い順
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      *
     C           P1SORT    IFEQ '2'
     C                     EXSR #SB200
     C                     ELSE
     C                     EXSR #SB210
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *不足多い順                                        *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           *LOVAL    SETLLABMWPK11
     C                     READ ABMWPK11                 20
     C           *IN20     DOWEQ'0'
     C                     WRITEABMWPK21
     C                     READ ABMWPK11                 20
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *過多多い順                                        *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C           *HIVAL    SETGTABMWPK11
     C                     READPABMWPK11                 20
     C           *IN20     DOWEQ'0'
     C                     WRITEABMWPK21
     C                     READPABMWPK11                 20
     C                     ENDDO
      *
     CSR         ESB210    ENDSR
