     H            Y.
     F** ABMRG4 **************************************
     F* SHORTAGE KPI
     F*     HOTTA.           2018.10.05              *
     F************************************************
     FABMPWG4 CF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK
     FABMPPL1 IF  E           K        DISK
      *
     I            DS
     I                                        1   60D1NTYM
     I                                        1   40D1NTYY
     I                                        5   60D1NTMM
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  120WTIYM
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
     C           *ENTRY    PLIST
     C                     PARM           P@NTYM  60
     C                     PARM           P9SYUN  70
     C                     PARM           P9APCS  70
     C                     PARM           P9KTNA  70
     C                     PARM           P9SYKA  92
     C                     PARM           P9HAK   92
     C                     PARM           P@CMD   2
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
     C                     EXSR $SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR $SB200
     C                     ENDDO
     C                     EXSR $SB300
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         $SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
     C                     MOVE *BLANK    P@CMD   2
     C                     Z-ADDP@NTYM    D1NTYM
     C           KEYF8     KLIST
     C                     KFLD           D1NTYY
     C                     KFLD           D1NTMM
     C                     Z-ADD0         WKKADO  31
     C           KEYF8     SETLLAGDPL121
     C           KEYF8     READEAGDPL121                 80
     C           *IN80     DOWEQ'0'
     C           F8HIRU    IFEQ *BLANK
     C                     ADD  0.5       WKKADO
     C                     ENDIF
     C           F8YORU    IFEQ *BLANK
     C                     ADD  0.5       WKKADO
     C                     ENDIF
     C           KEYF8     READEAGDPL121                 80
     C                     ENDDO
      *
     C           KEYF8     SETLLABMPPL11
     C           KEYF8     READEABMPPL11                 80
     C           *IN80     DOWEQ'0'
     C                     Z-ADDLLKADO    WKKADO
     C           KEYF8     READEABMPPL11                 80
     C                     ENDDO
      *
     C           WKKADO    IFEQ 0
     C                     Z-ADD20        WKKADO
     C                     ENDIF
      *
     C                     Z-ADDWKKADO    D1KADO
     C           P9SYUN    DIV  WKKADO    D1SYUN
     C           P9APCS    DIV  WKKADO    D1APCS
     C           P9KTNA    DIV  WKKADO    D1KTNA
     C           P9SYKA    DIV  WKKADO    D1SYKA
     C           P9HAK     DIV  20        D1HAK
     C*****      P9HAK     DIV  WKKADO    D1HAK
     C                     Z-ADDP9SYUN    D2SYUN
     C                     Z-ADDP9APCS    D2APCS
     C                     Z-ADDP9KTNA    D2KTNA
     C                     Z-ADDP9SYKA    D2SYKA
     C                     Z-ADDP9HAK     D2HAK
      *
     CSR         $S100E    ENDSR
      *----------------------------------------------------*
      *   主処理                                         *
      *----------------------------------------------------*
     CSR         $SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR $SB210
     C                     ENDDO
      *
     CSR         $S200E    ENDSR
      *----------------------------------------------------*
      *   終了処理                                       *
      *----------------------------------------------------*
     CSR         $SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         $S300E    ENDSR
      *----------------------------------------------------*
      *   第一画面表示                                   *
      *----------------------------------------------------*
     CSR         $SB210    BEGSR
      *
     C                     EXFMTABMPWG41
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D1ERR
      * F1
     C           *IN03     IFEQ '1'
     C                     MOVE '03'      P@CMD   2
     C                     MOVE '99'      DSPSW
     C                     GOTO $S210E
     C                     ENDIF
      *
     CSR         $S210E    ENDSR
