     H            Y.
     F** ABNR16 *********************************************
     F* LOCATION INFO AAPPP01
     F*    SAKAKI.         2019.05.28                       *
     F*----------+-----+----------+-----------------------------------*
     F*2021.02.04|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*****************************************************************
     FAAPPL03 IF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
     FABNPP11 O   E                    DISK                      A
     E                    TAB5    1  41  2   TAB6    3 0 ﾆｬcﾑc ﾌﾃﾇc
      *
     I            DS
     I                                        1   2 CJSDSS
     I                                        1   10CJSDAI
     I                                        2   2 CJSSYO
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AAPPL03                  21
     C           *IN21     DOWEQ'0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLESDATE
     C                     ELSE
     C           L5STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AAPPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *AAJPP11 検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C                     CLEARABNPP111
     C                     MOVELL5KCD1    S7KCD1
     C                     MOVELL5KCD2    S7KCD2
     C                     Z-ADDL5BMON    S7BMON
     C                     MOVELL5TKR1    S7TKR1
     C                     MOVELL5TKR2    S7TKR2
     C                     MOVELL5TKR3    S7TKR3
     C                     MOVELL5TKR4    S7TKR4
     C                     MOVELL5SHN1    S7SHN1
     C                     MOVELL5SHN2    S7SHN2
     C                     MOVELL5SHN3    S7SHN3
     C                     Z-ADDL5KMAX    S7KMAX
     C           KEYA31    KLIST
     C                     KFLD           L5TKR1
     C                     KFLD           L5TKR2
     C                     KFLD           L5TKR3
     C                     KFLD           L5TKR4
     C                     Z-ADD32        @@SHAK  30
     C           KEYA31    SETGTAAJPL11
     C           KEYA31    REDPEAAJPL11                  82
     C           *IN82     IFEQ '0'
     C                     Z-ADDCJSDAI    S7SDAI
     C                     MOVELCJSSYO    S7SSYO
     C                     MOVELCJHAKO    S7HAKO
     C                     Z-ADDCJBRYO    S7BRYO
     C                     Z-ADDCJSHAK    S7SHAK
     C           CJSDSS    LOKUPTAB5      TAB6           20
     C   20                Z-ADDTAB6      @@SHAK
     C                     ENDIF
     C           L5BMON    IFEQ 5555
     C                     EXSR #SB650
     C                     ELSE
     C                     EXSR #SB651
     C                     ENDIF
     C                     WRITEABNPP111
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      *間口数　完成品0  後工程5555
      *---------------------------*
     CSR         #SB650    BEGSR
      *
     C                     Z-ADD0         WKMAX
     C                     Z-ADD0         MAGS    30
     C           L5KMAX    DIV  @@SHAK    S7NSIZ
     C                     MVR            AMR     73
     C           AMR       IFNE 0
     C                     ADD  1         S7NSIZ
     C                     ENDIF
      *
     CSR         ESB650    ENDSR
      *---------------------------*
      *間口数　完成品0  後工程5555以外
      *---------------------------*
     CSR         #SB651    BEGSR
      *
     C                     Z-ADD0         WKMAX   70
     C                     Z-ADD0         MAGS    30
     C           L5KMAX    MULT 12        WKMAX
     C           WKMAX     DIV  @@SHAK    S7NSIZ
     C                     MVR            AMR     73
     C           AMR       IFNE 0
     C                     ADD  1         S7NSIZ
     C                     ENDIF
      *
     CSR         ESB651    ENDSR
**  TAB5 / TAB6 ( ACCOMODATED QUANTITY)
2B004
2F010
3F012
4F006
1D016
2D032
3D048
4D064
5D080
6D096
7D112
8D128
9D144
1G020
2G032
3G060
4G080
5G100
6G120
7G140
8G160
9G180
1K011
2K022
3K033
4K044
5K055
0B000
0R000
1P072
2P024
3P216
4P288
5P360
6P432
7P504
8P576
9P648
0T000
0Q000
0S004
