     H            Y.
     F** ABNR02 *********************************************
     F* KANBAN M/F INFO AAHPP01
     F*    SAKAKI.         2019.04.09                       *
     F*******************************************************
     FAAHPL03 IF  E                    DISK
     FABNPP01 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AAHPL03                  21
     C           *IN21     DOWEQ'0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLESDATE
     C                     ELSE
     C           L6STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AAHPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *引取かんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYA31    KLIST
     C                     KFLD           K6CRDT  80
     C                     KFLD           K6KCD1  1
     C                     KFLD           K6KCD2  1
     C                     KFLD           K6LOTK  30
     C                     Z-ADDSDATE     K6CRDT
     C                     MOVELL6KCD1    K6KCD1
     C                     MOVELL6KCD2    K6KCD2
     C                     Z-ADD1         K6LOTK
      *
     C           KEYA31    CHAINABNPP01              82
     C           *IN82     IFEQ '0'
     C                     ADD  L6KMAX    S6KMAX
     C                     ADD  L6AMXH    S6CMAI
     C                     ADD  L6AUAJ    S6AUAJ
     C                     ADD  L6KAIH    S6KAIH
     C                     ADD  L6SINH    S6SINH
     C                     ADD  L6DUPH    S6DUPH
     C                     ADD  L6HRH1    S6HRH1
     C                     ADD  L6HRH2    S6HRH2
     C                     ADD  L6HRH3    S6HRH3
     C                     ADD  L6HRH4    S6HRH4
     C                     ADD  L6MNDS    S6MNDS
     C                     ADD  L6HRYO    S6HRYO
     C                     ADD  L6HLTS    S6HLTS
     C                     ADD  L6JTEI    S6JTEI
     C                     ADD  L6SKJI    S6SKJI
     C                     ADD  L6PADJ    S6PADJ
     C                     ADD  L6OTHH    S6OTHH
     C                     UPDATABNPP011
     C                     ELSE
     C                     CLEARABNPP011
     C                     Z-ADDSDATE     S6CRDT
     C                     MOVELL6KCD1    S6KCD1
     C                     MOVELL6KCD2    S6KCD2
     C                     Z-ADD1         S6LOTK
     C                     Z-ADDL6KMAX    S6KMAX
     C                     Z-ADDL6AMXH    S6CMAI
     C                     Z-ADDL6AUAJ    S6AUAJ
     C                     Z-ADDL6KAIH    S6KAIH
     C                     Z-ADDL6SINH    S6SINH
     C                     Z-ADDL6DUPH    S6DUPH
     C                     Z-ADDL6HRH1    S6HRH1
     C                     Z-ADDL6HRH2    S6HRH2
     C                     Z-ADDL6HRH3    S6HRH3
     C                     Z-ADDL6HRH4    S6HRH4
     C                     Z-ADDL6MNDS    S6MNDS
     C                     Z-ADDL6HRYO    S6HRYO
     C                     Z-ADDL6HLTS    S6HLTS
     C                     Z-ADDL6JTEI    S6JTEI
     C                     Z-ADDL6SKJI    S6SKJI
     C                     Z-ADDL6PADJ    S6PADJ
     C                     Z-ADDL6OTHH    S6OTHH
     C                     WRITEABNPP011
     C                     ENDIF
      *
     CSR         ESB200    ENDSR
