     H            Y.
     F** ABNR11 *********************************************
     F* LOCATION INFO AAFPP01
     F*    SAKAKI.         2019.04.12                       *
     F*******************************************************
     FAAFPL03 IF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
     FABNPP11 O   E                    DISK                      A
     E                    TAB5    1  41  2   TAB6    3 0 ﾆｬcﾑc ﾌﾃﾇc
      *
     I            DS
     I                                        1   2 CJSDSS
     I                                        1   10CJSDAI
     I                                        2   2 CJSSYO
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AAFPL03                  21
     C           *IN21     DOWEQ'0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLESDATE
     C                     ELSE
     C           A3STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AAFPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *AAJPP11 検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C                     CLEARABNPP111
     C                     MOVELA3KCD1    S7KCD1
     C                     MOVELA3KCD2    S7KCD2
     C                     Z-ADDA3ATOB    S7BMON
     C                     MOVELA3ATK1    S7TKR1
     C                     MOVELA3ATK2    S7TKR2
     C                     MOVELA3ATK3    S7TKR3
     C                     MOVELA3ATK4    S7TKR4
     C                     MOVELA31HB5    S7SHN1
     C                     MOVELA32HB5    S7SHN2
     C                     MOVELA33HB2    S7SHN3
     C                     Z-ADDA3KMAX    S7KMAX
     C           KEYA31    KLIST
     C                     KFLD           A3ATK1
     C                     KFLD           A3ATK2
     C                     KFLD           A3ATK3
     C                     KFLD           A3ATK4
     C                     Z-ADD32        @@SHAK  30
     C           KEYA31    SETGTAAJPL11
     C           KEYA31    REDPEAAJPL11                  82
     C           *IN82     IFEQ '0'
     C                     Z-ADDCJSDAI    S7SDAI
     C                     MOVELCJSSYO    S7SSYO
     C                     MOVELCJHAKO    S7HAKO
     C                     Z-ADDCJBRYO    S7BRYO
     C                     Z-ADDCJSHAK    S7SHAK
     C           CJSDSS    LOKUPTAB5      TAB6           20
     C   20                Z-ADDTAB6      @@SHAK
     C                     ENDIF
     C                     SELEC
     C           A3KCD2    WHEQ 'Z'
     C                     EXSR #SB620
     C           A3KCD2    WHEQ 'A'
     C                     EXSR #SB621
     C                     ENDSL
     C                     WRITEABNPP111
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      *間口数　メッキC-A
      *---------------------------*
     CSR         #SB620    BEGSR
      *
     C                     Z-ADD0         WKMAX   50
     C                     Z-ADD0         MAGS    30
     C           A3ATOB    IFEQ 0111
     C                     Z-ADDA3KMAX    WKMAX
     C                     ELSE
     C           A3KMAX    MULT 0.7       WKMAX
     C                     ENDIF
     C           WKMAX     DIV  @@SHAK    S7NSIZ
     C                     MVR            AMR     73
     C           AMR       IFNE 0
     C                     ADD  1         S7NSIZ
     C                     ENDIF
      *
     CSR         ESB620    ENDSR
      *---------------------------*
      *間口数　メッキC-Z
      *---------------------------*
     CSR         #SB621    BEGSR
      *
     C                     Z-ADD0         WKMAX   50
     C                     Z-ADD0         MAGS    30
     C                     Z-ADDA3KMAX    WKMAX
     C           WKMAX     DIV  @@SHAK    S7NSIZ
     C                     MVR            AMR     73
     C           AMR       IFNE 0
     C                     ADD  1         S7NSIZ
     C                     ENDIF
      *
     CSR         ESB621    ENDSR
**  TAB5 / TAB6 ( ACCOMODATED QUANTITY)
2B004
2F010
3F012
4F006
1D016
2D032
3D048
4D064
5D080
6D096
7D112
8D128
9D144
1G020
2G032
3G060
4G080
5G100
6G120
7G140
8G160
9G180
1K011
2K022
3K033
4K044
5K055
0B000
0R000
1P072
2P024
3P216
4P288
5P360
6P432
7P504
8P576
9P648
0T000
0Q000
0S004
