     H            Y.
     F** ABNR12 *********************************************
     F* LOCATION INFO AAHPP01
     F*    SAKAKI.         2019.04.12                       *
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.23|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*****************************************************************
     FAAHPL03 IF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
     FABNPP11 O   E                    DISK                      A
     E                    TAB5    1  41  2   TAB6    3 0 ﾆｬcﾑc ﾌﾃﾇc
      *
     I            DS
     I                                        1   2 CJSDSS
     I                                        1   10CJSDAI
     I                                        2   2 CJSSYO
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AAHPL03                  21
     C           *IN21     DOWEQ'0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLESDATE
     C                     ELSE
     C           L6STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AAHPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *AAJPP11 検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C                     CLEARABNPP111
     C                     MOVELL6KCD1    S7KCD1
     C                     MOVELL6KCD2    S7KCD2
     C                     Z-ADDL6ATOB    S7BMON
     C                     MOVELL6ATK1    S7TKR1
     C                     MOVELL6ATK2    S7TKR2
     C                     MOVELL6ATK3    S7TKR3
     C                     MOVELL6ATK4    S7TKR4
     C                     MOVELL6SHN1    S7SHN1
     C                     MOVELL6SHN2    S7SHN2
     C                     MOVELL6SHN3    S7SHN3
     C                     Z-ADDL6KMAX    S7KMAX
     C           KEYA31    KLIST
     C                     KFLD           L6ATK1
     C                     KFLD           L6ATK2
     C                     KFLD           L6ATK3
     C                     KFLD           L6ATK4
     C                     Z-ADD32        @@SHAK  30
     C           KEYA31    SETGTAAJPL11
     C           KEYA31    REDPEAAJPL11                  82
     C           *IN82     IFEQ '0'
     C                     Z-ADDCJSDAI    S7SDAI
     C                     MOVELCJSSYO    S7SSYO
     C                     MOVELCJHAKO    S7HAKO
     C                     Z-ADDCJBRYO    S7BRYO
     C                     Z-ADDCJSHAK    S7SHAK
     C           CJSDSS    LOKUPTAB5      TAB6           20
     C   20                Z-ADDTAB6      @@SHAK
     C                     ENDIF
     C                     EXSR #SB640
     C                     WRITEABNPP111
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      *間口数　引取E
      *---------------------------*
     CSR         #SB640    BEGSR
      *
     C                     Z-ADD0         WKMAX   70
     C                     Z-ADD0         MAGS    30
     C                     Z-ADDL6KMAX    WKMAX
     C           WKMAX     DIV  @@SHAK    S7NSIZ
     C                     MVR            AMR     73
     C           AMR       IFNE 0
     C                     ADD  1         S7NSIZ
     C                     ENDIF
      *
     CSR         ESB640    ENDSR
**  TAB5 / TAB6 ( ACCOMODATED QUANTITY)
2B004
2F010
3F012
4F006
1D016
2D032
3D048
4D064
5D080
6D096
7D112
8D128
9D144
1G020
2G032
3G060
4G080
5G100
6G120
7G140
8G160
9G180
1K011
2K022
3K033
4K044
5K055
0B000
0R000
1P072
2P024
3P216
4P288
5P360
6P432
7P504
8P576
9P648
0T000
0Q000
0S004
