     H            Y.
     F** ABNR04 *********************************************
     F* KANBAN M/F INFO AANPP01
     F*    SAKAKI.         2019.04.09                       *
     F*******************************************************
     FAANPL03 IF  E                    DISK
     FABNPP01 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AANPL03                  21
     C           *IN21     DOWEQ'0'
     C           L7SKJY    IFEQ 'D'
     C           L7SKHZ    ANDLESDATE
     C                     ELSE
     C           L7STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AANPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *半製品かんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYA31    KLIST
     C                     KFLD           K6CRDT  80
     C                     KFLD           K6KCD1  1
     C                     KFLD           K6KCD2  1
     C                     KFLD           K6LOTK  30
     C                     Z-ADDSDATE     K6CRDT
     C                     MOVELL7KCD1    K6KCD1
     C                     MOVELL7KCD2    K6KCD2
     C                     Z-ADDL7HKSU    K6LOTK
      *
     C           KEYA31    CHAINABNPP01              82
     C           *IN82     IFEQ '0'
     C                     ADD  L7KMAX    S6KMAX
     C                     ADD  L7UZAR    S6CMAI
     C                     ADD  L7AUAJ    S6AUAJ
     C                     ADD  L7KAIH    S6KAIH
     C                     ADD  L7SINH    S6SINH
     C                     ADD  L7DUPH    S6DUPH
     C                     ADD  L7HRH1    S6HRH1
     C                     ADD  L7HRH2    S6HRH2
     C                     ADD  L7HRH3    S6HRH3
     C                     ADD  L7HRH4    S6HRH4
     C                     ADD  L7MNDS    S6MNDS
     C                     ADD  L7HRYO    S6HRYO
     C                     ADD  L7HLTS    S6HLTS
     C                     ADD  L7JTEI    S6JTEI
     C                     ADD  L7SKJI    S6SKJI
     C                     ADD  L7PADJ    S6PADJ
     C                     ADD  L7OTHH    S6OTHH
     C                     UPDATABNPP011
     C                     ELSE
     C                     CLEARABNPP011
     C                     Z-ADDSDATE     S6CRDT
     C                     MOVELL7KCD1    S6KCD1
     C                     MOVELL7KCD2    S6KCD2
     C                     Z-ADDL7HKSU    S6LOTK
     C                     Z-ADDL7KMAX    S6KMAX
     C                     Z-ADDL7UZAR    S6CMAI
     C                     Z-ADDL7AUAJ    S6AUAJ
     C                     Z-ADDL7KAIH    S6KAIH
     C                     Z-ADDL7SINH    S6SINH
     C                     Z-ADDL7DUPH    S6DUPH
     C                     Z-ADDL7HRH1    S6HRH1
     C                     Z-ADDL7HRH2    S6HRH2
     C                     Z-ADDL7HRH3    S6HRH3
     C                     Z-ADDL7HRH4    S6HRH4
     C                     Z-ADDL7MNDS    S6MNDS
     C                     Z-ADDL7HRYO    S6HRYO
     C                     Z-ADDL7HLTS    S6HLTS
     C                     Z-ADDL7JTEI    S6JTEI
     C                     Z-ADDL7SKJI    S6SKJI
     C                     Z-ADDL7PADJ    S6PADJ
     C                     Z-ADDL7OTHH    S6OTHH
     C                     WRITEABNPP011
     C                     ENDIF
      *
     CSR         ESB200    ENDSR
