     H            Y.
     F** ABNR01 *********************************************
     F* KANBAN M/F INFO AAFPP01
     F*    SAKAKI.         2019.04.09                       *
     F*******************************************************
     FAAFPL03 IF  E                    DISK
     FABNPP01 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AAFPL03                  21
     C           *IN21     DOWEQ'0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLESDATE
     C                     ELSE
     C           A3STHZ    IFEQ 99999999
     C                     EXSR #SB200
     C                     ENDIF
     C                     ENDIF
     C                     READ AAFPL03                  21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------*
      *メッキかんばん検索       *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYA31    KLIST
     C                     KFLD           K6CRDT  80
     C                     KFLD           K6KCD1  1
     C                     KFLD           K6KCD2  1
     C                     KFLD           K6LOTK  30
     C                     Z-ADDSDATE     K6CRDT
     C                     MOVELA3KCD1    K6KCD1
     C                     MOVELA3KCD2    K6KCD2
     C                     Z-ADD1         K6LOTK
      *
     C           KEYA31    CHAINABNPP01              82
     C           *IN82     IFEQ '0'
     C                     ADD  A3KMAX    S6KMAX
     C                     ADD  A3MAXH    S6CMAI
     C                     ADD  A3AUAJ    S6AUAJ
     C                     ADD  A3KAIH    S6KAIH
     C                     ADD  A3SINH    S6SINH
     C                     ADD  A3DUPH    S6DUPH
     C                     ADD  A3HRH1    S6HRH1
     C                     ADD  A3HRH2    S6HRH2
     C                     ADD  A3HRH3    S6HRH3
     C                     ADD  A3HRH4    S6HRH4
     C                     ADD  A3MNDS    S6MNDS
     C                     ADD  A3HRYO    S6HRYO
     C                     ADD  A3HLTS    S6HLTS
     C                     ADD  A3JTEI    S6JTEI
     C                     ADD  A3SKJI    S6SKJI
     C                     ADD  A3PADJ    S6PADJ
     C                     ADD  A3OTHH    S6OTHH
     C                     UPDATABNPP011
     C                     ELSE
     C                     CLEARABNPP011
     C                     Z-ADDSDATE     S6CRDT
     C                     MOVELA3KCD1    S6KCD1
     C                     MOVELA3KCD2    S6KCD2
     C                     Z-ADD1         S6LOTK
     C                     Z-ADDA3KMAX    S6KMAX
     C                     Z-ADDA3MAXH    S6CMAI
     C                     Z-ADDA3AUAJ    S6AUAJ
     C                     Z-ADDA3KAIH    S6KAIH
     C                     Z-ADDA3SINH    S6SINH
     C                     Z-ADDA3DUPH    S6DUPH
     C                     Z-ADDA3HRH1    S6HRH1
     C                     Z-ADDA3HRH2    S6HRH2
     C                     Z-ADDA3HRH3    S6HRH3
     C                     Z-ADDA3HRH4    S6HRH4
     C                     Z-ADDA3MNDS    S6MNDS
     C                     Z-ADDA3HRYO    S6HRYO
     C                     Z-ADDA3HLTS    S6HLTS
     C                     Z-ADDA3JTEI    S6JTEI
     C                     Z-ADDA3SKJI    S6SKJI
     C                     Z-ADDA3PADJ    S6PADJ
     C                     Z-ADDA3OTHH    S6OTHH
     C                     WRITEABNPP011
     C                     ENDIF
      *
     CSR         ESB200    ENDSR
