     H            Y.
     F** ABTR34 *********************************************
     F* SHORTAGE FOLLOW STATUS (PRINT)
     F*   SAKAKI.              2020.04.08                   *
JW1  F*   J.WATA   2020.05.27  CHG SELECT CONDITION         *
JW2  F*   J.WATA   2021.02.11  ADD DEPT=7                   *
     F*******************************************************
     FABTWL32 IF  E           K        DISK
     FGADPL11 IF  E           K        DISK
     FABTPR34 O   E             55     PRINTER
JW2  FABTPR347O   E             56     PRINTER
      *
JW2  I            DS
 .   I                                        1   6 @@LOC
 .   I                                        1   1 @@LOC1
 .   I                                        2   3 @@LOC2
 .   I                                        4   5 @@LOC3
JW2  I                                        6   6 @@LOC4
JW2  I            DS
 .   I                                        1  12 W2LPR
 .   I                                        1   5 W2LPR1
 .   I                                        6  10 W2LPR2
 .   I                                       11  12 W2LPR3
     I            DS
     I                                        1   5 S1NOTM
     I                                        1   2 S1NTIH
     I                                        3   3 S1NTTT
     I                                        4   5 S1NTIM
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
JW1  I                                        1   60NOW
"    I                                        7  140TODAY
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
     C           *ENTRY    PLIST
     C                     PARM           P1KBN   1
      *
JW1  C                     SELEC
 |   C           P1KBN     WHEQ '1'
 |   C                     MOVEL'(SORT)'  @KBN
 V   C           P1KBN     WHEQ '2'
     C                     MOVEL'(BZ)  '  @KBN
     C           P1KBN     WHEQ '3'
     C                     MOVEL'(SB)  '  @KBN
     C           P1KBN     WHEQ '4'
     C                     MOVEL'(H.T.)'  @KBN
     C           P1KBN     WHEQ '5'
     C                     MOVEL'(DS)  '  @KBN
     C           P1KBN     WHEQ '6'
 |   C                     MOVEL'(JC)  '  @KBN
JW2  C           P1KBN     WHEQ '7'
 .   C                     MOVEL'(P/T) '  @KBN
 |   C                     OTHER
 V   C                     MOVE *BLANK    @KBN
JW1  C                     ENDSL
      * NOT SORT
     C           P1KBN     IFNE '1'
     C                     SETON                     88
     C                     ENDIF
      *
     C                     TIME           WTIME
      *
JW1  C                     Z-ADDTODAY     @HYMD
JW1  C                     Z-ADDNOW       @HTIM
     C                     SETON                     55
JW2  C                     SETON                     56
     C           *LOVAL    SETLLABTWL32
     C                     READ ABTWL32                  87
     C           *IN87     DOWEQ'0'
     C***        W2SRTD    IFNE 0
JW1   * SELECT DATA
 |   C                     EXSR #CHK1
 |   C           *IN85     IFEQ *ON
 |   C                     GOTO SKIP1
JW1  C                     ENDIF
      *
     C           *IN55     IFEQ '1'
JW2  C           *IN56     OREQ '1'
     C           W2MSN#    ORNE S1MSN#
      *
JW2  C           P1KBN     IFEQ '7'
 .   C  N88                WRITEABTP3471
JW2  C   88                WRITEABTP3473
     C                     ELSE
     C  N88                WRITEABTPR341
     C   88                WRITEABTPR343
     C                     ENDIF
      *
     C                     SETOF                     55
JW2  C                     SETOF                     56
     C                     MOVELW2MSN#    S1MSN#
     C                     ENDIF
      * OUTPUT ABTPR34
     C                     EXSR #SB001
     C***                  ENDIF
     C           SKIP1     TAG
     C                     READ ABTWL32                  87
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
JW1   *--------------------------------------------------*
 |    * CHECK BEF                                        *
 |    *--------------------------------------------------*
 V   C           #CHK1     BEGSR
      *
     C                     MOVE *ON       *IN85
      *
     C                     Z-ADDW2CNT     S1CNT
     C                     Z-ADDW2SRTD    S1SRTD
      *
     C                     SELEC
      *
     C           P1KBN     WHEQ '1'
     C                     Z-ADDW2STKD    S1ULD
     C                     ADD  W2SBKD    S1ULD
     C                     ADD  W2HTKD    S1ULD
     C                     Z-ADDW2STID    S1IN
     C                     ADD  W2SBID    S1IN
     C                     ADD  W2HTID    S1IN
     C                     Z-ADDW2STPD    S1PLCD
     C                     ADD  W2SBPD    S1PLCD
     C                     ADD  W2HTPD    S1PLCD
      *
     C           P1KBN     WHEQ '2'
     C           P1KBN     OREQ '5'
     C           P1KBN     OREQ '6'
     C                     Z-ADDW2STKD    S1ULD
     C                     Z-ADDW2STID    S1IN
     C                     Z-ADDW2STPD    S1PLCD
      *
     C           P1KBN     WHEQ '3'
     C                     Z-ADDW2SBKD    S1ULD
     C                     Z-ADDW2SBID    S1IN
     C                     Z-ADDW2SBPD    S1PLCD
      *
     C           P1KBN     WHEQ '4'
     C                     Z-ADDW2HTKD    S1ULD
     C                     Z-ADDW2HTID    S1IN
     C                     Z-ADDW2HTPD    S1PLCD
      *
JW2  C           P1KBN     WHEQ '7'
     C                     Z-ADD0         S1ULD
     C                     Z-ADD0         S1IN
     C                     Z-ADD0         S1PLCD
      *
     C                     ENDSL
      *
     C           S1PLCD    IFNE 0
     C           S1ULD     ADD  S1IN      W@CNT   90
     C           S1ULD     IFGE S1CNT
     C                     ELSE
     C           W@CNT     IFGE S1CNT
     C                     ELSE
     C                     MOVE *OFF      *IN85
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
 |   C           P1KBN     IFEQ '1'
JW2  C           P1KBN     OREQ '7'
 |   C                     MOVE *OFF      *IN85
 |   C                     ENDIF
 V    *
JW1  C                     ENDSR
      *--------------------------------------------------*
      * OUTPUT ABTPR34                                   *
      *--------------------------------------------------*
     CSR         #SB001    BEGSR
      *
     C                     Z-ADDW2CNT     S1CNT
     C                     MOVEL*BLANK    S1LOCA
     C           W2LOC2    IFNE *BLANK
     C           W2LOC2    CAT  '-':0     S1LOCA
     C           S1LOCA    CAT  W2LOC3:0  S1LOCA
     C                     ENDIF
      *
     C                     MOVEL*BLANK    S1SHN
     C                     MOVELW2LPR1    S1SHN
     C           W2LPR2    IFNE *BLANK
     C           S1SHN     CAT  '-':0     S1SHN
     C           S1SHN     CAT  W2LPR2:0  S1SHN
     C                     ENDIF
     C           W2LPR3    IFNE *BLANK
     C           S1SHN     CAT  '-':0     S1SHN
     C           S1SHN     CAT  W2LPR3:0  S1SHN
     C                     ENDIF
      *
     C                     Z-ADDW2SRTD    S1SRTD
      *
     C                     Z-ADDW2STKD    S1ULD
     C                     Z-ADDW2STID    S1IN
     C                     Z-ADDW2STPD    S1PLCD
     C***                  MOVEL'SRT'     S1PROC
     C                     MOVELW2MSN#    S1MSN#
     C                     Z-ADDW2NODT    S1NODT
     C                     MOVELW2NOBN    S1NOBN
     C                     MOVEL*BLANK    S1NOTM
     C                     MOVELW2NOTM    S1NTIH
     C                     MOVEL':'       S1NTTT
     C                     MOVE W2NOTM    S1NTIM
JW   C                     MOVELW2NONY    S1NON2
     C                     MOVEL*BLANK    S1TONM
     C           KEYGAD    KLIST
     C                     KFLD           W2TOKU
     C                     KFLD           W2NONY
     C                     KFLD           W2NKOJ
     C                     KFLD           W2NUKE
     C           KEYGAD    CHAINGADPL11              47
     C           *IN47     IFEQ '0'
     C                     MOVELB5KMEI    S1TONM
     C                     ENDIF
      *
     C           P1KBN     IFEQ '7'
     C                     EXSR #PTLOC
     C                     MOVEL@PTLOC    S1LOC1
     C  N88                WRITEABTP3472
     C   88                WRITEABTP3474
     C                     ELSE
     C  N88                WRITEABTPR342
     C   88                WRITEABTPR344
     C                     ENDIF
      *
     CSR         ESB001    ENDSR
      *--------------------------------------------------*
      * GET PT LOCATION                                  *
      *--------------------------------------------------*
     C           #PTLOC    BEGSR
      *
     C                     MOVELW2LPR     $SHIN
     C                     MOVE *BLANK    $DATE
     C                     CALL 'UTLR21L'
IN   C                     PARM           $SHIN  12
"    C                     PARM           $DATE   8
OUT  C                     PARM           $LOC1   6
"    C                     PARM           $LOC2   6
"    C                     PARM           $LOC3   6
"    C                     PARM           $LOC4   6
"    C                     PARM           $LOC5   6
"    C                     PARM           $LOC6   6
"    C                     PARM           $LOC7   6
"    C                     PARM           $LOC8   6
"    C                     PARM           $RTN    1
      *
     C                     MOVE *BLANK    @@LOC
     C                     SELEC
     C           $LOC8     WHNE *BLANK
     C                     MOVEL$LOC8     @@LOC
     C           $LOC7     WHNE *BLANK
     C                     MOVEL$LOC7     @@LOC
     C           $LOC6     WHNE *BLANK
     C                     MOVEL$LOC6     @@LOC
     C           $LOC5     WHNE *BLANK
     C                     MOVEL$LOC5     @@LOC
     C           $LOC4     WHNE *BLANK
     C                     MOVEL$LOC4     @@LOC
     C           $LOC3     WHNE *BLANK
     C                     MOVEL$LOC3     @@LOC
     C           $LOC2     WHNE *BLANK
     C                     MOVEL$LOC2     @@LOC
     C           $LOC1     WHNE *BLANK
     C                     MOVEL$LOC1     @@LOC
     C                     ENDSL
      *
     C                     MOVE *ALL'-'   @PTLOC  5
     C                     MOVEL@@LOC2    @PTLOC
     C                     MOVE @@LOC3    @PTLOC
      *
     C                     ENDSR
