     H            Y.
      *------------------------------------------------------
      ** ABVR0F *********************************************
      *  VW DESADV  ASN DATA CREATE                         *
      *                                                     *
      * TCHK  11/27/13 CREATE                               *
      * LEC   10/31/16 CHANGE TO OUTPUT 5 SERIAL #S/RECORD  *
JW1   * JW    05/26/17 CHANGE PACKEGE CODE 550054 TO 550104 *
JW2   * JW    11/15/18 ADD E7DCNM TO ABVEP57                *
JW3   * JW    12/10/18 CHG E2ORDR TO '000001'               *
JW4   * JW    02/25/19 CHG BL#  LENGTH 8 TO 10              *
JW5   * JW    08/15/19 ADD AB#EP6A (ASN LOG)                *
JW6   * JW    11/26/19 FIX BUG (ASN NOT ISSUED)             *
JW7   * JW    01/21/20 FIX PACKAGE TYPE                     *
JW8   * JW    07/23/20 USE ABVEL57B TO VERIFY DUPLIACE ASN  *
JW9   * JW    11/04/20 CHG ASN PACKAGE TYPE (2 TYPES IN ONE)*
JWA   * JW    11/13/20 STOP CHECKING INVOICE# FOR MANUAL ORD*
JWB   * JW    04/29/21 CHECK @@SCN=0 (SCANNED QTY)
JWC   * JW    09/03/21 FIX PACKAGE TYPE
JWD   * JW    12/13/21 FIX PALLET# (@@PLT)
JWE   * JW    02/07/23 CHG ABVPL20 TO ABVPL20A
      * JW    2023/09/05  ADD AB#PP78L (LOG FILE)
      *******************************************************
     FABVPW0F CF  E                    WORKSTN
     F                                              KNUM        1
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     F** ABVPL20 IF  E           K        DISK
JWE  FABVPL20AIF  E           K        DISK
     FABVPL21 IF  E           K        DISK
     FABVPL76 IF  E           K        DISK
     FAB#PL76 UF  E           K        DISK
     FAB#PL75 UF  E           K        DISK
     F            AB#PP751                          KRENAMEAB#75R
     FAB#PL79 UF  E           K        DISK
     FAB#PL11 IF  E           K        DISK
     FAB#PL13 IF  E           K        DISK
     FAB#PL1A IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FAB#PL30 UF  E           K        DISK                      A
     FAB#HP20 O   E                    DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FABVEP52 UF  E           K        DISK                      A
     FABVEP53 UF  E           K        DISK                      A
     FABVEP54 UF  E           K        DISK                      A
     FABVEP55 UF  E           K        DISK                      A
     FABVEP56 UF  E           K        DISK                      A
     F***ABVEL57 UF  E           K        DISK                      A
JW8  FABVEL57BUF  E           K        DISK                      A
     FABVWP0F IF  E                    DISK                      A
     FAB#WP34 O   E                    DISK                      A
     FMITANKF O   F     300            DISK                      A
JW5  FAB#EP6A O   E                    DISK                      A
JW   FAB#PP78LO   E                    DISK
      *------------------------------------------------------
     E                    ERR     1  20 60
     E                    CMD     1   2 78
     E                    SRL       150  9
     E                    CON         5  9
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140@@TIM
     I                                        1   40HHMM
     I                                        1   20H2
     I                                        3   40M2
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        1   60@@TM6
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
JW2  I                                        7  140TODAY
     I            DS
     I                                        1   40@@HM
     I                                        1   20@HR
     I                                        3   40@MN
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1   80K@NOHZ
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1  10 WSHP#
     I                                        1   40W4
     I                                        5  100W6
     I            DS
     I                                        1   80WNOHZ
     I                                        1   40WNOYY
     I                                        5   60WNOMM
     I                                        7   80WNODD
     I            DS
     I                                        1  20 $MHIN
     I                                        1   5 $MHN1
     I                                        6  10 $MHN2
     I                                       11  15 $MHN3
     I                                       16  20 $MHN4
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 WMHN1
     I                                        6  10 WMHN2
     I                                       11  15 WMHN3
     I                                       16  20 WMHN4
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I            DS
     I                                        1  22 W@MST1
     I                                        1   2 W@MSTA
     I                                        3   4 W@MSTB
     I                                        5  13 W@MSTC
     I                                       14  22 W@MSTD
     I*
     I              '946955648'           C         C@DUNS
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1           BARCODE SCAN
     C           W@ID      CASEQ'02'      #SCRN2           MANUAL ENTRY1
     C           W@ID      CASEQ'03'      #SCRN3           MANUAL ENTRY2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIAL SET
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           P#95      PLIST
     C                     PARM           PUSER  10
     C                     PARM           PSIRE   4
     C                     PARM           PNOHZ   8
     C                     PARM           PBIN    20
     C                     PARM           PMANI  18
      *
     C           KEY1      KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C           KEY3      KLIST
     C                     KFLD           K@NONY
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C                     KFLD           K@NUKE
     C           K#P30     KLIST
     C                     KFLD           WNONY   40
     C                     KFLD           WNOYY
     C                     KFLD           WNOMM
     C                     KFLD           WNODD
     C                     KFLD           WNOBN   20
     C           K#PCT     KLIST
     C                     KFLD           K@KWD1  8
     C           K#E57     KLIST
     C                     KFLD           ZNONY   40
     C                     KFLD           WNOHZ
     C                     KFLD           WNOBN
     C*
JW8  C           K#E57B    KLIST
 |   C                     KFLD           ZNONY   40
 |   C                     KFLD           WNOHZ
 |   C                     KFLD           WNOBN
JW8  C                     KFLD           WBLNO8
     C*
     C           K#75Y     KLIST
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
      *
     C           K#70      KLIST
     C                     KFLD           BATOKU
     C                     KFLD           @@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           @@ODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           @@NOBN  2
      *
     C           K#FCE     KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
      *
     C           K#1A      KLIST
     C                     KFLD           K@NOHZ
     C                     KFLD           PNOBN
     C                     KFLD           K@NONY
     C                     KFLD           PSIRK
     C           K#1AX     KLIST
     C                     KFLD           K@NOHZ
     C                     KFLD           PNOBN
     C                     KFLD           K@NONY
     C                     KFLD           PSIRK
     C                     KFLD           BANUKE
     C                     KFLD           BAODRN
      *
     C                     TIME           @@TIM
      *
     C                     MOVEL'EDI856  'K@KWD1
      *
     C           *ENTRY    PLIST
     C                     PARM           PFLG    1
     C                     PARM           P@ERR   1
      *
     C                     MOVE *BLANK    PFLG
     C                     MOVE '01'      W@ID    2
     C                     MOVE *BLANK    $$BAR   9
      *
     C                     MOVE *ON       *IN52
     C                     CLEARCTL01
     C                     MOVE *OFF      *IN52
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     Z-ADD*ZERO     @@RRN   40
     C                     Z-ADDHHMM      @@HM
     C                     MOVE @@HM      STM
      *
     C                     Z-ADD1.07      PWEIG
      *
     C                     MOVE *ON       *IN54
     C                     CLEARCTL02
     C                     MOVE *OFF      *IN54
      *
     C           1         DO   100       RRN2    40
     C                     CLEARSFL02
     C                     WRITESFL02
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @SQNO   40
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCRN1    BEGSR
      *---------------------------------------------------
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     WRITECTL01
     C                     READ ABVPW0F                7172
     C                     MOVE *OFF      *IN51
     C                     MOVE *BLANK    LXODRN 10
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      *
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      * <F7>
     C           *INKG     WHEQ *ON
     C           *IN97     ANDEQ*ON
     C                     MOVE D@BAR     $$BAR
     C                     EXSR #CHK1
      * <F9>
     C           *INKI     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     SETOF                     029903
     C                     MOVE *BLANK    MSG
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C           @@OK      ANDEQ'1'
     C           *IN99     IFEQ *OFF
     C                     EXSR #WIN2
     C           W@ID      IFEQ '99'
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
     C           *IN99     IFEQ *ON
     C                     MOVE *ON       *IN02
     C                     MOVE ERR,18    MSG
     C                     ELSE
     C                     EXSR #OUT
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CHK1     BEGSR
      *---------------------------------------------------
     C                     SETOF                     029903
     C                     SETOF                     97
     C                     MOVE *BLANK    @SCHK
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    @ERR    1
     C           D@BAR     IFNE *BLANK
     C           D@BAR     CHAINAB#PL76             N90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,1     MSG
     C                     MOVE '1'       @ERR
     C                     ELSE
      *
     C           PUNONY    IFNE 8450
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,14    MSG
     C                     MOVE '1'       @ERR
     C                     ENDIF
      *
      *
     C                     Z-ADDPUNONY    K@NONY
     C                     Z-ADDPUNOYY    K@NOYY
     C                     Z-ADDPUNOMM    K@NOMM
     C                     Z-ADDPUNODD    K@NODD
     C                     Z-ADDPUBINN    WNOBN
     C                     Z-ADDPUBINN    @@BIN   20
     C                     MOVE PUNUKE    K@NUKE  4
     C                     MOVE PUNKOJ    K@NKOJ  1
     C                     MOVE PUODRN    XXODRN 10
     C                     MOVELPUODRN    LXODRN 10
     C                     MOVE *BLANK    D@ORDR
     C                     EXSR #SCHK
     C                     EXSR #LCHK
      *
     C                     MOVE *BLANK    SRL
     C                     Z-ADD*ZERO     Z       30
      *
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     ADD  1         Z
     C                     MOVE S@BARC    SRL,Z
     C           D@BAR     IFEQ S@BARC
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,2     MSG
     C                     MOVE '1'       @ERR
     C                     ELSE
JW8  C**         PUNONY    IFNE H@NONY
 |   C**         PUNKOJ    ORNE H@NKOJ
 |   C**         @NOHZ     ORNE H@NOHZ
JW8  C**         PUBINN    ORNE H@NOBN
     C           S@BARC    IFNE *BLANK
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,3     MSG
     C                     MOVE '1'       @ERR
     C                     ENDIF
JW8  C**                   ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C           STM       IFEQ *BLANK
     C                     SETON                     0399
     C                     ENDIF
      *
     C           PUASDT    IFNE *ZERO
     C           D@BAR     ANDNE$$BAR
     C  N99                MOVE ERR,20    MSG
     C                     SETON                     029799
     C                     MOVE '1'       @ERR
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     ADD  1         @@RRN
     C                     MOVE '1'       @@OK    1
     C           @@RRN     CHAINSFL01                90
     C                     MOVE D@BAR     S@BARC
     C                     MOVE PUNONY    H@NONY
     C                     MOVE PUNKOJ    H@NKOJ
     C                     Z-ADD@NOHZ     H@NOHZ
     C                     Z-ADDPUBINN    H@NOBN
     C                     MOVE PUNONY    PSIRE
     C                     MOVE PUNKOJ    PSIRK
     C                     MOVE @NOHZ     PNOHZ
     C                     MOVE @NOHZ     WNOHZ
     C                     MOVE PUBINN    PNOBN
     C                     MOVE PUBINN    K@NOBN  20
     C                     Z-ADDPUNONY    K@NONY  40
     C                     Z-ADDPUCUST    K@CUST  40
     C                     Z-ADDPUCUST    WWCUST  40
     C                     Z-ADDPUNOYY    K@NOYY
     C                     Z-ADDPUNOMM    K@NOMM
     C                     Z-ADDPUNODD    K@NODD
     C                     Z-ADDPUBINN    @@BIN   20
     C                     MOVE PUNUKE    K@NUKE  4
     C                     MOVE PUNKOJ    K@NKOJ  1
     C                     ADD  1         Z
     C                     MOVE S@BARC    SRL,Z
     C           *IN90     IFEQ *ON
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ELSE
     C                     UPDATSFL01
     C                     ENDIF
     C**
     C           @@RRN     IFEQ 1
     C                     MOVE PUNONY    P@NONY  4        DELIVERY CODE
     C                     MOVE PUNKOJ    P@NKOJ  1        FACTORY
     C                     MOVE PUNUKE    P@NUKE  4        DOCK
     C                     MOVE @NOHZ     P@NOHZ  8
     C                     MOVE PUBINN    P@NOBN  2        BIN
     C                     MOVE PUODRN    P@ODRN 10        ORDER NO
     C                     MOVE *BLANK    P@FLG   1
     C                     CALL 'ABVR0G'
     C                     PARM           P@NONY  4        DELIVERY CODE
     C                     PARM           P@NKOJ  1        FACTORY
     C                     PARM           P@NUKE  4        DOCK
     C                     PARM           P@NOHZ  8
     C                     PARM           P@NOBN  2        BIN
     C                     PARM           P@ODRN 10        ORDER NO
     C                     PARM           P@FLG   1
     C                     ENDIF
     C**
     C                     MOVE *BLANK    D@BAR
     C                     MOVE *BLANK    $$BAR
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     MOVE *BLANK    D@ORDR
      *
     C           P@FLG     IFEQ '1'
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,19    MSG
JW   C                     MOVE '1'       MSG
     C                     SETON                     0299
     C                     MOVE S@BARC    D@BAR
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #WIN2     BEGSR
      *---------------------------------------------------
     C                     DO   *HIVAL
     C                     WRITEWIN02
     C                     READ ABVPW0F                7172
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C                     LEAVE
      *
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     LEAVE
      *
     C           *INKL     WHEQ *ON
     C                     LEAVE
      *
     C                     OTHER
     C                     EXSR #WCHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*---------------------------------------------------
     C           #WCHK2    BEGSR
     C*---------------------------------------------------
     C                     SETOF                     99
     C                     SETOF                     616263
     C           PTRCK     IFEQ *BLANK
     C                     SETON                     9961
     C                     ENDIF
      *
     C           PSCAC     IFEQ *BLANK
     C                     SETON                     9962
     C                     ENDIF
     C           PTRAN     IFLT '1'
     C           PTRAN     ORGT '5'
     C                     SETON                     9963
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCRN2    BEGSR
      *---------------------------------------------------
     C                     WRITEDSP02
     C                     READ ABVPW0F                7172
      *
     C                     SELEC
      *
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      *
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C           *INKI     WHEQ *ON
     C                     MOVE '01'      W@ID
     C                     SETOF                     029903
     C                     MOVE *BLANK    MSG
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C                     MOVE '03'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CHK2     BEGSR
      *---------------------------------------------------
     C                     MOVEA'00000000'*IN,60
     C                     SETOF                     99
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    @SCHK
      *
     C           PSIRE     IFEQ *BLANK
     C           PSIRK     OREQ *BLANK
     C                     MOVEA'11'      *IN,61
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,5     MSG
     C                     ENDIF
      *
     C           PNOHZ     IFEQ *BLANK
     C                     MOVE *ON       *IN63
     C  N99                MOVE ERR,6     MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PNOBN     IFEQ 0
     C                     MOVE *ON       *IN64
     C  N99                MOVE ERR,7     MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PRISU     IFNE *BLANK
     C           PRISU     ANDNE'1'
     C                     MOVE *ON       *IN65
     C  N99                MOVE ERR,8     MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVE PSIRE     WNONY
     C                     MOVE PNOHZ     WNOHZ
     C                     MOVE PNOBN     WNOBN
     C                     MOVE PSIRE     K@NONY
     C                     MOVE PNOHZ     K@NOHZ
     C                     MOVE PNOBN     K@NOBN
     C           PRISU     IFEQ '1'
     C           K#P30     CHAINAB#PL30             N90
     C           *IN90     IFEQ *ON
     C                     MOVE *ON       *IN65
     C  N99                MOVE ERR,9     MSG
     C                     MOVE *ON       *IN99
     C                     ELSE
     C                     MOVE BDTRCK    PTRCK
     C                     Z-ADDBDWEGH    PWEIG
     C                     MOVE BDSCAC    PSCAC
     C                     MOVE BDTTYP    PTRAN
     C                     MOVE BDSHTM    STM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVE PSIRE     K@NONY
     C                     MOVE PNOHZ     K@NOHZ
     C                     Z-ADDPNOBN     @@BIN   20
     C                     Z-ADDPNOBN     WNOBN
     C                     MOVE *BLANK    K@NUKE  4
     C                     MOVE PSIRK     K@NKOJ  1
     C                     MOVE *BLANK    XXODRN
     C                     EXSR #SCHK
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCRN3    BEGSR
      *---------------------------------------------------
     C                     MOVEL*OFF      *IN55
      *
     C                     WRITEDSP03
     C                     READ ABVPW0F                7172
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      *
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C           *INKL     WHEQ *ON
     C                     MOVE '02'      W@ID
     C                     OTHER
     C                     EXSR #CHK3
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD2
     C           *IN99     IFEQ *ON
     C                     MOVE *ON       *IN02
     C                     MOVE ERR,18    MSG
     C                     ELSE
     C                     EXSR #OUT
     C           *IN96     IFEQ *OFF
     C                     MOVE ERR,15    MSG
     C                     MOVE *ON       *IN99
     C                     ELSE
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CHK3     BEGSR
      *---------------------------------------------------
     C                     MOVEA'00000000'*IN,60
     C                     SETOF                     99
     C                     MOVE *BLANK    MSG
      *
     C           PTRCK     IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVE ERR,4     MSG
     C                     ENDIF
      *
     C           PWEIG     IFEQ *ZERO
     C                     SETON                     62
     C  N99                MOVE ERR,10    MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PSCAC     IFEQ *BLANK
     C                     SETON                     64
     C  N99                MOVE ERR,11    MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PTRAN     IFLT '1'
     C           PTRAN     ORGT '5'
     C                     SETON                     65
     C  N99                MOVE ERR,12    MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PSCAC     IFEQ *BLANK
     C                     SETON                     64
     C  N99                MOVE ERR,11    MSG
     C                     MOVE *ON       *IN99
     C                     END
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #UPD      BEGSR
      *---------------------------------------------------
TCHLAC                     CALL 'AB#R0F1'
TCHLAC                     PARM           PSIRE
TCHLAC                     PARM           @@MAX   30
TCHLAC*
     C                     Z-ADD*ZERO     @@BOX   90
     C                     Z-ADD*ZERO     @@BOX1  90
     C                     Z-ADD*ZERO     @@BOX2  90
     C                     Z-ADD*ZERO     @@PLT   60
      *
     C                     Z-ADD*ZERO     W@RRN   40
     C                     MOVE *OFF      *IN99
     C           *IN90     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@BARC    CHAINAB#PL76             N91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDPUBINN    WNOBN
     C                     MOVE PUNONY    WNONY
     C                     MOVE PUCUST    WWCUST
     C                     MOVE PUODRN    @@ODRN 10
     C                     MOVE PUNONY    K@NONY
     C                     MOVE PUNOYY    K@NOYY
     C                     MOVE PUNOMM    K@NOMM
     C                     MOVE PUNODD    K@NODD
     C                     MOVE PUNUKE    K@NUKE
     C                     MOVELS@BARC    WFILR     P
     C                     EXSR #NXT
      *
     C           *IN99     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           S@BARC    CHAINAB#PL76              91
     C           *IN91     IFEQ *OFF
     C                     TIME           @@TIM
     C                     Z-ADD@@YMD     PUASDT
     C                     Z-ADD@@YMD     PUKODT
     C                     Z-ADD@@YMD     PUSPDT
     C                     Z-ADD@@TM6     PUKOTN
     C                     MOVEL#USER     PUKOME
     C                     UPDATAB#PP751
     C                     ENDIF
     C           S@BARC    CHAINAB#PL79              91
     C           *IN91     IFEQ *OFF
     C           P8SKJY    ANDEQ*BLANK
     C                     TIME           @@TIM
     C                     Z-ADD@@YMD     P8KODT
     C                     Z-ADD@@TM6     P8KOTM
     C                     MOVEL#USER     P8KONM
      *
     C           P8ASDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     P8ASDT
     C                     TIME           P8ASTM
     C                     MOVEL#USER     P8ASNM
     C                     END
      *
     C           P8SPDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     P8SPDT
     C                     TIME           P8SPTM
     C                     MOVEL#USER     P8SPNM
     C                     END
      *
     C                     UPDATAB#PP781
      * LOG
JW   C                     MOVEL'ABVR0F'  P8ASPG    P
JW   C                     MOVEL'ABVR0F'  P8SPPG    P
JW   C                     MOVEL'ABVR0F'  P8KOPG    P
JW   C                     WRITEAB#PP78R
      *
     C                     ENDIF
      *
     C                     CLEARAB#HP201
     C                     Z-ADD@@YMD     AHKYMD
     C                     TIME           AHKTIM
     C                     MOVEL#PGM      AHKPGM
     C                     MOVEL#USER     AHKPSN
     C                     MOVELS@BARC    AHSERL
     C                     MOVE PUCUST    AHTOKU
     C                     MOVE PUNONY    AHNONY
     C                     Z-ADDPUNOYY    AHNOYY
     C                     Z-ADDPUNOMM    AHNOMM
     C                     Z-ADDPUNODD    AHNODD
     C                     MOVE PUBINN    AHNOBN
     C                     MOVE PUNUKE    AHNUKE
     C                     MOVE PUNKOJ    AHNKOJ
     C                     MOVE PTRCK     AHTRCK
     C                     Z-ADDPWEIG     AHWEIG
     C                     MOVE PSCAC     AHSCAC
     C                     MOVE PTRAN     AHTRAN
     C                     MOVE STM       AHTIME
     C                     MOVELPUODRN    AHODRN
     C                     WRITEAB#HP201
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           *IN99     IFEQ *OFF
      *
     C           WSQTY     DIV  WSYOS     @@PL1   60
     C           @@PL1     DIV  @@MAX     @@PLT
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         @@PLT
     C                     ENDIF
      *
     C                     EXSR #P30
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #P30      BEGSR
      *---------------------------------------------------
     C                     MOVE PSIRE     WNONY
     C                     MOVE PNOHZ     WNOHZ
     C           K#P30     CHAINAB#PL30              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#PL301
     C                     ENDIF
     C                     Z-ADD@@YY      BDKOYY
     C                     Z-ADD@@MM      BDKOMM
     C                     Z-ADD@@DD      BDKODD
     C                     Z-ADDH2        BDKOHH
     C                     Z-ADDM2        BDKOSS
     C                     MOVEL#USER     BDKOME
     C                     MOVE WNONY     BDNONY
     C                     Z-ADDWNOYY     BDNOYY
     C                     Z-ADDWNOMM     BDNOMM
     C                     Z-ADDWNODD     BDNODD
     C                     MOVE WNOBN     BDNOBB
     C                     MOVE PTRCK     BDTRCK
     C                     Z-ADDPWEIG     BDWEGH
     C                     MOVE PSCAC     BDSCAC
     C                     MOVE PTRAN     BDTTYP
     C                     MOVE STM       BDSHTM
     C   90                WRITEAB#PL301
     C  N90                UPDATAB#PL301
      *
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #UPD2     BEGSR
      *---------------------------------------------------
     C                     MOVE *OFF      *IN99
      *
TCHLAC                     CALL 'AB#R0F1'
TCHLAC                     PARM           PSIRE
TCHLAC                     PARM           @@MAX   30
TCHLAC*
     C                     Z-ADD*ZERO     @@BOX   90
     C                     Z-ADD*ZERO     @@BOX1  90
     C                     Z-ADD*ZERO     @@BOX2  90
     C                     Z-ADD*ZERO     @@PLT   60
      *
     C                     MOVE *BLANK    PUNUKE
     C                     MOVE PSIRE     PUNONY
     C                     MOVE PSIRE     WNONY
     C                     MOVE PSIRK     PUNKOJ
     C                     MOVE PNOHZ     @NOHZ
     C                     MOVE PNOBN     PUBINN
     C                     MOVE PNOBN     WNOBN
     C                     MOVE PNOBN     K@NOBN
     C                     MOVE *BLANK    @@ODRN
     C                     MOVE PSIRE     K@NONY
     C                     MOVE PNOHZ     K@NOHZ
     C                     MOVE *BLANK    K@NUKE
      *
     C           K#1A      SETLLAB#PL1A
      *
     C           *IN10     DOUEQ*ON
     C           K#1A      READEAB#PL1A                  10
      *
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BANKOJ    ANDEQPSIRK
      *
     C           PNOBN     IFNE *ZERO
     C           BANOBN    ANDNEPNOBN
     C                     ITER
     C                     END
      *
     C           D@ORDR    IFNE *BLANK
     C           D@ORDR    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C           K#75Y     SETLLAB#PL75
     C           *IN90     DOUEQ*ON
     C           K#75Y     READEAB#PL75                  90
     C           *IN90     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C           PUODRN    IFNE *BLANK
     C           PUODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
     C                     TIME           @@TIM
     C                     Z-ADD@@YMD     PUASDT
     C                     Z-ADD@@YMD     PUKODT
     C                     Z-ADD@@YMD     PUSPDT
     C                     Z-ADD@@TM6     PUKOTN
     C                     MOVEL#USER     PUKOME
     C                     UPDATAB#75R
     C           PUSERL    CHAINAB#PL79              90
     C           *IN90     IFEQ *OFF
     C           P8SKJY    ANDEQ*BLANK
     C                     TIME           @@TIM
     C                     Z-ADD@@YMD     P8KODT
     C                     Z-ADD@@TM6     P8KOTM
     C                     MOVEL#USER     P8KONM
      *
     C           P8ASDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     P8ASDT
     C                     TIME           P8ASTM
     C                     MOVEL#USER     P8ASNM
     C                     END
      *
     C           P8SPDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     P8SPDT
     C                     TIME           P8SPTM
     C                     MOVEL#USER     P8SPNM
     C                     END
      *
     C                     UPDATAB#PP781
      * LOG
JW   C                     MOVEL'ABVR0F'  P8ASPG    P
JW   C                     MOVEL'ABVR0F'  P8SPPG    P
JW   C                     MOVEL'ABVR0F'  P8KOPG    P
JW   C                     WRITEAB#PP78R
      *
     C                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           K#1AX     SETGTAB#PL1A
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #NXT
      *
     C           *IN99     IFEQ *OFF
      *
     C                     CLEARAB#HP201
     C                     TIME           @@TIM
     C                     Z-ADD@@YMD     AHKYMD
     C                     Z-ADD@@TM6     AHKTIM
     C                     MOVEL#PGM      AHKPGM
     C                     MOVEL#USER     AHKPSN
     C                     MOVELS@BARC    AHSERL
     C                     MOVE PSIRE     AHNONY
     C                     Z-ADDWNOYY     AHNOYY
     C                     Z-ADDWNOMM     AHNOMM
     C                     Z-ADDWNODD     AHNODD
     C                     MOVE PNOBN     AHNOBN
     C                     MOVE PSIRK     AHNKOJ
     C                     MOVE PTRCK     AHTRCK
     C                     Z-ADDPWEIG     AHWEIG
     C                     MOVE PSCAC     AHSCAC
     C                     MOVE PTRAN     AHTRAN
     C                     MOVE STM       AHTIME
     C                     WRITEAB#HP201
      *
     C**         WSQTY     DIV  @@MAX     @@PLT
      **
JWD  C           WSQTY     DIV  WSYOS     @@PL1
 .   C           @@PL1     DIV  @@MAX     @@PLT
      *
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         @@PLT
     C                     ENDIF
      *
     C                     EXSR #P30
      *
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
      *   WRITE RECORDS IN A WORK FILE
      *---------------------------------------------------
     C           #NXT      BEGSR
      *
     C                     Z-ADD*ZERO     @@QTY  130
     C                     Z-ADD*ZERO     @@WGHT 130
     C                     Z-ADD*ZERO     @@QTY1 130
     C                     Z-ADD*ZERO     @@QTY2 130
     C                     Z-ADD*ZERO     @@WGH1 132
     C                     Z-ADD*ZERO     @@WGH2 132
     C*
     C                     Z-ADDWNONY     ZNONY
      *
     C                     MOVE *OFF      *IN77
      *
     C           K@NUKE    IFEQ *BLANK
     C           KEY1      SETLLAB#PL111
     C                     ELSE
     C           KEY3      SETLLAB#PL131
     C                     ENDIF
      *
     C                     MOVE *BLANK    XXINVN 16
     C           *IN10     DOUEQ*ON
     C           K@NUKE    IFEQ *BLANK
     C           KEY1      READEAB#PL111                 10
     C                     ELSE
     C           KEY3      READEAB#PL131                 10
     C                     ENDIF
      *
     C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C*
     C           WNOBN     IFNE *ZERO
     C           BANOBN    ANDNEWNOBN
     C                     ITER
     C                     END
      *
     C           D@ORDR    IFNE *BLANK
     C           D@ORDR    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C           @@ODRN    IFNE *BLANK
     C           @@ODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C                     SETON                     U1
      *
     C                     Z-ADDBATANK    WTANK  135
     C                     Z-ADDBATANK    @@TANK 115
     C                     Z-ADDBATANK    $$TANK 135
      *
     C           WTANK     IFEQ 0
      *
     C                     MOVELBATOKU    $TOKU   4
     C                     MOVELBANONY    $NONY   4
     C                     MOVELBANKOJ    $NKOJ   1
     C                     MOVELBANUKE    $NUKE   4
     C                     MOVELBAMHIN    $MHIN  20
     C                     MOVEL*BLANK    $SHIN  12
     C                     MOVEL*BLANK    $FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           $TOKU
     C                     PARM           $NONY
     C                     PARM           $NKOJ
     C                     PARM           $NUKE
     C                     PARM           $MHIN
     C                     PARM           $SHIN
     C                     PARM           $FLG
      *
     C           $FLG      IFEQ '*'
     C                     MOVE *BLANK    $MHN3
     C                     MOVE *BLANK    $MHN4
     C                     END
      *
     C                     MOVE BATOKU    @TOKU   4
     C                     MOVE BANONY    @NONY   4
     C                     MOVE BANKOJ    @NKOJ   1
     C                     MOVE BANUKE    @NUKE   4
     C                     MOVELBAMHIN    @MHIN  20
     C                     MOVE BANOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      *
     C                     Z-ADD@TANK     WTANK
     C                     Z-ADD@TANK     @@TANK
     C                     Z-ADD@TANK     $$TANK
      *
     C           WTANK     IFEQ 0
     C                     MOVE '*'       P@ERR
     C                     END
      *
     C           @CHEK     IFEQ '*'
     C                     EXCPTMITAN
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           K#FCE     CHAINFCEPL01              95
     C           *IN95     IFEQ *ON
     C           A2GSKD    OREQ 'D'
     C                     MOVE 'N'       @FCE    1
     C                     ELSE
     C                     MOVE *BLANK    @FCE
     C                     ENDIF
      * POSTING FILE
B2   C           BACARD    IFNE 'MA02'
     C           BAURHZ    ANDEQ*ZERO
     C                     EXSR #POST
     C                     ENDIF
      *
     C                     Z-ADDBATOKU    WTOKU
     C                     Z-ADDBANONY    WNONY
     C                     MOVE BANKOJ    WNKOJ
     C                     MOVE BANUKE    WNUKE
     C                     MOVELBASHIN    WSHIN
     C*
     C                     MOVELBAMHIN    WMHIN
      *
     C                     MOVE BANOHZ    WNOHZ
     C                     MOVE STM       WNOTM
     C                     Z-ADDBANOBN    WNBIN
     C                     MOVE BAODRN    WORDN
      *
     C                     MOVELBAINVN    WINV#     P
     C           BASIRE    CAT  BASIRK:0  WSIRE   5 P
      *
     C                     Z-ADDBASRYO    WSQTY
     C                     ADD  BASRYO    @@QTY
      *
     C           A2KASI    MULT BASRYO    @@WGHX 112
     C                     ADD  @@WGHX    @@WGHT 130
      *
B2   C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYOS
     C                     ELSE
     C                     Z-ADDBASYOS    WSYOS
E2   C                     END
      *
     C           WSYOS     IFEQ *ZERO
     C                     Z-ADD1         WSYOS
     C                     END
      *
     C                     MOVE BASBAN    WSBAN
      *
     C           WSQTY     DIV  WSYOS     W@BOX   90
     C                     MVR            @@MVR
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         W@BOX
     C                     ENDIF
     C                     ADD  W@BOX     @@BOX
     C*
     C                     MOVELPUSERL    WBLNO
JW7  C                     MOVELPUSERL    WBLNO9  9
"    C                     MOVE WBLNO9    WBLNO8  8
"    C                     MOVEL'2'       WBLNO8
     C*
     C                     WRITEABVWP0F1
      *
 E1  C                     ENDIF
 E0  C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCHK     BEGSR
      *---------------------------------------------------
B0   C           K@NUKE    IFEQ *BLANK
     C           KEY1      SETLLAB#PL111
     C                     ELSE
     C           KEY3      SETLLAB#PL131
E0   C                     ENDIF
      *
JW   C                     MOVE *OFF      *IN10
      *
B0   C           *IN10     DOUEQ*ON
     C           K@NUKE    IFEQ *BLANK
     C           KEY1      READEAB#PL111                 10
     C                     ELSE
     C           KEY3      READEAB#PL131                 10
     C                     ENDIF
      *
 B1  C           *IN10     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C*
E3   C           WNOBN     IFNE *ZERO
     C           BANOBN    ANDNEWNOBN
     C                     ITER
     C                     END
      *
     C           D@ORDR    IFNE *BLANK
     C           D@ORDR    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C           XXODRN    IFNE *BLANK
     C           XXODRN    ANDNEBAODRN
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE BANONY    @@NONY
     C                     MOVE BANOBN    @@NOBN
     C                     MOVE BAODRN    @@ODRN
     C                     Z-ADD*ZERO     @@SCN   90
     C                     MOVE *BLANK    @SCHK   1
     C                     MOVE *BLANK    @TCHK   1
     C           K#70      SETLLAB#PL70
     C           *IN91     DOUEQ*ON
     C           K#70      READEAB#PL70                  91
     C           *IN91     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C                     ADD  EKSRYO    @@SCN
     C                     MOVE '1'       @TCHK
     C                     ENDIF
     C                     ENDDO
      *
JWB  C           @@SCN     IFEQ 0
     C                     MOVELBAINVN    @@ODRN
     C           K#70      SETLLAB#PL70
     C           *IN91     DOUEQ*ON
     C           K#70      READEAB#PL70                  91
     C           *IN91     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C                     ADD  EKSRYO    @@SCN
     C                     MOVE '1'       @TCHK
     C                     ENDIF
     C                     ENDDO
JWB  C                     ENDIF
      *
     C           @@SCN     IFLT BASRYO
     C           BANONY    ANDNE0323
     C           BATOKU    ANDNE3411
     C           @@SCN     ORLT BASRYO
     C           BATOKU    ANDEQ3411
     C           BANONY    ANDNE0323
     C           @TCHK     ANDEQ'1'
     C                     MOVE '1'       @SCHK
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,19    MSG
JW   C                     MOVE '2'       MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #LCHK     BEGSR
      *---------------------------------------------------
     C                     MOVEL'8450'    KVTOKU  4
     C                     MOVEL'8450'    KVNONY  4
      *
     C           K#V21     KLIST
     C                     KFLD           KVTOKU
     C                     KFLD           KVNONY
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
      *
     C           K#V21     SETLLABVPL21
     C                     DO   *HIVAL
     C           K#V21     READEABVPL21                  15
     C   15                LEAVE
     C***                  MOVELAEORNO    WWORNO 10
     C                     MOVELBAINVN    WWINVN 10
      *
     C***        WWORNO    IFNE LXODRN
     C           AEMAN#    IFNE BAINVN
     C                     ITER
     C                     ENDIF
     C           AEPTYP    IFEQ *BLANK
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVE ERR,17    MSG
     C                     MOVE '1'       @ERR
     C                     ENDIF
     C                     ENDDO
      *
JWA  C           BAEDIK    IFEQ 'E'
     C           AEMAN#    IFNE BAINVN
     C                     MOVE *ON       *IN02
     C                     MOVE *ON       *IN99
     C                     MOVELERR,16    MSG
     C                     MOVELBAINVN    LTR11B 11 P
     C                     MOVELAEMAN#    LTR11A 11 P
     C                     MOVELLTR11B    LTR23  23
     C                     MOVE LTR11A    LTR23
     C                     MOVE LTR23     MSG
     C                     MOVE '1'       @ERR
     C                     ENDIF
JWA  C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #POST     BEGSR
      *---------------------------------------------------
     C                     CLEARAB#WP341
     C           BATOKU    IFEQ BANONY
     C                     MOVE BANKOJ    W1TKOJ
     C                     MOVE BANUKE    W1TUKE
     C                     ELSE
     C                     MOVE *BLANK    W1TKOJ
     C                     MOVE *BLANK    W1TUKE
     C                     END
      *
     C                     MOVE BASIRE    W1SIRE
     C                     MOVE BASIRK    W1SIRK
     C                     MOVE BAMHN1    W1THN1
     C                     MOVE BAMHN2    W1THN2
     C                     MOVE BAMHN3    W1THN3
     C                     MOVE BAMHN4    W1THN4
     C                     MOVE 'U'       W1USRI
     C                     MOVE 'K'       W1ODKE
     C                     MOVE *BLANK    W1TEIS
     C                     Z-ADDBATOKU    W1TOKU
     C                     Z-ADDBANONY    W1NONY
     C                     MOVE BANKOJ    W1NKOJ
     C                     MOVE BANUKE    W1NUKE
     C                     MOVE BAMHN1    W1UHN1
     C                     MOVE BAMHN2    W1UHN2
     C                     MOVE BAMHN3    W1UHN3
     C                     MOVE BAMHN4    W1UHN4
     C                     MOVE BASHN1    W1SHN1
     C                     MOVE BASHN2    W1SHN2
     C                     MOVE BASHN3    W1SHN3
     C                     MOVE *BLANK    W1KANR
     C                     MOVELBAODRN    W1ODNO
     C                     MOVELBAINVN    W1NOBN
     C                     MOVE 'C'       W1NOKB
     C                     Z-ADDBANOYY    W1NOYY
     C                     Z-ADDBANOMM    W1NOMM
     C                     Z-ADDBANODD    W1NODD
%0001C                     Z-ADDBANOBN    W1NOBI
     C                     Z-ADDBANOTM    W1NOTM
     C                     Z-ADDWTANK     W1TANK
     C                     MOVE 'C'       W1SUTN
     C                     Z-ADDBANOYY    W1JYRY
     C                     Z-ADDBANOMM    W1JYRM
     C                     Z-ADDBANODD    W1JYRD
     C                     MOVE '9'       W1JKKB
     C                     MOVE BASBAN    W1SEBN
     C                     MOVELBAMHIN    W1UHIN
     C                     Z-ADD@@YY      W1URIY
     C                     Z-ADD@@MM      W1URIM
     C                     Z-ADD@@DD      W1URID
     C                     MOVE 'S'       W1SYBT
     C                     MOVE '4'       W1SOBT
     C                     MOVE '04'      W1GYOM
     C                     MOVE BACARD    W1CARD
     C                     Z-ADDBASRYO    W1NOSU
     C                     Z-ADDBASYOS    W1SYUY
     C                     Z-ADDBADEYY    W1REYY
     C                     Z-ADDBADEMM    W1REMM
     C                     Z-ADDBADEDD    W1REDD
     C           BASYOS    IFEQ *ZERO
     C                     Z-ADDBAUSYS    W1SYUY
     C                     ENDIF
      *
     C           BASYOS    IFNE 0
     C           BASRYO    DIV  BASYOS    W1HAKO
     C                     MVR            WHAK1   30
     C           WHAK1     IFNE 0
     C                     ADD  1         W1HAKO
     C                     END
     C                     END
     C           @FCE      IFEQ 'N'
     C                     MOVE 'S'       W1STKB
     C                     ELSE
     C                     MOVE A2TEHI    W1STKB
     C                     ENDIF
      *
     C                     SETON                     U2
      *
     C                     WRITEAB#WP341
      *
     C                     ENDSR
      *----------------------------------------------------------
      *  OUTPUT EDI FILE
      *----------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     EXSR #VW
      *
     C                     ENDSR
      *----------------------------------------------------------
      *  OUTPUT EDI FILE    VW
      *----------------------------------------------------------
     C           #VW       BEGSR
      *
     C                     CLOSEABVWP0F
     C                     OPEN ABVWP0F
     C                     MOVE *BLANK    @@INV# 20
     C                     MOVE *BLANK    @@ORDN 10
     C                     MOVE *OFF      *IN96
     C           1         SETLLABVWP0F
      *
     C                     DO   *HIVAL
      *
     C                     READ ABVWP0F                  80
     C   80                LEAVE
      *
     C           K#VL20    KLIST
     C                     KFLD           K@@TOK  4
     C                     KFLD           K@@NON  4
     C                     KFLD           WNKOJ
     C                     KFLD           WNUKE
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
     C**JWE                KFLD           WNOYY
     C**                   KFLD           WNOMM
     C**                   KFLD           WNODD
     C                     KFLD           K@ORDN 12
     C*JW6                 KFLD           K@INV# 10
      *
     C                     MOVELWTOKU     K@@TOK
     C                     MOVELWNONY     K@@NON
     C                     MOVELWINV#     K@INV# 10
     C                     MOVELWORDN     K@ORDN    P
     C**         K#VL20    CHAINABVPL20              91
JWE  C           K#VL20    CHAINABVPL20A             91
     C   91                ITER
      *
     C           *IN96     IFEQ *OFF
     C                     EXSR #HEDG
     C                     EXSR #MEAS
     C                     EXSR #NAD
     C                     EXSR #TDT
     C                     MOVE *ON       *IN96
     C                     ENDIF
     C*
     C           K#L76     KLIST
     C                     KFLD           WNOYY
     C                     KFLD           WNOMM
     C                     KFLD           WNODD
     C                     KFLD           K@@BIN  2
     C                     KFLD           WMHN1
     C                     KFLD           WMHN2
     C                     KFLD           WMHN3
     C                     KFLD           WMHN4
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           WORDN
     C                     MOVELWNOBN     K@@BIN
     C                     MOVEL*BLANK    W@MST1
     C                     MOVEL*BLANK    W@CN12  9
     C                     MOVEL*BLANK    W@CN22  9
     C                     Z-ADD*ZERO     W@CONT  50
     C                     Z-ADD*ZERO     W@PACK  50
     C           K#L76     SETLLABVPL76
     C*
     C                     DO   *HIVAL
     C*
     C           K#L76     READEABVPL76                  92
     C           *IN92     IFEQ *ON
      *
     C           W@CONT    IFGT *ZERO
     C                     EXSR #DTL
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
      *
      * ignore deleted records.
     C           A7SKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C           W@MST1    IFEQ *BLANK
     C                     MOVELA7MST1    W@MST1
     C                     MOVELA7CON2    W@CN12
     C                     Z-ADD0         W@CONT
     C                     EXSR #CPS
     C                     EXSR #GETPK
     C                     ENDIF
      *
      * if new master label serial #, write detail to abvep52,
      *    write master label detail to abvep53, and get number of packages
      *    for new master label.
     C           W@MST1    IFNE A7MST1
      *
     C           W@CONT    IFGT *ZERO
     C                     EXSR #DTL
     C                     ENDIF
      *
     C                     MOVE *BLANKS   CON
     C                     Z-ADD0         W@CONT
     C                     MOVELA7MST1    W@MST1
     C                     MOVELA7CON2    W@CN12
     C                     EXSR #CPS
     C                     EXSR #GETPK
      *
     C                     ENDIF
      *
      * if 5 container label serial #s read, write detail to abvep52.
     C           W@CONT    IFEQ 5
     C                     EXSR #DTL
     C                     MOVE *BLANKS   CON
     C                     Z-ADD0         W@CONT
     C                     MOVELA7MST1    W@MST1
     C                     MOVELA7CON2    W@CN12
     C                     ENDIF
      *
      * accumulate container label serial #
     C                     ADD  1         W@CONT
      *
      * keep container serial #
     C                     Z-ADDW@CONT    NX      30
     C                     MOVELA7CON2    CON,NX
      *
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #HEDG     BEGSR
      *----------------------------------------------------------
      * HEADER
     C                     MOVE *BLANK    @@SHID
      *
     C**         K#E57     SETLLABVEL57
     C**         *IN88     DOUEQ*ON
     C**         K#E57     READEABVEL57                  88
JW8  C           K#E57B    SETLLABVEL57B
"    C           *IN88     DOUEQ*ON
"    C           K#E57B    READEABVEL57B                 88
      *
     C           *IN88     IFEQ *OFF
     C                     MOVE E7SHID    @@SHID 10
     C                     DELETABVEP571
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SHID    IFNE *BLANK
      *
     C           @@SHID    SETLLABVEP52
     C           *IN88     DOUEQ*ON
     C           @@SHID    READEABVEP52                  88
     C           *IN88     IFEQ *OFF
     C                     DELETABVEP521
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SHID    SETLLABVEP53
     C           *IN88     DOUEQ*ON
     C           @@SHID    READEABVEP53                  88
     C           *IN88     IFEQ *OFF
     C                     DELETABVEP531
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SHID    SETLLABVEP54
     C           *IN88     DOUEQ*ON
     C           @@SHID    READEABVEP54                  88
     C           *IN88     IFEQ *OFF
     C                     DELETABVEP541
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SHID    SETLLABVEP55
     C           *IN88     DOUEQ*ON
     C           @@SHID    READEABVEP55                  88
     C           *IN88     IFEQ *OFF
     C                     DELETABVEP551
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SHID    SETLLABVEP56
     C           *IN88     DOUEQ*ON
     C           @@SHID    READEABVEP56                  88
     C           *IN88     IFEQ *OFF
     C                     DELETABVEP561
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     CLEARABVEP571
      * NEW SHIP ID
     C           K#PCT     CHAINAB#PPCT              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     Z-ADD@@YM6     CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     WRITEAB#PPCT1
     C                     Z-ADDCTNBR2    @@NBR   60
     C                     ELSE
     C           CTNBR1    IFEQ @@YM6
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADD@@YM6     CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
     C                     UPDATAB#PPCT1
     C                     Z-ADDCTNBR2    @@NBR
     C                     ENDIF
      *
     C                     Z-ADD@@YM4     W4
     C                     Z-ADD@@NBR     W6
     C                     MOVE WSHP#     E7SHID
     C                     MOVELZNONY     E7PRTN
      *
     C                     TIME           @@TIM
     C                     MOVEL@@YMD     E7DATE
     C                     MOVE HHMM      E7DATE
     C                     MOVE '137'     E7QUAL
     C                     MOVELWTOKU     E7TOKU
     C                     MOVELZNONY     E7NONY
     C                     MOVELWNKOJ     E7NKOJ
     C                     MOVELWNUKE     E7NUKE
     C                     Z-ADDWNOHZ     E7NOHZ
     C                     Z-ADDWNBIN     E7NBIN
     C*
     C                     MOVELWNOHZ     E7DAT2
     C                     MOVE '0000'    E7DAT3
     C                     MOVE '11 '     E7QUL2
     C*
     C           AEDTNM    IFEQ 'NLK'
     C                     MOVEL'191'     E7QUL3
     C                     ELSE
     C                     MOVEL'235'     E7QUL3
     C                     END
     C*
     C                     MOVELAESHDT    E7DAT3
     C                     MOVE '0000'    E7DAT3
     C*
     C**                   MOVELWBLNO     W@A008  8
     C**                   MOVELW@A008    E7BLNO
     C                     MOVELWBLNO8    E7BLNO
     C                     MOVEL'2'       E7BLNO
JW4  C                     MOVELWBLNO     E7FIL1           PACKING LIST#
JW7  C                     MOVELAEDOC1    E7RLNO           SHIP FROM
"    C                     MOVELAEDOC2    E7FIL2           SHIP TO
     C                     MOVELAEDTNM    E7DTNM
     C*
JW2  C                     MOVELAEDCNM    E7DCNM
JW9  C                     MOVEL'07864449'LTR9    9        DUN#
 .   C                     MOVE '5'       LTR9
 .   C                     MOVELLTR9      E7ASWS    P
      *
 |   C                     Z-ADDTODAY     E7ASDT
 |   C**JW2                Z-ADD@@TIM     E7ASTM
 |   C                     Z-ADD@@TM6     E7ASTM
 |   C                     MOVEL#WSID     E7ASWS
 |   C                     MOVEL#USER     E7ASUS
JW2  C                     MOVEL#PGM      E7ASPG
     C*
     C                     WRITEABVEP571
      *
JW5  C                     EXSR #EP6A
     C*
     C                     ENDSR
      *----------------------------------------------------------
     C           #MEAS     BEGSR
      *----------------------------------------------------------
     C                     CLEARABVEP561
     C*
     C                     MOVE E7SHID    E6SHID
     C                     MOVE E7PRTN    E6PRTN
     C*
     C                     MOVEL'AAX'     E66311
     C                     MOVEL'AAD'     E66313
     C           @@WGHT    IFEQ *ZERO
     C                     Z-ADD1         E6VALE
     C                     ELSE
     C           @@WGHT    DIV  1000      E6VALE    H
     C           E6VALE    IFEQ *ZERO
     C                     Z-ADD1         E6VALE
     C                     END
     C                     END
      *
     C           @@BOX     MULT 1.07      W@N009  90H
     C                     ADD  W@N009    E6VALE
     C                     MOVEL'KGM'     E66411
     C                     WRITEABVEP561
     C*
     C                     MOVEL'AAL'     E66313
     C           @@WGHT    DIV  1000      E6VALE    H
     C                     MOVEL'KGM'     E66411
     C                     WRITEABVEP561
      *
     C                     MOVEL'SQ '     E66313
     C                     Z-ADD@@PLT     E6VALE
     C                     MOVEL'NMP'     E66411
     C                     WRITEABVEP561
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #NAD      BEGSR
      *----------------------------------------------------------
     C                     CLEARABVEP551
     C*
     C                     MOVE E7SHID    E5SHID
     C                     MOVE E7PRTN    E5PRTN
     C                     MOVEL'FW'      E51153
     C                     MOVELPSCAC     E51154
     C*
     C                     WRITEABVEP551
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #TDT      BEGSR
      *----------------------------------------------------------
     C                     CLEARABVEP541
     C*
     C                     MOVE E7SHID    E4SHID
     C                     MOVE E7PRTN    E4PRTN
     C                     MOVEL'12'      E48051
     C                     MOVEL'30'      E48067
     C                     MOVEL'9'       E48179    P
     C**                   MOVELPSCAC     E43127    P
JW9  C                     MOVEL'SFUD'    E43127    P      CARRIER
 .   C                     MOVEL'92'      E43055
 .   C**         PSCAC     IFEQ 'RYDD'
     C**                   MOVEL'RYDER'   E43128
     C**                   ELSE
     C**                   MOVEL'XXXX'    E43128
     C**                   END
 .    *
 .   C                     MOVEL'SESE LOG'LTR14  14        CARRIER NAME
 .   C                     MOVE 'OGISTICS'LTR14
JW9  C                     MOVELLTR14     E43128    P
      *
     C                     MOVEL'146'     E41131
     C                     MOVEL'5'       E4305A
     C                     MOVELPTRCK     E48212
     C                     MOVEL'US'      E48453
     C                     MOVEL'1'       E48281
     C*
     C                     MOVEL'TE'      E48053
     C                     MOVELPTRCK     E48260
     C*
     C                     WRITEABVEP541
     C*
     C                     ENDSR
      *----------------------------------------------------------
     C           #CPS      BEGSR
      *----------------------------------------------------------
     C                     CLEARABVEP531
     C*
     C                     MOVELE7SHID    E3SHID
     C                     MOVELE7PRTN    E3PRTN
     C                     MOVELAEMHIN    E3PART
     C                     MOVELW@MSTD    E3PAC1
     C                     Z-ADD1         E3PACK
     C                     MOVELA7ODRN    E3PAC2           MANIFESTE#
     C* PACKING TYPE
     C**         AEPTYP    IFEQ '1'                        RETURNABLE
     C**                   MOVEL'11'      E3CTQ1
     C**                   MOVEL'500168'  E3CTY1
     C**                   MOVEL'11'      E3CTQ2
     C**                   MOVEL'484506'  E3CTY2
     C**                   ENDIF
JW6  C**         AEPTYP    IFNE '1'                        EXPENDABLE
TANE C**                   MOVEL'2'       E3CTQ1
TANE C**                   MOVEL'0000LID' E3CTY1
TANE C**                   MOVEL'2'       E3CTQ2
TANE C**                   MOVEL'0000PAL' E3CTY2
     C**                   ENDIF
JW7   * PACKAGE TYPE (PALLET/LID)
      *
JWC  C                     MOVE A7PGID    @@TYP   2
 .   C           @@TYP     IFEQ '11'                       MIXED
 .   C                     MOVEL'11'      E3CTQ1
 .   C                     MOVEL'500168'  E3CTY1            *LID
 .   C                     MOVEL'11'      E3CTQ2
 .   C                     MOVEL'484506'  E3CTY2            *PALLET
 .   C                     ENDIF
 .   C           @@TYP     IFEQ '22'                       EXPENDABLE
 .   C                     MOVEL'2'       E3CTQ1
 .   C                     MOVEL'0000LID' E3CTY1            *LID
 .   C                     MOVEL'2'       E3CTQ2
 .   C                     MOVEL'0000PAL' E3CTY2            *PALLET
JWC  C                     ENDIF
      *
     C           E3CTQ1    IFNE '11'
     C           E3CTQ1    ANDNE'2 '
     C                     EXSR #DFLT
     C                     ENDIF
      *
     C                     MOVELAEPLAN    E3PLAN
     C*
     C                     WRITEABVEP531
     C*
     C                     ENDSR
      *----------------------------------------------------------
      * DEFAULT PALLET TYPE
      *----------------------------------------------------------
     C           #DFLT     BEGSR
      *
 |   C                     MOVE *BLANK    E3CTQ1
 |   C                     MOVELE7FIL1    @SEQ#   9
 |   C           @SEQ#     CHAINAB#PL79              98
 |   C           *IN98     IFEQ *OFF
 |   C                     MOVELP8FLD3    PTYPE   1
 |   C           PTYPE     IFEQ '1'                        RETURNABLE
 |   C           PTYPE     OREQ '9'                        MIXED
 |   C                     MOVEL'11'      E3CTQ1
 |   C                     MOVEL'500168'  E3CTY1            *LID
 |   C                     MOVEL'11'      E3CTQ2
 |   C                     MOVEL'484506'  E3CTY2            *PALLET
 |   C                     ENDIF
 |   C           PTYPE     IFEQ '2'                        EXPENDABLE
 |   C                     MOVEL'2'       E3CTQ1
 |   C                     MOVEL'0000LID' E3CTY1            *LID
 |   C                     MOVEL'2'       E3CTQ2
 |   C                     MOVEL'0000PAL' E3CTY2            *PALLET
 |   C                     ENDIF
 |   C                     ENDIF
 |    * DEFAULT
 |   C           E3CTQ1    IFEQ *BLANK
 |   C                     MOVEL'2'       E3CTQ1
 |   C                     MOVEL'0000LID' E3CTY1           EXPENDABLE
 |   C                     MOVEL'2'       E3CTQ2
 |   C                     MOVEL'0000PAL' E3CTY2
JW7  C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------------
     C           #DTL      BEGSR
      *----------------------------------------------------------
     C                     CLEARABVEP521
     C*
     C                     MOVELE7SHID    E2SHID
     C                     MOVELE7PRTN    E2PRTN
     C                     MOVELAEMHIN    E2PART
     C                     MOVELW@MSTD    E2PAC1
     C                     MOVELW@CN12    E2PAC2
      *
     C                     Z-ADDW@PACK    E2PACK
      *
     C                     Z-ADDWSYOS     E2SSYS
     C           E2PACK    MULT WSYOS     E2SQTY
      *
      * PACKING TYPE (BOX)
     C**         AEPTYP    IFEQ '1'                        RETURNABLE
JWC  C**         AEPTYP    OREQ '9'                        MIXED
     C**                   MOVEL'11'      E2CTQ1
     C**                   MOVEL'012157'  E2CTY1             *BOX
     C**                   ENDIF
     C**         AEPTYP    IFEQ '2'                        EXPENDABLE
TANE C**                   MOVEL'2'       E2CTQ1
TANE C****JW1              MOVEL'550054'  E2CTY1
JW1  C**                   MOVEL'550104'  E2CTY1             *BOX
     C**                   ENDIF
      *
JWC  C                     MOVELA7PGID    @@PTYP  2
 .   C           @@PTYP    IFEQ '11'                       RETURNABLE
 .   C                     MOVEL'11'      E2CTQ1
 .   C                     MOVEL'012157'  E2CTY1             *BOX
 .   C                     ENDIF
 .   C           @@PTYP    IFEQ '22'                       EXPENDABLE
 .   C                     MOVEL'2'       E2CTQ1
 .   C                     MOVEL'550104'  E2CTY1             *BOX
JWC  C                     ENDIF
      *
     C                     MOVELAEMAN#    E2MAN#
     C                     MOVELAEPLAN    E2PLAN
     C                     MOVELCON,1     E2ML01
     C                     MOVELCON,2     E2ML02
     C                     MOVELCON,3     E2ML03
     C                     MOVELCON,4     E2ML04
     C                     MOVELCON,5     E2ML05
     C                     MOVELE7BLNO    E2BLNO
JW4  C                     MOVELE7FIL1    E2FIL1
     C                     Z-ADDWNOHZ     E2NOHZ
      *
JW3  C**                   MOVELAEORNO    E2ORDR
"    C                     MOVEL'000001'  E2ORDR    P
      *
JW   C                     MOVELAEMHNM    E2PNAM
      * GET MANIFEST TOTAL  QTY
     C                     EXSR #GETP2
      *
     C           W#PACK    IFEQ '00000'
     C           W#PACK    OREQ *BLANK
     C                     Z-ADD0         E2MQTY
     C                     ELSE
     C                     MOVELW#PACK    NUM5    50
     C           NUM5      MULT WSYOS     E2MQTY
     C                     ENDIF
      *
     C           E2MQTY    IFLT E2SQTY
     C                     Z-ADDE2SQTY    E2MQTY
     C                     ENDIF
      *
     C                     WRITEABVEP521
     C                     MOVE *BLANKS   CON
     C*
     C                     ENDSR
      *----------------------------------------------------------
      *  Purpose:  call pgm to get the total # of packages
      *            for master label.
     C           #GETPK    BEGSR
      *----------------------------------------------------------
      *
     C                     Z-ADD*ZERO     W@PACK
      *
     C                     CALL 'ABVR1F'
     C                     PARM           W@MST1
     C                     PARM           W@PACK
      *
     C                     ENDSR
JW7   *----------------------------------------------------------
 |    *  Purpose:  call pgm to get the total # of packages
 |    *            for MANIFEST#.
 |   C           #GETP2    BEGSR
 |    *----------------------------------------------------------
 |    *
 |   C                     MOVELAEORNO    W#MANI
     C                     MOVEL@NOHZ     W#NOHZ
 |    *
 |   C                     CALL 'ABVR1G'
 |   C                     PARM           W#MANI 10
 |   C                     PARM           W#NOHZ  8
 |   C                     PARM           W#PACK  5
 |   C                     PARM           W#RTN   1
 |   C           W#RTN     IFNE *BLANK
 |   C                     MOVEL'00000'   W#PACK
 |   C                     ENDIF
 |    *
JW7  C                     ENDSR
      *----------------------------------------------------------
JW5  C           #EP6A     BEGSR
 |    *----------------------------------------------------------
 |   C                     CLEARAB#EP6A1
 |   C                     MOVELE7SHID    EASHID
 |   C                     MOVELE7PRTN    EAPRTN
 |   C                     Z-ADD@@YMD     EADATE
 |   C                     Z-ADD@@TM6     EATIME
 |   C                     MOVEL#USER     EAUSER
 |   C                     MOVEL#WSID     EAWSID
 |   C                     MOVEL'ABVR0F'  EAPGM
 |   C                     Z-ADDE7TOKU    EATOKU
 |   C                     Z-ADDE7NONY    EANONY
 |   C                     MOVELE7NKOJ    EANKOJ
 |   C                     MOVELE7NUKE    EANUKE
 |   C                     Z-ADDE7NOHZ    EANOHZ
 |   C                     Z-ADDE7NBIN    EANBIN
 |   C                     MOVELE7FIL1    EAPS#
 |   C                     MOVEL'ABVEP57' EALNK
 |   C                     MOVELE7ORNO    EAORDN
 |   C                     MOVELE7BLNO    EAINVN
 |    *
 |   C                     WRITEAB#EP6A1
 |    *
JW5  C                     ENDSR
      *----------------------------------------------------------
     OMITANKF EADD             MITAN
     O                                    1 'U'
     O                                    2 'K'
     O                                    3 ' '
     O                         BATOKU     7
     O                         BANKOJ     8
     O                         BANUKE    12
     O                         BANONY    16
     O                         BANKOJ    17
     O                         BANUKE    21
     O                         BAMHN1    26
     O                         BAMHN2    31
     O                         BAMHN3    36
     O                         BAMHN4    41
     O                         BASHN1    46
     O                         BASHN2    51
     O                         BASHN3    53
     O                         BAODRN    73
     O                                   76 '000'
     O                                   84 'C'
     O                         BANOYY    88
     O                         BANOMM    90
     O                         BANODD    92
     O                         BANOBN    94
      *---------------------------------------------------
** ERR(60A) .......2.........3.........4.........5.........6
BARCODE ERROR.                                               01
ALREADY SCANNED.                                             02
SEND ASN SEPARATELY FOR VOLKSWAGEN !                         03
ENTER TRUCK#.                                                04
DELIVERY CODE ERROR                                          05
DATE ERROR                                                   06
BIN ERROR                                                    07
WRONG ENTRY                                                  08
NO PREVIOUS ASN DATA.                                        09
CONTAINER WEIGHT ERROR.                                      10
SCAC CODE ERROR.                                             11
TRANSPORTATION METHOD ERROR.                                 12
MISSING LISTS.                                               13
NOT VOLKSWAGEN.                                              14
NO DATA                                                      15
INVOICE# NOT FOUND IN VW EDI DATA.                           16
LABEL DATA HAS NOT BEEN CREATED YET.                         17
PLEASE SCAN CASE LABELS AND CONT LABELS FIRST.               18
SCAN ALL THE LABELS AND CASE LABELS FIRST.                   19
ASN DATA HAS BEEN ALREADY MADE. HIT F7 TO RE-CREATE ASN.     20
** CMD
F1:END     F9:MANUAL ENTRY     F5:CREATE
F1:END     F7:NEXT       F12:GO BACK
