     H            Y.
     ** ABVRE6 **************************************************
     *  VW NEW FORECAST PROCESS (DELFOR TO DELJIT)              *
     *  J.W.       2018/11/15                                   *
     ************************************************************
     FABVEP21 IF  E                    DISK
     FABVEP20 O   E                    DISK
      *---------------------------------------------------------
      * RENAME FIELD
     IABVEP211    01
     I              AEDPDT                          XXDPDT
     I              AEORNO                          XXORNO
      *---------------------------------------------------------
     I            DS
     I                                        1  140STIME
     I                                        1   60NOW
     I                                        1   20TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *---------------------------------------------------------
      *
     C                     DO   *HIVAL
     C                     READ ABVEP21                  98
     C   98                LEAVE
      *
     C           AEDCNM    IFEQ 'LAB-ED'
     C                     MOVEL'NLK'     AEDTNM
     C                     MOVELXXDPDT    AEDPDT
     C                     MOVELXXDPDT    AESHDT
     C                     MOVEL'102'     AEDPID
     C                     MOVELAEDOC2    AEPLAN
     C                     MOVEL'DELFOR'  AEHAND
     C                     MOVE *BLANK    AEROUT
     C                     MOVE *BLANK    AEPONT
     C                     MOVE *BLANK    AEMAN#
     C                     MOVEL'1'       AELIN#
     C                     MOVELXXORNO    AEORNO
     C                     MOVELAEDOC2    LTR3    3
     C                     MOVELLTR3      AEDOC1
     C                     Z-ADDAEFR01    AEQNTY
     C                     MOVELAEFD01    AEPKDT
     C                     MOVEL'203'     AEPKID
     C                     MOVELXXDPDT    AEDATE
     C                     WRITEABVEP201
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
      *  INITIALIZE
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     TIME           STIME
      *
     C                     ENDSR
