     H            Y.
      *------------------------------------------------------
      ** ABVR1F2 ********************************************
      *  VW  GET PACKAGE TOTAL FOR ASN MASTER LABEL         *
      *  JW   2020.12.08 CREATE                             *
      *------------------------------------------------------
      *  CALLING SEQ.
      *                    CALL 'ABVR1F2'
      *                    PARM           P@MST1 22
      *                    PARM           P@PGID 10
      *                    PARM           P@PACK  50
      *                    PARM           P@PTTL  50
      *------------------------------------------------------
      *   IN  P@MST1 22A  MASTER LABEL#
      *       P@PGID 10A  PACKAGE TYPE
      *   OUT P@PACK  5,0 # OF BOX (PACKAGE TYPE/MASTER)
      *       P@PTTL  5,0 # OF BOX (TOTAL BOX)
      *******************************************************
     FABVPL78 IF  E           K        DISK
      *
     I            DS
     I                                        1  22 W@MST1
     I                                        1   2 W@MSTA
     I                                        3   4 W@MSTB
     I                                        5  13 W@MSTC
     I                                       14  22 W@MSTD
      *------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@MST1 22
     C                     PARM           P@PGID 10
     C                     PARM           P@PACK  50
     C                     PARM           P@PTTL  50
      *
     C           K#L78     KLIST
     C                     KFLD           W@MST1
      *------------------------------------------------------
      *   M  A  I  N  L  I  N  E
      *------------------------------------------------------
      *
     C                     Z-ADD0         W@PACK  50
     C                     Z-ADD0         W@PTTL  50
     C                     MOVELP@MST1    W@MST1
     C           K#L78     SETLLABVPL78
      *
     C                     DO   *HIVAL
      *
     C           K#L78     READEABVPL78                  92
     C           *IN92     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           A7SKJY    IFNE *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         W@PTTL
      *
     C           A7PGID    IFNE P@PGID
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         W@PACK
      *
     C                     ENDDO
      *
     C                     Z-ADDW@PACK    P@PACK
     C                     Z-ADDW@PTTL    P@PTTL
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
