     H            Y.
     *------------------------------------------------------
     *  CALCULATE TOTAL CONTAINERS SCANNED FOR MASTER LBL *
     *                                                    *
     *  LEC  08/07/17 CREATE                              *
     *------------------------------------------------------
     FABVPP75 IF  E           K        DISK
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      *-----------------------------------------------------
     C           KEY1      CHAINABVPP75              50
     C           *IN50     DOWEQ*OFF
     C           A7SKJY    IFEQ ' '
     C                     ADD  1         CONQTY
     C                     ENDIF
     C           KEY1      READEABVPP75                  50
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZATION
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           M#LABL 22
     C                     PARM           CONQTY  30
      *
     C           KEY1      KLIST
     C                     KFLD           M#LABL
      *
     C                     ENDSR
