     H            Y.
      *******************************************************
      * VW SHIPPING LABEL DATA CREATE                       *
      *                                                     *
      * TCHK  11/05/13 CREATE(COPY FROM AB#R2C)             *
      * TCHK1 06/12/14 CHG #OF PALLET CALC                  *
JW1   * J.WAT 07/20/16 STOP CHEKING DUPLICATE PRINT         *
JW2   * J.WAT 12/13/18 CHG ORDER# TO '000001'               *
JW4   * J.WAT 01/21/20 ADD PACKAGE TYPE TO P8FLD3           *
JW5   * J.WAT 11/06/20 ADD PACKAGE TYPE TO AB#PP70          *
      *  JW  2023/09/05 ADD AB#PP78L (LOG FILE)
      *******************************************************
     FABVPW2C CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     FABVPL20 UF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
     FAB#PL13 IF  E           K        DISK
     F                                              KINFDS @INFDA
     FAB#PL1L IF  E           K        DISK
     FAB#PP70 O   E                    DISK                      A
     FAB#NP30 UF  E           K        DISK                      A
     FAB#PL76 IF  E           K        DISK
     FAB#PL75 UF  E           K        DISK
     F            AB#PP751                          KRENAMEAB#PL75R
     FAB#PL78 UF  E           K        DISK
      ** MASTER LABEL FILE
     FABVWP2E O   E                    DISK
      ** CONTAINER LABEL FILE
     FABVWP2F O   E                    DISK
JW   FAB#PP78LO   E                    DISK
     E*****************************************************************
     E                    ER      1  19 60
     E                    CFK     1   1 78
     E                    INF     1   2 20
     I*****************************************************************
     I@INFDA      DS
     I                                    B 397 4000@@RCD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                       11  140WSSMD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I* INTERNAL PART NUMBER
     I            DS
     I                                        1  12 WIPAR
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I* USER PART(AB#PP10)
     I            DS
     I                                        1  20 WMHIN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
     I            DS
     I                                        1  23 @PART
     I                                        1   5 WAMHN1
     I                                        6   6 @P1
     I                                        7  11 WAMHN2
     I                                       12  12 @P2
     I                                       13  17 WAMHN3
     I                                       18  18 @P3
     I                                       19  23 WAMHN4
     I* SHIPPING DATE(DISPLAY)
     I            DS
     I                                        1   80PNOHZ
     I                                        1   40PNOYY
     I                                        3   40PNOY
     I                                        4   40PY
     I                                        5   60PNOMM
     I                                        7   80PNODD
      *
     I            DS
     I                                        1  12 @SHIN
     I                                        1   5 @SHN1
     I                                        6  10 @SHN2
     I                                       11  12 @SHN3
     I* CHANGE DATE(FCEPL01)
     I            DS
     I                                        1   80A2DATE
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I* LOCATION(FCEPL01)
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   9 WLOC
     I                                        1   1 WLOC1
     I I            '-'                       2   2 @@LC1
     I                                        3   4 WLOC2
     I I            '-'                       5   5 @@LC2
     I                                        6   7 WLOC3
     I I            '-'                       8   8 @@LC3
     I                                        9   9 WLOC4
     I            DS
     I                                        1   60@@TIM
     I                                        1   20@@HH
     I                                        3   40@@MM
     I* SHIPPING DATE
     I            DS
     I                                        1   8 BASHDT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80PUDAT
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1 256 @DX
     I                                        1   1 @DX1
     I                                        2   2 @DX2
     I                                        3   3 @DX3
     I                                        4   4 @DX4
     I                                        5   5 @DX5
     I                                        6   6 @DX6
     I                                        7 256 @DX7
     I            DS
     I I            '1002045134'              1  10 C@SUPP
     I            DS
     I I            '946955648'               1   9 C@DUNS
     I            DS
     I I            '000000000'               1   9 C@ZERO
     I            DS
     I                                        1  12 W@NOHZ
     I I            'U '                      1   2 W@NOM1
     I                                        3   6 W@NOYY
     I I            '-'                       7   7 W@NOM2
     I                                        8   9 W@NOMM
     I I            '-'                      10  10 W@NOM3
     I                                       11  12 W@NODD
     I            DS
     I                                        1   8 W@DPHZ
     I                                        1   4 W@DPYY
     I                                        5   6 W@DPMM
     I                                        7   8 W@DPDD
     C***********************************************************************
     C* PARM                                                                *
     C***********************************************************************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C* AB#R2K
     C           P2        PLIST
     C                     PARM           PIQTY  300       NUMERIC QTY
     C                     PARM           POQTY  30        CHAR    QTY
      *
     C***********************************************************************
     C* KEY1                                                                *
     C***********************************************************************
     C* FIXED ORDER FILE(AB#PL13)
     C           KEY1      KLIST
     C                     KFLD           WNONY
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C* FIXED ORDER FILE(AB#PL1L)
     C           KEY6L     KLIST
     C                     KFLD           WNONY   40
     C                     KFLD           PNOYY
     C                     KFLD           PNOMM
     C                     KFLD           PNODD
     C                     KFLD           PNUKE
     C                     KFLD           WORDN  10
     C                     KFLD           WAMHN1
     C                     KFLD           WAMHN2
     C                     KFLD           WAMHN3
     C                     KFLD           WAMHN4
     C* PART MASTER(FCEPL01)
     C           KEY2      KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C*
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C*
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     MOVE '0'       WKDSP   1
     C                     MOVE *ALL'0'   WKBLAK 10
     C                     Z-ADD1         BIN
     C                     Z-ADD*ZERO     W1RRN   40
     C                     Z-ADD*ZERO     G       40
     C                     Z-ADD*ZERO     Q       40
     C                     Z-ADD*ZERO     W#LAB   30
     C*
     C                     MOVE *BLANK    PNONY
     C                     MOVE *BLANK    PNKOJ
     C                     MOVE *BLANK    PNUKE
     C                     Z-ADD*ZERO     PNOHZ
     C                     MOVE *BLANK    PORD#
     C                     Z-ADD*ZERO     W@MXPL  30
     C*
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
      *
     C                     MOVE *OFF      *IN22
JW   C                     Z-ADD0         SVKODT  80
 .   C                     Z-ADD0         SVKOTM  60
     C*
     C                     ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C           *INKC     DOWEQ'0'
     C*
     C                     SELEC
     C           WKDSP     WHEQ '0'
     C                     EXFMTABVPW2C0
      *
     C           WKDSP     WHEQ '1'
     C                     EXFMTABVPW2C2
     C*
     C                     OTHER
     C                     WRITEABVPW2C1
     C                     SETON                     70
     C                     EXFMTCTL01
     C                     SETOF                     70
     C                     ENDSL
     C* CLEAR MSG
     C                     MOVEAWKBLAK    *IN,30
     C                     SETOF                     87
     C*
     C           *INKC     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C*
     C                     SELEC
      * BARCODE
     C           WKDSP     WHEQ '0'
     C           *INKI     IFEQ *ON
     C                     CLEARABVPW2C2
     C                     MOVE '1'       WKDSP
     C                     ELSE
      *
     C                     EXSR @CHK0
     C           *IN30     IFEQ *OFF
     C           RRN2      ANDNE*ZERO
      *
     C                     DO   *HIVAL
     C                     MOVE CFK,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           *INKK     WHEQ *ON
     C                     LEAVE
     C                     ENDSL
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN30     IFEQ *OFF
     C                     EXSR @WRT1
     C           @@CNT     IFEQ *ZERO
     C                     MOVELER,12     MSG
     C                     MOVE *ON       *IN30
     C                     MOVE *OFF      *IN87
     C                     ELSE
     C                     EXSR @CLR0
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      * MANUAL ENTRY
     C           WKDSP     WHEQ '1'
      *
     C           *INKL     IFEQ *ON
     C                     MOVE '0'       WKDSP
     C                     ITER
     C                     ENDIF
      *
     C                     EXSR @CHK1
     C           *IN30     IFEQ *OFF
     C           *INKG     ANDEQ*OFF
     C           RRN2      ANDNE*ZERO
     C                     DO   *HIVAL
     C                     MOVE CFK,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN53
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN53
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           *INKK     WHEQ *ON
     C                     LEAVE
     C                     ENDSL
     C                     ENDDO
     C                     ENDIF
      *
     C                     SELEC
     C           *INKE     WHEQ '1'
     C           *INKK     OREQ '1'
     C* CHECK OK?
     C           *IN30     IFEQ '0'
     C                     EXSR @WRT1
     C           @@CNT     IFEQ *ZERO
     C                     MOVELER,12     MSG
     C                     MOVE *ON       *IN30
     C                     MOVE *OFF      *IN87
     C                     ENDIF
     C                     END
      *
     C           *INKG     WHEQ '1'
     C           *IN30     IFEQ '0'
     C                     EXSR @SFL
     C                     END
     C*
     C           *INKL     WHEQ '1'
     C                     MOVE '0'       WKDSP
      *
     C                     ENDSL
     C*
     C* 2ND. SCREEN
     C                     OTHER
      *
     C                     SELEC
     C           *INKE     WHEQ '1'
     C           *INKG     OREQ '1'
     C                     EXSR @CHK2
     C* CHECK OK?
     C           *IN30     IFEQ '0'
     C                     EXSR @WRT2
     C                     EXSR @CLRS
     C                     END
     C           *INKL     WHEQ '1'
     C                     EXSR @CLRS
     C                     OTHER
     C                     EXSR @CHK2
     C                     ENDSL
     C*
     C                     ENDSL
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
     C* @CHK0:CHECK BARCODE
     C***********************************************************
     C           @CHK0     BEGSR
     C*
     C                     DO
     C*
     C           D@PCKC    IFEQ '1'
     C           D@PCKC    OREQ '2'
     C                     ELSE
     C                     SETON                     3032
     C                     MOVELER,18     MSG
     C                     LEAVE
     C                     END
     C*
     C           D@BARC    CHAINAB#PL76              90
     C           *IN90     IFEQ *ON
     C                     SETON                     3031
     C                     MOVELER,15     MSG
     C                     LEAVE
     C                     END
      *
     C           PUNONY    IFNE 8450
     C                     SETON                     3031
     C                     MOVELER,17     MSG
     C                     LEAVE
     C                     END
      *
     C           PULPDT    IFNE 0
     C**JW1                SETON                     3031
     C**                   MOVELER,19     MSG
     C**                   MOVE PULPDT    MSG
     C**                   LEAVE
JW1  C                     DO   *HIVAL
 |   C                     MOVEL*OFF      *INKJ
 |   C                     MOVEL*OFF      *INKL
 |   C                     Z-ADDPULPDT    WINDT
 |   C                     EXFMTWIN01
 |   C           *INKL     IFEQ *ON
 |   C                     SETON                     3031
 |   C                     MOVELER,19     MSG
 |   C                     MOVE PULPDT    MSG
 |   C                     LEAVE
 |   C                     ENDIF
 |   C           *INKJ     IFEQ *ON
 |   C                     Z-ADD0         PULPDT
 |   C                     LEAVE
 |   C                     ENDIF
JW1  C                     ENDDO
     C                     ENDIF
     C*
     C                     MOVELPUNONY    PNONY
     C                     MOVELPUNKOJ    PNKOJ
     C                     MOVELPUNUKE    PNUKE
     C                     Z-ADDPUBINN    BIN
     C                     Z-ADDPUDAT     PNOHZ
     C                     MOVELPUODRN    PORD#
     C                     MOVE PNONY     WNONY   40
     C                     EXSR #SYSCH
     C*
     C                     MOVELD@PCKC    PPCKC
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C***********************************************************
     C* QTY/BOX CHECK
     C***********************************************************
     C           #SYSCH    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2    40
     C                     MOVE *ON       *IN54
     C                     WRITECTL02
     C                     MOVE *OFF      *IN54
      *
     C                     Z-ADD*ZERO     @ITM    30
      *
     C           KEY1      SETLLAB#PL13
     C           *IN93     DOUEQ*ON
     C           KEY1      READEAB#PL131                 93
     C           *IN93     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           PORD#     IFNE *BLANK
     C           PORD#     ANDNEBAODRN
     C                     ITER
     C                     ENDIF
     C           BIN       IFNE *ZERO
     C           BANOBN    ANDNEBIN
     C                     ITER
     C                     ENDIF
     C           PNUKE     IFNE *BLANK
     C           BANUKE    ANDNEPNUKE
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         @ITM
      *
     C           BASYOS    IFEQ *ZERO
     C                     MOVE BATOKU    PTOKU
     C                     MOVE BANONY    PNONY
     C                     MOVE *BLANK    @SHIN
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           BANKOJ
     C                     PARM           BANUKE  4
     C                     PARM           WMHIN
     C                     PARM           @SHIN
     C                     PARM           @FLG    1
     C                     MOVE @SHN1     BASHN1
     C                     MOVE @SHN2     BASHN2
     C                     MOVE @SHN3     BASHN3
     C           KEY2      CHAINFCEPL011             91
     C           *IN91     IFEQ *OFF
     C                     Z-ADDA2SSYS    BASYOS
     C                     ENDIF
     C                     ENDIF
      *
     C           BASYOS    IFNE *ZERO
     C           BASRYO    DIV  BASYOS    @@BOX   50
     C                     MVR            @@MVR   50
     C           @@MVR     IFNE *ZERO
     C                     ADD  1         RRN2
     C                     MOVE BASHN1    S@PRT1
     C                     MOVE BASHN2    S@PRT2
     C                     MOVE BASHN3    S@PRT3
     C                     Z-ADDBAUSYS    S@BOX1
     C                     Z-ADDBASYOS    S@BOX2
     C                     Z-ADDBASRYO    S@QTY
     C                     MOVE INF,2     S@MSG
     C                     WRITESFL02
     C                     ENDIF
     C                     ENDIF
      *
     C           BAUSYS    IFNE BASYOS
     C           BAUSYS    ANDNE*ZERO
     C           BASYOS    ANDNE*ZERO
     C                     ADD  1         RRN2
     C                     MOVE BASHN1    S@PRT1
     C                     MOVE BASHN2    S@PRT2
     C                     MOVE BASHN3    S@PRT3
     C                     Z-ADDBAUSYS    S@BOX1
     C                     Z-ADDBASYOS    S@BOX2
     C                     Z-ADDBASRYO    S@QTY
     C                     MOVE INF,1     S@MSG
     C                     WRITESFL02
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
     C***********************************************************
     C* @CLR :CLR SCREEN
     C***********************************************************
     C           @CLR0     BEGSR
     C*
     C                     MOVEL*BLANK    D@BARC
     C                     MOVEL*BLANK    D@PCKC
      *
     C                     ENDSR
     C***********************************************************
     C* @CHK1:CHECK ITEMS ON 1ST. SCREEN
     C***********************************************************
     C           @CHK1     BEGSR
     C*
     C* DELIVERY CODE BLANK ?
     C           PNONY     IFEQ *BLANK
     C                     SETON                     3031
     C                     MOVELER,1      MSG
     C                     GOTO #CHK1
     C                     END
     C           PNONY     IFNE '8450'
     C                     SETON                     3031
     C                     MOVELER,17     MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* FACTORY CODE BLANK ?
     C           PNKOJ     IFEQ *BLANK
     C                     SETON                     3032
     C                     MOVELER,2      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* DOCK CODE BLANK ?
     C           PNUKE     IFEQ *BLANK
     C           *INKG     ANDEQ*ON
     C                     SETON                     3033
     C                     MOVELER,3      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* SHIPPING DATE
     C           PNOHZ     IFEQ 0
     C                     SETON                     3034
     C                     MOVELER,4      MSG
     C                     GOTO #CHK1
     C                     END
      *
     C           PNOMM     IFLT 1
     C           PNOMM     ORGT 12
     C                     SETON                     3034
     C                     MOVELER,5      MSG
     C                     GOTO #CHK1
     C                     END
      *
     C           PNODD     IFLT 1
     C           PNODD     ORGT 31
     C                     SETON                     3034
     C                     MOVELER,5      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C*
     C           PPCKC     IFEQ '1'
     C           PPCKC     OREQ '2'
     C                     ELSE
     C                     SETON                     3037
     C                     MOVELER,18     MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C* BIN       *
     C           BIN       IFEQ 0
     C                     SETON                     3035
     C                     MOVELER,6      MSG
     C                     GOTO #CHK1
     C                     END
     C*
     C                     MOVE PNONY     WNONY   40
     C                     EXSR #SYSCH
     C*
     C           #CHK1     ENDSR
     C***********************************************************
     C* @CHK2:CHECK SFL
     C***********************************************************
     C           @CHK2     BEGSR
     C*
     C                     SETOF                     89
     C                     SETOF                     31
     C                     Z-ADD1         RRN
     C                     DO   W1RRN
     C           RRN       CHAINSFL01                94
     C*
     C           *IN94     IFEQ '0'
     C           @FLAG     IFNE *BLANK
     C           @#LAB     ORNE *ZERO
     C                     SETON                     89
     C                     END
     C           @USYS     IFNE @SYOS
     C                     MOVE *ON       *IN61
     C                     MOVELER,16     MSG
     C                     MOVE *ON       *IN31
     C                     ELSE
     C                     MOVE *OFF      *IN61
     C                     ENDIF
     C                     UPDATSFL01
     C                     END
     C*
     C* NOT USE # OF LABELS
     C                     ADD  1         RRN
     C                     ENDDO
     C*
     C           *IN89     IFEQ '0'
     C                     SETON                     30
     C                     MOVELER,8      MSG
     C                     END
     C*
     C                     Z-ADD1         RRN
     C*
     C                     ENDSR
     C***********************************************************
     C* @DSPATR(CS) LABEL DATA
     C***********************************************************
     C           @WRT1     BEGSR
     C*
     C                     Z-ADD*ZERO     @@CNT   50
     C                     MOVE PNONY     WNONY   40
     C                     SETON                     87
     C* GET THE NUMBER OF LABEL
     C           PNONY     CHAINAB#PL90              96
     C           *IN96     IFEQ '0'
     C                     Z-ADDYA#LAB    W#LAB
     C                     Z-ADDYAMXPL    W@MXPL
     C                     ELSE
     C                     Z-ADD1         W#LAB
     C                     END
     C*
     C                     EXSR @8450
     C*
     C           #WRT1     ENDSR
     C***********************************************************
     C           @NMBR     BEGSR
      *
     C                     MOVE *ALL'9'   @@14   140
     C           WNONY     CHAINAB#NP30              97
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    N3UDAT
     C                     Z-ADDWSSTM6    N3UTIM
     C                     MOVEL#PGM      N3UPGM
     C                     MOVEL#USER     N3UUSR
     C                     MOVEL#WSID     N3UWIS
     C                     Z-ADDWNONY     N3NONY
     C           *IN97     IFEQ *ON
     C                     Z-ADD1         N3NMBR
     C                     WRITEAB#NP301
     C                     ELSE
     C                     ADD  1         N3NMBR
     C           N3NMBR    IFEQ @@14
     C                     Z-ADD1         N3NMBR
     C                     ENDIF
     C                     UPDATAB#NP301
     C                     ENDIF
     C*
     C                     MOVELC@ZERO    N3NMBR
     C*
     C                     ENDSR
     C***********************************************************
     C* @8450 VW(2D)
     C***********************************************************
     C           @8450     BEGSR
      *
     C***                  MOVE X'BA'     @HX1    1
     C***                  MOVE X'5B'     @HX1    1
     C*** CORRECT          MOVE X'AD'     @HX1    1
     C                     MOVE '['       @HX1    1
     C                     MOVE X'5D'     @HX2    1
     C                     MOVE X'6E'     @HX3    1
     C                     MOVE X'1E'     @HX4    1
     C                     MOVE '0'       @HX5    1
     C                     MOVE '6'       @HX6    1
     C                     MOVE X'1D'     @HX7    1
     C                     MOVE X'37'     @HX8    1
     C                     MOVE @HX1      @DX1
     C                     MOVE @HX2      @DX2
     C                     MOVE @HX3      @DX3
     C                     MOVE @HX4      @DX4
     C                     MOVE @HX5      @DX5
     C                     MOVE @HX6      @DX6
      *
     C                     Z-ADD*ZERO     @D      20
     C                     Z-ADD*ZERO     @TWGHT 110
      *
     C                     CALL 'AB#R2C2'
     C                     PARM           PNONY
     C                     PARM *BLANK    P@ADR1 50
     C                     PARM *BLANK    P@ADR2 50
     C                     PARM *BLANK    P@ADR3 50
     C                     PARM *BLANK    P@ADR4 50
     C                     PARM *BLANK    P@ADR5 50
     C                     PARM *BLANK    P@ADR6 50
     C                     PARM *BLANK    P@SKJY  1
     C                     MOVELP@ADR1    @ADR1  50
     C                     MOVELP@ADR2    @ADR2  50
     C                     MOVELP@ADR3    @ADR3  50
     C                     MOVELP@ADR4    @ADR4  50
     C                     MOVELP@ADR5    @ADR5  50
     C                     MOVELP@ADR6    @ADR6  50
      *
     C                     MOVEL'0111'    K@NONY
     C                     CALL 'AB#R2C2'
     C                     PARM           K@NONY  4
     C                     PARM *BLANK    P@ADR1 50
     C                     PARM *BLANK    P@ADR2 50
     C                     PARM *BLANK    P@ADR3 50
     C                     PARM *BLANK    P@ADR4 50
     C                     PARM *BLANK    P@ADR5 50
     C                     PARM *BLANK    P@ADR6 50
     C                     PARM *BLANK    P@SKJY  1
     C                     MOVELP@ADR1    @@ADR1 50
     C                     MOVELP@ADR2    @@ADR2 50
     C                     MOVELP@ADR3    @@ADR3 50
     C                     MOVELP@ADR4    @@ADR4 50
     C                     MOVELP@ADR5    @@ADR5 50
     C                     MOVELP@ADR6    @@ADR6 50
      *
     C                     SETOF                     93
     C  N88      KEY1      SETLLAB#PL1L1
     C   88      KEY6L     SETLLAB#PL1L1
      *
     C           *IN93     DOWEQ'0'
     C*
     C  N88      KEY1      READEAB#PL1L1                 93
     C   88      KEY6L     READEAB#PL1L1                 93
     C   93                LEAVE
     C*
     C* ALREADY DELETE
     C           BASKJY    IFNE ' '
     C                     ITER
     C                     END
     C*
     C* ORDER NUMBER SELECTED ?
     C           PORD#     IFNE *BLANK
     C           PORD#     IFNE BAODRN
     C                     ITER
     C                     END
     C                     END
     C*
     C* BIN SELECTED ?
     C           BIN       IFNE 0
     C           BIN       ANDNEBANOBN
     C                     ITER
     C                     END
     C*
     C* DOCK SELECTED ?
     C           PNUKE     IFNE *BLANK
     C           BANUKE    ANDNEPNUKE
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARABVWP2E1
     C                     CLEARABVWP2F1
     C                     CLEARAB#PP701
      *
     C           KEY2      CHAINFCEPL01              98
     C           *IN98     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE *ALL'*'   F2ZETI
     C                     MOVE *ALL'*'   F2LOC1
     C                     MOVE *ALL'*'   F2LOC2
     C                     MOVE *ALL'*'   F2LOC3
     C                     MOVE *ALL'*'   F2LOC4
     C                     MOVE *ALL'*'   F2PQY1
     C                     WRITEABVWP2F1
     C                     ITER
     C                     END
      *
     C           K#ABV1    KLIST
     C                     KFLD           K@TOKU  4
     C                     KFLD           K@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@ORNO 12
     C                     KFLD           K@MAN# 10
     C                     MOVELBATOKU    K@TOKU
     C                     MOVELBANONY    K@NONY
     C                     MOVELBAODRN    K@ORNO    P
     C                     MOVELBAINVN    K@MAN#    P
     C           K#ABV1    CHAINABVPL20              98
     C           *IN98     IFEQ *ON
     C           K#ABV2    KLIST
     C                     KFLD           K@TOKU  4
     C                     KFLD           K@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C           K#ABV2    SETGTABVPL20
     C           K#ABV2    REDPEABVPL20                  98
     C           *IN98     IFEQ *ON
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE *ALL'*'   F2ZETI
     C                     MOVE *ALL'*'   F2LOC1
     C                     MOVE *ALL'*'   F2LOC2
     C                     MOVE *ALL'*'   F2LOC3
     C                     MOVE *ALL'*'   F2LOC4
     C                     MOVE *ALL'*'   F2PQY1
     C                     WRITEABVWP2F1
     C                     ITER
     C                     END
     C                     END
     C*
     C           BAUSYS    IFEQ *ZERO
     C           BASYOS    ANDEQ*ZERO
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE *ALL'*'   F2ZETI
     C                     MOVE *ALL'*'   F2LOC1
     C                     MOVE *ALL'*'   F2LOC2
     C                     MOVE *ALL'*'   F2LOC3
     C                     MOVE *ALL'*'   F2LOC4
     C                     MOVE *ALL'*'   F2PQY1
     C                     WRITEABVWP2F1
     C                     ITER
     C                     END
     C*
     C           D@BARC    IFEQ *BLANK
     C           K#PL7@    KLIST
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BANOBN
     C                     KFLD           K@RLYY  40
     C                     KFLD           K@RLMM  20
     C                     KFLD           K@RLDD  20
     C                     KFLD           K@ODRN 10
     C                     Z-ADD*ZERO     K@RLYY
     C                     Z-ADD*ZERO     K@RLMM
     C                     Z-ADD*ZERO     K@RLDD
     C                     MOVELBAODRN    K#ODRN
     C           K#PL7@    CHAINAB#PL75R             81
     C           *IN81     IFEQ *ON
JW   C           *IN81     OREQ *OFF
.    C           PUSKJY    ANDEQ'D'
     C                     MOVEL*BLANK    K#ODRN
     C           K#PL7@    CHAINAB#PL75R             81
     C           *IN81     IFEQ *ON
     C                     MOVELWMHIN     F2MHIN           PART
     C                     MOVE *ALL'*'   F2ZETI
     C                     MOVE *ALL'*'   F2LOC1
     C                     MOVE *ALL'*'   F2LOC2
     C                     MOVE *ALL'*'   F2LOC3
     C                     MOVE *ALL'*'   F2LOC4
     C                     MOVE *ALL'*'   F2PQY1
     C                     WRITEABVWP2F1
     C                     ITER
     C                     END
     C                     END
     C                     END
     C*
     C** MASTER LABEL
     C                     MOVEL@@ADR1    E2FAD1
     C                     MOVEL@@ADR2    E2FAD2
     C                     MOVEL@@ADR3    E2FAD3
     C                     MOVEL@@ADR4    E2FAD4
     C                     MOVEL@@ADR5    E2FAD5
     C                     MOVEL@@ADR6    E2FAD6
     C*
     C                     MOVEL'US'      E2MDIN
     C*
     C                     MOVEL@ADR1     E2TAD1
     C                     MOVEL@ADR2     E2TAD2
     C                     MOVEL@ADR3     E2TAD3
     C                     MOVEL@ADR4     E2TAD4
     C                     MOVEL@ADR5     E2TAD5
     C                     MOVEL@ADR6     E2TAD6
     C*
     C           E2PLNT    CAT  AEPLNT:0  E2PLNT    P
     C           E2PLNT    CAT  '/':0     E2PLNT    P
     C           E2PLNT    CAT  AEDOC1:0  E2PLNT    P
     C           E2PLNT    CAT  '/':0     E2PLNT    P
     C           E2PLNT    CAT  AEDOC2:0  E2PLNT    P
     C*
     C                     MOVELAESUPL    E2SUPP
     C*
     C                     MOVE PUSERL    E2DLV#
     C                     MOVELAEPONT    E2PUSE
      *
     C           PPCKC     IFEQ '1'
     C                     MOVEL'484506'  E2PAC1
     C                     ELSE
     C                     MOVEL'0000PAL' E2PAC1
     C                     END
      *
     C                     MOVELAEMHIN    E2MHIN
     C                     MOVEL'6J'      E2MCOD
     C                     MOVEL'UN'      E2BCOD
     C                     MOVELC@DUNS    E2DUNS
     C                     MOVELAEDPDT    W@DPHZ
     C                     MOVELW@DPYY    W@NOYY
     C                     MOVELW@DPMM    W@NOMM
     C                     MOVELW@DPDD    W@NODD
     C                     MOVELW@NOHZ    E2NOHZ
     C           E2PLAN    CAT  AEPLAN:0  E2PLAN    P
     C           E2PLAN    CAT  '-':0     E2PLAN    P
     C           E2PLAN    CAT  AEROUT:0  E2PLAN    P
     C*
     C                     MOVELPPCKC     AEPTYP
     C                     UPDATABVPL201
     C*
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    W@SYOS 100
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    W@SYOS
     C                     ELSE
     C                     Z-ADDBASRYO    W@SYOS
     C                     END
     C                     END
     C*
     C                     Z-ADDBASRYO    W@SRYO 100
     C           W@SRYO    DIV  W@SYOS    W@CONT  70
     C                     MVR            W@MVR1  70
     C           W@MVR1    IFNE *ZERO
     C                     ADD  1         W@CONT
     C                     END
TCHK1C           BAMHN1    IFEQ 'N1055'
TCHK1C           BAMHN2    ANDEQ'2404 '
TCHK1C           W@CONT    DIV  48        W@PALT  70
TCHK1C                     MVR            W@MVR2  70
TCHK1C           W@MVR2    IFNE *ZERO
TCHK1C                     ADD  1         W@PALT
TCHK1C                     END
TCHK1C                     ELSE
     C           W@CONT    DIV  W@MXPL    W@PALT  70
     C                     MVR            W@MVR2  70
     C           W@MVR2    IFNE *ZERO
     C                     ADD  1         W@PALT
     C                     END
TCHK1C                     END
     C* ----------------------------------------------------
     C                     DO   W@PALT
     C*
TCHK1C           BAMHN1    IFEQ 'N1055'
TCHK1C           BAMHN2    ANDEQ'2404 '
TCHK1C           W@CONT    IFGT 48
TCHK1C                     Z-ADD48        W#CONT  30
TCHK1C                     SUB  48        W@CONT
TCHK1C                     ELSE
TCHK1C                     Z-ADDW@CONT    W#CONT
TCHK1C                     Z-ADD*ZERO     W@CONT
TCHK1C                     END
TCHK1C                     ELSE
     C           W@CONT    IFGT W@MXPL
     C                     Z-ADDW@MXPL    W#CONT  30
     C                     SUB  W@MXPL    W@CONT
     C                     ELSE
     C                     Z-ADDW@CONT    W#CONT
     C                     Z-ADD*ZERO     W@CONT
     C                     END
TCHK1C                     END
     C*
     C           W#CONT    MULT W@SYOS    W@QTY   90
     C                     Z-ADDW@QTY     PIQTY
     C                     MOVE *BLANK    POQTY
     C                     MOVE *BLANK    E2PQY1
     C                     CALL 'AB#R2K'  P2
     C           E2PQY1    CAT  POQTY:0   E2PQY1    P                  R
     C           E2PQY1    CAT  'PCE':1   E2PQY1    P                  R
     C                     MOVELPOQTY     W@PQTY 30
     C*
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    E2SRL1
     C                     MOVE N3NMBR    E2SRL2
     C                     MOVELPNONY     E2SRL2
     C*
     C           W@QTY     MULT A2KASI    W@NETW 112
      *
     C           PPCKC     IFEQ '1'
     C           W#CONT    MULT 1.07      W@BOXW 112
     C                     ELSE
     C           W#CONT    MULT 0.6       W@BOXW 112
     C                     END
      *
     C           W@NETW    DIV  1000      W@NNNW 112
     C                     ADD  W@BOXW    W@NNNW 112
     C                     Z-ADDW@NNNW    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     MOVE *BLANK    E2WGHT
     C                     CALL 'AB#R2K'  P2
     C           E2WGHT    CAT  POQTY:0   E2WGHT    P
     C           E2WGHT    CAT  '/':0     E2WGHT    P
     C                     MOVELPOQTY     W@GWHT 30
     C           W@NETW    DIV  1000      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C           E2WGHT    CAT  POQTY:0   E2WGHT    P
     C           E2WGHT    CAT  'KG':1    E2WGHT    P
     C                     MOVELPOQTY     W@NWHT 30
     C*
     C                     Z-ADDW#CONT    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     MOVE *BLANK    E2PACK
     C                     CALL 'AB#R2K'  P2
     C           E2PACK    CAT  POQTY:0   E2PACK                       R
     C           E2PACK    CAT  'INNER':1 E2PACK
     C                     MOVELPOQTY     W@PACK 30
     C* ----------------------------------------------------
     C                     MOVE *BLANK    @DX7
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'F01':0   @DX7      P
     C           @DX7      CAT  '001T':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '6J':0    @DX7      P
     C           @DX7      CAT  'UN':0    @DX7      P
     C           @DX7      CAT  C@DUNS:0  @DX7      P
     C           @DX7      CAT  E2SRL1:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'V':0     @DX7      P
     C           @DX7      CAT  AESUPL:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '16K':0   @DX7      P
     C           @DX7      CAT  E2DLV#:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '6D':0    @DX7      P
     C           @DX7      CAT  W@DPHZ:0  @DX7      P
     C           @DX7      CAT  '095':0   @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '2L':0    @DX7      P
     C           @DX7      CAT  E2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  W@GWHT:0  @DX7      P
     C           @DX7      CAT  'KG':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'B':0     @DX7      P
     C*****      PPCKC     IFEQ '1'
     C*****      @DX7      CAT  '484506':0@DX7      P
     C*****                ELSE
     C*****      @DX7      CAT  '0000PAL:0@DX7      P
     C*****                END
     C           @DX7      CAT  E2PAC1:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'Q':0     @DX7      P
     C           @DX7      CAT  W@PACK:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '6D':0    @DX7      P
     C           @DX7      CAT  W@DPHZ:0  @DX7      P
     C           @DX7      CAT  '002':0   @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '10Y':0   @DX7      P
     C           @DX7      CAT  E2PLAN:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'F02':0   @DX7      P
     C           @DX7      CAT  '010I':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'P':0     @DX7      P
     C           @DX7      CAT  AEMHIN:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '4LUS':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '2P':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  W@PQTY:0  @DX7      P
     C           @DX7      CAT  'PC'      @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  W@NWHT:0  @DX7      P
     C           @DX7      CAT  '58':0    @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
     C           @DX7      CAT  @HX8:0    @DX7      P
      *
     C                     MOVEL@DX       E22DBR
     C                     WRITEABVWP2E1
     C*
     C                     MOVEL*ON       W@MSTR  1
     C                     EXSR #PP70
     C                     ADD  1         @@CNT
     C*
     C                     ENDDO
     C*
     C* CONTAINER LABEL
     C                     MOVEL@@ADR1    F2FAD1
     C                     MOVEL@@ADR2    F2FAD2
     C                     MOVEL@@ADR3    F2FAD3
     C                     MOVEL@@ADR4    F2FAD4
     C                     MOVEL@@ADR5    F2FAD5
     C                     MOVEL@@ADR6    F2FAD6
     C*
     C                     MOVEL'US'      F2MDIN
     C*
     C                     MOVEL@ADR1     F2TAD1
     C                     MOVEL@ADR2     F2TAD2
     C                     MOVEL@ADR3     F2TAD3
     C                     MOVEL@ADR4     F2TAD4
     C                     MOVEL@ADR5     F2TAD5
     C                     MOVEL@ADR6     F2TAD6
     C*
     C                     MOVELE2PLNT    F2PLNT
     C                     MOVELE2SUPP    F2SUPP
     C                     MOVE E2DLV#    F2DLV#
     C                     MOVELE2PUSE    F2PUSE
      *
     C           PPCKC     IFEQ '1'
     C                     MOVEL'012157'  F2PAC1           RETURNABLE
     C                     ELSE
     C**                   MOVEL'550045'  F2PAC1           EXPENDABLE
JW4  C                     MOVEL'550104'  F2PAC1           EXPENDABLE
     C                     END
      *
     C                     MOVELE2MHIN    F2MHIN
     C                     MOVEL'1J'      F2MCOD
     C                     MOVEL'UN'      F2BCOD
     C                     MOVELC@DUNS    F2DUNS
     C                     MOVELAEDPDT    W@DPHZ
     C                     MOVELW@DPYY    W@NOYY
     C                     MOVELW@DPMM    W@NOMM
     C                     MOVELW@DPDD    W@NODD
     C                     MOVELW@NOHZ    F2NOHZ
     C                     MOVELE2PLAN    F2PLAN
     C                     MOVELAEHAND    F2HNDC
     C*
     C                     MOVELA2ZETI    F2ZETI
     C           PNOHZ     IFGE A2DATE
     C                     MOVELA2STRK    F2LOC1           NEW
     C                     MOVELA2STRT    F2LOC2
     C                     MOVELA2STRR    F2LOC3
     C                     MOVELA2STRD    F2LOC4
     C                     ELSE
     C                     MOVELA2KTRK    F2LOC1           OLD
     C                     MOVELA2KTRT    F2LOC2
     C                     MOVELA2KTRR    F2LOC3
     C                     MOVELA2KTRD    F2LOC4
     C                     END
     C*
     C                     MOVELBANONY    F2NONY
     C                     MOVELBANKOJ    F2NKOJ
     C                     MOVELBANUKE    F2NUKE
     C                     MOVELBAODRN    F2ODRN
JW2   * VW SPECIAL
 |   C           BANONY    IFEQ 8450
 |   C           BAEDIK    ANDEQ'E'
 |   C                     MOVEL'000001'  F2ODRN    P
JW2  C                     ENDIF
     C*
     C                     Z-ADDW@SYOS    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C                     MOVELPOQTY     F2PQY1    P
     C*
     C           W@SYOS    MULT A2KASI    W@NETW 112
      *
     C           PPCKC     IFEQ '1'
     C                     Z-ADD1.07      W@BOXW 112
     C                     ELSE
     C                     Z-ADD0.6       W@BOXW 112
     C                     END
      *
     C           W@NETW    DIV  1000      W@NNNW 112
     C                     ADD  W@BOXW    W@NNNW 112
     C                     Z-ADDW@NNNW    PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C           F2WGHT    CAT  POQTY:0   F2WGHT    P
     C           F2WGHT    CAT  '/':0     F2WGHT    P
     C                     MOVELPOQTY     W@GWHT 30
     C           W@NETW    DIV  1000      PIQTY
     C                     MOVE *BLANK    POQTY
     C                     CALL 'AB#R2K'  P2
     C           F2WGHT    CAT  POQTY:0   F2WGHT    P
     C           F2WGHT    CAT  'KG':1    F2WGHT    P
     C                     MOVELPOQTY     W@NWHT 30
     C*
     C* USER SELECTED NUMBER OF LABEL ----------------------
     C           *IN88     IFEQ '1'
     C           @#LAB     IFNE *ZERO
     C                     Z-ADD@#LAB     Q
     C*
     C           1         DO   Q
     C                     EXSR #SUB01
     C                     ENDDO
     C                     ITER
     C*
     C                     ELSE
     C           @FLAG     IFEQ *BLANK
     C                     ITER
     C                     END
     C*
     C                     END
     C                     END
     C*
     C* USER ONLY MARKED -----------------------------------
     C           BASRYO    DIV  W@SYOS    Q
     C                     MVR            WRST    40
     C           WRST      IFNE *ZERO
     C                     ADD  1         Q
     C                     END
     C*
     C           1         DO   Q
     C                     EXSR #SUB01
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*-----------------------------------------------------
     C           #SUB01    BEGSR
     C*-----------------------------------------------------
     C                     EXSR @NMBR
     C                     MOVE N3NMBR    F2SRL1
     C                     MOVE N3NMBR    F2SRL2
     C                     MOVELPNONY     F2SRL2
     C*
     C                     MOVE *BLANK    @DX7
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'F01':0   @DX7      P
     C           @DX7      CAT  '001P':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '1J':0    @DX7      P
     C           @DX7      CAT  'UN':0    @DX7      P
     C           @DX7      CAT  C@DUNS:0  @DX7      P
     C           @DX7      CAT  F2SRL1:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'V':0     @DX7      P
     C           @DX7      CAT  F2SUPP:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '16K':0   @DX7      P
     C           @DX7      CAT  F2DLV#:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '6D':0    @DX7      P
     C           @DX7      CAT  W@DPHZ:0  @DX7      P
     C           @DX7      CAT  '095':0   @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '2L':0    @DX7      P
     C           @DX7      CAT  F2PLNT:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  W@GWHT:0  @DX7      P
     C           @DX7      CAT  'KG':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'B':0     @DX7      P
     C           @DX7      CAT  F2PAC1    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '6D':0    @DX7      P
     C           @DX7      CAT  W@DPHZ:0  @DX7      P
     C           @DX7      CAT  '002':0   @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '10Y':0   @DX7      P
     C           @DX7      CAT  F2PLAN:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'F02':0   @DX7      P
     C           @DX7      CAT  '010I':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'P':0     @DX7      P
     C           @DX7      CAT  AEMHIN:0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '4LUS':0  @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '2P':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  'IT':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '14D':0   @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  F2PQY1:0  @DX7      P
     C           @DX7      CAT  'PC':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '7Q':0    @DX7      P
     C           @DX7      CAT  W@NWHT:0  @DX7      P
     C           @DX7      CAT  '58':0    @DX7      P
     C           @DX7      CAT  @HX7:0    @DX7      P
     C           @DX7      CAT  '11Y':0   @DX7      P
     C           @DX7      CAT  AEMAN#:0  @DX7      P
     C           @DX7      CAT  @HX4:0    @DX7      P
     C           @DX7      CAT  @HX8:0    @DX7      P
     C                     MOVEL@DX       F22DBR
JW5   * PACKAGE TYPE
 |   C           PPCKC     IFEQ '1'
 |   C                     MOVEL'RE'      F2PTYP           RETURNABLE
 |   C                     ELSE
 |   C                     MOVEL'EX'      F2PTYP           EXPENDABLE
JW5  C                     ENDIF
     C*
     C                     DO   W#LAB
     C                     WRITEABVWP2F1
     C                     ENDDO
     C*
     C                     MOVEL*OFF      W@MSTR  1
     C                     EXSR #PP70
     C*
     C                     ENDSR
     C***********************************************************
     C* @SFL:CREATE SUB FILE
     C***********************************************************
     C           @SFL      BEGSR
     C*
     C                     Z-ADD*ZERO     RRN
     C                     MOVE PNONY     WNONY
     C                     MOVE *OFF      *IN31
     C*
     C           KEY1      SETLLAB#PL131
     C           KEY1      READEAB#PL131                 93
     C           *IN93     DOWEQ'0'
     C                     MOVE *OFF      *IN61
     C*
     C* DELETED  ?
     C           BASKJY    IFNE ' '
     C                     GOTO #READ
     C                     END
     C*
     C* SAME BIN ?
     C           BIN       IFNE 0
     C           BIN       ANDNEBANOBN
     C                     GOTO #READ
     C                     END
      *
     C           PNUKE     IFNE *BLANK
     C           BANUKE    ANDNEPNUKE
     C                     GOTO #READ
     C                     ENDIF
     C*
     C* IF SELECTED ORDER#, SAME ORDER# ?
     C           PORD#     IFNE *BLANK
     C           PORD#     ANDNEBAODRN
     C                     GOTO #READ
     C                     END
     C*
     C* SET DATA TO SUB FILE
     C                     ADD  1         RRN
     C           RRN       CHAINSFL01                94
     C                     MOVE *BLANK    @FLAG
     C                     Z-ADD*ZERO     @#LAB
     C*
     C           BAMHN4    IFEQ *BLANK
     C                     MOVE *BLANK    @P3
     C                     MOVE *BLANK    WAMHN4
     C                     ELSE
     C                     MOVE BAMHN4    WAMHN4
     C                     MOVE '-'       @P3
     C                     END
     C*
     C           BAMHN3    IFEQ *BLANK
     C                     MOVE *BLANK    @P2
     C                     MOVE *BLANK    WAMHN3
     C                     ELSE
     C                     MOVE BAMHN3    WAMHN3
     C                     MOVE '-'       @P2
     C                     END
     C*
     C           BAMHN2    IFEQ *BLANK
     C                     MOVE *BLANK    @P1
     C                     MOVE *BLANK    WAMHN2
     C                     ELSE
     C                     MOVE BAMHN2    WAMHN2
     C                     MOVE '-'       @P1
     C                     END
     C*
     C                     MOVE BAMHN1    WAMHN1
     C*
     C                     MOVE BASBAN    @SBAN
     C                     MOVE BAODRN    @ODER
     C                     Z-ADDBASRYO    @RQTY
     C                     Z-ADDBASYOS    @SYOS
     C                     Z-ADDBAUSYS    @USYS
     C           BASYOS    IFNE BAUSYS
     C                     MOVE *ON       *IN61
     C                     MOVE *ON       *IN31
     C                     MOVELER,16     MSG
     C                     ENDIF
     C   94                WRITESFL01
     C  N94                UPDATSFL01
     C*
     C           #READ     TAG
     C           KEY1      READEAB#PL131                 93
     C                     END
     C*
     C           RRN       IFEQ *ZERO
     C                     SETON                     30
     C                     MOVELER,12     MSG
     C*
     C                     ELSE
     C                     MOVE '2'       WKDSP
     C                     Z-ADDRRN       W1RRN
     C                     Z-ADD1         RRN
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @WRT2:WRITE LABEL DATA(SELECTED PART NUMBER)
     C***********************************************************
     C           @WRT2     BEGSR
     C*
     C                     SETON                     8887
     C* GET THE NUMBER OF LABEL
     C           PNONY     CHAINAB#PL90              96
     C           *IN96     IFEQ '0'
     C                     Z-ADDYA#LAB    W#LAB
     C                     Z-ADDYAMXPL    W@MXPL
     C                     ELSE
     C                     Z-ADD1         W#LAB
     C                     END
     C*
     C                     Z-ADD1         RRN
     C                     DO   W1RRN
     C           RRN       CHAINSFL01                94
     C           *IN94     IFEQ '0'
     C           @FLAG     IFNE *BLANK
     C           @#LAB     ORNE 0
     C*
     C                     MOVE PNONY     WNONY   40
     C                     MOVEL@ODER     WORDN  10
     C*
     C                     EXSR @8450
     C*
     C                     END
     C                     END
     C*
     C           #WRT2     TAG
     C                     ADD  1         RRN
     C*
     C                     ENDDO
     C*
     C                     SETOF                     88
     C*
     C                     ENDSR
     C***********************************************************
      *  SET FIELDS FOR AB#PP70
     C***********************************************************
     C           #PP70     BEGSR
      *
     C                     Z-ADD*YEAR     EKKOYY
     C                     Z-ADD*MONTH    EKKOMM
     C                     Z-ADD*DAY      EKKODD
     C                     TIME           @@TIM
     C                     MOVE @@HH      EKKOHH
     C                     MOVE @@MM      EKKOMN
     C                     MOVEL#USER     EKKOME
     C                     MOVE BANONY    EKNONY
     C                     MOVE BANKOJ    EKNKOJ
     C                     MOVE BANUKE    EKNUKE
     C                     MOVE A2ZETI    EKZETI
     C           W@MSTR    IFEQ *ON
     C                     MOVEL'99999'   EKSYOS
     C                     ELSE
     C                     MOVE W@SYOS    EKSYOS
     C                     END
     C                     MOVE BAODRN    EKODRN
     C                     MOVE BASHN1    EKSHN1
     C                     MOVE BASHN2    EKSHN2
     C                     MOVE BASHN3    EKSHN3
     C                     MOVE BANOYY    EKNOYY
     C                     MOVE BANOMM    EKNOMM
     C                     MOVE BANODD    EKNODD
     C                     Z-ADDBATOKU    EKTOKU
     C                     MOVELBAMHN1    EKMHN1
     C                     MOVELBAMHN2    EKMHN2
     C                     MOVELBAMHN3    EKMHN3
     C                     MOVELBAMHN4    EKMHN4
     C                     MOVE BANOBN    EKNOBN
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELPNONY     EKSERL
     C                     Z-ADDBADEYY    EKRLYY
     C                     Z-ADDBADEMM    EKRLMM
     C                     Z-ADDBADEDD    EKRLDD
     C*
     C                     EXSR #PP758
JW5   * PACKAGE TYPE
 |   C           EKNONY    IFEQ '8450'
 |   C           D@PCKC    IFEQ '1'
 |   C                     Z-ADD11        EKSKDD
 |   C                     ELSE
 |   C                     Z-ADD22        EKSKDD
 |   C                     ENDIF
JW5  C                     ENDIF
     C*
     C                     WRITEAB#PP701
     C*
     C                     ENDSR
     C***********************************************************
      *  UPDATE AB#PL75 & AB#PL78
     C***********************************************************
     C           #PP758    BEGSR
     C*
     C           K#PL7#    KLIST
     C                     KFLD           EKNOYY
     C                     KFLD           EKNOMM
     C                     KFLD           EKNODD
     C                     KFLD           EKTOKU
     C                     KFLD           K#NONY  40
     C                     KFLD           EKNKOJ
     C                     KFLD           EKNUKE
     C                     KFLD           K#NOBN  20
     C                     KFLD           K#RLYY  40
     C                     KFLD           K#RLMM  20
     C                     KFLD           K#RLDD  20
     C                     KFLD           K#ODRN 10
     C                     MOVELEKNONY    K#NONY
     C                     MOVELEKNOBN    K#NOBN
     C                     MOVELEKODRN    K#ODRN
     C                     Z-ADDEKRLYY    K#RLYY
     C                     Z-ADDEKRLMM    K#RLMM
     C                     Z-ADDEKRLDD    K#RLDD
     C           K#PL7#    CHAINAB#PL75R             81
     C           *IN81     IFEQ *ON
JW   C           *IN81     OREQ *OFF
.    C           PUSKJY    ANDEQ'D'
     C                     MOVEL*BLANK    K#ODRN
     C           K#PL7#    CHAINAB#PL75R             81
     C                     END
     C*
     C           *IN81     IFEQ *OFF
JW   C           PUSKJY    ANDNE'D'
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    PULPDT
     C                     Z-ADDWSSDAT    PUKODT
     C                     Z-ADDWSSTM6    PUKOTN
     C                     MOVEL#USER     PUKOME
     C                     UPDATAB#PL75R
     C*
     C           K#PL7#    CHAINAB#PL78              82
     C           *IN82     IFEQ *OFF
     C           P8SKJY    ANDEQ*BLANK
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    P8KODT
     C                     Z-ADDWSSTM6    P8KOTM
     C                     MOVEL#USER     P8KONM
     C           P8LPDT    IFEQ *ZERO
     C                     Z-ADDWSSDAT    P8LPDT
     C                     Z-ADDWSSTM6    P8LPTM
     C                     MOVEL#USER     P8LPNM
     C                     END
JW4   * PACKAGE TYPE
 |   C           PPCKC     IFEQ '1'
 |   C                     MOVEL'1 RETURN'P8FLD3    P      RETURNABLE
 |   C                     ELSE
 |   C                     MOVEL'2 EXPEND'P8FLD3    P      EXPENDABLE
JW4  C                     ENDIF
      *
     C                     UPDATAB#PP781
JW    * LOG
 .   C           P8KODT    IFNE SVKODT
 .   C           P8KOTM    ORNE SVKOTM
 .   C                     MOVEL#PGM      P8LPPG
 .   C                     MOVEL'ABVR2C'  P8KOPG    P
 .   C                     WRITEAB#PP78R
 .   C                     Z-ADDP8KODT    SVKODT
 .   C                     Z-ADDP8KOTM    SVKOTM
JW   C                     ENDIF
      *
     C                     END
     C*
     C                     END
     C*
      *
     C                     ENDSR
     C***********************************************************
     C* @CLRS:CLEAR SUB FILE
     C***********************************************************
     C           @CLRS     BEGSR
     C*
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C*
     C                     MOVE '1'       WKDSP
     C*
     C                     ENDSR
     C***********************************************************
     C* @END:
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
** ER
E-01 ENTER DELIVERY CODE!
E-02 ENTER FACTORY CODE!
E-03 ENTER DOCK CODE!
E-04 ENTER SHIPPING DATE!
E-05 DATE IS INVALID!
E-06 ENTER BIN#!
E-07
E-08 PLEASE MARK AT LEAST 1 OPTION!
E-09
E-10
E-11
E-12 NO DATA IN ORDER FILE(AB#PP10)!
E-13 YOU CAN NOT USE F7(DETAIL) WITH SERIAL NUMBER!
E-14
E-15 BARCODE ERROR!
W-16 QTY/BOX IS DIFFERNT. PRESS F11 TO IGNORE AND CREATE DATA!
E-17 THIS IS NOT FOR VOLKSWAGEN!
E-18 PACKING CODE SHOULD BE 1 OR 2!
E-19 LABEL IS NOT CREATED BECAUSE IT WAS CREATED ON
** CFK
F3:END   F11:IGNORE ERROR AND CREATE DATA.
** INF
QTY/BOX ERROR
QTY IS NOT MULTIPLE
