     H            Y/
     F** AC#R02 *****************************************
     F*  (HONDA) PRINT CONSOLIDATE PACKING LIST ENTRY   *
     F*                                                 *
     F*  JW  2017.03.23                                 *
     F***************************************************
     FAC#PW02 CF  E                    WORKSTN
     FAB#PL79 IF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
      *------------------------------------------------------------
     E                    ERR     1  12 75
      *------------------------------------------------------------
     I            DS
     I                                        1   80P8NOHZ
     I                                        1   40P8NOYY
     I                                        5   60P8NOMM
     I                                        7   80P8NODD
     I            DS
     I                                        1   80P8RLHZ
     I                                        1   40P8RLYY
     I                                        5   60P8RLMM
     I                                        7   80P8RLDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C                     EXSR #INZ
      *
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVE *BLANK    D@MSG
      *
     C                     SELEC
      * F1: END
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      * ENTER OR F5
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #PRINT
     C                     EXSR #CLR
     C                     MOVELERR,11    D@MSG
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK FIELD VALUE
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85            ERROR FLAG
     C                     MOVE *OFF      *IN40
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     MOVE *OFF      *IN43
     C                     MOVE *OFF      *IN44
     C                     MOVE *OFF      *IN45
     C                     EXSR #CLR
      * CHECK BARCODE
     C           D@BAR     IFEQ *BLANK
     C                     MOVE *ON       *IN40
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,1     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      * CHECK BARCODE BY AB#PP78
     C           D@BAR     CHAINAB#PL79              99
     C           *IN99     IFEQ *ON
     C           *IN99     OREQ *OFF
     C           P8SKJY    ANDEQ'D'
     C                     MOVE *ON       *IN40
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,2     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      * CHECK CONSOLIDATED PACKING LIST?
     C           P8BINN    IFNE 99
     C           P8SKJY    ANDEQ*BLANK
     C                     MOVE *ON       *IN40
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,3     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           P8BINN    IFNE 99
     C           P8SKJY    ANDEQ'C'
     C                     MOVE *ON       *IN40
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,4     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@OPT1    IFNE 'Y'
     C           D@OPT1    ANDNE'N'
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,5     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@OPT2    IFNE 'Y'
     C           D@OPT2    ANDNE'N'
     C                     MOVE *ON       *IN42
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,5     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@OPT3    IFNE 'Y'
     C           D@OPT3    ANDNE'N'
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,5     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@OPT4    IFNE 'Y'
     C           D@OPT4    ANDNE'N'
     C                     MOVE *ON       *IN44
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,5     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@OPT1    IFEQ 'N'
     C           D@OPT2    ANDEQ'N'
     C           D@OPT3    ANDEQ'N'
     C           D@OPT4    ANDEQ'N'
     C                     MOVE *ON       *IN41
     C                     MOVE *ON       *IN42
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN44
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,6     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *  CHECK PRINTER TYPE
     C           D@PRNT    IFEQ *BLANK
     C                     MOVE *ON       *IN45
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,10    D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
     C           D@PRNT    IFNE '1'
     C           D@PRNT    ANDNE'2'
     C           D@PRNT    ANDNE'3'
     C           D@PRNT    ANDNE'4'
     C           D@PRNT    ANDNE'5'
     C           D@PRNT    ANDNE'6'
     C           D@PRNT    ANDNE'7'
     C           D@PRNT    ANDNE'8'
     C                     MOVE *ON       *IN45
     C                     MOVE *ON       *IN85
     C                     MOVE ERR,7     D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      * CHECK PACK LIST TYPE
     C                     MOVE P8NONY    LTR4    4
     C           LTR4      CHAINAB#PL90              99
     C           *IN99     IFEQ *ON
     C                     MOVE *ON       *IN40
     C                     MOVE *ON       *IN85
     C           LTR4      CAT  ERR,7:1   D@MSG
     C                     GOTO #CHK1E
     C                     ENDIF
      *
      * IF ERROR NOT FOUND ------------------------------
     C           *IN85     IFEQ *OFF
     C                     MOVELP8ODRN    D@ODRN
      *
     C           YAMXPL    IFGE 120
     C                     Z-ADD1.07      D@CWGT
     C                     ELSE
     C                     Z-ADD0.60      D@CWGT
     C                     ENDIF
      *
     C                     MOVE *BLANK    D@MAN#
     C                     Z-ADDP8NONY    D@NONY
     C                     MOVELP8NKOJ    D@NKOJ
     C                     MOVELP8NUKE    D@NUKE
     C                     Z-ADDP8NOHZ    D@NOHZ
     C                     MOVELP8NOHZ    D@NOHX
     C                     Z-ADDP8BINN    D@BIN
     C                     Z-ADDP8RLHZ    D@RLHZ
     C                     MOVELP8FLD3    D@ASN
     C                     MOVELYATYPE    D@TYPE
     C                     MOVE ERR,8     D@MSG
     C                     ENDIF
      *
     C           #CHK1E    ENDSR
      *------------------------------------------------------
      *   CLEAR FIELD
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *BLANK    D@ODRN
     C                     MOVE *ZERO     D@CWGT
     C                     MOVE *BLANK    D@MAN#
     C                     MOVE *ZERO     D@NONY
     C                     MOVE *BLANK    D@NKOJ
     C                     MOVE *BLANK    D@NUKE
     C                     MOVE *ZERO     D@NOHZ
     C                     MOVE *BLANK    D@NOHX
     C                     MOVE *ZERO     D@BIN
     C                     MOVE *ZERO     D@RLHZ
     C                     MOVE *BLANK    D@ASN
     C                     MOVE *BLANK    D@TYPE
      *
     C                     ENDSR
      *------------------------------------------------------
      *   PRINT PACKING LIST
      *------------------------------------------------------
     C           #PRINT    BEGSR
     C                     MOVELD@NONY    D@NONX
     C                     MOVELD@CWGT    D@CWGX
     C                     MOVEL'001'     D@MIX
      * PACKING LIST
     C           D@OPT1    IFEQ 'Y'
     C                     CALL 'AC#C03'  P#LST1
     C                     ENDIF
      * MIXED PLALLET
     C           D@OPT2    IFEQ 'Y'
     C                     CALL 'AC#C14'  P#LST2
     C                     ENDIF
      * CUSTOM SHEET
     C           D@OPT3    IFEQ 'Y'
     C                     CALL 'AC#C11'  P#LST3
     C                     ENDIF
      * SHIPPER REPORT
     C           D@OPT4    IFEQ 'Y'
     C                     CALL 'AC#C16'  P#LST4
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           #INZ      BEGSR
      *
     C           P#LST1    PLIST
     C                     PARM           D@BAR
     C                     PARM           D@NONX  4
     C                     PARM           D@ODRN
     C                     PARM           D@CWGX  3
     C                     PARM           D@MAN#
     C                     PARM           D@PRNT
     C                     PARM           D@NOHX  8
     C                     PARM           @RTN1   1
      *
     C           P#LST2    PLIST
     C                     PARM           D@BAR
     C                     PARM           D@PRNT
     C                     PARM           D@MIX   3
      *
     C           P#LST3    PLIST
     C                     PARM           D@BAR
     C                     PARM           D@NONX  4
     C                     PARM           D@PRNT
     C                     PARM           D@CWGX  3
     C                     PARM           @RTN2   1
      *
     C           P#LST4    PLIST
     C                     PARM           D@BAR
     C                     PARM           D@PRNT
      *
     C                     MOVEL'01'      W@ID    2
      * CLEAR FIRST SCREEN
     C                     MOVE *BLANK    D@BAR
     C                     MOVE 'Y'       D@OPT1
     C                     MOVE 'N'       D@OPT2
     C                     MOVE 'N'       D@OPT3
     C                     MOVE 'N'       D@OPT4
     C                     EXSR #CLR
      *
     C                     ENDSR
      *------------------------------------------------------
**  ERR
E1 SCAN BAR CODE OR ENTER PACKING LIST# !
E2 BARCODE IS INVALID !
E3 PACKING LIST IS NOT CONSOLIDATED !
E4 ENTER CONSOLIDATED PARENT PACKING LIST# !
E5 ENTER Y OR N !
E6 SELECT OPTION AT LEAST ONE !
E7 PACKING LIST TYPE NOT REGISTERED !
E8 PRESS F5 TO PRINT OR F1 TO END JOB...
E9 PRINTER IS INVALD !
E10 ENTER PRINTER# !
    ENTER NEXT PACKING LIST#

