     H            Y.
     F** AC#R11 *******************************************************
     F*  PRINT CONSOLIDATED CUSTOM SHEET (TYPE=01)                    *
     F*       J.WATANABE   2017.03.28                                 *
     F***************************************************(AB#R39)******
     FAC#PP32 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FEDIPP41 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    TB1     1  12  2 0 TB2     9
     E                    TBM     1   4 30
     IAC#PP321    01
     I                                              IMHN  L1
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1  12 ISHN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I            DS
     I                                        1   80INOHZ
     I                                        1   40INOYY
     I                                        5   60INOMM
     I                                        7   80INODD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           *ENTRY    PLIST
     C**                   PARM           PWEIG   52
     C**                   PARM           PTRAN  30
     C**                   PARM           PCNAM  10        COUNTRY
     C                     PARM           P@BAR   9
     C                     PARM           P@PLT   3
     C                     MOVELP@PLT     PWEIG   32
      *
     C                     SETOF                     10
      * FIRST PROCESS -----------------------------------
     C           *IN11     IFEQ '0'
     C                     SETON                     1011
      *
JW    * GET PACKING LIST INFORMATION
     C                     EXSR #PLST
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       20
     C           INOMM     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVELTB2,A     WMNAM   9
     C                     ENDIF
      *
     C           ITOKU     IFEQ 0294
     C           ITOKU     OREQ 0295
     C           ITOKU     OREQ 0296
     C           ITOKU     OREQ 0390
     C           ITOKU     OREQ 0391
     C           ITOKU     OREQ 0400
     C           ITOKU     OREQ 3135
     C           ITOKU     OREQ 5382
     C           ITOKU     OREQ 5379
JW   C           ITOKU     OREQ 1602
     C                     MOVE *ON       *IN55
     C                     ELSE
     C                     MOVE *OFF      *IN55
     C                     ENDIF
     C*
     C           ITOKU     IFEQ 3062
     C                     MOVEL*ON       *IN15
     C                     ELSE
     C                     MOVEL*OFF      *IN15
     C                     ENDIF
      *
     C                     SETOF                     20
     C                     MOVE *BLANK    WSMEI  15
     C*
     C           #READ     TAG
     C           INONY     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     GOTO #READ
     C                     ENDIF
     C*
     C           *IN20     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         WSRYO   60
     C                     ENDIF
      *
     C                     EXSR #SUB1
      *
     C                     SETOF                     20
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WDMEI  13
     C           KEY1      CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
     C           *IN20     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C                     MOVELA2DMEI    WDMEI
     C                     ENDIF
      *
     C                     ADD  ISRYO     WSRYO
      *
     CL1                   EXSR SUBR
     CLR         TEIGH     ADD  26.76     TGROS   72
      *
     C           SUBR      BEGSR
      *
     C           ISYOS     IFEQ *ZERO
     C                     Z-ADD1         ISYOS
     C                     ENDIF
     C           WSRYO     DIV  ISYOS     WHAKO   30
      *
     C                     Z-ADDITANK     WTANK   84
      *
     C           WSRYO     MULT WTANK     WKING   72
     C                     ADD  WKING     TKING   72
      *
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   62H
      *
     C           WSRYO     DIV  ISYOS     WKT1    30
     C                     MVR            WKT2    30
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     ENDIF
     C           WGROS     MULT WKT1      WEIGH   73
     C                     ADD  WEIGH     TEIGH   73
      *
     C                     ENDSR
      *
     C           #SUB1     BEGSR
     C                     MOVELINONY     WNONY   4
     C                     MOVE *BLANK    WADD1  30
     C                     MOVE *BLANK    WADD2  30
     C                     MOVE *BLANK    WADD3  30
     C                     MOVE *BLANK    WADD4  30
     C                     MOVE *BLANK    WADD5  30
     C                     MOVE *BLANK    WADD6  30
     C                     MOVE *BLANK    WADD7  30
     C           WNONY     CHAINEDIPL401             77
     C           *IN77     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELE4ADD1    WADD1
     C                     MOVELE4ADD2    WADD2
     C                     MOVELE4ADD3    WADD3
     C                     MOVELE4ADD4    WADD4
     C                     MOVELE4ADD5    WADD5
     C                     MOVELE4ADD6    WADD6
     C                     ENDIF
     C                     ENDIF
     C           WNONY     IFEQ '3316'
     C           WNONY     CHAINEDIPP411             78
     C           *IN78     IFEQ '0'
     C           E4SKJY    ANDEQ' '
     C                     MOVELE4ADD7    WADD7
     C                     ENDIF
     C                     ENDIF
     C*
     C           WNONY     IFEQ '3581'
     C                     MOVELTBM,1     WADD4
     C                     MOVELTBM,2     WADD5
     C                     MOVELTBM,3     WADD6
     C                     MOVELTBM,4     WADD7
     C                     ENDIF
     C*
     C                     ENDSR
      *===================================================
      * GET PACKING LIST INFO.
      *===================================================
     C           #PLST     BEGSR
      *
     C                     MOVELINONY     $NONY
     C                     CALL 'UTLR52'
     C                     PARM           $NONY   4
     C                     PARM           $PTYP2  2
     C                     PARM           $PCPY   2
     C                     PARM           $CTYP   2
     C                     PARM           $CCPY   2
     C                     PARM           $CNAM  10
     C                     PARM           $LTYP   1
     C                     PARM           $LCPY   2
     C                     PARM           $MCPY   2
     C                     PARM           $SUPP  10
     C                     PARM           $BMAX   3
     C                     PARM           $TRAN  30
     C                     PARM           $RTN    1
      *
     C           $RTN      IFEQ *BLANK
     C                     MOVEL$CNAM     PCNAM  10
     C                     MOVEL$TRAN     PTRAN  30
     C                     ENDIF
      *
     C                     ENDSR
      ************************************************************************
     OQPRINT  H  202   10
     O                         WSMEI     29
     O        H  2     10
     O                                   17 'IAF'
     O                         PCNAM     29
     O                                   53 'CUSTOM  INFORMATION (C1)'
     O                                   71 'PAGE'
     O                         PAGE  Z   75
     O        H  1     10
     O                                   11 '1.VENDOR'
     O                                   56 '2.DATE OF DIRECT'
     O                                   68 'SHIPMENT TO'
     O                         PCNAM     79
     O        H  1     10
     O*                                   8 'IAF'
     O                                   23 'Indiana Automotive'
     O                                   33 'Fasteners'
     O                         WMNAM     51
     O                         INODD Z   54
     O                                   56 ','
     O                         INOYY     61
     O        H  1     10
     O                                   26 '1300 W. ANDERSON BLVD'
     O        H  1     10
     O                                   25 'GREENFIELD, IN 46140'
     O                                   58 '3.OTHER REFERENCES'
     O                       55IINV#     76
     O        H  1     10
     O                                   58 'PRODUCTION PARTS'
     O        H  1     10
     O                                   14 '4.CONSIGNEE'
     O        H  1     10
     O                         WADD1     35
     O                                   57 '5.RELATED COMPANY'
     O                                   69 'TRANSACTION'
     O        H  1     10
     O                         WADD2     35
     O                                   49 'NO-NONE'
     O        H  1     10
     O                         WADD3     35
     O        H  1     10
     O                         WADD4     35
     O                                   59 '6.COUNTRY OF ORIGIN'
     O        H  1     10
     O                         WADD5     35
     O                                   45 'USA'
     O        H  1     10
     O                         WADD6     35
     O        H  1     10
     O                         WADD7     35
     O                                   56 '7.TRANSPORTATION'
     O        H  1     10
     O                                   18 '8.CONDITIONS OF'
     O                                   33 'SALE AND TERMS'
     O                         PTRAN     72
     O        H  1     10
     O                                   20 'OF PAYMENT'
     O        H  1     10
     O                                   11 'NET 25'
     O                                   50 '9.CURRENCY'
     O        H  2     10
     O                                   52 'U.S. FUNDS'
     O        H  1     10
     O                                   15 '10.ORIGINATOR'
     O                                   57 '11.FIELDS 23 TO 25'
     O                                   75 'ARE NOT APPLICABLE'
     O*       H  3     10
     O        H  2     10
     O                                   22 'SAME AS NUMBER 1.'
     O                                   43 'X'
     O        H  1     10
     O                                   23 '12.PURCHASE ORDER NO.'
     O                 15                57 '13.INVOICE NO.    '
     O        H  3     10
     O                         IODRN     15
     O                 15      IINV#     58
     O        H  1     10
     O                                   11 '# OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES     QTY.'
     O                                   62 'UNIT PRICE'
     O                                   75 'TOTAL'
     O        H  202   OF
     O                                   10 ' '
     O        H  2     OF
     O                                   11 '# OF PKGS'
     O                                   30 'SPECIFICATION OF'
     O                                   51 'COMMODITIES     QTY.'
     O                                   62 'UNIT PRICE'
     O                                   75 'TOTAL'
     O        T  1     L1
     O                         WHAKO Z    9
     O                         IMHN1     19
     O                                   20 '-'
     O                         IMHN2     25
     O                                   26 '-'
     O                         IMHN3     28
     O                         WDMEI     42
     O                         WSRYO 1   51
     O                         WTANK 1   62
     O                         WKING 1   75
     O        T 11     LR
     O                                   13 'TOTAL WEIGHT'
     O                                   75 'INVOICE TOTAL'
     O        T  2     LR
     O                                    6 'NET :'
     O                         TEIGH 1   20
     O                                   21 'K'
     O                                   35 'GROSS :'
     O                         TGROS 1   49
     O                                   50 'K'
     O                         TKING 1   75
      *
** TB1.TB2
01JANUARY
02FEBRUARY
03MARCH
04APRIL
05MAY
06JUNE
07JULY
08AUGUST
09SEPTEMBER
10OCTOBER
11NOVEMBER
12DECEMBER
** TBM
THIRD PARTY BILL TO:
1360 TOYOTA BOSHOKU AMERICA
DOLWICK DRIVE SUITE 125
ERLANGER, KY 41018
