     H            Y.
     F** AC#R08 ************************************************
     F*  (HONDA) PRINT CONSOLIDATED PACKING LIST(TYPE-8)       *
     F*  COPIED FROM AB#R3J                                    *
     F*  J.WATANABE   2017.04.07                               *
     F*********************************(AB#R3J)*****************
     F**AB#PP31 IP  E                    DISK
     FAC#PP32 IP  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     F**AB#PPCT UF  E           K        DISK                      A
     F**AB#PL75 IF  E           K        DISK                      A
     F**AB#PP78 O   E                    DISK
     F**AB#PL7B IF  E           K        DISK
     FAC#PR10 O   E             79     PRINTER
      *------------------------------------------------------
     IAC#PP321    01
     I                                              INOHZ L1
     I                                              INOTM L1
     I                                              INUKE L1
     I                                              IODRN L2
     I                                              INONY L1
     I                                              INKOJ L1
     I            DS
     I                                        1  13 OPAR
     I                                        1   8 OPAR1
     I                                        9  12 OPAR2
     I                                       13  13 OPAR3
     I            DS
     I                                        1  15 WPAR
     I                                        1   8 WPAR1
     I I            '-'                       9   9 WW1
     I                                       10  13 WPAR2
     I                                       15  15 WPAR3
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1  20 IMHNA
     I                                        1   5 IHMH1
     I                                        6   8 IHMH2
     I                                        9  12 IHMH3
     I                                       13  14 IHMH4
     I            DS
     I                                        1  20 IMHNB
     I                                        1   8 IMHB1
     I                                        9  20 IMHB2
     I            DS
     I                                        1  17 @MHNB
     I                                        1   8 @MHB1
     I I            '-'                       9   9 @MHB2
     I                                       10  17 @MHB3
     I            DS
     I                                        1  17 @MHN
     I                                        1   5 @MHN1
     I I            '-'                       6   6 @M1
     I                                        7  11 @MHN2
     I I            '-'                      12  12 @M2
     I                                       13  17 @MHN3
     I            DS
     I                                        1  12 ISHN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80PHZ8
     I                                        1   20PCC8
     I                                        3   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60PHZ
     I                                        1   20PMM
     I                                        3   40PDD
     I                                        5   60PYY
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 @PGMID
     I                                        1   6 PGMID
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      *
     I              'EXPEDITE'            C         C#SPBN
      *
      *===================================================
      * MAIN PROCESS
      *===================================================
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C*
     C           K#P75     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           INOTM
     C                     KFLD           K@RYY   40
     C                     KFLD           K@RMM   20
     C                     KFLD           K@RDD   20
     C                     KFLD           IODRN
      *
     C                     SETOF                     OF
      *
     C           *ENTRY    PLIST
     C**                   PARM           PWEIG   32
      *
     C                     PARM           P@BAR   9
     C                     PARM           P@ODRN 10
     C                     PARM           P@WGT   3
     C                     PARM           P@MAN# 18
     C                     PARM           P@RTN   1
     C                     MOVELP@WGT     PWEIG   32
      *
     C                     TIME           WTIME   60
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    PHZ8
     C                     Z-ADDPMM8      PMM
     C                     Z-ADDPDD8      PDD
     C                     Z-ADDPYY8      PYY
     C                     Z-ADDINOHZ     K@YMD
      *
     C                     MOVELINONY     PSIRE   4
     C                     MOVELIMHN      IMHNA
     C           INONY     IFEQ 3530
     C                     MOVELIMHN1     @MHN1
     C                     MOVELIMHN2     @MHN2
     C                     MOVELIMHN3     @MHN3
     C                     MOVEL@MHN      @PART     P
     C                     ELSE
     C                     MOVELIMHN      OPAR
     C                     MOVE OPAR1     WPAR1
     C                     MOVE OPAR2     WPAR2
     C                     MOVE OPAR3     WPAR3
     C                     MOVELWPAR      @PART
     C                     ENDIF
     C* DENSO
     C           INONY     IFEQ 3032
JW   C           INONY     OREQ 3062
JW   C           INONY     OREQ 3070
JW   C           INONY     OREQ 3076
JW   C           INONY     OREQ 3086
     C                     MOVELIMHN      IMHNB
     C                     MOVELIMHB1     @MHB1
     C                     MOVELIMHB2     @MHB3
     C                     MOVEL@MHNB     @PART
     C                     ENDIF
      *
     C           INONY     IFEQ 3530
     C                     MOVELIINV#     @MAN#
     C                     ELSE
     C                     MOVELIODRN     @MAN#
     C                     ENDIF
     C*
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WTKRO
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLEWTODAY
     C                     SETON                     50
     C                     ENDIF
     C*
     C           *IN50     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C           A2TRHZ    IFGT INOHZ
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDISRYO     WSRYO   60
      *
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   62H
      *
     C           ISRYO     DIV  ISYOS     WKT1    40
     C                     MVR            WKT2    40
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     ENDIF
      *
     C                     ADD  WKT1      TKT1
      *
     C           WGROS     MULT WKT1      WEIGH   62
     C                     ADD  WEIGH     TEIGH   72
     C           TEIGH     MULT 2.2046    WLB1    82H
      *
      * BAR CODE
     C           *INL1     IFEQ *ON
     C                     MOVE *BLANK    NADD1  40
     C                     MOVE *BLANK    NADD2  40
     C                     MOVE *BLANK    NADD3  40
     C                     MOVE *BLANK    NADD4  40
     C                     MOVE *BLANK    NADD5  40
     C                     MOVE *BLANK    NADD6  40
     C                     MOVE *BLANK    WNONY   4
     C                     MOVE INONY     WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    NADD1
     C                     MOVELE4ADD2    NADD2
     C                     MOVELE4ADD3    NADD3
     C                     MOVELE4ADD4    NADD4
     C                     MOVELE4ADD5    NADD5
     C                     MOVELE4ADD6    NADD6
     C                     ENDIF
     C                     ENDIF
     C                     MOVE *BLANK    SADD1  38
     C                     MOVE *BLANK    SADD2  38
     C                     MOVE *BLANK    SADD3  38
     C                     MOVE *BLANK    SADD4  38
     C                     MOVE *BLANK    SADD5  38
     C                     MOVE *BLANK    SADD6  38
     C                     MOVE '0111'    WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    SADD1
     C                     MOVELE4ADD2    SADD2
     C                     MOVELE4ADD3    SADD3
     C                     MOVELE4ADD4    SADD4
     C                     MOVELE4ADD5    SADD5
     C                     MOVELE4ADD6    SADD6
     C                     ENDIF
     C                     ENDIF
     C                     EXSR #NMBR
     C*
     C                     MOVEL*BLANK    P@TTLA
     C           INOTM     IFEQ 33
     C                     MOVELC#SPBN    P@TTLA
     C                     ENDIF
     C*
     C                     EXSR #HED
      *
     C                     ELSE
      *
     C           *IN77     IFEQ *ON
     C                     EXSR #HED
     C                     ENDIF
     C                     ENDIF
      *
     C                     WRITE@3JDTL
      *
     CL1                   EXSR #TTL
      *
      *===================================================
      * HEADER PROCESS
      *===================================================
     C           #HED      BEGSR
      *
     C                     WRITE@3JHED
     C                     MOVE *OFF      *IN77
      *
     C                     ENDSR
      *===================================================
      * TOTAL PROCESS
      *===================================================
     C           #TTL      BEGSR
      *
     C           *IN77     IFEQ *ON
     C                     EXSR #HED
     C                     ENDIF
      *
     C                     WRITE@3JTTL
      *
     C                     Z-ADD*ZERO     TEIGH
     C                     Z-ADD*ZERO     TKT1
     C                     Z-ADD*ZERO     WLB1
      *
     C                     ENDSR
      *===================================================
      * GET PACKING LIST#
      *===================================================
     C           #NMBR     BEGSR
      *
     C**         K#P75     CHAINAB#PL75              90
     C**         *IN90     IFEQ *OFF
     C**                   MOVELPUSERL    BARC
     C**                   ELSE
     C**         K#KEY     KLIST
     C**                   KFLD           K@KWD1  8
     C**                   KFLD           K@KWD2  8
      **
     C**                   MOVEL'PICKLIST'K@KWD1
     C**                   MOVE *YEAR     @@YY    2
     C**                   MOVE *MONTH    @@MM    2
     C**         @@YY      CAT  @@MM:0    K@KWD2    P
     C**         K#KEY     CHAINAB#PPCT              90
     C**         *IN90     IFEQ *OFF
     C**                   ADD  1         CTNBR1
     C**                   UPDATAB#PPCT1
     C**                   ELSE
     C**                   CLEARAB#PPCT1
     C**                   MOVELK@KWD1    CTKEY1
     C**                   MOVELK@KWD2    CTKEY2
     C**                   ADD  1         CTNBR1
     C**                   WRITEAB#PPCT1
     C**                   ENDIF
      **
     C**                   Z-ADDCTNBR1    @@5     50
     C**                   MOVE @@5       @@5C    5
     C**         K@KWD2    CAT  @@5C:0    BARC      P
      **
     C**                   CLEARAB#PP751
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    PUKODT
     C**                   Z-ADDWSSTM6    PUKOTN
     C**                   MOVEL#USER     PUKOME
     C**                   Z-ADDITOKU     PUCUST
     C**                   Z-ADDINONY     PUNONY
     C**                   MOVELINKOJ     PUNKOJ
     C**                   MOVELINUKE     PUNUKE
     C**                   Z-ADDINOTM     PUBINN
     C**                   MOVELBARC      PUSERL
     C**                   Z-ADDK@YY      PUNOYY
     C**                   Z-ADDK@MM      PUNOMM
     C**                   Z-ADDK@DD      PUNODD
     C**                   MOVE IODRN     PUODRN
      **
     C**                   WRITEAB#PP751
     C**
     C**                   CLEARAB#PP781
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    P8KODT
     C**                   Z-ADDWSSTM6    P8KOTM
     C**                   MOVEL#USER     P8KONM
     C**                   Z-ADDITOKU     P8CUST
     C**                   Z-ADDINONY     P8NONY
     C**                   MOVELINKOJ     P8NKOJ
     C**                   MOVELINUKE     P8NUKE
     C**                   Z-ADDINOTM     P8BINN
     C**                   MOVELBARC      P8SERL
     C**                   Z-ADDK@YY      P8NOYY
     C**                   Z-ADDK@MM      P8NOMM
     C**                   Z-ADDK@DD      P8NODD
     C**                   MOVE IODRN     P8ODRN
     C**                   Z-ADDWSSDAT    P8PLDT
     C**                   Z-ADDWSSTM6    P8PLTM
     C**                   MOVEL#USER     P8PLNM
     C**
     C**         K#L7BA    KLIST
     C**                   KFLD           K@NONY  4
     C**                   KFLD           INKOJ
     C**                   KFLD           INUKE
     C**                   KFLD           K@YY
     C**                   KFLD           K@MM
     C**                   KFLD           K@DD
     C**                   KFLD           K@NOBN  2
     C**                   KFLD           IODRN
     C**                   MOVELINONY     K@NONY
     C**                   MOVELINOTM     K@NOBN
     C**         K#L7BA    CHAINAB#PL7B              90
     C**         *IN90     IFEQ *OFF
     C**                   Z-ADDWSSDAT    P8LPDT
     C**                   Z-ADDWSSTM6    P8LPTM
     C**                   MOVEL#USER     P8LPNM
     C**                   ENDIF
     C**
     C**                   WRITEAB#PP781
     C**
     C**                   ENDIF
      *
     C                     MOVELP@BAR     BARC
     C                     MOVELBARC      @BARC   9
      *
     C                     ENDSR
      *===================================================
      * INITIAL SET
      *===================================================
     C           *INZSR    BEGSR
     C*
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    WTODAY  80
     C*
     C                     ENDSR
     C*
