     H            Y.
     F** AC#R07 ************************************************
     F*  (HONDA) PRINT CONSOLIDATED PACKING LIST(TYPE-4,5,6)   *
     F*  COPIED FROM AB#R3D                                    *
     F*  J.WATANABE   2017.04.10                               *
     F************************************************(AB#R3D)**
     F**AB#PP31 IP  E           K        DISK
     FAC#PP32 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FAB#PP49 IF  E           K        DISK
     F**AB#PPCT UF  E           K        DISK                      A
     F**AB#PL75 IF  E           K        DISK                      A
     F**AB#PP78 O   E                    DISK
     FAB#PP85 IF  E           K        DISK
     F**AB#PL7B IF  E           K        DISK
     F**AB#PR3C O   E             76     PRINTER                        UC
     FAC#PR07 O   E             77     PRINTER                        UC
     FAC#PR08 O   E             78     PRINTER                        UC
     FAC#PR09 O   E             79     PRINTER                        UC
      *---------------------------------------------------------
     E                    TB1     1   3  4   TB2     5
     E                    TTL     1   5 12
      *---------------------------------------------------------
     IAC#PP321    01
     I                                              INOHZ L1
     I                                              INOTM L1
     I                                              INUKE L1
     I                                              IODRN L1
     I                                              INONY L1
     I                                              INKOJ L1
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I                                        1   6 XMHN1
     I                                        7  11 XMHN2
     I                                       12  20 XMHN3
     I                                       13  13 XXX
     I            DS
     I                                        1  20 IMHNA
     I                                        1   5 IHMH1
     I                                        6   8 IHMH2
     I                                        9  12 IHMH3
     I                                       13  14 IHMH4
     I            DS
     I                                        1  17 @MHN
     I                                        1   5 @MHN1
     I I            '-'                       6   6 @M1
     I                                        7  11 @MHN2
     I I            '-'                      12  12 @M2
     I                                       13  17 @MHN3
     I            DS
     I                                        1  17 @MHNA
     I                                        1   5 @HMH1
     I I            '-'                       6   6 @H1
     I                                        7   9 @HMH2
     I I            '-'                      10  10 @H2
     I                                       11  14 @HMH3
     I I            '-'                      15  15 @H3
     I                                       16  17 @HMH4
     I            DS
     I                                        1  17 @MHNB
     I                                        1   6 @BMH1
     I I            '-'                       7   7 @B1
     I                                        8  12 @BMH2
     I I            '-'                      13  13 @B2
     I                                       14  47 @BMH3
     I            DS
     I                                        1  20 IMHNC
     I                                        1   8 IMHC1
     I                                        9  20 IMHC2
     I            DS
     I                                        1  17 @MHNC
     I                                        1   8 @MHC1
     I I            '-'                       9   9 @MHC2
     I                                       10  17 @MHC3
     I            DS
     I                                        1  12 ISHN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I            DS
     I                                        1   8 PMNOHZ
     I                                        1   4 PMNOYY
     I                                        5   6 PMNOMM
     I                                        7   8 PMNODD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80PHZ8
     I                                        1   20PCC8
     I                                        3   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60PHZ
     I                                        1   20PMM
     I                                        3   40PDD
     I                                        5   60PYY
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 @PGMID
     I                                        1   6 PGMID
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      *
     I              'EXPEDITE'            C         C#SPBN
      *
      *===================================================
      * MAIN PROCESS
      *===================================================
     C                     TIME           WTIME   60
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    PHZ8
     C                     Z-ADDPMM8      PMM
     C                     Z-ADDPDD8      PDD
     C                     Z-ADDPYY8      PYY
     C                     MOVELINONY     PSIRE   4
     C                     MOVELIMHN      IMHNA
     C                     Z-ADDINOHZ     K@YMD
     C**                   MOVE IODRN     @ODRN  20
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     11
      *
     C                     Z-ADD*ZERO     K@RYY
     C                     Z-ADD*ZERO     K@RMM
     C                     Z-ADD*ZERO     K@RDD
     C                     MOVELTTL,1     @@TTL
     C                     MOVELTTL,2     @@TT1
     C                     MOVELTTL,1     @@TT2
      *
     C                     SELEC
     C           PSIRE     WHEQ '0541'
     C                     MOVELTTL,4     @@TTL
     C                     MOVELTTL,4     @@TT2
     C                     MOVELTTL,1     @@TT2
      *
     C           PSIRE     WHEQ '0873'
     C           PSIRE     OREQ '0870'
     C           PSIRE     OREQ '0871'
     C                     MOVELTTL,1     @@TT1
     C                     MOVELTTL,5     @@TT2
      *
     C           PSIRE     WHEQ '0323'
     C                     MOVELTTL,5     @@TT2
     C                     MOVELTTL,3     @@TT1
     C           PSIRE     WHEQ '3423'
     C           PSIRE     OREQ '3951'
     C           PSIRE     OREQ '3953'
     C                     MOVELTTL,1     @@TT1
     C                     MOVELTTL,5     @@TT2
     C           PSIRE     WHEQ '0701'
     C           PSIRE     OREQ '3319'
     C                     MOVELTTL,1     @@TT1
     C                     MOVELTTL,2     @@TT2
     C                     OTHER
     C                     MOVELTTL,1     @@TT2
     C                     MOVELTTL,2     @@TT1
     C                     ENDSL
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       10
     C           PSIRE     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVE TB2,A     WNAME   5
     C                     ENDIF
     C                     ENDIF
      *
     C                     SELEC
     C           INONY     WHEQ 0390
     C           INONY     OREQ 0295
     C           INONY     OREQ 0296
     C                     MOVELIHMH1     @HMH1
     C                     MOVELIHMH2     @HMH2
     C                     MOVELIHMH3     @HMH3
     C                     MOVELIHMH4     @HMH4
     C                     MOVEL@MHNA     @PART     P
     C           INONY     WHEQ 0777
     C           K#49      CHAINAB#PP49              90
     C           *IN90     IFEQ *OFF
     C                     MOVELABMHIN    @PART
     C                     ELSE
     C           XXX       IFNE *BLANK
     C           XMHN3     OREQ *BLANK
     C                     MOVELXMHN1     @BMH1
     C                     MOVELXMHN2     @BMH2
     C                     MOVELXMHN3     @BMH3
     C                     MOVEL@MHNB     @PART     P
     C                     ELSE
     C                     MOVELIMHN1     @MHN1
     C                     MOVELIMHN2     @MHN2
     C                     MOVELIMHN3     @MHN3
     C                     MOVEL@MHN      @PART     P
     C                     ENDIF
     C                     ENDIF
     C* DENSO
     C           INONY     WHEQ 3032
JW   C           INONY     OREQ 3062
JW   C           INONY     OREQ 3070
JW   C           INONY     OREQ 3076
JW   C           INONY     OREQ 3086
     C                     MOVELIMHN      IMHNC
     C                     MOVELIMHC1     @MHC1
     C                     MOVELIMHC2     @MHC3
     C                     MOVEL@MHNC     @PART
     C*
     C                     OTHER
     C                     MOVELIMHN1     @MHN1
     C                     MOVELIMHN2     @MHN2
     C                     MOVELIMHN3     @MHN3
     C                     MOVEL@MHN      @PART     P
     C                     ENDSL
      *
     C                     SETOF                     50
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WTKRO
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLEWTODAY
     C                     SETON                     50
     C                     ENDIF
     C           *IN50     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C           A2TRHZ    IFGT INOHZ
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDISRYO     WSRYO   60
      *
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   62H
      *
     C           ISRYO     DIV  ISYOS     WKT1    40
     C                     MVR            WKT2    40
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     ENDIF
      *
     C                     ADD  WKT1      TKT1
      *
     C           WGROS     MULT WKT1      WEIGH   62
     C                     ADD  WEIGH     TEIGH   72
     C           TEIGH     MULT 2.2046    WLB1    82H
      * BAR CODE
     C           *INL1     IFEQ *ON
      *
     C                     MOVE *BLANK    NADD1  40
     C                     MOVE *BLANK    NADD2  40
     C                     MOVE *BLANK    NADD3  40
     C                     MOVE *BLANK    NADD4  40
     C                     MOVE *BLANK    NADD5  40
     C                     MOVE *BLANK    NADD6  40
     C                     MOVE *BLANK    WNONY   4
     C                     MOVE INONY     WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    NADD1
     C                     MOVELE4ADD2    NADD2
     C                     MOVELE4ADD3    NADD3
     C                     MOVELE4ADD4    NADD4
     C                     MOVELE4ADD5    NADD5
     C                     MOVELE4ADD6    NADD6
     C                     ENDIF
     C                     ENDIF
     C                     MOVE *BLANK    SADD1  38
     C                     MOVE *BLANK    SADD2  38
     C                     MOVE *BLANK    SADD3  38
     C                     MOVE *BLANK    SADD4  38
     C                     MOVE *BLANK    SADD5  38
     C                     MOVE *BLANK    SADD6  38
     C                     MOVE '0111'    WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    SADD1  38
     C                     MOVELE4ADD2    SADD2  38
     C                     MOVELE4ADD3    SADD3  38
     C                     MOVELE4ADD4    SADD4  38
     C                     MOVELE4ADD5    SADD5  38
     C                     MOVELE4ADD6    SADD6  38
     C                     ENDIF
     C                     ENDIF
     C                     EXSR #NMBR
     C*
     C                     MOVEL*BLANK    P@TTLA
     C           INOTM     IFEQ 33
     C                     MOVELC#SPBN    P@TTLA
     C                     ENDIF
     C*
     C                     MOVELINONY     PMNONY
     C                     MOVELINOHZ     PMNOHZ
     C                     MOVELINOTM     PMNOBN
     C                     CALL 'AB#R3@'
     C                     PARM           PMNONY  4
     C                     PARM           INKOJ
     C                     PARM           INUKE
     C                     PARM           PMNOYY
     C                     PARM           PMNOMM
     C                     PARM           PMNODD
     C                     PARM           PMNOBN  2
     C                     PARM           IINV#
     C                     PARM *BLANK    PMSUB#  7
     C                     MOVELPMSUB#    @SUB#
     C*
     C                     EXSR #HED
      *
     C                     ELSE
      *
     C           *IN76     IFEQ *ON
     C           *IN77     OREQ *ON
     C           *IN78     OREQ *ON
     C           *IN79     OREQ *ON
     C                     EXSR #HED
     C                     ELSE
      *
     C           INONY     IFEQ 3503
     C           INUKE     ANDEQ'2A  '
     C           INOHZ     ANDGE20041209
     C                     SELEC
     C           ISBAN     WHLT 'A183'
     C                     Z-ADD1         @@SKD   10
     C           ISBAN     WHLT 'B189'
     C                     Z-ADD2         @@SKD   10
     C                     OTHER
     C                     Z-ADD3         @@SKD
     C                     ENDSL
     C           @@SKD     IFGT 1
     C           @@SKD     ANDNEW@SKD
     C           W@SKD     ANDNE0
     C                     WRITE@3FSKP
     C                     ENDIF
     C                     Z-ADD@@SKD     W@SKD
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           ISBAN     IFEQ '0000'
     C                     MOVE *BLANK    W@SBAN
     C                     ELSE
     C                     MOVELISBAN     W@SBAN    P
     C                     ENDIF
      *
     C           K#PP85    KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C           K#PP85    SETGTAB#PP85
     C           *IN90     DOUEQ*ON
     C           K#PP85    REDPEAB#PP85                  90
     C           *IN90     IFEQ *OFF
     C           A5DATE    ANDLEINOHZ
     C           A5SBAN    IFNE *BLANK
     C           A5SBAN    ANDNE'000000'
     C                     MOVELA5SBAN    W@SBAN    P
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C                     SELEC
     C**         P@TYPE    WHEQ '03'
     C**                   WRITE@3CDTL
     C           P@TYPE    WHEQ '04'
     C                     WRITE@3DDTL
     C           P@TYPE    WHEQ '05'
     C                     WRITE@3EDTL
     C           P@TYPE    WHEQ '06'
     C                     WRITE@3FDTL
     C                     ENDSL
      *
     CL1                   EXSR #TTL
      *
      *===================================================
      * INITAIAL SETTING
      *===================================================
     C           *INZSR    BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
     C           KEY7      KLIST
     C                     KFLD           INONY
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           INOTM
     C           K#P75     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           INOTM
     C                     KFLD           K@RYY   40
     C                     KFLD           K@RMM   20
     C                     KFLD           K@RDD   20
     C                     KFLD           IODRN
     C           K#49      KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
      *
     C           *ENTRY    PLIST
     C**                   PARM           PWEIG   32
     C**                   PARM           P@TYPE  2
      *
     C                     PARM           P@BAR   9
     C                     PARM           P@ODRN 10
     C                     PARM           P@WGT   3
     C                     PARM           P@MAN# 18
     C                     PARM           P@TYPE  2
     C                     PARM           P@RTN   1
     C                     MOVELP@WGT     PWEIG   32
      *
     C                     Z-ADD*ZERO     W@SKD   10
     C                     MOVE *OFF      *IN88
      *
     C                     SELEC
     C           P@TYPE    WHEQ '04'
     C                     OPEN AC#PR07
     C           P@TYPE    WHEQ '05'
     C                     OPEN AC#PR08
     C           P@TYPE    WHEQ '06'
     C                     OPEN AC#PR09
     C                     ENDSL
      *
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    WTODAY  80
     C*
     C                     ENDSR
      *===================================================
      * HEADER PROCESS
      *===================================================
     C           #HED      BEGSR
      *
     C                     SELEC
     C**         P@TYPE    WHEQ '03'
     C**                   WRITE@3CHED
     C           P@TYPE    WHEQ '04'
     C                     WRITE@3DHED
     C           P@TYPE    WHEQ '05'
     C                     WRITE@3EHED
     C           P@TYPE    WHEQ '06'
     C                     WRITE@3FHED
     C                     ENDSL
      *
     C                     MOVEA'0000'    *IN,76
      *
     C                     ENDSR
      *===================================================
      * TOTAL PROCESS
      *===================================================
     C           #TTL      BEGSR
      *
     C           *IN76     IFEQ *ON
     C           *IN77     OREQ *ON
     C           *IN78     OREQ *ON
     C           *IN79     OREQ *ON
     C                     EXSR #HED
     C                     ENDIF
      *
     C                     SELEC
     C**         P@TYPE    WHEQ '03'
     C**                   WRITE@3CTTL
     C           P@TYPE    WHEQ '04'
     C                     WRITE@3DTTL
     C           P@TYPE    WHEQ '05'
     C                     WRITE@3ETTL
     C           P@TYPE    WHEQ '06'
     C                     WRITE@3FTTL
     C                     ENDSL
      *
     C                     Z-ADD*ZERO     TEIGH
     C                     Z-ADD*ZERO     TKT1
     C                     Z-ADD*ZERO     WLB1
      *
     C                     ENDSR
      *===================================================
      * GET PACKING LIST#
      *===================================================
     C           #NMBR     BEGSR
      *
     C**         K#P75     CHAINAB#PL75              90
     C**         *IN90     IFEQ *OFF
     C**                   MOVELPUSERL    BARC
     C**                   ELSE
     C**         K#KEY     KLIST
     C**                   KFLD           K@KWD1  8
     C**                   KFLD           K@KWD2  8
      **
     C**                   MOVEL'PICKLIST'K@KWD1
     C**                   MOVE *YEAR     @@YY    2
     C**                   MOVE *MONTH    @@MM    2
     C**         @@YY      CAT  @@MM:0    K@KWD2    P
     C**         K#KEY     CHAINAB#PPCT              90
     C**         *IN90     IFEQ *OFF
     C**                   ADD  1         CTNBR1
     C**                   UPDATAB#PPCT1
     C**                   ELSE
     C**                   CLEARAB#PPCT1
     C**                   MOVELK@KWD1    CTKEY1
     C**                   MOVELK@KWD2    CTKEY2
     C**                   ADD  1         CTNBR1
     C**                   WRITEAB#PPCT1
     C**                   ENDIF
      **
     C**                   Z-ADDCTNBR1    @@5     50
     C**                   MOVE @@5       @@5C    5
     C**         K@KWD2    CAT  @@5C:0    BARC      P
      **
     C**                   CLEARAB#PP751
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    PUKODT
     C**                   Z-ADDWSSTM6    PUKOTN
     C**                   MOVEL#USER     PUKOME
     C**                   Z-ADDITOKU     PUCUST
     C**                   Z-ADDINONY     PUNONY
     C**                   MOVELINKOJ     PUNKOJ
     C**                   MOVELINUKE     PUNUKE
     C**                   Z-ADDINOTM     PUBINN
     C**                   MOVELBARC      PUSERL
     C**                   Z-ADDK@YY      PUNOYY
     C**                   Z-ADDK@MM      PUNOMM
     C**                   Z-ADDK@DD      PUNODD
     C**                   MOVE IODRN     PUODRN
      **
     C**                   WRITEAB#PP751
     C**
     C**                   CLEARAB#PP781
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    P8KODT
     C**                   Z-ADDWSSTM6    P8KOTM
     C**                   MOVEL#USER     P8KONM
     C**                   Z-ADDITOKU     P8CUST
     C**                   Z-ADDINONY     P8NONY
     C**                   MOVELINKOJ     P8NKOJ
     C**                   MOVELINUKE     P8NUKE
     C**                   Z-ADDINOTM     P8BINN
     C**                   MOVELBARC      P8SERL
     C**                   Z-ADDK@YY      P8NOYY
     C**                   Z-ADDK@MM      P8NOMM
     C**                   Z-ADDK@DD      P8NODD
     C**                   MOVELIODRN     P8ODRN
     C**                   Z-ADDWSSDAT    P8PLDT
     C**                   Z-ADDWSSTM6    P8PLTM
     C**                   MOVEL#USER     P8PLNM
     C**
     C**         K#PL7B    KLIST
     C**                   KFLD           K@NONY  4
     C**                   KFLD           INKOJ
     C**                   KFLD           INUKE
     C**                   KFLD           K@YY
     C**                   KFLD           K@MM
     C**                   KFLD           K@DD
     C**                   KFLD           K@NOBN  2
     C**                   KFLD           IODRN
     C**                   MOVELINONY     K@NONY
     C**                   MOVELINOTM     K@NOBN
     C**         K#PL7B    CHAINAB#PL7B              90
     C**         *IN90     IFEQ *OFF
     C**                   Z-ADDWSSDAT    P8LPDT
     C**                   Z-ADDWSSTM6    P8LPTM
     C**                   MOVEL#USER     P8LPNM
     C**                   ENDIF
     C**
     C**                   WRITEAB#PP781
     C**
     C**                   ENDIF
      *
     C                     MOVELP@BAR     BARC
     C                     MOVELBARC      @BARC   9
      *
     C                     ENDSR
      *--------------------------------------------------------
** TB1.TB2
3347TMMK
0541NUMMI
3503TMMC
** TTL
MANIFEST#  :
DELIVERY#  :
SHIPMENT ID:
FRS NO.    :
ORDER #    :
