     H            Y.
     F** AC#R05 *********************************************
     F*  (HONDA) PRINT CONSOLIDATED PACKING LIST(TYPE-2,9)  *
     F*  COPIED FROM AB#R3R                                 *
     F*  J.WATANABE   2017.04.07                            *
JW1  F* J.W.  07.24.2017 ADD ORDER FILE (AB#PLAA=AB#PPA1)   *
     F************************************* AB#R3R **********
     F**AB#PP31 IP  E           K        DISK
     FAC#PP32 IP  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     F**AB#PPCT UF  E           K        DISK                      A
     F**AB#PL75 IF  E           K        DISK                      A
     F**AB#PP78 O   E                    DISK
     F**AB#PL7B IF  E           K        DISK
     FAB#PL2A IF  E           K        DISK
     FAB#PL1A UF  E           K        DISK
JW1  FAB#PLAA UF  E           K        DISK
     FAB#PL90 IF  E           K        DISK
     FAB#PP43 IF  E           K        DISK
     FAC#PR05 O   E             77     PRINTER
      *--------------------------------------------------
     E                    TB1     1   3  4   TB2     5
     E                    TTL     1   6 11
     E                    TXT     1   5 22
     E                    SHP     1   1 25
      *--------------------------------------------------
     IAC#PP321    01
     I                                              INOHZ L1
     I                                              ISIRE L1
     I                                              ISIRK L1
     I            DS
     I                                        1  20 ACMHN
     I                                        1   5 ACMHN1
     I                                        6  10 ACMHN2
     I                                       11  15 ACMHN3
     I                                       16  20 ACMHN4
     I            DS
     I                                        1  20 IMHN
     I                                        1   5 IMHN1
     I                                        6  10 IMHN2
     I                                       11  15 IMHN3
     I                                       16  20 IMHN4
     I            DS
     I                                        1  20 IMHNA
     I                                        1   5 IHMH1
     I                                        6   8 IHMH2
     I                                        9  12 IHMH3
     I                                       13  14 IHMH4
     I            DS
     I                                        1  17 @MHN
     I                                        1   5 @MHN1
     I I            '-'                       6   6 @M1
     I                                        7  11 @MHN2
     I I            '-'                      12  12 @M2
     I                                       13  17 @MHN3
     I            DS
     I                                        1  17 @MHNA
     I                                        1   5 @HMH1
     I I            '-'                       6   6 @H1
     I                                        7   9 @HMH2
     I I            '-'                      10  10 @H2
     I                                       11  14 @HMH3
     I I            '-'                      15  15 @H3
     I                                       16  17 @HMH4
     I            DS
     I                                        1  20 IMHNB
     I                                        1   8 IMHB1
     I                                        9  20 IMHB2
     I            DS
     I                                        1  17 @MHNB
     I                                        1   8 @MHB1
     I I            '-'                       9   9 @MHB2
     I                                       10  17 @MHB3
     I            DS
     I                                        1  20 IMHNC
     I                                        1   2 IMHC1
     I                                        3  20 IMHC2
     I            DS
     I                                        1  17 @MHNC
     I                                        1   2 @MHC1
     I I            '-'                       3   3 @MHC2
     I                                        4  17 @MHC3
     I            DS
     I                                        1  12 ISHN
     I                                        1   5 ISHN1
     I                                        6  10 ISHN2
     I                                       11  12 ISHN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1   80E4SKHZ
     I                                        1   40E4SKYY
     I                                        5   60E4SKMM
     I                                        7   80E4SKDD
     I            DS
     I                                        1   80INOHZ
     I                                        1   40INOYR
     I                                        1   20INOCC
     I                                        3   40INOYY
     I                                        5   60INOMM
     I                                        7   80INODD
     I            DS
     I                                        1   60SPHZ
     I                                        1   20INOMMA
     I                                        3   40INODDA
     I                                        5   60INOYYA
     I            DS
     I                                        1   80PHZ8
     I                                        1   20PCC8
     I                                        3   40PYY8
     I                                        5   60PMM8
     I                                        7   80PDD8
     I            DS
     I                                        1   60PHZ
     I                                        1   20PMM
     I                                        3   40PDD
     I                                        5   60PYY
     I           SDS
     I                                        1   8 @PGMID
     I                                        1   6 PGMID
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      *
     I              'EXPEDITE'            C         C#SPBN
      *===================================================
      *
     C           *ENTRY    PLIST
     C                     PARM           PBAR    9        NOT USE
     C                     PARM           PODRN  10        NOT USE
     C                     PARM           PWEIX   3
     C                     PARM           PMANI  18
     C                     PARM           PTYP    2
     C                     PARM           PRTN    1        NOT USE
     C                     MOVELPWEIX     PWEIG   32
     C                     MOVE *BLANK    PODRN
      *
     C           KEY1      KLIST
     C                     KFLD           ISHN1
     C                     KFLD           ISHN2
     C                     KFLD           ISHN3
      *
     C           K#P75     KLIST
     C                     KFLD           INOYR
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           INOTM
      *
     C           K#1A      KLIST
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C           K#1AX     KLIST
     C                     KFLD           INOHZ
     C                     KFLD           INOTM
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IODRN
      *
     C           K#P2A     KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           INOHZ
     C**                   KFLD           INOTM
     C                     KFLD           K@BIN
     C                     KFLD           K@ODRN 20
      *
     C           K#X2A     KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           INKOJ
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C                     KFLD           INOHZ
      *
     C                     TIME           WTIME   60
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    PHZ8
     C                     Z-ADDPMM8      PMM
     C                     Z-ADDPDD8      PDD
     C                     Z-ADDPYY8      PYY
     C                     MOVELINONY     PSIRE   4
     C                     MOVELIMHN      IMHNA
     C                     Z-ADDINOMM     INOMMA
     C                     Z-ADDINODD     INODDA
     C                     Z-ADDINOYY     INOYYA
      *===================================================
      * MAIN PROCESS
      *===================================================
     C           *IN11     IFEQ '0'
     C                     SETON                     11
      * SET PACKING LIST TYPE
     C                     SELEC
     C           PTYP      WHEQ '02'
     C                     MOVEL'(C2)'    XTYP
     C           PTYP      WHEQ '09'
     C                     MOVEL'(C9)'    XTYP
     C                     OTHER
     C                     MOVEL'(C) '    XTYP
     C                     ENDSL
      *
     C           PSIRE     IFEQ '0541'
     C                     MOVELTTL,2     @@TT2
     C                     ELSE
     C           PSIRE     IFEQ '3550'
     C                     MOVELTTL,6     @@TT2
     C                     ELSE
     C                     MOVELTTL,1     @@TT2
     C                     ENDIF
     C                     ENDIF
      *
     C           PODRN     IFNE *BLANK
     C                     MOVELTTL,1     @@TT3
     C                     MOVELPODRN     PINVC
     C                     ENDIF
      *
     C           ITOKU     IFEQ 0390
     C           ITOKU     OREQ 0295
     C           ITOKU     OREQ 0294
     C           ITOKU     OREQ 0296
     C           ITOKU     OREQ 5382
     C           ITOKU     OREQ 5379
     C           ITOKU     OREQ 0400
     C           ITOKU     OREQ 0391
     C           ITOKU     OREQ 3135
     C           ITOKU     OREQ 1602
     C                     MOVELTTL,5     @@SHTL
     C                     MOVELIINV#     @@SHNO
     C                     MOVELSHP,1     @@PLTL
     C                     ELSE
     C           PSIRE     IFEQ '3550'
     C                     MOVELTTL,1     @@SHTL
     C                     MOVELIODRN     @@SHNO
     C                     ELSE
     C                     MOVE *BLANK    @@SHTL
     C                     MOVE *BLANK    @@SHNO
     C                     ENDIF
     C                     ENDIF
      *
     C           PSIRE     IFEQ '0437'
     C                     MOVELTTL,3     @@TT1
     C                     ELSE
     C                     MOVELTTL,4     @@TT1
     C                     ENDIF
      *
     C                     SETOF                     20
     C                     Z-ADD1         A       10
     C           PSIRE     LOKUPTB1,A                    20
     C           *IN20     IFEQ '1'
     C                     MOVE TB2,A     WNAME   5
     C                     ENDIF
     C                     ENDIF
      *
     C                     SELEC
     C           ITOKU     WHEQ 0390
     C           ITOKU     OREQ 0295
     C           ITOKU     OREQ 0294
     C           ITOKU     OREQ 0296
     C           ITOKU     OREQ 5382
     C           ITOKU     OREQ 5379
     C           ITOKU     OREQ 0391
     C           ITOKU     OREQ 3135
     C           ITOKU     OREQ 1602
     C                     MOVELIHMH1     @HMH1
     C                     MOVELIHMH2     @HMH2
     C                     MOVELIHMH3     @HMH3
     C                     MOVELIHMH4     @HMH4
     C                     MOVEL@MHNA     @PART
     C           INONY     WHEQ 0291
     C           2         SUBSTIMHN:1    @2      2
     C           5         SUBSTIMHN:3    @5      5
     C           5         SUBSTIMHN:8    @51     5
     C           @2        CAT  '-':0     @PART     P
     C           @PART     CAT  @5:0      @PART     P
     C           @PART     CAT  '-':0     @PART     P
     C           @PART     CAT  @51:0     @PART     P
      *
     C           ITOKU     WHEQ 5401
     C                     MOVELIMHN      IMHNC
     C                     MOVELIMHC1     @MHC1
     C                     MOVELIMHC2     @MHC3
     C                     MOVEL@MHNC     @PART
      *
     C                     OTHER
     C                     MOVELIMHN1     @MHN1
     C                     MOVELIMHN2     @MHN2
     C                     MOVELIMHN3     @MHN3
     C                     MOVEL@MHN      @PART
     C                     ENDSL
     C* DENSO
     C           INONY     IFEQ 3032
JW   C           INONY     OREQ 3062
JW   C           INONY     OREQ 3070
JW   C           INONY     OREQ 3076
JW   C           INONY     OREQ 3086
     C                     MOVELIMHN      IMHNB
     C                     MOVELIMHB1     @MHB1
     C                     MOVELIMHB2     @MHB3
     C                     MOVEL@MHNB     @PART
     C                     ENDIF
      *
     C                     SETOF                     50
     C                     Z-ADD0         WKASI   72
     C                     MOVE *BLANK    WTKRO
     C           KEY1      CHAINFCEPL011             50
     C           *IN50     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLEWTODAY
     C                     SETON                     50
     C                     ENDIF
     C           *IN50     IFEQ '0'
     C                     Z-ADDA2KASI    WKASI
     C           A2TRHZ    IFGT INOHZ
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDISRYO     WSRYO   90
      *
     C           ISYOS     MULT WKASI     WKOT1   92
     C           WKOT1     DIV  1000      WKOT2   93
     C           WKOT2     ADD  PWEIG     WGROS   72H
      *
     C           ISYOS     IFEQ *ZERO
     C                     Z-ADD*ZERO     WKT1
     C*
     C                     ELSE
     C           ISRYO     DIV  ISYOS     WKT1    40
     C                     MVR            WKT2    40
     C           WKT2      IFNE 0
     C                     ADD  1         WKT1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  WKT1      TKT1
     C*
     C           WGROS     MULT WKT1      WEIGH   72
     C                     ADD  WEIGH     TEIGH   72
     C           TEIGH     MULT 2.2046    WLB1    82H
      *
      * BAR CODE
     C           *INL1     IFEQ *ON
     C                     EXSR #PP2A
      *
     C                     MOVE *BLANK    NADD1  40
     C                     MOVE *BLANK    NADD2  40
     C                     MOVE *BLANK    NADD3  40
     C                     MOVE *BLANK    NADD4  40
     C                     MOVE *BLANK    NADD5  40
     C                     MOVE *BLANK    NADD6  40
     C                     MOVE *BLANK    WNONY   4
     C                     MOVE INONY     WNONY
     C                     MOVELIODRN     K@ODRN
     C           K#P2A     CHAINAB#PL2A              90
     C           *IN90     IFEQ *OFF
     C                     MOVELACPLNM    NADD1
     C                     MOVELACSHNM    NADD2
     C                     MOVELACSAD1    NADD3
     C                     MOVELACSAD2    NADD4
     C           ACCITY    CAT  ',':0     NADD5     P
     C           NADD5     CAT  ACSTAT:0  NADD5     P
     C           NADD5     CAT  ACZIPC:1  NADD5     P
     C                     Z-ADDACPLSH    @@PLHZ
     C                     Z-ADDACSHTM    @@PLTM
     C                     ELSE
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    NADD1
     C                     MOVELE4ADD2    NADD2
     C                     MOVELE4ADD3    NADD3
     C                     MOVELE4ADD4    NADD4
     C                     MOVELE4ADD5    NADD5
     C                     MOVELE4ADD6    NADD6
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     MOVE *BLANK    SADD1  38
     C                     MOVE *BLANK    SADD2  38
     C                     MOVE *BLANK    SADD3  38
     C                     MOVE *BLANK    SADD4  38
     C                     MOVE *BLANK    SADD5  38
     C                     MOVE *BLANK    SADD6  38
     C                     MOVE '0111'    WNONY
     C                     SETOF                     10
     C           WNONY     CHAINEDIPL401             10
     C           *IN10     IFEQ '0'
     C           E4SKJY    IFEQ 'D'
     C           E4SKHZ    ANDLEWTODAY
     C                     ELSE
     C                     MOVELE4ADD1    SADD1
     C                     MOVELE4ADD2    SADD2
     C                     MOVELE4ADD3    SADD3
     C                     MOVELE4ADD4    SADD4
     C                     MOVELE4ADD5    SADD5
     C                     MOVELE4ADD6    SADD6
     C                     ENDIF
     C                     ENDIF
     C                     EXSR #NMBR
     C                     EXSR #PBOX
     C*
     C                     MOVEL*BLANK    P@TTLA
     C           INOTM     IFEQ 33
     C                     MOVELC#SPBN    P@TTLA
     C                     ENDIF
     C*
     C                     WRITE@HED
     C                     MOVE *OFF      *IN77
     C                     ELSE
      *
     C           *IN77     IFEQ *ON
     C                     EXSR #PBOX
     C                     WRITE@HED
     C                     MOVE *OFF      *IN77
     C                     ENDIF
     C                     ENDIF
     C           ITOKU     IFEQ 8990
     C                     MOVE '1'       *IN61
     C                     MOVELIODRN     IODRX
     C                     ELSE
     C                     MOVE '0'       *IN61
     C                     ENDIF
     C*
     C           INONY     IFEQ 3851
     C           INONY     OREQ 3852
     C           IINV#     IFNE *BLANK
     C                     MOVELIINV#     IODRN
     C                     ENDIF
     C                     ENDIF
     C*
     C           INONY     IFEQ 3550
     C           K#PP43    KLIST
     C                     KFLD           INONY
     C                     KFLD           INOYR
     C                     KFLD           INOMM
     C                     KFLD           INODD
     C                     KFLD           INUKE
     C                     KFLD           IMHN1
     C                     KFLD           IMHN2
     C                     KFLD           IMHN3
     C                     KFLD           IMHN4
     C           K#PP43    CHAINAB#PP43              91
     C           *IN91     IFEQ *OFF
     C                     MOVELDASBAN    IODRN
     C                     ELSE
     C                     MOVEL*BLANK    IODRN
     C                     ENDIF
     C                     ENDIF
      *
     C                     WRITE@DTL
      *
     CL1                   EXSR #TTL
      *===================================================
      * TOTAL PROCESS
      *===================================================
     C           #TTL      BEGSR
      *
     C           *IN77     IFEQ *ON
     C                     EXSR #PBOX
     C                     WRITE@HED
     C                     MOVE *OFF      *IN77
     C                     ENDIF
      *
     C                     WRITE@TTL
      *
     C                     Z-ADD*ZERO     TEIGH
     C                     Z-ADD*ZERO     TKT1
     C                     Z-ADD*ZERO     WLB1
      *
     C                     ENDSR
      *===================================================
      * GET PACK#
      *===================================================
      *---------------------------------------------------
     C           #NMBR     BEGSR
      *---------------------------------------------------
     C**         K#P75     SETLLAB#PL75
     C**         *IN90     DOUEQ*ON
     C**         K#P75     READEAB#PL75                  90
     C**         *IN90     IFEQ *OFF
     C**         PUSKJY    ANDEQ*BLANK
     C**         PUODRN    ANDEQPODRN
     C**                   LEAVE
     C**                   ENDIF
     C**                   ENDDO
      **
     C**         *IN90     IFEQ *OFF
     C**                   MOVELPUSERL    BARC
     C**                   ELSE
      **
     C**         K#KEY     KLIST
     C**                   KFLD           K@KWD1  8
     C**                   KFLD           K@KWD2  8
      **
     C**                   MOVEL'PICKLIST'K@KWD1
     C**                   MOVE *YEAR     @@YY    2
     C**                   MOVE *MONTH    @@MM    2
     C**         @@YY      CAT  @@MM:0    K@KWD2    P
     C**         K#KEY     CHAINAB#PPCT              90
     C**         *IN90     IFEQ *OFF
     C**                   ADD  1         CTNBR1
     C**                   UPDATAB#PPCT1
     C**                   ELSE
     C**                   CLEARAB#PPCT1
     C**                   MOVELK@KWD1    CTKEY1
     C**                   MOVELK@KWD2    CTKEY2
     C**                   ADD  1         CTNBR1
     C**                   WRITEAB#PPCT1
     C**                   ENDIF
      **
     C**                   Z-ADDCTNBR1    @@5     50
     C**                   MOVE @@5       @@5C    5
     C**         K@KWD2    CAT  @@5C:0    BARC      P
      **
     C**                   CLEARAB#PP751
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    PUKODT
     C**                   Z-ADDWSSTM6    PUKOTN
     C**                   MOVEL#USER     PUKOME
     C**                   Z-ADDITOKU     PUCUST
     C**                   Z-ADDINONY     PUNONY
     C**                   MOVELINKOJ     PUNKOJ
     C**                   MOVELINUKE     PUNUKE
     C**                   Z-ADDINOTM     PUBINN
     C**                   MOVELBARC      PUSERL
     C**                   Z-ADDINOYR     PUNOYY
     C**                   Z-ADDINOMM     PUNOMM
     C**                   Z-ADDINODD     PUNODD
     C**                   MOVE PODRN     PUODRN
      **
     C**                   WRITEAB#PP751
     C**
     C**                   CLEARAB#PP781
     C**                   TIME           WSSDT
     C**                   Z-ADDWSSDAT    P8KODT
     C**                   Z-ADDWSSTM6    P8KOTM
     C**                   MOVEL#USER     P8KONM
     C**                   Z-ADDITOKU     P8CUST
     C**                   Z-ADDINONY     P8NONY
     C**                   MOVELINKOJ     P8NKOJ
     C**                   MOVELINUKE     P8NUKE
     C**                   Z-ADDINOTM     P8BINN
     C**                   MOVELBARC      P8SERL
     C**                   Z-ADDINOYR     P8NOYY
     C**                   Z-ADDINOMM     P8NOMM
     C**                   Z-ADDINODD     P8NODD
     C**                   MOVELPODRN     P8ODRN
     C**                   Z-ADDWSSDAT    P8PLDT
     C**                   Z-ADDWSSTM6    P8PLTM
     C**                   MOVEL#USER     P8PLNM
     C**
     C**                   MOVELINONY     K@NONY
     C**                   MOVELINOTM     K@NOBN
     C**         PODRN     IFNE *BLANK
     C**         K#L7BA    KLIST
     C**                   KFLD           K@NONY  4
     C**                   KFLD           INKOJ
     C**                   KFLD           INUKE
     C**                   KFLD           INOYR
     C**                   KFLD           INOMM
     C**                   KFLD           INODD
     C**                   KFLD           K@NOBN  2
     C**                   KFLD           PODRN
     C**         K#L7BA    CHAINAB#PL7B              90
     C**         *IN90     IFEQ *OFF
     C**                   Z-ADDWSSDAT    P8LPDT
     C**                   Z-ADDWSSTM6    P8LPTM
     C**                   MOVEL#USER     P8LPNM
     C**                   ENDIF
     C**                   ELSE
     C**         K#L7BB    KLIST
     C**                   KFLD           K@NONY  4
     C**                   KFLD           INKOJ
     C**                   KFLD           INUKE
     C**                   KFLD           INOYR
     C**                   KFLD           INOMM
     C**                   KFLD           INODD
     C**                   KFLD           K@NOBN  2
     C**         K#L7BB    CHAINAB#PL7B              90
     C**         *IN90     IFEQ *OFF
     C**                   Z-ADDWSSDAT    P8LPDT
     C**                   Z-ADDWSSTM6    P8LPTM
     C**                   MOVEL#USER     P8LPNM
     C**                   ENDIF
     C**                   ENDIF
     C**
     C**                   WRITEAB#PP781
     C**
     C**                   ENDIF
      *
     C                     MOVELPBAR      BARC
     C                     MOVELBARC      @BARC
      * AMBRAKE--------------------------------
     C           INONY     IFEQ 0291
     C           INONY     OREQ 0271
     C           PODRN     IFEQ *BLANK
     C           K#1A      SETLLAB#PL1A
     C                     ELSE
     C           K#1AX     SETLLAB#PL1A
     C                     ENDIF
      *
     C           *IN90     DOUEQ*ON
     C           PODRN     IFEQ *BLANK
     C           K#1A      READEAB#PL1A                  90
     C                     ELSE
     C           K#1AX     READEAB#PL1A                  90
     C                     ENDIF
      *
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    ANDEQ*BLANK
     C                     MOVELBARC      BAINVN
     C                     UPDATAB#PL141
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
JW1   * AMBRAKE--------------------------------
 |   C           INONY     IFEQ 0291
 |   C           INONY     OREQ 0271
 |   C           PODRN     IFEQ *BLANK
 |   C           K#1A      SETLLAB#PLAA
 |   C                     ELSE
 |   C           K#1AX     SETLLAB#PLAA
 |   C                     ENDIF
 |    *
 |   C                     MOVE *OFF      *IN92
 |   C           *IN92     DOUEQ*ON
 |   C           PODRN     IFEQ *BLANK
 |   C           K#1A      READEAB#PLAA                  92
 |   C                     ELSE
 |   C           K#1AX     READEAB#PLAA                  92
 |   C                     ENDIF
 |    *
 |   C           *IN92     IFEQ *OFF
 |   C           BASKJY    ANDEQ*BLANK
 |   C           BAINVN    ANDEQ*BLANK
 |   C                     MOVELBARC      BAINVN
 |   C                     UPDATAB#PLAA1
 |   C                     ENDIF
 |   C                     ENDDO
JW1  C                     ENDIF
      *
     C                     ENDSR
      *===================================================
      * GET BOX #
      *===================================================
     C           #PBOX     BEGSR
      * IAF
     C                     MOVE INONY     CHRD    4
      *
     C           CHRD      CHAINAB#PL90              65
     C           *IN65     IFEQ *OFF
     C           YASKJY    ANDEQ*BLANK
     C           YAMXPL    IFGE 120
     C                     MOVE TXT,3     PBOX
     C                     ELSE
     C                     MOVE TXT,4     PBOX
     C                     ENDIF
     C                     ENDIF
     C* JATM
     C           INONY     IFEQ 3515
     C                     MOVE TXT,5     PBOX
     C                     ENDIF
     C* FAS
     C           INONY     IFEQ 5555
     C                     MOVE TXT,3     PBOX
     C                     ENDIF
      * FORD
     C           ITOKU     IFEQ 5149
     C           ITOKU     OREQ 5530
     C           CHRD      IFEQ '5161'
     C           CHRD      OREQ '5196'
     C           CHRD      OREQ '5191'
     C           CHRD      OREQ '5195'
     C           CHRD      OREQ '5162'
     C           CHRD      OREQ '5188'
     C           CHRD      OREQ '5189'
     C           CHRD      OREQ '5143'
     C           CHRD      OREQ '5194'
     C           CHRD      OREQ '5199'
     C           CHRD      OREQ '5197'
     C           CHRD      OREQ '5198'
     C           CHRD      OREQ '5193'
     C           CHRD      OREQ '5192'
     C                     MOVE TXT,1     PBOX
     C                     ELSE
     C                     MOVE TXT,2     PBOX
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *===================================================
      * GET PP2A BIN#(K@BIN)
      *===================================================
     C           #PP2A     BEGSR
      *
     C                     MOVE *BLANK    K@BIN   20
     C                     MOVE *OFF      *IN96
     C           K#X2A     SETLLAB#PL2A
     C           *IN96     DOWEQ*OFF
     C           K#X2A     READEAB#PL2A                  96
     C           *IN96     IFEQ *OFF
     C           ACODRN    ANDEQIODRN
     C           ACMHN     ANDEQIMHN
     C           ACBIN     ANDNE01
     C                     Z-ADDACBIN     K@BIN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *===================================================
      * INITIAL SETTING
      *===================================================
     C           *INZSR    BEGSR
     C*
     C                     TIME           WSSDT
     C                     Z-ADDWSSDAT    WTODAY  80
     C*
     C                     ENDSR
      *---------------------------------------------------
** TB1.TB2
3347TMMK
0541NUMMI
3503TMMC
**
ORDER NO.
FRS NO.
MANIFEST#:
ASN #    :
SHIPPER# :
KANBAN NO.
**
 ** FORD RETURNABLE **
 ** FORD BOX **
 ** IAF RETURNABLE **
 ** IAF BOX **
 ** JATM RETURNABLE **
**
PLANNED SHIP DATE & TIME:
