     H            Y.
     F** ACAR12 ****************************************
     F*   A-PICSTRANSMISSION POINT JUDGMENT M/F LIST *
     F*  PROGRAM ID.    :  ACAR12.      <RPG>          *
     F*  CREATE DATE.   :  JUN.06,'89.                 *
     F*  AUTHOR.        :  G.B.C. <E.KAWASHIMA>        *
     F********************************** ACAR12 ********
     FACAPL12 IP  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F      80     OF     PRINTER
     E                    MID     1   1 38
     E                    KBN     1   4  1   KNM    18   f]ﾌﾞ]ﾆｬﾓb
     IACAPL121    01
     I                                              I1BMONL1
     I            DS
     I                                        1   80I1SKHZ
     I                                        1   40I1SKYY
     I                                        5   60I1SKMM
     I                                        7   80I1SKDD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1  14 HIN
     I                                        1   5 HIN1
     I                                        6   6 HINA
     I                                        7  11 HIN2
     I                                       12  12 HINB
     I                                       13  14 HIN3
     C******************************************************
     C*  START PROGRAM  <ACAR12>                           *
     C******************************************************
     C  N01                GOTO @END
     C*
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     GOTO @END
     C                     END
     C*
B001 C           *IN90     IFEQ '0'
     C                     MOVEL'1'       *INOF
     C                     MOVEA'1'       *IN,90
     C                     Z-ADD0         CNT     40
E001 C                     END
     C******************************************************
     C*  LET'S  PRINT-OUT                                  *
     C******************************************************
B001 C           *INOF     IFEQ '1'
     C                     TIME           TIME    60
     C                     Z-ADD*DATE     DAY     80
     C                     MOVELMID,1     COM1   38
     C                     ADD  1         CNT
     C                     MOVE *BLANK    BNNM   16
     C           I1BMON    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,10
     C                     END
     C                     END
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    BNNM
     C                     END
     C                     MOVELI1BMON    BMON    4
     C*
     C                     EXCPTHED
     C                     MOVEL'0'       *INOF
E001 C                     END
     C*
     C                     MOVE *BLANK    SRENM  16
     C           I1SIRE    CHAINFGBPL011             20
     C           *IN,20    IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
     C                     END
     C           *IN,20    IFEQ '0'
     C                     MOVELB2SMEI    SRENM
     C                     END
     C                     MOVELI1SIRE    SRE     4
     C*
     C                     MOVE *BLANK    KCDNM  18
     C                     MOVEA'0'       *IN,30
     C                     Z-ADD1         A       10
     C           I1KCD1    LOKUPKBN,A                    30
     C   30                MOVELKNM,A     KCDNM
     C                     MOVELI1KCD1    KCD     1
     C*
     C                     MOVE *BLANK    HIN
     C                     MOVELI1SHN1    HIN1
     C                     MOVELI1SHN2    HIN2
     C                     MOVELI1SHN3    HIN3
     C           HIN2      IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
     C*
     C           HIN3      IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
     C*
     C                     EXCPTDET
     C*
     C           @END      TAG
     C*
     CL1                   MOVEL'1'       *INOF
     C*
     C*
     C*
     OQPRINT  E   03           HED
     O                                   57 'TIME'
     O                         TIME      67 '  :  :  '
     O        E   04           HED
     O                                   57 'DATE'
     O                         DAY   Y   67
     O        E   05           HED
     O                         COM1      53
     O                                   63 'PAGE'
     O                         CNT   Z   67
     O        E   07           HED
     O                         BMON   B   4
     O                         BNNM   B  22
     O        E   0911         HED
     O                                    8 'SUPPLIER'
     O                                   21 'SUPPLIER NAME'
     O                                   47 'KANBAN KIND LARGE'
     O                                   76 'INTRAL COMPANY PART NO'
     O        E  1             DET
     O                         SRE    B   7
     O                         SRENM  B  26
     O                         KCD    B  33
     O                         KCDNM  B  54
     O                         HIN    B  75
**  <MID>
 TRANSMISSION POINT JUDGMENT M/F LIST
**  KBN､KNM
0 COMPLETED KANBAN
C PLATING KANBAN
D TUNNEL KANBAN
E PICK-UP KANBAN
