     H            Y.
     F** ACER01 ******************************
     F*   ..材料名マスター　データ作成..   *
     F*  CREATE MATERIAL MASTER
     F*        I-HASADA      00.06.12        *
     F****************************** ACER01 **
     FFCETL06 IP  E           K        DISK
     FACEPP01 O   E                    DISK
     IFCETL061    01
     I                                              A2ZAICL1
     C           *INL1     IFEQ '1'
     C                     MOVE A2ZAIC    AEZAIC
     C                     MOVE A2ZANM    AEZANM
     C                     WRITEACEPP011
     C                     END
