     H            Y.
     F** ACHR07 *********************************************
     F*調整理由ファイルの削除                             *
     F*       ITS.                 2012.05.15               *
     F*******************************************************
     FACHWP01 UF  E           K        DISK
      *
     I           SDS
     I                                        1  10 PGMNM
     I                                       91 170 MSGTXT
     I                                      244 253 WSID
     I                                      254 263 USID
     I                                      264 269 JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           PIJBN1  1
     C                     PARM           PIJBN2  2
     C                     PARM           PIJBN3  2
     C                     PARM           PIJBN4  1
     C                     PARM           PIUKYY  40
     C                     PARM           PIUKMM  20
     C                     PARM           PIUKDD  20
     C                     PARM           PIUBIN  20
      *
     C                     MOVE PIJBN1    E@JBN1  1
     C                     MOVE PIJBN2    E@JBN2  2
     C                     MOVE PIJBN3    E@JBN3  2
     C                     MOVE PIJBN4    E@JBN4  1
     C                     Z-ADDPIUKYY    E@UKYY  40
     C                     Z-ADDPIUKMM    E@UKMM  20
     C                     Z-ADDPIUKDD    E@UKDD  20
     C                     Z-ADDPIUBIN    E@UBIN  20
     C                     MOVE WSID      E@JOBM 10
     C                     MOVE USID      E@USER 10
     C                     MOVE JBNO      E@WNBR  6
     C                     Z-ADD*DATE     E@DATE  80
      *
     C           KEYZ11    KLIST
     C                     KFLD           E@JBN1
     C                     KFLD           E@JBN2
     C                     KFLD           E@JBN3
     C                     KFLD           E@JBN4
     C                     KFLD           E@UKYY
     C                     KFLD           E@UKMM
     C                     KFLD           E@UKDD
     C                     KFLD           E@UBIN
     C                     KFLD           E@JOBM 10
     C                     KFLD           E@USER 10
     C                     KFLD           E@WNBR  6
     C                     KFLD           E@DATE  80
      *
     C           KEYZ11    CHAINACHWP01              55
     C           *IN55     IFEQ '0'
     C                     DELETACHWP011
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
