     H            Y.
     F** ADAR1A ******************************************************
     F*つるべ生産指示 ( AU#PP91--->ADAWP1A AU#PP95 )
     F*  2020.07.13
     F****************************************************** ADAR1A **
     FAU#PP91 UP  E                    DISK
     FBTAPL21 UF  E           K        DISK                      A
     FAGAPL41 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAUBPL41 IF  E           K        DISK
     FBTAPL31 IF  E           K        DISK
     FADAWP1A O   F     200            DISK                      A
     FAU#PP95 O   E                    DISK                      A
     FADAPR11 O   E             20     PRINTER                        UC
     E                    MSG     1   3 42               d[ｰ xｮﾈｰﾆﾞ
     E                    TAB1    1   2  1   TAB2   10   ﾉcﾍ]ﾆｭ hﾎﾞ]
     I            DS
     I                                        1   5 UHIN3
     I                                        1   2 UHIN3X
     I            DS
     I                                        1   80DYMD
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
     I            DS
     I                                        1   80CQKOHZ
     I                                        1   40CQKOYY
     I                                        5   60CQKOMM
     I                                        7   80CQKODD
     I            DS
     I                                        1   60KTIME
     I                                        1   40CQKOTI
     I                                        1   20CQKOHH
     I                                        3   40CQKOSS
     I                                        5   60CQKOZZ
     I            DS
     I                                        1   80MKRYMD
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     I            DS
     I                                        1   80CQTHHZ
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80A2UYMD
     I                                        1   40A2UTYY
     I                                        5   60A2UTMM
     I                                        7   80A2UTDD
     I            DS
     I                                        1   80CESKHZ
     I                                        1   40CESKYY
     I                                        5   60CESKMM
     I                                        7   80CESKDD
     I            DS
     I                                        1   80CESTHZ
     I                                        1   40CESTYY
     I                                        5   60CESTMM
     I                                        7   80CESTDD
     I            DS
     I                                        1   80CEENHZ
     I                                        1   40CEENYY
     I                                        5   60CEENMM
     I                                        7   80CEENDD
     I            DS
     I                                        1   60HMS
     I                                        1   20HOUR
     I                                        3   40MINUTE
     I                                        5   60SECOND
     I            DS
     I                                        1  140WTIME
     I                                        7  140WUDATE
     I            DS
     I                                        1   80BVSKHZ
     I                                        1   40BVSKYY
     I                                        5   60BVSKMM
     I                                        7   80BVSKDD
     I            DS
     I                                        1   80BVKOHZ
     I                                        1   40BVKOYY
     I                                        5   60BVKOMM
     I                                        7   80BVKODD
     I            DS
     I                                        1   60BVTIME
     I                                        1   20BVKOHH
     I                                        3   40BVKOSS
      *
     C           KEY1      KLIST
     C                     KFLD           CQSHN1
     C                     KFLD           CQSHN2
     C                     KFLD           CQSHN3
      *
     C           KEY2      KLIST
     C                     KFLD           CQSHN1
     C                     KFLD           CQSHN2
     C                     KFLD           CQSHN3
     C                     KFLD           CQTOKU
     C                     KFLD           CQTKOJ
     C                     KFLD           CQTUKE
     C                     KFLD           CQNONY
     C                     KFLD           CQNKOJ
     C                     KFLD           CQNUKE
      *
     C           *ENTRY    PLIST
     C                     PARM           PHZKB   1
     C                     PARM           PUS    10
     C                     PARM           PHM     4
      *
     C           *IN,90    IFEQ '0'
     C                     Z-ADD0         ZR02    20
     C                     Z-ADD0         CNT     50
     C                     MOVE *BLANK    PSW     1
     C                     MOVEA'1'       *IN,20
     C                     MOVEA'1'       *IN,90
     C                     END
      *
     C                     TIME           WTIME
      *
     C                     Z-ADD*DATE     @UDATE  80
      *
     C           CQSKJY    CABEQ'D'       @END
      *
     C           KEY1      CHAINAGAPL411             10
     C           *IN10     IFEQ '1'
     C                     MOVE @UDATE    DYMD
     C                     MOVE @UDATE    CQKOHZ
     C                     MOVE 'D'       CQSKJY
     C                     TIME           KTIME
     C           PHM       IFEQ '2400'
     C                     Z-ADD000000    KTIME
     C                     END
     C                     UPDATAU#PP911
     C                     GOTO @END
     C                     END
      *
     C           CBSKJY    IFNE *BLANK
     C           CBSKHZ    IFLE @UDATE
     C                     MOVE @UDATE    DYMD
     C                     MOVE @UDATE    CQKOHZ
     C                     MOVE 'D'       CQSKJY
     C                     TIME           KTIME
     C           PHM       IFEQ '2400'
     C                     Z-ADD000000    KTIME
     C                     END
     C                     UPDATAU#PP911
     C                     GOTO @END
     C                     END
     C                     END
      *
     C           KEY2      CHAINAUBPL411             10
     C           *IN,10    IFEQ '0'
     C           CESKJY    IFEQ 'D'
     C           CESKHZ    ANDLE@UDATE
     C                     ELSE
      *
     C           MKRYMD    IFGE CESTHZ
     C           MKRYMD    ANDLECEENHZ
     C                     MOVE @UDATE    DYMD
     C                     MOVE @UDATE    CQKOHZ
     C                     MOVE 'D'       CQSKJY
     C                     TIME           KTIME
     C           PHM       IFEQ '2400'
     C                     Z-ADD000000    KTIME
     C                     END
     C                     UPDATAU#PP911
     C                     GOTO @END
     C                     END
     C                     END
     C                     END
      *
     C           CQGYOM    IFEQ '04'
     C                     MOVE @UDATE    DYMD
     C                     MOVE @UDATE    CQKOHZ
     C                     MOVE 'D'       CQSKJY
     C                     TIME           KTIME
     C           PHM       IFEQ '2400'
     C                     Z-ADD000000    KTIME
     C                     ENDIF
     C                     UPDATAU#PP911
     C                     GOTO @END
     C                     ENDIF
      *
     C                     ADD  1         CNT
     C           CQTHHZ    IFLT @UDATE
     C                     MOVE @UDATE    CQTHHZ
     C                     END
     C           MKRYMD    IFLT @UDATE
     C                     MOVE @UDATE    MKRYMD
     C                     END
      *
     C*
     C*  ﾎﾞﾍ] uﾇjｰ CHECK
     C*
     C                     MOVE *BLANK    ERSW    1
     C                     MOVE *BLANK    ERR    42
     C           KEY1      CHAINFCEPL011             10
     C           *IN,10    IFEQ '1'
     C                     Z-ADD0         A2UYMD
     C                     MOVELMSG,1     ERR
     C                     MOVEL'*'       ERSW
     C                     ELSE
      *
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    IFLE @UDATE
     C                     MOVELMSG,2     ERR
     C                     MOVEL'*'       ERSW
     C                     ELSE
      *
     C           A2TEHI    IFNE 'G'
     C                     MOVELMSG,3     ERR
     C                     MOVEL'*'       ERSW
     C                     END
     C                     END
     C                     ELSE
      *
     C           A2TEHI    IFNE 'G'
     C                     MOVELMSG,3     ERR
     C                     MOVEL'*'       ERSW
     C                     END
     C                     END
     C                     END
      *
     C*
     C*  ﾎﾞﾍ] uﾇjｰ UN-MATCH LIST
     C*
     C           ERSW      IFNE *BLANK
     C           PSW       IFEQ *BLANK
     C                     OPEN ADAPR11
     C                     MOVEL'*'       PSW
     C                     END
      *
     C           *IN,20    IFEQ '1'
     C                     WRITEHED
     C                     MOVEA'0'       *IN,20
     C                     END
      *
     C                     MOVE *BLANK    NOKU
     C           CQSKKB    LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      NOKU
     C                     WRITEDET
     C                     GOTO @END
     C                     END
      *
     C                     Z-ADDCBMBMN    CQBMON  40
     C                     MOVE @UDATE    DYMD
     C                     MOVE 'D'       CQSKJY
     C                     TIME           KTIME
     C           PHM       IFEQ '2400'
     C                     Z-ADD000000    KTIME
     C                     END
      *
     C                     UPDATAU#PP911
      *
     C                     TIME           HMS
     C                     Z-ADDHOUR      CQSKHH
     C                     Z-ADDMINUTE    CQSKSS
      *
     C                     WRITEAU#PP951
      *
     C*
     C*  A-PICSf]ﾌﾞ] ibfhﾌｮﾃc kｭcﾈbuﾇjｰ
     C*
     C                     SETOF                     11
     C           KEY1      CHAINBTAPL311             11
     C           *IN11     IFEQ '0'
     C           BTSKJY    ANDEQ'D'
     C           BTSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '1'
     C                     MOVELCQNOCR    WNOCR   7
     C                     EXCPTF01
     C                     ELSE
      *
     C*
     C*  A-PICSf]ﾌﾞ] ibfhﾌｮﾃc kｭcﾈbﾇcﾒｭc ﾎｦbﾓ
     C*
     C                     SETOF                     12
     C           KEY1      CHAINBTAPL211             12
     C           *IN12     IFEQ '1'
     C                     Z-ADD0         BVTHSU
     C                     END
      *
     C                     MOVE *BLANK    BVSKJY
     C                     Z-ADD0         BVSKHZ
     C                     Z-ADD*DATE     BVKOHZ
     C                     TIME           BVTIME
     C                     MOVELPUS       BVKOME
     C                     MOVE CQSHN1    BVSHN1
     C                     MOVE CQSHN2    BVSHN2
     C                     MOVE CQSHN3    BVSHN3
     C                     ADD  CQSRYO    BVTHSU
      *
     C           *IN12     IFEQ '1'
     C                     WRITEBTAPL211
     C                     ELSE
     C                     UPDATBTAPL211
     C                     END
     C                     END
      *
     C  NU1                SETON                     U1
     C           @END      TAG
      *
     CLR         PSW       IFEQ *BLANK
     CLR                   CLOSEADAPR11
     CLR                   END
      *
     OADAWP1A EADD             F01
     O                                    1 ' '
     O                         CQTOKU     5
     O                         CQTKOJ     6
     O                         CQTUKE    10
     O                         CQNONY    14
     O                         CQNKOJ    15
     O                         CQNUKE    19
     O                         CQMHN1    24
     O                         CQMHN2    29
     O                         CQMHN3    34
     O                         CQSHN1    39
     O                         CQSHN2    44
     O                         CQSHN3    46
     O                         CQBMON    50
     O                         CQKJYN    51
     O                         CQKOBI    53
     O                         CQSEBN    57
     O                         CQSKKB    58
     O                         CQHAKO    61
     O                         CQSYUY    66
     O                         CQTHAI    67
     O                         CQKANR    77
     O                         WNOCR     84
     O                         CQSRYO    91
     O                         CQSRYO    98
     O                         CQBNKA    99
     O                                  101 '01'
     O                                  103 '01'
     O                         CQTHYY   107
     O                         CQTHMM   109
     O                         CQTHDD   111
     O                         CQTHJI   113
     O                         CQTHPN   115
     O                         CQSBKJ   116
     O                         CQSBRO   118
     O                         CQSBRT   120
     O                         CQSBDN   121
     O                         CQCIC1   123
     O                         CQCIC2   125
     O                         CQCIC3   127
     O                         CQNOYY   131
     O                         CQNOMM   133
     O                         CQNODD   135
     O                         CQNOBB   137
     O                         CQGYOM   139
     O                         CQDTSY   140
     O                         CQDTSO   141
     O                         CQURYY   145
     O                         CQURMM   147
     O                         CQURDD   149
     O                         CQURJI   151
     O                         CQURPN   153
     O                         CQJTNO   160
      *
**  MSG (ERROR MESSAGE )
NO PART M/F                                                 1
PART M/F DELETED                                            2
STANDARD FIXED F WITH N_VOL PROD DAT EXIST                  3
**  TAB1 / TAB2 ( STATEMENT OF DELV INST )
K KANBAN                                                    1
S INST                                                      2
