     H            Y.
     F** ADAR59 ******************************
     F* .. INPUT PRODUCTION ORDER AGAIN AND OVER MADE DATA.. *
     F* .. NEW *
     F* I-HASADA              91.03.19       *
     F*
     F* TCHK1 10/03/08 CHG DATE OPERATION
     F* TCHK2 10/03/08 ADD ERROR CHECK FOR ADAPW597 RTN
     F* TCHK3 10/03/08 RMV CHECK DEGIT FOR ADAPW597 RTN
     F* TCHK4 08/24/12 CHG DUPLICATE CHECK PREVIOUS 2 MONTH
JW1  F*--------------------------------------------------------*
JW1  F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                  *
JW1  F*--------------------------------------------------------*
JW1  F* 2015/10/23 | JW (SRA)    | JW1 | UPDATE NZUPL01        *
     F* 2025/01/28 | LEC         | ADD QR CODE LOGIC           *
     F************************************************ ADAR59 **
     FADAPW59 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FGHCTL21 IF  E           K        DISK
     FGHCPL21 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCETL11 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FCABPL01 IF  E           K        DISK
     FADAPL01 UF  E           K        DISK                      A
     FADAPL20 UF  E           K        DISK                      A
     FADAPP77 UF  E           K        DISK                      A
     FAUDPPNO UF  E                    DISK                      A
     FAU#PP11 O   E           K        DISK                      A
     FIU#PP11 O   E           K        DISK                      A
JW1  FNZUPL01 UF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER                        UC
      *********
     FAGAPL41 IF  E           K        DISK
     FADAPL90 UF  E           K        DISK                      A
     FADAPP95 UF  E           K        DISK                      A
     FAU#PP91 O   E           K        DISK                      A
     FAUDPPNA UF  E                    DISK                      A
     FNZUPP20 UF  E           K        DISK
      *********
     E                    TB1     1   2  1   TB2    28   mﾞｰjhﾎﾞ]
     E                    TAB3    1  43  1   TAB4    2 0 kｩｮh mﾞﾆﾞｮn
TCHK2E                    ER      1  24 60               d[ｰ xｮﾈｰﾆﾞ
     E                    #BAR    1   6  5               ﾌﾟﾇﾝｰnﾞ
TCHK2E                    PER     1   5 55               d[ｰﾒﾇn
     E                    TBL     1   1 54               vjﾞﾆ
     E                    CKKB       15  3               ﾆ]  gﾌﾞ]
     E                    CKBM       15  4 0                 ﾎﾞy]
     E                    CKKO       15  3                   ﾃcmb
     E                    CKTR       15  6                   nﾃﾜﾌﾞ]k
     E                    CKTY       15  1                   f]ﾌﾞ]
     E                    CKHB       15 12                   品番
      *
     E                    CKQN       15  3               gｬc gﾌﾞ]
     E                    CKQB       15  4 0                 ﾎﾞy]
     E                    CKQK       15  3                   ﾃcmb
     E                    CKQR       15  6                   nﾃﾜﾌﾞ]k
     E                    CKQS       15  1                   f]ﾌﾞ]
     E                    CKQH       15 12                   品番
     E                    CKHZ       15 10 0             gﾒfdﾍﾞ
     E                    #BMN       15  4 0             ﾎﾞy]
     E                    #KOT       15  3               ﾃcmb
     E                    #KBN       15  3               gﾌﾞ]
     E                    #TKR       15  6               nﾃﾜﾌﾞ]k
     E                    #KAN       15  1               f]ﾌﾞ] ﾆｬﾓb
     E                    #HIZ       15 10 0             gﾒfdﾍﾞ
     E                    #HIN       15 12                   品番
     E                    BARX       15  1               BARCODE
     E                    XXX        14  2 0             BARCODE
     I            DS
     I                                        1  45 CKKB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  600CKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  45 CKKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 CKTR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 CKTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 CKQN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  600CKQB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  45 CKQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  90 CKQR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 CKQS
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1 1500CKHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     ****************************************
     I            DS
     I                                        1 180 CKHB
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1 180 CKQH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     ****************************************
     I            DS
     I                                        1  12 @HIN
     I                                        1   5 @HIN1
     I                                        6  10 @HIN2
     I                                       11  12 @HIN3
     I            DS
     I                                        1  14 HHIN
     I                                        1   5 HHIN1
     I                                        6   6 H1
     I                                        7  11 HHIN2
     I                                       12  12 H2
     I                                       13  14 HHIN3
     I            DS
     I                                        1   6 @TKR
     I                                        1   1 @TKR1
     I                                        2   3 @TKR2
     I                                        4   5 @TKR3
     I                                        6   6 @TKR4
     I            DS
     I                                        1   9 HTKR
     I                                        1   1 HTKR1
     I                                        2   2 T1
     I                                        3   4 HTKR2
     I                                        5   5 T2
     I                                        6   7 HTKR3
     I                                        8   8 T3
     I                                        9   9 HTKR4
     I            DS
     I                                        1   60WTIME
     I                                        1   40WHS
TCHK1I* SYSTEM TIME
TCHK1I            DS
TCHK1I                                        1  140WSDT
TCHK1I                                        1   20WSSHHH
TCHK1I                                        3   40WSSNNN
TCHK1I                                        5   60WSSSSS
TCHK1I                                        7  100WSSYYY
TCHK1I                                       11  120WSSMMM
TCHK1I                                       13  140WSSDDD
TCHK1I                                        1   40WSSTM4
TCHK1I                                        1   60WSSTM6
TCHK1I                                        7  140WSSDAT
TCHK1I                                        9  140WSSDT6
     I            DS
     I                                        1  14 MHIN
     I                                        1   5 MHIN1
     I                                        6   6 MHINA
     I                                        7  11 MHIN2
     I                                       12  12 MHINB
     I                                       13  14 MHIN3
     I            DS
     I                                        1  14 HIN
     I                                        1   5 HIN1
     I                                        6   6 HINA
     I                                        7  11 HIN2
     I                                       12  12 HINB
     I                                       13  14 HIN3
     I            DS
     I                                        1   40BARYY
     I                                        4   40BAROSR
     I            DS
     I                                        1  15 BAR
     I                                        1   1 #KSN
     I                                        2   5 #ZETI
     I                                        6   8 #TENO
     I                                        9  10 #PNO
     I                                       13  13 #BAR13
     I                                       15  15 #CD
     I            DS
     I                                        1  15 BARX
     I                                        1   1 BR01
     I                                        2   2 BR02
     I                                        3   3 BR03
     I                                        4   4 BR04
     I                                        5   5 BR05
     I                                        6   6 BR06
     I                                        7   7 BR07
     I                                        8   8 BR08
     I                                        9   9 BR09
     I                                       10  10 BR10
     I                                       11  11 BR11
     I                                       12  12 BR12
     I                                       13  13 BR13
     I                                       14  14 BR14
     I                                       15  15 BR15
     I            DS
     I                                        1  15 BAR@@
     I                                        1   1 KSN@@
     I                                        2   5 ZETI@@
     I                                        6   8 TENO@@
     I                                        9  11 PNO@@
     I                                        9  10 PAG@@
     I                                       15  15 CD@@
     I            DS
     I                                        1  15 BAR##
     I                                        1   1 BAR01
     I                                        2   2 BAR02
     I                                        3   3 BAR03
     I                                        4   4 BAR04
     I                                        5   5 BAR05
     I                                        6   6 BAR06
     I                                        7   7 BAR07
     I                                        8   8 BAR08
     I                                        9   9 BAR09
     I                                       10  10 BAR10
     I                                       11  11 BAR11
     I                                       12  12 BAR12
     I                                       13  13 BAR13
     I                                       14  14 BAR14
     I                                       15  15 BAR15
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80ADKOHZ
     I                                        1   40ADKOYY
     I                                        5   60ADKOMM
     I                                        7   80ADKODD
     I            DS
      ********                                1   60XTIME
     I                                        1   40XTIME
     I                                        1   20ADKOJI
     I                                        3   40ADKOPN
     I            DS
     I                                        1   80CKSKHZ
     I                                        1   40CKSKYY
     I                                        5   60CKSKMM
     I                                        7   80CKSKDD
     I            DS
     I                                        1   6 XXTKR
     I                                        1   1 XXTKR1
     I                                        2   3 XXTKR2
     I                                        4   5 XXTKR3
     I                                        6   6 XXTKR4
     I            DS
     I                                        1  100YMDB
     I                                        1   40UKYY
     I                                        5   60UKMM
     I                                        7   80UKDD
     I                                        9  100UKBB
     I            DS
     I                                        1   80A3SKHZ
     I                                        1   40A3SKYY
     I                                        5   60A3SKMM
     I                                        7   80A3SKDD
     I            DS
     I                                        1   80O4SKHZ
     I                                        1   40O4SKYY
     I                                        5   60O4SKMM
     I                                        7   80O4SKDD
     I            DS
     I                                        1   80CQKOHZ
     I                                        1   40CQKOYY
     I                                        5   60CQKOMM
     I                                        7   80CQKODD
     I            DS
     I                                        1   60CQKOTI
     I                                        1   20CQKOHH
     I                                        3   40CQKOSS
     I            DS
     I                                        1   80CQTHHZ
     I                                        1   40CQTHYY
     I                                        5   60CQTHMM
     I                                        7   80CQTHDD
     I            DS
     I                                        1   60CQTHTI
     I                                        1   20CQTHJI
     I                                        3   40CQTHPN
     I            DS
     I                                        1   80CQNOHZ
     I                                        1   40CQNOYY
     I                                        5   60CQNOMM
     I                                        7   80CQNODD
     I            DS
     I                                        1   80CQURHZ
     I                                        1   40CQURYY
     I                                        5   60CQURMM
     I                                        7   80CQURDD
     I            DS
     I                                        1   60CQURTI
     I                                        1   20CQURJI
     I                                        3   40CQURPN
     I            DS
     I                                        1  10 WUS
     I                                        1   2 WUSN1
     I                                        1   5 WUSNAM
TCHK4I            DS
TCHK4I                                        1   80W@DT2M
TCHK4I                                        1   40W@DTYY
TCHK4I                                        5   60W@DTMM
TCHK4I                                        7   80W@DTDD
     I            DS
     I                                        1  12 $HIN
     I                                        1   5 $HIN1
     I                                        6  10 $HIN2
     I                                       11  12 $HIN3
     I            DS
     I                                        1   6 M7MBN@
     I                                        1   1 M7MBN1
     I                                        2   3 M7MBN2
     I                                        4   5 M7MBN3
     I                                        6   6 M7MBN4
     I*------------------------------------------*
     I*   fﾞx] Iﾆﾑcﾆｭ INFDS ﾉ mbgﾞ               *
     I*------------------------------------------*
     IFEEDBK      DS
     I                                     *STATUS  @STTS
      *
      *---------------------------------------------------------
JW1  I           SDS
JW1  I                                        1   8 #PGM
JW1  I                                      244 253 #WSID
JW1  I                                      254 263 #USER
     C******************************************************
     C*  START  PROGRAM  <ADAR60>                          *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C                     MOVE US        WUS
      *
      * ﾎﾟﾜhﾞ[w呼び出しﾌﾟ[xｰjｰ *
     C           ACALL     PLIST
     C                     PARM           WUS              ﾏｰﾅﾞｰ ﾃｰnﾞ
     C                     PARM           C3SHN1           品番・１
     C                     PARM           C3SHN2           　　・２
     C                     PARM           C3SHN3           　　・３
     C                     PARM           @MAIS            枚数
     C                     PARM           @KBN             mﾞｰj区分
     C                     PARM           @ZOUGN           増減数
     C                     PARM           @BAR             ﾌﾞｰﾃｰnﾞ区分
     C                     PARM           BAR@@            ﾌﾞｰﾃｰnﾞ
     C                     PARM           @GYM             業務区分
      *
     C           KEY1      KLIST
     C                     KFLD           @HIN1
     C                     KFLD           @HIN2
     C                     KFLD           @HIN3
      *
     C           KEY2      KLIST
     C                     KFLD           @TKR1
     C                     KFLD           @TKR2
     C                     KFLD           @TKR3
     C                     KFLD           @TKR4
      *
     C           KEY3      KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           KEY4      KLIST
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
      *
     C           KEY5      KLIST
     C                     KFLD           KSN@@
     C                     KFLD           ZETI@@
     C                     KFLD           TENO@@
     C                     KFLD           PNO@@
     C                     KFLD           KDTKB
      *
     C           KEY6      KLIST
     C                     KFLD           XXTKR1
     C                     KFLD           XXTKR2
     C                     KFLD           XXTKR3
     C                     KFLD           XXTKR4
     C                     KFLD           UKYY
     C                     KFLD           UKMM
     C                     KFLD           UKDD
     C                     KFLD           UKBB
      *
     C           KEY7      KLIST
     C                     KFLD           WYEAR
     C                     KFLD           WMONTH
     C                     KFLD           WDAY
      *
     C           KEY8      KLIST
     C                     KFLD           K@JHN1  5
     C                     KFLD           K@JHN2  5
     C                     KFLD           K@JHN3  2
      *
JW1  C           K#NZU     KLIST
JW1  C                     KFLD           N2ZETI
JW1  C                     KFLD           N2TEHI
JW1  C                     KFLD           N2PAGN
      *
JW1  C                     Z-ADD*DATE     @DATE   80
JW1  C                     TIME           @TIME   60
      *
     C                     Z-ADD*YEAR     WYEAR   40
     C                     Z-ADDUMONTH    WMONTH  20
     C                     Z-ADDUDAY      WDAY    20
TCHK4C*
TCHK4C                     TIME           WSDT
TCHK4C                     Z-ADDWSSDAT    W@DT2M
TCHK4C                     SUB  2         W@DTMM
TCHK4C           W@DTMM    IFLE *ZERO
TCHK4C                     ADD  12        W@DTMM
TCHK4C                     SUB  1         W@DTYY
TCHK4C                     END
      *
     C*------------------*
     C*  ..第１画面..  *
     C*------------------*
     C                     Z-ADD0         YOMISU
     C                     Z-ADD0         KENSU
      *
     C           AP1       TAG
     C                     EXFMTADAPW591
     C                     SETOF                     010203
     C                     SETOF                     051011
     C                     SETOF                     2299
     C                     MOVE *BLANK    THIN
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @TKR
     C                     MOVE *BLANK    ZTKR
     C                     MOVE *BLANK    ZHIN
     C                     Z-ADD0         ZMIS
      *
     C           *INKA     IFEQ '1'
     C           *IN71     IFEQ '1'
     C                     EXCPTTR
     C                     CLOSEQPRINT
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKF     IFEQ '1'
     C                     EXFMTADAPW596
     C           *INKC     IFEQ '1'
     C                     GOTO AP1
     C                     END
     C                     END
      *
     C           *INKI     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
      *
     C           *INKK     IFEQ '1'
     C                     SETON                     72
     C                     GOTO AP1
     C                     END
      *
     C           *INKL     IFEQ '1'
     C                     SETON                     LRU2
     C                     RETRN
     C                     END
      *
     C           @KBN      IFNE '1'
     C           @KBN      ANDNE'2'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO AP1
     C                     END
      *
     C                     SETOF                     12
     C                     Z-ADD1         A       20
3    C                     MOVE *BLANK    @KNM
     C           @KBN      LOKUPTB1,A                    12
     C           *IN12     IFEQ '1'
     C                     MOVE TB2,A     @KNM
     C                     END
      *
     C           @INP      IFNE '1'
     C           @INP      ANDNE'2'
     C           @INP      ANDNE'3'
     C           @INP      ANDNE'4'
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO AP1
     C                     END
     C*
     C                     MOVE *BLANK    @WINDL
     C           @INP      IFEQ '3'
     C           @INP      OREQ '4'
     C                     MOVE 'WINDLASS'@WINDL
     C                     ENDIF
      *
     C           *IN72     IFEQ '0'
     C           @BAR      IFNE 'B'
     C           @BAR      ANDNE'N'
     C                     SETON                     0399
     C                     MOVE ER,11     MSG
     C                     GOTO AP1
     C                     END
     C                     ELSE
     C           @BAR      IFNE 'Y'
     C           @BAR      ANDNE'N'
     C           @BAR      ANDNE'B'
     C                     SETON                     0399
     C                     MOVE ER,21     MSG
     C                     GOTO AP1
     C                     END
     C                     END
      *
     C           @INP      IFEQ '2'
     C           @INP      OREQ '4'
     C           @BAR      IFEQ 'Y'
     C                     SETON                     020399
     C                     MOVE ER,12     MSG
     C                     GOTO AP1
     C                     END
     C                     END
      *
     C           @GYM      IFNE ' '
     C           @GYM      IFNE 'A'
     C           @GYM      IFNE 'B'
     C                     SETON                     2299
     C                     MOVE ER,19     MSG
     C                     GOTO AP1
     C                     END
     C                     END
     C                     END
      *
     C*------------------*
     C*  ..第２画面..  *
     C*------------------*
     C           @INP      IFEQ '1'
     C           @INP      OREQ '3'
     C           @BAR      IFEQ 'N'
      *
     C           BP1       TAG
     C                     EXFMTADAPW592
     C                     SETOF                     030510
     C                     SETOF                     1199
     C                     MOVE *BLANK    HTKR
      *
     C           *INKA     IFEQ '1'
     C           *IN71     IFEQ '1'
     C                     EXCPTTR
     C                     CLOSEQPRINT
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @INP
     C                     MOVE *BLANK    @BAR
     C                     MOVE *BLANK    @GYM
     C                     GOTO AP1
     C                     END
      *
     C           @HIN      IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO BP1
     C                     END
      *
     C*----------------------------------------*
     C*  ..平準化確定発注累積ファイル......  *
     C*----------------------------------------*
     C                     MOVE *BLANK    SW      1
     C*Ａ－ＰＩＣＳ
     C           @INP      IFEQ '1'
      *
     C           KEY1      CHAINAGAPL311             12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN  40
     C                     Z-ADDCBMMKR    @3MMKR  40
     C                     MOVELCBMLIN    @3MLIN  1
     C                     Z-ADDCBBARL    @3BARL  20
     C                     MOVELCBKDAI    @3KDAI  1
     C                     Z-ADDCBHASU    @3HASU  70
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
      *
     C           KEY1      CHAINAGAPL41              16
     C           *IN16     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     ENDIF
     C           *IN16     IFEQ '0'
     C                     Z-ADDCBMBMN    @4MBMN  40
     C                     Z-ADDCBMMKR    @4MMKR  40
     C                     MOVELCBMLIN    @4MLIN  1
     C                     Z-ADDCBBARL    @4BARL  20
     C                     MOVELCBKDAI    @4KDAI  1
     C                     Z-ADDCBHASU    @4HASU  70
     C                     ELSE
     C                     Z-ADD*ZERO     @4MBMN
     C                     Z-ADD*ZERO     @4MMKR
     C                     MOVEL*BLANK    @4MLIN
     C                     Z-ADD*ZERO     @4BARL
     C                     MOVEL*BLANK    @4KDAI
     C                     Z-ADD*ZERO     @4HASU
     C                     ENDIF
     C                     ENDIF
     C*つるべ生産指示
     C           @INP      IFEQ '3'
      *
     C           KEY1      CHAINAGAPL41              12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     ENDIF
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
     C                     ENDIF
      ***********
      * A-PICS2 *
      ***********
     C           *IN12     IFEQ '1'
     C                     SETOF                     12
     C           KEY1      CHAINCABPL011             12
     C           *IN12     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C                     END
     C*
     C           *IN12     IFEQ '1'
     C                     SETON                     0399
     C                     MOVE ER,17     MSG
     C                     GOTO BP1
     C                     END
     C                     MOVE '*'       SW               *=A-PICS2
     C*
     C                     ENDIF
      **
     C                     MOVE *BLANK    HHIN
     C                     MOVE @HIN1     HHIN1
     C                     MOVE @HIN2     HHIN2
     C                     MOVE @HIN3     HHIN3
     C           HHIN2     IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           HHIN3     IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
     C                     ELSE
      *
      ** ﾌﾞｰﾃｰnﾞ
     C           @BAR      IFEQ 'Y'
     C                     MOVE *BLANK    MBAR
     C                     MOVE *BLANK    MHIN
     C                     Z-ADD0         @SYUY
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         @ZOUGN
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     MOVEL*ALL'-'   SEN
      *
     C           STPX      TAG
     C                     EXFMTADAPW595
     C                     SETOF                     0199
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @INP
     C                     MOVE *BLANK    @BAR
     C                     MOVE *BLANK    @GYM
     C                     GOTO AP1
     C                     END
      *
     C           *INKL     IFEQ '1'
     C                     SETOF                     80
     C                     GOTO STPX
     C                     END
      *
     C           QRBAR     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,13     MSG
     C                     GOTO STPX
     C                     END
      *
      * convert QR code to 1D barcode....
     C                     MOVELQRBAR     KTYPE   3
      *
     C           KTYPE     IFEQ 'C01'
     C           KTYPE     OREQ 'C03'
     C                     MOVELQRBAR     P1QR1 256
     C                     MOVEL*BLANK    P1QR2 256
     C                     MOVEL*BLANK    P9BAR  20
     C                     CALL 'UEXR13'
     C                     PARM           P1QR1
     C                     PARM           P1QR2
     C                     PARM           P9BAR
      *
     C                     MOVELP9BAR     BAR
     C                     MOVEL*BLANK    P9BAR
     C                     ELSE
     C                     MOVELQRBAR     BAR
     C                     ENDIF
     C                     MOVEL*BLANK    QRBAR
      *
     C                     ADD  1         YOMISU
      *
     C                     MOVELBAR       XBAR
     C                     MOVEL#ZETI     @@ZETI  4
      **  CD kｩｮh
     C                     Z-ADD0         XXX
     C                     MOVEABAR       BARX
      *
     C                     DO   14        I       20
     C           BARX,I    LOKUPTAB3      TAB4           42
     C   42                Z-ADDTAB4      XXX,I
     C                     END
      *
     C                     Z-ADD0         BARYY
     C                     Z-ADD0         AAAAA
     C           XXX,1     ADD  XXX,2     BARYY
     C                     ADD  XXX,3     BARYY
     C                     ADD  XXX,4     BARYY
     C                     ADD  XXX,5     BARYY
     C                     ADD  XXX,6     BARYY
     C                     ADD  XXX,7     BARYY
     C                     ADD  XXX,8     BARYY
     C                     ADD  XXX,9     BARYY
     C                     ADD  XXX,10    BARYY
     C                     ADD  XXX,11    BARYY
     C                     ADD  XXX,12    BARYY
     C                     ADD  XXX,13    BARYY
     C                     ADD  XXX,14    BARYY
     C           10        SUB  BAROSR    AAAAA   10
     C                     MOVE AAAAA     @AAAA   1
     C           @AAAA     IFNE #CD
      * lbf
     C           BARYY     DIV  43        WSU1    30
      *
     C                     Z-ADD0         WCKD    20
     C           WSU1      IFNE 0
     C           WSU1      MULT 43        WKTE    40
     C           BARYY     SUB  WKTE      WCKD
     C                     ELSE
     C                     Z-ADDBARYY     WCKD
     C                     END
      *
     C                     MOVE *BLANK    WSU2    1
     C           WCKD      LOKUPTAB4      TAB3           43
     C   43                MOVE TAB3      WSU2
      *
     C           #CD       IFNE WSU2
     C                     SETON                     018099
     C                     MOVE ER,16     MSG
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPX
     C                     END
     C                     END
      *
     C                     SETOF                     45
     C                     MOVELBAR       BAR@@
     C           @KBN      IFEQ '1'
     C                     MOVEL'S'       KDTKB   1
     C                     ELSE
     C                     MOVEL'T'       KDTKB
     C                     END
      *
     C           #BAR13    IFGE '0'
     C           #BAR13    ANDLE'9'
     C           KEY5      CHAINADAPL011             45
     C                     ELSE
     C           KEY5      CHAINADAPL901             45
     C                     ENDIF
      *
     C           *IN45     IFEQ '0'
TCHK4C           ADKOHZ    ANDGEW@DT2M
     C                     SETON                     0199
     C                     MOVE ER,15     MSG
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPX
     C                     END
      *
     C                     SETOF                     70
     C           @@ZETI    CHAINFCETL111             70
     C           *IN70     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     70
     C                     END
      *
     C           *IN70     IFEQ '1'
     C                     SETON                     018099
     C                     MOVE ER,14     MSG
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPX
     C                     END
      *
     C                     MOVE *BLANK    HIN
     C                     MOVELA2BHB1    HIN1
     C                     MOVELA2BHB2    HIN2
     C                     MOVELA2BHB3    HIN3
     C           HIN2      IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
      *
     C           HIN3      IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
      *
     C                     MOVEL#ZETI     ZETI
      *
     C*----------------------------------------*
     C*  ..平準化確定発注累積ファイル......  *
     C*----------------------------------------*
     C                     MOVE *BLANK    SW
     C                     SETOF                     12
      **
     C           #BAR13    IFGE '0'
     C           #BAR13    ANDLE'9'
     C*Ａ－ＰＩＣＳ
     C           KEY3      CHAINAGAPL311             12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
      *
     C           KEY3      CHAINAGAPL41              16
     C           *IN16     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     ENDIF
     C           *IN16     IFEQ '0'
     C                     Z-ADDCBMBMN    @4MBMN
     C                     Z-ADDCBMMKR    @4MMKR
     C                     MOVELCBMLIN    @4MLIN
     C                     Z-ADDCBBARL    @4BARL
     C                     MOVELCBKDAI    @4KDAI
     C                     Z-ADDCBHASU    @4HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @4MBMN
     C                     Z-ADD*ZERO     @4MMKR
     C                     MOVEL*BLANK    @4MLIN
     C                     Z-ADD*ZERO     @4BARL
     C                     MOVEL*BLANK    @4KDAI
     C                     Z-ADD*ZERO     @4HASU
     C                     ENDIF
      *
     C                     ELSE
     C*つるべ生産指示
      *
     C           KEY3      CHAINAGAPL41              12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     ENDIF
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
     C                     ENDIF
      ***********
      * A-PICS2 *
      ***********
     C           *IN12     IFEQ '1'
     C                     SETOF                     12
     C           KEY3      CHAINCABPL011             12
     C           *IN12     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C                     END
     C*
     C           *IN12     IFEQ '1'
     C                     SETON                     018099
     C                     MOVE ER,17     MSG
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPX
     C                     END
     C*
     C                     MOVE '*'       SW               *=A-PICS2
     C                     ENDIF
      *
     C                     MOVE *BLANK    MHIN
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     MOVELC3SHN1    MHIN1
     C                     MOVELC3SHN2    MHIN2
     C                     MOVELC3SHN3    MHIN3
     C                     Z-ADDC3SJSU    @SYUY
     C                     ELSE
     C                     MOVELCBSHN1    MHIN1
     C                     MOVELCBSHN2    MHIN2
     C                     MOVELCBSHN3    MHIN3
     C                     Z-ADDCBSYUY    @SYUY
     C                     EXSR #TURU
     C           $$TURU    IFEQ '*'
     C           @BAR      IFEQ 'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C                     Z-ADDA3SSYS    @SYUY
     C                     ENDIF
     C                     ENDIF
     C                     END
      *
     C           MHIN2     IFNE *BLANK
     C                     MOVEL'-'       MHINA
     C                     END
      *
     C           MHIN3     IFNE *BLANK
     C                     MOVEL'-'       MHINB
     C                     END
      *
     C                     MOVELBAR       MBAR
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         @ZOUGN
     C           @KBN      IFEQ '2'
     C                     Z-SUB1         @MAIS
     C           @MAIS     MULT @SYUY     @ZOUGN
     C                     ELSE
     C                     Z-ADD1         @MAIS
     C           @MAIS     MULT @SYUY     @ZOUGN
     C                     END
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     CALL 'CAAR50'  ACALL
     C                     ELSE
      *
     C                     EXSR #KSIN
      *
     C           WUSN1     IFEQ 'A0'
     C                     EXSR #YOMI
     C                     ELSE
      *
     C                     SETOF                     15
     C                     Z-ADD1         E       20
     C           WUSNAM    LOKUP#BAR,E                   15
     C           *IN15     IFEQ '1'
     C                     EXSR #YOMI
     C                     END
     C                     END
      *
     C                     END
     C                     ADD  1         KENSU
      *
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     MOVE *BLANK    HIN
     C                     MOVE *BLANK    XBAR
     C                     MOVE *BLANK    ZETI
     C                     GOTO STPX
     C                     ELSE
      *
      ** ﾒｰjﾞｰ
     C                     MOVE *BLANK    MBAR
     C                     MOVE *BLANK    MHIN
     C                     Z-ADD0         @SYUY
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         @ZOUGN
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     MOVEL*ALL'-'   SEN
      *
TCHK2C                     MOVEL*BLANK    MSG
TCHK2C                     MOVEL*OFF      *IN99
     C           STPXX     TAG
TCHK2C                     EXFMTADAPW597
TCHK2C*
TCHK2C                     MOVEL*BLANK    MSG
TCHK2C                     MOVEL*OFF      *IN99
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @INP
     C                     MOVE *BLANK    @BAR
     C                     MOVE *BLANK    @GYM
     C                     GOTO AP1
     C                     END
      *
     C           QRBAR     IFEQ *BLANK
     C                     GOTO STPXX
     C                     END
      *
      * convert QR code to 1D barcode....
     C                     MOVELQRBAR     KTYPE
      *
     C           KTYPE     IFEQ 'C01'
     C           KTYPE     OREQ 'C03'
     C                     MOVELQRBAR     P1QR1 256
     C                     MOVEL*BLANK    P1QR2 256
     C                     MOVEL*BLANK    P9BAR  20
     C                     CALL 'UEXR13'
     C                     PARM           P1QR1
     C                     PARM           P1QR2
     C                     PARM           P9BAR
      *
     C                     MOVELP9BAR     BAR
     C                     MOVEL*BLANK    P9BAR
     C                     ELSE
     C                     MOVELQRBAR     BAR
     C                     ENDIF
     C                     MOVEL*BLANK    QRBAR
      *
     C                     ADD  1         YOMISU
      *
     C                     MOVELBAR       XBAR
     C                     MOVEL#ZETI     @@ZETI  4
      **  CD kｩｮh
     C                     Z-ADD0         XXX
     C                     MOVEABAR       BARX
      *
     C                     SETOF                     70
     C           @@ZETI    CHAINFCETL111             70
     C           *IN70     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     70
     C                     END
     C           *IN70     IFEQ '1'
TCHK2C                     MOVELER,14     MSG
TCHK2C                     MOVEL*ON       *IN99
     C                     MOVE PER,2     WERR   55
     C                     MOVE *BLANK    A2BHB1
     C                     MOVE *BLANK    A2BHB2
     C                     MOVE *BLANK    A2BHB3
     C                     EXSR SUBPRT
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPXX
     C                     END
      *
     C                     SETOF                     45
     C                     MOVELBAR       BAR@@
     C           @KBN      IFEQ '1'
     C                     MOVEL'S'       KDTKB   1
     C                     ELSE
     C                     MOVEL'T'       KDTKB
     C                     END
     C           KEY5      CHAINADAPL011             45
     C   45      KEY5      CHAINADAPL901             45
     C           *IN45     IFEQ '0'
TCHK4C           ADKOHZ    ANDGEW@DT2M
TCHK2C                     DO   *HIVAL
TCHK2C                     MOVEL*OFF      *INKJ
TCHK2C                     EXFMTADAPW598
TCHK2C   KJ                LEAVE
TCHK2C                     ENDDO
TCHK2C                     MOVELER,22     MSG
TCHK2C                     MOVEL*ON       *IN99
TCHK2C                     MOVE PER,5     WERR
TCHK2C                     EXSR SUBPRT
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPXX
     C                     END
      *
     C                     MOVE *BLANK    HIN
     C                     MOVELA2BHB1    HIN1
     C                     MOVELA2BHB2    HIN2
     C                     MOVELA2BHB3    HIN3
     C           HIN2      IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
      *
     C           HIN3      IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
      *
     C                     MOVEL#ZETI     ZETI
      *
     C*----------------------------------------*
     C*  ..平準化確定発注累積ファイル......  *
     C*----------------------------------------*
     C                     MOVE *BLANK    SW
     C                     SETOF                     12
     C           #BAR13    IFGE '0'
     C           #BAR13    ANDLE'9'
     C*Ａ－ＰＩＣＳ
     C           KEY3      CHAINAGAPL311             12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
      *
     C           KEY3      CHAINAGAPL41              16
     C           *IN16     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     ENDIF
     C           *IN16     IFEQ '0'
     C                     Z-ADDCBMBMN    @4MBMN
     C                     Z-ADDCBMMKR    @4MMKR
     C                     MOVELCBMLIN    @4MLIN
     C                     Z-ADDCBBARL    @4BARL
     C                     MOVELCBKDAI    @4KDAI
     C                     Z-ADDCBHASU    @4HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @4MBMN
     C                     Z-ADD*ZERO     @4MMKR
     C                     MOVEL*BLANK    @4MLIN
     C                     Z-ADD*ZERO     @4BARL
     C                     MOVEL*BLANK    @4KDAI
     C                     Z-ADD*ZERO     @4HASU
     C                     ENDIF
      *
     C                     ELSE
     C*つるべ生産指示
     C                     SETOF                     12
     C           KEY3      CHAINAGAPL41              12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     ENDIF
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
     C                     ENDIF
      ***********
      * A-PICS2 *
      ***********
     C           *IN12     IFEQ '1'
     C                     SETOF                     12
     C           KEY3      CHAINCABPL011             12
     C           *IN12     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C                     END
     C*
     C           *IN12     IFEQ '1'
     C                     MOVE PER,4     WERR
     C                     EXSR SUBPRT
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     GOTO STPXX
     C                     END
     C*
     C                     MOVE '*'       SW               *=A-PICS2
     C                     ENDIF
      *
     C                     MOVE *BLANK    MHIN
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     MOVELC3SHN1    MHIN1
     C                     MOVELC3SHN2    MHIN2
     C                     MOVELC3SHN3    MHIN3
     C                     Z-ADDC3SJSU    @SYUY
     C                     ELSE
     C                     MOVELCBSHN1    MHIN1
     C                     MOVELCBSHN2    MHIN2
     C                     MOVELCBSHN3    MHIN3
     C                     Z-ADDCBSYUY    @SYUY
     C                     EXSR #TURU
     C           $$TURU    IFEQ '*'
     C           @BAR      IFEQ 'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C                     Z-ADDA3SSYS    @SYUY
     C                     ENDIF
     C                     ENDIF
     C                     END
      *
     C           MHIN2     IFNE *BLANK
     C                     MOVEL'-'       MHINA
     C                     END
      *
     C           MHIN3     IFNE *BLANK
     C                     MOVEL'-'       MHINB
     C                     END
      *
     C                     MOVELBAR       MBAR
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         @ZOUGN
     C           @KBN      IFEQ '2'
     C                     Z-SUB1         @MAIS
     C           @MAIS     MULT @SYUY     @ZOUGN
     C                     ELSE
     C                     Z-ADD1         @MAIS
     C           @MAIS     MULT @SYUY     @ZOUGN
     C                     END
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     CALL 'CAAR50'  ACALL
     C                     ELSE
      *
     C                     EXSR #KSIN
      *
     C           WUSN1     IFEQ 'A0'
     C                     EXSR #YOMI
     C                     ELSE
      *
     C                     SETOF                     15
     C                     Z-ADD1         E       20
     C           WUSNAM    LOKUP#BAR,E                   15
     C           *IN15     IFEQ '1'
     C                     EXSR #YOMI
     C                     END
     C                     END
      *
     C                     END
     C                     ADD  1         KENSU
      *
     C                     MOVE *BLANK    BAR
     C                     MOVE *BLANK    QRBAR
     C                     MOVE *BLANK    HIN
     C                     MOVE *BLANK    XBAR
     C                     MOVE *BLANK    ZETI
     C                     GOTO STPXX
      *
     C                     END
     C                     END
     C                     END
      *
     C*------------------*
     C*  ..第３画面..  *
     C*------------------*
     C           @INP      IFEQ '2'
     C           @INP      OREQ '4'
      *
     C           CP1       TAG
     C                     EXFMTADAPW593
     C                     SETOF                     040599
     C                     SETON                     1011
      *
     C           *INKA     IFEQ '1'
     C           *IN71     IFEQ '1'
     C                     EXCPTTR
     C                     CLOSEQPRINT
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    @KBN
     C                     MOVE *BLANK    @INP
     C                     MOVE *BLANK    @BAR
     C                     MOVE *BLANK    @GYM
     C                     GOTO AP1
     C                     END
      *
     C           @TKR      IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,6      MSG
     C                     GOTO CP1
     C                     END
      *
     C*------------------------*
     C*  ..前工程マスター..  *
     C*------------------------*
     C           KEY2      SETLLGHCTL211
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY2      READEGHCTL211                 12
     C           *IN12     IFEQ '0'
     C                     MOVE MDMHN1    @HIN1
     C                     MOVE MDMHN2    @HIN2
     C                     MOVE MDMHN3    @HIN3
     C                     SETON                     12
     C*
     C                     MOVELMDJHN1    K@JHN1
     C                     MOVELMDJHN2    K@JHN2
     C                     MOVELMDJHN3    K@JHN3
     C           KEY8      SETGTGHCPL21
     C                     EXSR #GHCP
     C           @INP      IFEQ '4'
     C                     EXSR #GHCP
     C                     ENDIF
     C           *IN13     IFEQ '1'
     C           *IN13     OREQ '0'
     C           M7MBN@    ANDNE@TKR
     C                     SETON                     0499
     C                     SELEC
     C           @INP      WHEQ '2'
     C                     MOVELER,23     MSG
     C           @INP      WHEQ '4'
     C                     MOVELER,24     MSG
     C                     ENDSL
     C                     GOTO CP1
     C                     ENDIF
     C*
     C                     ELSE
     C                     SETON                     0499
     C                     MOVE ER,7      MSG
     C                     GOTO CP1
     C                     END
     C  N12                END
      *
     C                     MOVE *BLANK    HHIN
     C                     MOVE *BLANK    THIN
     C                     MOVE @HIN1     HHIN1
     C                     MOVE @HIN2     HHIN2
     C                     MOVE @HIN3     HHIN3
     C           HHIN2     IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           HHIN3     IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
     C                     MOVE HHIN      THIN
      *
     C*----------------------------------------*
     C*  ..平準化確定発注累積ファイル......  *
     C*----------------------------------------*
     C                     MOVE *BLANK    SW
     C                     SETOF                     12
     C*Ａ－ＰＩＣＳ
     C           @INP      IFEQ '2'
      *
     C           KEY1      CHAINAGAPL311             12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
      *
     C           KEY1      CHAINAGAPL41              16
     C           *IN16     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     ENDIF
     C           *IN16     IFEQ '0'
     C                     Z-ADDCBMBMN    @4MBMN
     C                     Z-ADDCBMMKR    @4MMKR
     C                     MOVELCBMLIN    @4MLIN
     C                     Z-ADDCBBARL    @4BARL
     C                     MOVELCBKDAI    @4KDAI
     C                     Z-ADDCBHASU    @4HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @4MBMN
     C                     Z-ADD*ZERO     @4MMKR
     C                     MOVEL*BLANK    @4MLIN
     C                     Z-ADD*ZERO     @4BARL
     C                     MOVEL*BLANK    @4KDAI
     C                     Z-ADD*ZERO     @4HASU
     C                     ENDIF
     C                     ENDIF
     C*つるべ生産指示
     C           @INP      IFEQ '4'
      *
     C           KEY1      CHAINAGAPL41              12
     C           *IN12     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     ENDIF
     C           *IN12     IFEQ '0'
     C                     Z-ADDCBMBMN    @3MBMN
     C                     Z-ADDCBMMKR    @3MMKR
     C                     MOVELCBMLIN    @3MLIN
     C                     Z-ADDCBBARL    @3BARL
     C                     MOVELCBKDAI    @3KDAI
     C                     Z-ADDCBHASU    @3HASU
     C                     ELSE
     C                     Z-ADD*ZERO     @3MBMN
     C                     Z-ADD*ZERO     @3MMKR
     C                     MOVEL*BLANK    @3MLIN
     C                     Z-ADD*ZERO     @3BARL
     C                     MOVEL*BLANK    @3KDAI
     C                     Z-ADD*ZERO     @3HASU
     C                     ENDIF
     C                     ENDIF
      ***********
      * A-PICS2 *
      ***********
     C           *IN12     IFEQ '1'
     C                     SETOF                     12
     C           KEY1      CHAINCABPL011             12
     C           *IN12     IFEQ '0'
     C           C3SKJY    IFEQ 'D'
     C           C3SKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     END
     C                     END
     C*
     C           *IN12     IFEQ '1'
     C                     SETON                     0499
     C                     MOVE ER,17     MSG
     C                     GOTO CP1
     C                     END
     C*
     C                     MOVE '*'       SW               *=A-PICS2
     C                     ENDIF
      **
     C                     MOVE *BLANK    HTKR
     C                     MOVE @TKR1     HTKR1
     C                     MOVE @TKR2     HTKR2
     C                     MOVE @TKR3     HTKR3
     C                     MOVE @TKR4     HTKR4
     C           HTKR2     IFNE *BLANK
     C                     MOVE '-'       T1
     C                     END
     C           HTKR3     IFNE *BLANK
     C                     MOVE '-'       T2
     C                     END
     C           HTKR4     IFNE *BLANK
     C                     MOVE '-'       T3
     C                     END
     C                     END
      *
     C           @KBN      IFEQ '2'
     C                     Z-SUB1         @MAIS
     C                     ELSE
     C                     Z-ADD1         @MAIS
     C                     END
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     Z-ADDC3SJSU    @SYUY
     C                     ELSE
     C                     Z-ADDCBSYUY    @SYUY
     C                     EXSR #TURU
     C           $$TURU    IFEQ '*'
     C           @BAR      IFEQ 'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C                     Z-ADDA3SSYS    @SYUY
     C                     ENDIF
     C                     ENDIF
     C                     END
     C                     Z-ADD0         @ZOUGN
      *
     C*------------------*
     C*  ..第４画面..  *
     C*------------------*
     C           DP1       TAG
     C                     EXFMTADAPW594
     C                     SETOF                     061099
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @TKR
     C                     MOVE *BLANK    THIN
     C           @INP      IFEQ '1'
     C           @INP      OREQ '3'
     C                     GOTO BP1
     C                     ELSE
     C                     GOTO CP1
     C                     END
     C                     END
      *
     C           *INKG     IFEQ '1'
     C                     SETON                     05
     C                     END
      *
     C           @MAIS     IFEQ 0
     C                     SETON                     0699
     C                     MOVE ER,10     MSG
     C                     GOTO DP1
     C                     END
      *
     C           @KBN      IFEQ '2'
     C           @MAIS     IFGT 0
     C                     Z-SUB@MAIS     @MAIS
     C                     END
     C                     ELSE
     C           @MAIS     IFLT 0
     C           @MAIS     MULT -1        @MAIS
     C                     END
     C                     END
     C           @MAIS     MULT @SYUY     @ZOUGN
      *
     C  NKE                GOTO DP1
      *
     C                     ADD  1         YOMISU
      *
     C           SW        IFEQ '*'                        *=A-PICS2
     C                     CALL 'CAAR50'  ACALL
     C                     ELSE
     C*
     C                     EXSR #KSIN
      *
     C                     Z-ADD1         E       20
     C                     SETOF                     15
     C           WUSNAM    LOKUP#BAR,E                   15
     C           *IN15     IFEQ '1'
     C                     EXSR #YOMI
     C                     END
     C                     END
     C                     ADD  1         KENSU
      *
     C                     MOVE HHIN      ZHIN
     C                     MOVE HTKR      ZTKR
     C                     Z-ADD@MAIS     ZMIS
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @TKR
     C                     MOVE *BLANK    THIN
     C                     MOVE *BLANK    ZETI
     C           @INP      IFEQ '1'
     C           @INP      OREQ '3'
     C                     GOTO BP1
     C                     ELSE
     C                     GOTO CP1
     C                     END
      *
     C*===================================================*
     C*  #GHCP   GHCPL21 READ                             *
     C*===================================================*
     C           #GHCP     BEGSR
     C*
     C           #GHCP1    TAG
     C*
     C           KEY8      REDPEGHCPL21                  13
     C*
     C           *IN13     CABEQ'1'       #GHCPE
     C*
     C           M7MBN@    IFEQ '++++++'
     C           M7MBN@    OREQ '------'
     C                     GOTO #GHCP1
     C                     ENDIF
     C*
     C           #GHCPE    ENDSR
     C*----------------------------------------------------*
     C           #KSIN     BEGSR                           *
     C*----------------------------------------------------*
      *
TCHK1C                     TIME           WSDT
TCHK1C                     Z-ADDWSSDAT    CQKOHZ
TCHK1C                     Z-ADDWSSTM6    CQKOTI
     C                     MOVELUS        CQKOME
     C                     MOVE CBSHN1    CQSHN1
     C                     MOVE CBSHN2    CQSHN2
     C                     MOVE CBSHN3    CQSHN3
     C                     Z-ADD@ZOUGN    CQSRYO
TCHK1C                     Z-ADDWSSDAT    CQTHHZ
TCHK1C                     Z-ADDWSSTM6    CQTHTI
TCHK1C                     Z-ADDWSSDAT    CQNOHZ
     C                     Z-ADD0         CQNOBB
     C                     MOVE 'G'       CQTHAI
     C                     MOVE 'K'       CQSKKB
     C                     Z-ADD@MAIS     CQHAKO
     C*****                Z-ADDCBSYUY    CQSYUY
     C                     Z-ADD@SYUY     CQSYUY
     C                     MOVE *BLANK    CQDTSY
     C                     MOVE '4'       CQDTSO
     C                     MOVE '20'      CQGYOM
     C           @GYM      IFEQ 'A'
     C                     MOVE '23'      CQGYOM
     C                     END
     C           @GYM      IFEQ 'B'
     C                     MOVE '29'      CQGYOM
     C                     END
TCHK1C                     Z-ADDWSSDAT    CQURHZ
TCHK1C                     Z-ADDWSSTM6    CQURTI
     C                     MOVE 'B'       CQBNKA
     C                     MOVE CBSHN3    CQHBSB
      *
     C*------------------------------------*
     C*        売上・受注№入力。        *
     C*------------------------------------*
     C                     SETOF                     30
      *
     C           $$TURU    IFEQ '*'                        *=つるべ
     C           1         CHAINAUDPPNA1             30
     C                     ELSE
     C           1         CHAINAUDPPNO1             30
     C                     ENDIF
      *
     C*===読めない時===*
     C           *IN30     IFEQ '1'
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C           $$TURU    IFEQ '*'                        *=つるべ
     C                     WRITEAUDPPNA1
     C                     ELSE
     C                     WRITEAUDPPNO1
     C                     ENDIF
      *
     C*===読めた時===*
     C                     ELSE
     C           ACTUKI    IFNE UMONTH
     C                     Z-ADDUMONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C                     ELSE
     C           ACRENO    ADD  1         ACRENO
     C                     Z-ADDACRENO    CQJTNO
     C                     END
     C           $$TURU    IFEQ '*'                        *=つるべ
     C                     UPDATAUDPPNA1
     C                     ELSE
     C                     UPDATAUDPPNO1
     C                     ENDIF
     C                     END
      *
     C           $$TURU    IFEQ '*'                        *=つるべ
      *
     C           @BAR      IFEQ 'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C                     WRITEAU#PP911
     C                     ELSE
     C                     WRITEAU#PP911
     C                     WRITEAU#PP111
     C                     WRITEIU#PP111
     C                     ENDIF
      *
     C                     ELSE
     C                     WRITEAU#PP111
     C                     WRITEIU#PP111
     C                     ENDIF
      *
TCHK1C                     Z-ADDWSSDAT    ADKOHZ
TCHK1C                     Z-ADDWSSTM4    XTIME
     C                     MOVELUS        ADKOME
     C                     MOVELCBSHN1    ADHIN1
     C                     MOVELCBSHN2    ADHIN2
     C                     MOVELCBSHN3    ADHIN3
     C*****                Z-ADDCBMBMN    ADZBMN
     C*****                Z-ADDCBMMKR    ADMBMN
     C*****                MOVELCBMLIN    ADLAIN
     C*****                Z-ADDCBBARL    ADBARL
     C                     Z-ADD@3MBMN    ADZBMN
     C                     Z-ADD@3MMKR    ADMBMN
     C                     MOVEL@3MLIN    ADLAIN
     C                     Z-ADD@3BARL    ADBARL
      *
     C                     MOVEL*BLANK    ADKBN1
     C                     MOVEL*BLANK    ADKBN2
     C                     Z-ADD15        D
     C           D         DOWGE1
     C           ADKBN1    ANDEQ*BLANK
     C                     MOVEL#KBN,D    ADKBN1
     C                     SUB  1         D
     C                     ENDDO
      *
      *最終工程のひとつ前のかんばん種類、品番
      *
     C                     Z-ADD0         $NO     20
     C                     MOVE *BLANK    $TYPE   1
     C                     MOVE *BLANK    $HIN   12
      *
     C                     DO   15        X
     C           16        SUB  X         D       20
     C*
     C           #KAN,D    IFNE *BLANK
     C                     ADD  1         $NO
     C           $NO       IFEQ 2
     C                     MOVEL#KAN,D    $TYPE
     C                     MOVEL#HIN,D    $HIN
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
      *
     C                     Z-ADD0         ADCHAK
      *
     C*----------------------------------------------------*
     C**      xｮg f]ﾌﾞ]                                   **
     C*----------------------------------------------------*
     C           CBKDAI    IFEQ 'C'
     C                     SETOF                     35
     C           KEY6      CHAINAAFPL031             35
     C           *IN35     IFEQ '0'
     C           A3SKJY    ANDEQ'D'
     C           A3SKHZ    ANDLE*DATE
     C                     SETON                     35
     C                     END
      *
     C           *IN35     IFEQ '0'
     C                     Z-ADDA3CBKO    ADCHAK
     C                     END
     C                     END
      *
     C*----------------------------------------------------*
     C**      n]rﾓ f]ﾌﾞ]                                  **
     C*----------------------------------------------------*
     C           CBKDAI    IFEQ 'D'
     C                     SETOF                     35
     C           KEY6      CHAINAAGPL031             35
     C           *IN35     IFEQ '0'
     C           O4SKJY    ANDEQ'D'
     C           O4SKHZ    ANDLE*DATE
     C                     SETON                     35
     C                     END
      *
     C           *IN35     IFEQ '0'
     C                     Z-ADDO4CBKO    ADCHAK
     C                     END
     C                     END
      *
     C*****                Z-ADDCBSYUY    ADSYOS
     C                     Z-ADD@SYUY     ADSYOS
     C                     Z-ADD@MAIS     ADMAIS
      *
     C                     SETOF                     35
     C                     MOVE *BLANK    ADSYOT
     C           KEY4      CHAINFCEPL011             35
     C           *IN35     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     35
     C                     END
     C           *IN35     IFEQ '0'
     C           A2SYHZ    IFGT *DATE
     C                     MOVE A2KSYT    ADSYOT
     C                     ELSE
     C                     MOVE A2SSYT    ADSYOT
     C                     END
     C                     END
      *
     C                     SETOF                     58
     C           $$TURU    IFEQ '*'                        *=つるべ
     C           @BAR      ANDEQ'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C*
     C                     ELSE
     C           KEY4      CHAINADAPL201             58
     C*
     C           *IN58     IFEQ '1'
     C                     MOVELCBSHN1    APHIN1
     C                     MOVELCBSHN2    APHIN2
     C                     MOVELCBSHN3    APHIN3
     C           @KBN      IFEQ '1'
     C                     Z-ADD1         APSKIS
     C                     Z-ADD0         APTKIS
     C                     ELSE
     C                     Z-ADD0         APSKIS
     C                     Z-ADD1         APTKIS
     C                     END
     C                     WRITEADAPL201
     C**
     C                     ELSE
      *
     C           @KBN      IFEQ '1'
     C                     ADD  1         APSKIS
     C                     ELSE
     C                     ADD  1         APTKIS
     C                     END
     C                     UPDATADAPL201
     C                     END
     C                     END
      **
     C           $$TURU    IFEQ '*'                        *=つるべ
     C                     SETOF                     58
     C           KEY4      CHAINADAPP951             58
     C*
     C           *IN58     IFEQ '1'
     C                     MOVELCBSHN1    APHIN1
     C                     MOVELCBSHN2    APHIN2
     C                     MOVELCBSHN3    APHIN3
     C           @KBN      IFEQ '1'
     C                     Z-ADD1         APSKIS
     C                     Z-ADD0         APTKIS
     C                     ELSE
     C                     Z-ADD0         APSKIS
     C                     Z-ADD1         APTKIS
     C                     END
     C                     WRITEADAPP951
     C**
     C                     ELSE
      *
     C           @KBN      IFEQ '1'
     C                     ADD  1         APSKIS
     C                     ELSE
     C                     ADD  1         APTKIS
     C                     END
     C                     UPDATADAPP951
     C                     END
     C                     ENDIF
      *
     C           @KBN      IFEQ '1'
     C                     Z-ADDAPSKIS    ADKAIS
     C                     ELSE
     C                     Z-ADDAPTKIS    ADKAIS
     C                     END
      *
     C                     MOVEL'232323'  WKCD    6
     C                     MOVEL#PGM      ##PGM  10 P
     C                     MOVELBAR       ##BARC 20 P
     C                     CALL 'ALDR9U'
     C                     PARM           WKCD
     C                     PARM           ##PGM
     C                     PARM           ##BARC
      *
     C*****                Z-ADDCBHASU    ADBTNS
     C                     Z-ADD@3HASU    ADBTNS
     C                     Z-ADD@ZOUGN    ADZGSU
     C*****      CBHASU    ADD  @ZOUGN    ADKSSU
     C           ADBTNS    ADD  ADZGSU    ADKSSU
      *
     C           @BAR      IFEQ 'N'
     C                     MOVE *BLANK    ADKSKB
     C                     MOVE *BLANK    ADZETI
     C                     MOVE *BLANK    ADTHNO
     C                     MOVE *BLANK    ADPGNO
     C                     ELSE
     C                     MOVELKSN@@     ADKSKB
     C                     MOVELZETI@@    ADZETI
     C                     MOVELTENO@@    ADTHNO
     C                     MOVELPNO@@     ADPGNO
     C                     END
      *
     C           @KBN      IFEQ '1'
     C                     MOVEL'S'       ADDTKB
     C                     ELSE
     C                     MOVEL'T'       ADDTKB
     C                     END
      *
     C           $$TURU    IFEQ '*'                        *=つるべ
      *
     C           @BAR      IFEQ 'B'
     C           #BAR13    ANDGE'A'
     C           #BAR13    ANDLE'Z'
     C           @INP      OREQ '3'
     C           @INP      OREQ '4'
     C                     WRITEADAPL901
     C                     ELSE
     C                     WRITEADAPL011
     C                     Z-ADD@4MBMN    ADZBMN
     C                     Z-ADD@4MMKR    ADMBMN
     C                     MOVEL@4MLIN    ADLAIN
     C                     Z-ADD@4BARL    ADBARL
     C                     Z-ADD@4HASU    ADBTNS
     C           ADBTNS    ADD  ADZGSU    ADKSSU
     C                     WRITEADAPL901
     C                     ENDIF
     C*
     C                     ELSE
     C                     WRITEADAPL011
     C                     ENDIF
JW1   *---------------
JW1   * UPDATE NZUPL01
JW1   *---------------
JW1  C           @KBN      IFEQ '1'
JW1  C           @INP      ANDEQ'1'
JW1  C           @BAR      ANDEQ'B'
JW1  C                     MOVELZETI@@    N2ZETI
JW1  C                     MOVELTENO@@    N2TEHI
JW1  C                     MOVELPNO@@     N2PAGN
JW1  C                     MOVE *OFF      *IN97
JW1  C           K#NZU     SETGTNZUPL01
JW1  C           *IN97     DOWEQ*OFF
JW1  C           K#NZU     REDPENZUPL01                  97
JW1  C           *IN97     IFEQ *OFF
     C           N2SKJY    ANDEQ*BLANK
     C           N2DEHZ    ANDEQ*ZERO
JW1  C                     MOVEL'D'       N2SKJY
JW1  C                     MOVEL@DATE     N2SKHZ
JW1  C                     MOVEL@DATE     N2KOHZ
JW1  C                     MOVEL@TIME     N2KOTI
JW1  C                     MOVEL#USER     N2KOME
JW1  C                     MOVEL#PGM      N2KOPG
JW1  C                     UPDATNZUPL011
     C                     LEAVE
JW1  C                     ENDIF
JW1  C                     ENDDO
JW1  C                     ENDIF
      *---------------
      * UPDATE NZUPP20
      *---------------
     C           @KBN      IFEQ '1'
     C           @INP      ANDEQ'3'
     C           @BAR      ANDEQ'B'
     C                     MOVELZETI@@    N2ZETI
     C                     MOVELTENO@@    N2TEHI
     C                     MOVELPNO@@     N2PAGN
     C                     MOVE *OFF      *IN97
     C           K#NZU     SETLLNZUPP20
     C           *IN97     DOWEQ*OFF
     C           K#NZU     READENZUPP20                  97
     C           *IN97     IFEQ *OFF
     C                     MOVEL'D'       N2SKJY
     C                     MOVEL@DATE     N2SKHZ
     C                     MOVEL@DATE     N2KOHZ
     C                     MOVEL@TIME     N2KOTI
     C                     MOVEL#USER     N2KOME
     C                     MOVEL#PGM      N2KOPG
     C                     UPDATNZUPP201
     C                     ENDIF
JW1  C                     ENDDO
JW1  C                     ENDIF
      *
     C                     ENDSR
      *****************************************************************
     C*         再手配・造り過ぎ件数カウント
      *****************************************************************
     C           #YOMI     BEGSR
      *
     C                     SETOF                     14
     C           KEY7      CHAINADAPP771             14
     C           *IN14     IFEQ '1'
     C           @KBN      IFEQ '1'
     C                     Z-ADD*YEAR     AWKOYY
     C                     Z-ADDUMONTH    AWKOMM
     C                     Z-ADDUDAY      AWKODD
     C                     Z-ADD1         AWSAIT
     C                     Z-ADD0         AWTSUK
     C                     ELSE
     C                     Z-ADD*YEAR     AWKOYY
     C                     Z-ADDUMONTH    AWKOMM
     C                     Z-ADDUDAY      AWKODD
     C                     Z-ADD0         AWSAIT
     C                     Z-ADD1         AWTSUK
     C                     END
     C                     WRITEADAPP771
      *
     C                     ELSE
      *
     C           @KBN      IFEQ '1'
     C                     ADD  1         AWSAIT
     C                     ADD  0         AWTSUK
     C                     ELSE
     C                     ADD  0         AWSAIT
     C                     ADD  1         AWTSUK
     C                     END
     C                     UPDATADAPP771
     C                     END
      *
     C                     ENDSR
      *
      *****************************************************************
     C*         エラーリスト
      *****************************************************************
     C           SUBPRT    BEGSR
      *
     C           *IN71     IFEQ '0'
     C                     SETON                     U371
     C                     OPEN QPRINT
TCHK1C                     TIME           WSDT
     C                     EXCPTHD
     C                     END
      *
     C           *INOF     IFEQ '1'
     C                     EXCPTHD
     C                     END
      *
     C                     ADD  1         WERCD   40
     C                     EXCPTDT
      *
     C                     ENDSR
      *================================================================
      *         つるべチェック
      *================================================================
     C           #TURU     BEGSR                           *
      *
     C                     SETOF                     33
     C                     Z-ADD0         #BMN
     C                     MOVE *BLANK    #KOT
     C                     MOVEL*BLANK    #KBN
     C                     MOVE *BLANK    #TKR
     C                     MOVE *BLANK    #KAN
     C                     Z-ADD0         #HIZ
     C                     MOVE *BLANK    #HIN             品番
     C           KEY4      CHAINAAMPL111             33
     C           *IN33     IFEQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE*DATE
     C                     SETON                     33
     C                     ENDIF
      *
     C           *IN33     IFEQ '0'
     C                     Z-ADD0         B       20
     C                     DO   15        X       20
     C                     MOVELCKHZ,X    WUKH    80
     C           *DATE     IFLT WUKH
     C           CKQK,X    IFNE *BLANK
     C                     ADD  1         B
     C                     Z-ADDCKQB,X    #BMN,B
     C                     MOVELCKQK,X    #KOT,B
     C                     MOVELCKQN,X    #KBN,B
     C                     MOVELCKQR,X    #TKR,B
     C                     MOVELCKQS,X    #KAN,B
     C                     Z-ADDCKHZ,X    #HIZ,B
     C                     MOVELCKQH,X    #HIN,B           品番
     C                     ENDIF
     C                     ELSE
     C           CKKO,X    IFNE *BLANK
     C                     ADD  1         B
     C                     Z-ADDCKBM,X    #BMN,B
     C                     MOVELCKKO,X    #KOT,B
     C                     MOVELCKKB,X    #KBN,B
     C                     MOVELCKTR,X    #TKR,B
     C                     MOVELCKTY,X    #KAN,B
     C                     Z-ADDCKHZ,X    #HIZ,B
     C                     MOVELCKHB,X    #HIN,B           品番
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     MOVE *BLANK    XXTKR
     C                     Z-ADD0         YMDB
      *
     C                     Z-ADD16        C       20
     C                     DO   15        X
     C           C         SUB  X         D       20
     C           #KAN,D    IFEQ CBKDAI
     C                     MOVEL#TKR,D    XXTKR
     C                     Z-ADD#HIZ,D    YMDB
     C                     GOTO AAA
     C                     END
     C                     END
     C           AAA       TAG
      *
     C           KEY11     KLIST
     C                     KFLD           $HIN1
     C                     KFLD           $HIN2
     C                     KFLD           $HIN3
      *
     C                     MOVEL' '       $$TURU  1
      *
     C                     Z-ADD0         $NO     20
     C                     MOVE *BLANK    $TYPE   1
     C                     MOVE *BLANK    $HIN   12
      *
     C                     DO   15        X
     C           16        SUB  X         D       20
     C*
     C           #KAN,D    IFNE *BLANK
     C                     ADD  1         $NO
     C           $NO       IFEQ 2
     C                     MOVEL#KAN,D    $TYPE
     C                     MOVEL#HIN,D    $HIN
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
      *
     C           $TYPE     IFEQ 'C'
      *
     C           KEY11     CHAINAGAPL41              12
     C  N12      CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     12
     C                     ENDIF
      *
      *         つるべ品番の時
      *
     C           *IN12     IFEQ *OFF
     C                     MOVE '*'       $$TURU           *=つるべ
     C*
     C                     Z-ADD15        D       20
     C           D         DOWGT*ZERO
     C           #KAN,D    ANDNE'C'
     C                     SUB  1         D
     C                     ENDDO
     C*
     C           D         IFNE *ZERO
     C                     MOVEL#TKR,D    XXTKR
     C           KEY6      CHAINAAFPL031             35
     C           *IN35     IFEQ '1'
     C           *IN35     OREQ '0'
     C           A3SKJY    ANDEQ'D'
     C           A3SKHZ    ANDLE*DATE
     C                     Z-ADD*ZERO     A3SSYS
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *================================================================
      *
     OQPRINT  E  102           HD
     O                                  131 '+-------------------+'
     O        E  1             HD
     O                                  131 '|         |         |'
     O        E  1             HD
     O                                   89 'TIME'
TCHK1O*                        WTIME     98 '  :  :  '
TCHK1O                         WSSTM6    98 '  :  :  '
     O                                  131 '|         |         |'
     O        E  2             HD
     O                                   10 'ADAR59-1'
     O                                   25 'READER MCH'
     O                         TBL,1     81
     O                                   89 'DATE'
TCHK1O*                        UDATE Y   98
TCHK1O                         WSSDT6Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '+-------------------+'
     O        E  2             HD
     O                                   30 'BAR CODE'
     O                                   50 'INT CO. PART NO'
     O                                   67 'KANBAN SHEET'
     O                                   86 'ERROR CONTENTS'
     O        E  1             DT
     O                         BAR       33
     O                         A2BHB1    41
     O                                   42 '-'
     O                         A2BHB2    47
     O                                   48 '-'
     O                         A2BHB3    50
     O                                   61 '1'
     O                         WERR     127
     O        E 2              TR
     O                                   54 '** RECORD COUNT'
     O                         WERCD 1   61
      *
** TB1.TB2
1 PROD ODR AGAIN = REGULAR KANBAN
2 OVER MADE =OVER MADE KANBAN
** TAB3/TAB4
000
101
202
303
404
505
606
707
808
909
A10
B11
C12
D13
E14
F15
G16
H17
I18
J19
K20
L21
M22
N23
O24
P25
Q26
R27
S28
T29
U30
V31
W32
X33
Y34
Z35
-36
.37
 38
\39
/40
+41
%42
** ERR
E-01 DATA INSTRUCTION IS <1 2>
E-02 INPUT INSTRUCTION IS <1 2>
E-03 INTRAL COMPANY PART NO ISN'T INPUT.
E-04 NO APPLICABLE DATA IN LEVEL PROD FIXED ODR ACCUM F
E-05 LEVELLED PROD FIXED ODR ACCUMULATE FILE IS CANCELLED
E-06 LOCATION ISN'T INPUT.
E-07 IT ISN'T POSSIBLE TO DO INDEX OF INT CO. P/N FROM LOC
E-08 NO APPLCBL DATA OF THIS P/N IN LVL PROD FIX ODR ACCUM F
E-09 THIS P/N OF LEVEL PROD FIXED ODR ACCUM F IS CANCELLED
E-10 NUMBER OF SHEETS ISN'T INPUT.
E-11 BAR CODE INSTRUCTION <B / N>
E-12 BY LOCATION INPUT THE BAR CODE INPUT IS IMPOSSIBLE.
E-13 BAR CODE ISN'T INPUT.
E-14 THERE IS NOT APPLICABLE DATA IN PART M/F .
E-15 IT IS PROCESSED ALREADY
E-16 BAR CODE ISN'T READ JUSTLY SO THAT READS IT ONCE AGAIN
E-17 NO APPLICABLE DATA IN LEVL PROD F A-PICS2 OBJ P/N M/F
E-18 CAN'T USE IT IN A PASSWORD OF INFORMATION SECTION
E-19 JOB CODE IS A B OR BLANK.
E-20 IN A PASSWORD OF QPGMR, CAN'T HANDLE IT.
E-21 BAR CODE INSTRUCTION <Y / N / B>
E-22 BARCODE DUPLICATE READING. MUST BE PART# MANUAL ENTRY.
E-23 ONLY THE LOCATION OF THE FINAL PROCESS.
E-24 ONLY THE LOCATION OF FROM THE END ,THE 2ND PROCESS.
** #BAR
A2024
A2027
A2028
A2030
A2032
A2033
** PER
BAR CODE ISN'T READ JUSTLY
THERE IS NOT APPLICABLE DATA IN PART M/F
IT IS HANDLED ALREADY
NO APPLICABLE DATA IN LEVEL PROD F A-PICS2 OBJ P/N M/F
BARCODE DUPLICATE READING
** TBL
* PROD ODR AGAIN AND OVER MADE DATA INPUT ERROR LIST *
