     H            Y
     F** ADAR5Z **************************************
     F* A CALCULATION OF REST AMOUNT DATA ORDER DATE  *
     F*         M S K                                *
     F************************************** ADAR5Z **
     FADAWP51 IP  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FADAWP52 O   E                    DISK
     E                    NKOT       15  6               ﾆ]  ﾌﾞ]k
     E                    NKBM       15  4 0                 ﾎﾞy]
     E                    QKOT       15  6               gｬc ﾌﾞ]k
     E                    QKBM       15  4 0                 ﾎﾞy]
     E                    NUKH       15 10 0             gﾒfdﾍﾞ
     E                    HKOT       15  6               iｮmb ﾌﾞ]k
     E                    HKBM       15  4 0                  ﾎﾞy]
     E                    AR1        10  8 0A
     E                    CR1         7  1
     I            DS
     I                                        1   80WETBI
     I                                        1   40WETYY
     I                                        5   60WETMM
     I                                        7   80WETDD
     **
     I            DS
     I                                        1   1 CGYOB1
     I                                        2   2 CGYOB2
     I                                        3   3 CGYOB3
     I                                        4   4 CGYOB4
     I                                        5   5 CGYOB5
     I                                        6   6 CGYOB6
     I                                        7   7 CGYOB7
     I                                        1   7 CR1
     I            DS
     I                                        1  90 NKOT
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  600NKBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  90 QKOT
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  600QKBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     C**************************
     C*  初期値セット        *
     C**************************
     C           *ENTRY    PLIST
     C                     PARM           PARM1   1        *区分
     C                     PARM           PARM2   8        *臨夜勤日
     C                     PARM           PARM3   8        *入庫日
     C                     PARM           PARM4   1        *保管
     C                     PARM           PARM5   1        *方式
     C                     PARM           PARM6   6        *番地
     C                     PARM           PARM7   8        *Ｓ日付
     C                     PARM           PARM8   8        *Ｅ日付
     C                     PARM           PARM9   1        *前夜勤区
     C                     PARM           PARM10  6        *年月
     C                     PARM           PARM11  1        *旬
     C                     PARM           PTNS    1        * A-PICS転送
     C/SPACE 1
     C*-----------------------*
     C* ＫＬＩＳＴ          *
     C*-----------------------*
     C           #KEY      KLIST
     C                     KFLD           WKHY    40
     C                     KFLD           WKHM    20
     C                     KFLD           WKHD    20
     C/SPACE 1
     C           #KEY1     KLIST
     C                     KFLD           WHIN1   5
     C                     KFLD           WHIN2   5
     C                     KFLD           WHIN3   2
     C/SPACE 1
     C           #KEY2     KLIST
     C                     KFLD           WKBMN   40
     C                     KFLD           WKTYP   1
     C/SPACE 1
     C           #KEY3     KLIST
     C                     KFLD           WKSTR   40
     C                     KFLD           WKEND   40
     C                     KFLD           WKBIN   20
     C/SPACE 1
     C           #KEY4     KLIST
     C                     KFLD           WKSTR   40
     C                     KFLD           WKEND   40
     C                     KFLD           WKTHH   20
     C                     KFLD           WKTMM   20
     C/SPACE 1
     C           KAN       IFEQ *BLANK
     C                     MOVE PARM2     HYMD    80
     C* 分配日の計算へ
     C*
     C                     Z-ADD0         AR1
     C           PTNS      IFEQ 'N'
     C                     MOVE '*'       KAN
     C                     Z-ADDHYMD      AR1,1
     C                     ELSE
     C*
     C                     EXSR $SB200
     C                     END
     C                     END
     C/SPACE 1
     C*********************
     C* 便セット        *
     C*********************
     C                     MOVE DAHIN1    WHIN1
     C                     MOVE DAHIN2    WHIN2
     C                     MOVE DAHIN3    WHIN3
     C                     SETOF                       15
     C           #KEY1     CHAINAGAPL311             15
     C           *IN15     IFEQ '1'
     C                     Z-ADD01        XXBIN   20
     C                     END
     C           *IN15     IFEQ '0'
     C           CBTR01    IFEQ *ZERO
     C                     Z-ADD01        XXBIN
     C                     ELSE
     C                     Z-ADDCBTR01    XXBIN
     C                     END
     C                     END
     C*
     C/SPACE 1
     C                     SETOF                       66
     C                     Z-ADD0         JJ      20
     C           1         DO   10        JJ
     C           AR1,JJ    IFNE *ZERO
     C                     MOVE AR1,JJ    WETBI
     C                     SETON                       66
     C                     END
     C  N66                END
     C                     MOVE WETYY     WKHY
     C                     MOVE WETMM     WKHM
     C                     MOVE WETDD     WKHD
     C                     MOVE WETYY     DAHTYY
     C                     MOVE WETMM     DAHTMM
     C                     MOVE WETDD     DAHTDD
     C                     Z-ADDXXBIN     DAHTBB
     C*
     C*---------------------------------------------*
     C* ﾃcﾌﾞb  ﾑc LOGIC lbf  (ﾎﾞy] ･ ﾝiﾓ)  890722   *
     C*---------------------------------------------*
     C*
     C                     EXSR $SB900
     C/SPACE 1
      *
     C                     MOVE DABMON    DATBMN
     C                     MOVELDAFILR    XXXX    1
      *
     C                     WRITEADAWP521
     C           LAST      TAG
     C*-----------------------------------------------------*
     C*  分　　配　　日　　の　　計　　算                 *
     C*-----------------------------------------------------*
     CSR         $SB200    BEGSR
     C                     MOVE HYMD      WKHD    20
     C                     MOVELHYMD      HYM     60
     C                     MOVELHYM       WKHY    40
     C                     MOVE HYM       WKHM    20
     C           #KEY      SETLLAGDPL111
     C                     DO   *HIVAL
     C                     READPAGDPL111                 21
     C                     ADD  1         CTR     20
     C           CTR       CABEQ3         FNDGET
     C  N21                END
     C           FNDGET    TAG
     C                     MOVE F8KAYY    WKHY
     C                     MOVE F8KAMM    WKHM
     C                     MOVE F8KADD    WKHD
     C           #KEY      SETLLAGDPL111
     C                     DO   *HIVAL
     C                     READPAGDPL111                 22
     C                     MOVE F8KAYY    WETYY
     C                     MOVE F8KAMM    WETMM
     C                     MOVE F8KADD    WETDD
     C           *DATE     CABGEWETBI     PAS
     C                     ADD  1         X       20
     C                     MOVE WETBI     AR1,X
     C           X         CABEQ10        PAS
     C  N22                END
     C           PAS       TAG
     C                     SORTAAR1
     C                     MOVE '*'       KAN     1
     CSR                   ENDSR
     C*----------------------------------------------------*
     C*   ﾆzob f]ﾌﾞ] uﾇjｰ ﾑﾒ ﾎﾞy] ﾃｰnﾞ kdlh                *
     C*----------------------------------------------------*
     CSR         $SB900    BEGSR
     C           DABMON    IFEQ 8990
     C                     MOVE DAHIN1    WHIN1   5
     C                     MOVE DAHIN2    WHIN2   5
     C                     MOVE DAHIN3    WHIN3   2
     C                     SETOF                     3031
     C                     MOVEL'1'       DAFILR
     C                     MOVE *BLANK    HKOT
     C                     MOVE *ZERO     HKBM
     C           #KEY1     SETLLAAMPL111
     C                     DO   *HIVAL
     C           #KEY1     READEAAMPL111                 30
     C           *IN30     IFEQ '0'
     C           CKSKJY    ANDEQ*BLANK
     C                     SETON                     31
     C                     END
     C  N30N31             END
     C*
     C           *IN30     IFEQ '0'
     C                     Z-ADD1         X       20
     C                     Z-ADD0         L       20
     C           1         DO   15        X
     C                     MOVELNUKH,X    WUKH    80
     C           WUKH      IFGT *DATE
     C           QKOT,X    IFNE *BLANK
     C                     ADD  1         L
     C                     MOVE QKOT,X    HKOT,L
     C                     Z-ADDQKBM,X    HKBM,L
     C                     END
     C                     ELSE
     C           NKOT,X    IFNE *BLANK
     C                     ADD  1         L
     C                     MOVE NKOT,X    HKOT,L
     C                     Z-ADDNKBM,X    HKBM,L
     C                     END
     C                     END
     C                     END
     C*
     C                     SETOF                     35
     C                     Z-ADD0         B       20
     C                     DO   15
     C                     ADD  1         B
     C                     SETOF                       36
     C           HKOT,B    COMP *BLANK                   36
     C           *IN36     IFEQ '0'
     C           DABAN2    LOKUPHKOT,B                   35
     C           *IN35     IFEQ '1'
     C*          HKBM,B    IFNE 9008
     C*          HKBM,B    ANDNE8923
     C*          HKBM,B    ANDNE8931
     C*          HKBM,B    ANDNE8915
     C*          HKBM,B    ANDNE8958
     C                     MOVEL'2'       DAFILR
     C*                    END
     C                     END
     C                     END
     C  N35N36             END
     C/SPACE 1
     C                     END
     C                     END
     CSR         $S900E    ENDSR
