     H            Y.
     F** ADAR5A ************************************
     F* TRANSMISSION WORK DATA DETAILS             *
     F************************************ ADAR5A **
     FADAWP60 UP  E           K        DISK
     FADAWP53 O   E           K        DISK
     C                     MOVE DABMON    DATBMN
     C                     MOVELDAFILR    XXXX    1
     C                     WRITEADAWP531
     C           XXXX      IFNE *BLANK
     C                     MOVE *BLANK    DAFILR
     C                     UPDATADAWP601
     C                     END
