     H            Y
     F** ADAR51 ********************************************
     F* UNWORKING NIGHT ATTENDANCE AND UNWORKING ATTENDANCE KANBAN NON PRODUCTIO
     F*N ORDER FILE ADDITION
     F*   ADD PARM12 AS ELIMINATE DATE
     F*       11/12/01 (TCH)
     F******************************************************
     FADAWP60 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FACAPL11 IF  E           K        DISK
     FAUDPPNO UF  E                    DISK                      A
     FAU#PP11 O   E                    DISK                      A
     FIU#PP11 O   E                    DISK                      A
     I            DS
     I                                        1   6 WKBAN
     I                                        1   1 WKBAN1
     I                                        2   3 WKBAN2
     I                                        4   5 WKBAN3
     I                                        6   6 WKBAN4
     I            DS
     I                                        1   80HYMD
     I                                        1   40HY
     I                                        5   60HM
     I                                        7   80HD
     I            DS
     I                                        1   80SYMD
     I                                        1   40SY
     I                                        5   60SM
     I                                        7   80SD
     I            DS
     I                                        1   80CQYMD
     I                                        1   40CQYY
     I                                        5   60CQMM
     I                                        7   80CQDD
     I            DS
     I                                        1  12 DAHBAN
     I                                        1   5 DAHIN1
     I                                        6  10 DAHIN2
     I                                       11  12 DAHIN3
      *
     C*-----------------------*
     C*   K L I S T           *
     C*-----------------------*
     C           #KEY      KLIST
     C                     KFLD           HY      40
     C                     KFLD           HM      20
     C                     KFLD           HD      20
      *
     C           #KEY1     KLIST
     C                     KFLD           WHIN1   5
     C                     KFLD           WHIN2   5
     C                     KFLD           WHIN3   2
      *
     C           KEYM1     KLIST
     C                     KFLD           DABMON
     C                     KFLD           DABRUI
      *
     C           KEYM2     KLIST
     C                     KFLD           DABMON
     C                     KFLD           DABRUI
     C                     KFLD           DAHIN1
     C                     KFLD           DAHIN2
     C                     KFLD           DAHIN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PARM1   1        *区分
     C                     PARM           PARM2   8        ﾒ]ﾆﾏlﾍﾞ
     C                     PARM           PARM21  8        pﾏcﾃﾍﾞ
     C                     PARM           PARM3  10        * ﾎﾟﾜﾎｧ-ﾓ
     C*                    PARM           PARM12  8
      *
     C           ##LOP     TAG
     C           *IN81     DOWEQ'0'
     C                     READ ADAWP601                 81
     C           *IN81     CABEQ'1'       LAST
     C           DASKJY    CABEQ'D'       ##LOP
     C                     MOVE *BLANK    KSNFLG  1
     C                     MOVE DAHTYY    SY      40
     C                     MOVE DAHTMM    SM      20
     C                     MOVE DAHTDD    SD      20
      *
     C*時刻便マスターＲＥＡＤ
     C                     Z-ADD0         WBMON   40
     C                     MOVE *BLANK    WKCD1   1
     C                     MOVE *BLANK    WSW1    1
      *
     C           DABRUI    IFEQ '0'
     C           DABMON    OREQ 0111
     C                     Z-ADD0111      WBMON
     C                     ELSE
      *
     C           KEYM1     SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     26
     C           KEYM1     READEACAPL111                 26
     C           *IN26     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     26
     C                     MOVE '*'       WSW1
     C                     Z-ADDI1BMON    WBMON
     C                     MOVE I1KCD1    WKCD1
      *
     C                     END
     C                     END
     C  N26                END
      *
     C           WSW1      IFEQ *BLANK
     C                     Z-ADD0111      WBMON
     C                     ELSE
      *
     C                     SETOF                     27
     C           KEYM2     CHAINACAPL111             27
     C           *IN27     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     27
     C                     END
     C           *IN27     IFEQ '0'
     C                     Z-ADDI1BMON    WBMON
     C                     ELSE
      *
     C           WBMON     IFEQ 0111
     C           WKCD1     IFNE '0'
     C                     Z-ADD0111      WBMON
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           WBMON     CHAINAAIPL111             21
      *
     C           I         IFGE 10
     C                     MOVE *BLANK    KHBAN
     C                     END
     C           DAHBAN    IFNE KHBAN
     C                     MOVE DAHBAN    KHBAN  12
     C                     Z-ADD1         I       20
     C           PARM1     IFEQ 'M'
     C           PARM2     ANDLTPARM21
     C                     MOVE CDENYY    HY               *終了日
     C                     MOVE CDENMM    HM
     C                     MOVE CDENDD    HD
     C           #KEY      SETLLAGDPL111
     C                     READ AGDPL111                 81
     C                     MOVE F8KAYY    WKYY    40
     C                     MOVE F8KAMM    WKMM    20
     C                     MOVE F8KADD    WKDD    20
     C           DAGETS    IFEQ '*'
     C                     MOVE WKYY      GEYY    40
     C                     MOVE WKMM      GEMM    20
     C                     MOVE WKDD      GEDD    20
     C                     END
     C                     ELSE
     C                     MOVE PARM2     HYMD
     C*                    MOVE PARM12    HYMD
     C                     MOVE HY        WKYY    40
     C                     MOVE HM        WKMM    20
     C                     MOVE HD        WKDD    20
     C                     END
     C                     ELSE
     C           I         ADD  1         I
     C                     END
     C           WKYMD     IFNE *ZERO
     C           WKYMD     IFNE SYMD
      *
     C*前夜勤
     C           PARM1     IFEQ 'M'
     C           PARM2     ANDLTPARM21
     C           DAGETS    IFNE '*'
     C                     READ AGDPL111                 81
     C                     MOVE F8KAYY    WKYY    40
     C                     MOVE F8KAMM    WKMM    20
     C                     MOVE F8KADD    WKDD    20
     C                     END
      *
     C*臨出
     C                     ELSE
     C                     MOVE PARM2     HYMD
     C******               MOVE PARM12    HYMD
     C                     MOVE HY        WKYY    40
     C                     MOVE HM        WKMM    20
     C                     MOVE HD        WKDD    20
     C                     END
     C                     END
     C                     END
      *
     C*未納手配ファイル作成
     C                     MOVE *BLANK    CQSKJY
     C                     MOVE *ZERO     CQSKYY
     C                     MOVE *ZERO     CQSKMM
     C                     MOVE *ZERO     CQSKDD
     C                     MOVE *ZERO     CQKOYY
     C                     MOVE *ZERO     CQKOMM
     C                     MOVE *ZERO     CQKODD
     C                     MOVE *ZERO     CQKOHH
     C                     MOVE *ZERO     CQKOSS
     C                     MOVE PARM3     CQKOME
     C                     MOVE *BLANK    CQTOKU
     C                     MOVE *BLANK    CQTKOJ
     C                     MOVE *BLANK    CQTUKE
     C                     MOVE DATOKI    CQNONY
     C                     MOVE *BLANK    CQNKOJ
     C                     MOVE DAUKEI    CQNUKE
     C                     MOVE DAHIN1    CQSHN1
     C                     MOVE DAHIN2    CQSHN2
     C                     MOVE DAHIN3    CQSHN3
     C                     MOVE *BLANK    CQMHN1
     C                     MOVE *BLANK    CQMHN2
     C                     MOVE *BLANK    CQMHN3
     C                     MOVE *BLANK    CQKOBI
     C                     MOVE *BLANK    CQSEBN
     C                     MOVE *BLANK    CQKANR
     C                     MOVE *ZERO     CQTANK
     C                     MOVE *BLANK    CQTKUB
     C                     MOVE *BLANK    CQTKTI
     C                     MOVE *BLANK    CQNOCR
     C           DAMAIS    MULT DASYUY    CQSRYO
     C           CQSRYO    MULT -1        CQSRYO
     C                     MOVE *BLANK    CQTANI
     C                     MOVE *BLANK    CQNSYK
     C           DAGETS    IFEQ '*'
     C                     MOVE GEYY      CQTHYY
     C                     MOVE GEMM      CQTHMM
     C                     MOVE GEDD      CQTHDD
     C                     ELSE
     C                     MOVE WKYY      CQTHYY
     C                     MOVE WKMM      CQTHMM
     C                     MOVE WKDD      CQTHDD
     C                     END
     C                     TIME           JIKAN   60
     C                     MOVELJIKAN     HHMM    40
     C                     MOVELHHMM      CQTHJI
     C                     MOVE HHMM      CQTHPN
     C                     MOVE DABAN3    WKBAN
     C                     MOVE WKBAN1    CQSBKJ
     C                     MOVE WKBAN2    CQSBRO
     C                     MOVE WKBAN3    CQSBRT
     C                     MOVE WKBAN4    CQSBDN
     C                     Z-ADD1         CQCIC1
     C                     Z-ADD1         CQCIC2
     C                     Z-ADD1         CQCIC3
     C                     MOVE PARM2     CQYMD
     C                     MOVE CQYY      CQNOYY
     C                     MOVE CQMM      CQNOMM
     C                     MOVE CQDD      CQNODD
     C                     MOVE 01        CQNOBB
     C                     MOVE *BLANK    CQKJYN
     C                     MOVE 'G'       CQTHAI
     C                     MOVE 'K'       CQSKKB
     C           DAMAIS    MULT -1        CQHAKO
     C                     MOVE DASYUY    CQSYUY
     C                     MOVE *BLANK    CQSTAN
     C                     MOVE *BLANK    CQKIBN
     C                     MOVE *BLANK    CQHBSB
     C                     MOVE *ZERO     CQROTN
     C                     MOVE *ZERO     CQPAGN
     C                     MOVE *ZERO     CQOCRD
     C                     MOVE *BLANK    CQDTSY
     C                     MOVE '3'       CQDTSO
     C           PARM1     IFEQ 'R'
     C                     MOVE '16'      CQGYOM
     C                     ELSE
     C                     MOVE '17'      CQGYOM
     C                     END
     C                     MOVE *YEAR     CQURYY
     C                     MOVE *MONTH    CQURMM
     C                     MOVE *DAY      CQURDD
     C                     TIME           JIKAN   60
     C                     MOVELJIKAN     HHMM    40
     C                     MOVELHHMM      CQURJI
     C                     MOVE HHMM      CQURPN
     C                     MOVE 'B'       CQBNKA
      *
     C**************************************
     C*        売上・受注№入力。        *
     C**************************************
     C           1         CHAINAUDPPNO1             99
      *
     C*===読めない時===*
     C           *IN99     IFEQ '1'
     C                     Z-ADD*MONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C                     WRITEAUDPPNO1
     C                     ELSE
      *
     C*===読めた時===*
     C           ACTUKI    IFNE *MONTH
     C                     Z-ADD*MONTH    ACTUKI
     C                     Z-ADD8500001   ACRENO
     C                     Z-ADD8500001   CQJTNO
     C                     UPDATAUDPPNO1
     C                     ELSE
     C           ACRENO    ADD  1         ACRENO
     C                     Z-ADDACRENO    CQJTNO
     C                     UPDATAUDPPNO1
     C                     END
     C                     END
     C                     WRITEAU#PP111
     C                     WRITEIU#PP111
     C                     MOVE *BLANK    CQKOME
     C                     MOVE *ZERO     CQCIC1
     C                     MOVE *ZERO     CQCIC2
     C                     MOVE *ZERO     CQCIC3
     C                     MOVE *ZERO     CQNOBB
     C                     MOVE *BLANK    CQTHAI
     C                     MOVE *BLANK    CQSKKB
     C                     MOVE *BLANK    CQHAKO
     C                     MOVE *BLANK    CQDTSO
     C                     MOVE *BLANK    CQGYOM
     C                     MOVE SYMD      WKYMD   80
     C                     END
     C           LAST      TAG
      *
     C************************
     C*プログラムの終了    *
     C************************
     C                     SETON                       LR
     C                     RETRN
