     H            Y
     F************************************************
     F* INQUIRY & UPDATE OF UNWORKINGDAY ATTENDANCE / UNWORKING NIGHT ATTENDANCE
     F* TRANSMISSION DATA                             *
     F*            M S K           UNWORKINGDAY, NIGHT ATTENDANCE *
     F************************************************
     FADAPW62 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     FADATL62 IF  E           K        DISK
     E                    $MSG    1   9 60
     I            DS
     I                                        1   5 WKHIN1
     I                                        6   6 WKH1
     I                                        7  11 WKHIN2
     I                                       12  12 WKH2
     I                                       13  14 WKHIN3
     I                                        1  14 WKHIN
     I            DS
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     I                                        1   80WKYMD
     C**************************
     C*  初期値セット        *
     C**************************
     C           *ENTRY    PLIST
     C                     PARM           PARHN1  5
     C                     PARM           PARHN2  5
     C                     PARM           PARHN3  2
     C                     PARM           PARKU1  1
     C                     PARM           PARYMD  8
     C                     MOVE PARHN1    WAHIN1  5
     C                     MOVE PARHN2    WAHIN2  5
     C                     MOVE PARHN3    WAHIN3  2
     C                     MOVE PARKU1    WAKUBN  1
     C                     MOVE PARYMD    WARZBI  80
     C                     MOVE *ZERO     X       20
     C                     MOVE *ZERO     CTRX    60
     C                     MOVEL$MSG,1    @HDR01
     C                     SETON                         71
     C                     WRITESFLCTL
     C                     SETOF                         71
     C                     Z-ADD0         RRN     40
     C                     Z-ADD1         @SFRCD
     C           WARZBI    SETLLADATL621
     C           RETRY     TAG
     C           *IN81     DOWEQ'0'
     C           WARZBI    READEADATL621                 81
     C           *IN81     CABEQ'1'       DSPLAY
     C*************************
     C*  画面明細編集       *
     C*************************
     C                     ADD  1         X
     C                     ADD  1         CTRX
     C                     ADD  1         @NUBR
     C*************************
     C* 品番セット          *
     C*************************
     C                     MOVE DAHIN1    WKHIN1
     C                     MOVE '-'       WKH1
     C                     MOVE DAHIN2    WKHIN2
     C                     MOVE DAHIN3    WKHIN3
     C           DAHIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKH2
     C                     ELSE
     C                     MOVE '-'       WKH2
     C                     END
     C                     MOVE WKHIN     @HIN
     C*************************
     C* 区分セット          *
     C*************************
     C           DAKUBN    IFEQ 'R'
     C                     MOVE 'UNWK ATT'@KUBN
     C                     END
     C           DAKUBN    IFEQ 'M'
     C                     MOVE 'UNWK NGT'@KUBN
     C                     END
     C*************************
     C* 日付セット          *
     C*************************
     C                     MOVE DARZBI    @HYMD
     C*************************
     C* 枚数セット          *
     C*************************
     C                     MOVE DAMAIS    @MAIS
     C*************************
     C* メーカーセット      *
     C*************************
     C                     MOVE DAMNAM    @MEKR
     C*************************
     C* 転送セット          *
     C*************************
     C           DAMAK2    IFEQ '*'
     C                     MOVE 'FNSH'    @TENSO
     C                     ELSE
     C                     MOVE *BLANK    @TENSO
     C                     END
     C                     MOVE DADATE    @SEIR
     C*
     C                     ADD  1         RRN     40
     C*
     C                     MOVE DAHIN1    @@HIN1
     C                     MOVE DAHIN2    @@HIN2
     C                     MOVE DAHIN3    @@HIN3
     C                     Z-ADDDATBAN    @@TBAN
     C                     MOVE DAMNAM    @@MNAM
     C                     MOVE DABRUI    @@BRUI
     C                     MOVE DAKUBN    @@KUBN
     C                     Z-ADDDAMAIS    @@MAIS
     C                     MOVE DABAN1    @@BAN1
     C                     Z-ADDDAHTYY    @@HTYY
     C                     Z-ADDDAHTMM    @@HTMM
     C                     Z-ADDDAHTDD    @@HTDD
     C                     Z-ADDDAHTBB    @@HTBB
     C                     Z-ADDDAMNHZ    @@MNHZ
     C                     Z-ADDDASYYY    @@SYYY
     C                     Z-ADDDASYMM    @@SYMM
     C                     Z-ADDDASYDD    @@SYDD
     C                     Z-ADDDASYBB    @@SYBB
     C                     MOVE DAHKAN    @@HKAN
     C                     Z-ADDDAMKYY    @@MKYY
     C                     Z-ADDDAMKMM    @@MKMM
     C                     Z-ADDDAMKDD    @@MKDD
     C                     Z-ADDDAMKBB    @@MKBB
     C                     Z-ADDDAKAYY    @@KAYY
     C                     Z-ADDDAKAMM    @@KAMM
     C                     Z-ADDDAKADD    @@KADD
     C                     Z-ADDDAKABB    @@KABB
     C                     WRITESFL01
     C           X         IFEQ 15
     C                     Z-ADD0         X
     C                     GOTO DSPLAY
     C                     END
     C                     END
     C           DSPLAY    TAG
     C                     Z-ADDRRN       RRN1    40
     C                     Z-ADD@NUBR     WKNUBR  40
     C           CTRX      IFEQ *ZERO
     C                     SETON                       99
     C           *IN81     IFEQ '1'
     C                     MOVEL$MSG,3    @ERR
     C                     ELSE
     C                     MOVEL$MSG,2    @ERR
     C                     END
     C                     GOTO $100S
     C                     END
     C*************************
     C*  第１画面           *
     C*************************
     C           $100S     TAG
     C           *IN81     IFEQ '0'
     C                     MOVE '++'      @MSG
     C                     ELSE
     C                     MOVE *BLANK    @MSG
     C                     END
     C                     WRITEADAPW699
     C                     SETON                       70
     C                     WRITESFLCTL
     C                     EXFMTADAPW621
     C                     SETOF                       70
     C                     SETOF                       99
     C                     MOVE *BLANK    @ERR
     C           *IN03     IFEQ '1'
     C                     SETON                       71
     C                     WRITESFLCTL
     C                     SETOF                       71
     C                     MOVE *ZERO     RRN
     C                     MOVE 1         @SFRCD
     C*****  ADAR61 の画面に戻る *************************
     C                     SETON                       LR  *
     C                     RETRN                           *
     C******************************************************
     C                     END
     C           @RRN      IFNE *ZERO
     C           @RRN      IFLT X
     C           @RRN      IFGT X
     C                     SETON                         99
     C                     MOVEL$MSG,1    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C                     END
     C           @RRN      IFNE *ZERO
     C           @RRN      CHAINSFL01                99
     C           *IN99     IFEQ '1'
     C                     MOVEL$MSG,2    @ERR
     C                     GOTO $100S
     C                     END
     C                     END
     C*===== ROLL UP =====*
     C           *IN51     IFEQ '1'
     C                     Z-ADD0         X
     C                     Z-ADD0         CTRX
     C           *IN81     IFEQ '1'
     C                     GOTO DSPLAY
     C                     END
     C           RRN       ADD  1         @SFRCD
     C                     GOTO RETRY
     C                     END
     C           @RRN      CABEQ*ZERO     $100S
     C******************************************************
     C* 詳細明細            *                            *
     C*************************                            *
     C                     EXSR $SB200                     *
     C                     SETOF                     0305  *
     C                     Z-ADDRRN1      RRN     40
     C                     Z-ADDWKNUBR    @NUBR   40
     C                     GOTO $100S                      *
     C******************************************************
     C*
     CSR         $SB200    BEGSR
     C*-----  ﾅﾎﾞ ﾎabﾓ READ -------*
     C           @RRN      CHAINSFL01                89
     C                     MOVE @HIN      WKHIN
     C                     MOVE WKHIN1    @HIN1
     C                     MOVE WKHIN2    @HIN2
     C                     MOVE WKHIN3    @HIN3
     C           @HIN3     COMP *BLANK                   70
     C                     MOVE @MEKR     @MAKER
     C                     MOVE @MAIS     @KANSU
     C                     SETOF                       60
     C           @TENSO    IFNE *BLANK
     C                     SETON                       60
     C                     END
     C                     MOVE @@TBAN    @TEHAI
     C                     MOVE @@HTYY    WKYY
     C                     MOVE @@HTMM    WKMM
     C                     MOVE @@HTDD    WKDD
     C                     MOVELWKYMD     @KANBI
     C                     MOVE @@HTBB    @KANBI
     C                     MOVE @@SYYY    WKYY
     C                     MOVE @@SYMM    WKMM
     C                     MOVE @@SYDD    WKDD
     C                     MOVELWKYMD     @MAEBI
     C                     MOVE @@SYBB    @MAEBI
     C                     MOVE @@MKYY    WKYY
     C                     MOVE @@MKMM    WKMM
     C                     MOVE @@MKDD    WKDD
     C                     MOVELWKYMD     @MEKBI
     C                     MOVE @@MKBB    @MEKBI
     C                     MOVE @@KAYY    WKYY
     C                     MOVE @@KAMM    WKMM
     C                     MOVE @@KADD    WKDD
     C                     MOVELWKYMD     @KAKBI
     C                     MOVE @@KABB    @KAKBI
     C                     MOVE @@BAN1    @BANTI
     C                     MOVE @@MNHZ    @NOYMD
     C                     MOVE @@HKAN    @HOKKB
     C                     MOVE @@KUBN    @HATYU
     C                     MOVE @@BRUI    @KANSY
     **
     C           $400S     TAG
     C                     EXFMTADAPW622
     C                     MOVE *BLANK    @ERR
     C           *IN03     CABEQ'0'       $400S
     C                     MOVE *ZERO     @RRN
     CSR                   ENDSR
**
*INQUIRY & UPDATE OF UNWRK ATT / UNWRK NGT ATT TRNS DATA*
IT IS NOT FOUND APPLICABLE DATA
APPLICABLE DATA DISPLAYED ENTIRELY
