     H            Y.
     F** ADAR43 ******************************
     F* CREATE OF UNWORKINGDAY ATTENDANCE AND UNWORKING NIGHT ATTENDANCE
     F* PROD ORDER BOOK LIST *
     F*                      PURCHASE KANBAN *
     F*  ADD TOTAL
     F****************************** ADAR43 **
     FADAWL40 IP  F     256            DISK
     FADAPR43 O   E             50     PRINTER
     E                    TBL     1   2 10
     IADAWL40 AA  01
     I                                       16  20 DAHIN1
     I                                       21  25 DAHIN2
     I                                       26  27 DAHIN3
     I                                       45  58 DAMAME
     I                                       59  64 DABAN1
     I                                       65  70 DABAN2
     I                                       71  750DASYUY
     I                                      103 1050DAKBMX
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 DAHIN1
     I                                        6   6 H1
     I                                        7  11 DAHIN2
     I                                       12  12 H2
     I                                       13  14 DAHIN3
     I            DS
     I                                        1   9 @KTKR
     I                                        1   1 @KTKR1
     I                                        2   2 @K1
     I                                        3   4 @KTKR2
     I                                        5   5 @K2
     I                                        6   7 @KTKR3
     I                                        8   8 @K3
     I                                        9   9 @KTKR4
     I            DS
     I                                        1   9 @TTKR
     I                                        1   1 @TTKR1
     I                                        2   2 @T1
     I                                        3   4 @TTKR2
     I                                        5   5 @T2
     I                                        6   7 @TTKR3
     I                                        8   8 @T3
     I                                        9   9 @TTKR4
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C/SPACE 1
     C           *ENTRY    PLIST
     C                     PARM           PARM1   1
     C                     PARM           PARM2   8
     C                     MOVE PARM2     @YMD
     C/SPACE 1
     C           PARM1     IFEQ 'R'
     C                     MOVELTBL,1     @NAME
     C                     END
     C           PARM1     IFEQ 'M'
     C                     MOVELTBL,2     @NAME
     C                     END
     C/SPACE 1
     C                     WRITEADAPR431
     C                     Z-ADD*ZERO     @GHAK
     C                     END
     C/SPACE 1
     C                     MOVE *BLANK    H1
     C                     MOVE *BLANK    H2
     C           DAHIN2    IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           DAHIN3    IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
     C/SPACE 1
     C                     MOVE DAMAME    @TENMI
     C/SPACE 1
     C                     MOVE DABAN1    WTKRO
     C                     MOVE *BLANK    @KTKR
     C                     MOVE WTKR1     @KTKR1
     C                     MOVE WTKR2     @KTKR2
     C                     MOVE WTKR3     @KTKR3
     C                     MOVE WTKR4     @KTKR4
     C/SPACE 1
     C*                    MOVEL@KTKR2    WTKR    1
     C*          WTKR      IFEQ '0'
     C*                    MOVEL' '       @KTKR2
     C*                    END
     C*                    MOVEL@KTKR3    WTKR
     C*          WTKR      IFEQ '0'
     C*                    MOVEL' '       @KTKR3
     C*                    END
     C*          @KTKR4    IFEQ '0'
     C*                    MOVE '-'       @K3
     C*                    MOVE *BLANK    @KTKR4
     C*                    END
     C/SPACE 1
     C           @KTKR2    IFNE *BLANK
     C                     MOVE '-'       @K1
     C                     END
     C           @KTKR3    IFNE *BLANK
     C                     MOVE '-'       @K2
     C                     END
     C           @KTKR4    IFNE *BLANK
     C                     MOVE '-'       @K3
     C                     END
     C/SPACE 1
     C                     MOVE DABAN2    WTKRO
     C                     MOVE *BLANK    @TTKR
     C                     MOVE WTKR1     @TTKR1
     C                     MOVE WTKR2     @TTKR2
     C                     MOVE WTKR3     @TTKR3
     C                     MOVE WTKR4     @TTKR4
     C/SPACE 1
     C*                    MOVEL@TTKR2    WTKR    1
     C*          WTKR      IFEQ '0'
     C*                    MOVEL' '       @TTKR2
     C*                    END
     C*                    MOVEL@TTKR3    WTKR
     C*          WTKR      IFEQ '0'
     C*                    MOVEL' '       @TTKR3
     C*                    END
     C*          @TTKR4    IFEQ '0'
     C*                    MOVE '-'       @T3
     C*                    MOVE *BLANK    @TTKR4
     C*                    END
     C/SPACE 1
     C           @TTKR2    IFNE *BLANK
     C                     MOVE '-'       @T1
     C                     END
     C           @TTKR3    IFNE *BLANK
     C                     MOVE '-'       @T2
     C                     END
     C           @TTKR4    IFNE *BLANK
     C                     MOVE '-'       @T3
     C                     END
     C/SPACE 1
     C           *IN50     IFEQ '1'
     C                     WRITEADAPR431
     C                     SETOF                     50
     C                     END
     C/SPACE 1
     C                     WRITEADAPR432
     C                     ADD  DAKBMX    @GHAK
     CLR                   WRITEADAPR433
** TBL
UNWRK ATT
UNWRK NGT
