     H            Y.
     FADHTL05 IF  E           K        DISK
     FABHTL02 IF  E           K        DISK
      *
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@BAN1  1
     C                     PARM           P@BAN2  2
     C                     PARM           P@BAN3  2
     C                     PARM           P@BAN4  1
     C                     PARM           P@HOJI  20
     C                     PARM           P@ONDO  30
     C                     PARM           P@CO2P  32
      *
     C                     Z-ADD0         P@HOJI
     C                     Z-ADD0         P@ONDO
     C                     Z-ADD0         P@CO2P
      *
     C                     MOVE P@HIN1    K@HIN1
     C                     MOVE P@HIN2    K@HIN2
     C                     MOVE P@HIN3    K@HIN3
      *
     C           HINKEY    KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *
     C                     SETOF                     77
     C                     EXSR #ADH
     C   77                EXSR #END
      *
     C                     SETOF                     77
     C                     EXSR #ABH
     C   77                EXSR #END
      *
     C                     EXSR #END
      *-----------------------------------------------------
     C           #ADH      BEGSR
      *
     C           HINKEY    SETLLADHTL05
     C                     DO   *HIVAL
     C           HINKEY    READEADHTL05                  88
     C   88                LEAVE
     C           J6SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           *DATE     IFGE J6UKHZ
     C           *DATE     ANDLTJ6STHZ
     C                     ELSE
     C                     ITER
     C                     END
      *
     C           P@BAN1    IFNE *BLANK
     C           P@BAN1    IFNE J6ATK1
     C           P@BAN2    ORNE J6ATK2
     C           P@BAN3    ORNE J6ATK3
     C           P@BAN4    ORNE J6ATK4
     C                     ITER
     C                     END
     C                     END
      *
     C                     Z-ADDJ6HOJI    P@HOJI
     C                     Z-ADDJ6ONDO    P@ONDO
     C                     Z-ADDJ6CO2P    P@CO2P
      *
     C                     SETON                     77
      *
     C                     ENDDO
      *
     C           EADH      ENDSR
      *-----------------------------------------------------
     C           #ABH      BEGSR
      *
     C           HINKEY    SETLLABHTL02
     C                     DO   *HIVAL
     C           HINKEY    READEABHTL02                  88
     C   88                LEAVE
     C           M6SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           *DATE     IFGE M6UKHZ
     C           *DATE     ANDLTM6STHZ
     C                     ELSE
     C                     ITER
     C                     END
      *
     C           P@BAN1    IFNE *BLANK
     C           P@BAN1    IFNE M6JBN1
     C           P@BAN2    ORNE M6JBN2
     C           P@BAN3    ORNE M6JBN3
     C           P@BAN4    ORNE M6JBN4
     C                     ITER
     C                     END
     C                     END
      *
     C                     Z-ADDM6HOJI    P@HOJI  20
     C                     Z-ADDM6ONDO    P@ONDO  30
     C                     Z-ADD0         P@CO2P
      *
     C                     SETON                     77
      *
     C                     ENDDO
      *
     C           EABH      ENDSR
      *-----------------------------------------------------
     C           #END      BEGSR
     C                     SETON                     LR
     C                     RETRN
     C                     ENDSR
