     H            Y.
     F*** ADHR40 *************************************
     F*   TRANSMIT OF HEAT TREATMENT RECORD          *
     F*        A.MAMIYA              2000/09/26      *
     F************************************* ADHR40 ***
     FADHWP40 IP  F     300            DISK
     FADHPPNO UF  E           K        DISK                      A
     FADHPL12 IF  E           K        DISK                      A
     IADHWP40 AA  01
     I                                        1   2 ILONO
     I                                        3   60ISAYY
     I                                        7   80ISAMM
     I                                        9  100ISADD
     I                                       11  11 IHIYO
     I                                       12  31 ISANM
     I                                       12  350ILTN1
     I                                       16  390ILTN2
     I                                       40  44 ISHN1
     I                                       46  50 ISHN2
     I                                       52  53 ISHN3
     I                                       54  68 IZANM
     I                                       69  720IHAKO
     I                                       73  781IJURY
     I                                       79  800IKAHH
     I                                       81  820IKAMM
     I                                       83  840IENHH
     I                                       85  860IENMM
     I                                       87  890IWAIT
     I                                       90  930IONDO
     I                                       94 101 ITG01
     I                                      102 109 ITG02
     I                                      110 117 ITG03
     I                                      118 125 ITG04
     I                                      126 133 ITG05
     I                                      134 141 ITG06
     I                                      142 149 ITG07
     I                                      150 157 ITG08
     I                                      158 165 ITG09
     I                                      166 173 ITG10
     I                                      174 181 ITG11
     I                                      182 189 ITG12
     I                                      190 197 ITG13
     I                                      198 205 ITG14
     I                                      206 213 ITG15
     I                                      214 221 ITG16
     I                                      222 229 ITG17
     I                                      230 237 ITG18
     I                                      238 245 ITG19
     I                                      246 253 ITG20
     I                                      254 261 ITG21
     I                                      262 269 ITG22
     I                                      270 277 ITG23
     I                                      278 285 ITG24
     I                                      286 2890IKOJO
     I            DS
     I                                        1   80ADSKHZ
     I                                        1   40ADSKYY
     I                                        5   60ADSKMM
     I                                        7   80ADSKDD
     I            DS
     I                                        1   80ADKOHZ
     I                                        1   40ADKOYY
     I                                        5   60ADKOMM
     I                                        7   80ADKODD
     I            DS
     I                                        1   60ADKOTI
     I                                        1   20ADKOHH
     I                                        3   40ADKOSS
      *
     C           *ENTRY    PLIST
     C                     PARM           IUSER  10
      *
     C                     MOVEL*YEAR     WYEAR   40
     C                     MOVELUMONTH    WMONTH  20
      *
     C                     MOVELIUSER     WKOME  10
     C                     MOVELILONO     WLONO   2
     C                     Z-ADDISAYY     WSAYY   40
     C                     Z-ADDISAMM     WSAMM   20
     C                     Z-ADDISADD     WSADD   20
     C                     MOVELIHIYO     WHIYO   1
     C                     MOVELISANM     WSANM  20
     C                     Z-ADDILTN1     WLTN1   40
     C                     Z-ADDILTN2     WLTN2   40
     C                     MOVELISHN1     WSHN1   5
     C                     MOVELISHN2     WSHN2   5
     C                     MOVELISHN3     WSHN3   2
     C                     MOVELIZANM     WZANM  15
     C                     Z-ADDIHAKO     WHAKO   40
     C                     Z-ADDIJURY     WJURY   61
     C                     Z-ADDIKAHH     WKAHH   20
     C                     Z-ADDIKAMM     WKAMM   20
     C                     Z-ADDIENHH     WENHH   20
     C                     Z-ADDIENMM     WENMM   20
     C                     Z-ADDIWAIT     WWAIT   30
     C                     Z-ADDIONDO     WONDO   40
     C                     MOVELITG01     WTG01   8
     C                     MOVELITG02     WTG02   8
     C                     MOVELITG03     WTG03   8
     C                     MOVELITG04     WTG04   8
     C                     MOVELITG05     WTG05   8
     C                     MOVELITG06     WTG06   8
     C                     MOVELITG07     WTG07   8
     C                     MOVELITG08     WTG08   8
     C                     MOVELITG09     WTG09   8
     C                     MOVELITG10     WTG10   8
     C                     MOVELITG11     WTG11   8
     C                     MOVELITG12     WTG12   8
     C                     MOVELITG13     WTG13   8
     C                     MOVELITG14     WTG14   8
     C                     MOVELITG15     WTG15   8
     C                     MOVELITG16     WTG16   8
     C                     MOVELITG17     WTG17   8
     C                     MOVELITG18     WTG18   8
     C                     MOVELITG19     WTG19   8
     C                     MOVELITG20     WTG20   8
     C                     MOVELITG21     WTG21   8
     C                     MOVELITG22     WTG22   8
     C                     MOVELITG23     WTG23   8
     C                     MOVELITG24     WTG24   8
     C                     Z-ADDIKOJO     WKOJO   40
      *
     C           KEY1      KLIST
     C                     KFLD           WLONO
     C                     KFLD           WSAYY
     C                     KFLD           WSAMM
     C                     KFLD           WSADD
     C                     KFLD           WHIYO
     C                     KFLD           WSANM
     C                     KFLD           WLTN1
     C                     KFLD           WLTN2
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           WZANM
     C                     KFLD           WHAKO
     C                     KFLD           WJURY
     C                     KFLD           WKAHH
     C                     KFLD           WKAMM
     C                     KFLD           WENHH
     C                     KFLD           WENMM
     C                     KFLD           WWAIT
     C                     KFLD           WONDO
     C                     KFLD           WTG01
     C                     KFLD           WTG02
     C                     KFLD           WTG03
     C                     KFLD           WTG04
     C                     KFLD           WTG05
     C                     KFLD           WTG06
     C                     KFLD           WTG07
     C                     KFLD           WTG08
     C                     KFLD           WTG09
     C                     KFLD           WTG10
     C                     KFLD           WTG11
     C                     KFLD           WTG12
     C                     KFLD           WTG13
     C                     KFLD           WTG14
     C                     KFLD           WTG15
     C                     KFLD           WTG16
     C                     KFLD           WTG17
     C                     KFLD           WTG18
     C                     KFLD           WTG19
     C                     KFLD           WTG20
     C                     KFLD           WTG21
     C                     KFLD           WTG22
     C                     KFLD           WTG23
     C                     KFLD           WTG24
     C                     KFLD           WKOJO
      *
     C                     SETOF                     10
     C           KEY1      CHAINADHPL121             10
     C           *IN10     IFEQ '0'
     C           ADSKJY    ANDEQ'D'
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     GOTO @END
     C                     END
      *
     C           KEY2      KLIST
     C                     KFLD           WYEAR
     C                     KFLD           WMONTH
      *
     C                     SETOF                     10
     C           KEY2      CHAINADHPPNO1             10
     C           *IN10     IFEQ '0'
     C           AERECD    ADD  1         AERECD
     C                     UPDATADHPPNO1
     C                     ELSE
     C                     Z-ADDWYEAR     AEDTYY
     C                     Z-ADDWMONTH    AEDTMM
     C                     Z-ADD1         AERECD
     C                     WRITEADHPPNO1
     C                     END
      *
     C                     MOVEL*BLANK    ADSKJY
     C                     Z-ADD0         ADSKHZ
     C                     MOVEL*DATE     ADKOHZ
     C                     TIME           ADKOTI
     C                     MOVELWKOME     ADKOME
     C                     MOVELWLONO     ADLONO
     C                     Z-ADDWSAYY     ADSAYY
     C                     Z-ADDWSAMM     ADSAMM
     C                     Z-ADDWSADD     ADSADD
     C                     MOVELWHIYO     ADHIYO
     C                     MOVELWSANM     ADSANM
     C                     Z-ADDWLTN1     ADLTN1
     C                     Z-ADDWLTN2     ADLTN2
     C                     MOVELWSHN1     ADSHN1
     C                     MOVELWSHN2     ADSHN2
     C                     MOVELWSHN3     ADSHN3
     C                     MOVELWZANM     ADZANM
     C                     Z-ADDWHAKO     ADHAKO
     C                     Z-ADDWJURY     ADJURY
     C                     Z-ADDWKAHH     ADKAHH
     C                     Z-ADDWKAMM     ADKAMM
     C                     Z-ADDWENHH     ADENHH
     C                     Z-ADDWENMM     ADENMM
     C                     Z-ADDWWAIT     ADWAIT
     C                     Z-ADDWONDO     ADONDO
     C                     MOVELWTG01     ADTG01
     C                     MOVELWTG02     ADTG02
     C                     MOVELWTG03     ADTG03
     C                     MOVELWTG04     ADTG04
     C                     MOVELWTG05     ADTG05
     C                     MOVELWTG06     ADTG06
     C                     MOVELWTG07     ADTG07
     C                     MOVELWTG08     ADTG08
     C                     MOVELWTG09     ADTG09
     C                     MOVELWTG10     ADTG10
     C                     MOVELWTG11     ADTG11
     C                     MOVELWTG12     ADTG12
     C                     MOVELWTG13     ADTG13
     C                     MOVELWTG14     ADTG14
     C                     MOVELWTG15     ADTG15
     C                     MOVELWTG16     ADTG16
     C                     MOVELWTG17     ADTG17
     C                     MOVELWTG18     ADTG18
     C                     MOVELWTG19     ADTG19
     C                     MOVELWTG20     ADTG20
     C                     MOVELWTG21     ADTG21
     C                     MOVELWTG22     ADTG22
     C                     MOVELWTG23     ADTG23
     C                     MOVELWTG24     ADTG24
     C                     Z-ADDWKOJO     ADKOJO
     C                     Z-ADD*YEAR     ADDTYY
     C                     Z-ADDUMONTH    ADDTMM
     C                     Z-ADDUDAY      ADDTDD
     C                     Z-ADDAERECD    ADRECD
      *
     C                     WRITEADHPL121
      *
     C           @END      TAG
