     H            Y.
     FADHPL03 IP  E                    DISK
     FFCEPL01 IF  E           K        DISK
     FADHWPS1 O   F    2048            DISK
      *
     C           J6SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
      *
     C           J6SBIN    IFNE 99
     C                     GOTO @END
     C                     END
      *
     C           J6SYOS    IFEQ 0
     C                     GOTO @END
     C                     END
      *
     C****       J6KTSU    DIV  20        W@KTSU  90
     C           J6KSSU    DIV  20        W@KTSU  90
     C           W@KTSU    DIV  J6SYOS    O@BXPD  51
      *
     C                     SETOF                     66
      *
     C                     MOVE J6SHN1    P@HIN1  5
     C                     MOVE J6SHN2    P@HIN2  5
     C                     MOVE J6SHN3    P@HIN3  2
     C                     MOVE *BLANK    P@BAN1  1
     C                     MOVE *BLANK    P@BAN2  2
     C                     MOVE *BLANK    P@BAN3  2
     C                     MOVE *BLANK    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'OQ '     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
      *
     C           AAMRS9    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@BAN1  1
     C                     PARM           P@BAN2  2
     C                     PARM           P@BAN3  2
     C                     PARM           P@BAN4  1
     C                     PARM           P@BMON  4
     C                     PARM           P@KOTE  3
     C                     PARM           P@KIBN  3
     C                     PARM           P@KHIN 12
      *
     C           P@BMON    IFNE *BLANK
     C                     GOTO @OK
     C                     END
      *
     C                     MOVE *BLANK    P@BAN1  1
     C                     MOVE *BLANK    P@BAN2  2
     C                     MOVE *BLANK    P@BAN3  2
     C                     MOVE *BLANK    P@BAN4  1
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE 'LOQ'     P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C                     MOVE *BLANK    P@KHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
      *
     C           P@BMON    IFNE *BLANK
     C                     SETON                     66
     C                     END
      *
     C           P@BMON    IFEQ *BLANK
     C                     MOVE *BLANK    P@BMON  4
     C                     MOVE *BLANK    P@KOTE  3
     C                     MOVE *BLANK    P@KIBN  3
     C* * *                GOTO @END
     C                     END
      *
     C           @OK       TAG
      *
     C           FCEKEY    KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
     C                     Z-ADD0         O@TANJ  72
     C           FCEKEY    CHAINFCEPL01              44
     C   44                Z-ADD0         A2SOZI
     C   44                Z-ADD0         A2KASI
      *
     C           J6HKKB    IFEQ 'S'
     C                     Z-ADDA2SOZI    O@TANJ
     C                     END
     C           J6HKKB    IFEQ 'K'
     C                     Z-ADDA2KASI    O@TANJ
     C                     END
      *
     C  N77                EXCPTOHED
     C                     SETON                     77
     C                     EXCPTODAT
      *
     C           @END      TAG
      *
     OADHWPS1 E                OHED
     O                                      'PARTS#,'
     O                                      'LOCATION,'
     O                                      'WEIGHT/PCS,'
     O                                      'KANBAN#,'
     O                                      'SET#/M,'
     O                                      'QTY/BOX,'
     O                                      'BOX/DAY,'
     O                                      'LOT,'
     O                                      'SUPPLIER,'
     O                                      'PROCESS,'
     O                                      'LINE,'
     O                                      'TIME,'
     O                                      'TEMP,'
     O                                      'CO2,'
     OADHWPS1 E                ODAT
      *
     O                                      '="'
     O                         J6SHN1
     O                         J6SHN2
     O                         J6SHN3
     O                                      '"'
     O                                      ','
     O                                      '="'
     O                         J6ATK2
     O                                      '-'
     O                         J6ATK3
     O                                      '"'
     O                                      ','
     O                         O@TANJ       '   0 .  '
     O                                      ','
     O                         J6KMAX
     O                                      ','
     O****                     J6KTSU
     O                         J6KSSU
     O                                      ','
     O                         J6SYOS
     O                                      ','
     O                         O@BXPD       '  0 . '
     O                                      ','
     O                         J6LOTO
     O                                      ','
     O                         P@BMON
     O                                      ','
     O                         P@KOTE
     O                                      ','
     O                         P@KIBN
     O                                      ','
     O                         J6HOJI
     O                                      ','
     O                         J6ONDO
     O                                      ','
     O                         J6CO2P       '0 . '
     O                                      ','
