     H            Y.
      ** ADHR80 *******************************************************
      * QUENCHING CONDITION M/F UPDATE
      *  KIRI                                            2017.08.09
      *****************************************************************
     FADHPP8X UP  E                    DISK
      *
      * QUENCHING CONDITION M/F      *
     FADHPL80 IF  E           K        DISK
      *===============================================================
     C           KEY15     KLIST
     C                     KFLD           X6ZAIC  3
     C                     KFLD           K6KIKI  31
      *
     C                     MOVELX6KIKI    WKIKI   20
     C                     Z-ADDWKIKI     K6KIKI
     C                     MOVEL*BLANK    X6AAAA
  3  C*
     C           KEY15     SETLLADHPL80
  3  C                     DO   *HIVAL
     C           KEY15     READEADHPL80                  60
     C   60                LEAVE
     C*
     C           J8SKJY    IFEQ 'D'
     C           J8SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C*
     C           X6HOJI    IFEQ J8HOJI
     C           X6ONDO    ANDEQJ8ONDO
     C           X6CO2P    ANDEQJ8CO2P                     CO2
     C           X6KIK1    ANDEQJ8KIK1
     C           X6KIK2    ANDEQJ8KIK2
     C                     MOVEL'1'       X6AAAA
     C                     UPDATADHPP8X1
     C                     LEAVE
     C                     ELSE
     C                     ITER
     C                     ENDIF
     C*
     C                     ENDDO
     C*
