     H            Y.
     F** ADKR90 **********************************
     F*A-PICS実行日付・便の取得（実行時間から）*
     F*    KATOGI.      2015.12.16               *
     F********************************************
     FAAIPL11 IF  E           K        DISK
     E                    CDBI       24  2 0             ﾍﾞ] xb     (ncﾆﾞl)
      *
     I            DS
     I                                        1  48 CDBI
     I                                        1   20CDBI01
     I                                        3   40CDBI02
     I                                        5   60CDBI03
     I                                        7   80CDBI04
     I                                        9  100CDBI05
     I                                       11  120CDBI06
     I                                       13  140CDBI07
     I                                       15  160CDBI08
     I                                       17  180CDBI09
     I                                       19  200CDBI10
     I                                       21  220CDBI11
     I                                       23  240CDBI12
     I                                       25  260CDBI13
     I                                       27  280CDBI14
     I                                       29  300CDBI15
     I                                       31  320CDBI16
     I                                       33  340CDBI17
     I                                       35  360CDBI18
     I                                       37  380CDBI19
     I                                       39  400CDBI20
     I                                       41  420CDBI21
     I                                       43  440CDBI22
     I                                       45  460CDBI23
     I                                       47  480CDBI24
      *
     I            DS
     I                                        1   80CDTOHZ
     I                                        1   40CDTOYY
     I                                        5   60CDTOMM
     I                                        7   80CDTODD
      *
     I            DS
     I                                        1   40HHMM1
     I                                        1   20HH1
     I                                        3   40MM1
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1TIME  4
     C                     PARM           P1APHZ  80
     C                     PARM           P1APBN  20
      *
     C                     TIME           SDATE
     C                     EXSR #SB120
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------*
      * AAIPL11                           *
      *-----------------------------------*
     CSR         #SB120    BEGSR
      *
     C                     Z-ADD0         P1APHZ
     C                     Z-ADD0         P1APBN
     C                     MOVELP1TIME    HHMM1
     C           0111      CHAINAAIPL111             49
     C           *IN49     IFEQ '0'
     C                     Z-ADDCDTOHZ    P1APHZ
     C                     MOVE CDBI,HH1  P1APBN
     C                     ENDIF
      *
     CSR         ESB120    ENDSR
