     H            Y.
     F** ADKRA2D *************************************
     F*DOWNLOAD ADKWPA0 (HIGH LIMIT DATA) TO CSV   *
     F*  JW       2025.02.05                         *
     F************************************************
     FADKWPA0 IF  E           K        DISK
     FADKWPA1 O   E                    DISK
      *
     E                    MSG     1  11 65
      *
     I            DS
     I                                        1  12 W0SHIN
     I                                        1   5 W0SHN1
     I                                        6  10 W0SHN2
     I                                       11  12 W0SHN3
      *
     I           SDS
     I                                     *PROGRAM #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------*
      * MAIN ROUTINE                                       *
      *----------------------------------------------------*
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLADKWPA0
     C                     DO   *HIVAL
     C                     READ ADKWPA0                  98
     C   98                LEAVE
      *
     C                     EXSR #OUT
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * OUTPUT ADKWPA1 (WF)                                *
      *----------------------------------------------------*
     C           #OUT      BEGSR
      *
     C                     CLEARADKWPA11
     C                     MOVELW0SHIN    $SHIN
     C                     CALL 'EDTR02'
     C                     PARM           $SHIN  12
     C                     PARM           $SHIN2 14
     C                     MOVEL$SHIN2    W1SHIN
      *
     C                     MOVELW0SYUY    W1SYUY
     C                     MOVELW0BARL    W1BARL
     C                     MOVELW0NSRY    W1NSRY
     C                     MOVELW0HASU    W1HASU
     C                     MOVELW0SRYO    W1SRYO
     C                     MOVELW0BSRY    W1BSRY
     C                     MOVELW0LIMT    W1LIMT
     C                     MOVELW0SRYA    W1SRYA
     C                     MOVELW0HKSA    W1HKSA
     C                     MOVELW0CUT     W1CUT
      *
     C                     Z-ADDW0CUTH    $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     MOVEL$TRUE     W1CUTH
      *
     C                     Z-ADDW0BOXD    $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN
     C                     PARM           $TRUE
     C                     MOVEL$TRUE     W1BOXD
      *
     C                     Z-ADDW0DOH     $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN
     C                     PARM           $TRUE
     C                     MOVEL$TRUE     W1DOH
      *
     C                     MOVELW0HASA    W1HASA
     C                     MOVELW0APHZ    W1APHZ
     C                     MOVELW0APBN    W1APBN
     C                     MOVELW0GEKN    W1GEKN
     C                     MOVELW0SETD    W1SETD
     C                     MOVELW0TIMS    W1TIMS
     C                     MOVELW0HND     W1HND
     C                     MOVELW0RNJ     W1RNJ
     C                     MOVELW0MAX     W1MAX
      *
     C           W1MAX     IFLT W1CUTH
     C                     MOVEL'*'       W1OFLG
     C                     ELSE
     C                     MOVE *BLANK    W1OFLG
     C                     ENDIF
      *
     C                     WRITEADKWPA11
      *
     C                     ENDSR
      *----------------------------------------------------*
      * HEADER                                             *
      *----------------------------------------------------*
     C           #HEAD     BEGSR
      *
     C                     CLEARADKWPA11
     C                     MOVEL'IAF_PART'W1SHIN
     C                     MOVEL'QPC     'W1SYUY
     C                     MOVEL'BARREL  'W1BARL
     C                     MOVEL'QTY1    'W1NSRY
     C                     MOVEL'FRACTION'W1HASU
     C                     MOVEL'TTL_QTY 'W1SRYO
     C                     MOVEL'BAR_QTY 'W1BSRY
     C                     MOVELMSG,5     W1LIMT
     C                     MOVEL'QTY3    'W1SRYA
     C                     MOVEL'ISSUED  'W1HKSA
     C                     MOVEL'CUT     'W1CUT
     C                     MOVEL'OVER_LMT'W1CUTH
     C                     MOVEL'BAR_FRAC'W1HASA
     C                     MOVEL'APICS_DT'W1APHZ
     C                     MOVEL'APICS_BN'W1APBN
     C                     MOVELMSG,1     W1GEKN
     C                     MOVELMSG,2     W1SETD
     C                     MOVELMSG,3     W1BOXD
     C                     MOVELMSG,4     W1DOH
     C                     MOVEL'TIMES   'W1TIMS
     C                     MOVEL'H_SHEETS'W1HND
     C                     MOVEL'R_SHEETS'W1RNJ
     C                     MOVEL'MAX     'W1MAX
     C                     MOVEL'OVER_FLG'W1OFLG
     C                     MOVEL#PGM      W1NOTE
     C                     WRITEADKWPA11
      *
     C                     ENDSR
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C                     EXSR #HEAD
      *
     C                     ENDSR
** MSG
MONTHLY_SET
DAILY_SET
DAILY_BOX
DAY_OF_HAND
LIMIT/BIN


