     H            Y.
     F** ADKRA4 **********************************
     F*上限カット照会                          *
     F*    KATOGI.      2015.12.16               *
     F********************************************
     FADKWPA0 UF  E                    DISK
     FAGAPL31 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     E                    OKT        15  3               工程
     E                    OTK        15  6               所番地
     E                    OSY        15  1               か種
      *
     I            DS
     I                                        1  100W0AP
     I                                        1   80W0APHZ
     I                                        9  100W0APBN
      *
     I            DS
     I                                        1  100A3UK
     I                                        1   80A3UKHZ
     I                                        9  100A3UBIN
      *
     I            DS
     I                                        1  100A3ST
     I                                        1   80A3STHZ
     I                                        9  100A3SBIN
      *
     I            DS
     I                                        1  100L6UK
     I                                        1   80L6UKHZ
     I                                        9  100L6UBIN
      *
     I            DS
     I                                        1  100L6ST
     I                                        1   80L6STHZ
     I                                        9  100L6SBIN
      *
     I            DS
     I                                        1  100L5UK
     I                                        1   80L5UKHZ
     I                                        9  100L5UBIN
      *
     I            DS
     I                                        1  100L5ST
     I                                        1   80L5STHZ
     I                                        9  100L5SBIN
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WDATE
     C                     MOVEL'1'       OPNCLS
      *
     C                     READ ADKWPA01                 80
     C           *IN80     DOWEQ'0'
     C                     Z-ADD0         W0MAX
     C                     EXSR #SB400
     C                     UPDATADKWPA01
     C                     READ ADKWPA01                 80
     C                     ENDDO
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRS0'
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYSHN    KLIST
     C                     KFLD           W0SHN1
     C                     KFLD           W0SHN2
     C                     KFLD           W0SHN3
     C           KEYSHN    CHAINAGAPL311             22
     C           *IN22     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     22
     C                     ENDIF
     C           *IN22     IFEQ '1'
     C                     GOTO ESB400
     C                     ENDIF
      *
     C                     CLEAROKT
     C                     CLEAROTK
     C                     CLEAROSY
     C                     MOVE W0AP      INYMDB
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           W0SHN1  5
     C                     PARM           W0SHN2  5
     C                     PARM           W0SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C           STATUS    IFEQ '9'
     C                     GOTO ESB400
     C                     ENDIF
      *
     C                     MOVEAPKOT      OKT
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSY
      *
     C                     Z-ADD0         IDX1    30
     C                     Z-ADD15        X       30
     C                     MOVEL'0'       GET     1
     C           X         DOWGE1
     C           IDX1      ANDEQ0
     C           OSY,X     IFEQ CBKDAI
     C                     Z-ADDX         IDX1
     C                     MOVELOTK,X     WKTKR
     C                     MOVELOSY,X     WKSY    1
     C                     EXSR #SB490
     C                     ENDIF
     C                     SUB  1         X
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *ロット                                            *
      *----------------------------------------------------*
     CSR         #SB490    BEGSR
      *
     C           KEYT      KLIST
     C                     KFLD           WKTKR1
     C                     KFLD           WKTKR2
     C                     KFLD           WKTKR3
     C                     KFLD           WKTKR4
      *
     C                     Z-ADD0         WKLOT   30
     C                     SELEC
      *めっき
     C           WKSY      WHEQ 'C'
     C           KEYT      SETGTAAFPL031
     C           KEYT      REDPEAAFPL031                 83
     C           *IN83     DOWEQ'0'
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     ELSE
     C           A3UK      IFLE W0AP
     C           A3ST      ANDGTW0AP
     C                     Z-ADDA3MAXH    W0MAX
     C                     ENDIF
     C                     ENDIF
     C           KEYT      REDPEAAFPL031                 83
     C                     ENDDO
      *引取り
     C           WKSY      WHEQ 'E'
     C           KEYT      SETGTAAHPL031
     C           KEYT      REDPEAAHPL031                 83
     C           *IN83     DOWEQ'0'
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    ANDLE*DATE
     C                     ELSE
     C           L6UK      IFLE W0AP
     C           L6ST      ANDGTW0AP
     C                     Z-ADDL6MAXH    W0MAX
     C                     ENDIF
     C                     ENDIF
     C           KEYT      REDPEAAHPL031                 83
     C                     ENDDO
      *完成品
     C           WKSY      WHEQ '0'
     C           KEYT      SETGTAAPPL031
     C           KEYT      REDPEAAPPL031                 83
     C           *IN83     DOWEQ'0'
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    ANDLE*DATE
     C                     ELSE
     C           L5UK      IFLE W0AP
     C           L5ST      ANDGTW0AP
     C                     Z-ADDL5UZAR    W0MAX
     C                     ENDIF
     C                     ENDIF
     C           KEYT      REDPEAAPPL031                 83
     C                     ENDDO
      *
     C                     ENDSL
      *
     CSR         ESB490    ENDSR
