     H            Y.
     F** ADKRA3 **************************************
     F*上限カット照会                              *
     F*       KATOGI.       2015.12.21               *
     F************************************************
     FADKPWA3 CF  E                    WORKSTN
     FADKPL01 IF  E           K        DISK
     FADKPL22 IF  E           K        DISK
      *
     I            DS
     I                                        1  100D1AP
     I                                        1   80D1APHZ
     I                                        9  100D1APBN
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              X'0E0F40'             C         WKCKCH
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1APHZ  80
     C                     PARM           P1APBN  20
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P1HND   30
     C                     PARM           P1RNJ   30
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           KEYD2     KLIST
     C                     KFLD           K1SHN1  5
     C                     KFLD           K1SHN2  5
     C                     KFLD           K1SHN3  2
     C                     KFLD           K1APHZ  80
     C                     KFLD           K1APBN  20
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
     C                     Z-ADDP1APHZ    K1APHZ
     C                     Z-ADDP1APBN    K1APBN
     C                     MOVELP1SHN1    K1SHN1
     C                     MOVELP1SHN2    K1SHN2
     C                     MOVELP1SHN3    K1SHN3
      *
     C                     Z-ADDP1APHZ    D1APHZ
     C                     Z-ADDP1APBN    D1APBN
     C                     MOVEL*BLANK    D1SHN
     C                     MOVELP1SHN1    D1SHN
     C           D1SHN     CAT  '-':0     D1SHN
     C           D1SHN     CAT  P1SHN2:0  D1SHN
     C           P1SHN3    IFNE *BLANK
     C           D1SHN     CAT  '-':0     D1SHN
     C           D1SHN     CAT  P1SHN3:0  D1SHN
     C                     ENDIF
      *
     C           KEYD2     SETLLADKPL221
     C           KEYD2     READEADKPL221                 80
     C           *IN80     DOWEQ'0'
     C           D2SKJY    IFEQ 'D'
     C           D2SKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADDD2SYUY    D1SYUY
     C                     Z-ADDD2BARL    D1BARL
     C                     Z-ADDD2LIMD    D1LIMD
     C                     Z-ADDD2LIMB    D1LIMB
     C           D1LIMD    DIV  D1SYUY    D1LIDH
     C           D1LIMB    DIV  D1SYUY    D1LIBH
     C                     Z-ADDD2HASU    D1HASU
     C                     Z-ADDD2HKSA    D$HKSA
     C                     Z-ADDD2SRYA    D$SRYA
     C                     Z-ADDD2CUT     D$CUT
     C                     Z-ADDD2HASA    D$HASA
     C                     ENDIF
     C           KEYD2     READEADKPL221                 80
     C                     ENDDO
      *ＡＵ＃ＰＰ１１から抜き出した情報
     C           KEYD2     SETLLADKPL011
     C           KEYD2     READEADKPL011                 80
     C           *IN80     DOWEQ'0'
     C           D0SKJY    IFEQ 'D'
     C           D0SKHZ    ANDLE*DATE
     C                     ELSE
     C                     SELEC
      *受注
     C           D0GYOM    WHEQ '04'
     C                     ADD  D0SRYO    D1GY04
      *出荷照合
     C           D0GYOM    WHEQ '05'
     C                     ADD  D0SRYO    D1GY04
     C           D0GYOM    WHEQ '51'
     C                     ADD  D0SRYO    D1GY04
      *造り過ぎ・再手配
     C           D0GYOM    WHEQ '20'
     C                     ADD  D0SRYO    D1GY20
      *生管在調
     C           D0GYOM    WHEQ '23'
     C                     ADD  D0SRYO    D1GY20
      *造り過ぎ
     C           D0GYOM    WHEQ '32'
     C                     ADD  D0SRYO    D1GY20
      *造り過ぎ
     C           D0GYOM    WHEQ '29'
     C                     ADD  D0SRYO    D1GY20
      *上限カット
     C           D0GYOM    WHEQ '45'
     C                     ADD  D0SRYO    D1GY45
      *計画発行
     C           D0GYOM    WHEQ '27'
     C                     ADD  D0SRYO    D1GY27
      *か増減
     C           D0GYOM    WHEQ '13'
     C                     ADD  D0SRYO    D1GY13
      *売上
     C           D0GYOM    WHEQ '12'
     C                     ADD  D0SRYO    D1GY12
      *臨増減
     C           D0GYOM    WHEQ '16'
     C                     ADD  D0SRYO    D1GY16
      *その他
     C                     OTHER
     C                     ADD  D0SRYO    D1OTHR
     C                     ENDSL
     C                     ENDIF
     C           KEYD2     READEADKPL011                 80
     C                     ENDDO
      *
     C                     Z-ADD0         D1ALL
     C                     ADD  D1GY04    D1ALL
     C                     ADD  D1GY20    D1ALL
     C                     ADD  D1GY45    D1ALL
     C                     ADD  D1GY27    D1ALL
     C                     ADD  D1GY13    D1ALL
     C                     ADD  D1GY12    D1ALL
     C                     ADD  D1GY16    D1ALL
     C                     ADD  D1HASU    D1ALL
     C                     ADD  D1OTHR    D1ALL
      *直接入力　臨時かんばん
     C                     Z-ADDP1HND     D$HNDH
     C                     Z-ADDP1RNJ     D$RNJH
     C           D$HNDH    MULT D1SYUY    D$HNDS
     C           D$RNJH    MULT D1SYUY    D$RNJS
     C                     Z-ADDD$HNDS    D1HND
     C                     Z-ADDD$RNJS    D1RNJ
     C                     ADD  D1HND     D1ALL
     C                     ADD  D1RNJ     D1ALL
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * 1ST.                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTADKPWA31
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1ERR
      * F3
     C           *IN03     IFEQ '1'
JW   C           *IN12     OREQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
