     H            Y.
     F** ADKR40 **************************************
     F*上限係数マスター更新
     F*      KATOGI.        2016.02.12               *
     F****************************************************
     F* 改善シート24132 OWKのための上限カット係数変更*
     F* 2024.10.07 T.ASAI                                *
     F****************************************************
     FADKPW40 CF  E                    WORKSTN
     FADKPP40 UF  E           K        DISK                      A
     FAGAPL31 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     F*<<OWK対象品番マスタ―>>*
     FAGAPL41 IF  E           K        DISK
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
      *
     C                     Z-ADD0         D1TOTL 122
     C                     Z-ADD0         D1KSUD
     C                     Z-ADD0         D1KSUB
      *
      *****************************************
      * 24132:OWK用の変数の初期化
      * 2024.10.07 T.ASAI
      *****************************************
     C                     Z-ADD0         D1OWKA 122
     C                     Z-ADD0         D1OWKP
     C                     Z-ADD0         D1OWKT
     C                     Z-ADD0         D1OWKL
      *日
     C                     MOVEL'PART#'   KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD@KSU     D1KSUD
     C                     ENDIF
     C                     Z-ADDD1KSUD    WKKSUD  52
      *工程
     C                     MOVEL'PROCESS' KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD@KSU     D1KSUP
     C                     ENDIF
     C                     Z-ADDD1KSUP    WKKSUP  52
      *便
     C                     MOVEL'TOTAL'   KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD@KSU     D1KSUB
     C                     ENDIF
     C                     Z-ADDD1KSUB    WKKSUB  52
      *
      ****************************************
      * 24132:OWK用の係数値の表示
      *標識を使ったA-PICSとOWKの処理の分割
      * 2024.10.07 T.ASAI
      ****************************************
     C                     CALL 'ADKR4G'
     C                     PARM           D1OWKP
     C                     PARM           D1OWKL
     C                     PARM           D1OWKT
      *
     C                     Z-ADDD1OWKP    OWKSUD  52
     C                     Z-ADDD1OWKL    OWKSUB  52
     C                     Z-ADDD1OWKT    OWKSUP  52
      *
     C                     EXSR #SB790
     C                     SETON                     66
     C                     EXSR #SB110
     C                     EXSR #SB111
     C                     SETOF                     66
     C                     SETON                     67
     C                     EXSR #SB110
     C                     EXSR #SB111
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C           *IN66     IFEQ '1'
     C                     Z-ADD0         WKTOTL 122
     C           *LOVAL    SETLLAGAPL311
     C                     READ AGAPL311                 22
     C           *IN22     DOWEQ'0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AGAPL311                 22
     C                     ENDDO
     C                     ENDIF
      *
      ********************************************
      * 24132:OWKの品番読み取り
      * 2024.10.09 T.ASAI
      ********************************************
      *
     C           *IN67     IFEQ '1'
     C                     Z-ADD0         OWKTTL 122
     C           *LOVAL    SETLLAGAPL411
     C                     READ AGAPL411                 22
     C           *IN22     DOWEQ'0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AGAPL411                 22
     C                     ENDDO
     C                     ENDIF
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB111    BEGSR
      *
     C           *IN66     IFEQ '1'
     C                     Z-ADD0         WKSETB 122
     C           WKBINS    IFNE 0
     C           WKTOTL    DIV  WKBINS    WKSETB
     C                     ENDIF
     C****       WKTOTL    MULT WKKSUD    D1LIMD 122
     C           WKTOTL    MULT WKKSUB    D1LIMD 122
     C           WKSETB    MULT WKKSUB    D1LIMT 122
     C                     ENDIF
      *
      *********************************************
      * 24132:OWK日当たり・便あたり箱数の算出
      * 2024.10.09 T.ASAI
      *********************************************
      *
     C           *IN67     IFEQ '1'
     C                     Z-ADD0         OWKETB 122
     C           WKBINS    IFNE 0
     C           OWKTTL    DIV  WKBINS    OWKETB
     C                     ENDIF
     C           OWKTTL    MULT OWKSUP    D1OWKB 122
     C           OWKETB    MULT OWKSUP    D1OWKC 122
     C                     ENDIF
      *
     CSR         ESB111    ENDSR
      *-----------------------------------*
      *                                   *
      *-----------------------------------*
     CSR         #SB400    BEGSR
      *部品Ｍ
     C           KEYSHN    KLIST
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
     C           KEYSHN    CHAINFCEPL011             22
     C           *IN22     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     22
     C                     ENDIF
     C           *IN22     IFEQ '1'
     C                     GOTO ESB400
     C                     ENDIF
      *便数
     C           *IN66     IFEQ '1'
     C                     Z-ADDWKCIBI    WKBINS  20
     C                     ENDIF
      *設定数
     C                     Z-ADD0         WKGEKN 120
     C                     Z-ADD0         P9GEKN 120
     C*********            CALL 'ADKR96'
     C                     CALL 'ADKR97'
     C                     PARM           CBSHN1
     C                     PARM           CBSHN2
     C                     PARM           CBSHN3
     C                     PARM           P9GEKN 120
     C                     Z-ADDP9GEKN    WKGEKN
      *日当り箱数
     C                     Z-ADD0         WKSETD 122
     C           CBSYUY    IFNE 0
     C           WKGEKN    DIV  CBSYUY    WKSETD    H
     C           WKSETD    DIV  20        WKSETD    H
     C                     ENDIF
      *
     C           WKSETD    IFLE 0
     C                     Z-ADD1         WKSETD
     C                     ENDIF
      *
     C           *IN66     IFEQ '1'
     C                     ADD  WKSETD    WKTOTL
     C                     ADD  WKSETD    D1TOTL
     C                     ENDIF
      *
     C           *IN67     IFEQ '1'
     C                     ADD  WKSETD    OWKTTL
     C                     ADD  WKSETD    D1OWKA
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *便数                                              *
      *----------------------------------------------------*
     CSR         #SB790    BEGSR
      *
     C                     Z-ADD0         WKCIBI  20
     C           0111      CHAINAAIPL111             49
     C           *IN49     IFEQ '0'
     C                     Z-ADDCDCIBI    WKCIBI
     C                     ENDIF
      *
     CSR         ESB790    ENDSR
      *----------------------------------------------------*
      *   主処理                                         *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *   第一画面表示                                   *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTADKPW401
     C                     SETOF                     313299
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *上限
     C                     Z-ADDD1KSUD    WKKSUD
     C                     Z-ADDD1KSUB    WKKSUB
     C                     Z-ADDD1KSUP    WKKSUP
     C                     Z-ADDD1OWKP    OWKSUD
     C                     Z-ADDD1OWKL    OWKSUB
     C                     Z-ADDD1OWKT    OWKSUP
     C                     SETON                     66
     C                     EXSR #SB111
      *マスター
     C           *IN05     IFEQ '1'
      *日
     C                     MOVEL'PART#'   KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C                     Z-ADDD1KSUD    WKKSU   52
     C                     EXSR #SB250
      *工程
     C                     MOVEL'PROCESS' KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C                     Z-ADDD1KSUP    WKKSU   52
     C                     EXSR #SB250
      *便
     C                     MOVEL'TOTAL'   KKKEY  10 P
     C           KKKEY     CHAINADKPP401             20
     C                     Z-ADDD1KSUB    WKKSU   52
     C                     EXSR #SB250
      *
      *****************************************
      * 24132:OWK用上限カット係数の更新
      * 2024.10.07 T.ASAI
      *****************************************
     C                     Z-ADD*DATE     OWKDAT  80
     C                     TIME           OWKTIM  60
     C                     MOVELW#USER    OWKUSE 10
     C                     CALL 'ADKR4S'
     C                     PARM           OWKDAT
     C                     PARM           OWKTIM
     C                     PARM           OWKUSE
     C                     PARM           D1OWKP
     C                     PARM           D1OWKL
     C                     PARM           D1OWKT
      *
     C                     MOVE '99'      DSPSW
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *   更新                                           *
      *----------------------------------------------------*
     CSR         #SB250    BEGSR
      *
     C                     Z-ADD*DATE     D@KOHZ
     C                     TIME           D@KOTI
     C                     MOVELW#USER    D@KOME
     C                     MOVELKKKEY     D@KEY
     C                     Z-ADDWKKSU     D@KSU
     C           *IN20     IFEQ '0'
     C                     UPDATADKPP401
     C                     ELSE
     C                     WRITEADKPP401
     C                     ENDIF
      *
     CSR         ESB250    ENDSR
