     H            Y.
     F** ADKR23 *******************************************************
     F*つるべ生産指示上限カット　ワーク２作成
     F*  2020.07.14
     F*****************************************************************
     FADKWP21 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FADKPP42 IF  E                    DISK
     FADKPL53 UF  E           K        DISK
     FADKWP22 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     C                     TIME           WDATE
      *便数
     C                     Z-ADD0         WKCIBI  20
     C           0111      CHAINAAIPL111             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDCDCIBI    WKCIBI
     C                     ENDIF
      *発行枚数合計
     C                     Z-ADD0         @@TOTL 122
      *便あたり上限
     C                     MOVEL'0'       G41     1
     C                     Z-ADD0         W4LIMT 122
     C           *HIVAL    SETGTADKPP421
     C                     READPADKPP421                 80
     C           *IN80     DOWEQ'0'
     C           G41       ANDEQ'0'
     C           D4SKJY    IFEQ 'D'
     C           D4SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       G41     1
     C                     Z-ADDD4LIMT    W4LIMT 122
     C                     ENDIF
     C                     READPADKPP421                 80
     C                     ENDDO
      *
     C           *HIVAL    SETGTADKWP211
     C                     READPADKWP211                 80
     C           *IN80     DOWEQ'0'
     C           W1DATA    IFEQ '0'
     C                     Z-ADD*HIVAL    @5LIMT 122
     C                     Z-ADD0         @5MAIS  50
     C                     ELSE
     C                     EXSR #SB200
     C                     ENDIF
     C                     EXSR #SB400
     C                     READPADKWP211                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------*
      *                                      *
      *--------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEY51     KLIST
     C                     KFLD           W1CODE
     C                     KFLD           W1GROP
     C                     KFLD           W1PROC
     C                     KFLD           W1KBN
     C                     KFLD           W1APHZ
     C                     KFLD           W1APBN
     C                     Z-ADD*HIVAL    @5LIMT 122
     C                     Z-ADD0         @5MAIS  50
     C           KEY51     CHAINADKPL531             27
     C           *IN27     IFEQ '0'
     C           D5SKJY    ANDEQ'D'
     C           D5SKHZ    ANDLE*DATE
     C                     SETON                     27
     C                     ENDIF
     C           *IN27     IFEQ '0'
     C                     Z-ADDD5LIMT    @5LIMT 122
     C                     Z-ADDD5MAIS    @5MAIS  50
     C                     ENDIF
      *
     CSR         ESB200    ENDSR
      *--------------------------------------*
      *                                      *
      *--------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     EXSR #SB500
      *
     CSR         ESB400    ENDSR
      *--------------------------------------*
      *                                      *
      *--------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARADKWP221
     C                     MOVELW1SKJY    W2SKJY
     C                     Z-ADDW1TOKU    W2TOKU
     C                     MOVELW1TKOJ    W2TKOJ
     C                     MOVELW1TUKE    W2TUKE
     C                     Z-ADDW1NONY    W2NONY
     C                     MOVELW1NKOJ    W2NKOJ
     C                     MOVELW1NUKE    W2NUKE
     C                     MOVELW1MHN1    W2MHN1
     C                     MOVELW1MHN2    W2MHN2
     C                     MOVELW1MHN3    W2MHN3
     C                     MOVELW1SHN1    W2SHN1
     C                     MOVELW1SHN2    W2SHN2
     C                     MOVELW1SHN3    W2SHN3
     C                     Z-ADDW1BMON    W2BMON
     C                     MOVELW1KJYN    W2KJYN
     C                     MOVELW1KOBI    W2KOBI
     C                     MOVELW1SEBN    W2SEBN
     C                     MOVELW1SKKB    W2SKKB
     C                     Z-ADDW1HAKO    W2HAKO
     C                     Z-ADDW1SYUY    W2SYUY
     C                     MOVELW1THAI    W2THAI
     C                     MOVELW1KBAN    W2KBAN
     C                     MOVELW1NBAN    W2NBAN
     C                     Z-ADDW1NSRY    W2NSRY
     C                     Z-ADDW1OSRY    W2OSRY
     C                     MOVELW1BNKA    W2BNKA
     C                     Z-ADDW1BNSI    W2BNSI
     C                     Z-ADDW1BNBO    W2BNBO
     C                     Z-ADDW1TEYY    W2TEYY
     C                     Z-ADDW1TEMM    W2TEMM
     C                     Z-ADDW1TEDD    W2TEDD
     C                     Z-ADDW1TEHH    W2TEHH
     C                     Z-ADDW1TEFN    W2TEFN
     C                     MOVELW1BAN1    W2BAN1
     C                     MOVELW1BAN2    W2BAN2
     C                     MOVELW1BAN3    W2BAN3
     C                     MOVELW1BAN4    W2BAN4
     C                     Z-ADDW1SAI1    W2SAI1
     C                     Z-ADDW1SAI2    W2SAI2
     C                     Z-ADDW1SAI3    W2SAI3
     C                     Z-ADDW1NOYY    W2NOYY
     C                     Z-ADDW1NOMM    W2NOMM
     C                     Z-ADDW1NODD    W2NODD
     C                     Z-ADDW1NOBB    W2NOBB
     C                     MOVELW1GYOM    W2GYOM
     C                     MOVELW1DTSY    W2DTSY
     C                     MOVELW1DTSO    W2DTSO
     C                     Z-ADDW1SAYY    W2SAYY
     C                     Z-ADDW1SAMM    W2SAMM
     C                     Z-ADDW1SADD    W2SADD
     C                     Z-ADDW1SAJI    W2SAJI
     C                     Z-ADDW1SAPN    W2SAPN
     C                     Z-ADDW1JTNO    W2JTNO
     C                     Z-ADDW1BARL    W2BARL
     C                     Z-ADDW1HASU    W#HASU
     C                     Z-ADDW1BSRY    W#BSRY
     C                     Z-ADDW1SRYO    W#SRYO
     C                     Z-ADDW1ALL     W2ALL
     C                     Z-ADDW1HND     W2HND
     C                     Z-ADDW1RNJ     W2RNJ
     C                     Z-ADDW1LIMD    W2LIMD
     C                     Z-ADDW1LIMB    W2LIMB
     C                     Z-ADDW1LIMT    W2LIMT
     C                     Z-ADDW1TIMS    W2TIMS
     C                     Z-ADDW1LIMT    P9SRYO 120
      *
     C                     Z-ADD0         W2SRYO
     C                     Z-ADD0         W2HKSU
     C                     Z-ADD0         W2CUT
     C                     Z-ADD0         W2HASU
      *
     C                     MOVELW1RTCD    W@RTCD  1
     C                     SELEC
      *バレル数量より少ない時、バレル端数へ
     C           W1SRYO    WHLT W1BSRY
     C                     MOVEL'0'       W@RTCD
     C                     Z-ADD0         W2SRYO
     C                     Z-ADD0         W2HKSU
     C                     Z-ADD0         W2CUT
     C                     Z-ADDW1SRYO    W2HASU
      *バレル数量以上の時
     C                     OTHER
     C                     EXSR #SB501
      *
     C                     ENDSL
      *
     C                     Z-ADDW1APHZ    W2APHZ
     C                     Z-ADDW1APBN    W2APBN
     C                     Z-ADD@@TOTL    W2TOTL
     C                     MOVELW1TRBN    W2TRBN
     C                     MOVELW1DATA    W2DATA
     C                     MOVELW1CODE    W2CODE
     C                     MOVELW1GROP    W2GROP
     C                     MOVELW1BMN     W2BMN
     C                     MOVELW1PROC    W2PROC
     C                     MOVELW1KBN     W2KBN
     C           W1DATA    IFEQ '1'
     C           W1DATA    OREQ '2'
     C                     Z-ADD@5MAIS    W2TOTP
     C                     ENDIF
     C                     MOVELW@RTCD    W2RTCD
     C                     WRITEADKWP221
     C                     EXSR #SB600
      *
     CSR         ESB500    ENDSR
      *--------------------------------------*
      *前工程の上限をチェック              *
      *--------------------------------------*
     CSR         #SB501    BEGSR
      *
     C                     SELEC
     C           @5MAIS    WHGT @5LIMT
     C                     MOVEL'3'       W@RTCD
     C                     EXSR #SB530                     前工程上限以上
     C                     OTHER
     C           @@TOTL    IFLT W4LIMT                     便当り上限未満
     C           W1SRYO    IFLE P9SRYO
     C                     EXSR #SB510                     上限以下
     C                     ELSE
     C                     EXSR #SB520                     上限超え
     C                     ENDIF
     C                     ELSE
     C                     EXSR #SB530                     便当り上限以上
     C                     ENDIF
     C                     ENDSL
      *
     CSR         ESB501    ENDSR
      *--------------------------------------*
      *今回数量が上限数量以下              *
      *今回数量をバレル数量の整数倍にする  *
      *--------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           W1BSRY    IFNE 0
     C           W1SRYO    DIV  W1BSRY    WKSYO   30
     C           W1BSRY    MULT WKSYO     W2SRYO
     C           W1BARL    MULT WKSYO     W2HKSU
     C                     Z-ADD0         W2CUT
     C           W1SRYO    SUB  W2SRYO    W2HASU
     C                     ENDIF
     C                     ADD  W2HKSU    @@TOTL
     C                     ADD  W2HKSU    @5MAIS
      *
     CSR         ESB510    ENDSR
      *--------------------------------------*
      *今回数量が上限数量超え              *
      *上限数量をバレル数量の整数倍にする  *
      *--------------------------------------*
     CSR         #SB520    BEGSR
      *上限数量はバレル数量の整数倍になっているため(ADKR91)
      * P9SRYOとW2SRYOは同じになる
     C           W1BSRY    IFNE 0
     C           P9SRYO    DIV  W1BSRY    WKSYO   30
     C           W1BSRY    MULT WKSYO     W2SRYO
     C           W1BARL    MULT WKSYO     W2HKSU
     C           W1SRYO    SUB  P9SRYO    W2CUT
     C                     Z-ADD0         W2HASU
     C                     ENDIF
     C                     ADD  W2HKSU    @@TOTL
     C                     ADD  W2HKSU    @5MAIS
     C           W@RTCD    IFEQ '0'
     C                     MOVEL'5'       W@RTCD
     C                     ENDIF
      *
     CSR         ESB520    ENDSR
      *--------------------------------------*
      *便当り上限以上                      *
      *--------------------------------------*
     CSR         #SB530    BEGSR
      *
     C                     Z-ADD0         W2SRYO
     C                     Z-ADD0         W2HKSU
     C                     Z-ADDW1SRYO    W2CUT
     C                     Z-ADD0         W2HASU
     C           W@RTCD    IFEQ '0'
     C                     MOVEL'4'       W@RTCD
     C                     ENDIF
      *
     CSR         ESB530    ENDSR
      *--------------------------------------*
      *工程別上限                        *
      *--------------------------------------*
     CSR         #SB600    BEGSR
      *
     C                     Z-ADD0         @5LIMT 122
     C                     Z-ADD*HIVAL    @5MAIS  50
     C           KEY51     CHAINADKPL531             27
     C           *IN27     IFEQ '0'
     C           D5SKJY    ANDEQ'D'
     C           D5SKHZ    ANDLE*DATE
     C                     SETON                     27
     C                     ENDIF
     C           *IN27     IFEQ '0'
     C                     ADD  W2HKSU    D5MAIS
     C                     UPDATADKPL531
     C                     ENDIF
      *
     CSR         ESB600    ENDSR
