     H            Y.
     F** ADKR24 *******************************************************
     F*つるべ生産指示上限カット　ＡＧＡＰＰ４１更新
     F*  2020.07.14
     F*****************************************************************
     FADKWP22 IF  E                    DISK
     FAGAPL41 UF  E           K        DISK
     E                    CBHK       24  3 0             ﾌｮkｬc ﾌﾃﾇc (N)
     E                    CBBI       24  2 0             ﾌｮc ﾍﾞ]
     E                    CBTR       24  2 0             m]c ﾍﾞ]
      *
     I            DS
     I                                        1  72 CBHK
     I                                        1   30CBHK01
     I                                        4   60CBHK02
     I                                        7   90CBHK03
     I                                       10  120CBHK04
     I                                       13  150CBHK05
     I                                       16  180CBHK06
     I                                       19  210CBHK07
     I                                       22  240CBHK08
     I                                       25  270CBHK09
     I                                       28  300CBHK10
     I                                       31  330CBHK11
     I                                       34  360CBHK12
     I                                       37  390CBHK13
     I                                       40  420CBHK14
     I                                       43  450CBHK15
     I                                       46  480CBHK16
     I                                       49  510CBHK17
     I                                       52  540CBHK18
     I                                       55  570CBHK19
     I                                       58  600CBHK20
     I                                       61  630CBHK21
     I                                       64  660CBHK22
     I                                       67  690CBHK23
     I                                       70  720CBHK24
      *
     I            DS
     I                                        1  48 CBBI
     I                                        1   20CBBI01
     I                                        3   40CBBI02
     I                                        5   60CBBI03
     I                                        7   80CBBI04
     I                                        9  100CBBI05
     I                                       11  120CBBI06
     I                                       13  140CBBI07
     I                                       15  160CBBI08
     I                                       17  180CBBI09
     I                                       19  200CBBI10
     I                                       21  220CBBI11
     I                                       23  240CBBI12
     I                                       25  260CBBI13
     I                                       27  280CBBI14
     I                                       29  300CBBI15
     I                                       31  320CBBI16
     I                                       33  340CBBI17
     I                                       35  360CBBI18
     I                                       37  380CBBI19
     I                                       39  400CBBI20
     I                                       41  420CBBI21
     I                                       43  440CBBI22
     I                                       45  460CBBI23
     I                                       47  480CBBI24
      *
     I            DS
     I                                        1  480CBTR
     I                                        1   20CBTR01
     I                                        3   40CBTR02
     I                                        5   60CBTR03
     I                                        7   80CBTR04
     I                                        9  100CBTR05
     I                                       11  120CBTR06
     I                                       13  140CBTR07
     I                                       15  160CBTR08
     I                                       17  180CBTR09
     I                                       19  200CBTR10
     I                                       21  220CBTR11
     I                                       23  240CBTR12
     I                                       25  260CBTR13
     I                                       27  280CBTR14
     I                                       29  300CBTR15
     I                                       31  320CBTR16
     I                                       33  340CBTR17
     I                                       35  360CBTR18
     I                                       37  380CBTR19
     I                                       39  400CBTR20
     I                                       41  420CBTR21
     I                                       43  440CBTR22
     I                                       45  460CBTR23
     I                                       47  480CBTR24
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        1   20STIHH
     I                                        3   40STIMM
     I                                        5   60STISS
     I                                        7  140SDATE
     I                                        7  100SDAYY
     I                                       11  120SDAMM
     I                                       13  140SDADD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WDATE
      *
     C                     READ ADKWP221                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB400
     C                     READ ADKWP221                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------*
      *                                      *
      *--------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYAGA    KLIST
     C                     KFLD           W2SHN1
     C                     KFLD           W2SHN2
     C                     KFLD           W2SHN3
     C           KEYAGA    CHAINAGAPL411             22
     C           *IN22     IFEQ '0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *--------------------------------------*
      *                                      *
      *--------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     Z-ADDSDAYY     CBKOYY
     C                     Z-ADDSDAMM     CBKOMM
     C                     Z-ADDSDADD     CBKODD
     C                     Z-ADDSTIHH     CBKOHH
     C                     Z-ADDSTIMM     CBKOSS
     C                     MOVELW#PGM     CBKOME
      *
      *割り振る便
     C                     Z-ADDW2APBN    B       20
     C                     ADD  W2HKSU    CBHK,B           箱数
     C                     Z-ADDW2HASU    CBHASU           端数
     C                     UPDATAGAPL411
      *
     CSR         ESB500    ENDSR
