     H            Y.
     F** ADKR55 **************************************
     F*前工程別上限値の係数マスター更新
     F*      IWATA.         2017.07.05               *
     F************************************************
     FADKPW55 CF  E                    WORKSTN
     FADKPP55 UF  E           K        DISK                      A
     FFGBPL01 IF  E           K        DISK
     E                    PR         10  3
     E                    PR@       100  3
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     ID1PR        DS
     I                                        1  30 D1PR1
     I                                        1   3 D1PR11
     I                                        4   6 D1PR12
     I                                        7   9 D1PR13
     I                                       10  12 D1PR14
     I                                       13  15 D1PR15
     I                                       16  18 D1PR16
     I                                       19  21 D1PR17
     I                                       22  24 D1PR18
     I                                       25  27 D1PR19
     I                                       28  30 D1PR1A
      *
     I                                       31  60 D1PR2
     I                                       31  33 D1PR21
     I                                       34  36 D1PR22
     I                                       37  39 D1PR23
     I                                       40  42 D1PR24
     I                                       43  45 D1PR25
     I                                       46  48 D1PR26
     I                                       49  51 D1PR27
     I                                       52  54 D1PR28
     I                                       55  57 D1PR29
     I                                       58  60 D1PR2A
      *
     I                                       61  90 D1PR3
     I                                       61  63 D1PR31
     I                                       64  66 D1PR32
     I                                       67  69 D1PR33
     I                                       70  72 D1PR34
     I                                       73  75 D1PR35
     I                                       76  78 D1PR36
     I                                       79  81 D1PR37
     I                                       82  84 D1PR38
     I                                       85  87 D1PR39
     I                                       88  90 D1PR3A
      *
     I                                       91 120 D1PR4
     I                                       91  93 D1PR41
     I                                       94  96 D1PR42
     I                                       97  99 D1PR43
     I                                      100 102 D1PR44
     I                                      103 105 D1PR45
     I                                      106 108 D1PR46
     I                                      109 111 D1PR47
     I                                      112 114 D1PR48
     I                                      115 117 D1PR49
     I                                      118 120 D1PR4A
      *
     I                                      121 150 D1PR5
     I                                      121 123 D1PR51
     I                                      124 126 D1PR52
     I                                      127 129 D1PR53
     I                                      130 132 D1PR54
     I                                      133 135 D1PR55
     I                                      136 138 D1PR56
     I                                      139 141 D1PR57
     I                                      142 144 D1PR58
     I                                      145 147 D1PR59
     I                                      148 150 D1PR5A
      *
     I                                      151 180 D1PR6
     I                                      151 153 D1PR61
     I                                      154 156 D1PR62
     I                                      157 159 D1PR63
     I                                      160 162 D1PR64
     I                                      163 165 D1PR65
     I                                      166 168 D1PR66
     I                                      169 171 D1PR67
     I                                      172 174 D1PR68
     I                                      175 177 D1PR69
     I                                      178 180 D1PR6A
      *
     I                                      181 210 D1PR7
     I                                      181 183 D1PR71
     I                                      184 186 D1PR72
     I                                      187 189 D1PR73
     I                                      190 192 D1PR74
     I                                      193 195 D1PR75
     I                                      196 198 D1PR76
     I                                      199 201 D1PR77
     I                                      202 204 D1PR78
     I                                      205 207 D1PR79
     I                                      208 210 D1PR7A
      *
     I                                      211 240 D1PR8
     I                                      211 213 D1PR81
     I                                      214 216 D1PR82
     I                                      217 219 D1PR83
     I                                      220 222 D1PR84
     I                                      223 225 D1PR85
     I                                      226 228 D1PR86
     I                                      229 231 D1PR87
     I                                      232 234 D1PR88
     I                                      235 237 D1PR89
     I                                      238 240 D1PR8A
      *
     I                                      241 270 D1PR9
     I                                      241 243 D1PR91
     I                                      244 246 D1PR92
     I                                      247 249 D1PR93
     I                                      250 252 D1PR94
     I                                      253 255 D1PR95
     I                                      256 258 D1PR96
     I                                      259 261 D1PR97
     I                                      262 264 D1PR98
     I                                      265 267 D1PR99
     I                                      268 270 D1PR9A
      *
     I                                      271 300 D1PRA
     I                                      271 273 D1PRA1
     I                                      274 276 D1PRA2
     I                                      277 279 D1PRA3
     I                                      280 282 D1PRA4
     I                                      283 285 D1PRA5
     I                                      286 288 D1PRA6
     I                                      289 291 D1PRA7
     I                                      292 294 D1PRA8
     I                                      295 297 D1PRA9
     I                                      298 300 D1PRAA
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      *  メインルーチン                                  *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     MOVE '00'      DSPSW   2
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     CLEARD1PR1
     C                     CLEARD1PR2
     C                     CLEARD1PR3
     C                     CLEARD1PR4
     C                     CLEARD1PR5
     C                     CLEARD1PR6
     C                     CLEARD1PR7
     C                     CLEARD1PR8
     C                     CLEARD1PR9
     C                     CLEARD1PRA
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE10
     C                     MOVE X         KGROP   2
     C                     EXSR #SB110
     C                     SELEC
     C           X         WHEQ 1
     C                     MOVEAPR        D1PR1
     C           X         WHEQ 2
     C                     MOVEAPR        D1PR2
     C           X         WHEQ 3
     C                     MOVEAPR        D1PR3
     C           X         WHEQ 4
     C                     MOVEAPR        D1PR4
     C           X         WHEQ 5
     C                     MOVEAPR        D1PR5
     C           X         WHEQ 6
     C                     MOVEAPR        D1PR6
     C           X         WHEQ 7
     C                     MOVEAPR        D1PR7
     C           X         WHEQ 8
     C                     MOVEAPR        D1PR8
     C           X         WHEQ 9
     C                     MOVEAPR        D1PR9
     C           X         WHEQ 10
     C                     MOVEAPR        D1PRA
     C                     ENDSL
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      *   初期処理                                       *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C           KEY55     KLIST
     C                     KFLD           D0BMON
     C                     KFLD           KGROP
     C                     CLEARPR
     C                     Z-ADD0         II      30
     C           KEY55     SETLLADKPP551
     C           KEY55     READEADKPP551                 43
     C           *IN43     DOWEQ'0'
     C           DNSKJY    IFEQ 'D'
     C           DNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         II
     C                     MOVELDNPROC    PR,II
     C                     ENDIF
     C           KEY55     READEADKPP551                 43
     C                     ENDDO
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      *   主処理                                         *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'00'
     C                     EXSR #SB201
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *   第一画面表示                                   *
      *----------------------------------------------------*
     CSR         #SB201    BEGSR
      *
     C                     EXFMTADKPW550
     C                     SETOF                     9930
     C                     MOVEL*BLANK    D0ERR
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB201
     C                     ENDIF
      *
     C           D0BMON    IFEQ 0
     C                     MOVELER,1      D0ERR
     C                     SETON                     3099
     C                     GOTO ESB201
     C                     ENDIF
      *
     C           D0BMON    CHAINFGBPL011             80
     C           *IN80     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     80
     C                     ENDIF
      *
     C           *IN80     IFEQ '1'
     C                     MOVELER,1      D0ERR
     C                     SETON                     3099
     C                     GOTO ESB201
     C                     ENDIF
      *
     C                     MOVEL'01'      DSPSW
     C                     EXSR #SB100
      *
     CSR         ESB201    ENDSR
      *----------------------------------------------------*
      *   第一画面表示                                   *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTADKPW551
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     40
     C                     SETOF                     818283
     C                     SETOF                     848586
     C                     SETOF                     878889
     C                     SETOF                     9099
     C                     MOVEL*BLANK    D1ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     Z-ADD0         D0BMON
     C                     MOVE '00'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     EXSR #SB400
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB250
     C                     EXSR #SB260
     C                     Z-ADD0         D0BMON
     C                     MOVE '00'      DSPSW
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *重複チェック                                      *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     SETOF                     99
     C                     CLEARPR@
     C                     MOVEAD1PR      PR@
     C                     Z-ADD100       II
     C           II        DOWGE1
     C           *IN99     ANDEQ'0'
     C                     MOVELPR@,II    W@PROC  3
     C           W@PROC    IFNE *BLANK
     C                     EXSR #SB401
     C                     ENDIF
     C                     SUB  1         II
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      *重複チェック                                      *
      *----------------------------------------------------*
     CSR         #SB401    BEGSR
      *
     C           II        SUB  1         I@      30
     C           I@        DOWGE1
     C           W@PROC    IFEQ PR@,I@
     C                     MOVELER,2      D1ERR
     C                     SETON                     99
     C                     EXSR #SB402
     C                     ENDIF
     C                     SUB  1         I@
     C                     ENDDO
      *
     CSR         ESB401    ENDSR
      *----------------------------------------------------*
      *重複チェック                                      *
      *----------------------------------------------------*
     CSR         #SB402    BEGSR
      *
     C           II        DIV  10        SYO     30
     C                     MVR            AMR     30
     C           AMR       ADD  30        IN      30
     C                     MOVEL'1'       *IN,IN
     C                     SELEC
     C           II        WHLE 10
     C                     SETON                     81
     C           II        WHLE 20
     C                     SETON                     82
     C           II        WHLE 30
     C                     SETON                     83
     C           II        WHLE 40
     C                     SETON                     84
     C           II        WHLE 50
     C                     SETON                     85
     C           II        WHLE 60
     C                     SETON                     86
     C           II        WHLE 70
     C                     SETON                     87
     C           II        WHLE 80
     C                     SETON                     88
     C           II        WHLE 90
     C                     SETON                     89
     C           II        WHLE 100
     C                     SETON                     90
     C                     ENDSL
      *
     CSR         ESB402    ENDSR
      *----------------------------------------------------*
      *全部削除する                                      *
      *----------------------------------------------------*
     CSR         #SB250    BEGSR
      *
     C           D0BMON    SETLLADKPP551
     C           D0BMON    READEADKPP551                 43
     C           *IN43     DOWEQ'0'
     C           DNSKJY    IFEQ 'D'
     C           DNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'D'       DNSKJY
     C                     Z-ADD*DATE     DNSKHZ
     C                     UPDATADKPP551
     C                     ENDIF
     C           D0BMON    READEADKPP551                 43
     C                     ENDDO
      *
     CSR         ESB250    ENDSR
      *----------------------------------------------------*
      *更新
      *----------------------------------------------------*
     CSR         #SB260    BEGSR
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE10
     C                     MOVE X         KGROP   2
     C                     CLEARPR
     C                     SELEC
     C           X         WHEQ 1
     C                     MOVEAD1PR1     PR
     C           X         WHEQ 2
     C                     MOVEAD1PR2     PR
     C           X         WHEQ 3
     C                     MOVEAD1PR3     PR
     C           X         WHEQ 4
     C                     MOVEAD1PR4     PR
     C           X         WHEQ 5
     C                     MOVEAD1PR5     PR
     C           X         WHEQ 6
     C                     MOVEAD1PR6     PR
     C           X         WHEQ 7
     C                     MOVEAD1PR7     PR
     C           X         WHEQ 8
     C                     MOVEAD1PR8     PR
     C           X         WHEQ 9
     C                     MOVEAD1PR9     PR
     C           X         WHEQ 10
     C                     MOVEAD1PRA     PR
     C                     ENDSL
     C                     EXSR #SB261
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB260    ENDSR
      *----------------------------------------------------*
      *更新
      *----------------------------------------------------*
     CSR         #SB261    BEGSR
      *
     C           KEY11     KLIST
     C                     KFLD           D0BMON
     C                     KFLD           KGROP   2
     C                     KFLD           KPROC   3
      *
     C                     Z-ADD1         II      30
     C           II        DOWLE10
     C                     MOVELPR,II     KPROC   3
     C           KPROC     IFNE *BLANK
     C           KEY11     CHAINADKPP551             43
     C                     CLEARADKPP551
     C                     Z-ADD*DATE     DNKOHZ
     C                     TIME           DNKOTI
     C                     MOVELW#USER    DNKOME
     C                     MOVELD0BMON    DNBMON
     C                     MOVELKGROP     DNGROP
     C                     MOVELKPROC     DNPROC
     C           *IN43     IFEQ '0'
     C                     UPDATADKPP551
     C                     ELSE
     C                     WRITEADKPP551
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         II
     C                     ENDDO
      *
     CSR         ESB261    ENDSR
**
ER-1 FACTORY CODE ERROR.
ER-2 DUPULICATE PROCESS.
