     H            Y.
     F** ADKR39 **********************************
     F*臨時かんばん照会・更新                  *
     F*     KATOGI.        2015.12.21            *
     F********************************************
     FADKWP36 UF  E           K        DISK
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     C           *ENTRY    PLIST
     C                     PARM           P1APHZ  80
     C                     PARM           P1APBN  20
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P1CHNG  30
      *
     C           KEYW      KLIST
     C                     KFLD           K1APHZ
     C                     KFLD           K1APBN
     C                     KFLD           K1SHN1
     C                     KFLD           K1SHN2
     C                     KFLD           K1SHN3
     C                     Z-ADDP1APHZ    K1APHZ  80
     C                     Z-ADDP1APBN    K1APBN  20
     C                     MOVELP1SHN1    K1SHN1  5
     C                     MOVELP1SHN2    K1SHN2  5
     C                     MOVELP1SHN3    K1SHN3  2
     C           KEYW      CHAINADKWP361             80
     C           *IN80     IFEQ '0'
     C                     Z-ADDP1CHNG    W6CHNG
     C                     UPDATADKWP361
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
