     H            Y.
     F** ADKR42 **********************************
     F*前工程情報の取得                        *
     F*    IWATA.       2017.07.17               *
     F********************************************
     FADKPL55 IF  E           K        DISK
     E                    OKT        15  3               工程
     E                    OTK        15  6               所番地
     E                    OSY        15  1               か種
     E                    OBM        15  4               部門
      *
     I            DS
     I                                        1   6 WKTKR
     I                                        1   1 WKTKR1
     I                                        2   3 WKTKR2
     I                                        4   5 WKTKR3
     I                                        6   6 WKTKR4
      *
     I            DS
     I                                        1  100WKAP
     I                                        1   80WKAPHZ
     I                                        9  100WKAPBN
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C                     TIME           WDATE
     C           *ENTRY    PLIST
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P1KDAI  1
     C                     PARM           P1APHZ  80
     C                     PARM           P1APBN  20
     C                     PARM           P9DATA  1
     C                     PARM           P9GROP  2
     C                     PARM           P9BMON  40
     C                     PARM           P9PROC  3
      *
     C                     Z-ADDP1APHZ    WKAPHZ  80
     C                     Z-ADDP1APBN    WKAPBN  20
     C                     MOVEL'0'       P9DATA           0:oﾆ  1:aﾒ
     C                     MOVEL*BLANK    P9GROP
     C                     Z-ADD0         P9BMON
     C                     MOVEL*BLANK    P9PROC
      *
     C                     MOVEL'1'       OPNCLS
      *
     C                     EXSR #SB390
      *
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRS0'
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------*
      *工程情報                         *
      *-----------------------------------*
     CSR         #SB390    BEGSR
      *
     C                     CLEAROKT
     C                     CLEAROTK
     C                     CLEAROSY
     C                     CLEAROBM
     C                     MOVELP1SHN1    CBSHN1  5
     C                     MOVELP1SHN2    CBSHN2  5
     C                     MOVELP1SHN3    CBSHN3  2
     C                     MOVELP1KDAI    CBKDAI  1
     C                     MOVE WKAP      INYMDB
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           CBSHN1
     C                     PARM           CBSHN2
     C                     PARM           CBSHN3
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C           STATUS    IFEQ '9'
     C                     GOTO ESB390
     C                     ENDIF
      *
     C                     MOVEAPKOT      OKT
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSY
     C                     MOVEAPBMN      OBM
      *
     C                     Z-ADD0         IDX1    30
     C                     Z-ADD15        X       30
     C                     MOVEL'0'       GET     1
     C           X         DOWGE1
     C           IDX1      ANDEQ0
     C           OSY,X     IFEQ CBKDAI
     C                     Z-ADDX         IDX1
     C                     ENDIF
     C                     SUB  1         X
     C                     ENDDO
      *前工程
     C                     EXSR #SB391
      *
     CSR         ESB390    ENDSR
      *----------------------------------------------------*
      *前工程
      *----------------------------------------------------*
     CSR         #SB391    BEGSR
      *前工程
     C                     Z-ADD0         IDX2    30
     C                     Z-ADD0         X
     C           IDX1      SUB  1         X
     C           X         DOWGE1
     C           IDX2      ANDEQ0
     C           OTK,X     IFNE '------'
     C           OTK,X     ANDNE'++++++'
     C                     Z-ADDX         IDX2
     C                     MOVELOBM,X     P9BMON
     C                     MOVELOKT,X     P9PROC
     C                     EXSR #SB450
     C                     ENDIF
     C                     SUB  1         X
     C                     ENDDO
      *
     CSR         ESB391    ENDSR
      *----------------------------------------------------*
      *工程別                                            *
      *----------------------------------------------------*
     CSR         #SB450    BEGSR
      *
     C           KEY55     KLIST
     C                     KFLD           KKBMON  40
     C                     KFLD           KKPROC  3
     C                     MOVELP9BMON    KKBMON
     C                     MOVELP9PROC    KKPROC
     C           KEY55     SETLLADKPL551
     C           KEY55     READEADKPL551                 84
     C           *IN84     DOWEQ'0'
     C           DNSKJY    IFEQ 'D'
     C           DNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       P9DATA
     C                     MOVELDNGROP    P9GROP
     C                     ENDIF
     C           KEY55     READEADKPL551                 84
     C                     ENDDO
      *
     CSR         ESB450    ENDSR
