     H            Y.
     F** AEBR03 ********************************************
     F*  構成部品情報マスターの月間必要数の整合性を取る  *
     F*  【部品マスターの月間必要数より】                *
     F*      I-HASADA                      2008/02/07      *
     F******************************************** AEBR03 **
     FAKCPP01 UP  E                    DISK
     FAEBPL11 IF  E           K        DISK
      *
     C           KEY1      KLIST
     C                     KFLD           M1KHN1
     C                     KFLD           M1KHN2
     C                     KFLD           M1KHN3
      *
     C           M1SKJY    IFEQ *BLANK
      *
     C                     Z-ADD0         M1GEKN
      *
     C           KEY1      SETLLAEBPL111
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAEBPL111                 10
     C           *IN10     IFEQ '0'
     C                     ADD  AGNGEK    M1GEKN
     C                     END
     C  N10                END
      *
     C                     UPDATAKCPP011
      *
     C                     END
