     H            Y.
     F** AEXR03 ********************************************
     F*  構成部品情報マスターの月間必要数の整合性を取る  *
     F*  【部品マスターの月間必要数より】                *
     F*       HOTTA.                    2018.06.07         *
     F******************************************************
     FAKCPP01 UP  E                    DISK
     FAEBPL11 IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     C           KEY1      KLIST
     C                     KFLD           M1KHN1
     C                     KFLD           M1KHN2
     C                     KFLD           M1KHN3
      *
     C                     TIME           WTIME
      *
     C                     CALL 'AEXR12'
     C                     PARM           M1KHN1
     C                     PARM           M1KHN2
     C                     PARM           M1KHN3
     C                     PARM           P9OMIT  1
     C           P9OMIT    IFEQ '0'
      *
     C           M1SKJY    IFEQ *BLANK
      *
     C                     Z-ADD0         M1GEKN
      *
     C           KEY1      SETLLAEBPL111
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAEBPL111                 10
     C           *IN10     IFEQ '0'
     C                     ADD  AGNGEK    M1GEKN
     C                     ENDIF
     C  N10                ENDDO
      *
     C                     Z-ADD*YEAR     M1KOYY
     C                     Z-ADDUMONTH    M1KOMM
     C                     Z-ADDUDAY      M1KODD
     C                     Z-ADDTIMHH     M1KOHH
     C                     Z-ADDTIMMM     M1KOSS
     C                     MOVEL'ZIDOU'   M1KOME
     C                     UPDATAKCPP011
      *
     C                     ENDIF
      *
     C                     ENDIF
