     H            Y.
     F** AEXR11 *********************************************
     F*設定数自動処理　構成品かんばんマスタ更新           *
     F*  HOTTA.            2018.08.06                       *
     F*----------+-----+----------+-----------------------------------*
     F*2021.02.22|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*****************************************************************
     FAEXWP15 IF  E                    DISK
     FAKBPL04 UF  E           K        DISK
     FABMPPB5 IF  E           K        DISK
     FABMPPB6 IF  E           K        DISK
     FABMWP30 O   E           K        DISK                      A
     FABMWP31 O   E           K        DISK                      A
     FGDKPL02 IF  E           K        DISK
      *
     I            DS
     I                                        1   80AISKHZ
     I                                        1   40AISKYY
     I                                        5   60AISKMM
     I                                        7   80AISKDD
      *
     I            DS
     I                                        1   80AHSKHZ
     I                                        1   40AHSKYY
     I                                        5   60AHSKMM
     I                                        7   80AHSKDD
     I            DS
     I                                        1   80L1SKHZ
     I                                        1   40L1SKYY
     I                                        5   60L1SKMM
     I                                        7   80L1SKDD
     I            DS
     I                                        1   80L1KOHZ
     I                                        1   40L1KOYY
     I                                        5   80L1KOMD
     I                                        5   60L1KOMM
     I                                        7   80L1KODD
      *
     I            DS
     I                                        1  12 W2SHN
     I                                        1   5 AXKHN1
     I                                        6  10 AXKHN2
     I                                       11  12 AXKHN3
     I            DS
     I                                        1   40XXMD
     I                                        1   20XXMM
     I                                        3   40XXDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        5   60WTITS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              'OVER 1000'           C         ERR01
     I              'ACCOMMODATED-        C         ERR02
     I              ' QUANTITY=0'
     I              'UNDER 0'             C         ERR03
     I              'NOT IN IMPORT-       C         ERR04
     I              ' UNIT PRICE M/F'
     I              'KANBAN ADJUST'       C         CMT01
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           P@DTYM  60
      *
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           WMAIS            f]ﾌﾞ]ubﾇc
     C                     PARM           L1KTSU           fhmbﾍajﾒﾇc
     C                     PARM           L1SYOS           ﾆｬcﾑcﾇc
     C                     PARM           L1LTIM           ﾒｰnﾞjbw
     C                     PARM           L1ROTO           ﾜｮn
     C                     PARM           L1KISU           ﾌﾞ[lgibﾇc
     C                     PARM           L1UZAR           kｭcﾈbubﾇc
     C                     PARM           L1HITO           anﾃcmbﾍgnﾒ
      *
     C                     TIME           WTIME
     C           1         SETLLAEXWP151
     C                     READ AEXWP151                 21
     C           *IN21     DOWEQ'0'
     C                     EXSR #SB150
     C                     EXSR #SB200
     C                     READ AEXWP151                 21
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * GDKPP01                                            *
      *----------------------------------------------------*
     CSR         #SB150    BEGSR
      *
     C                     MOVEL'0'       GETGDK  1
     C                     MOVELW2SHN     HINB   20
     C           HINB      SETLLGDKPL02
     C           HINB      READEGDKPL02                  74
     C           *IN74     DOWEQ'0'
     C           ISSKJY    IFEQ 'D'
     C           ISSKHZ    ANDLE*DATE
     C                     ELSE
     C           ISENHZ    IFEQ 99999999
     C                     MOVEL'1'       GETGDK
     C                     ENDIF
     C                     ENDIF
     C           HINB      READEGDKPL02                  74
     C                     ENDDO
      *
     CSR         ESB150    ENDSR
      *---------------------------*
      *数量をセット             *
      *---------------------------*
     CSR         #SB200    BEGSR
      *
     C           KEYL11    KLIST
     C                     KFLD           #KSHN1  5
     C                     KFLD           #KSHN2  5
     C                     KFLD           #KSHN3  2
     C                     MOVELAXKHN1    #KSHN1
     C                     MOVELAXKHN2    #KSHN2
     C                     MOVELAXKHN3    #KSHN3
     C           KEYL11    SETGTAKBPL041
     C           KEYL11    REDPEAKBPL041                 82
     C           *IN82     DOWEQ'0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ELSE
     C           L1KUKJ    IFEQ AXKBMN
     C           L1KUKE    ANDEQAXUKER
     C           L1STHZ    ANDEQ99999999
     C*****      L1BMON    ANDEQ8990
     C*****      L1KMAX    IFEQ 999
     C           L1KMAX    IFEQ 99999
     C                     CLEARABMWP301
     C                     MOVELERR03     ABTXT
     C                     EXSR #SB800
     C                     ELSE
     C***        AXNGEK    DIV  20        WKSRYO  90
     C                     Z-ADDAXNGEK    WKSRYO  90
     C                     EXSR #SB330
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C           KEYL11    REDPEAKBPL041                 82
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *---------------------------*
      *更新
      *---------------------------*
     CSR         #SB330    BEGSR
      *  PT WASHER
     C           L1BMON    IFEQ 8990
      *  UPDATE IF IT IS IN UNIT PRICE M/F
     C           GETGDK    IFEQ '1'
     C                     EXSR #SB410
     C                     ELSE
     C                     CLEARABMWP301
     C                     MOVELERR04     ABTXT
     C                     EXSR #SB800
     C                     ENDIF
      *  LOCAL WASHER
     C                     ELSE
     C                     EXSR #SB410
     C                     ENDIF
      *
     CSR         ESB330    ENDSR
      *---------------------------*
      *かんばん枚数計算         *
      *---------------------------*
     CSR         #SB410    BEGSR
      *
     C                     Z-ADDL1SYOS    @BSSYS
     C                     MOVELL1SYOT    @BSSYT
     C                     Z-ADDL1KTSU    @BKTSU
     C*                    Z-ADDL1KMAX    @BKMAX
     C                     MOVE *BLANK    ASTLR   2
     C                     Z-ADD0         WMAIS
     C                     CALL 'ABCR161' ACALL
     C                     Z-ADDWMAIS     @BKMAX
     C                     Z-ADDL1UZAR    @BMAXH
     C                     Z-ADDL1ROTO    @BKLOT
     C           L1ROTO    IFEQ 0
     C                     Z-ADD1         @BKLOT
     C                     ENDIF
     C                     Z-ADD0         @BPADJ
     C                     Z-ADDL1AUAJ    @BAUAJ
     C                     Z-ADD0         @BDUPH
     C                     Z-ADDL1OTHH    @BOTHH
      *
     C           L1DOUT    IFEQ 'Y'
     C                     Z-ADDL1KMAX    L1MAIS
     C                     END
      *
     C                     Z-ADDL1KMAX    WKMAX   50
     C                     Z-ADDL1KALL    WKALL   50
     C                     Z-ADDL1KMIN    WMIN    50
     C                     Z-ADDL1KMAX    WMAX    50
     C           L1KALL    IFLT L1KMAX
     C                     Z-ADDL1KMAX    WALL    50
     C                     ELSE
     C                     Z-ADDL1KALL    WALL
     C                     ENDIF
     C                     Z-ADDL1KSKB    KSKBN   10
     C*
     C           WKSRYO    DIV  20        L1KSSU
     C*
     C                     Z-ADDP@DTYM    P7DTYM
     C                     Z-ADD0         P@KSSU
     C                     Z-ADD0         P@KTSU
      *
     C           L1BMON    IFEQ 8990
     C                     CALL 'ABMR4I'
     C                     PARM           P7DTYM  60
     C                     PARM           L1SHN1  5
     C                     PARM           L1SHN2  5
     C                     PARM           L1SHN3  2
     C                     PARM           P@KSSU  90
     C                     PARM           P@KTSU  90
     C                     ELSE
     C                     CALL 'ABMR48'
     C                     PARM           P7DTYM  60
     C                     PARM           L1SHN1  5
     C                     PARM           L1SHN2  5
     C                     PARM           L1SHN3  2
     C                     PARM           P@KSSU  90
     C                     PARM           P@KTSU  90
     C                     ENDIF
      *
     C                     SELEC
     C           P@KTSU    WHLT L1KTSU
     C                     MOVEL'51'      L1STI1
     C           P@KTSU    WHGT L1KTSU
     C                     MOVEL'52'      L1STI1
     C                     ENDSL
      *
     C                     Z-ADDP@KTSU    L1KTSU
      *
     C           P@KTSU    MULT 20        WKSRYO
      *
     C                     Z-ADD@BKMAX    SVKMAX  50
      *
     C           WKSRYO    DIV  20        W@KSSU  90
     C                     Z-ADD0         W@HAKD  51
     C           L1SYOS    IFNE 0
     C           W@KSSU    DIV  L1SYOS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C*
     C* CALCULATE ADJUSTMENT  FOR LOCAL WASHER
     C                     EXSR #SB710
      *
      ****
|    C           L1SYOS    IFEQ 0
|    C                     CLEARABMWP301
|    C                     MOVELERR02     ABTXT
|    C                     EXSR #SB800
|    C                     GOTO ESB410
|    C                     ENDIF
      *
     C                     MOVE *BLANK    ASTLR   2
     C                     MOVE L1HITO    WHITO   3
     C                     Z-ADD0         WMAIS   50
      *自動処理調整をゼロにする
     C                     Z-ADD0         W1MAIS  40
     C                     ADD  L1DAND    W1MAIS
     C                     ADD  L1KYOT    W1MAIS
     C                     ADD  L1FRYO    W1MAIS
     C                     ADD  L1SENY    W1MAIS
     C                     ADD  L11NAI    W1MAIS
     C                     ADD  L12NAI    W1MAIS
     C                     ADD  L1JISK    W1MAIS
     C                     ADD  L1OTHH    W1MAIS
     C                     Z-ADDW1MAIS    L1CMAI
     C                     Z-ADDW1MAIS    L1UZAR
     C********             SUB  L1AUAJ    L1CMAI
     C********             SUB  L1AUAJ    L1UZAR
     C                     Z-ADD0         L1AUAJ
     C                     CALL 'ABCR161' ACALL
     C******               ADD  L1UZAR    WMAIS
     C** FOR LOCAL WASHER
     C           L1BMON    IFNE 8990
     C                     EXSR #SB720
     C                     ENDIF
     C**
     C*****      WMAIS     IFGT 999
     C           WMAIS     IFGT 9999
     C                     CLEARABMWP301
     C                     MOVELERR01     ABTXT
     C                     EXSR #SB800
     C                     ENDIF
      *
     C                     Z-ADDWMAIS     L1KMAX
     C                     Z-ADDWMAIS     L1KMA4  50
     C           L1KMAX    IFEQ 1
     C                     ADD  1         L1AUAJ
     C                     ADD  1         L1CMAI
     C                     ADD  1         L1UZAR
     C           SVKMAX    IFEQ 1
     C           W@HAKD    ANDLT1.0
     C                     SUB  1         L1OTHH
     C                     SUB  1         L1CMAI
     C                     SUB  1         L1UZAR
     C                     MOVEL*BLANK    L1CMT1
     C                     MOVELCMT01     L1CMT1
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDWMAIS     L1KMAX
     C                     Z-ADDWMAIS     L1KMA4  50
     C******               Z-ADDL1UZAR    L1KMAX
     C                     Z-ADDL1KMAX    WKMAX
     C           L1DTKO    IFEQ '2'
     C           L1DTKO    OREQ 'D'
     C                     GOTO CAE
     C                     ENDIF
     C           L1DOUT    IFNE *BLANK
     C                     Z-ADDWALL      L1KALL
     C                     Z-ADDWMAX      L1KMIN
     C                     ENDIF
     C           *YEAR     CABEQL1KOYY    CA2
     C           *YEAR     SUB  L1KOYY    WYY     40
     C           WYY       IFLE 0001
     C                     Z-ADD*MONTH    XXMM
     C                     Z-ADD*DAY      XXDD
     C           XXMD      CABLEL1KOMD    CA2
     C                     ENDIF
     C           L1KALL    CABLTL1KMIN    CA2
     C           L1KMIN    CABGE30        CA2
     C                     SETOF                     30
     C           L1STI1    COMP 01                     30
     C  N30      L1STI1    COMP 49                   30
     C           *IN30     IFEQ '1'
     C                     ENDIF
     C           CA2       TAG
     C                     Z-ADD0         L1SRMS
     C           L1DOUT    IFNE *BLANK
     C                     MOVE *BLANK    L1KSHK
     C                     Z-ADD0         L1ALHK
     C                     Z-ADD0         L1MXHK
     C                     ENDIF
     C           L1KSKB    IFEQ KSKBN
     C           L1DOUT    CABEQ'Y'       CAE
     C           L1KSHK    CABEQ*BLANK    CAE
     C                     Z-ADDL1ALHK    WKALL            f]ﾌﾞ]ubﾇc ALL
     C                     Z-ADDL1MXHK    WMAX                       MAX
     C                     ELSE
     C           L1KSHK    IFNE *BLANK
     C                     Z-ADDL1ALHK    WKALL
     C                     Z-ADDL1MXHK    WMAX
     C                     ENDIF
     C                     ENDIF
     C*******              Z-ADD0         L1KALL
     C********             Z-ADD0         L1KMIN
     C           WKALL     IFGT WMAX
     C           WKALL     SUB  WMAX      L1SRMS
     C                     ENDIF
     C           CAE       TAG
     C                     EXSR #KOSN
      *
     CSR         ESB410    ENDSR
     C*****************************************************
     C*   MO-NO  ﾎｦbﾓ ﾃcﾆ]
     C*****************************************************
     C           #KOSN     BEGSR
      *
     C           L1DTKO    IFNE '0'                        0-nﾒiﾆ
     C* ﾃcﾈbﾍ]f]ﾌﾞ]uﾇjｰ ﾃcﾆ]
     C           L1KCD2    IFNE 'Z'
     C           L1KSKB    IFEQ KSKBN
     C           L1DOUT    CABEQ'Y'       @005
     C           L1KSHK    CABEQ*BLANK    @005
     C                     ENDIF
     C           L1DOUT    IFNE *BLANK
     C                     MOVE 'H'       L1KSHK
     C                     Z-ADDWKALL     L1ALHK
     C                     Z-ADDWMAX      L1MXHK
     C                     ENDIF
     C           @005      TAG
     C           L1DTKO    IFNE '2'
     C           KSKBN     IFEQ L1KSKB
     C           L1KMIN    IFEQ L1KMAX
     C                     GOTO @006
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     MOVE *BLANK    L1DOUT
     C                     MOVE 'Y'       L1KOUT
     C           @006      TAG
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVEL'ZIDOU'   L1KOME    P
     C                     Z-ADD*YEAR     L1KOYY
     C                     Z-ADDUMONTH    L1KOMM
     C                     Z-ADDUDAY      L1KODD
     C                     Z-ADDWTITH     L1KOHH
     C                     Z-ADDWTITM     L1KOSS
      *
     C           L1DTKO    IFEQ '0'
     C                     ELSE
     C                     MOVE '1'       L1DTKO
     C                     MOVE '*'       L1DTHE
     C                     UPDATAKBPL041
     C                     EXSR #SB810
     C                     ENDIF
      *
     C           @007      ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB710    BEGSR
      *
     C                     Z-ADD0         WKADJU  30
     C           KEYB6     KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           KEYB6     CHAINABMPPB61             94
     C           *IN94     IFEQ '0'
     C           AISKJY    ANDEQ'D'
     C           AISKHZ    ANDLE*DATE
     C                     SETON                     94
     C                     ENDIF
     C           *IN94     IFEQ '0'
     C                     Z-ADDAIADJU    WKADJU
     C                     ELSE
     C                     EXSR #SB711
     C                     ENDIF
      *
     CSR         ESB710    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB711    BEGSR
      *
     C           WKSRYO    DIV  20        W@KSSU  90
     C                     Z-ADD0         W@HAKD  51
     C           L1SYOS    IFNE 0
     C           W@KSSU    DIV  L1SYOS    W@HAKD
     C                     ENDIF
     C           W@HAKD    IFEQ 0
     C                     Z-ADD0.1       W@HAKD
     C                     ENDIF
     C                     Z-ADD0         WKADJU  30
     C           KEYB5     KLIST
     C                     KFLD           L1KCD1  1
     C                     KFLD           L1KCD2  1
     C                     MOVEL'0'       GET     1
     C           KEYB5     SETLLABMPPB51
     C           KEYB5     READEABMPPB51                 94
     C           *IN94     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           AHSKJY    IFEQ 'D'
     C           AHSKHZ    ANDLE*DATE
     C                     ELSE
     C                     SELEC
     C           AHFUGO    WHEQ '1'
     C           W@HAKD    IFLT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '2'
     C           W@HAKD    IFGT AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '3'
     C           W@HAKD    IFEQ AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '4'
     C           W@HAKD    IFLE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '5'
     C           W@HAKD    IFGE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C           AHFUGO    WHEQ '6'
     C           W@HAKD    IFNE AHHTSU
     C                     Z-ADDAHADJU    WKADJU
     C                     MOVEL'1'       GET
     C                     ENDIF
     C                     ENDSL
     C                     ENDIF
     C           KEYB5     READEABMPPB51                 94
     C                     ENDDO
      *
     CSR         ESB711    ENDSR
      *---------------------------*
      * A-PICS 以外　調整枚数
      *---------------------------*
     CSR         #SB720    BEGSR
      *
     C                     Z-ADD0         SA@     40
      *今回ー前回　枚数
     C           WMAIS     SUB  SVKMAX    SA      50
     C******     SVKMAX    SUB  WMAIS     SA      40
     C                     Z-ADDSA        SA@
     C*******    SA@       IFLT 0
     C                     MULT -1        SA@
     C*******              ENDIF
      *今回/前回
     C                     Z-ADD0         RITU    72
     C           SVKMAX    IFNE 0
     C           WMAIS     DIV  SVKMAX    RITU
     C                     ENDIF
      *
     C                     MULT 100       RITU
     C           RITU      IFGE 100
     C                     SUB  100       RITU
     C                     ELSE
     C           100       SUB  RITU      RITU
     C                     ENDIF
      *  IF # OF CHANGE SHEETS IS LESS THAN MASTER RATE,
      *   FILL THE GAP BY ADJUSTMENT SHEETS.
     C           RITU      IFLT WKADJU
     C                     Z-ADDSA@       L1AUAJ
     C                     ADD  L1AUAJ    L1CMAI
     C                     ADD  L1AUAJ    L1UZAR
     C                     MOVE '000'     PMIS    3
     C                     Z-ADD0         WMAIS   50
     C                     CALL 'ABCR161' ACALL
     C                     ENDIF
      *
     CSR         ESB720    ENDSR
      *---------------------------*
      *エラーファイル           *
      *---------------------------*
     CSR         #SB800    BEGSR
      *
     C                     MOVELL1SHN1    ABJHN1
     C                     MOVELL1SHN2    ABJHN2
     C                     MOVELL1SHN3    ABJHN3
     C                     MOVELL1TKR1    ABATK1
     C                     MOVELL1TKR2    ABATK2
     C                     MOVELL1TKR3    ABATK3
     C                     MOVELL1TKR4    ABATK4
     C                     MOVELL1KCD1    ABKCD1
     C                     MOVELL1KCD2    ABKCD2
     C                     WRITEABMWP301
      *
     CSR         ESB800    ENDSR
      *---------------------------*
      *結果                     *
      *---------------------------*
     CSR         #SB810    BEGSR
      *
     C                     MOVELL1KCD1    @BKCD1
     C                     MOVELL1KCD2    @BKCD2
     C                     MOVELL1SHN1    @BJHN1
     C                     MOVELL1SHN2    @BJHN2
     C                     MOVELL1SHN3    @BJHN3
     C                     MOVELL1BMON    @BATOB
     C                     MOVELL1KTEI    @BATOK
     C                     MOVELL1TKR1    @BATK1
     C                     MOVELL1TKR2    @BATK2
     C                     MOVELL1TKR3    @BATK3
     C                     MOVELL1TKR4    @BATK4
     C**                   Z-ADD@BKTSU    @BKTSU
     C**                   Z-ADD@BKMAX    @BKMAX
     C                     Z-ADDL1KTSU    @AKTSU
     C                     Z-ADDL1KMA4    @AKMAX
     C                     Z-ADDL1UZAR    @AMAXH
     C                     Z-ADDL1ROTO    @AKLOT
     C           L1ROTO    IFEQ 0
     C                     Z-ADD1         @AKLOT
     C                     ENDIF
      *
     C                     Z-ADD0         @APADJ
     C                     Z-ADDL1AUAJ    @AAUAJ
     C                     Z-ADD0         @ADUPH
     C                     Z-ADDL1OTHH    @AOTHH
     C                     Z-ADDW@HAKD    @NBOXD
     C                     Z-ADDWKSRYO    @ANSRY
     C                     MOVEL'0'       @APICS
      *
     C           @AKMAX    SUB  @BKMAX    @SA
     C                     Z-ADD0         @SA2
     C           @AKMAX    SUB  @AAUAJ    R123    50
     C           @BKMAX    IFNE 0
     C           R123      DIV  @BKMAX    @SA2
     C                     ENDIF
      *
     C                     WRITEABMWP311
      *
     CSR         ESB810    ENDSR
