     H            Y.
      ** AFAR82 **********************************************
      *  DELETE A-PICS MATERIAL SUPPLY RECORD READ BY BARCODE*
      *         K.KASHIWAGI     2000.12.08                   *
      ********************************* AFAR82 ***************
     FAFAPW82 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAFAPL80 UF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      *
     E                    MSGTBL  1   6 60
     I           SDS
     I                                        1   8 @PGMID
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  38 S@KEY
     I                                        1   4 S@SUPP
     I                                        5   9 S@PAR1
     I                                       10  14 S@PAR2
     I                                       15  16 S@PAR3
     I                                       17  20 S@ZETI
     I                                       21  23 S@TEHI
     I                                       24  25 S@PAGE
     I                                       26  330S@DATE
     I                                       34  380S@RENO
     I            DS
     I                                        1   80A8SKHZ
     I                                        1   40A8SKYY
     I                                        5   60A8SKMM
     I                                        7   80A8SKDD
     I            DS
     I                                        1   5 @BAR1
     I                                        1   1 A8KANR
     I                                        2   5 A8ZETI
     I            DS
     I                                        1   5 @BAR2
     I                                        1   3 A8TEHI
     I                                        4   5 A8PAGE
     I            DS
     I                                        1   5 @BAR3
     I                                        1   1 A8NIJI
     I                                        2   2 A8TAIS
     I                                        3   3 A8SYUK
     I                                        4   4 A8HKOS
     I                                        5   5 A8CHKD
     I            DS
     I                                        1  14 @PARS
     I                                        1   5 @PAR1S
     I                                        6   6 HY5
     I                                        7  11 @PAR2S
     I                                       12  12 HY6
     I                                       13  14 @PAR3S
     I            DS
     I                                        1  17 @BARS
     I                                        1   5 @BAR1S
     I                                        6   6 HY7
     I                                        7  11 @BAR2S
     I                                       12  12 HY8
     I                                       13  17 @BAR3S
     I            DS
     I                                        1  14 @PAR@3
     I                                        1   5 @PAR13
     I                                        6   6 HY9
     I                                        7  11 @PAR23
     I                                       12  12 HY10
     I                                       13  14 @PAR33
     I            DS
     I                                        1  17 @BAR@3
     I                                        1   5 @BAR13
     I                                        6   6 HY11
     I                                        7  11 @BAR23
     I                                       12  12 HY12
     I                                       13  17 @BAR33
     I            DS
     I                                        1  14 A8PAR
     I                                        1   5 A8PAR1
     I                                        6   6 HY1
     I                                        7  11 A8PAR2
     I                                       12  12 HY2
     I                                       13  14 A8PAR3
     I            DS
     I                                        1  14 @PAR1
     I                                        1   5 @PAR11
     I                                        6   6 HY3
     I                                        7  11 @PAR21
     I                                       12  12 HY4
     I                                       13  14 @PAR31
     I            DS
     I                                        1   80DATE
     I                                        1   20W@CT
     I                                        3   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1  120#TIME
     I                                        1   20W@HH
     I                                        3   40W@MIN
     I                                        5   60W@SS
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     C*
     C           KEY1      KLIST
     C                     KFLD           A8SUPP
     C*
     C           KEY2      KLIST
     C                     KFLD           A8SUPP
     C                     KFLD           A8PAR1
     C                     KFLD           A8PAR2
     C                     KFLD           A8PAR3
     C*
     C           KEY3      KLIST
     C                     KFLD           A8SUPP
     C                     KFLD           A8PAR1
     C                     KFLD           A8PAR2
     C                     KFLD           A8PAR3
     C                     KFLD           A8ZETI
     C                     KFLD           A8TEHI
     C                     KFLD           A8PAGE
     C                     KFLD           A8DATE
     C                     KFLD           A8RENO
     C*
     C           KEY5      KLIST
     C                     KFLD           @SUPP3
     C                     KFLD           @PAR13
     C                     KFLD           @PAR23
     C                     KFLD           @PAR33
     C                     KFLD           @ZETI3
     C                     KFLD           @TEHI3
     C                     KFLD           K51
     C                     KFLD           K52
     C                     KFLD           K53
     C*
     C           KEY4      KLIST
     C                     KFLD           B2CODE
     C*
     C           *ENTRY    PLIST
     C                     PARM           US     10
     C*
     C                     MOVEL*BLANKS   S@SUPP  4
     C                     MOVEL*BLANKS   S@PAR1  5
     C                     MOVEL*BLANKS   S@PAR2  5
     C                     MOVEL*BLANKS   S@PAR3  2
     C                     MOVEL*BLANKS   S@ZETI  4
     C                     MOVEL*BLANKS   S@TEHI  3
     C                     MOVEL*BLANKS   S@PAGE  2
     C                     MOVEL*BLANKS   S@BAR1  5
     C                     MOVEL*BLANKS   S@BAR2  5
     C                     MOVEL*BLANKS   S@BAR3  5
     C                     MOVEL*BLANKS   S@WORK  6
     C                     Z-ADD0         S@DATE  80
     C                     Z-ADD0         S@RENO  50
      *--------------*
      * MAIN ROUTINE *
      *--------------*
     C                     EXSR @INTR
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      @DSP1
     C           W@ID      CASEQ'02'      @DSP2
     C           W@ID      CASEQ'03'      @DSP3
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
      *---------------*
      * INITIALIZATION
      *---------------*
     C           @INTR     BEGSR
     C                     MOVEL*BLANKS   @MSG1
     C                     MOVEL*BLANKS   @MSG2
     C                     MOVEL*BLANKS   @OPTS
     C                     MOVEL*BLANKS   MAXFLG  1
     C                     MOVEL*BLANKS   HY1
     C                     MOVEL*BLANKS   HY2
     C                     MOVEL*BLANKS   HY3
     C                     MOVEL*BLANKS   HY4
     C                     MOVEL'01'      W@ID    2
     C                     TIME           #TIME
     C                     MOVE *DATE     DATE
     C                     Z-ADD2000      W@YY4   40
     C                     ADD  W@YY      W@YY4
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         CNT     50
     C                     Z-ADD0         ERRCK   40
     C                     ENDSR
      *--------------*
      * FIRST SCREEN *
      *--------------*
     C           @DSP1     BEGSR
     C                     EXFMTAFAPW821
     C                     MOVEL*BLANKS   @MSG1
     C                     MOVEL'0'       *IN99
     C                     MOVEL'0'       *IN01
     C                     MOVEL'0'       *IN02
     C                     MOVEL'0'       *IN03
     C                     MOVEL'0'       *IN80
     C                     MOVEL'0'       *IN81
     C                     MOVEL'0'       *IN30
     C                     MOVEL'0'       *IN31
     C                     MOVEL'0'       *IN32
     C                     MOVEL*BLANKS   ERRFLG  1
     C*
     C                     SELEC
     C           *INKA     WHEQ '1'
     C                     MOVEL'99'      W@ID
     C                     OTHER
     C                     EXSR @CHECK
     C                     ENDSL
     C                     ENDSR
      *--------------*
      * CHECK1*
      *--------------*
     C           @CHECK    BEGSR
     C                     TESTN          @SUPP1     03
     C           *IN03     IFEQ '0'
     C                     MOVELMSGTBL,2  @MSG1
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN31
     C                     MOVEL'Y'       ERRFLG
     C                     ELSE
     C                     MOVEL@SUPP1    B2CODE
     C           KEY4      CHAINFGBPL011             30
     C           *IN30     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     ENDIF
     C           *IN30     IFEQ '1'
     C                     MOVELMSGTBL,2  @MSG1
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN31
     C                     MOVEL'Y'       ERRFLG
     C                     ENDIF
     C*
     C           ERRFLG    IFEQ *BLANK
     C                     MOVEL@SUPP1    A8SUPP
     C           KEY1      CHAINAFAPL80              80
     C           *IN80     IFEQ '1'
     C                     MOVELMSGTBL,2  @MSG1
     C                     MOVEL'1'       *IN99
     C                     MOVEL'1'       *IN31
     C                     MOVEL'Y'       ERRFLG
     C                     ENDIF
     C                     ENDIF
     C*
     C           ERRFLG    IFEQ *BLANK
     C           @PAR1     IFNE *BLANK
     C                     MOVEL@SUPP1    A8SUPP
     C                     MOVEL@PAR11    A8PAR1
     C                     MOVEL@PAR21    A8PAR2
     C                     MOVEL@PAR31    A8PAR3
     C           KEY2      CHAINAFAPL80              81
     C           *IN81     IFEQ '1'
     C                     MOVEL'1'       *IN32
     C                     MOVEL'1'       *IN99
     C                     MOVELMSGTBL,3  @MSG1
     C                     MOVEL'Y'       ERRFLG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           ERRFLG    IFEQ *BLANK
     C                     EXSR @SETSR
     C           KEY4      CHAINFGBPL01              50
     C           *IN50     IFEQ '0'
     C                     MOVELB2SMEI    @SUPNC
     C                     ELSE
     C                     MOVEL*BLANKS   @SUPNC
     C                     ENDIF
     C                     MOVEL'02'      W@ID
     C                     ENDIF
     C*
     C                     ENDIF
     C                     ENDSR
      *---------------*
     C* SET RECORD
      *---------------*
     C           @SETSR    BEGSR
     C           @PAR1     IFNE *BLANKS
     C                     MOVEL@SUPP1    @SUPPS
     C                     MOVEL@SUPP1    @SUPPC
     C                     MOVEL@SUPP1    A8SUPP
     C                     MOVEL@PAR11    A8PAR1
     C                     MOVEL@PAR21    A8PAR2
     C                     MOVEL@PAR31    A8PAR3
     C                     MOVEL'-'       HY3
     C                     MOVEL'-'       HY4
     C           KEY2      SETLLAFAPL80
     C                     ELSE
     C           KEY1      SETLLAFAPL80
     C                     MOVEL@SUPP1    @SUPPS
     C                     MOVEL@SUPP1    @SUPPC
     C                     MOVEL@SUPP1    A8SUPP
     C                     ENDIF
     C                     Z-ADD1         WTCNT   20
     C*                    DO   9
     C                     MOVEL'0'       *IN60
     C           *IN60     DOWEQ'0'
     C**         WTCNT     ORLE 9
     C           @PAR1     IFNE *BLANKS
     C           KEY2      READEAFAPL80                  60
     C                     ELSE
     C           KEY1      READEAFAPL80                  60
     C                     ENDIF
     C           *IN60     IFEQ '1'
     C           WTCNT     OREQ 10
     C                     LEAVE
     C                     ENDIF
     C           A8SKJY    IFEQ 'D'
     C           A8SKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         RRN1
     C                     MOVELA8SUPP    @SUPPS
     C                     MOVELA8PAR1    @PAR1S
     C                     MOVELA8PAR2    @PAR2S
     C                     MOVELA8PAR3    @PAR3S
     C                     MOVEL'-'       HY5
     C           @PAR3S    IFEQ *BLANKS
     C                     MOVEL*BLANKS   HY6
     C                     ELSE
     C                     MOVEL'-'       HY6
     C                     ENDIF
     C                     MOVELA8ZETI    @ZETIS
     C                     MOVELA8TEHI    @TEHIS
     C                     MOVELA8PAGE    @PAGES
     C                     Z-ADDA8DATE    @DATE
     C                     MOVELA8RENO    @RENO
     C                     MOVEL@BAR1     @BAR1S
     C                     MOVEL@BAR2     @BAR2S
     C                     MOVEL@BAR3     @BAR3S
     C                     MOVEL'-'       HY7
     C                     MOVEL'-'       HY8
     C                     MOVELA8WORK    @WORKS
     C                     MOVEL*BLANKS   @OPTS
     C                     WRITESFL01
     C                     ADD  1         WTCNT
     C                     MOVELA8SUPP    S@SUPP
     C                     MOVELA8PAR1    S@PAR1
     C                     MOVELA8PAR2    S@PAR2
     C                     MOVELA8PAR3    S@PAR3
     C                     MOVELA8ZETI    S@ZETI
     C                     MOVELA8TEHI    S@TEHI
     C                     MOVELA8PAGE    S@PAGE
     C                     Z-ADDA8DATE    S@DATE
     C                     Z-ADDA8RENO    S@RENO
     C                     ENDIF
     C                     ENDDO
     C           RRN1      IFLE 0
     C                     MOVELMSGTBL,5  @MSG1
     C                     SETON                     99
     C                     MOVEL'01'      W@ID
     C                     ELSE
     C                     Z-ADDRRN1      @SFRCD
     C                     ENDIF
     C*
     C                     ENDSR
      *---------------*
      * SECOND SCREEN *
      *---------------*
     C           @DSP2     BEGSR
     C                     WRITEFMT90
     C                     MOVEL'1'       *IN70
     C                     EXFMTSFLCTL
     C                     Z-ADD@@REC     @SFRCD
     C                     MOVEL*BLANKS   @MSG2
     C                     MOVEL'0'       *IN99
     C                     MOVEL'0'       *IN70
     C                     MOVEL'0'       *IN33
     C                     MOVEL*BLANKS   ERRFLG  1
     C                     Z-ADD0         ERRCK
     C*
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'01'      W@ID
     C                     EXSR @CLRSR
     C                     Z-ADD0         RRN1
     C                     MOVEL*BLANKS   @SUPP1
     C                     MOVEL*BLANKS   @PAR1
     C           *IN90     WHEQ '1'
     C                     EXSR @PGUP
     C                     OTHER
     C                     EXSR @CHK2
     C                     ENDSL
     C                     ENDSR
      *--------------*
     C*PAGE UP       *
      *--------------*
     C           @PGUP     BEGSR
     C           MAXFLG    IFEQ 'Y'
     C                     MOVELMSGTBL,6  @MSG2
     C                     ENDIF
     C*
     C                     MOVELS@SUPP    A8SUPP
     C                     MOVELS@PAR1    A8PAR1
     C                     MOVELS@PAR2    A8PAR2
     C                     MOVELS@PAR3    A8PAR3
     C                     MOVELS@ZETI    A8ZETI
     C                     MOVELS@TEHI    A8TEHI
     C                     MOVELS@PAGE    A8PAGE
     C                     Z-ADDS@DATE    A8DATE
     C                     Z-ADDS@RENO    A8RENO
     C*
     C           KEY3      SETGTAFAPL80
     C*
     C                     Z-ADD1         WTCNT   20
     C*                    DO   9
     C                     MOVEL'0'       *IN60
     C           *IN60     DOWEQ'0'
     C****       WTCNT     ORLE 9
     C           @PAR1     IFNE *BLANKS
     C           KEY2      READEAFAPL80                  60
     C                     ELSE
     C           KEY1      READEAFAPL80                  60
     C                     ENDIF
     C           *IN60     IFEQ '1'
     C           WTCNT     OREQ 10
     C                     LEAVE
     C                     ENDIF
     C           A8SKJY    IFEQ 'D'
     C           A8SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL*BLANKS   @OPTS
     C                     MOVELA8SUPP    @SUPPS
     C                     MOVELA8PAR1    @PAR1S
     C                     MOVELA8PAR2    @PAR2S
     C                     MOVELA8PAR3    @PAR3S
     C                     MOVEL'-'       HY5
     C           @PAR3S    IFEQ *BLANKS
     C                     MOVEL*BLANKS   HY6
     C                     ELSE
     C                     MOVEL'-'       HY6
     C                     ENDIF
     C                     MOVELA8ZETI    @ZETIS
     C                     MOVELA8TEHI    @TEHIS
     C                     MOVELA8PAGE    @PAGES  2
     C                     MOVEL@BAR1     @BAR1S
     C                     MOVEL@BAR2     @BAR2S
     C                     MOVEL@BAR3     @BAR3S
     C                     MOVEL'-'       HY7
     C                     MOVEL'-'       HY8
     C                     MOVELA8WORK    @WORKS
     C                     Z-ADDA8DATE    @DATE
     C                     MOVELA8RENO    @RENO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ADD  1         WTCNT
     C                     MOVELA8SUPP    S@SUPP
     C                     MOVELA8PAR1    S@PAR1
     C                     MOVELA8PAR2    S@PAR2
     C                     MOVELA8PAR3    S@PAR3
     C                     MOVELA8ZETI    S@ZETI
     C                     MOVELA8TEHI    S@TEHI
     C                     MOVELA8PAGE    S@PAGE
     C                     Z-ADDA8DATE    S@DATE
     C                     Z-ADDA8RENO    S@RENO
     C                     ENDIF
     C                     ENDDO
     C                     Z-ADDRRN1      @SFRCD
     C*
     C           RRN1      IFEQ 9999
     C                     MOVEL'Y'       MAXFLG
     C                     ENDIF
     C*
     C                     ENDSR
      *---------------*
     C* CHECK2        *
      *---------------*
     C           @CHK2     BEGSR
     C                     MOVEL*BLANKS   OPT@S   1
     C                     Z-ADD1         CNT     50
     C                     Z-ADDRRN1      RRN     40
     C           CNT       DOWLERRN
     C           CNT       IFGT RRN
     C                     LEAVE
     C                     ENDIF
     C           CNT       CHAINSFL01                61
     C           *IN61     IFEQ '0'
     C           @OPTS     IFNE *BLANKS
     C           @OPTS     ANDNE'0'
     C                     MOVEL'1'       *IN33
     C           OPT@S     IFEQ *BLANKS
     C                     MOVEL'Y'       OPT@S
     C                     ENDIF
     C           ERRCK     IFEQ 0
     C                     MOVEL'1'       *IN99
     C                     MOVELMSGTBL,1  @MSG2
     C                     Z-ADDCNT       ERRCK
     C                     ENDIF
     C                     ENDIF
     C           @OPTS     IFNE *BLANKS
     C           @OPTS     ANDEQ'0'
     C                     MOVEL'0'       *IN33
     C           OPT@S     IFEQ *BLANKS
     C                     MOVEL'Y'       OPT@S
     C                     ENDIF
     C                     ENDIF
     C           @OPTS     IFEQ *BLANKS
     C                     MOVEL'0'       *IN33
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ADD  1         CNT
     C                     ENDDO
     C*
     C                     Z-ADD1         CNT1    50
     C           @MSG2     IFEQ *BLANKS
     C           CNT1      DOWLERRN
     C           CNT1      CHAINSFL01                61
     C           *IN61     IFEQ '0'
     C           @OPTS     IFNE *BLANKS
     C           @OPTS     ANDEQ'0'
     C                     MOVEL*BLANKS   @OPTS
     C                     UPDATSFL01
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         CNT1    50
     C                     ENDDO
     C                     ENDIF
     C*
     C           @MSG2     IFEQ *BLANKS
     C           OPT@S     ANDEQ'Y'
     C                     Z-ADDCNT1      RRN1
     C           RRN1      CHAINSFL01                62
     C                     MOVEL@SUPPC    @SUPP3
     C           *IN62     IFEQ '0'
     C                     MOVE S@SUPP    B2CODE
     C           KEY4      CHAINFGBPL01              50
     C           *IN50     IFEQ '0'
     C                     MOVELB2SMEI    @SUPN3
     C                     ELSE
     C                     MOVEL*BLANKS   @SUPN3
     C                     ENDIF
     C                     MOVEL@PAR1S    @PAR13
     C                     MOVEL@PAR2S    @PAR23
     C                     MOVEL@PAR3S    @PAR33
     C                     MOVEL'-'       HY9
     C           @PAR33    IFEQ *BLANKS
     C                     MOVEL*BLANKS   HY10
     C                     ELSE
     C                     MOVEL'-'       HY10
     C                     ENDIF
     C                     MOVEL@TEHIS    @TEHI3
     C                     MOVEL@ZETIS    @ZETI3
     C                     MOVEL@BAR1S    @BAR13
     C                     MOVEL'-'       HY11
     C                     MOVEL@BAR2S    @BAR23
     C           @BAR3S    IFEQ *BLANKS
     C                     MOVEL*BLANKS   HY12
     C                     ELSE
     C                     MOVEL'-'       HY12
     C                     ENDIF
     C                     MOVEL@BAR3S    @BAR33
     C                     MOVEL@WORKS    @WORK3
     C                     MOVEL'03'      W@ID
     C                     ENDIF
     C*
     C                     MOVE @PAGES    K51     2
     C                     Z-ADD@DATE     K52     80
     C                     Z-ADD@RENO     K53     50
     C                     ENDIF
     C*
     C           @MSG2     IFNE *BLANKS
     C                     Z-ADDERRCK     @SFRCD
     C                     ENDIF
     C                     ENDSR
      *---------------*
      * THIRD  SCREEN *
      *---------------*
     C           @DSP3     BEGSR
     C                     WRITEFMT91
     C                     EXFMTAFAPW823
     C                     MOVEL'0'       *IN99
     C                     MOVEL*BLANKS   ERRFLG  1
     C*
     C                     SELEC
     C           *INKC     WHEQ '1'
     C*                    MOVEL'02'      W@ID
     C                     EXSR @CLRSR
     C                     EXSR @CHECK
     C                     EXSR @SETSR
     C           *INKE     WHEQ '1'
     C                     EXSR @UPDT
     C                     ENDSL
     C                     ENDSR
     C*---------------*
     C* DELETE ROUTIN *
     C*---------------*
     C           @UPDT     BEGSR
     C           KEY5      CHAINAFAPL80              85
     C           *IN85     IFEQ '0'
     C                     MOVEL'D'       A8SKJY
     C                     Z-ADDW@YY4     A8SKYY
     C                     Z-ADDW@MM      A8SKMM
     C                     Z-ADDW@DD      A8SKDD
     C                     Z-ADDW@YY4     A8KOYY
     C                     Z-ADDW@MM      A8KOMM
     C                     Z-ADDW@DD      A8KODD
     C                     Z-ADDW@HH      A8KOHH
     C                     Z-ADDW@MIN     A8KOSS
     C                     MOVELUS        A8KOME
     C                     MOVEL@PGMID    A8KOPG
     C                     UPDATAFAPL801
     C                     EXSR @CLRSR
     C                     MOVELMSGTBL,4  @MSG2
     C                     EXSR @SETSR
     C                     Z-ADDRRN1      @SFRCD
     C                     ENDIF
     C                     MOVEL'02'      W@ID
     C*
     C                     ENDSR
     C****************
     C* CLEAR SFL
     C****************
     C           @CLRSR    BEGSR
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     71
     C                     Z-ADD0         RRN1
     C                     ENDSR
** (MSGTBL)
E-01 INVALID OPTION.
E-02 INVALID SUPPLIER CODE.
E-03 INVALID PART NUMBER.
E-04 RECORD IS DELETED.
E-05 RECORD IS NOT FOUND.
E-06 EXCEEDED MAX RECORD NUMBER.
