     H            Y.
     F** AFARN4 ********************************************
     F*     IAF OWK LOT# SEQUENCE FILE                     *
     F*          C.SAKTHIP    2025.03.01                   *
     F******************************************************
     FAFAPPN5 O   E           K        DISK                      A
     E                    NBR    10  10  1
     E                    RNO    21  21  1
     I            DS
     I                                        1   3 LOTN
     I                                        1   1 L1
     I                                        2   2 L2
     I                                        3   3 L3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WNKOTI
     I                                        7  140WNKOHZ
      *
     C                     TIME           WTIME
     C                     MOVEL'QPGMR'   WNKONA
     C                     MOVEL'AFARN4'  WNKOPG
      *
     C                     Z-ADD1         @SORT   60
      *
     C                     Z-ADD1         C1      30
     C                     Z-ADD1         C2      30
     C                     Z-ADD1         C3      30
      *
     C           C1        DOWLE10
     C                     MOVELNBR,C1    L1
      *
     C                     Z-ADD1         C2      30
     C           C2        DOWLE21
     C                     MOVELRNO,C2    L2
      *
     C                     Z-ADD1         C3
     C           C3        DOWLE10
     C                     MOVELNBR,C3    L3
      *
     C                     MOVELLOTN      WNLOTN
     C                     MOVE @SORT     WNSORT
     C                     WRITEAFAPPN51
     C                     ADD  1         C3
     C                     ADD  1         @SORT
     C                     ENDDO
      *
     C                     ADD  1         C2
     C                     ENDDO
      *
     C                     ADD  1         C1
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
** NBR
0123456789
** RNO
ABCDEFGHJKLMNRSTUVWXY
