     H            Y.                                                      ESD110
     F** AFAR16 ********************************************
     F* A-PICS ORDERING DATA REORGANIZATION (DELETE REC OMIT )  *
     F*             M-OKUDA          86.12.05              *
     F******************************************** AFAR16 **
     FAU#PP11 IP  E                    DISK
     FAAIPL11 IF  E           K        DISK
     FAU#NP16 O   E                    DISK
     I            DS
     I                                        1   80CQSKHZ
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
      *
     C           *IN02     IFEQ '0'
     C                     SETON                     02
      *
     C                     SETOF                     01
     C                     Z-ADD0         WZNHZ   80
     C                     Z-ADD0111      WBMON   40
     C           WBMON     CHAINAAIPL111             01
     C           *IN01     IFEQ '0'
     C                     Z-ADDCDZNHZ    WZNHZ
     C                     END
      *
     C                     END
      *
     C           CQSKJY    IFEQ 'D'
     C           CQSKHZ    IFLT WZNHZ
     C                     GOTO END
     C                     END
     C                     END
      *
     C                     WRITEAU#NP161
      *
     C           END       TAG
