     H            Y.
     FAFAPPNO UF  E           K        DISK                      A
     C           *ENTRY    PLIST
     C                     PARM           P@ZETI  4
     C                     PARM           P@LOTN  3
      *
     C                     MOVE P@ZETI    K@ZETI  4
      *
     C           K@ZETI    CHAINAFAPPNO              77
      *
     C                     MOVE P@ZETI    WFZETI
      *
     C           *IN77     IFEQ '0'
     C                     MOVE WFLOTN    N@LOTN  30
     C                     ADD  1         N@LOTN
     C           N@LOTN    IFEQ 990
     C                     Z-ADD0         N@LOTN
     C                     END
     C                     MOVE N@LOTN    WFLOTN
     C                     UPDATAFAPPNO1
     C                     ELSE
     C                     MOVE '001'     WFLOTN
     C                     WRITEAFAPPNO1
     C                     END
      *
     C                     MOVE WFLOTN    P@LOTN
      *
     C                     SETON                     LR
     C                     RETRN
      *
