     H            Y.                                    1
     FAFAPL84 IF  E           K        DISK
     FALDPL30 IF  E           K        DISK
     I            DS
     I                                        1   80A8SUHZ
     I                                        1   40A8SUYY
     I                                        5   60A8SUMM
     I                                        7   80A8SUDD
     I            DS
     I                                        1   80A3SYDT
     I                                        1   40A3SYYY
     I                                        5   60A3SYMM
     I                                        7   80A3SYDD
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@THMS
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  140W@DYMD
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
      *
     C                     TIME           W@TIME
      *
     C                     Z-ADDW@DYMD    P#IDAT  80
     C                     Z-ADDW@THMS    P#ITIM  60
     C                     MOVE 'M'       P#F     1
     C                     Z-ADD-1        P#A     50
     C                     Z-ADD0         P#ODAT  80
     C                     Z-ADD0         P#OTIM  60
     C                     CALL 'DATR49'
     C                     PARM           P#IDAT  80
     C                     PARM           P#ITIM  60
     C                     PARM           P#F     1
     C                     PARM           P#A     50
     C                     PARM           P#ODAT  80
     C                     PARM           P#OTIM  60
      *
     C           *ENTRY    PLIST
     C                     PARM           P@SUPP  4
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@BOX   40
      *
     C                     MOVE P@HIN1    K@HIN1
     C                     MOVE P@HIN2    K@HIN2
     C                     MOVE P@HIN3    K@HIN3
      *
     C           AFAKEY    KLIST
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
      *
     C                     Z-ADD0         P@BOX   40
      *
     C           AFAKEY    SETLLAFAPL84
     C                     DO   *HIVAL
     C           AFAKEY    READEAFAPL84                  88
     C   88                LEAVE
     C           A8SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           P@SUPP    IFNE *BLANK
     C           P@SUPP    ANDNEA8SUPP
     C                     ITER
     C                     END
     C           A8DATE    IFLT P#ODAT
     C                     ITER
     C                     END
     C           A8NOYY    IFNE 0
     C                     ITER
     C                     END
      *
     C           A8SUHZ    IFNE 0
     C                     Z-ADD0         W@SHIP  20
     C                     EXSR #ALD
     C           W@SHIP    IFNE 0
     C                     ITER
     C                     END
     C                     END
      *
     C                     ADD  1         P@BOX
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
     C           #ALD      BEGSR
      *
     C           K#ADL3    KLIST
     C                     KFLD           A8ZETI
     C                     KFLD           A8TEHI
     C                     KFLD           A8PAGE
      *
     C           K#ADL3    SETLLALDPL30
     C                     DO   *HIVAL
     C           K#ADL3    READEALDPL30                  89
     C   89                LEAVE
     C           A3SYDT    IFGT A8SUHZ
     C                     ADD  1         W@SHIP
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C                     ENDSR
     O*OUTPUT  E                ODAT
     O*                         A8TEHI
     O*                                      ','
     O*                         A8PAGE
     O*                                      ','
     O*                         A8SUHZ
     O*                                      ','
     O*                         A8ODNO
     O*                                      ','
