     H            Y.
     F** AFAR151 *******************************************
     F*  APICS ISSUE DATA ACCUMULATE                       *
     F*                                                    *
     F* TCHK  04/08/11 CRATE(COPY FROM AFAR15)             *
     F******************************************************
     FAFAWP14 IP  F     250            DISK
     FAH#PP90 O   E                    DISK                      A
     I*
     IAFAWP14 AA  01
     I                                        1   1 CFSKJY
     I                                       18  27 CFKOME
     I                                       28  32 CFHIN1
     I                                       33  37 CFHIN2
     I                                       38  39 CFHIN3
     I                                       40  40 CFKDAI
     I                                       41  430CFMAIS
     I                                       44  470CFHTYY
     I                                       48  490CFHTMM
     I                                       50  510CFHTDD
     I                                       52  530CFHTBB
     I                                       54  570CFSYYY
     I                                       58  590CFSYMM
     I                                       60  610CFSYDD
     I                                       62  630CFSYBB
     I                                       64  670CFMKYY
     I                                       68  690CFMKMM
     I                                       70  710CFMKDD
     I                                       72  730CFMKBB
     I                                       74  770CFKAYY
     I                                       78  790CFKAMM
     I                                       80  810CFKADD
     I                                       82  830CFKABB
     I                                       84  87 CFZENO
     I                                       88  90 CFTHNO
     I                                       91  940CFBMON
     I                                       95  96 CFBLOK
     I                                       95  95 CFBLK
     I                                       97 1000CFMBMN
     I                                      101 101 CFTYPE
     I                                      102 105 CFMEK1
     I                                      106 107 CFMEK2
     I                                      108 108 CFMEK3
     I                                      109 1111CFBARL
     I                                      112 1141CFMKLT
     I                                      115 115 CFCOLR
     I                                      116 1170CFSIZE
     I                                      118 1200CFKUBI
     I                                      121 1250CFSYUY
     I                                      126 126 CFCHYU
     I                                      127 1280CFCIHI
     I                                      129 1300CFCIBI
     I                                      131 1320CFCIOK
     I                                      133 133 CFOFFL
     I                                      134 134 CFMNKB
     I                                      135 1370CFMHKO
     I                                      138 1400CFBHK1
     I                                      141 1440CFBYY1
     I                                      145 1460CFBMM1
     I                                      147 1480CFBDD1
     I                                      149 1500CFBBB1
     I                                      151 1530CFBHK2
     I                                      154 1570CFBYY2
     I                                      158 1590CFBMM2
     I                                      160 1610CFBDD2
     I                                      162 1630CFBBB2
     I                                      164 166 CFKBAN
     I                                      167 167 CFKBNC
     I                                      168 1710CFKHAK
     I                                      172 172 CFBAN1
     I                                      173 174 CFBAN2
     I                                      175 176 CFBAN3
     I                                      177 177 CFBAN4
     I                                      178 1810CFTOKU
     I                                      182 1850CFNOYY
     I                                      186 1870CFNOMM
     I                                      188 1890CFNODD
     I                                      190 1910CFNOBB
     I                                      192 192 CFHKAN
     I                                      193 193 CFMLIN
     I                                      194 195 CFJYKN
     I                                      196 1980CFZSEQ
     I                                      199 199 INJKB
     I                                      200 200 ITSKB
     I                                      201 201 ISKKB
     I                                      202 202 ISYOT
     I                                      203 203 IKCD2
     I                                      208 211 IKMBM
     I                                      212 212 CFLOC1
     I                                      213 214 CFLOC2
     I                                      215 216 CFLOC3
     I                                      217 217 CFLOC4
     I                                      218 220 CFPROC
     I                                      221 224 CFSUPP
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      *
     C                     MOVEL*BLANK    CFSKJY
     C                     Z-ADD*ZERO     CFSKYY
     C                     Z-ADD*ZERO     CFSKMM
     C                     Z-ADD*ZERO     CFSKDD
     C                     Z-ADDWSSYYY    CFKOYY
     C                     Z-ADDWSSMMM    CFKOMM
     C                     Z-ADDWSSDDD    CFKODD
     C                     Z-ADDWSSHHH    CFKOHH
     C                     Z-ADDWSSNNN    CFKOSS
     C                     MOVEL#USER     CFKOME
     C                     WRITEAH#PP901
     C*
     C           *INZSR    BEGSR
     C                     TIME           WSDT
     C                     ENDSR
