     H            Y.
     F** AFAR40 ******************************************************
     F*つるべ生産指示 SETTING OF JOB EXECUTION TIME
     F*  2020.07.21
     F****************************************************** AFAR40 **
     FAAIPL11 IF  E           K        DISK
     FAGAPL41 UF  E           K        DISK
     FAZZPPDF UF  E           K        DISK                      A
     FAFAPR10 O   E             21     PRINTER                        UC
     E                    CBHK       24  3 0             ﾌﾃﾇc  (N+1)
     E                    CBBI       24  2 0             ﾍﾞ]xb (N+1)
     E                    CBHN       24  3 0             ﾌﾃﾇc  (N+2)
     E                    CBBN       24  2 0             ﾍﾞ]xb (N+2)
     I            DS
     I                                        1   80CDZNHZ
     I                                        1   40CDZNYY
     I                                        5   60CDZNMM
     I                                        7   80CDZNDD
     I            DS
     I                                        1   80CDTOHZ
     I                                        1   40CDTOYY
     I                                        5   60CDTOMM
     I                                        7   80CDTODD
     I            DS
     I                                        1   80CDYOHZ
     I                                        1   40CDYOYY
     I                                        5   60CDYOMM
     I                                        7   80CDYODD
     I            DS
     I                                        1  72 CBHK
     I                                        1   30CBHK01
     I                                        4   60CBHK02
     I                                        7   90CBHK03
     I                                       10  120CBHK04
     I                                       13  150CBHK05
     I                                       16  180CBHK06
     I                                       19  210CBHK07
     I                                       22  240CBHK08
     I                                       25  270CBHK09
     I                                       28  300CBHK10
     I                                       31  330CBHK11
     I                                       34  360CBHK12
     I                                       37  390CBHK13
     I                                       40  420CBHK14
     I                                       43  450CBHK15
     I                                       46  480CBHK16
     I                                       49  510CBHK17
     I                                       52  540CBHK18
     I                                       55  570CBHK19
     I                                       58  600CBHK20
     I                                       61  630CBHK21
     I                                       64  660CBHK22
     I                                       67  690CBHK23
     I                                       70  720CBHK24
     I            DS
     I                                        1  48 CBBI
     I                                        1   20CBBI01
     I                                        3   40CBBI02
     I                                        5   60CBBI03
     I                                        7   80CBBI04
     I                                        9  100CBBI05
     I                                       11  120CBBI06
     I                                       13  140CBBI07
     I                                       15  160CBBI08
     I                                       17  180CBBI09
     I                                       19  200CBBI10
     I                                       21  220CBBI11
     I                                       23  240CBBI12
     I                                       25  260CBBI13
     I                                       27  280CBBI14
     I                                       29  300CBBI15
     I                                       31  320CBBI16
     I                                       33  340CBBI17
     I                                       35  360CBBI18
     I                                       37  380CBBI19
     I                                       39  400CBBI20
     I                                       41  420CBBI21
     I                                       43  440CBBI22
     I                                       45  460CBBI23
     I                                       47  480CBBI24
     I            DS
     I                                        1  72 CBHN
     I                                        1   30CBHN01
     I                                        4   60CBHN02
     I                                        7   90CBHN03
     I                                       10  120CBHN04
     I                                       13  150CBHN05
     I                                       16  180CBHN06
     I                                       19  210CBHN07
     I                                       22  240CBHN08
     I                                       25  270CBHN09
     I                                       28  300CBHN10
     I                                       31  330CBHN11
     I                                       34  360CBHN12
     I                                       37  390CBHN13
     I                                       40  420CBHN14
     I                                       43  450CBHN15
     I                                       46  480CBHN16
     I                                       49  510CBHN17
     I                                       52  540CBHN18
     I                                       55  570CBHN19
     I                                       58  600CBHN20
     I                                       61  630CBHN21
     I                                       64  660CBHN22
     I                                       67  690CBHN23
     I                                       70  720CBHN24
     I            DS
     I                                        1  48 CBBN
     I                                        1   20CBBN01
     I                                        3   40CBBN02
     I                                        5   60CBBN03
     I                                        7   80CBBN04
     I                                        9  100CBBN05
     I                                       11  120CBBN06
     I                                       13  140CBBN07
     I                                       15  160CBBN08
     I                                       17  180CBBN09
     I                                       19  200CBBN10
     I                                       21  220CBBN11
     I                                       23  240CBBN12
     I                                       25  260CBBN13
     I                                       27  280CBBN14
     I                                       29  300CBBN15
     I                                       31  320CBBN16
     I                                       33  340CBBN17
     I                                       35  360CBBN18
     I                                       37  380CBBN19
     I                                       39  400CBBN20
     I                                       41  420CBBN21
     I                                       43  440CBBN22
     I                                       45  460CBBN23
     I                                       47  480CBBN24
     I            DS
     I                                        1   80CDSTHZ
     I                                        1   40CDSTYY
     I                                        5   60CDSTMM
     I                                        7   80CDSTDD
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMEA
     I                                        3   40TIMEB
     I                                        5   60TIMEC
     C****************************************************************
     C*  START PROGRAM  <AFAR40>                                     *
     C****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           HHMM    4
     C*
     C           *LOVAL    SETLLAAIPL111
     C                     READ AAIPL111                 10
     C           *IN,10    IFEQ '1'
     C                     Z-ADD0         CDSTHZ
     C                     Z-ADD0         CDYOHZ
     C                     END
     C*
     C*  FILE LOCK  ?
     C*
     C                     MOVE *BLANK    ZZFILE
     C                     MOVEL'ADAPP11' ZZFILE
     C           ZZFILE    CHAINAZZPPDF1             10
     C           *IN,10    IFEQ '1'
     C                     MOVEL'AFAR40'  ZZPROG
     C                     Z-ADD0         ZZHORS
     C                     Z-ADD0         ZZMINS
     C                     Z-ADD0         ZZSECS
     C                     WRITEAZZPPDF1
     C           ZZFILE    CHAINAZZPPDF1             10
     C                     END
     C*
     C*  PARM fﾞ 2400 ﾉ ng
     C*      OR <ﾑhﾆﾞl *EQ zg] fbﾆﾍﾞ> ﾉ ngﾌ  PARM fﾞ 2000 ﾉ ng
     C*
     C                     MOVEA'1'       *IN,21
     C                     MOVE *BLANK    PSW     1
     C*
     C           CDSTHZ    IFNE CDYOHZ
     C           HHMM      ANDEQ'2400'
     C           CDSTHZ    OREQ CDYOHZ
     C           CDSTHZ    ANDEQ*DATE
     C           HHMM      ANDEQ'2000'
     C*
     C*  ﾍﾞ]xb & ﾌﾃﾇc ﾉ CHECK
     C*
     C           *LOVAL    SETLLAGAPL411
     C                     DO   *HIVAL
     C                     READ AGAPL411                 10
     C           *IN,10    IFEQ '0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    CABLE*DATE     STP01
     C                     END
     C                     MOVEA'0'       *IN,11
     C                     DO   24        I       20
     C           CBHK,I    IFNE 0
     C           CBBI,I    ANDEQ0
     C                     MOVEL'1'       *INU1
     C           PSW       IFEQ *BLANK
     C                     OPEN AFAPR10
     C                     MOVEA'1'       *IN,21
     C                     MOVEL'*'       PSW
     C                     END
     C           *IN,21    IFEQ '1'
     C                     WRITEHED
     C                     MOVEA'0'       *IN,21
     C                     END
     C                     WRITEDET
     C                     MOVEA'1'       *IN,11
     C                     END
     C  N11                END
     C                     END
     C           STP01     TAG
     C  N10                END
     C*
     C*
     C*  ﾑhﾆﾞl --> ncﾆﾞl
     C*
     C           *LOVAL    SETLLAGAPL411
     C                     DO   *HIVAL
     C                     READ AGAPL411                 10
     C           *IN,10    IFEQ '0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    CABLE*DATE     STP02
     C                     END
     C                     Z-ADDCBHN      CBHK
     C                     Z-ADDCBBN      CBBI
     C                     Z-ADD*ZERO     CBHN
     C                     Z-ADD*ZERO     CBBN
     C                     UPDATAGAPL411
     C                     END
     C           STP02     TAG
     C  N10                END
     C*
     C                     END
     C*
     C                     MOVEL'AFAR40'  ZZPROG
     C                     TIME           TIME
     C                     Z-ADDTIMEA     ZZHORS
     C                     Z-ADDTIMEB     ZZMINS
     C                     Z-ADDTIMEC     ZZSECS
     C                     UPDATAZZPPDF1
     C*
     C                     MOVEL'1'       *INLR
     C                     RETRN
