     H            Y.
     F** AFAR19 **********************************
     F* EXIT TIME OF NIGHT DUTY EXIT DATE JUDGE *
     F* PROGRAM ID. : AFAR19. <RPG> *
     F* CREATE DATE. : MAY.12,'87. *
     F* AUTHOR.              :                   *
     F********************************** AFAR19 **
     FAAIPL11 IF  E           K        DISK
     I            DS
     I                                        1   80CDENHZ
     I                                        1   40CDENYY
     I                                        5   60CDENMM
     I                                        7   80CDENDD
     C           *ENTRY    PLIST
     C                     PARM           F06     8
     C                     PARM           HOUR    2
     C                     PARM           FIN     1
     C                     MOVE F06       DAY     80
      *
     C                     SETOF                     10
     C                     MOVE *BLANK    FIN
     C                     READ AAIPL111                 10
     C           *IN10     IFEQ '1'
     C                     Z-ADD0         CDENHZ
     C                     END
      *
     C           DAY       IFEQ CDENHZ
     C           HOUR      ANDEQ'17'
     C                     MOVE '*'       FIN
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
