     H            Y.
     F** AFAR17 ******************************************************
     F* PROGRAM NAME. : RETRIEVE RECOR-COUNT OF AFAWP15 *
     F*                      : & SET AFAWP15 PLACE.                  *
     F* PROGRAM ID. : AFAR17. <RPG>                                  *
     F* CREATE DATE. : APR.06,'87.                                   *
     F* AUTHOR.              : MR.?.                                 *
     F* CLB32854 IAF APICS LOT#                                      *
     F* C.SAKTHIP     2025.03.01                                     *
     F****************************************************** AFAR17 **
     FAFAWP15 UF  F     250            DISK
     FFCEPL01 IF  E           K        DISK
     E                    HIZ         3  8 0             ﾆｬｮﾃﾍﾞ & ﾉcpｬcﾍﾞ
     IAFAWP15 AA  01
     I                                        1   1 CFSKJY
     I                                       28  32 CFHIN1
     I                                       33  37 CFHIN2
     I                                       38  39 CFHIN3
     I                                       40  40 CFKDAI
     I                                       41  430CFMAIS
     I                                       44  470CFHTYY
     I                                       48  490CFHTMM
     I                                       50  510CFHTDD
     I                                       52  530CFHTBB
     I                                       54  570CFSYYY
     I                                       58  590CFSYMM
     I                                       60  610CFSYDD
     I                                       62  630CFSYBB
     I                                       64  670CFMKYY
     I                                       68  690CFMKMM
     I                                       70  710CFMKDD
     I                                       72  730CFMKBB
     I                                       74  770CFKAYY
     I                                       78  790CFKAMM
     I                                       80  810CFKADD
     I                                       82  830CFKABB
     I                                       84  870CFZENO
     I*                                      88  900CFTHNO
     I                                       88  90 CFTHNO
     I                                       91  940CFBMON
     I                                       95  96 CFBLOK
     I                                       97 1000CFMBMN
     I                                      101 101 CFTYPE
     I                                      102 105 CFMEK1
     I                                      106 107 CFMEK2
     I                                      108 108 CFMEK3
     I                                      109 1111CFBARL
     I                                      112 1141CFMKLT
     I                                      115 115 CFCOLR
     I                                      116 1170CFSIZE
     I                                      118 1200CFKUBI
     I                                      121 1250CFSYUY
     I                                      126 126 CFHCYU
     I                                      127 1280CFCIHI
     I                                      129 1300CFCIBI
     I                                      131 1320CFCIOK
     I                                      133 133 CFOFFL
     I                                      134 134 CFMNKB
     I                                      135 1370CFMHKO
     I                                      138 1400CFBHK1
     I                                      141 1440CFBYY1
     I                                      145 1460CFBMM1
     I                                      147 1480CFBDD1
     I                                      149 1500CFBBB1
     I                                      151 1530CFBHK2
     I                                      154 1570CFBYY2
     I                                      158 1590CFBMM2
     I                                      160 1610CFBDD2
     I                                      162 1630CFBBB2
     I                                      164 166 CFKBAN
     I                                      167 167 CFKBNC
     I                                      168 1710CFBMN2
     I                                      172 172 CFBAN1
     I                                      173 174 CFBAN2
     I                                      175 176 CFBAN3
     I                                      177 177 CFBAN4
     I                                      178 1810CFTOKU
     I                                      182 1850CFNOYY
     I                                      186 1870CFNOMM
     I                                      188 1890CFNODD
     I                                      190 1910CFNOBB
     I                                      192 192 CFHKAN
     I                                      193 193 CFMLIN
     I                                      194 195 CFJYKN
     I                                      196 1980CFZSEQ
     I                                      199 199 INJKB
     I                                      200 200 ITSKB
     I                                      201 201 ISKKB
     I                                      202 202 ISYOT
     I                                      203 203 IKCD2
     I*
     I*つるべ　日当たり箱数                      AFAR42でセット
     I                                      225 2281$$HAKO
     I*  229-229   つるべ区分 ﾎﾞ[]h :Ａ－ＰＩＣＳ
     I*                           1   :つるべ    AFAR43でセット
     I                                      229 229 TURUBE
     I*  230-231   開始ページ
     I                                      230 231 ISPAGE
     I            DS
     I                                        1  240HIZ
     I                                        1   40CFSYYY
     I                                        5   60CFSYMM
     I                                        7   80CFSYDD
     I                                        9  120CFMKYY
     I                                       13  140CFMKMM
     I                                       15  160CFMKDD
     I                                       17  200CFKAYY
     I                                       21  220CFKAMM
     I                                       23  240CFKADD
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   6 A2KTKR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
     I            DS
     I                                        1   6 A2STKR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
     I*収容数切替日
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     C           KEY       KLIST
     C                     KFLD           CFHIN1
     C                     KFLD           CFHIN2
     C                     KFLD           CFHIN3
      *
     C           *ENTRY    PLIST
     C                     PARM           CNT     20
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ AFAWP15                  10
     C           *IN10     IFEQ '0'
      *
     C           *IN11     IFEQ '0'
     C                     SETON                     11
     C                     Z-ADD1         CNT
     C                     END
      *
     C                     SETOF                     12
     C                     MOVE *BLANK    WTKRO   6
     C           KEY       CHAINFCEPL011             12
     C           *IN12     IFEQ '0'
      *
     C                     Z-ADD1         A       20
     C                     Z-ADD0         WYMD    80
     C           1         DO   3         A
     C                     SETOF                     13
     C           4         SUB  A         B       20
     C           HIZ,B     IFNE 0
     C                     SETON                     13
     C                     Z-ADDHIZ,B     WYMD
     C                     END
     C  N13                END
      *
     C           WYMD      IFEQ 999999
     C           WYMD      OREQ 0
     C                     Z-ADD*DATE     WYMD
     C                     END
      *
     C           A2TRHZ    IFGT WYMD
     C                     MOVE A2KTKR    WTKRO
     C                     ELSE
     C                     MOVE A2STKR    WTKRO
     C                     END
     C                     END
      *
     C                     EXSR #HAKO
      *
     C           TURUBE    IFNE '1'
     C*   つるべ以外
     C                     EXCPTUP
     C                     ELSE
     C*   つるべ更新
     C                     MOVE ISPAGE    W1PAGE  20
     C                     Z-ADDW1PAGE    $$PAGE  30
     C                     EXCPTUPTURU
     C                     ENDIF
      *
     C                     END
     C  N10                END
      *
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      *
      *================================================================
     C           #HAKO     BEGSR
     C                     Z-ADD0         HAKO    41       日当数量
     C*収容数切替日
S1   C           A2SYHZ    IFLE *DATE
     C                     Z-ADDA2SSYS    W$SYSU  50       新収容数
X1   C                     ELSE
     C                     Z-ADDA2KSYS    W$SYSU           旧収容数
E1   C                     ENDIF
     C*日当箱数
S1   C           W$SYSU    IFNE 0
     C           A2GEKN    DIV  20        W$HIS   90       日当数量
     C           W$HIS     DIV  W$SYSU    HAKO      H      日当数量
E1   C                     ENDIF
     C*
     C                     ENDSR
      *================================================================
      *
     OAFAWP15 E                UP
     O                         WTKRO    209
     O*   日当数量
     O                         HAKO     228
     O*   開始ページ
     O                                  232 '001'
     OAFAWP15 E                UPTURU
     O                         $$PAGE   232
