     H            Y.
     F*- AFARZZ --------------------------------------------*
     F*  ..TOYOTA SCHEDULED DATA FILE REFORMATION..         *
     F*                                                     *
     F* CODING:K.OKACHI    2002.06.12                       *
     F*-----------------------------------------------------*
     FAU#PP11 UP  E                    DISK
JW1  FAU#PP11BO   E                    DISK
     F            AU#PP111                          KRENAMEAU#PP11X
      *
     I            DS
     I                                        1   80CQSKHZ
     I                                        1   40CQSKYY
     I                                        5   60CQSKMM
     I                                        7   80CQSKDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PYMD    8
     C                     PARM           PRECD   9
     C                     PARM           PKENS   9
     C                     MOVELPYMD      WYMD    80
      *
     C                     ADD  1         WRECD   90
      *
     C           CQSKJY    IFEQ 'D'
     C           CQSKHZ    ANDLTWYMD
     C                     WRITEAU#PP11X
     C                     DELETAU#PP111
     C                     ELSE
     C                     ADD  1         WKENS   90
     C                     ENDIF
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
