     H            Y.
     F** AFARAA ************************
     F* .. PRODUCTION INDICATION DATA MAKING || *.
     F* I-HASADA 93.03.16 *
     F************************ AFARAA **
     FAFAPWAA CF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK
     E                    ER      1   4 60               d[ｰxｮﾈｰﾆﾞ
     E                    TAB1    1   7  1 0 TAB2    4   ﾑcﾍﾞ
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80YMD
     I                                        1   40YY
     I                                        5   60MM
     I                                        7   80DD
     I            DS
     I                                        1   80@YMD
     I                                        1   40@YY
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   80#YMD
     I                                        1   40#YY
     I                                        5   60#MM
     I                                        7   80#DD
     I            DS
     I                                        1   60WTIME
     I                                        1   40WTHM
      *
     C           KEYA      KLIST
     C                     KFLD           #YY
     C                     KFLD           #MM
     C                     KFLD           #DD
      *
     C           *ENTRY    PLIST
     C                     PARM           @@YMD   8
     C                     Z-ADD0         YMD
     C                     Z-ADD*DATE     #YMD
     C                     TIME           WTIME
      *
     C                     SETOF                     10
     C                     MOVE '0'       WCHK    1
     C           KEYA      CHAINAGDPL121             10
     C           *IN10     IFEQ '0'
     C                     MOVE '2'       WCHK
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     MOVE '1'       WCHK
     C                     ELSE
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     MOVE *BLANK    WCHK
     C                     END
     C                     END
     C                     END
      *
     C           KEYA      SETLLAGDPL121
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ AGDPL121                 10
     C           *IN10     IFEQ '0'
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
      *
     C                     SETON                     10
     C                     Z-ADDF8KAHZ    YMD
      *
     C                     SETOF                     20
     C                     MOVE *BLANK    YOBI
     C           F8YOBI    LOKUPTAB1      TAB2           20
     C           *IN20     IFEQ '1'
     C                     MOVELTAB2      YOBI
     C                     END
      *
     C                     END
     C                     END
     C  N10                END
      *
     C                     Z-ADDYMD       @YMD
      *
     C           STP1      TAG
     C                     EXFMTAFAPWAA1
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*--------------------------*
     C*  ..カレンダー未登録..  *
     C*--------------------------*
     C           WCHK      IFEQ '0'
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C*--------------------*
     C*  ..実行不可能..  *
     C*--------------------*
     C           WCHK      IFEQ '1'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------*
     C*  ..実行１６時以降..  *
     C*------------------------*
     C           WCHK      IFEQ '2'
     C           WTHM      IFLT 1615
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C*------------------------*
     C*  ..日付　チェック..  *
     C*------------------------*
     C           @YMD      IFNE YMD
     C                     SETON                     0199
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C  NKE                GOTO STP1
      *
     C                     SETON                     U1
     C                     MOVELYMD       @@YMD
      *
     C                     SETON                     LR
     C                     RETRN
      *
**  ER
E-01 A DATE OF TODAY ISN'T INPUT A CALENDAR.
E-02 THIS SYSTEM CAN'T EXECUTE  TODAY.
E-03 THIS SYSTEM EXECUTE AFTER 16:15.
E-04 DATE IS NOT SAME AS OPERATION DATE.
** TAB1.TAB2
1 MON
2 TUE
3 WED
4 TUR
5 FRI
6 SAT
7 SUN
