     H            Y.
     F** AFARN2 **********************************
     F* IAF APICS LOT# CALCULATION PROGRAM       *
     F* APICS LOT#: 031-989,BBB-YYY              *
     F*              C.SAKTHIP   2025.03.14      *
     F******************************** AFARN0 ****
     FAFAPPNO UF  E           K        DISK                      A
     FAFAPPN1 IF  E           K        DISK
     FAFAPLN1 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@ZETI  4
     C                     PARM           P@LOTN  3
      *
     C                     MOVE P@ZETI    K@ZETI  4
      *
      *GET LAST LOT# FROM AFAPPNO
      *
S1---C           K@ZETI    CHAINAFAPPNO              77
|     *
|    C           *IN77     IFEQ '0'
|     *
|     *IF THERE IS LOT DATA IN AFAPPN1
|     *GET NEXT LOT DATA FROM AFAPPN1
|     *
|S2--C           WFLOTN    CHAINAFAPPN1              78
||   C           *IN78     IFEQ '0'
||   C                     EXSR #SB100
||   C                     ELSE
||   C                     MOVEL'031'     WFLOTN
|E2--C                     ENDIF
|     *
|     *RETURN LOT# TO 031 WHEN REACH YYY
|     *
|    C           *IN81     IFEQ '1'
|    C                     MOVEL'031'     WFLOTN
|    C                     END
|    C                     UPDATAFAPPNO1
|     *
|     *NEW PART NUMBER START WITH 031
|     *
|    C                     ELSE
|    C                     MOVE '031'     WFLOTN
|    C                     MOVE P@ZETI    WFZETI
|    C                     WRITEAFAPPNO1
E1---C                     END
      *
     C                     MOVE WFLOTN    P@LOTN
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *----------------------------------------------------*
      *GET NEXT LOT# DATA FROM AFAPPN1                     *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVELWNSORT    #KSORT  6
     C                     MOVELWNLOTN    #KLOTN  3
      *
     C           KEYAF     KLIST
     C                     KFLD           #KSORT
     C                     KFLD           #KLOTN
      *
     C           KEYAF     SETLLAFAPLN11
     C           KEYAF     READEAFAPLN11                 80
     C           *IN80     IFEQ '0'
     C                     READ AFAPLN11                 81
     C                     MOVELWNLOTN    WFLOTN
     C                     ELSE
     C                     MOVEL'031'     WFLOTN
     C                     ENDIF
      *
     CSR         ESB100    ENDSR
