     H            Y.
     F** AFAR51 **************************************
     F*  ..Ａ－ＰＩＣＳ生産指示データ　受信処理..  *
     F*  ..熊本工場                                *
     F*       I-HASADA              1992.05.02       *
     F************************************** AFAR51 **
     FAAIPL11 UF  E           K        DISK
     E                    CDBI       24  2 0             便
     E                    CDDT       24  1               データ準備
     E                    CDOK       24  1               転送完了
     I            DS
     I                                        1  480CDBI
     I                                        1   20CDBI08
     I                                        3   40CDBI09
     I                                        5   60CDBI10
     I                                        7   80CDBI11
     I                                        9  100CDBI12
     I                                       11  120CDBI13
     I                                       13  140CDBI14
     I                                       15  160CDBI15
     I                                       17  180CDBI16
     I                                       19  200CDBI17
     I                                       21  220CDBI18
     I                                       23  240CDBI19
     I                                       25  260CDBI20
     I                                       27  280CDBI21
     I                                       29  300CDBI22
     I                                       31  320CDBI23
     I                                       33  340CDBI24
     I                                       35  360CDBI01
     I                                       37  380CDBI02
     I                                       39  400CDBI03
     I                                       41  420CDBI04
     I                                       43  440CDBI05
     I                                       45  460CDBI06
     I                                       47  480CDBI07
     I            DS
     I                                        1  24 CDDT
     I                                        1   1 CDDT08
     I                                        2   2 CDDT09
     I                                        3   3 CDDT10
     I                                        4   4 CDDT11
     I                                        5   5 CDDT12
     I                                        6   6 CDDT13
     I                                        7   7 CDDT14
     I                                        8   8 CDDT15
     I                                        9   9 CDDT16
     I                                       10  10 CDDT17
     I                                       11  11 CDDT18
     I                                       12  12 CDDT19
     I                                       13  13 CDDT20
     I                                       14  14 CDDT21
     I                                       15  15 CDDT22
     I                                       16  16 CDDT23
     I                                       17  17 CDDT24
     I                                       18  18 CDDT01
     I                                       19  19 CDDT02
     I                                       20  20 CDDT03
     I                                       21  21 CDDT04
     I                                       22  22 CDDT05
     I                                       23  23 CDDT06
     I                                       24  24 CDDT07
     I            DS
     I                                        1  24 CDOK
     I                                        1   1 CDOK08
     I                                        2   2 CDOK09
     I                                        3   3 CDOK10
     I                                        4   4 CDOK11
     I                                        5   5 CDOK12
     I                                        6   6 CDOK13
     I                                        7   7 CDOK14
     I                                        8   8 CDOK15
     I                                        9   9 CDOK16
     I                                       10  10 CDOK17
     I                                       11  11 CDOK18
     I                                       12  12 CDOK19
     I                                       13  13 CDOK20
     I                                       14  14 CDOK21
     I                                       15  15 CDOK22
     I                                       16  16 CDOK23
     I                                       17  17 CDOK24
     I                                       18  18 CDOK01
     I                                       19  19 CDOK02
     I                                       20  20 CDOK03
     I                                       21  21 CDOK04
     I                                       22  22 CDOK05
     I                                       23  23 CDOK06
     I                                       24  24 CDOK07
     C           *ENTRY    PLIST
     C                     PARM           PBMN    4
     C                     PARM           PKBN    1
     C                     PARM           PDAT    6
     C                     PARM           PBIN    2
     C                     PARM           PSBN    1
     C                     PARM           PTSR    1
     C                     MOVE PBMN      WBMON   40
      *
     C*------------------------------*
     C*  ..時刻別計算便マスター..  *
     C*------------------------------*
     C                     SETOF                     10
     C           WBMON     CHAINAAIPL111             10
     C           *IN10     IFEQ '1'
     C                     SETON                     U1
     C                     ELSE
      *
     C           PKBN      IFEQ *BLANK
      *
     C                     MOVE CDTOHZ    PDAT
      *
     C*--------------------------*
     C*  ..当日処理終了か？..  *
     C*--------------------------*
     C                     MOVE *BLANK    PTSR
   #@C           CDTOHZ    IFGE *DATE
     C                     Z-ADD1         A       20
     C                     MOVE '*'       PTSR
     C           1         DO   24        A
     C                     SETOF                     10
     C           CDBI,A    IFNE 0
     C           CDDT,A    IFEQ '*'
     C           CDOK,A    ANDEQ'*'
     C                     ELSE
     C                     SETON                     10
     C                     MOVE *BLANK    PTSR
     C                     END
     C                     END
     C  N10                END
     C                     END
      *
     C*------------------*
     C*  ..便の決定..  *
     C*------------------*
     C                     Z-ADD1         A
     C                     Z-ADD0         WBIN    20
     C           1         DO   24        A
     C                     SETOF                     10
     C           CDBI,A    IFNE 0
     C           CDDT,A    IFEQ '*'
     C           CDDT,A    OREQ 'H'
     C           CDOK,A    IFEQ *BLANK
     C                     SETON                     10
     C                     MOVE CDBI,A    PBIN
     C                     Z-ADDCDBI,A    WBIN
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C*--------------------*
     C*  ..最終便か？..  *
     C*--------------------*
     C                     MOVE *BLANK    PSBN
     C           WBIN      IFEQ CDCIBI
     C                     MOVE '*'       PSBN
     C                     END
     C                     ELSE
      *
     C*------------------------*
     C*  ..転送完了マーク..  *
     C*------------------------*
     C                     SETOF                     10
     C                     Z-ADD1         A
     C                     MOVE PBIN      WBIN
     C           WBIN      LOKUPCDBI,A                   10
     C           *IN10     IFEQ '1'
     C           CDDT,A    IFEQ '*'
     C                     MOVE '*'       CDOK,A
     C                     END
     C                     END
      *
     C                     UPDATAAIPL111
      *
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
