     H            Y.
     F** AFAR93A ***************************************
     F*  PURCHASED ORDER ACCUMULATION DATA INQUIRY     *
     F*       MSK.KUNIUEDA         2000.12.11          *
     F*           KASHIWAGI        2000.12.19          *
     F* TCHK1 04/19/06 ADD CREATE DOWNLOAD FILE        *
     F* TCHK2 08/25/06 BUG FIX                         *
     F* TCHK3 08/26/06 ADD LOT# DETAIL SCREEN          *
     F* TCHK4 03/05/13 ADD NYLOCK(6666)                *
     F* TCHK5 05/14/13 ADD SHIP #OF CONT               *
     F* TCHK6 11/04/13 ADD BIN#                        *
     F* KIRI  14/10/02 ADD ORDER WAITING               *
JW1  F* JW  2024.12.18 ADD CSV DOWNLOADING (AFAWP93A)  *
     F**************************************************
     FAFAPW93ACF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL1
     F                                        RRN2  KSFILE SFL2
     F                                        RRN3  KSFILE SFL3
     F                                              KINFDS @INFDS
     FAFAPL83 IF  E           K        DISK
     FAFATL80 IF  E           K        DISK
     FAFAPL96 IF  E           K        DISK
     FAFAPL97 IF  E           K        DISK
     FAAFTL06 IF  E           K        DISK
     FAAHTL06 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
TCHK1FAFAWP93 UF  E           K        DISK                      A
JW1  FAFAWP93AO   E                    DISK
TCHK5FALDPL30 IF  E           K        DISK
      *
     E                    ERR     1  15 60
     E                    CMT1    1   6 50
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100#YEAR
     I                                       11  120#MONTH
     I                                       13  140#DAY
      *
     I            DS
     I                                        1   80HYMD8
     I                                        3   80HYMD6
     I                                        1   60HYM6
     I                                        1   40HYY
     I                                        5   60HMM
     I                                        7   80HDD
      *
     I            DS
     I                                        1   80WKYMD
     I                                        1   40WKHY
     I                                        5   60WKHM
     I                                        7   80WKHD
      *
     I            DS
     I                                        1   80@1HZ
     I                                        1   40@1YY
     I                                        5   60@1MM
     I                                        7   80@1DD
      *
     I            DS
     I                                        1   80@2HZ
     I                                        1   40@2YY
     I                                        5   60@2MM
     I                                        7   80@2DD
      *
     I            DS
     I                                        1  15 @CMTH2
     I                                        1   5 @HIN1
     I                                        6   6 WKH1
     I                                        7  11 @HIN2
     I                                       12  12 WKH2
     I                                       13  14 @HIN3
     I                                       15  15 WKH3
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1   80A9SKHZ
     I                                        1   40A9SKYY
     I                                        5   60A9SKMM
     I                                        7   80A9SKDD
      *
     I            DS
     I                                        1   80A8SKHZ
     I                                        1   40A8SKYY
     I                                        5   60A8SKMM
     I                                        7   80A8SKDD
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 @9HIN1
     I                                        6   6 WKH4
     I                                        7  11 @9HIN2
     I                                       12  12 WKH5
     I                                       13  14 @9HIN3
      *
     I            DS
     I                                        1   9 WKATKR
     I                                        1   1 WKATK1
     I                                        2   2 WKF1
     I                                        3   4 WKATK2
     I                                        5   5 WKF2
     I                                        6   7 WKATK3
     I                                        8   8 WKF3
     I                                        9   9 WKATK4
      *
     I            DS
     I                                        1  20 @SUPNM
     I                                        1   4 WKSUPC
     I                                        5   5 WKF4
     I                                        6  20 WKSUPN
      *
     I            DS
     I                                        1   80A9ODHZ
     I                                        1   40A9ODYY
     I                                        5   60A9ODMM
     I                                        7   80A9ODDD
      *
     I            DS
     I                                        1   80@SDATE
     I                                        1   40@SYY
     I                                        5   60@SMM
     I                                        7   80@SDD
      *
     I            DS
     I                                        1   80@EDATE
     I                                        1   40@EYY
     I                                        5   60@EMM
     I                                        7   80@EDD
      * CTL-KEY
     I            DS
     I                                        1  38 CTLFLD
     I                                        1   5 CHIN1
     I                                        6  10 CHIN2
     I                                       11  12 CHIN3
     I                                       13  180CORDNO
     I                                       19  260CODHZ
     I                                       19  220CODYY
     I                                       23  240CODMM
     I                                       25  260CODDD
     I                                       27  30 CSUPP
     I                                       31  380CNOHZ
     I                                       31  340CNOYY
     I                                       35  360CNOMM
     I                                       37  380CNODD
      * CHK-KEY
     I            DS
     I                                        1  38 CHKFLD
     I                                        1   5 WHIN1
     I                                        6  10 WHIN2
     I                                       11  12 WHIN3
     I                                       13  180WORDNO
     I                                       19  260WODHZ
     I                                       19  220WODYY
     I                                       23  240WODMM
     I                                       25  260WODDD
     I                                       27  30 WSUPP
     I                                       31  380WNOHZ
     I                                       31  340WNOYY
     I                                       35  360WNOMM
     I                                       37  380WNODD
      * CTL-KEY2
     I            DS
     I                                        1  30 CTLFL2
     I                                        1   5 XHIN1
     I                                        6  10 XHIN2
     I                                       11  12 XHIN3
     I                                       13  180XORDNO
     I                                       19  22 XSUPP
     I                                       23  300XNOHZ
     I                                       23  260XNOYY
     I                                       27  280XNOMM
     I                                       29  300XNODD
      * CHK-KEY
     I            DS
     I                                        1  30 CHKFL2
     I                                        1   5 YHIN1
     I                                        6  10 YHIN2
     I                                       11  12 YHIN3
     I                                       13  180YORDNO
     I                                       19  22 YSUPP
     I                                       23  300YNOHZ
     I                                       23  260YNOYY
     I                                       27  280YNOMM
     I                                       29  300YNODD
     I            DS
     I                                        1   80#KODHZ
     I                                        1   40#KODYY
     I                                        5   60#KODMM
     I                                        7   80#KODDD
      *
     I            DS
     I                                        1   80S3NODT
     I                                        1   40S3NOYY
     I                                        5   60S3NOMM
     I                                        7   80S3NODD
      *
     I            DS
     I                                        1   80A3SYDT
     I                                        1   40A3SYYY
     I                                        5   60A3SYMM
     I                                        7   80A3SYDD
      *
JW1  I            DS
     I                                        1  12 W3SHIN
     I                                        1   5 W3SHN1
     I                                        6  10 W3SHN2
     I                                       11  12 W3SHN3
      *
JW1  I            DS
     I                                        1   80W3ORHZ
     I                                        1   40W3ORYY
     I                                        5   60W3ORMM
     I                                        7   80W3ORDD
      *
JW1  I            DS
     I                                        1   80W3ETHZ
     I                                        1   40W3ETYY
     I                                        5   60W3ETMM
     I                                        7   80W3ETDD
      *
JW1  I            DS
     I                                        1   80W3RVHZ
     I                                        1   40W3RVYY
     I                                        5   60W3RVMM
     I                                        7   80W3RVDD
      *
      *
      *----------------------------------------------------*
      *  MAIN ROUTINE                                    *
      *----------------------------------------------------*
     C                     EXSR #INIT
      *
     C           *INKA     DOWEQ'0'
      *
      * 1ST SCREEN HEADER
     C           *INKA     DOWEQ*OFF
     C           DSPSW     ANDEQ'1'
     C                     EXSR #DSP01
     C                     ENDDO
      * INQ BY PART#
     C           *INKA     DOWEQ*OFF
     C           DSPSW     ANDEQ'2'
     C                     EXSR #DSP02
     C                     ENDDO
      * INQ BY SUPPLIER
     C           *INKA     DOWEQ*OFF
     C           DSPSW     ANDEQ'3'
     C                     EXSR #DSP03
     C                     ENDDO
      * F5: CSV
JW1  C           *INKE     IFEQ *ON
     C           *INKA     DOWEQ'0'
     C           DSPSW     ANDEQ'6'
     C                     EXSR #DSP04
     C                     ENDDO
     C                     ENDIF
      *
     C           *INKA     DOWEQ*OFF
     C           DSPSW     ANDEQ'4'
     C                     MOVEL*BLANKS   @BANGO
     C                     EXSR #SFL1
     C                     ENDDO
      *
     C           *INKA     DOWEQ*OFF
     C           DSPSW     ANDEQ'5'
     C                     EXSR #SFL2
     C                     ENDDO
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      *   1ST. SCERRN    (DSP01   )  HEADER              *
      *----------------------------------------------------*
     C           #DSP01    BEGSR
      *
     C           PMODE     IFEQ 'A'
     C                     SETON                     77
     C                     MOVE PMODE     @TYPE
     C                     GOTO @JUMP1
     C                     END
     C                     EXFMTDSP01
      *
     C           @JUMP1    TAG
     C                     SETOF                     3199
     C                     MOVEL*BLANK    @ERR
      * F1: END
     C           *INKA     IFEQ '1'
     C                     GOTO XDSP01
     C                     END
      * F5: CSV
     C           *INKE     IFEQ *ON
     C                     MOVE '6'       DSPSW
     C                     GOTO XDSP01
     C                     END
      * CHECK TYPE
     C           @TYPE     IFNE 'A'
     C           @TYPE     ANDNE'B'
     C                     MOVELERR,1     @ERR
     C                     SETON                     9931
     C                     GOTO XDSP01
     C                     END
      *
     C           @TYPE     IFEQ 'A'
     C                     MOVE '2'       DSPSW
     C                     ELSE
     C                     MOVE '3'       DSPSW
     C                     END
      *
     C                     SETOF                     323334
     C                     MOVE *BLANK    @HIN1
     C                     MOVE *BLANK    @HIN2
     C                     MOVE *BLANK    @HIN3
     C                     MOVE *BLANK    @SUPP
     C                     Z-ADDTODAY     @1HZ
     C                     Z-ADDTODAY     @2HZ
      *
     C           XDSP01    ENDSR
      *----------------------------------------------------*
      *    2ND. SCERRN     (DSP02   )                      *
      *----------------------------------------------------*
     C           #DSP02    BEGSR
     C           PHIN1     IFNE *BLANK
     C                     MOVE PHIN1     @HIN1
     C                     MOVE PHIN2     @HIN2
     C                     MOVE PHIN3     @HIN3
     C                     END
     C           PSDAT     IFNE *BLANK
     C                     MOVE PSDAT     @1HZ
     C                     END
     C   77                GOTO @JUMP2
      *
     C                     EXFMTDSP02
      *
     C           @JUMP2    TAG
     C                     SETOF                     323399
     C                     MOVEL*BLANK    @ERR
      * F1: EXIT
     C           *INKA     IFEQ '1'
     C   77                EXSR #END
     C                     GOTO XDSP02
     C                     END
      * F3: BACK
JW1  C           *INKC     IFEQ '1'
     C   77                EXSR #END
     C                     MOVE '1'       DSPSW
     C                     MOVE *BLANK    @TYPE
     C                     MOVE '1'       SHFLG
     C                     MOVE '1'       WRITFG
     C                     SETOF                     02
     C                     EXSR #CLRSF
     C                     GOTO XDSP02
     C                     END
      *
     C           @HIN1     IFEQ *BLANK
     C           @HIN2     ANDEQ*BLANK
     C           @HIN3     ANDEQ*BLANK
     C                     SETON                     3299
     C                     MOVELERR,2     @ERR
     C                     GOTO XDSP02
     C                     END
     C                     SETOF                     21
     C                     MOVE @HIN1     #KHIN1
     C                     MOVE @HIN2     #KHIN2
     C                     MOVE @HIN3     #KHIN3
      *
     C           @1HZ      IFNE 0
     C                     MOVE @1YY      #KHY
     C                     MOVE @1MM      #KHM
     C                     MOVE @1DD      #KHD
     C                     SETOF                       21
     C           KEYF81    CHAINAGDPL121             21
     C           *IN21     IFEQ '1'
     C                     SETON                     3399
     C                     MOVELERR,4     @ERR
     C                     GOTO XDSP02
     C                     END
     C                     END
      *
     C           @2HZ      IFNE 0
     C                     MOVE @2YY      #KHY
     C                     MOVE @2MM      #KHM
     C                     MOVE @2DD      #KHD
     C                     SETOF                       21
     C           KEYF81    CHAINAGDPL121             21
     C           *IN21     IFEQ '1'
     C                     SETON                     3499
     C                     MOVELERR,5     @ERR
     C                     GOTO XDSP02
     C                     END
     C                     END
      *
     C           @2HZ      IFNE 0
     C           @1HZ      ANDNE0
     C           @2HZ      IFLT @1HZ
     C                     SETON                     333499
     C                     MOVELERR,6     @ERR
     C                     GOTO XDSP02
     C                     END
     C                     END
      *
     C           @1HZ      IFEQ 0
     C                     Z-ADD0         @SDATE
     C                     ELSE
     C                     Z-ADD@1HZ      @SDATE
     C                     END
      *
     C           @2HZ      IFEQ 0
     C                     MOVE *ALL'9'   @EDATE
     C                     ELSE
     C                     Z-ADD@2HZ      @EDATE
     C                     END
      *
     C                     SETON                     10
     C                     SETOF                     816619
     C                     MOVE @HIN1     #KPAR1
     C                     MOVE @HIN2     #KPAR2
     C                     MOVE @HIN3     #KPAR3
     C           KEYA91    SETLLAFAPL961
     C                     Z-ADD0         CTRX1
     C                     MOVE ' '       WRITFG
      *
     C                     DO   *HIVAL
     C                     EXSR #SETS1
     C  N81N66             ENDDO
      *
     C           CTRX1     IFEQ 0
     C   77                EXSR #END
     C                     SETON                     323334
     C                     SETON                     99
     C                     MOVELERR,6     @ERR
     C                     MOVE '1'       SHFLG
     C                     EXSR #CLRSF
     C                     GOTO XDSP02
     C                     END
      *
     C                     EXSR #POS
      *
     C                     MOVELCMT1,1    @CMTH1
     C                     MOVE '-'       WKH1
     C                     MOVE '-'       WKH2
     C                     MOVEL*BLANK    WKH3
     C           @HIN3     IFEQ *BLANK
     C                     MOVEL*BLANK    WKH2
     C                     END
     C                     MOVELCMT1,3    @CMTH3
      *
     C                     CALL 'AFARS3'
     C                     PARM           @HIN1   5
     C                     PARM           @HIN2   5
     C                     PARM           @HIN3   2
     C                     PARM           P@BOX   40
     C                     Z-ADDP@BOX     @WAIT
      *
     C                     MOVE '4'       DSPSW
     C                     SETOF                     31
     C           XDSP02    ENDSR
      *----------------------------------------------------*
      *    3RD. SCREEN     (DSP03   ) - BY SUPPLIER        *
      *----------------------------------------------------*
     C           #DSP03    BEGSR
     C                     EXFMTDSP03
     C                     SETOF                     323399
     C                     MOVEL*BLANK    @ERR
      * F1: EXIT
     C           *INKA     IFEQ '1'
     C                     GOTO XDSP03
     C                     END
      * F3: BACK
JW1  C           *INKC     IFEQ '1'
     C                     MOVE '1'       DSPSW
     C                     MOVE *BLANK    @TYPE
     C                     MOVE '1'       SHFLG
     C                     SETOF                     02
     C                     EXSR #CLRSF
     C                     GOTO XDSP03
     C                     END
      *
     C           @SUPP     IFEQ *BLANK
     C                     SETON                     3299
     C                     MOVELERR,8     @ERR
     C                     GOTO XDSP03
     C                     END
      *
     C                     MOVE *BLANK    WKSMEI 15
     C                     MOVE @SUPP     #CODE   40
     C                     SETOF                       21
     C           #CODE     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                       21
     C                     END
     C           *IN21     IFEQ '1'
     C                     MOVELERR,8     @ERR
     C                     SETON                     3299
     C                     GOTO XDSP03
     C                     END
     C                     MOVELB2SMEI    WKSMEI
      *
     C           @1HZ      IFNE 0
     C                     MOVE @1YY      #KHY
     C                     MOVE @1MM      #KHM
     C                     MOVE @1DD      #KHD
     C                     SETOF                       21
     C           KEYF81    CHAINAGDPL121             21
     C           *IN21     IFEQ '1'
     C                     SETON                     3399
     C                     MOVELERR,4     @ERR
     C                     GOTO XDSP03
     C                     END
     C                     END
      *
     C           @2HZ      IFNE 0
     C                     MOVE @2YY      #KHY
     C                     MOVE @2MM      #KHM
     C                     MOVE @2DD      #KHD
     C                     SETOF                       21
     C           KEYF81    CHAINAGDPL121             21
     C           *IN21     IFEQ '1'
     C                     SETON                     3499
     C                     MOVELERR,5     @ERR
     C                     GOTO XDSP03
     C                     END
     C                     END
      *
     C           @2HZ      IFNE 0
     C           @1HZ      ANDNE0
     C           @2HZ      IFLT @1HZ
     C                     SETON                     333499
     C                     MOVELERR,6     @ERR
     C                     GOTO XDSP03
     C                     END
     C                     END
      *
     C           @1HZ      IFEQ 0
     C                     Z-ADD0         @SDATE
     C                     ELSE
     C                     Z-ADD@1HZ      @SDATE
     C                     END
      *
     C           @2HZ      IFEQ 0
     C                     MOVE *ALL'9'   @EDATE
     C                     ELSE
     C                     Z-ADD@2HZ      @EDATE
     C                     END
      *
     C                     MOVE @SUPP     #KSUPP  4
     C                     SETOF                     816619
     C           KEYA92    SETLLAFAPL971
     C                     Z-ADD0         CTRX1
     C                     MOVE ' '       WRITFG
      *
     C                     SETOF                     10
     C                     DO   *HIVAL
     C                     EXSR #SETX1
     C  N81N66             END
     C           CTRX1     IFEQ 0
     C                     SETON                     323334
     C                     SETON                     99
     C                     MOVELERR,6     @ERR
     C                     MOVE '1'       SHFLG
     C                     EXSR #CLRSF
     C                     GOTO XDSP03
     C                     END
      *
     C                     EXSR #POS
      *
     C                     MOVELCMT1,2    @CMTH1
     C                     MOVEL*BLANK    @CMTH2
     C                     MOVELWKSMEI    @CMTH2
     C                     MOVELCMT1,4    @CMTH3
      *
     C                     MOVE '4'       DSPSW
     C                     SETOF                     31
     C           XDSP03    ENDSR
      *----------------------------------------------------*
      *    4TH. SCREEN     (DSP04   ) - DOWNLOAD TO CSV    *
      *----------------------------------------------------*
     C           #DSP04    BEGSR
      * DEFAULT
     C           @FDATE    IFEQ 0
     C                     Z-ADDTODAY     @FDATE
     C                     ENDIF
     C           @TDATE    IFEQ 0
     C                     Z-ADD@FDATE    @TDATE
     C                     ENDIF
      *
     C           @DSP04    TAG
     C                     EXFMTDSP04
     C                     SETOF                     626399
     C                     MOVEL*BLANK    @ERR
      * F1: EXIT
     C           *INKA     IFEQ *ON
     C                     GOTO XDSP04
     C                     END
      * F3: BACK
JW1  C           *INKC     IFEQ *ON
     C                     MOVE '1'       DSPSW
     C                     MOVE *BLANK    @TYPE
     C                     MOVE '1'       SHFLG
     C                     SETOF                     02
     C                     EXSR #CLRSF
     C                     GOTO XDSP04
     C                     END
      * CHECK @FDATE
     C                     MOVEL@FDATE    $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $RTN    1
     C           $RTN      IFNE ' '
     C                     SETOF                     62  99
     C                     MOVELERR,4     @ERR
     C                     GOTO @DSP04
     C                     ENDIF
     C                     MOVEL$TRUE1    @FDATE
      *
     C           @TDATE    IFEQ 0
     C                     Z-ADD@FDATE    @TDATE
     C                     ENDIF
      * CHECK @TDATE
     C                     MOVEL@TDATE    $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE1  8
     C                     PARM           $RTN    1
     C           $RTN      IFNE ' '
     C                     SETOF                     63  99
     C                     MOVELERR,5     @ERR
     C                     GOTO @DSP04
     C                     ENDIF
     C                     MOVEL$TRUE1    @TDATE
      *
     C           @FDATE    IFGT @TDATE
     C                     SETOF                     62  99
     C                     MOVELERR,9     @ERR
     C                     GOTO @DSP04
     C                     ENDIF
      * IF NO ERROR..
     C           *INKE     IFEQ *OFF
     C                     MOVELERR,11    @ERR
     C                     GOTO @DSP04
     C                     ENDIF
      *
     C                     EXSR #DWNL
      *
     C           CVCNT2    IFEQ 0
     C                     SETOF                     62  99
     C                     MOVELERR,6     @ERR
     C                     GOTO @DSP04
     C                     ENDIF
      *
     C                     EXSR #END
      *
     C           XDSP04    ENDSR
      *----------------------------------------------------*
      *   DISPLAY SFL1   (SFL SFLREC)                    *
      *----------------------------------------------------*
     C           #SFL1     BEGSR
     C                     SETON                     70
     C                     WRITE#CMD1
     C                     WRITECTL1
     C                     EXFMT#SLCT
     C                     SETOF                     7031
     C                     SETOF                     99
     C                     MOVE *BLANK    @ERR
      * F1: EXIT
     C           *INKA     IFEQ *ON
     C                     GOTO XSFL1
     C                     END
      * F3: BACK
JW1  C           *INKC     IFEQ *ON
     C   77                EXSR #END
     C                     SETOF                     323334
     C           @TYPE     IFEQ 'A'
     C                     MOVE '2'       DSPSW
     C                     ELSE
     C                     MOVE '3'       DSPSW
     C                     ENDIF
      *
     C**                   MOVE '4'       DSPSW
     C                     SETOF                     02
     C                     MOVE '1'       SHFLG
     C                     Z-ADD0         @NO1
      *
     C**                   MOVE *BLANK    @HIN1
     C**                   MOVE *BLANK    @HIN2
     C**                   MOVE *BLANK    @HIN3
     C**                   MOVE *BLANK    @SUPP
     C**                   Z-ADD0         @1YY
     C**                   Z-ADD0         @1MM
     C**                   Z-ADD0         @1DD
     C**                   Z-ADD0         @2YY
     C**                   Z-ADD0         @2MM
     C**                   Z-ADD0         @2DD
     C                     EXSR #CLRSF
     C                     GOTO XSFL1
     C                     ENDIF
      *--------------------*
      * ROLLDOWN           *
      *--------------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX1
      *
     C           WKPAG1    IFLE 1
     C                     GOTO XSFL1
     C                     END
      *
     C           *IN81     IFEQ '1'
     C                     SETOF                       81
     C           @TYPE     IFEQ 'A'
     C           KEYA91    SETGTAFAPL961
     C                     END
     C           @TYPE     IFEQ 'B'
     C           KEYA92    SETGTAFAPL971
     C                     END
     C                     END
      *
     C                     ADD  13        CTRX1
     C                     SETOF                     27
     C                     MOVE ' '       WRITFG
      *
     C           @TYPE     IFEQ 'A'
     C                     DO   *HIVAL
     C                     EXSR #SETPS
     C  N81N27             END
     C                     END
      *
     C           @TYPE     IFEQ 'B'
     C                     DO   *HIVAL
     C                     EXSR #SETP2
     C  N81N27             END
     C                     END
      * CLEAR COUNTER
     C                     Z-ADD0         CTRX1   40
     C                     MOVE ' '       WRITFG
      *
     C           *IN81     IFEQ '1'
     C                     SETOF                       81
     C           @TYPE     IFEQ 'A'
     C           KEYA91    SETLLAFAPL961
     C                     END
     C           @TYPE     IFEQ 'B'
     C           KEYA92    SETLLAFAPL971
     C                     END
     C                     END
      * CLEAR SFL1 OR SFL2
     C                     MOVE '1'       SHFLG
     C                     EXSR #CLRSF
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
      *
     C                     SETOF                       6619
     C           @TYPE     IFEQ 'A'
     C                     DO   *HIVAL
     C                     EXSR #SETS1
     C  N81N66             END
     C                     END
      *
     C           @TYPE     IFEQ 'B'
     C                     DO   *HIVAL
     C                     EXSR #SETX1
     C  N81N66             END
     C                     END
      *
     C                     EXSR #POS
     C                     SUB  1         WKPAG1
     C                     END
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     MOVE '1'       SHFLG
     C                     MOVE ' '       WRITFG
     C                     EXSR #CLRSF
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
      *
     C                     SETOF                       1966
     C           @TYPE     IFEQ 'A'
     C                     DO   *HIVAL
     C                     EXSR #SETS1
     C  N81N66             END
     C                     END
      *
     C           @TYPE     IFEQ 'B'
     C                     DO   *HIVAL
     C                     EXSR #SETX1
     C  N81N66             END
     C                     END
      *
     C           CTRX1     CABEQ0         XSFL1
     C                     EXSR #POS
     C                     ADD  1         WKPAG1
     C                     END
      *--------------------*
      * DETAILS NO INPUT   *
      *--------------------*
     C*KK
     C           *IN51     IFEQ '0'
     C           *IN52     ANDEQ'0'
     C*KK
     C           @BANGO    IFNE *ZERO
     C                     SETOF                       6823
     C                     Z-ADD0         X       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C                     SETOF                     2928
     C           X         CHAINSFL1                 29
     C           *IN23     IFEQ '0'
     C           @BANGO    IFEQ @NO1
     C                     SETON                     28
     C                     END
     C                     END
     C  N29N28             END
     C           *IN28     IFEQ '0'
     C           *IN29     ANDEQ'1'
     C                     SETON                     9931
     C                     MOVELERR,10    @ERR
     C                     GOTO XSFL1
     C                     END
      *KEY FILD SETTING
     C                     MOVE '-'       WKH4
     C                     MOVE '-'       WKH5
     C           @9HIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKH5
     C                     END
      *
     C                     SETOF                     21
     C*          @TYPE     IFEQ 'B'
     C                     MOVE @9HIN1    #KHIN1
     C                     MOVE @9HIN2    #KHIN2
     C                     MOVE @9HIN3    #KHIN3
     C           KEYHBN    CHAINFCEPL011             21
      *
     C           *IN21     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                       21
     C                     END
      *
     C                     Z-ADD0         @SYS
     C           *IN21     IFEQ '0'
     C                     Z-ADDA2KSYS    @SYS
     C           HYMD8     IFGE A2SYHZ
     C                     Z-ADDA2SSYS    @SYS
     C                     END
     C                     END
     C                     MOVE @9HIN1    #KPAR1
     C                     MOVE @9HIN2    #KPAR2
     C                     MOVE @9HIN3    #KPAR3
     C                     Z-ADD@9ODNO    #KODNO
     C                     Z-ADD@9ODHZ    #KODHZ
     C*
     C                     Z-ADD*ZERO     W@HAKO  40
     C           KEYA96    SETLLAFAPL96
     C                     DO   *HIVAL
     C           KEYA96    READEAFAPL961                 25
     C   25                LEAVE
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     ITER
     C                     END
     C                     ADD  A9HAKO    W@HAKO
     C           @SYS      IFEQ *ZERO
     C                     Z-ADDA9SYOS    @SYS
     C                     END
     C                     ENDDO
     C                     Z-ADD*ZERO     W@SHIP  60
     C                     Z-ADD#KODNO    K@ORD#
     C                     MOVEL#KPAR1    K@HIN1
     C                     MOVEL#KPAR2    K@HIN2
     C                     MOVEL#KPAR3    K@HIN3
     C                     EXSR #SUMS1
     C                     Z-ADDW@SHIP    @SHIP
     C*
     C                     MOVE @9ODNO    @ODERN
     C                     MOVE @9ZETI    @WZETI
     C                     MOVE @9ODHZ    @HTOHZ
     C                     MOVE @9NYHZ    @NOHZ
     C                     Z-ADDW@HAKO    @HAKO
     C                     Z-ADDW@HAKO    @MINO
     C           @HAKO     MULT @SYS      @NSRYO
     C                     MOVE @9HIN1    #KHIN1
     C                     MOVE @9HIN2    #KHIN2
     C                     MOVE @9HIN3    #KHIN3
     C                     MOVE @9NOHZ    @8NOHZ
     C                     MOVE *BLANK    @SUPNM
     C                     MOVE @9SUPP    #CODE   40
     C                     SETOF                       21
     C           #CODE     CHAINFGBPL011             21
     C           *IN21     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                       21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVE '-'       WKF4
     C                     MOVE @9SUPP    WKSUPC
     C                     MOVELB2SMEI    WKSUPN
     C                     END
      *           DB
     C                     EXSR #LEVEL
      *
     C                     MOVE '2'       SHFLG
     C                     EXSR #CLRSF
      *--------------------*
      * KEY SET            *
      *--------------------*
      *
     C                     MOVE @9SUPP    #8SUPP
     C                     MOVE @9HIN1    #8PAR1
     C                     MOVE @9HIN2    #8PAR2
     C                     MOVE @9HIN3    #8PAR3
     C                     MOVE @9ODNO    #8ODNO
      *
     C                     SETOF                     826918
     C                     SETOF                     41
     C           KEYA81    SETLLAFAPL831
     C                     Z-ADD0         CTRX2
     C                     MOVE ' '       WRITFG
      *
     C                     DO   *HIVAL
     C                     EXSR #SETS2
     C  N82N69             END
      *
     C           CTRX2     IFEQ 0
     C                     Z-ADD0         @NO2
     C                     Z-ADD0         @8NOHZ
     C                     Z-ADD0         @MAIS
     C                     Z-ADD0         @MINO
     C                     Z-ADD1         @RRN2
     C                     Z-ADD1         RRN2
     C                     ADD  1         CTRX2
     C                     SETON                     41
     C                     WRITESFL2
     C                     ELSE
     C                     EXSR #POS2
     C                     END
      *
     C                     MOVE '5'       DSPSW
     C                     END
     C*KK
     C                     ENDIF
      *
     C           XSFL1     ENDSR
      *----------------------------------------------------*
      *     4TH. SCRREN PROCESS  (SFL2)                  *
      *----------------------------------------------------*
     C           #SFL2     BEGSR
     C                     SETON                     72
TCHK3C                     WRITE#CMD3
     C                     WRITE#ERR1
     C                     EXFMTCTL2
     C                     SETOF                     72
      * F1: EXIT
     C           *INKA     IFEQ '1'
     C                     GOTO XSFL2
     C                     END
      * F3: BACK
     C           *INKC     IFEQ '1'
     C                     SETOF                     03
     C                     MOVE '4'       DSPSW
     C                     MOVE '0'       DSPFLG
     C                     MOVE '2'       SHFLG
     C                     Z-ADD@NBR      @NO1
     C                     Z-ADD0         WKMAIS
     C                     EXSR #CLRSF
     C                     SETOF                     02
     C                     Z-ADD0         @BANGO
     C                     Z-ADD0         @NO2
     C                     GOTO XSFL2
     C                     END
      *--------------------*
      * ROLLDOWN           *
      *--------------------*
     C           *IN54     IFEQ '1'
     C*                    ADD  1         CTRX2
      *
     C           WKPAG2    IFLE 1
     C                     GOTO XSFL2
     C                     END
      *
     C           *IN82     IFEQ '1'
     C                     SETOF                       82
     C           KEYA81    SETGTAFAPL831
     C                     END
      *
     C                     ADD  4         CTRX2
     C                     Z-ADD0         CTRKEN
     C                     SETOF                     2918
      *
     C                     DO   *HIVAL
     C                     EXSR #SETX2
     C  N82N29             END
      *
      * CLEAR COUNTER
     C                     Z-ADD0         CTRX2   40
      *
     C           *IN82     IFEQ '1'
     C                     SETOF                       82
     C           KEYA81    SETLLAFAPL831
     C                     Z-ADD0         @NO2
     C                     MOVE @9HAKO    @MINO
     C                     END
      * SFL-CLEAR
     C                     MOVE '2'       SHFLG
     C                     EXSR #CLRSF
     C                     Z-ADD0         WKMAIS
      *
     C                     MOVE '1'       WRITFG
     C                     SETOF                       6918
     C                     DO   *HIVAL
     C                     EXSR #SETS2
     C  N82N69             END
      *
      *
     C                     EXSR #POS2
     C                     SUB  1         WKPAG2
     C                     END
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN53     IFEQ '1'
     C           *IN82     ANDEQ'0'
      *
     C                     MOVE ' '       WRITFG
     C                     MOVE '2'       SHFLG
     C                     EXSR #CLRSF
      *
     C                     SETOF                       6918
     C                     Z-ADD0         CTRX2
     C                     Z-ADD0         WKMAIS
     C                     MOVE ' '       WRITFG
     C                     DO   *HIVAL
     C                     EXSR #SETS2
     C  N82N69             END
      *
      *
     C                     EXSR #POS2
     C                     ADD  1         WKPAG2
     C                     END
      *
     C*
     C                     EXSR #SFL3
     C           *INKA     IFEQ *ON
     C                     GOTO XSFL2
     C                     END
     C*
     C                     MOVE '5'       DSPSW
      *
     C           XSFL2     ENDSR
     C*----------------------------------------------------*
     C*        LOT# DETAIL INQUIRY (SFL3-CTL3 )          *
     C*----------------------------------------------------*
     C           #SFL3     BEGSR
     C*
     C                     MOVEL*ON       *IN74
     C                     WRITECTL3
     C                     MOVEL0         *IN74
     C                     MOVEL0         *IN75
     C*
     C                     Z-ADD*ZERO     RRN3    40
     C           KEYA96    SETLLAFAPL96
     C*
     C                     DO
     C*
     C                     DO   *HIVAL
     C           KEYA96    READEAFAPL961                 25
     C   25                LEAVE
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     ITER
     C                     END
     C                     CLEARSFL3
     C                     MOVELA9AKI1    S3BIN#
     C                     MOVELA9TEHI    S3LOT
     C                     Z-ADDA9SYOS    @SYS
     C                     Z-ADDA9NOYY    S3NOYY
     C                     Z-ADDA9NOMM    S3NOMM
     C                     Z-ADDA9NODD    S3NODD
     C                     Z-ADDS3NODT    S3RVDT
     C                     Z-ADDA9HAKO    S3HAKO
     C                     Z-ADDA9NOSU    S3NOSU
     C           A9HAKO    SUB  A9NOSU    S3MINO
     C                     Z-ADD*ZERO     W@SHIP  60
     C                     Z-ADDA9ODNO    K@ORD#
     C                     MOVELA9PAR1    K@HIN1
     C                     MOVELA9PAR2    K@HIN2
     C                     MOVELA9PAR3    K@HIN3
     C                     EXSR #SUMS2
     C                     Z-ADDW@SHIP    S3SHIP
     C                     ADD  1         RRN3
     C                     WRITESFL3
     C                     ENDDO
     C*
     C           RRN3      IFEQ *ZERO
     C                     LEAVE
     C                     END
     C*
     C                     Z-ADD1         W@RRN3  40
     C*
     C                     DO   *HIVAL
     C*
     C                     WRITE#CMD2
     C                     Z-ADDW@RRN3    @SFRC3
     C                     EXFMTCTL3
     C   01                LEAVE
     C           *INKC     IFEQ *ON
     C                     MOVEL0         *INKC
     C                     LEAVE
     C                     END
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@RRN3
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *----------------------------------------------------*
      *   ORDER ACTUAL FILE READ (ORDER BY:PARTS NO)     *
      *----------------------------------------------------*
     C           #SETS1    BEGSR
     C           KEYA91    READEAFAPL961                 81
     C                     SETOF                       67
      *
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     MOVE '0'       GETFLG  1
     C                     MOVE A9PAR1    CHIN1
     C                     MOVE A9PAR2    CHIN2
     C                     MOVE A9PAR3    CHIN3
     C                     MOVE A9ODNO    CORDNO
     C                     MOVE A9ODYY    CODYY
     C                     MOVE A9ODMM    CODMM
     C                     MOVE A9ODDD    CODDD
     C                     MOVE *BLANK    CSUPP
     C                     MOVE A9NOYY    CNOYY
     C                     MOVE A9NOMM    CNOMM
     C                     MOVE A9NODD    CNODD
      *
     C           CODHZ     IFGE @SDATE
     C           CODHZ     ANDLE@EDATE
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C           *IN19     IFEQ '0'
     C                     MOVE CTLFLD    CHKFLD
     C                     SETON                       19
     C                     END
     C           CTLFLD    IFNE CHKFLD
     C                     EXSR #EDTPT
     C                     ADD  1         RRN1
     C                     ADD  1         @RRN1
     C                     ADD  1         CTRX1
     C                     WRITESFL1
     C                     SETOF                     414243
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
     C                     MOVE '0'       WRITFG
     C                     ADD  A9HAKO    WKHAKO
     C                     ADD  A9NOSU    WKNOSU
     C                     MOVE A9ZETI    WKZETI
     C                     MOVE A9NYYY    WKNYYY
     C                     MOVE A9NYMM    WKNYMM
     C                     MOVE A9NYDD    WKNYDD
     C                     MOVE A9SUPP    WKSUPP
     C                     ELSE
     C                     MOVE '0'       WRITFG
     C                     ADD  A9HAKO    WKHAKO
     C                     ADD  A9NOSU    WKNOSU
     C                     MOVE A9ZETI    WKZETI
     C                     MOVE A9NYYY    WKNYYY
     C                     MOVE A9NYMM    WKNYMM
     C                     MOVE A9NYDD    WKNYDD
     C                     MOVE A9SUPP    WKSUPP
     C                     END
     C                     MOVE CTLFLD    CHKFLD
     C                     END
      *
     C           CTRX1     IFEQ 13
     C                     SETON                       66
     C                     END
      *
     C                     END
     C           *IN81     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     EXSR #EDTPT
     C                     ADD  1         RRN1
     C                     ADD  1         @RRN1
     C                     ADD  1         CTRX1
     C                     WRITESFL1
     C                     SETOF                     414243
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
      *
     C           CTRX1     IFEQ 13
     C                     SETON                       66
     C                     END
      *
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  READ ORDER ACTUAL FILE   (ORDER BY:SUPPIER)       *
      *----------------------------------------------------*
     C           #SETX1    BEGSR
      *
     C           KEYA92    READEAFAPL971                 81
     C                     SETOF                       67
      *
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
      *
     C                     MOVE '0'       GETFLG  1
     C                     MOVE A9PAR1    CHIN1
     C                     MOVE A9PAR2    CHIN2
     C                     MOVE A9PAR3    CHIN3
     C                     MOVE A9ODNO    CORDNO
     C                     MOVE A9ODYY    CODYY
     C                     MOVE A9ODMM    CODMM
     C                     MOVE A9ODDD    CODDD
     C                     MOVE A9SUPP    CSUPP
     C                     MOVE A9NOYY    CNOYY
     C                     MOVE A9NOMM    CNOMM
     C                     MOVE A9NODD    CNODD
      *
     C           CODHZ     IFGE @SDATE
     C           CODHZ     ANDLE@EDATE
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C           *IN19     IFEQ '0'
     C                     MOVE CTLFLD    CHKFLD
     C                     SETON                       19
     C                     END
     C           CTLFLD    IFNE CHKFLD
     C                     EXSR #EDTPT
     C                     ADD  1         RRN1
     C                     ADD  1         @RRN1
     C                     ADD  1         CTRX1
     C                     WRITESFL1
     C                     SETOF                     414243
     C                     MOVE '1'       WRITFG
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
     C                     ADD  A9HAKO    WKHAKO
     C                     ADD  A9NOSU    WKNOSU
     C                     MOVE A9ZETI    WKZETI
     C                     MOVE A9NYYY    WKNYYY
     C                     MOVE A9NYMM    WKNYMM
     C                     MOVE A9NYDD    WKNYDD
     C                     MOVE A9SUPP    WKSUPP
     C                     ELSE
     C                     MOVE '0'       WRITFG
     C                     ADD  A9HAKO    WKHAKO
     C                     ADD  A9NOSU    WKNOSU
     C                     MOVE A9ZETI    WKZETI
     C                     MOVE A9NYYY    WKNYYY
     C                     MOVE A9NYMM    WKNYMM
     C                     MOVE A9NYDD    WKNYDD
     C                     MOVE A9SUPP    WKSUPP
     C                     END
     C                     MOVE CTLFLD    CHKFLD
     C                     END
      *
     C           CTRX1     IFEQ 13
     C                     SETON                       66
     C                     END
      *
     C                     END
     C           *IN81     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     EXSR #EDTPT
     C                     ADD  1         RRN1
     C                     ADD  1         @RRN1
     C                     ADD  1         CTRX1
     C                     WRITESFL1
     C                     SETOF                     414243
     C                     Z-ADD0         WKHAKO
     C                     Z-ADD0         WKNOSU
      *
     C           CTRX1     IFEQ 13
     C                     SETON                       66
     C                     END
      *
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   ORDER ACTUAL FILE READP (ORDER BY:PARTS NO)    *
      *----------------------------------------------------*
     C           #SETPS    BEGSR
     C                     SETOF                       27
     C                     SETOF                       19
     C                     DO   *HIVAL
     C           KEYA91    REDPEAFAPL961                 81
      *
     C                     SETOF                       67
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
     C                     MOVE '0'       GETFLG  1
     C                     MOVE A9PAR1    CHIN1
     C                     MOVE A9PAR2    CHIN2
     C                     MOVE A9PAR3    CHIN3
     C                     MOVE A9ODNO    CORDNO
     C                     MOVE A9ODYY    CODYY
     C                     MOVE A9ODMM    CODMM
     C                     MOVE A9ODDD    CODDD
     C                     MOVE *BLANK    CSUPP
     C                     MOVE A9NOYY    CNOYY
     C                     MOVE A9NOMM    CNOMM
     C                     MOVE A9NODD    CNODD
      *
     C           CODHZ     IFGE @SDATE
     C           CODHZ     ANDLE@EDATE
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C           *IN19     IFEQ '0'
     C                     MOVE CTLFLD    CHKFLD
     C                     SETON                       19
     C                     END
     C           CTLFLD    IFNE CHKFLD
     C                     SUB  1         CTRX1          27
     C                     SUB  1         @NO1
     C                     MOVE '1'       WRITFG
     C                     ELSE
     C                     MOVE '0'       WRITFG
     C                     END
     C                     MOVE CTLFLD    CHKFLD
     C                     END
      *
     C                     END
      *
     C  N27N81             END
      *
     C           *IN81     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     SUB  1         CTRX1
     C                     SUB  1         @NO1
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   ORDER ACTUAL FILE READP (ORDER BY:SUPPIER)
      *----------------------------------------------------*
     C           #SETP2    BEGSR
     C                     SETOF                       27
     C                     SETOF                       19
     C                     DO   *HIVAL
     C           KEYA92    REDPEAFAPL971                 81
      *
     C                     SETOF                       67
     C           *IN81     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     SETON                       67
     C                     END
      *
     C           *IN81     IFEQ '0'
     C           *IN67     ANDEQ'0'
     C                     MOVE '0'       GETFLG  1
     C                     MOVE A9PAR1    CHIN1
     C                     MOVE A9PAR2    CHIN2
     C                     MOVE A9PAR3    CHIN3
     C                     MOVE A9ODNO    CORDNO
     C                     MOVE A9ODYY    CODYY
     C                     MOVE A9ODMM    CODMM
     C                     MOVE A9ODDD    CODDD
     C                     MOVE A9SUPP    CSUPP
     C                     MOVE A9NOYY    CNOYY
     C                     MOVE A9NOMM    CNOMM
     C                     MOVE A9NODD    CNODD
      *
     C           CODHZ     IFGE @SDATE
     C           CODHZ     ANDLE@EDATE
     C                     MOVE '1'       GETFLG
     C                     END
      *
     C           GETFLG    IFEQ '1'
     C           *IN19     IFEQ '0'
     C                     MOVE CTLFLD    CHKFLD
     C                     SETON                       19
     C                     END
     C           CTLFLD    IFNE CHKFLD
     C                     SUB  1         CTRX1          27
     C                     SUB  1         @NO1
     C                     MOVE '1'       WRITFG
     C                     ELSE
     C                     MOVE '0'       WRITFG
     C                     END
     C                     MOVE CTLFLD    CHKFLD
     C                     END
      *
     C                     END
      *
     C  N27N81             END
      *
     C           *IN81     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     SUB  1         CTRX1
     C                     SUB  1         @NO1
     C                     END
     C                     ENDSR
      *----------------------------------------------------*
      *   ORDER DETAIL FILE READ                         *
      *----------------------------------------------------*
     C           #SETS2    BEGSR
     C           KEYA81    READEAFAPL831                 82
     C                     SETOF                       68
      *
     C           *IN82     IFEQ '0'
     C           A8SKJY    ANDEQ'D'
     C           A8SKHZ    ANDLEHYMD8
     C                     SETON                       68
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           *IN68     ANDEQ'0'
      *
     C                     MOVE A8PAR1    XHIN1
     C                     MOVE A8PAR2    XHIN2
     C                     MOVE A8PAR3    XHIN3
     C                     MOVE A8ODNO    XORDNO
     C                     MOVE A8SUPP    XSUPP
     C                     MOVE A8NOYY    XNOYY
     C                     MOVE A8NOMM    XNOMM
     C                     MOVE A8NODD    XNODD
      *
     C                     SETOF                     41
     C           *IN18     IFEQ '0'
     C                     SETON                       18
     C                     MOVE CTLFL2    CHKFL2
     C                     END
     C           CTLFL2    IFNE CHKFL2
     C                     ADD  1         @NO2
     C                     MOVE YNOHZ     @8NOHZ
     C                     MOVE WKMAIS    @MAIS
     C                     SUB  WKMAIS    @MINO
     C                     ADD  1         RRN2
     C                     ADD  1         @RRN2
     C                     ADD  1         CTRX2
     C           @8NOHZ    IFEQ 0
     C                     SETON                     41
     C                     END
     C                     WRITESFL2
     C                     SETOF                     41
     C                     Z-ADD0         WKMAIS
     C                     MOVE '1'       WRITFG
     C                     ADD  1         WKMAIS
      *
     C                     ELSE
     C                     MOVE '0'       WRITFG
     C                     ADD  1         WKMAIS
     C                     END
     C                     END
     C                     MOVE CTLFL2    CHKFL2
      *
     C           CTRX2     IFEQ 4
     C                     SETON                       69
     C                     END
      *
     C           *IN82     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     ADD  1         @NO2
     C                     MOVE YNOHZ     @8NOHZ
     C                     MOVE WKMAIS    @MAIS
     C                     SUB  WKMAIS    @MINO
     C                     ADD  1         RRN2
     C                     ADD  1         @RRN2
     C                     ADD  1         CTRX2
     C           @8NOHZ    IFEQ 0
     C                     SETON                     41
     C                     END
     C                     WRITESFL2
     C                     SETOF                     41
     C                     Z-ADD0         WKMAIS
      *
     C           CTRX2     IFEQ 4
     C                     SETON                       69
     C                     END
      *
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   ORDER DETAIL FILE READP                        *
      *----------------------------------------------------*
     C           #SETX2    BEGSR
     C                     SETOF                       29
     C                     SETOF                       18
     C                     DO   *HIVAL
     C           KEYA81    REDPEAFAPL831                 82
      *
     C                     SETOF                       68
     C           *IN82     IFEQ '0'
     C           A8SKJY    ANDEQ'D'
     C           A8SKHZ    ANDLEHYMD8
     C                     SETON                       68
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           *IN68     ANDEQ'0'
      *
     C                     MOVE A8PAR1    XHIN1
     C                     MOVE A8PAR2    XHIN2
     C                     MOVE A8PAR3    XHIN3
     C                     MOVE A8ODNO    XORDNO
     C                     MOVE A8SUPP    XSUPP
     C                     MOVE A8NOYY    XNOYY
     C                     MOVE A8NOMM    XNOMM
     C                     MOVE A8NODD    XNODD
      *
      *
     C           *IN18     IFEQ '0'
     C                     MOVE CTLFL2    CHKFL2
     C                     SETON                       18
     C                     END
     C           CTLFL2    IFNE CHKFL2
     C                     ADD  1         CTRKEN
     C                     SUB  1         CTRX2          29
     C                     SUB  1         @NO2
     C           CTRKEN    IFNE 1
     C                     ADD  WKMAIS    @MINO
     C                     END
     C                     MOVE '1'       WRITFG
     C                     Z-ADD1         WKMAIS
     C                     ELSE
     C                     ADD  1         WKMAIS
     C                     MOVE '0'       WRITFG
     C                     END
     C                     MOVE CTLFL2    CHKFL2
     C                     END
      *
     C  N29N82             END
      *
     C           *IN82     IFEQ '1'
     C           WRITFG    ANDNE*BLANK
     C                     SUB  1         @NO2
     C                     SUB  1         CTRX2
     C                     ADD  WKMAIS    @MINO
     C                     END
      *
     C                     ADD  WKMAIS    @MINO
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   CLEAR IS DSIPLAY ITEM                          *
      *----------------------------------------------------*
     C           #CLRSF    BEGSR
     C           SHFLG     IFEQ '1'
     C           SHFLG     OREQ '3'
     C                     SETON                     71
     C                     WRITECTL1
     C                     SETOF                     71
     C                     Z-ADD0         RRN1    30
     C                     Z-ADD0         @RRN1
     C                     Z-ADD0         CTRX1   40
     C                     Z-ADD1         @SFRC1
     C*                    Z-ADD1         WKPAG1
     C                     END
      *
     C           SHFLG     IFEQ '2'
     C           SHFLG     OREQ '3'
     C                     SETON                     73
     C                     WRITECTL2
     C                     SETOF                     73
     C                     Z-ADD0         RRN2    30
     C                     Z-ADD0         @RRN2
     C                     Z-ADD0         CTRX2   40
     C                     Z-ADD1         @SFRC2
     C*                    Z-ADD1         WKPAG2
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   EDIT                                             *
      *----------------------------------------------------*
     C           #EDTPT    BEGSR
      *
     C                     ADD  1         @NO1
     C                     Z-ADD@NO1      @NBR
      *
     C                     MOVE *BLANK    @CMTD
     C           *IN10     IFEQ '0'
     C                     MOVE '-'       WKH4
     C                     MOVE '-'       WKH5
     C                     MOVE WHIN1     @9HIN1
     C                     MOVE WHIN2     @9HIN2
     C                     MOVE WHIN3     @9HIN3
     C           @9HIN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKH5
     C                     END
     C                     MOVEL@HIN      @CMTD
     C                     ELSE
     C                     MOVELWORDNO    @CMTD
     C                     END
      *
     C                     MOVE WODHZ     @9ODHZ
     C                     MOVE WKNYYY    WKHY
     C                     MOVE WKNYMM    WKHM
     C                     MOVE WKNYDD    WKHD
     C                     MOVE WKYMD     @9NYHZ
     C                     MOVE WNOHZ     @9NOHZ
     C                     Z-ADDWKHAKO    @9HAKO
     C           @9HAKO    SUB  WKNOSU    @9MINO
     C                     MOVE WKSUPP    @9SUPP
     C                     MOVE WORDNO    @9ODNO
     C                     MOVE WKZETI    @9ZETI
     C                     MOVE WKNOSU    @9NOSU
     C                     MOVE @SYS      @SYSS
     C                     MOVE WHIN1     @9HIN1
     C                     MOVE WHIN2     @9HIN2
     C                     MOVE WHIN3     @9HIN3
     C                     SETOF                     414243
     C           @9ODHZ    IFEQ 0
     C                     SETON                     41
     C                     END
     C           @9NYHZ    IFEQ 0
     C                     SETON                     42
     C                     END
     C           @9NOHZ    IFEQ 0
     C                     SETON                     43
     C                     END
     C*
     C                     Z-ADD*ZERO     W@SHIP  60
     C                     Z-ADDWORDNO    K@ORD#
     C                     MOVELWHIN1     K@HIN1
     C                     MOVELWHIN2     K@HIN2
     C                     MOVELWHIN3     K@HIN3
     C                     EXSR #SUMS1
     C                     Z-ADDW@SHIP    @9SHIP
     C*
     C                     ENDSR
      *----------------------------------------------------*
      *   SUMMARY #OF SHIPPED CONT (1)                     *
      *----------------------------------------------------*
     C           #SUMS1    BEGSR
     C*
     C           K#TL80    KLIST
     C                     KFLD           K@ORD#  60
     C                     KFLD           K@HIN1  5
     C                     KFLD           K@HIN2  5
     C                     KFLD           K@HIN3  2
     C           K#TL80    SETLLAFATL80
     C*
     C                     DO   *HIVAL
     C*
     C           K#TL80    READEAFATL80                  88
     C   88                LEAVE
     C           A8SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C           K#ADL3    KLIST
     C                     KFLD           A8ZETI
     C                     KFLD           A8TEHI
     C                     KFLD           A8PAGE
     C           K#ADL3    SETLLALDPL30
     C*
     C                     DO   *HIVAL
     C*
     C           K#ADL3    READEALDPL30                  89
     C   89                LEAVE
     C           A3SYDT    IFGT WODHZ
     C                     ADD  1         W@SHIP
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *----------------------------------------------------*
      *   SUMMARY #OF SHIPPED CONT (2)                     *
      *----------------------------------------------------*
     C           #SUMS2    BEGSR
     C*
     C           K#TL80    SETLLAFATL80
     C*
     C                     DO   *HIVAL
     C*
     C           K#TL80    READEAFATL80                  88
     C   88                LEAVE
     C           A8SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           A9TEHI    IFNE A8TEHI
     C                     ITER
     C                     END
     C*
     C           K#ADL3    SETLLALDPL30
     C*
     C                     DO   *HIVAL
     C*
     C           K#ADL3    READEALDPL30                  89
     C   89                LEAVE
     C           A3SYDT    IFGT WODHZ
     C                     ADD  1         W@SHIP
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *----------------------------------------------------*
      *    RECORD POINTER SETTING                        *
      *----------------------------------------------------*
     C           #POS      BEGSR
      *
     C           @TYPE     IFEQ 'A'
      *
     C           CTLFLD    IFEQ CHKFLD
     C                     MOVE CHIN1     #KPAR1  5
     C                     MOVE CHIN2     #KPAR2  5
     C                     MOVE CHIN3     #KPAR3  2
     C                     MOVE CORDNO    #KODNO  60
     C                     MOVE CODYY     #KODYY  40
     C                     MOVE CODMM     #KODMM  20
     C                     MOVE CODDD     #KODDD  20
     C                     MOVE '01'      #KODBB  20
     C                     MOVE CNOYY     #KNOYY  40
     C                     MOVE CNOMM     #KNOMM  20
     C                     MOVE CNODD     #KNODD  20
     C                     SETON                       69
     C                     ELSE
     C                     SETON                       81
     C                     END
      *
     C           *IN69     IFEQ '1'
     C           KEYSV1    SETLLAFAPL961
     C                     END
      *
     C                     END
      *-------------------*
     C           @TYPE     IFEQ 'B'
      *
     C           CTLFLD    IFEQ CHKFLD
     C                     MOVE CSUPP     #KSUPP  4
     C                     MOVE CHIN1     #KPAR1  5
     C                     MOVE CHIN2     #KPAR2  5
     C                     MOVE CHIN3     #KPAR3  2
     C                     MOVE CORDNO    #KODNO  60
     C                     MOVE CODYY     #KODYY  40
     C                     MOVE CODMM     #KODMM  20
     C                     MOVE CODDD     #KODDD  20
     C                     MOVE '01'      #KODBB  20
     C                     MOVE CNOYY     #KNOYY  40
     C                     MOVE CNOMM     #KNOMM  20
     C                     MOVE CNODD     #KNODD  20
     C                     SETON                       69
     C                     ELSE
     C                     SETON                       81
     C                     END
      *
     C           *IN69     IFEQ '1'
     C           KEYSV2    SETLLAFAPL971
     C                     END
      *
     C                     END
     C                     ENDSR
      *----------------------------------------------------*
      *    RECORD POINTER SETTING                        *
      *----------------------------------------------------*
     C           #POS2     BEGSR
      *
      *
     C           CTLFL2    IFEQ CHKFL2
     C                     MOVE XSUPP     #8SUPP  4
     C                     MOVE XHIN1     #8PAR1  5
     C                     MOVE XHIN2     #8PAR2  5
     C                     MOVE XHIN3     #8PAR3  2
     C                     MOVE XORDNO    #8ODNO  60
     C                     MOVE XNOYY     #8NOYY  40
     C                     MOVE XNOMM     #8NOMM  20
     C                     MOVE XNODD     #8NODD  20
     C                     SETON                       69
     C                     ELSE
     C                     SETON                       82
     C                     END
      *
      *
     C           *IN69     IFEQ '1'
     C           KEYSV3    SETLLAFAPL831
     C                     END
      *
     C                     ENDSR
      *----------------------------------------------------*
      * READ LEVELLED PTODUCTION FICD ORDERING FILE        *
      *----------------------------------------------------*
     C           #LEVEL    BEGSR
     C                     SETOF                         29
     C                     MOVE *BLANK    @KANBN
     C           KEYHBN    CHAINAGAPL31              29
     C           *IN29     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLEHYMD8
     C                     SETON                     29
     C                     END
     C           *IN29     IFEQ '1'
     C                     GOTO XLEVEL
     C                     ELSE
     C           CBKDAI    CASEQ'C'       #KBNC
     C           CBKDAI    CASEQ'E'       #KBND
     C                     ENDCS
      *
     C                     END
     C           XLEVEL    ENDSR
      *----------------------------------------------------*
      *  PLATING KANBAN                                    *
      *----------------------------------------------------*
     C           #KBNC     BEGSR
     C           KEYHBN    SETGTAAFTL061
     C                     SETOF                     2044
     C                     MOVE *BLANK    @TKR
     C                     Z-ADD0         @SETS
     C                     MOVE *BLANK    @UPD
     C                     DO   *HIVAL
     C           KEYHBN    REDPEAAFTL061                 20
     C                     SETOF                     45
     C           *IN20     IFEQ '0'
     C           A3SKJY    ANDEQ'D'
     C           A3SKHZ    ANDLEHYMD8
     C                     SETON                     45
     C                     END
      *
     C           *IN20     IFEQ '0'
     C           *IN45     ANDEQ'0'
     C           A3STHZ    ANDGEHYMD8
     C                     SETON                       44
     C                     MOVELCMT1,5    @KANBN
     C                     MOVE A3ATK1    WKATK1
     C                     MOVE A3ATK2    WKATK2
     C                     MOVE A3ATK3    WKATK3
     C                     MOVE A3ATK4    WKATK4
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C                     MOVE '-'       WKF3
     C                     MOVE WKATKR    @TKR
     C                     MOVE A3KMAX    @SETS
     C                     MOVE A3KSNK    @UPD
      *
     C                     MOVE A3ATOB    #KBMN
     C                     MOVE A3ATYP    #KTYP
     C                     Z-ADD0         @CIKU
     C                     SETOF                       21
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVE T2SKRU    @CIKU
     C                     END
      *
     C                     END
      *
     C  N20N44             END
     C                     ENDSR
      *----------------------------------------------------*
      *  PART WITHDRAWAL  KANBNAN                          *
      *----------------------------------------------------*
     C           #KBND     BEGSR
     C           KEYHBN    SETGTAAHTL061
     C                     SETOF                     2044
     C                     MOVE *BLANK    @TKR
     C                     Z-ADD0         @SETS
     C                     MOVE *BLANK    @UPD
     C                     DO   *HIVAL
     C           KEYHBN    REDPEAAHTL061                 20
     C                     SETOF                     45
     C           *IN20     IFEQ '0'
     C           L6SKJY    ANDEQ'D'
     C           L6SKHZ    ANDLEHYMD8
     C                     SETON                     45
     C                     END
      *
     C           *IN20     IFEQ '0'
     C           *IN45     ANDEQ'0'
     C           L6STHZ    ANDGEHYMD8
     C                     SETON                       44
     C                     MOVELCMT1,6    @KANBN
     C                     MOVE L6ATK1    WKATK1
     C                     MOVE L6ATK2    WKATK2
     C                     MOVE L6ATK3    WKATK3
     C                     MOVE L6ATK4    WKATK4
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C                     MOVE '-'       WKF3
     C                     MOVE WKATKR    @TKR
     C                     MOVE L6KMAX    @SETS
     C                     MOVE L6KSNK    @UPD
      *
     C                     MOVE L6ATOB    #KBMN
     C                     MOVE L6ATYP    #KTYP
     C                     Z-ADD0         @CIKU
     C                     SETOF                       21
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVE T2SKRU    @CIKU
     C                     END
      *
     C                     END
      *
     C  N20N44             END
     C                     ENDSR
     C*----------------------------------------------------*
     C*  CREATE DWONLOAD FILE                              *
     C*----------------------------------------------------*
     C           #DWNL     BEGSR
     C*
     C           K@97A     KLIST
     C                     KFLD           K@SUPP  4
     C                     KFLD           K@ODYY  40
     C                     KFLD           K@ODMM  20
     C                     KFLD           K@ODDD  20
      *
     C                     Z-ADD@FDATE    @SDATE
     C                     Z-ADD@SYY      K@ODYY
     C                     Z-ADD@SMM      K@ODMM
     C                     Z-ADD@SDD      K@ODDD
     C           @TDATE    IFEQ *ZERO
     C           @FDATE    IFEQ *ZERO
     C                     Z-ADD99999999  @TDATE
     C                     ELSE
     C                     Z-ADD@FDATE    @TDATE
     C                     END
     C                     END
      * 3 BOND
     C                     Z-ADD0         CVCNT2  50
     C                     MOVEL'2255'    K@SUPP
     C                     EXSR #OUT93
      * NYLOCK
     C                     MOVEL'6666'    K@SUPP
     C                     EXSR #OUT93
     C*
     C                     ENDSR
      *----------------------------------------------------*
      * OUTPUT AFAWP93                                     *
      *----------------------------------------------------*
     C           #OUT93    BEGSR
     C*
     C           K@97A     SETLLAFAPL971
     C*
     C                     DO   *HIVAL
     C*
     C           K@SUPP    READEAFAPL971                 81
     C   81                LEAVE
     C           A9ODHZ    IFGT @TDATE
     C                     LEAVE
     C                     END
     C           A9SKJY    IFEQ 'D'
     C           A9SKHZ    ANDLEHYMD8
     C                     ITER
     C                     END
     C*
     C           K@WP93    KLIST
     C                     KFLD           K@SUPP  4
     C                     KFLD           A9PAR1
     C                     KFLD           A9PAR2
     C                     KFLD           A9PAR3
     C                     KFLD           A9ZETI
     C                     KFLD           A9TEHI
     C                     KFLD           K@ODNO  6
     C                     KFLD           A9ODYY
     C                     KFLD           A9ODMM
     C                     KFLD           A9ODDD
     C                     KFLD           A9NOYY
     C                     KFLD           A9NOMM
     C                     KFLD           A9NODD
      *
     C                     MOVELA9SUPP    K@SUPP
     C                     MOVELA9ODNO    K@ODNO
     C           K@WP93    CHAINAFAWP93R             83
     C           *IN83     IFEQ *OFF
     C                     ADD  A9HAKO    W3OBOX
     C                     ADD  A9NOSU    W3RBOX
     C                     UPDATAFAWP93R
     C                     ITER
     C                     END
     C*
     C                     CLEARAFAWP93R
     C                     MOVELA9PAR1    W3SHN1
     C                     MOVELA9PAR2    W3SHN2
     C                     MOVELA9PAR3    W3SHN3
     C                     MOVELA9ZETI    W3ZETI
     C                     MOVELA9TEHI    W3TEHI
     C                     MOVELA9SUPP    W3KAKE
     C                     MOVELA9ODNO    W3ORNO
     C                     Z-ADDA9ODYY    W3ORYY
     C                     Z-ADDA9ODMM    W3ORMM
     C                     Z-ADDA9ODDD    W3ORDD
     C                     Z-ADDA9SYOS    W3SYOS
     C                     ADD  A9HAKO    W3OBOX
     C                     Z-ADDA9WEIT    W3WEIT
     C                     Z-ADDA9NYYY    W3ETYY
     C                     Z-ADDA9NYMM    W3ETMM
     C                     Z-ADDA9NYDD    W3ETDD
     C                     Z-ADDA9NOYY    W3RVYY
     C                     Z-ADDA9NOMM    W3RVMM
     C                     Z-ADDA9NODD    W3RVDD
     C                     ADD  A9NOSU    W3RBOX
     C                     WRITEAFAWP93R
     C*
     C                     ENDDO
      *
      * OUTPUT AFAWP93A (FOR CSV)
     C                     EXSR #CSV
      *
     C                     ENDSR
      *----------------------------------------------------*
      * OUTPUT AFAWP93A (FOR CSV)                          *
      *----------------------------------------------------*
     C           #CSV      BEGSR
     C                     Z-ADD0         CVCNT1  50
      * CREATE DETAIL
     C           K@SUPP    SETLLAFAWP93
     C                     DO   *HIVAL
     C           K@SUPP    READEAFAWP93                  98
     C   98                LEAVE
      *
     C                     CLEARAFAWP931
      * EDIT IAF PART#
     C                     MOVELW3SHIN    $SHIN
     C                     CALL 'EDTR02'
     C                     PARM           $SHIN  12
     C                     PARM           $SHIN2 14
     C                     MOVEL$SHIN2    F3SHIN
      *
     C                     MOVELW3ZETI    F3ZETI
     C                     MOVELW3TEHI    F3TEHI
      *
     C                     MOVELW3KAKE    F3KAKE
     C                     MOVELW3ORNO    F3ORNO
      *
     C                     MOVELW3ORHZ    F3ORHZ
      * EDIT DATE
     C                     MOVELW3ORHZ    $DATE1
     C                     MOVE 'YMD'     $YMD
     C                     MOVE '/'       $SEP
     C                     CALL 'EDTR01A'
     C                     PARM           $DATE1  8
     C                     PARM           $YMD    3
     C                     PARM           $SEP    1
     C                     PARM           $DATE2 10
     C                     MOVEL$DATE2    F3ORHZ
      *
     C                     MOVELW3SYOS    F3SYOS
     C                     MOVELW3OBOX    F3OBOX
      * EDIT WGT
     C                     Z-ADDW3WEIT    $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     MOVEL$TRUE     F3WEIT
      * EDIT DATE
     C                     MOVELW3ETHZ    $DATE1
     C                     MOVE 'YMD'     $YMD
     C                     MOVE '/'       $SEP
     C                     CALL 'EDTR01A'
     C                     PARM           $DATE1  8
     C                     PARM           $YMD    3
     C                     PARM           $SEP    1
     C                     PARM           $DATE2 10
     C                     MOVEL$DATE2    F3ETHZ
      * EDIT DATE
     C           W3RVHZ    IFNE 0
     C                     MOVELW3RVHZ    $DATE1
     C                     MOVE 'YMD'     $YMD
     C                     MOVE '/'       $SEP
     C                     CALL 'EDTR01A'
     C                     PARM           $DATE1  8
     C                     PARM           $YMD    3
     C                     PARM           $SEP    1
     C                     PARM           $DATE2 10
     C                     MOVEL$DATE2    F3RVHZ
     C                     ENDIF
      *
     C                     MOVELW3RBOX    F3RBOX
      *
     C                     ADD  1         CVCNT1
     C                     ADD  1         CVCNT2
     C           CVCNT1    IFEQ 1
      * CREATE HEADER
     C                     EXSR #HEADC
     C                     ENDIF
      *
     C                     WRITEAFAWP931
      *
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
      * CREATE CSV HEADER                                  *
      *----------------------------------------------------*
     C           #HEADC    BEGSR
      *
     C                     EXSR #SVDAT
      *
     C                     CLEARAFAWP931
     C                     MOVEL'IAF_PART'F3SHIN
     C                     MOVEL'ITEM#   'F3ZETI
     C                     MOVEL'SET#    'F3TEHI
      *
     C                     MOVEL'SUPPLIER'F3KAKE
     C                     MOVEL'ORDER#  'F3ORNO
     C                     MOVEL'ORD_DATE'F3ORHZ
     C                     MOVEL'QPC     'F3SYOS
     C                     MOVEL'ORD_BOX 'F3OBOX
     C                     MOVEL'WEIGHT  'F3WEIT
     C                     MOVEL'ETA_DATE'F3ETHZ
      *
     C                     MOVEL'RCV_DATE'F3RVHZ
     C                     MOVEL'RCV_BOX 'F3RBOX
     C                     WRITEAFAWP931
      *
     C                     EXSR #RSDAT
      *
     C                     ENDSR
      *----------------------------------------------------*
      * SAVE DATA                                          *
      *----------------------------------------------------*
     C           #SVDAT    BEGSR
      *
     C                     MOVELF3SHIN    XXSHIN
     C                     MOVELF3ZETI    XXZETI
     C                     MOVELF3TEHI    XXTEHI
     C                     MOVELF3KAKE    XXKAKE
     C                     MOVELF3ORNO    XXORNO
     C                     MOVELF3ORHZ    XXORHZ
     C                     MOVELF3SYOS    XXSYOS
     C                     MOVELF3OBOX    XXOBOX
     C                     MOVELF3WEIT    XXWEIT
     C                     MOVELF3ETHZ    XXETHZ
     C                     MOVELF3RVHZ    XXRVHZ
     C                     MOVELF3RBOX    XXRBOX
      *
     C                     ENDSR
      *----------------------------------------------------*
      * RESTORE DATA                                       *
      *----------------------------------------------------*
     C           #RSDAT    BEGSR
      *
     C                     MOVELXXSHIN    F3SHIN
     C                     MOVELXXZETI    F3ZETI
     C                     MOVELXXTEHI    F3TEHI
     C                     MOVELXXKAKE    F3KAKE
     C                     MOVELXXORNO    F3ORNO
     C                     MOVELXXORHZ    F3ORHZ
     C                     MOVELXXSYOS    F3SYOS
     C                     MOVELXXOBOX    F3OBOX
     C                     MOVELXXWEIT    F3WEIT
     C                     MOVELXXETHZ    F3ETHZ
     C                     MOVELXXRVHZ    F3RVHZ
     C                     MOVELXXRBOX    F3RBOX
      *
     C                     ENDSR
      *----------------------------------------------------*
      * END PROGRAM                                        *
      *----------------------------------------------------*
     C           #END      BEGSR
     C                     SETON                     LR
     C                     RETRN
     C                     ENDSR
      *----------------------------------------------------*
      *   INITIAL PROCESS                                *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *----------------------------------------------------*
      *  PARAMETER TRANSFER                                *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     PARM           PMODE   1
     C                     PARM           PHIN1   5
     C                     PARM           PHIN2   5
     C                     PARM           PHIN3   2
     C                     PARM           PSDAT   8
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C           KEYF81    KLIST
     C                     KFLD           #KHY    40
     C                     KFLD           #KHM    20
     C                     KFLD           #KHD    20
      *
     C           KEYT21    KLIST
     C                     KFLD           #KBMN   40
     C                     KFLD           #KTYP   1
      *-------------------*
      * ODER BY. PARTS NO *
      *-------------------*
     C           KEYSV1    KLIST
     C                     KFLD           #KPAR1  5
     C                     KFLD           #KPAR2  5
     C                     KFLD           #KPAR3  2
     C                     KFLD           #KODNO  60
     C                     KFLD           #KODYY  40
     C                     KFLD           #KODMM  20
     C                     KFLD           #KODDD  20
     C                     KFLD           #KODBB  20
     C                     KFLD           #KNOYY  40
     C                     KFLD           #KNOMM  20
     C                     KFLD           #KNODD  20
      *
     C           KEYA91    KLIST
     C                     KFLD           #KPAR1  5
     C                     KFLD           #KPAR2  5
     C                     KFLD           #KPAR3  2
      *
     C           KEYA96    KLIST
     C                     KFLD           #KPAR1  5
     C                     KFLD           #KPAR2  5
     C                     KFLD           #KPAR3  2
     C                     KFLD           #KODNO  60
     C                     KFLD           #KODYY  40
     C                     KFLD           #KODMM  20
     C                     KFLD           #KODDD  20
     C*                    KFLD           #KODBB  20
      *-------------------*
      * ODER BY. SUPPIER  *
      *-------------------*
     C           KEYSV2    KLIST
     C                     KFLD           #KSUPP  4
     C                     KFLD           #KODYY
     C                     KFLD           #KODMM
     C                     KFLD           #KODDD
     C                     KFLD           #KODBB
     C                     KFLD           #KPAR1
     C                     KFLD           #KPAR2
     C                     KFLD           #KPAR3
     C                     KFLD           #KODNO
     C                     KFLD           #KNOYY
     C                     KFLD           #KNOMM
     C                     KFLD           #KNODD
      *
     C           KEYA92    KLIST
     C                     KFLD           #KSUPP  4
      *
     C           KEYHBN    KLIST
     C                     KFLD           #KHIN1  5
     C                     KFLD           #KHIN2  5
     C                     KFLD           #KHIN3  2
      *-------------------*
      * DETAILS FILE KEY  *
      *-------------------*
     C           KEYSV3    KLIST
     C                     KFLD           #8SUPP  4
     C                     KFLD           #8PAR1  5
     C                     KFLD           #8PAR2  5
     C                     KFLD           #8PAR3  2
     C                     KFLD           #8ODNO  60
     C                     KFLD           #8NOYY  40
     C                     KFLD           #8NOMM  20
     C                     KFLD           #8NODD  20
     C                     KFLD           #8ZETI  4
     C                     KFLD           #8TEHI  3
     C                     KFLD           #8DATE  80
     C                     KFLD           #8RENO  50
      *
     C           KEYA81    KLIST
     C                     KFLD           #8SUPP  4
     C                     KFLD           #8PAR1  5
     C                     KFLD           #8PAR2  5
     C                     KFLD           #8PAR3  2
     C                     KFLD           #8ODNO  60
      *
     C                     TIME           TIME
     C                     TIME           SDATE
     C                     Z-ADD*DATE     HYMD8
     C                     SETOF                     1613
     C                     SETOF                     1599
     C                     MOVEL*BLANK    @ERR
     C                     MOVE *BLANK    DSPSW   1
     C                     MOVE '0'       DSPFLG  1
     C                     Z-ADD0         SAVNBR  40
     C                     Z-ADD0         MAXNBR  40
     C                     MOVE '3'       SHFLG   1
     C                     MOVE *BLANK    WZETI   4
     C                     CLEARCHKFLD
     C                     CLEARCTLFLD
     C                     Z-ADD1         WKPAG1  30
     C                     Z-ADD1         WKPAG2  30
     C                     Z-ADD0         WKHAKO  30
     C                     Z-ADD0         WKNOSU  30
     C                     Z-ADD0         WKMAIS  30
     C                     Z-ADD0         @NBR    30
     C                     Z-ADD0         CTRKEN  30
     C                     MOVE *BLANK    WKSUPP  4
     C                     MOVE *BLANK    WKZETI  4
     C                     MOVE *BLANK    WKNYYY  40
     C                     MOVE *BLANK    WKNYMM  20
     C                     MOVE *BLANK    WKNYDD  20
     C                     Z-ADD0         WKYMD
     C                     Z-ADD0         @1HZ
     C                     Z-ADD0         @2HZ
     C                     Z-ADD0         A2GSHZ
     C                     Z-ADD0         A2SYHZ
     C                     Z-ADD0         B2SKHZ
     C                     Z-ADD0         A9SKHZ
     C                     Z-ADD0         A8SKHZ
     C                     Z-ADD0         A9ODHZ
     C                     Z-ADD0         @SDATE
     C                     Z-ADD0         @EDATE
     C                     Z-ADD0         CORDNO
     C                     Z-ADD0         CODYY
     C                     Z-ADD0         CODMM
     C                     Z-ADD0         CODDD
     C                     Z-ADD0         CNOHZ
     C                     Z-ADD0         CNOYY
     C                     Z-ADD0         CNOMM
     C                     Z-ADD0         CNODD
     C                     Z-ADD0         WORDNO
     C                     Z-ADD0         WODYY
     C                     Z-ADD0         WODMM
     C                     Z-ADD0         WODDD
     C                     Z-ADD0         WNOHZ
     C                     Z-ADD0         WNOYY
     C                     Z-ADD0         WNOMM
     C                     Z-ADD0         WNODD
     C                     Z-ADD0         XORDNO
     C                     Z-ADD0         XNOHZ
     C                     Z-ADD0         XNOYY
     C                     Z-ADD0         XNOMM
     C                     Z-ADD0         XNODD
     C                     Z-ADD0         YORDNO
     C                     Z-ADD0         YNOHZ
     C                     Z-ADD0         YNOYY
     C                     Z-ADD0         YNOMM
     C                     Z-ADD0         YNODD
     C                     MOVE '1'       WRITFG  1
      *
      * SFL CLEAR
     C                     EXSR #CLRSF
      *
     C                     MOVE '1'       DSPSW
      * REDEFINE
     C           *LIKE     DEFN F3SHIN    XXSHIN
     C           *LIKE     DEFN F3ZETI    XXZETI
     C           *LIKE     DEFN F3TEHI    XXTEHI
     C           *LIKE     DEFN F3KAKE    XXKAKE
     C           *LIKE     DEFN F3ORNO    XXORNO
     C           *LIKE     DEFN F3ORHZ    XXORHZ
     C           *LIKE     DEFN F3SYOS    XXSYOS
     C           *LIKE     DEFN F3OBOX    XXOBOX
     C           *LIKE     DEFN F3WEIT    XXWEIT
     C           *LIKE     DEFN F3ETHZ    XXETHZ
     C           *LIKE     DEFN F3RVHZ    XXRVHZ
     C           *LIKE     DEFN F3RBOX    XXRBOX
      *
     C                     ENDSR
      **************************************************
** ERR(60).........2.........3.........4.........5.........6
ENTER A OR B!                                                 01
ENTER PART#                                                   02
PART# IS INVALID!                                             03
DATE FROM IS INVALID!                                         04
DATE TO IS INVALID!                                           05
THERE IS NO DATA!                                             06
ENTER ORDER DATA WHICH IS INQUIRED TO!                        07
SUPPLIER CODE IS INVALID!                                     08
DATE FROM > TO !                                              09
NUMBER IS INVALID!                                            10
PRESS F5 TO DOWNLOAD DATA TO CSV...                           11
                                                              12
                                                              13
                                                              14
                                                              15
**  CMT1/CMT2 (COMMENT NAME)
PART NO.                                              1
SUPPLIER                                              2
ORDER NO                                              3
PART NO                                               4
PLATING KANBAN
PART WITHDRAWAL KANBAN
