     H            Y.                                    1
     H** AFAR60 ***************************************************************
     H* COMBINED PARTIAL CONTAINER
     H* TCH 2000.05.22
     H* TCH 2000.07.07 DUPLICATE CHECK
     H* TCH 2000.08.28 SYSTEM DATE(8 --> 4 2 2 *
     H* TCH 2001.01.29 ADD CREATE PLATING KANBAN
     H* TCH 2001.09.06 ADD COMBINE PARTIAL
     H* TCH 2001.09.26 ADD SURPLUS KANBAN
     H* TCH 2002.10.09 ADD CHECK (NEXT PROCESS)
     H* TCHK1 2009.06.03 BUG FIX
     H* TCHK2 2009.07.17 ADD LAST LOC IS 'G' GOING TO PLASTIC
     H* TCHK3 2014.07.18 ADD KANBAN DUPLICATE CHECK
     H**************************************************************************
     H*
     H* *INKC = 1(CF03)
     H* *INKE = 1(CF05)
     H* *IN29 = 1(BZ KANBAN) 0(A-PICS KANBAN)
     H* *IN30 = ERROR
     H* *IN31 = 1(KANBAN1)
     H* *IN32 = 1(LOT1)
     H* *IN33 = 1(KANBAN2)
     H* *IN34 = 1(LOT2)
     H* *IN35 = 1(KANBAN3)
     H* *IN36 = 1(LOT3)
     H* *IN37 = 1(KANBAN4)
     H* *IN38 = 1(LOT4)
     H* *IN39 = 1(KANBAN5)
     H* *IN40 = 1(LOT5)
     H* *IN41 = 1(KANBAN6)
     H* *IN42 = 1(LOT6)
     H* *IN90 = 1(NOT READ AFAPP60)
     H* *IN91 = 1(FOUND ALP:NEW LOT NUMBER
     H* *IN92 = 1(NOT READ FCETL11)
     H* *IN93 = 1(NOT READ AGAPL31)
     H* *IN94 = 1(NOT READ AFANP65)
     H* *IN95 = 1(NOT READ AAFTL01)
     H**************************************************************************
     FAFAPW60 CF  E                    WORKSTN
     FFCETL11 IF  E           K        DISK
     FAFAPP60 IF  E           K        DISK                      A
     FAGAPL31 IF  E           K        DISK
     FAFANP65 UF  E           K        DISK                      A
     FAAFTL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAH#PL11 UF  E           K        DISK
     F**************************************************************************
     E                    KAN         6 15               APICS/BZ KANBAN
     E                    LOT         6  8               LOT ID TAG
     E                    ZET         6  4               ZETI
     E                    TEH         6  3               TEHAI
     E                    ALP    26  26  1               ALPHABET
     E                    ER      1   5 15
     E                    PRC        15  3               PROCESS
     E                    LOC        15  6               LOCATION
     E                    KK         15  1               KANBAN
     I**************************************************************************
     I            DS
     I                                        1  120WSTIME
     I                                        1   20WSHH
     I                                        3   40WSSS
     I**************************************************************************
     I            DS
     I                                        1   80WSDATE
     I                                        1   40WSYYYY
     I                                        5   60WSMM
     I                                        7   80WSDD
     I**************************************************************************
     I* A-PICS OR BZ-KANBAN
     I            DS
     I                                        1  90 WKAN
     I                                        1  90 KAN
     I* (WITH CHECK DIGIT:DISP)
     I                                        1  15 KAN01
     I                                       16  30 KAN02
     I                                       31  45 KAN03
     I                                       46  60 KAN04
     I                                       61  75 KAN05
     I                                       76  90 KAN06
     I* (WITHOUT CHECK DIGIT)
     I                                        1  14 WAKAN1
     I                                       16  29 WAKAN2
     I                                       31  44 WAKAN3
     I                                       46  59 WAKAN4
     I                                       61  74 WAKAN5
     I                                       76  89 WAKAN6
     I* (ZETI)
     I                                        2   5 WZET1
     I                                       17  20 WZET2
     I                                       32  35 WZET3
     I                                       47  50 WZET4
     I                                       62  65 WZET5
     I                                       77  80 WZET6
     I* (TEHAI)
     I                                        6   8 WTEH1
     I                                       21  23 WTEH2
     I                                       36  38 WTEH3
     I                                       51  53 WTEH4
     I                                       66  68 WTEH5
     I                                       81  83 WTEH6
     I********************************************************
     I* LOT ID TAG
     I            DS
     I                                        1  48 WLOT
     I                                        1  48 LOT
     I                                        1   8 LOT01
     I                                        9  16 LOT02
     I                                       17  24 LOT03
     I                                       25  32 LOT04
     I                                       33  40 LOT05
     I                                       41  48 LOT06
     I                                        1   7 WALOT1
     I                                        9  15 WALOT2
     I                                       17  23 WALOT3
     I                                       25  31 WALOT4
     I                                       33  39 WALOT5
     I                                       41  47 WALOT6
     I* NEW LOT ID # (APICS)
     I            DS
     I                                        1   3 WANLOT
     I                                        1   1 WNALPH
     I                                        2   30WNSEQ
     I* NEW LOT ID # (PLASTIC)
     I            DS
     I                                        1   3 WHNLOT
     I                                        1   20WHSEQ
     I                                        3   3 WHALPH
     I* INTERNAL PART NUMBER(FCETL11)
     I            DS
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I                                        1  12 W2PART
      *
     I            DS
     I                                        1  15 @KANBN
     I                                        1   1 @KK
     I                                        2   5 @ZETI
     I                                        8   8 @ID
     I                                        9  11 @PROC
     I                                        6   8 @THI
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK2I*
TCHK2I            DS
TCHK2I                                        1   6 W@LOC
TCHK2I                                        1   1 W@LC1
TCHK2I                                        2   3 W@LC2
TCHK2I                                        2   2 W@LC21
TCHK2I                                        3   3 W@LC22
TCHK2I                                        4   5 W@LC3
TCHK2I                                        6   6 W@LC4
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PUSR    6
     C* AFANP65
     C           KEY1      KLIST
     C                     KFLD           KKBN             APICS/PLASTIC
     C                     KFLD           KEY11   4        ZETI
     C           KEY1X     KLIST
     C                     KFLD           K@KBN   1        APICS/PLASTIC
     C                     KFLD           KEY11   4        ZETI
     C*
     C* AGAPL31 AND AAFTL01
     C           KEY2      KLIST
     C                     KFLD           A2BHB1           PART 1
     C                     KFLD           A2BHB2           PART 2
     C                     KFLD           A2BHB3           PART 3
      *
     C           K#AH11    KLIST
     C                     KFLD           @ZETI
     C                     KFLD           @THI
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C                     EXSR @INT
     C                     EXSR @MAIN
     C                     EXSR @END
     C**************************************************************************
     C*                    @INT
     C**************************************************************************
     C           @INT      BEGSR
     C*
     C                     MOVE *ALL'0'   WKBLK  12
     C                     MOVE *ZERO     AANLOT
     C                     Z-ADD0         I       20
     C                     Z-ADD0         J       20
     C                     Z-ADD0         M       20
     C                     CLEARKAN
     C                     CLEARLOT
     C*
     C                     SETOF                     3031
     C*
     C                     Z-ADD*DATE     WSDATE
     C                     TIME           WSTIME
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @MAIN
     C**************************************************************************
     C           @MAIN     BEGSR
     C*
B01  C           *INKC     DOWEQ'0'
     C           *IN30     IFEQ '1'
     C           #ERR      TAG
     C                     EXFMTAFAPW699
     C                     SETOF                     30
     C                     GOTO #END
     C                     END
     C* ENTER
B02  C           *IN31     IFEQ '0'
     C                     WRITEAFAPW688
     C                     EXFMTAFAPW600
     C* F3=END
B03  C           *INKC     IFEQ '1'
     C                     EXSR @END
     C                     ENDIF
      *
     C                     EXSR @CHK1                      1ST. DISP
     C   30                GOTO #ERR
      *
     C           @OTH      IFEQ '1'
     C           @CPY      OREQ '1'
      *
     C           @OTH      IFEQ '1'
     C                     CLEARAFAPW620
     C                     MOVEA'01111111'*IN,1
     C                     MOVEA'11'      *IN,9
     C                     EXSR #OTH
     C                     ENDIF
     C           @CPY      IFEQ '1'
     C                     CLEARAFAPW621
     C                     MOVEA'01111111'*IN,1
     C                     MOVEA'11'      *IN,9
     C                     EXSR #CPY
     C                     ENDIF
      *
     C                     SELEC
     C           *INKD     WHEQ *ON
     C                     CLEARAFAPW620
     C                     CLEARAFAPW621
     C                     ITER
     C           *INKC     WHEQ *ON
     C                     EXSR @END
     C                     ENDSL
      *
E03  C                     ENDIF
      *
     C                     SETON                     31
E03  C                     ENDIF
     C*
B02  C           *IN42     IFEQ '1'
     C           #42       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     WRITEAFAPW607
     C                     WRITEAFAPW608
     C                     WRITEAFAPW609
     C                     WRITEAFAPW610
     C                     WRITEAFAPW611
     C                     EXFMTAFAPW612
     C*
     C                     ELSE
B03  C           *IN41     IFEQ '1'
     C           #41       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     WRITEAFAPW607
     C                     WRITEAFAPW608
     C                     WRITEAFAPW609
     C                     WRITEAFAPW610
     C                     EXFMTAFAPW611
TCHK3C  NKCNKD   KAN06     IFNE *BLANK
TCHK3C  NKCNKD   KAN06     IFEQ KAN01
TCHK3C           KAN06     OREQ KAN02
TCHK3C           KAN06     OREQ KAN03
TCHK3C           KAN06     OREQ KAN04
TCHK3C           KAN06     OREQ KAN05
TCHK3C                     SETON                     30
TCHK3C                     GOTO #ERR
TCHK3C                     END
TCHK3C                     END
     C  NKDNKE             SETON                     42
     C*
     C                     ELSE
B04  C           *IN40     IFEQ '1'
     C           #40       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     WRITEAFAPW607
     C                     WRITEAFAPW608
     C                     WRITEAFAPW609
     C                     EXFMTAFAPW610
     C  NKDNKE             SETON                     41
     C*
     C                     ELSE
B05  C           *IN39     IFEQ '1'
     C           #39       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     WRITEAFAPW607
     C                     WRITEAFAPW608
     C                     EXFMTAFAPW609
TCHK3C  NKCNKD   KAN05     IFNE *BLANK
TCHK3C  NKCNKD   KAN05     IFEQ KAN01
TCHK3C           KAN05     OREQ KAN02
TCHK3C           KAN05     OREQ KAN03
TCHK3C           KAN05     OREQ KAN04
TCHK3C                     SETON                     30
TCHK3C                     GOTO #ERR
TCHK3C                     END
TCHK3C                     END
     C  NKDNKE             SETON                     40
     C*
     C                     ELSE
B06  C           *IN38     IFEQ '1'
     C           #38       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     WRITEAFAPW607
     C                     EXFMTAFAPW608
     C  NKDNKE             SETON                     39
     C*
     C                     ELSE
B07  C           *IN37     IFEQ '1'
     C           #37       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     WRITEAFAPW606
     C                     EXFMTAFAPW607
TCHK3C  NKCNKD   KAN04     IFNE *BLANK
TCHK3C  NKCNKD   KAN04     IFEQ KAN01
TCHK3C           KAN04     OREQ KAN02
TCHK3C           KAN04     OREQ KAN03
TCHK3C                     SETON                     30
TCHK3C                     GOTO #ERR
TCHK3C                     END
TCHK3C                     END
     C  NKDNKE             SETON                     38
     C*
     C                     ELSE
B08  C           *IN36     IFEQ '1'
     C           #36       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     WRITEAFAPW605
     C                     EXFMTAFAPW606
     C  NKDNKE             SETON                     37
     C*
     C                     ELSE
B09  C           *IN35     IFEQ '1'
     C           #35       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     WRITEAFAPW604
     C                     EXFMTAFAPW605
TCHK3C  NKCNKD   KAN03     IFNE *BLANK
TCHK3C  NKCNKD   KAN03     IFEQ KAN01
TCHK3C           KAN03     OREQ KAN02
TCHK3C                     SETON                     30
TCHK3C                     GOTO #ERR
TCHK3C                     END
TCHK3C                     END
     C  NKDNKE             SETON                     36
     C*
     C                     ELSE
B10  C           *IN34     IFEQ '1'
     C           #34       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     WRITEAFAPW603
     C                     EXFMTAFAPW604
     C  NKDNKE             SETON                     35
     C*
     C                     ELSE
B11  C           *IN33     IFEQ '1'
     C           #33       TAG
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     WRITEAFAPW602
     C                     EXFMTAFAPW603
TCHK3C  NKCNKD   KAN02     IFNE *BLANK
TCHK3C           KAN02     ANDEQKAN01
TCHK3C                     SETON                     30
TCHK3C                     GOTO #ERR
TCHK3C                     END
     C  NKDNKE             SETON                     34
     C*
     C                     ELSE
B12  C           *IN32     IFEQ '1'
     C                     WRITEAFAPW688
     C                     WRITEAFAPW601
     C                     EXFMTAFAPW602
     C  NKDNKE             SETON                     33
     C*
     C                     ELSE
B13  C           *IN31     IFEQ '1'
     C                     WRITEAFAPW688
     C                     EXFMTAFAPW601
     C  NKCNKD             EXSR @CHK11
     C   30                GOTO #ERR
     C  NKDNKE             SETON                     32
E13  C                     END
E12  C                     END
E11  C                     END
E10  C                     END
E9   C                     END
E8   C                     END
E7   C                     END
E6   C                     END
E5   C                     END
E4   C                     END
E3   C                     END
E2   C                     END
     C*
     C* F3=END
B2   C           *INKC     IFEQ '1'
     C                     CLEARKAN
     C                     CLEARLOT                         WRT
     C*
     C                     ELSE
     C* F4=PREVIOUS
B3   C           *INKD     IFEQ '1'
     C                     MOVEAWKBLK     *IN,31
     C                     SETOF                     29
     C                     CLEARKAN
     C                     CLEARLOT
     C*
     C                     ELSE
     C* F5=UPDATE
B4   C           *INKE     IFEQ '1'
     C                     EXSR @CHK2
B5   C           *IN30     IFEQ '0'
     C                     EXSR @WRT
E5   C                     END
     C*
     C                     ELSE
     C*
     C                     END
     C                     END
     C                     END
     C*
     C           #END      TAG
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK1
     C**************************************************************************
     C           @CHK1     BEGSR
      *
     C                     MOVE *BLANK    @OTH
     C                     MOVE *BLANK    @CPY
     C                     MOVE *OFF      *IN30
     C                     MOVE *OFF      *IN28
     C                     MOVE *OFF      *IN29
     C* APICS
     C                     SELEC
     C           KKBN      WHEQ '0'
     C                     SETOF                     29                DSP
     C* PLASTIC
     C           KKBN      WHEQ '1'
     C                     SETON                     29                DSP
     C*
     C           KKBN      WHEQ '2'
     C                     MOVE '1'       @OTH    1
     C           KKBN      WHEQ '3'
     C                     MOVE '1'       @CPY    1
      *
     C                     OTHER
     C                     SETON                     30
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK11
     C**************************************************************************
     C           @CHK11    BEGSR
     C*
     C                     MOVE *BLANK    ERMSG
     C                     MOVE *OFF      *IN28
      *
     C           WZET1     IFNE *BLANK
     C           WZET1     CHAINFCETL11              92
     C           *IN92     IFEQ '1'
     C                     SETON                     3028
     C                     MOVELER,4      ERMSG
     C                     ELSE
     C                     MOVELKAN01     @KANBN
     C           @ID       IFEQ 'A'
     C           @ID       OREQ 'B'
     C           KEY2      CHAINAAMPL11              92
     C           *IN92     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     SETON                     3028
     C                     MOVELER,4      ERMSG
     C                     ELSE
      *
     C                     MOVEL@PROC     @3      3
     C                     Z-ADD1         X       30
     C           @3        LOKUPPRC,X                    92
     C           *IN92     IFEQ *ON
     C                     ADD  1         X
     C                     DO   *HIVAL
     C           LOC,X     IFEQ *ALL'-'
     C                     ADD  1         X
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KK,X      IFNE 'E'
     C           KK,X      ANDNE'C'
     C                     MOVE *ON       *IN30
     C  N28                MOVE *ON       *IN28
     C                     MOVELER,5      ERMSG
     C                     ENDIF
      *
     C           KEY2      CHAINAGAPL31              92
     C           *IN92     IFEQ '0'
     C           KKBN      ANDEQ'0'
     C           CBKDAI    ANDNEKK,X
     C                     MOVE *ON       *IN30
     C  N28                MOVE *ON       *IN28
     C                     MOVELER,5      ERMSG
     C                     END
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK2
     C**************************************************************************
     C           @CHK2     BEGSR
     C*
     C* FIELD  CHECK
     C           WKAN      IFEQ *BLANK
     C           WLOT      OREQ *BLANK
     C                     SETON                     30
     C                     END
     C* SAME ZETI ?
     C                     MOVE WZET1     ZET,1
     C                     MOVE WZET2     ZET,2
     C                     MOVE WZET3     ZET,3
     C                     MOVE WZET4     ZET,4
     C                     MOVE WZET5     ZET,5
     C                     MOVE WZET6     ZET,6
     C*
     C                     Z-ADD2         J
     C           2         DO   5         J
     C           ZET,J     IFNE *BLANK
     C           ZET,1     IFNE ZET,J
     C                     SETON                     30
     C                     END
     C                     END
     C                     END
     C*
     C* DOES ZETI EXIST IN PART MASTER ?
     C           *IN30     IFEQ '0'
     C           ZET,1     CHAINFCETL11              92
     C           *IN92     IFEQ '1'
     C                     SETON                     30
     C                     END
     C                     END
     C*
     C* TEHAI NUMBER CHECK
     C                     MOVE WTEH1     TEH,1
     C                     MOVE WTEH2     TEH,2
     C                     MOVE WTEH3     TEH,3
     C                     MOVE WTEH4     TEH,4
     C                     MOVE WTEH5     TEH,5
     C                     MOVE WTEH6     TEH,6
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT
     C**************************************************************************
     C           @WRT      BEGSR
     C*
     C* GET THE NEW LOT #(APICS)
     C           KKBN      IFEQ '0'
     C                     MOVE WZET1     KEY11
     C           KEY1      CHAINAFANP651             94
     C           *IN94     IFEQ '0'
     C                     MOVE CHNLOT    WANLOT
     C*
     C* LOT# Z99 --> A01
     C           WANLOT    IFEQ 'Z99'
     C                     MOVE 'A01'     WANLOT
     C*
     C                     ELSE
     C           WNSEQ     IFEQ 99
     C                     Z-ADD1         WNSEQ
     C* GET NER ALPHBET
     C                     Z-ADD1         I
     C           WNALPH    LOKUPALP,I                    91
     C           *IN91     IFEQ '1'
     C                     ADD  1         I
     C                     MOVE ALP,I     WNALPH
     C                     END
     C*
     C                     ELSE
     C                     ADD  1         WNSEQ
     C                     END
     C*
     C                     END
     C                     MOVE WANLOT    CHNLOT
     C                     UPDATAFANP651
     C*
     C* SET THE FIRST LOT ID#
     C                     ELSE
     C                     MOVE 'A01'     WANLOT
     C                     MOVE KKBN      CHKKBN
     C                     MOVE KEY11     CHZETI
     C                     MOVE WANLOT    CHNLOT
     C                     WRITEAFANP651
     C                     END
     C                     END
     C*
     C* GET THE NEW LOT #(PLASTIC)
     C           KKBN      IFEQ '1'
     C                     MOVE WZET1     KEY11
     C           KEY1      CHAINAFANP651             94
     C           *IN94     IFEQ '0'
     C                     MOVE CHNLOT    WHNLOT
     C*
     C* LOT# Z99 --> A01
     C           WHNLOT    IFEQ '99Z'
     C                     MOVE '01A'     WHNLOT
     C*
     C                     ELSE
     C           WHSEQ     IFEQ 99
     C                     Z-ADD1         WHSEQ
     C* GET NEW ALPHBET
     C                     Z-ADD1         I
     C           WHALPH    LOKUPALP,I                    91
     C           *IN91     IFEQ '1'
     C                     ADD  1         I
     C                     MOVE ALP,I     WHALPH
     C                     END
     C*
     C                     ELSE
     C                     ADD  1         WHSEQ
     C                     END
     C*
     C                     END
     C                     MOVE WHNLOT    CHNLOT
     C                     UPDATAFANP651
     C* SET THE FIRST LOT ID#
     C                     ELSE
     C                     MOVE '01A'     WHNLOT
     C                     MOVE KKBN      CHKKBN
     C                     MOVE KEY11     CHZETI
     C                     MOVE WHNLOT    CHNLOT
     C                     WRITEAFANP651
     C                     END
     C                     END
     C*
     C                     CLEARAFAPP601
     C                     Z-ADDWSYYYY    AAKOYY           UPDATE YEAR
     C                     Z-ADDWSMM      AAKOMM                  MONTH
     C                     Z-ADDWSDD      AAKODD                  DAY
     C                     Z-ADDWSHH      AAKOHH                  HOUR
     C                     Z-ADDWSSS      AAKOSS                  MINUTE
     C                     MOVELPUSR      AAKOME                  USER-ID
     C*
     C                     Z-ADDWSYYYY    AAYYYY           SYSTEM DATE
     C                     Z-ADDWSMM      AAMMMM           SYSTEM DATE
     C                     Z-ADDWSDD      AADDDD           SYSTEM DATE
     C                     Z-ADD99        AABIN            BIN
     C* KANBAN CODE
     C*          KKBN      IFEQ *BLANK
     C*                    MOVE 'C'       AAKCD            A-PICS
     C*                    ELSE
     C*                    MOVE 'E'       AAKCD            BZ KANBAN
     C*                    END
     C*
     C* KANBAN CODE
     C* (APICS)
     C           KKBN      IFEQ '0'
     C           KEY2      CHAINAGAPL31              93
     C           *IN93     IFEQ '0'
     C                     MOVE CBKDAI    AAKCD
     C*
     C                     ELSE
     C                     MOVE *BLANK    AAKCD
     C                     END
     C                     MOVE WANLOT    AANLOT           NEW LOT #
     C                     END
     C*
     C* (PLASTIC)
     C           KKBN      IFEQ '1'
     C           KEY2      SETGTAAFTL01
     C           #READ1    TAG
     C           KEY2      REDPEAAFTL01                  95
     C           *IN95     IFEQ '0'
     C           A3STYY    IFEQ 9999
     C                     MOVE A3KCD1    AAKCD
     C*
     C                     ELSE
     C                     GOTO #READ1
     C                     END
     C*
     C                     ELSE
     C                     MOVE *BLANK    AAKCD
     C                     END
     C                     MOVE WHNLOT    AANLOT           NEW LOT #
     C                     END
     C*
     C                     MOVE WAKAN1    AAKAN1           KANBAN1
     C                     MOVE WAKAN2    AAKAN2           KANBAN2
     C                     MOVE WAKAN3    AAKAN3           KANBAN3
     C                     MOVE WAKAN4    AAKAN4           KANBAN4
     C                     MOVE WAKAN5    AAKAN5           KANBAN5
     C                     MOVE WAKAN6    AAKAN6           KANBAN6
     C*
     C                     MOVE WALOT1    AALOT1           LOT1
     C                     MOVE WALOT2    AALOT2           LOT2
     C                     MOVE WALOT3    AALOT3           LOT3
     C                     MOVE WALOT4    AALOT4           LOT4
     C                     MOVE WALOT5    AALOT5           LOT5
     C                     MOVE WALOT6    AALOT6           LOT6
     C*
     C                     MOVE W2PART    AAPART           PART
     C                     MOVEAZET,1     AAZETI           ZETI
     C                     MOVE KKBN      AAAPFG           APICS/PLASTIC
     C           @OTH      IFEQ '1'
     C                     Z-ADDCOPY      AACOPY
     C                     ELSE
     C                     Z-ADD1         AACOPY
     C                     ENDIF
      *
     C                     WRITEAFAPP601
     C*
     C                     CLEARKAN
     C                     CLEARLOT
     C                     MOVEAWKBLK     *IN,31
     C                     SETON                     31
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT
     C**************************************************************************
     C           @WRTX     BEGSR
     C*
     C                     CLEARAFAPP601
     C           K#AH11    CHAINAFAPP60              92
     C           *IN92     IFEQ *ON
     C                     MOVE @THI      AANLOT           NEW LOT #
     C                     ELSE
     C* GET THE NEW LOT #(APICS)
     C                     MOVE '0'       K@KBN
     C                     MOVE ZET,1     KEY11
     C           KEY1X     CHAINAFANP651             94
     C           *IN94     IFEQ '0'
     C                     MOVE CHNLOT    WANLOT
     C*
     C* LOT# Z99 --> A01
     C           WANLOT    IFEQ 'Z99'
     C                     MOVE 'A01'     WANLOT
     C*
     C                     ELSE
     C           WNSEQ     IFEQ 99
     C                     Z-ADD1         WNSEQ
     C* GET NER ALPHBET
     C                     Z-ADD1         I
     C           WNALPH    LOKUPALP,I                    91
     C           *IN91     IFEQ '1'
     C                     ADD  1         I
     C                     MOVE ALP,I     WNALPH
     C                     END
     C*
     C                     ELSE
     C                     ADD  1         WNSEQ
     C                     END
     C*
     C                     END
     C                     MOVE WANLOT    CHNLOT
     C                     UPDATAFANP651
     C*
     C* SET THE FIRST LOT ID#
     C                     ELSE
     C                     MOVE 'A01'     WANLOT
     C                     MOVE KKBN      CHKKBN
     C                     MOVE KEY11     CHZETI
     C                     MOVE WANLOT    CHNLOT
     C                     WRITEAFANP651
     C                     END
      *
     C                     CLEARAFAPP601
     C                     MOVE WANLOT    AANLOT           NEW LOT #
     C                     ENDIF
     C*
     C                     Z-ADDWSYYYY    AAKOYY           UPDATE YEAR
     C                     Z-ADDWSMM      AAKOMM                  MONTH
     C                     Z-ADDWSDD      AAKODD                  DAY
     C                     Z-ADDWSHH      AAKOHH                  HOUR
     C                     Z-ADDWSSS      AAKOSS                  MINUTE
     C                     MOVELPUSR      AAKOME                  USER-ID
     C                     MOVE '1'       AAUPFG
     C*
     C                     Z-ADDWSYYYY    AAYYYY           SYSTEM DATE
     C                     Z-ADDWSMM      AAMMMM           SYSTEM DATE
     C                     Z-ADDWSDD      AADDDD           SYSTEM DATE
     C                     Z-ADD99        AABIN            BIN
     C* KANBAN CODE
     C* (APICS)
     C           KEY2      CHAINAGAPL31              93
     C           *IN93     IFEQ '0'
     C                     MOVE CBKDAI    AAKCD
     C*
     C                     ELSE
     C                     MOVE *BLANK    AAKCD
     C                     END
     C*
     C*********            MOVE @THI      AANLOT           NEW LOT #
     C*
     C                     MOVE WAKAN1    AAKAN1           KANBAN1
     C                     MOVE WAKAN2    AAKAN2           KANBAN2
     C                     MOVE WAKAN3    AAKAN3           KANBAN3
     C                     MOVE WAKAN4    AAKAN4           KANBAN4
     C                     MOVE WAKAN5    AAKAN5           KANBAN5
     C                     MOVE WAKAN6    AAKAN6           KANBAN6
     C*
     C                     MOVE WALOT1    AALOT1           LOT1
     C                     MOVE WALOT2    AALOT2           LOT2
     C                     MOVE WALOT3    AALOT3           LOT3
     C                     MOVE WALOT4    AALOT4           LOT4
     C                     MOVE WALOT5    AALOT5           LOT5
     C                     MOVE WALOT6    AALOT6           LOT6
     C*
     C                     MOVE W2PART    AAPART           PART
     C                     MOVEAZET,1     AAZETI           ZETI
     C                     MOVE '0'       AAAPFG           APICS/PLASTIC
     C                     Z-ADDCOPY      AACOPY
      *
     C                     WRITEAFAPP601
     C           K#AH11    CHAINAH#PL11              92
     C           *IN92     IFEQ *OFF
     C                     ADD  COPY      CFMAIS
     C                     Z-ADD*YEAR     CFKOYY
     C                     Z-ADD*MONTH    CFKOMM
     C                     Z-ADD*DAY      CFKODD
     C                     Z-ADDWSHH      CFKOHH                  HOUR
     C                     Z-ADDWSSS      CFKOSS                  MINUTE
     C                     MOVELPUSR      CFKOME
     C                     UPDATAH#PL111
     C                     ENDIF
     C*
     C                     CLEARKAN
     C                     CLEARLOT
     C                     MOVEAWKBLK     *IN,31
     C                     SETON                     31
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @END
     C**************************************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C**************************************************************************
      * OTHERS
     C**************************************************************************
     C           #OTH      BEGSR
      *
     C           *INKC     DOWEQ*OFF
     C                     WRITEAFAPW688
     C                     EXFMTAFAPW620
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C           *INKD     OREQ *ON
     C                     MOVE '2'       KKBN
     C                     LEAVE
      *
     C           *INKE     WHEQ *ON
     C                     EXSR #OCHK
     C           *IN30     IFEQ *OFF
     C                     EXSR @WRT
     C                     CLEARAFAPW620
     C                     MOVEA'01111111'*IN,1
     C                     MOVEA'11'      *IN,9
     C                     ENDIF
      *
     C                     OTHER
     C                     EXSR #OCHK
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
     C**************************************************************************
      * CHECK
     C**************************************************************************
     C           #OCHK     BEGSR
      *
     C                     MOVE *OFF      *IN30
     C                     MOVEA'000'     *IN,81
     C                     MOVE *BLANK    ERMSG
      *
     C                     SELEC
     C           *IN01     WHEQ *OFF
     C           COPY      IFEQ 0
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN81
     C                     MOVELER,3      ERMSG
     C                     ELSE
     C                     MOVEA'10111111'*IN,1
     C                     MOVEA'01'      *IN,9
     C                     ENDIF
      *
     C           *IN02     WHEQ *OFF
     C                     MOVELKAN01     @KANBN
     C           @ID       IFNE 'A'
     C           @ID       ANDNE'B'
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN82
     C                     MOVELER,1      ERMSG
     C                     ENDIF
      *
     C           @ZETI     CHAINFCETL11              92
     C           *IN92     IFEQ '1'
     C                     SETON                     3082
     C                     MOVELER,4      ERMSG
     C                     ELSE
     C                     MOVE *BLANK    ZET
     C                     MOVE @ZETI     ZET,1
     C           KEY2      CHAINAAMPL11              92
     C           *IN92     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     SETON                     3082
     C                     MOVELER,4      ERMSG
     C                     ELSE
     C                     MOVEL@PROC     @3      3
     C                     Z-ADD1         X       30
     C           @3        LOKUPPRC,X                    92
     C           *IN92     IFEQ *OFF
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN82
     C                     MOVELER,2      ERMSG
     C                     ELSE
     C                     ADD  1         X
     C                     DO   *HIVAL
     C           LOC,X     IFEQ *ALL'-'
     C                     ADD  1         X
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           KK,X      IFNE 'C'
     C           KK,X      ANDNE'E'
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN82
     C                     MOVELER,5      ERMSG
     C                     ENDIF
      *
     C           KEY2      CHAINAGAPL31              92
     C           *IN92     IFEQ '0'
     C           CBKDAI    IFEQ KK,X
     C                     MOVE '0'       KKBN
     C                     ELSE
     C                     MOVE '1'       KKBN
     C                     ENDIF
TCHK2C                     ELSE
TCHK2C                     MOVELLOC,X     W@LOC
TCHK2C           W@LC21    IFEQ 'G'
TCHK2C                     MOVE '1'       KKBN
TCHK2C                     END
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           *IN30     IFEQ *OFF
     C                     MOVEA'11011111'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDIF
      *
     C           *IN03     WHEQ *OFF
     C           LOT01     IFEQ *BLANK
     C                     SETON                     8330
     C                     ELSE
     C                     MOVEA'11101111'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDIF
      *
     C           *IN04     WHEQ *OFF
     C           LOT02     ANDNE*BLANK
     C                     MOVEA'11110111'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN05     WHEQ *OFF
     C           LOT03     ANDNE*BLANK
     C                     MOVEA'11111011'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN06     WHEQ *OFF
     C           LOT04     ANDNE*BLANK
     C                     MOVEA'11111101'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN07     WHEQ *OFF
     C           LOT05     ANDNE*BLANK
     C                     MOVEA'11111110'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
      * COPY
     C**************************************************************************
     C           #CPY      BEGSR
      *
     C           *INKC     DOWEQ*OFF
     C                     WRITEAFAPW688
     C                     EXFMTAFAPW621
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C           *INKD     OREQ *ON
     C                     MOVE '3'       KKBN
     C                     LEAVE
      *
     C           *INKE     WHEQ *ON
     C                     EXSR #PCHK
     C           *IN30     IFEQ *OFF
     C                     EXSR @WRTX
     C                     CLEARAFAPW621
     C                     MOVEA'01111111'*IN,1
     C                     MOVEA'11'      *IN,9
     C                     ENDIF
      *
     C                     OTHER
     C                     EXSR #PCHK
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
     C**************************************************************************
      * CHECK
     C**************************************************************************
     C           #PCHK     BEGSR
      *
     C                     MOVE *OFF      *IN30
     C                     MOVEA'000'     *IN,81
     C                     MOVE *BLANK    ERMSG
      *
     C                     SELEC
     C           *IN01     WHEQ *OFF
     C           COPY      IFEQ 0
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN81
     C                     MOVELER,3      ERMSG
     C                     ELSE
     C                     MOVEA'10111111'*IN,1
     C                     MOVEA'01'      *IN,9
     C                     ENDIF
      *
     C           *IN02     WHEQ *OFF
     C                     MOVELKAN01     @KANBN
     C           @KK       IFLT '0'
     C           @KK       ORGT '9'
     C           K#AH11    CHAINAH#PL11             N92
     C           *IN92     IFEQ *ON
     C           K#AH11    CHAINAFAPP60              92
     C           *IN92     IFEQ *ON
     C                     MOVE *ON       *IN30
     C                     MOVE *ON       *IN82
     C                     MOVELER,1      ERMSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           @ZETI     CHAINFCETL11              92
     C           *IN92     IFEQ '1'
     C                     SETON                     3082
     C                     MOVELER,4      ERMSG
     C                     ELSE
     C                     MOVE *BLANK    ZET
     C                     MOVE @ZETI     ZET,1
     C                     MOVE '0'       KKBN
      *
     C                     ENDIF
      *
     C           *IN30     IFEQ *OFF
     C                     MOVEA'11011111'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDIF
      *
     C           *IN03     WHEQ *OFF
     C           LOT01     IFEQ *BLANK
     C                     SETON                     8330
     C                     ELSE
     C                     MOVEA'11101111'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDIF
      *
     C           *IN04     WHEQ *OFF
     C           LOT02     ANDNE*BLANK
     C                     MOVEA'11110111'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN05     WHEQ *OFF
     C           LOT03     ANDNE*BLANK
     C                     MOVEA'11111011'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN06     WHEQ *OFF
     C           LOT04     ANDNE*BLANK
     C                     MOVEA'11111101'*IN,1
     C                     MOVEA'00'      *IN,9
      *
     C           *IN07     WHEQ *OFF
     C           LOT05     ANDNE*BLANK
     C                     MOVEA'11111110'*IN,1
     C                     MOVEA'00'      *IN,9
     C                     ENDSL
      *
     C                     ENDSR
TCHK1C*ABCDEFGHIJKLMNOPQRSTUVWSYZ
**
ABCDEFGHIJKLMNOPQRSTUVWXYZ
**
KANBAN IS WRONG
PROCESS ERROR
ENTER # OF COPY
PARTS ERROR
NEXT PROC ERROR
