     H            Y.                                    1
      ** AFBR90 **************************************************
      *  COMPONENTS PARTS SCAN DATA SUMMARIZE PROCESS            *
      *  <LOCAL PROCURMENT SYSTEM>                               *
      *  A.MAMIYA  2000.11.28                                    *
      *---------------------------------------                   *
      * TCHK1 09/18/11 ADD LOT SIZE                              *
JW1   * JW    2022.03.03 ADD SEKIDO (3111)                       *
JW2   * JW    2023.08.02 ADD ART METALS (2626)                   *
      ************************************************************
     FAFBPW90 CF  E                    WORKSTN
     FFGBPL01 IF  E           K        DISK
     FAKBPL05 IF  E           K        DISK
     FAFBPL80 UF  E           K        DISK
     FAFBPL90 UF  E           K        DISK                      A
     FAFBNP90 UF  E           K        DISK                      A
     E                    ER      1   3 60
     I            DS
     I                                        1   80B8SKHZ
     I                                        1   40B8SKYY
     I                                        5   60B8SKMM
     I                                        7   80B8SKDD
     I            DS
     I                                        1   80B8KOHZ
     I                                        1   40B8KOYY
     I                                        5   60B8KOMM
     I                                        7   80B8KODD
     I            DS
     I                                        1   60B8KOTI
     I                                        1   20B8KOHH
     I                                        3   40B8KOSS
     I            DS
     I                                        1   80B8SUHZ
     I                                        1   40B8SUYY
     I                                        5   60B8SUMM
     I                                        7   80B8SUDD
     I            DS
     I                                        1   80B9SKHZ
     I                                        1   40B9SKYY
     I                                        5   60B9SKMM
     I                                        7   80B9SKDD
     I            DS
     I                                        1   80B9KOHZ
     I                                        1   40B9KOYY
     I                                        5   60B9KOMM
     I                                        7   80B9KODD
     I            DS
     I                                        1   80B9ODHZ
     I                                        1   40B9ODYY
     I                                        5   60B9ODMM
     I                                        7   80B9ODDD
     I            DS
     I                                        1   80B9NYHZ
     I                                        1   40B9NYYY
     I                                        5   60B9NYMM
     I                                        7   80B9NYDD
     I            DS
     I                                        1   80B9NOHZ
     I                                        1   40B9NOYY
     I                                        5   60B9NOMM
     I                                        7   80B9NODD
     I            DS
     I                                        1   80B9KNHZ
     I                                        1   40B9KNYY
     I                                        5   60B9KNMM
     I                                        7   80B9KNDD
     I            DS
     I                                        1   60B9KOTI
     I                                        1   20B9KOHH
     I                                        3   40B9KOSS
     I            DS
     I                                        1   9 B9ERR
     I                                        1   1 B9ERR1
     I                                        2   2 B9ERR2
     I                                        3   3 B9ERR3
     I                                        4   4 B9ERR4
     I                                        5   5 B9ERR5
     I                                        6   6 B9ERR6
     I                                        7   7 B9ERR7
     I                                        8   8 B9ERR8
     I                                        9   9 B9ERR9
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80L1SKHZ
     I                                        1   40L1SKYY
     I                                        5   60L1SKMM
     I                                        7   80L1SKDD
     I            DS
     I                                        1   80L1UKHZ
     I                                        1   40L1UKYY
     I                                        5   60L1UKMM
     I                                        7   80L1UKDD
     I            DS
     I                                        1   80L1STHZ
     I                                        1   40L1STYY
     I                                        5   60L1STMM
     I                                        7   80L1STDD
     I            DS
     I                                        1   80KDATE
     I                                        1   60KYYMM
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           USER   10
      *-----*
      * KEY *
      *-----*
     C           KEY1      KLIST
     C                     KFLD           B8SUPP
     C                     KFLD           B8PAR1
     C                     KFLD           B8PAR2
     C                     KFLD           B8PAR3
     C                     KFLD           B8ZETI
     C*
     C           KEY2      KLIST
     C                     KFLD           B8PAR1
     C                     KFLD           B8PAR2
     C                     KFLD           B8PAR3
      *
     C                     MOVE *BLANK    ISIRE
     C                     MOVE *BLANK    WDATA   1
     C                     Z-ADD*DATE     KDATE
      *----------*
      * SCREEN 1 *
      *----------*
     C           @STP1     TAG
     C                     EXFMTAFBPW901
     C                     SETOF                     0199
      *----------*
      * F1: EXIT
      *----------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
      *
     C           ISIRE     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO @STP1
     C                     END
      *
     C                     Z-ADD0         OSIRE   40
     C                     MOVELISIRE     OSIRE
      *
     C                     SETOF                     20
     C           OSIRE     CHAINFGBPL011             20
      *
     C           *IN20     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C                     END
      *
     C           *IN20     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,2      MSG
     C                     GOTO @STP1
     C                     END
      *------------*
      * F5: UPDATE
      *------------*
     C           *INKE     IFEQ '0'
     C                     GOTO @STP1
     C                     END
      *
     C                     SETOF                     20
     C           ISIRE     SETLLAFBPL801
     C                     DO   *HIVAL
     C           ISIRE     READEAFBPL801                 20
     C           *IN20     IFEQ '0'
     C           B8SKJY    IFEQ 'D'
     C           B8SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'*'       WDATA
     C                     SETOF                     21
     C           KEY1      SETGTAFBPL901
     C           KEY1      REDPEAFBPL901                 21
     C           *IN21     IFEQ '0'
     C           B9ODNO    ANDEQ0
     C                     MOVEL*BLANK    B9SKJY
     C                     Z-ADD0         B9SKHZ
     C                     Z-ADD*DATE     B9KOHZ
     C                     TIME           B9KOTI
     C                     MOVELUSER      B9KOME
     C                     MOVEL'AFBR90'  B9KOPG
TCHK1C*                    ADD  1         B9HAKO
TCHK1C                     ADD  B8ROTO    B9HAKO
     C                     UPDATAFBPL901
     C                     ELSE
     C                     EXSR #CHEK
     C                     EXSR #SB999
     C                     MOVEL*BLANK    B9SKJY
     C                     Z-ADD0         B9SKHZ
     C                     Z-ADD*DATE     B9KOHZ
     C                     TIME           B9KOTI
     C                     MOVELUSER      B9KOME
     C                     MOVEL'AFBR90'  B9KOPG
     C                     MOVELB8ZETI    B9ZETI
     C                     MOVELB8PAR1    B9PAR1
     C                     MOVELB8PAR2    B9PAR2
     C                     MOVELB8PAR3    B9PAR3
TCHK1C*                    Z-ADD1         B9HAKO
TCHK1C                     Z-ADDB8ROTO    B9HAKO
TCHK1C                     Z-ADDB8ROTO    B9ROTO
     C                     Z-ADDB8SYOS    B9SYOS
     C                     MOVEL'A'       B9ORCD
     C                     MOVELB8SUPP    B9SUPP
     C                     Z-ADD0         B9ODNO
     C                     Z-ADD0         B9ODHZ
     C                     Z-ADD0         B9ODBB
     C                     Z-ADD0         B9NYHZ
     C                     Z-ADD0         B9NOSU
     C                     Z-ADD0         B9NOHZ
     C                     Z-ADD0         B9KNHZ
     C                     MOVEL*DATE     B9DATE
     C                     WRITEAFBPL901
     C                     END
     C                     MOVEL*BLANK    B8SKJY
     C                     Z-ADD0         B8SKHZ
     C                     Z-ADD*DATE     B8KOHZ
     C                     TIME           B8KOTI
     C                     MOVELUSER      B8KOME
     C                     MOVEL'AFBR90'  B8KOPG
     C                     Z-ADD*DATE     B8SUHZ
     C                     UPDATAFBPL801
     C                     END
     C                     END
     C  N20                ENDDO
      *
     C           WDATA     IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO @STP1
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
     C*****************************************************************
     C* B9ERR1: INVALID PART#
     C* B9ERR1: INVALID SUPPLIER CODE
     C*****************************************************************
     C           #CHEK     BEGSR
     C                     MOVEL*BLANK    B9ERR
     C                     MOVE B8SUPP    KSUPP   40
     C* CHECK COMPONENT PARTS MASTER
     C                     SETOF                     31
     C           KEY2      SETLLAKBPL051
     C                     DO   *HIVAL
     C           KEY2      READEAKBPL051                 31
     C           *IN31     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDNE*DATE
     C                     ELSE
     C           *DATE     IFGE L1UKHZ
     C           *DATE     ANDLEL1STHZ
     C           L1BMON    IFNE KSUPP
     C* INVALID SUPPLIER
     C                     MOVEL'*'       B9ERR2
     C                     END
     C                     GOTO ECHEK
     C                     END
     C                     END
     C                     END
     C  N31                ENDDO
     C* INVALID PART#
     C                     MOVEL'*'       B9ERR1
     C*
     C           ECHEK     ENDSR
      *----------------------------------------------------*
      * GET RECORD NUMBER                                  *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
     C                     SETOF                       25
     C           KYYMM     CHAINAFBNP901             25
     C           *IN25     IFEQ '1'
     C                     MOVE KYYMM     BZYYMM
     C                     Z-ADD1         BZNO
     C                     Z-ADDBZNO      B9RENO  50
     C                     WRITEAFBNP901
     C                     ELSE
     C                     ADD  1         BZNO
     C                     Z-ADDBZNO      B9RENO
     C                     UPDATAFBNP901
     C                     END
     CSR         ESB999    ENDSR
** ER(60A) ........2.........3.........4.........5.........6
E-01 ENTER SUPPLIER !
E-02 SUPPLIER DOES NOT EXIST IN SUPPLIER MASTER !
E-03 NO ORDER DATA FOUND !
