     H            Y.                                    1
      ** AFCR05 *****************************
      *  MATERIAL ORDER DATA UPDATE SYSTEM  *
      *
      ***************************** AFCR05 **
     FAFCPW05 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAFCPL80 UF  E           K        DISK                      A
     FAFCPL84 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FIZAPL01 IF  E           K        DISK
     FAFCNP80 UF  E           K        DISK                      A
     E                    ER      1  15 59
     E                    UP1     1   3  1   UP2    10
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  120WTMDT
     I                                        1   20WHHHH
     I                                        3   40WSSSS
     I                                        7   80WYYYY
     I                                        9  100WMMMM
     I                                       11  120WDDDD
     I            DS
     I                                        1   80C8SKHZ
     I                                        1   40C8SKYY
     I                                        5   60C8SKMM
     I                                        7   80C8SKDD
     I            DS
     I                                        1   80C8KOHZ
     I                                        1   40C8KOYY
     I                                        5   60C8KOMM
     I                                        7   80C8KODD
     I            DS
     I                                        1   60C8KOTI
     I                                        1   20C8KOHH
     I                                        3   40C8KOSS
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80ZCSKHZ
     I                                        1   40ZCSKYY
     I                                        5   60ZCSKMM
     I                                        7   80ZCSKDD
     I            DS
     I                                        1   80ZDSKHZ
     I                                        1   40ZDSKYY
     I                                        5   60ZDSKMM
     I                                        7   80ZDSKDD
     I            DS
     I                                        1   80ZCUKHZ
     I                                        1   40ZCUKYY
     I                                        5   60ZCUKMM
     I                                        7   80ZCUKDD
     I            DS
     I                                        1   80ZCSTHZ
     I                                        1   40ZCSTYY
     I                                        5   60ZCSTMM
     I                                        7   80ZCSTDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1   60KEY5
     I                                        1   40K51
     I                                        5   60K52
      *------*
      * PARM *
      *------*
      *-------------*
      * KEY1 - KEY3 *
      *-------------*
     C           KEY1      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           XZAIS  15
     C                     KFLD           XZAIK   52
      *
     C           KEY2      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           ZZAIS  15
     C                     KFLD           ZZAIK   52
      *
     C           KEY3      KLIST
     C                     KFLD           IZAIS  15
     C                     KFLD           IZAIK   52
     C                     KFLD           IKOJE   40
     C                     KFLD           ISIRE   40
      *
     C           KEY4      KLIST
     C                     KFLD           ISIRE   40
     C                     KFLD           IPTCD
     C                     KFLD           ZETI
      *
     C           *LIKE     DEFN C8ZAIS    WWZAIS
     C           *LIKE     DEFN C8ZAIK    WWZAIK
     C           *LIKE     DEFN IMAIS     WWMAIS
     C           *LIKE     DEFN ZCTKJR    WWTKJR
     C                     TIME           WTMDT
     C                     Z-ADD2000      K51
     C                     ADD  WYYYY     K51
     C                     Z-ADDWMMMM     K52
      *----------*
      * SCREEN 1 *
      *----------*
     C           STPA      TAG
     C           PSIRE     IFEQ *BLANK
     C                     MOVE '4511'    PSIRE
     C                     ENDIF
      *
     C           STP0      TAG
     C                     EXFMTDSP01
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           PSIRE     IFEQ *BLANK
     C                     MOVELER,9      MSG
     C                     SETON                     99
     C                     GOTO STP0
     C                     END
      *
     C                     MOVEL'0111'    IKOJE   40
     C                     MOVELPSIRE     ISIRE   40
      *
     C                     SETOF                     05
     C           ISIRE     CHAINFGBPL011             05
      *
     C           *IN05     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     05
     C                     END
     C                     END
      *
     C           *IN05     IFEQ '1'
     C                     SETON                     0199
     C                     MOVELER,13     MSG
     C                     GOTO STP0
     C                     END
      *-----------*
      * INZ FIELD *
      *-----------*
     C           STP1      TAG
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVE *BLANK    WWZAIS
     C                     Z-ADD*ZERO     WWZAIK
     C                     CLEARSFL01
      *
     C           ISIRE     SETLLAFCPL84
     C           *IN10     DOUEQ*ON
     C           ISIRE     READEAFCPL84             N    10
     C           *IN10     IFEQ '0'
     C           C8SKJY    IFEQ 'D'
     C           C8SKHZ    ANDLE*DATE
     C                     ITER
     C                     ELSE
     C           WWZAIS    IFNE *BLANK
     C           WWZAIS    IFNE C8ZAIS
     C           WWZAIK    ORNE C8ZAIK
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     CLEARSFL01
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELC8ZAIS    ZS01
     C                     Z-ADDC8ZAIK    ZK01
     C                     ADD  1         MS01
     C                     MOVE C8ZAIS    WWZAIS
     C                     Z-ADDC8ZAIK    WWZAIK
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           MS01      IFNE *ZERO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     CLEARSFL01
     C                     ENDIF
      *
     C           RRN1      IFEQ *ZERO
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *----------*
      * SCREEN 2 *
      *----------*
     C           STP4      TAG
     C                     MOVE *BLANK    IUPDT
     C                     MOVE *BLANK    IZAIS
     C                     Z-ADD0         IZAIK
     C                     MOVE 'W'       IPTCD
     C                     Z-ADD0         IMAIS
     C           STP2      TAG
     C                     WRITEDSP02
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SETOF                     010203
     C                     SETOF                     049970
      *-------*
      * CMD-1 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STPA
     C                     END
      *------------*
      * RENEW CODE *
      *------------*
     C                     SETOF                     25
     C                     Z-ADD1         X       20
     C           IUPDT     LOKUPUP1,X                    25
     C           *IN25     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,5      MSG
     C                     GOTO STP2
     C                     END
     C   25                MOVELUP2,X     OUPDT
      *
     C           IUPDT     IFEQ '0'
     C                     SETON                     70
     C                     END
      *----------------------*
      * WIRE / WIRE DIAMETER *
      *----------------------*
     C           IZAIS     IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVELER,10     MSG
     C                     GOTO STP2
     C                     END
      *
     C           IZAIK     IFEQ 0
     C                     SETON                     0399
     C                     MOVELER,11     MSG
     C                     GOTO STP2
     C                     END
      *
     C           IPTCD     IFNE 'W'
     C           IPTCD     ANDNE'R'
     C                     SETON                     0499
     C                     MOVELER,12     MSG
     C                     GOTO STP2
     C                     END
      *
      *-------------*
      * WIRE KANBAN *
      *-------------*
     C                     MOVE *BLANK    ZETI    4
     C           IPTCD     IFEQ 'W'
     C                     SETOF                     20
     C           KEY3      SETGTIZAPL01
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY3      REDPEIZAPL011                 10
      *
     C           *IN10     IFEQ '0'
     C           ZCSKJY    IFEQ 'D'
     C           ZCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELZCKNO3    ZETI
     C                     Z-ADDZCTKJR    WWTKJR
     C           ZCUKHZ    IFLE *DATE
     C           ZCSTHZ    ANDGT*DATE
     C                     SETON                     20
     C                     END
     C                     LEAVE
      *
     C                     END
     C                     END
     C  N10                ENDDO
      *
     C           *IN20     IFEQ '0'
     C           IUPDT     ANDNE'0'
     C                     SETON                     010203
     C                     SETON                     0499
     C                     MOVELER,3      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *------------*
      *
     C                     Z-ADD*ZERO     IMAIS
     C           KEY4      SETLLAFCPL80
     C           *IN30     DOUEQ*ON
     C           KEY4      READEAFCPL80             N    30
     C           *IN30     IFEQ *OFF
     C           C8SKJY    IFEQ 'D'
     C           C8SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         IMAIS
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDIMAIS     WWMAIS
      *
     C           IMAIS     IFEQ *ZERO
     C           IUPDT     IFEQ '0'
     C           IUPDT     ANDEQ'1'
     C                     SETON                     020399
     C                     MOVELER,6      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           IMAIS     IFGT *ZERO
     C           IUPDT     IFEQ '2'
     C                     SETON                     020399
     C                     MOVELER,8      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C                     GOTO STP3
      *
      *----------*
      * SCREEN 3 *
      *----------*
     C           STP3      TAG
     C                     EXFMTGDLPW053
     C                     SETOF                     0199
      *-------*
      * CMD-3 *
      *-------*
     C           *INKC     IFEQ '1'
     C                     GOTO STP4
     C                     END
      *
     C           IMAIS     IFEQ 0
     C                     SETON                     0199
     C                     MOVELER,14     MSG
     C                     GOTO STP3
     C                     END
      *-------*
      * CMD-5 *
      *-------*
     C           *INKE     IFEQ '0'
     C                     GOTO STP3
     C                     END
      * DELETE
     C           IUPDT     IFEQ '0'
     C           KEY4      SETLLAFCPL80
     C           *IN30     DOUEQ*ON
     C           KEY4      READEAFCPL80                  30
     C           *IN30     IFEQ *OFF
     C           C8SKJY    IFEQ 'D'
     C           C8SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
      *
     C                     TIME           C8KOTI
     C                     Z-ADD*DATE     C8KOHZ
     C                     MOVEL#USER     C8KOME
     C                     MOVE 'D'       C8SKJY
     C                     Z-ADD*DATE     C8SKHZ
     C                     UPDATAFCPL801
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      * UPDATE
     C           WWMAIS    IFGT IMAIS
     C           WWMAIS    SUB  IMAIS     Q       30
     C                     ELSE
     C           IMAIS     SUB  WWMAIS    Q
     C                     ENDIF
      *
     C           IUPDT     IFEQ '2'
     C                     Z-ADDIMAIS     Q
     C                     ENDIF
      *
     C           IUPDT     IFEQ '1'
     C           WWMAIS    ANDGTIMAIS
      *
     C           KEY4      SETLLAFCPL80
     C           *IN30     DOUEQ*ON
     C           KEY4      READEAFCPL80                  30
     C           *IN30     IFEQ *OFF
     C           C8SKJY    IFEQ 'D'
     C           C8SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
      *
     C                     TIME           C8KOTI
     C                     Z-ADD*DATE     C8KOHZ
     C                     MOVEL#USER     C8KOME
     C                     MOVE 'D'       C8SKJY
     C                     Z-ADD*DATE     C8SKHZ
     C                     UPDATAFCPL801
     C                     SUB  1         Q
     C           Q         IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
      *
     C           IUPDT     IFEQ '1'
     C           IMAIS     ANDGTWWMAIS
     C           IUPDT     OREQ '2'
      ****
     C                     DO   Q
     C                     CLEARAFCPL801
     C                     Z-ADD*DATE     C8KOHZ
     C                     TIME           C8KOTI
     C                     MOVEL#USER     C8KOME
     C                     MOVEL#PGM      C8KOPG
     C                     MOVELISIRE     C8KAKE
     C                     MOVELIZAIS     C8ZAIS
     C                     Z-ADDIZAIK     C8ZAIK
     C                     MOVELIPTCD     C8KANR
     C                     MOVELZETI      C8ZETI
     C                     Z-ADDWWTKJR    C8TKJR
     C                     Z-ADD*DATE     C8DATE
     C* GET CREATE NUMBER
     C           KEY5      CHAINAFCNP801             93
     C           *IN93     IFEQ '0'
     C                     ADD  1         CXNO
     C                     UPDATAFCNP801
     C*
     C                     ELSE
     C                     Z-ADDKEY5      CXYYMM
     C                     Z-ADD1         CXNO
     C                     WRITEAFCNP801
     C                     END
     C                     Z-ADDCXNO      C8RENO
     C                     WRITEAFCPL801
     C                     ENDDO
     C                     ENDIF
      *
     C                     GOTO STP1
** MSG
E-01 THIS PAGE IS DISPLAYED THE DATA OF TOP PAGE.
E-02 THIS PAGE IS DISPLAYED THR DATA OF BOTTOM PAGE.
E-03 THIS DATA IS NOT IN WIRE KANBAN MASTER FILE.
E-04 THIS DATA IS NOT IN ROD KANBAN MASTER FILE.
E-05 INPUT CODE IS DIFFERENT.
E-06 THIS DATA IS NOT IN ORDER TEMPORARY FILE.
E-07 THIS DATA ALREADY HAS BEEN DELETED.
E-08 THIS DATA ALREADY HAS BEEN INPUT.
E-09 INPUT SUPPLIER CODE.
E-10 INPUT WIRE DATA.
E-11 INPUT WIRE DIAMETER DATA.
E-12 INPUT PARTS CDOE IS DIFFERENT.
E-13 THIS IS NOT IN  DETAIL MASTER FILE.
E-14 INPUT NUMBER OF KANBAN.
** UP1/UP2
00-DELETE
11-CHANGE
22-ADDITION
