     H            Y.                                    1
     H** AFDR03 *******************************************************
     H* OUT GOING ORDER CREATE                                        *
     H*                                                               *
     H* TCH DEC/12/01
     H* TCHK1 07/24/07 CHG DATE OPERATION
     H* TCHK2 12/10/08 ADD PTC(2424)
     H* TCHK3 02/26/09 ADD PTC(2929)
     H* TCHK4 09/30/09 CHG BUG FIX
     H* TCHK5 03/11/10 ADD SWD(2828) & TALMA(3333)
     H* TCHK6 05/13/10 ADD SEKIDO(3111),SRA(3222),VICO(3444)
     H* TCHK7 03/10/11 ADD FCO(2112)
     H* TCHK8 01/27/12 ADD ROCKFORD SECONDARIES(4444)
     H* TCHK9 09/20/12 ADD FAS(5555)
     H* %0001 03/14/17 CHECK PROCESS CODE FOR INTRA-KANBAN  T.SAKAKI
     H* %0002 05/23/18 DELETE OLD DATA IN AFGPP01           T.SAKAKI
     H* JW1   10/14/25 ADD AFDPP20S LOG FILE
     H**************************************************************************
     FAFDPW03 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FABHPL02 IF  E           K        DISK
     FAFDPL10 UF  E           K        DISK
TCHK9FAFDPL13 UF  E           K        DISK
TCHK9F            AFDPP101                          KRENAMEAFDPP13R
     FAFDPL15 UF  E           K        DISK
TCHK4FAFDPL16 UF  E           K        DISK
TCHK4F            AFDPP151                          KRENAMEAFDL16R
     FAFDPL20 UF  E           K        DISK
     F            AFDPP201                          KRENAMEAFDL2R
%0002FAFGPL05 UF  E           K        DISK
     FAFDPP20 O   E                    DISK
JW1  FAFDPP20SO   E                    DISK
      *--------------------------------------------------------------
     E                    CMD     1   1 78
     E                    ER      1   5 78
TCHK9E                    TAB1    1  21  5   TAB2   30
      *--------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80W@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   3 ADTEHI
     I                                        3   3 KCLAS
%0001I            DS
     I                                        1   3 WPROC
     I                                        1   2 ADPAGE
     I                                        3   3 ADNIJI
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK1I* SYSTEM TIME
TCHK1I            DS
TCHK1I                                        1  140WSDT
TCHK1I                                        1   20WSSHHH
TCHK1I                                        3   40WSSNNN
TCHK1I                                        5   60WSSSSS
TCHK1I                                        7  100WSSYYY
TCHK1I                                       11  120WSSMMM
TCHK1I                                       13  140WSSDDD
TCHK1I                                        1   40WSSTM4
TCHK1I                                        1   60WSSTM6
TCHK1I                                        7  140WSSDAT
     I*
JW1  I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *-----------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C*
     C           *ENTRY    PLIST
     C                     PARM           SUPLY   4
     C                     PARM           SUPX    1
      * DATE CHECK
     C           P#T00     PLIST
     C                     PARM           P@YMD8  80
     C                     PARM           P@YY    40
     C                     PARM           P@MM    20
     C                     PARM           P@DD    20
     C                     PARM           P@WD    1
     C                     PARM           P@ER    1
      *
     C           K#AF1     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@ORYY  40
     C                     KFLD           K@ORMM  20
     C                     KFLD           K@ORDD  20
      *
     C           K#AF2     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
%0002C           K#AG2     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           W@YMD   80
     C           K#KEY     KLIST
     C                     KFLD           K@DEPT  40
     C                     KFLD           ADPAR1
     C                     KFLD           ADPAR2
     C                     KFLD           ADPAR3
     C           K#AW      KLIST
     C                     KFLD           ADKANR           CONTROL CD
     C                     KFLD           ADZETI           ABSOLUTE #
     C                     KFLD           ADTEHI           TEHAI
     C                     KFLD           ADPAGE           PAGE
     C                     KFLD           ADNIJI           2ND.TREATEMENT
     C                     KFLD           ADTAIS           TARGET TYPE
     C                     KFLD           ADSYUK           SHIP EFFECTIVE
     C                     KFLD           ADHKOS           CONTAINER TYPE
     C                     KFLD           ADCHKD           CHECK DIGIT
     C                     KFLD           ADBINN
      *
     C                     Z-ADD*ZERO     K@ORYY
     C                     Z-ADD*ZERO     K@ORMM
     C                     Z-ADD*ZERO     K@ORDD
      *
     C                     Z-ADD0111      K@DEPT
     C                     MOVE SUPLY     @SUPP   40
     C                     MOVELSUPX      @10    10
     C                     MOVE '01'      @@ID    2
TCHK1C                     TIME           WSDT
TCHK1C                     Z-ADDWSSDAT    D@DATE
     C                     MOVE 'N'       D@RECR
     C           SUPLY     CAT  SUPX:0    SCODE   5 P
     C           SCODE     LOKUPTAB1      TAB2           90
     C           *IN90     IFEQ *ON
     C                     MOVELTAB2      D@TITL
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*    1ST SCREEN
     C**************************************************************************
     C           #DSP01    BEGSR
      *
     C                     Z-ADD0         CNT     40
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
B02  C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
B02  C                     OTHER
      *
     C                     EXSR #CHK
S1   C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #UPD
 S2  C           *IN88     IFEQ *ON
  S3 C           CNT       IFNE 0
     C                     MOVE '99'      @@ID
     C                     ELSE
     C                     MOVE ER,4      D@MSG
  E3 C                     ENDIF
 E2  C                     ELSE
     C                     MOVE ER,4      D@MSG
 E2  C                     ENDIF
      *
E1   C                     ENDIF
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*   CHECK
     C**************************************************************************
     C           #CHK      BEGSR
     C*
     C                     SETOF                     996162
     C                     MOVE *BLANK    D@MSG
      *
     C           D@DATE    IFEQ *ZERO
     C                     SETON                     9961
     C                     MOVE ER,1      D@MSG
     C                     ELSE
     C                     Z-ADDD@DATE    P@YMD8
     C                     CALL 'AFDR99'  P#T00
     C           P@ER      IFNE *BLANK
     C                     SETON                     9961
     C                     MOVE ER,1      D@MSG
     C                     ELSE
TCHK1C           D@DATE    IFLT WSSDAT
     C                     SETON                     9961
     C                     MOVE ER,4      D@MSG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           D@RECR    IFNE 'Y'
     C           D@RECR    ANDNE'N'
     C  N99                MOVE ER,2      D@MSG
     C                     SETON                     9962
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
      * WRITE ORDER FILE
     C**************************************************************************
     C           #UPD      BEGSR
      *
     C                     Z-ADD*ZERO     @@ORDR  60
     C                     Z-ADDD@DATE    W@YMD
     C                     Z-ADD*ZERO     @@WGHT  92
     C                     MOVE *ON       *IN88
TCHK9C                     MOVEL*BLANK    W@ZETI  4
      * RE-CREATE
     C           D@RECR    IFEQ 'Y'
     C                     EXSR #RECR
     C                     ENDIF
      *
     C                     MOVE *BLANK    @@BIN   3
     C                     Z-ADD*ZERO     @@QTY   50
     C                     CLEARAFDPP201
TCHK9C           SUPLY     IFEQ '5555'
TCHK9C           K#AF1     SETLLAFDPL13
TCHK9C                     ELSE
     C           K#AF1     SETLLAFDPL10
TCHK9C                     END
     C           *IN90     DOUEQ*ON
TCHK9C           SUPLY     IFEQ '5555'
TCHK9C           K#AF1     READEAFDPL13                  90
TCHK9C                     ELSE
     C           K#AF1     READEAFDPL10                  90
TCHK9C                     END
     C           *IN90     IFEQ *OFF
     C           ADSKJY    ANDEQ*BLANK
      *
     C           SUPX      IFNE *BLANK
     C           ADFILR    ANDNE@10
     C                     ITER
     C                     ENDIF
      *
     C           @@BIN     IFNE ADBINN
TCHK9C           W@ZETI    ORNE ADZETI
     C           *IN88     OREQ *OFF
      *
     C           @@BIN     IFNE *BLANK
TCHK9C           W@ZETI    ORNE *BLANK
     C                     Z-ADD@@QTY     AFHAKO
     C           AFHAKO    MULT AFSYOS    @@TOT   90
     C           @@TOT     MULT @@WGHT    @@TGHT 110
     C           @@TGHT    DIV  1000      AFWGT1    H
      *
TCHK1C                     Z-ADDWSSDAT    AFKODT
TCHK1C                     Z-ADDWSSTM6    AFKHMS
     C                     MOVEL#USER     AFKOME
     C                     MOVEL#PGM      AFKOPG
     C                     MOVELSUPX      AFAKI1
     C                     WRITEAFDPP201
JW1  C                     EXSR #LOG
      *
     C                     MOVE *ON       *IN88
     C                     ADD  1         CNT
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     @@QTY
     C                     Z-ADD*ZERO     @@WGHT
     C                     MOVE ADBINN    @@BIN
TCHK9C                     MOVELADZETI    W@ZETI
     C                     CLEARAFDPP201
      *
     C                     MOVE ADBINN    AFBINN
     C                     MOVE ADZETI    AFZETI
     C                     MOVE ADPAR1    AFPAR1
     C                     MOVE ADPAR2    AFPAR2
     C                     MOVE ADPAR3    AFPAR3
     C                     Z-ADDADSYOS    AFSYOS
     C                     MOVE ADSUPP    AFSUPP
     C                     Z-ADDK@YY      AFODYY
     C                     Z-ADDK@MM      AFODMM
     C                     Z-ADDK@DD      AFODDD
     C                     Z-ADD@@ORDR    AFODNO
     C                     ENDIF
      *
     C                     Z-ADDADWGHT    @@WGHT
      *
     C           SUPLY     IFEQ '2888'
     C           SUPLY     ORNE '2888'
     C           KCLAS     ANDEQ'A'
      *
     C           ADCQTY    IFEQ *ZERO
     C                     EXSR #LOT
     C                     ADD  @@LOT     @@QTY
     C                     ELSE
     C                     ADD  ADCQTY    @@QTY
     C                     ENDIF
      *
     C                     ELSE
     C                     ADD  1         @@QTY
     C                     ENDIF
      *
     C                     Z-ADDK@YY      ADODYY
     C                     Z-ADDK@MM      ADODMM
     C                     Z-ADDK@DD      ADODDD
     C                     Z-ADD@@ORDR    ADODNO
      *
TCHK9C           SUPLY     IFEQ '5555'
TCHK9C                     UPDATAFDPP13R
TCHK9C                     ELSE
     C                     UPDATAFDPP101
TCHK9C                     END
      *
     C           K#AW      SETGTAFDPL15
     C           *IN93     DOUEQ*ON
     C           K#AW      REDPEAFDPL15                  93
     C           *IN93     IFEQ *OFF
     C           A5SUPP    ANDEQADSUPP
     C           A5SKJY    ANDEQ*BLANK
     C           A5FILR    ANDEQ@10
TCHK4C           A5ODYY    ANDEQ*ZERO
      *
     C                     Z-ADDK@YY      A5ODYY
     C                     Z-ADDK@MM      A5ODMM
     C                     Z-ADDK@DD      A5ODDD
     C                     Z-ADD@@ORDR    A5ODNO
     C                     UPDATAFDPP151
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @@QTY     IFGT *ZERO
     C                     Z-ADD@@QTY     AFHAKO
     C           AFHAKO    MULT AFSYOS    @@TOT   90
     C           @@TOT     MULT @@WGHT    @@TGHT 110
     C           @@TGHT    DIV  1000      AFWGT1    H
     C                     MOVELSUPX      AFAKI1
TCHK1C                     Z-ADDWSSDAT    AFKODT
TCHK1C                     Z-ADDWSSTM6    AFKHMS
     C                     MOVEL#USER     AFKOME
     C                     MOVEL#PGM      AFKOPG
     C                     WRITEAFDPP201
JW1  C                     EXSR #LOG
      *
     C                     MOVE *ON       *IN88
     C                     ADD  1         CNT
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
JW1   * ADD LOG DATA
     C**************************************************************************
JW1  C           #LOG      BEGSR
 |    *
     C                     TIME           SDATE
     C                     Z-ADDTODAY     AFCRHZ
     C                     Z-ADDNOW       AFCRTM
     C                     MOVEL#USER     AFCRUS
     C                     MOVEL#PGM      AFCRPG
     C                     MOVEL#WSID     AFCRWS
     C                     WRITEAFDP20S1
 |    *
JW1  C                     ENDSR
     C**************************************************************************
      * RE-CREATE ORDER FILE
     C**************************************************************************
     C           #RECR     BEGSR
      *
     C           K#AF2     SETLLAFDPL20
     C           *IN90     DOUEQ*ON
     C           K#AF2     READEAFDPL20                  90
     C           *IN90     IFEQ *OFF
     C           AFSKJY    ANDEQ*BLANK
      *
     C           SUPX      IFNE *BLANK
     C           AFAKI1    ANDNESUPX
     C                     ITER
     C                     ENDIF
      *
     C           @@ORDR    IFNE *ZERO
     C                     Z-ADDAFODNO    @@ORDR
     C                     ENDIF
      *
     C                     MOVE 'D'       AFSKJY
TCHK1C                     Z-ADDWSSDAT    AFSKDT
     C                     UPDATAFDL2R
     C                     ENDIF
     C                     ENDDO
      *
     C           K#AF2     SETLLAFDPL10
     C           *IN90     DOUEQ*ON
     C           K#AF2     READEAFDPL10                  90
     C           *IN90     IFEQ *OFF
     C           ADSKJY    ANDEQ*BLANK
      *
     C           SUPX      IFNE *BLANK
     C           ADFILR    ANDNE@10
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADD*ZERO     ADODNO
     C                     Z-ADD*ZERO     ADODYY
     C                     Z-ADD*ZERO     ADODMM
     C                     Z-ADD*ZERO     ADODDD
     C                     UPDATAFDPP101
     C                     ENDIF
     C                     ENDDO
      *
TCHK4C           K#AF2     SETLLAFDPL16
TCHK4C           *IN90     DOUEQ*ON
TCHK4C           K#AF2     READEAFDPL16                  90
TCHK4C           *IN90     IFEQ *OFF
TCHK4C           A5SKJY    ANDEQ*BLANK
TCHK4 *
TCHK4C           SUPX      IFNE *BLANK
TCHK4C           A5FILR    ANDNE@10
TCHK4C                     ITER
TCHK4C                     ENDIF
TCHK4 *
TCHK4C                     Z-ADD*ZERO     A5ODNO
TCHK4C                     Z-ADD*ZERO     A5ODYY
TCHK4C                     Z-ADD*ZERO     A5ODMM
TCHK4C                     Z-ADD*ZERO     A5ODDD
TCHK4C                     UPDATAFDL16R
TCHK4C                     ENDIF
TCHK4C                     ENDDO
      * %0002
     C           K#AG2     SETLLAFGPL05
     C           *IN90     DOUEQ*ON
     C           K#AG2     READEAFGPL05                  90
     C           *IN90     IFEQ *OFF
     C           AGSKJY    ANDEQ*BLANK
      *
     C                     MOVEL'D'       AGSKJY
     C                     Z-ADDWSSDAT    AGSKDT
     C                     MOVEL#USER     AGKOME
     C                     MOVEL#PGM      AGKOPG
     C                     UPDATAFGPL051
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------------
      *  LOT COUNT
      *---------------------------------------------------------
     C           #LOT      BEGSR
      *
     C                     Z-ADD*ZERO     @@LOT   50
      *
     C           K#KEY     SETLLABHPL02
     C           *IN95     DOUEQ*ON
     C           K#KEY     READEABHPL02                  95
     C           *IN95     IFEQ *OFF
      * %0001
     C                     MOVEL*BLANK    WAKT    3
     C           M6AKT1    IFNE *BLANK
     C                     MOVELM6AKT1    WAKT
     C                     ENDIF
     C           M6AKT2    IFNE *BLANK
     C                     MOVELM6AKT2    WAKT
     C                     ENDIF
     C           M6AKT3    IFNE *BLANK
     C                     MOVELM6AKT3    WAKT
     C                     ENDIF
     C           M6AKT4    IFNE *BLANK
     C                     MOVELM6AKT4    WAKT
     C                     ENDIF
      *
     C           WPROC     IFNE WAKT
     C                     ITER
     C                     ENDIF
      *
     C           M6SKJY    IFEQ *BLANK
     C           M6STHZ    ANDEQ99999999
     C                     Z-ADDM6LOTK    @@LOT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           @@LOT     IFEQ *ZERO
     C                     ADD  1         @@LOT
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------------
** CMD
F3:END    F5:CREATE
** ER
DATE ERROR
ENTER Y OR N
ORDER DATE SHOULD BE GREATER EQUAL TODAY.
NO DATA
TOTAL BOXES ARE LESS THAN 32 FOR BIN
** TAB1/TAB2
2222   ORDER CREATE FOR CURTIS
2111   ORDER CREATE FOR FOREST
2333   ORDER CREATE FOR J & M
2444   ORDER CREATE FOR ELM PLATNG
2666   ORDER CREATE FOR MMC
2555   ORDER CREATE FOR MAC
2777   ORDER CREATE FOR MPI
28881  ORDER CREATE FOR T&S(RC)
28882  ORDER CREATE FOR T&S(HN)
2424   ORDER CREATE FOR PTC
2929   ORDER CREATE FOR DEPOR
2999   ORDER CREATE FOR EMT
2828   ORDER CREATE FOR SWD
3333   ORDER CREATE FOR TALMA
3111   ORDER CREATE FOR SEKIDO
3222   ORDER CREATE FOR SRA
3444   ORDER CREATE FOR VICO
2112   ORDER CREATE FOR FCO
4444   ORDER CREATE FOR ROCKFORD SECONDARIES
5555   ORDER CREATE FOR FAS
4456   ORDER CREATE FOR MITSUCHI
