     H            Y.                                    1
     H** AFDR04 *******************************************************
     H* OUT GOING :ISSHUE SHIPPING DOCUMENTS                          *
     H*                                                               *
     H* TCH DEC/12/01
      * ADD LOCATION  07/30/03 TCH
     H* TCHK1 07/24/07 CHG DATE OPERATION
     H* TCHK2 12/10/08 ADD PTC(2424)
     H* TCHK3 02/26/09 ADD DEPOR(2929)
     H* TCHK4 03/11/10 ADD SWD(2828) TALMA(3333)
     H* TCHK5 05/13/10 ADD SEKIDO(3111),SRA(3222),VICO(3444)
     H* TCHK6 03/10/11 ADD FCO(2112)
     H* TCHK7 01/27/12 ADD RPCKFORD SECONDARIES(4444)
     H* TCHK8 09/20/12 ADD FAS(5555)
     H* %0001 11/09/16 FIX BUG  T.SAKAKI
     H* %0002 11/13/16 ADD PARAMETER   T.SAKAKI
JW1  H* JW    04/10/19 FIX SURYO CALCULATION (NEW: XSRYO)
     H**************************************************************************
     FAFDPW04 CF  E                    WORKSTN
     F                                              KINFDS @INFDS
     FGCKPL21 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FEDIPL40 IF  E           K        DISK
     FAFDPL16 UF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAFANP99 UF  E           K        DISK                      A
     FAFDPL10 UF  E           K        DISK
T    FAFDPL13 UF  E           K        DISK
T    F            AFDPP101                          KRENAMEAFDPP13R
     FAFDPL29 UF  E           K        DISK
     FAFAPP70 UF  E                    DISK                      A
     FAFAPP75 UF  E                    DISK                      A
     F*AFAWP75 IF  E                    DISK                      A
     FAFAPP95 O   E                    DISK
     FABHPL02 IF  E           K        DISK
      *--------------------------------------------------------------
     E                    CMD     1   1 78
     E                    ER      1   3 78
TCHK8 ***                 TAB1    1  20  5   TAB2   15
     E                    TAB1    1  21  5   TAB2   15
     E*AFAPP70
     E                    #QTN       16  5               BOX
     E                    #PTN       16 40               PART NO.+QTY.
     E                    #WTN       16 10               WEIGNT
     E*AFAPP75
     E                    #NOP        5 15               NO.
     E                    #DSC        5 40               PART NO.
     E                    #QTY        5 10               QTY.
     E                    #WEI        5 40               WEIGNT
     E                    #LOC        5  9               WEIGNT
     E*AFAPP95
     E                    #ALT       16  8
     E                    #LOT       16  7
     E                    #BOX       16  3 0
     E                    #SYS       16  6
     E                    #QT        16  6
     E                    #WGH       16  8
     E*
     E                    LOC        15  6               LOCATION
     E                    DPT        15  4 0             DEPARTMENT
     E                    KAN        15  1               DEPARTMENT
      *--------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  12 A9PAR
     I                                        1   5 AFPAR1
     I                                        6  10 AFPAR2
     I                                       11  12 AFPAR3
     I            DS
     I                                        1  12 W9PAR
     I                                        1   5 W9PAR1
     I                                        6  10 W9PAR2
     I                                       11  12 W9PAR3
     I            DS
     I                                        1   80W@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I                                        1   60K@YYMM
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   60@@ORDR
     I                                        1   20@@Y
     I                                        3   40@@M
     I                                        5   60@@N
     I            DS
     I                                        1   80W@DUE
     I                                        1   40AFNYYY
     I                                        5   60AFNYMM
     I                                        7   80AFNYDD
     I            DS
     I                                        1 128 #ALT
     I                                        1   8 CSALO1
     I                                        9  16 CSALO2
     I                                       17  24 CSALO3
     I                                       25  32 CSALO4
     I                                       33  40 CSALO5
     I                                       41  48 CSALO6
     I                                       49  56 CSALO7
     I                                       57  64 CSALO8
     I                                       65  72 CSALO9
     I                                       73  80 CSALO0
     I                                       81  88 CSALOA
     I                                       89  96 CSALOB
     I                                       97 104 CSALOC
     I                                      105 112 CSALOD
     I                                      113 120 CSALOE
     I                                      121 128 CSALOF
     I            DS
     I                                        1 112 #LOT
     I                                        1   7 CSLOT1
     I                                        8  14 CSLOT2
     I                                       15  21 CSLOT3
     I                                       22  28 CSLOT4
     I                                       29  35 CSLOT5
     I                                       36  42 CSLOT6
     I                                       43  49 CSLOT7
     I                                       50  56 CSLOT8
     I                                       57  63 CSLOT9
     I                                       64  70 CSLOT0
     I                                       71  77 CSLOTA
     I                                       78  84 CSLOTB
     I                                       85  91 CSLOTC
     I                                       92  98 CSLOTD
     I                                       99 105 CSLOTE
     I                                      106 112 CSLOTF
     I            DS
     I                                        1  48 #BOX
     I                                        1   30CSSYU1
     I                                        4   60CSSYU2
     I                                        7   90CSSYU3
     I                                       10  120CSSYU4
     I                                       13  150CSSYU5
     I                                       16  180CSSYU6
     I                                       19  210CSSYU7
     I                                       22  240CSSYU8
     I                                       25  270CSSYU9
     I                                       28  300CSSYU0
     I                                       31  330CSSYUA
     I                                       34  360CSSYUB
     I                                       37  390CSSYUC
     I                                       40  420CSSYUD
     I                                       43  450CSSYUE
     I                                       46  480CSSYUF
     I            DS
     I                                        1  96 #SYS
     I                                        1   6 CSSRY1
     I                                        7  12 CSSRY2
     I                                       13  18 CSSRY3
     I                                       19  24 CSSRY4
     I                                       25  30 CSSRY5
     I                                       31  36 CSSRY6
     I                                       37  42 CSSRY7
     I                                       43  48 CSSRY8
     I                                       49  54 CSSRY9
     I                                       55  60 CSSRY0
     I                                       61  66 CSSRYA
     I                                       67  72 CSSRYB
     I                                       73  78 CSSRYC
     I                                       79  84 CSSRYD
     I                                       85  90 CSSRYE
     I                                       91  96 CSSRYF
     I            DS
     I                                        1  96 #QT
     I                                        1   6 CSTQT1
     I                                        7  12 CSTQT2
     I                                       13  18 CSTQT3
     I                                       19  24 CSTQT4
     I                                       25  30 CSTQT5
     I                                       31  36 CSTQT6
     I                                       37  42 CSTQT7
     I                                       43  48 CSTQT8
     I                                       49  54 CSTQT9
     I                                       55  60 CSTQT0
     I                                       61  66 CSTQTA
     I                                       67  72 CSTQTB
     I                                       73  78 CSTQTC
     I                                       79  84 CSTQTD
     I                                       85  90 CSTQTE
     I                                       91  96 CSTQTF
     I            DS
     I                                        1 128 #WGH
     I                                        1   8 CSWGH1
     I                                        9  16 CSWGH2
     I                                       17  24 CSWGH3
     I                                       25  32 CSWGH4
     I                                       33  40 CSWGH5
     I                                       41  48 CSWGH6
     I                                       49  56 CSWGH7
     I                                       57  64 CSWGH8
     I                                       65  72 CSWGH9
     I                                       73  80 CSWGH0
     I                                       81  88 CSWGHA
     I                                       89  96 CSWGHB
     I                                       97 104 CSWGHC
     I                                      105 112 CSWGHD
     I                                      113 120 CSWGHE
     I                                      121 128 CSWGHF
     I            DS
     I                                        1  80 #QTN
     I                                        1   5 BFQTN1
     I                                        6  10 BFQTN2
     I                                       11  15 BFQTN3
     I                                       16  20 BFQTN4
     I                                       21  25 BFQTN5
     I                                       26  30 BFQTN6
     I                                       31  35 BFQTN7
     I                                       36  40 BFQTN8
     I                                       41  45 BFQTN9
     I                                       46  50 BFQTNA
     I                                       51  55 BFQTNB
     I                                       56  60 BFQTNC
     I                                       61  65 BFQTND
     I                                       66  70 BFQTNE
     I                                       71  75 BFQTNF
     I                                       76  80 BFQTNG
     I            DS
     I                                        1 640 #PTN
     I                                        1  40 BFPTN1
     I                                       41  80 BFPTN2
     I                                       81 120 BFPTN3
     I                                      121 160 BFPTN4
     I                                      161 200 BFPTN5
     I                                      201 240 BFPTN6
     I                                      241 280 BFPTN7
     I                                      281 320 BFPTN8
     I                                      321 360 BFPTN9
     I                                      361 400 BFPTNA
     I                                      401 440 BFPTNB
     I                                      441 480 BFPTNC
     I                                      481 520 BFPTND
     I                                      521 560 BFPTNE
     I                                      561 600 BFPTNF
     I                                      601 640 BFPTNG
     I            DS
     I                                        1 160 #WTN
     I                                        1  10 BFWTN1
     I                                       11  20 BFWTN2
     I                                       21  30 BFWTN3
     I                                       31  40 BFWTN4
     I                                       41  50 BFWTN5
     I                                       51  60 BFWTN6
     I                                       61  70 BFWTN7
     I                                       71  80 BFWTN8
     I                                       81  90 BFWTN9
     I                                       91 100 BFWTNA
     I                                      101 110 BFWTNB
     I                                      111 120 BFWTNC
     I                                      121 130 BFWTND
     I                                      131 140 BFWTNE
     I                                      141 150 BFWTNF
     I                                      151 160 BFWTNG
     I            DS
     I                                        1  75 #NOP
     I                                        1  15 PFNOP1
     I                                       16  30 PFNOP4
     I                                       31  45 PFNOP7
     I                                       46  60 PFNOPA
     I                                       61  75 PFNOPD
     I            DS
     I                                        1 200 #DSC
     I                                        1  40 PFDSC1
     I                                       41  80 PFDSC4
     I                                       81 120 PFDSC7
     I                                      121 160 PFDSCA
     I                                      161 200 PFDSCD
     I            DS
     I                                        1  50 #QTY
     I                                        1  10 PFQTY1
     I                                       11  20 PFQTY4
     I                                       21  30 PFQTY7
     I                                       31  40 PFQTYA
     I                                       41  50 PFQTYD
     I            DS
     I                                        1  45 #LOC
     I                                        1   9 PFLOC1
     I                                       10  18 PFLOC4
     I                                       19  27 PFLOC7
     I                                       28  36 PFLOCA
     I                                       37  45 PFLOCD
     I            DS
     I                                        1 200 #WEI
     I                                        1  40 PFDSC2
     I                                       41  80 PFDSC5
     I                                       81 120 PFDSC8
     I                                      121 160 PFDSCB
     I                                      161 200 PFDSCE
     I            DS
     I                                        1  40 @DSC
     I                                        1   5 @@PAR1
     I I            '-'                       6   6 WHN1
     I                                        7  11 @@PAR2
     I I            '-'                      12  12 WHN2
     I                                       13  14 @@PAR3
     I I            '('                      16  16 WKKO1
     I                                       17  23 WSYOS1
     I I            'PCS'                    25  27 WPC1
     I I            ')'                      28  28 WKAK
     I            DS
     I                                        1  40 @WEI
     I I            'WEIGHT'                  3   8 WWEI1
     I                                        9  18 WWEIT
     I I            'LB'                     19  20 WLB1
     I            DS
     I                                        1  40 @PTN
     I                                        1   5 WWPAR1
     I I            '-'                       6   6 WHN3
     I                                        7  11 WWPAR2
     I I            '-'                      12  12 WHN4
     I                                       13  14 WWPAR3
     I                                       28  34 WSYOS2
     I I            'PCS'                    36  38 WPC2
     I            DS
     I                                        1  40 @TWEIT
     I I            'TOTAL'                   2   6 WTOTAL
     I I            'GROSS'                   8  12 WGROSS
     I I            'WEIGHT'                 14  19 WWEI2
     I                                       21  29 GWEIT
     I I            'LB'                     30  31 WLB2
     I            DS
     I                                        1 150 @PALET
     I I            'NO. OF'                  1   6 WNOOF
     I I            'BIN    '                 8  14 WPALET
     I I            ':'                      16  16 WCOLON
     I                                       18  20 @PALE
     I            DS
     I                                        1   8 @APCS
     I                                        1   4 @@ZET
     I I            '-'                       5   5 @HFN
     I                                        6   8 @@THI
TCHK5I            DS
TCHK5I                                        1   3 W@LOT#
TCHK5I                                        1   1 W@TICD
TCHK5I                                        2   2 W@YUKO
TCHK5I                                        3   3 W@HASY
\    I            DS
     I                                        1   8 W@APCS
     I                                        1   4 W@ZET
     I I            '-'                       5   5 WHFN
     I                                        6   8 W@THI
     I            DS
     I                                        1   6 @@LOC
     I                                        1   1 @@L1
     I                                        2   3 @@L2
     I                                        4   5 @@L3
     I                                        6   6 @@L4
     I            DS
     I                                        1   9 W@LOC
     I                                        1   1 W@L1
     I                                        2   2 W@L11
     I                                        3   4 W@L2
     I                                        5   5 W@L22
     I                                        6   7 W@L3
     I                                        8   8 W@L33
     I                                        9   9 W@L4
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  60 DPT
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  15 KAN
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1   3 ADTEHI
     I                                        3   3 KCLAS
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK1I* SYSTEM TIME
TCHK1I            DS
TCHK1I                                        1  140WSDT
TCHK1I                                        1   20WSSHHH
TCHK1I                                        3   40WSSNNN
TCHK1I                                        5   60WSSSSS
TCHK1I                                        7  100WSSYYY
TCHK1I                                       11  120WSSMMM
TCHK1I                                       13  140WSSDDD
TCHK1I                                        1   40WSSTM4
TCHK1I                                        1   60WSSTM6
TCHK1I                                        7  140WSSDAT
      *-----------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           SUPLY   4
     C                     PARM           SUPX    1
%0002C                     PARM           PODNO   60
      * DATE CHECK
     C           P#T00     PLIST
     C                     PARM           P@YMD8  80
     C                     PARM           P@YY    40
     C                     PARM           P@MM    20
     C                     PARM           P@DD    20
     C                     PARM           P@WD    1
     C                     PARM           P@ER    1
     C           K#FCE     KLIST
     C                     KFLD           ADPAR1
     C                     KFLD           ADPAR2
     C                     KFLD           ADPAR3
     C           K#FCEX    KLIST
     C                     KFLD           AFPAR1
     C                     KFLD           AFPAR2
     C                     KFLD           AFPAR3
     C           K#AM      KLIST
     C                     KFLD           W9PAR1
     C                     KFLD           W9PAR2
     C                     KFLD           W9PAR3
      *
     C           KEY2      KLIST
     C                     KFLD           KSUPP
     C                     KFLD           KTAIP
     C           KEY3      KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#AF2     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#AF9     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@YYMM
     C           K#KEY     KLIST
     C                     KFLD           K@DEPT  40
     C                     KFLD           ADPAR1
     C                     KFLD           ADPAR2
     C                     KFLD           ADPAR3
     C           K#W       KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C                     KFLD           W@ODNO
     C                     KFLD           W@BIN
     C                     KFLD           W@ZET
     C                     KFLD           W@THI
      *
     C                     MOVE SUPLY     @SUPP   40
     C                     Z-ADD0111      K@DEPT
      *
     C                     MOVE '01'      @@ID    2
TCHK1C*                    Z-ADD*DATE     D@DATE
TCHK1C                     TIME           WSDT
TCHK1C                     Z-ADDWSSDAT    D@DATE
     C                     MOVE 'Y'       D@BL
     C                     MOVE 'Y'       D@PK
     C                     MOVE 'Y'       D@CS
     C           SUPLY     CAT  SUPX:0    SCODE   5 P
     C           SCODE     LOKUPTAB1      TAB2           90
     C           *IN90     IFEQ *ON
     C                     MOVELTAB2      D@SUPP
     C                     ENDIF
      *
     C           SCODE     IFEQ '28882'
TCH62C*                    MOVE 'N'       D@BL
TCH62C*                    MOVE 'N'       D@CS
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*    1ST SCREEN
     C**************************************************************************
     C           #DSP01    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
     C                     WRITEDSP99
TCHK5C           SUPLY     IFEQ '3111'
     C           SUPLY     OREQ '4456'
TCHK5C                     MOVEL*ON       *IN65
TCHK5C                     ELSE
TCHK5C                     MOVEL*OFF      *IN65
TCHK5C                     END
     C                     EXFMTDSP01
      *
     C                     SELEC
B02  C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
B02  C                     OTHER
      *
     C                     EXSR #CHK
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     MOVE '99'      @@ID
     C                     ENDIF
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*   CHECK
     C**************************************************************************
     C           #CHK      BEGSR
     C*
     C                     SETOF                     616263
     C                     SETOF                     99
     C                     MOVE *BLANK    D@MSG
      * CHECK DATE
     C           D@DATE    IFEQ *ZERO
     C                     SETON                     9961
     C                     MOVE ER,1      D@MSG
     C                     ELSE
     C                     Z-ADDD@DATE    P@YMD8
     C                     CALL 'AFDR99'  P#T00
     C           P@ER      IFNE *BLANK
     C                     SETON                     9961
     C                     MOVE ER,1      D@MSG
     C                     ENDIF
     C                     ENDIF
      * CHECK OPTION
     C           D@BL      IFNE 'Y'
     C           D@BL      ANDNE'N'
     C  N99                MOVE ER,2      D@MSG
     C                     SETON                     9962
     C                     ENDIF
      *
     C           D@PK      IFNE 'Y'
     C           D@PK      ANDNE'N'
     C  N99                MOVE ER,2      D@MSG
     C                     SETON                     9963
     C                     ENDIF
      *
     C           D@CS      IFNE 'Y'
     C           D@CS      ANDNE'N'
     C  N99                MOVE ER,2      D@MSG
     C                     SETON                     9963
     C                     ENDIF
      * CHECK OBJECT DATA
     C                     Z-ADD*ZERO     @@ORDR
     C                     Z-ADDD@DATE    W@YMD
     C           K#AF2     SETLLAFDPL29
     C           *IN90     DOUEQ*ON
     C           K#AF2     READEAFDPL29             N    90
     C           *IN90     IFEQ *OFF
     C           AFSKJY    ANDEQ*BLANK
     C           SUPX      IFNE *BLANK
     C           AFAKI1    ANDNESUPX
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDAFODNO    @@ORDR
%0002C                     Z-ADD0         PODNO
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C  N99                MOVE ER,3      D@MSG
     C                     SETON                     9961
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
      * WRITE ORDER FILE
     C**************************************************************************
     C           #OUT      BEGSR
      * ORDER NUMBER
     C           @@ORDR    IFEQ *ZERO
     C           K#AF9     CHAINAFANP99              90
     C           *IN90     IFEQ *ON
     C                     MOVELSUPLY     A9SUPP
     C                     Z-ADDK@YYMM    A9YYMM
     C                     Z-ADD1         A9SQNO
     C                     WRITEAFANP991
     C                     ELSE
     C                     ADD  1         A9SQNO
     C                     UPDATAFANP991
     C                     ENDIF
      *  ORDER NUMBER
     C                     Z-ADDK@YY      @@Y
     C                     Z-ADDK@MM      @@M
     C                     Z-ADDA9SQNO    @@N
%0002C                     Z-ADD@@ORDR    PODNO
     C                     ENDIF
      *
     C           @SUPP     CHAINFGBPL011             20
     C           *IN20     IFEQ '0'
     C           B2SKJY    ANDEQ*BLANK
     C                     MOVELB2SMEI    WVDNM  20
     C                     END
      * UPDATE
     C                     EXSR #UPD
      *
     C                     ENDSR
     C**************************************************************************
      * UPDATE
     C**************************************************************************
     C           #UPD      BEGSR
      * ADDRESS
     C                     EXSR #ADDR
      *
     C           K#AF2     SETLLAFDPL16
     C           *IN90     DOUEQ*ON
     C           K#AF2     READEAFDPL16                  90
     C           *IN90     IFEQ *OFF
     C           A5SKJY    ANDEQ*BLANK
      *
     C           SUPX      IFNE *BLANK
     C           A5FILR    ANDNESUPX
     C                     ITER
     C                     ENDIF
      *
TCHK1C*                    Z-ADD*DATE     A5KODT
TCHK1C*                    TIME           A5KOTM
TCHK1C                     Z-ADDWSSDAT    A5KODT
TCHK1C                     Z-ADDWSSTM6    A5KOTM
     C                     MOVEL#USER     A5KOME
     C                     MOVEL#PGM      A5KOPG
     C                     Z-ADD@@ORDR    A5ODNO
     C                     UPDATAFDPP151
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE *BLANK    @@LTNO  8
     C                     MOVE *BLANK    W@APCS  8
     C                     MOVE *BLANK    @@BIN   3
     C                     MOVE *BLANK    @@THI   3
     C                     Z-ADD*ZERO     @BOX    40
     C                     Z-ADD*ZERO     @TBOX   40
     C                     Z-ADD*ZERO     Z
     C                     CLEARAFAPP95R
      *
T    C           SUPLY     IFEQ '5555'
T    C           K#AF2     SETLLAFDPL13
T    C                     ELSE
     C           K#AF2     SETLLAFDPL10
T    C                     END
     C           *IN90     DOUEQ*ON
T    C           SUPLY     IFEQ '5555'
T    C           K#AF2     READEAFDPL13                  90
T    C                     ELSE
     C           K#AF2     READEAFDPL10                  90
T    C                     END
     C           *IN90     IFEQ *OFF
     C           ADSKJY    ANDEQ*BLANK
      *
     C           SUPX      IFNE *BLANK
     C           ADFILR    ANDNESUPX
     C                     ITER
     C                     ENDIF
      *
TCHK1C*                    Z-ADD*DATE     ADKODT
TCHK1C*                    TIME           ADKOTM
TCHK1C                     Z-ADDWSSDAT    ADKODT
TCHK1C                     Z-ADDWSSTM6    ADKOTM
     C                     MOVEL#USER     ADKOME
     C                     MOVEL#PGM      ADKOPG
     C                     Z-ADD@@ORDR    ADODNO
T    C           SUPLY     IFEQ '5555'
T    C                     UPDATAFDPP13R
T    C                     ELSE
     C                     UPDATAFDPP101
T    C                     END
      *
TCHK5C           SUPLY     IFEQ '3111'
TCHK5C           SUPLY     OREQ '4456'
TCHK5C                     MOVE ADTAIS    W@TICD
TCHK5C                     MOVE ADSYUK    W@YUKO
TCHK5C                     MOVE ADHKOS    W@HASY
TCHK5C                     MOVE W@LOT#    @@THI
TCHK5C                     ELSE
     C                     MOVE ADTEHI    @@THI
TCHK5C                     END
     C                     MOVE ADZETI    @@ZET
      *
      *
     C           @APCS     IFNE *BLANK
     C           @APCS     ANDNEW@APCS
     C           W@APCS    ANDNE*BLANK
     C           D@CS      ANDEQ'Y'
     C                     EXSR #CSDT
     C                     ENDIF
      * %0001
     C           @APCS     IFNE *BLANK
     C           W@APCS    ANDNE*BLANK
     C           @APCS     ANDEQW@APCS
     C           @@BIN     ANDNEADBINN
     C                     EXSR #CSDT
     C                     ENDIF
      *
     C           @@BIN     IFNE *BLANK
     C           @@BIN     ANDNEADBINN
     C           D@CS      IFEQ 'Y'
     C           K         IFEQ *ZERO
     C                     EXSR #CSDT
     C                     ENDIF
     C                     EXSR #CS
     C                     ENDIF
     C                     Z-ADD*ZERO     K       20
     C                     Z-ADD*ZERO     L       20
     C                     MOVE *BLANK    #LOT
     C                     MOVE *BLANK    #ALT
     C                     Z-ADD*ZERO     #BOX
     C                     MOVE *BLANK    #QT
     C                     MOVE *BLANK    #WGH
     C                     ENDIF
T    C           SUPLY     IFEQ '5555'
T    C           @APCS     IFNE *BLANK
T    C           @APCS     ANDNEW@APCS
T    C           W@APCS    ANDNE*BLANK
T    C           D@CS      IFEQ 'Y'
T    C           K         IFEQ *ZERO
T    C                     EXSR #CSDT
T    C                     ENDIF
T    C                     EXSR #CS
T    C                     ENDIF
T    C                     Z-ADD*ZERO     K       20
T    C                     Z-ADD*ZERO     L       20
T    C                     MOVE *BLANK    #LOT
T    C                     MOVE *BLANK    #ALT
T    C                     Z-ADD*ZERO     #BOX
T    C                     MOVE *BLANK    #QT
T    C                     MOVE *BLANK    #WGH
T    C                     END
T    C                     END
T    C*
     C                     MOVE ADBINN    @@BIN
     C                     MOVE @APCS     W@APCS
      *
      *
     C           SUPLY     IFEQ '2888'
     C           SUPLY     ORNE '2888'
     C           KCLAS     ANDEQ'A'
      *
     C           ADCQTY    IFEQ *ZERO
     C                     EXSR #LOTQ
     C                     ADD  @LOTQ     @BOX
     C                     ELSE
     C                     ADD  ADCQTY    @BOX
     C                     ENDIF
      *
     C                     ELSE
     C                     ADD  1         @BOX
     C                     ENDIF
      *
     C           K#FCE     CHAINFCEPL01              95
     C           *IN95     IFEQ *OFF
     C                     Z-ADDA2KASI    ADWGHT
     C                     ENDIF
     C                     Z-ADDADWGHT    @@WGHT  72
     C                     Z-ADDADSYOS    @@SYOS  50
     C                     MOVELADLTNO    @@LOT   7
     C                     MOVELADLTNO    @@LTNO
     C                     MOVE ADPAR1    @@PAR1  5
     C                     MOVE ADPAR2    @@PAR2  5
     C                     MOVE ADPAR3    @@PAR3  2
     C                     MOVE ADODNO    W@ODNO  60
     C                     MOVE ADBINN    W@BIN   3
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           D@CS      IFEQ 'Y'
     C           @BOX      ANDGT*ZERO
TCHK5C                     MOVEL@APCS     W@APCS
     C                     EXSR #CSDT
     C                     EXSR #CS
     C                     Z-ADD*ZERO     K       20
     C                     Z-ADD*ZERO     L       20
     C                     MOVE *BLANK    #LOT
     C                     MOVE *BLANK    #ALT
     C                     Z-ADD*ZERO     #BOX
     C                     MOVE *BLANK    #QT
     C                     MOVE *BLANK    #WGH
     C                     ENDIF
      *--------------------------------------
     C                     CLEARAFAPP70R
     C                     CLEARAFAPP75R
     C                     Z-ADD0         Y       30
     C                     Z-ADD0         Z       30
     C                     Z-ADD0         K
     C                     Z-ADD0         L
     C                     Z-ADD0         @NOP   100
     C                     Z-ADD0         THAKO   50
     C                     Z-ADD0         TWEIT  102
     C                     Z-ADD0         TWEITT 102
     C                     Z-ADD0         W9HAKO  40
     C                     Z-ADD0         W9SYOS  50
JW1  C                     Z-ADD0         XSRYO   80
     C                     Z-ADD0         W9WEIT  73
     C                     Z-ADD0         WTWEIT  73
     C                     MOVE *BLANK    W@BIN   3
     C                     MOVEL*BLANK    #NOP
     C                     MOVEL*BLANK    #DSC
     C                     MOVEL*BLANK    #QTY
     C                     MOVEL*BLANK    #WGH
     C                     MOVEL*BLANK    #QTN
     C                     MOVEL*BLANK    #PTN
     C                     MOVEL*BLANK    #WTN
      * EXPECTED DUE DATE
     C                     EXSR #DUE
      *
     C           K#AF2     SETLLAFDPL29
     C           *IN90     DOUEQ*ON
     C           K#AF2     READEAFDPL29                  90
     C           *IN90     IFEQ *OFF
     C           AFSKJY    ANDEQ*BLANK
     C           SUPX      IFNE *BLANK
     C           AFAKI1    ANDNESUPX
     C                     ITER
     C                     ENDIF
TCHK1C*                    Z-ADD*DATE     AFKODT
TCHK1C*                    TIME           AFKHMS
TCHK1C                     Z-ADDWSSDAT    AFKODT
TCHK1C                     Z-ADDWSSTM6    AFKHMS
     C                     MOVEL#USER     AFKOME
     C                     MOVEL#PGM      AFKOPG
     C                     Z-ADD@@ORDR    AFODNO
     C                     Z-ADDWNOKI     W@DUE
     C                     UPDATAFDPP201
      *
     C           A9PAR     IFNE W9PAR
     C           W9PAR     ANDNE*BLANK
     C                     EXSR #DATA
     C                     END
      *
     C           AFBINN    IFNE W@BIN
     C                     ADD  1         @@P1    20
     C                     ENDIF
     C*//PURCHASE REQUISITION//
     C******     Z         IFEQ 5
     C           A9PAR     IFNE W9PAR
     C           W9PAR     ANDNE*BLANK
     C           D@PK      ANDEQ'Y'
     C                     EXSR #MOVE4
     C                     END
      *
     C                     MOVE AFBINN    W@BIN
     C                     MOVELAFPAR1    @@PAR1  5
     C                     MOVELAFPAR2    @@PAR2  5
     C                     MOVELAFPAR3    @@PAR3  2
     C                     MOVELAFPAR1    WWPAR1  5
     C                     MOVELAFPAR2    WWPAR2  5
     C                     MOVELAFPAR3    WWPAR3  2
     C                     MOVELAFPAR1    W9PAR1  5
     C                     MOVELAFPAR2    W9PAR2  5
     C                     MOVELAFPAR3    W9PAR3  2
     C                     EXSR #MEM
     C*//BILL OF LADING//
     C           Y         IFEQ 16
     C           D@BL      ANDEQ'Y'
     C                     EXSR #MOVE3
     C                     END
      *
     C                     ENDIF
     C                     ENDDO
     C*
     C           W9PAR     IFNE *BLANK
     C                     EXSR #DATA
     C*//BILL OF LADING//
     C           D@BL      IFEQ 'Y'
     C                     EXSR #MOVE3
     C                     ENDIF
     C*//PURCHASE REQUISITION//
     C           D@PK      IFEQ 'Y'
     C                     EXSR #MOVE4
     C                     ENDIF
     C*// TOTAL WEITGT //
     C                     EXSR #TOTAL
     C*// AFAPP70 AND AFAPP75 LAST RECORD UPDAT //
     C                     EXSR #LAST
      *
     C                     ENDIF
     C*
     C                     ENDSR
      *---------------------------------------------------------
      *  LOT COUNT
      *---------------------------------------------------------
     C           #LOTQ     BEGSR
      *
     C                     Z-ADD*ZERO     @LOTQ   50
      *
      *
     C           K#KEY     SETLLABHPL02
     C           *IN95     DOUEQ*ON
     C           K#KEY     READEABHPL02                  95
     C           *IN95     IFEQ *OFF
     C           M6SKJY    ANDEQ*BLANK
     C           M6STHZ    ANDEQ99999999
     C                     Z-ADDM6LOTK    @LOTQ
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------------
     C           #CSDT     BEGSR
      *---------------- ----------------------------------------
     C           @@ZET     IFNE *BLANK
     C                     ADD  1         K
     C           SUPX      IFEQ *BLANK
TCHK5C*                    MOVE @APCS     #ALT,K           K: MAX 16 ORDERS
TCHK5C                     MOVE W@APCS    #ALT,K           MAX 16 ORD PER BIN#
     C                     ENDIF
     C                     Z-ADD@BOX      #BOX,K
     C                     ADD  @BOX      @BOXT   30
      *
     C                     Z-ADD@@SYOS    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #SYS,K
      *
     C           @BOX      MULT @@SYOS    @@QTOT  70
     C                     Z-ADD@@QTOT    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #QT,K
      *
     C           @@QTOT    MULT @@WGHT    @WEIT1 112       G
     C           @WEIT1    DIV  1000      @WEIT2  83       G --> KG
     C           @WEIT2    MULT 2.2046    @WEIT3  82H      KG --> LB
     C                     ADD  @WEIT3    TWEIT  102       TOTAL
     C                     Z-ADD@WEIT3    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #WGH,K
      *
     C                     MOVE *OFF      *IN92
     C           K#W       SETLLAFDPL16
     C           *IN91     DOUEQ*ON
     C           K#W       READEAFDPL16                  91
     C           *IN91     IFEQ *OFF
     C           A5LTNO    ANDNE*BLANK
     C                     MOVE A5TEHI    @TH     1
     C           @TH       IFNE 'A'
     C                     ADD  1         L
     C           L         IFGT 16
     C                     EXSR #CS
     C                     Z-ADD*ZERO     K       20
     C                     Z-ADD*ZERO     L       20
     C                     MOVE *BLANK    #LOT
     C                     MOVE *BLANK    #ALT
     C                     Z-ADD*ZERO     #BOX
     C                     MOVE *BLANK    #QT
     C                     MOVE *BLANK    #WGH
     C                     ADD  1         L
     C                     ENDIF
     C                     MOVE A5LTNO    #LOT,L
     C                     ELSE
      ******     *IN92     IFEQ *ON
     C                     ADD  1         Z
     C           Z         IFGT 16
     C                     EXSR #CS
     C                     Z-ADD*ZERO     K       20
     C                     Z-ADD*ZERO     L       20
     C                     MOVE *BLANK    #LOT
     C                     MOVE *BLANK    #ALT
     C                     Z-ADD*ZERO     #BOX
     C                     MOVE *BLANK    #QT
     C                     MOVE *BLANK    #WGH
     C                     Z-ADD1         Z
     C                     ENDIF
     C                     MOVE A5LTNO    #LOT,Z
      ******               ENDIF
     C                     ENDIF
     C  N92                MOVE *ON       *IN92
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADD*ZERO     @BOX
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------------
     C           #CS       BEGSR
      *---------------------------------------------------------
     C                     MOVELWTONM     CSSUPP
     C                     MOVELWSH01     CSAD01
     C                     MOVELWSH02     CSAD02
     C                     MOVE K@YY      CSNOYY
     C                     MOVE K@MM      CSNOMM
     C                     MOVE K@DD      CSNODD
     C                     MOVEL@@ORDR    CSODRN
     C                     MOVEL@@PAR1    CSMHN1
     C                     MOVEL@@PAR2    CSMHN2
     C                     MOVEL@@PAR3    CSMHN3
     C                     MOVEL@@BIN     CSBINN
     C                     Z-ADD@BOXT     CSTBOX
      *
     C                     Z-ADDTWEIT     PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      CSTWGH
     C                     WRITEAFAPP95R
      *
     C                     CLEARAFAPP95R
     C                     Z-ADD*ZERO     TWEIT
     C                     Z-ADD*ZERO     @BOXT
     C                     Z-ADD*ZERO     @BOX
     C                     Z-ADD*ZERO     Z
     C                     MOVE *BLANK    W@APCS
      *
     C                     ENDSR
     C**************************************************************************
     C           #DATA     BEGSR
     C**************************************************************************
     C*//BILL OF LADING AND PURCHASE REQUISITION//
     C                     ADD  1         Y
     C                     ADD  1         Z
     C                     ADD  1         @NOP
     C*NO
     C                     Z-ADD@NOP      PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #NOP,Z
     C*BIN
     C*****                ADD  W9HAKO    THAKO
     C*******              Z-ADDW9HAKO    PIN
     C                     Z-ADD@@P1      PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #QTN,Y
     C******               MOVE POUT      WHAKO
     C                     ADD  @@P1      @@P     20
     C                     Z-ADD*ZERO     @@P1
     C* TOTAL QTY
     C           W9SYOS    MULT W9HAKO    @SRYO   80
JW1  C***                  Z-ADD@SRYO     PIN
JW1  C                     Z-ADDXSRYO     PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      WSYOS1
     C                     MOVE POUT      WSYOS2
     C                     MOVE @PTN      #PTN,Y
     C                     MOVE @DSC      #DSC,Z
     C*WEIGNT
JW1  C****       W9SYOS    MULT W9HAKO    @SRYO   80
     C****       @SRYO     MULT W9WEIT    @WEIT1 112       G
     C****       @WEIT1    DIV  1000      @WEIT2  82       G --> KG
     C           W9WEIT    MULT 2.2046    @WEIT3  82H      KG --> LB
     C                     ADD  @WEIT3    TWEIT
     C                     ADD  @WEIT3    TWEITT
     C*
     C                     Z-ADD@WEIT3    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #WTN,Y
     C                     MOVE POUT      WWEIT
     C                     MOVE @WEI      #WEI,Z
     C* QTY
JW1  C**                   Z-ADD@SRYO     PIN
"    C                     Z-ADDXSRYO     PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD0         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      #QTY,Z
      *
     C                     MOVE *BLANK    @@LOC
     C           K#AM      CHAINAAMPL11              95
     C           *IN95     IFEQ *OFF
     C                     Z-ADD1         X       20
     C           @SUPP     LOKUPDPT,X                    96
     C           *IN96     IFEQ *ON
     C                     SELEC
     C           SUPX      WHEQ *BLANK
      *
     C           KAN,X     IFNE *BLANK
     C                     MOVE LOC,X     @@LOC   6
     C                     ELSE
     C                     DO   15
     C                     ADD  1         X
     C           X         IFGT 15
     C                     LEAVE
     C                     ENDIF
     C           KAN,X     IFNE *BLANK
     C                     MOVE LOC,X     @@LOC   6
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           SUPX      WHEQ '1'
     C                     SUB  1         X
     C                     MOVE LOC,X     @@LOC   6
     C           SUPX      WHEQ '2'
     C                     ADD  1         X
     C                     MOVE LOC,X     @@LOC   6
     C                     ENDSL
      *
     C                     ELSE
     C           K#AM      CHAINFCEPL01              95
     C           *IN95     IFEQ *OFF
     C                     MOVE A2STRK    @@L1
     C                     MOVE A2STRT    @@L2
     C                     MOVE A2STRR    @@L3
     C                     MOVE A2STRD    @@L4
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           @@LOC     IFNE *BLANK
     C                     MOVE '-'       W@L11
     C                     MOVE '-'       W@L22
     C                     MOVE '-'       W@L33
     C                     MOVE @@L1      W@L1
     C                     MOVE @@L2      W@L2
     C                     MOVE @@L3      W@L3
     C                     MOVE @@L4      W@L4
     C                     ELSE
     C                     MOVE *BLANK    W@LOC
     C                     ENDIF
     C                     MOVE W@LOC     #LOC,Z
     C*
     C                     Z-ADD0         W9HAKO
     C                     Z-ADD0         W9SYOS
JW1  C                     Z-ADD0         XSRYO
     C                     Z-ADD0         W9WEIT
     C*
     C           EDATA     ENDSR
     C**************************************************************************
     C           #MEM      BEGSR
     C**************************************************************************
     C                     ADD  AFHAKO    W9HAKO
     C                     Z-ADDAFSYOS    W9SYOS
JW1  C           AFSYOS    MULT AFHAKO    WSRYO   80
"    C                     ADD  WSRYO     XSRYO
     C           K#FCEX    CHAINFCEPL01              95
     C           *IN95     IFEQ *OFF
     C           AFHAKO    MULT AFSYOS    @@TOT   90
     C           @@TOT     MULT A2KASI    @@TGHT 110
     C           @@TGHT    DIV  1000      @@TTT  113
     C                     ENDIF
     C******               ADD  AFWGT1    W9WEIT
     C                     ADD  @@TTT     W9WEIT
      *
     C           EMEM      ENDSR
     C**************************************************************************
     C           #MOVE3    BEGSR
     C**************************************************************************
     C                     MOVELWTONM     BFTONM
     C                     MOVELWSH01     BFSH01
     C                     MOVELWSH02     BFSH02
     C                     MOVELWSH03     BFSH03
     C                     MOVELWFRNM     BFFRNM
     C                     MOVELWFR01     BFFR01
     C                     MOVELWFR02     BFFR02
     C                     MOVE @@ORDR    BFVHNO
     C                     WRITEAFAPP70R
     C                     MOVEL*BLANK    #QTN
     C                     MOVEL*BLANK    #PTN
     C                     MOVEL*BLANK    #WTN
     C                     Z-ADD0         Y
     C                     ENDSR
     C**************************************************************************
     C           #MOVE4    BEGSR
     C**************************************************************************
     C*                    MOVEL*DATE     PFDATE           ORDER DATE
     C*                    MOVELWNOKI     PFDTDU           RECEIVE DATE
     C                     MOVELWVDNM     PFVDNM           VENDER NAME
     C                     MOVEL@@ORDR    PFCTNM           CONTACT NAME
     C                     WRITEAFAPP75R
     C                     MOVEL*BLANK    #NOP
     C                     MOVEL*BLANK    #DSC
     C                     MOVEL*BLANK    #QTY
     C                     MOVEL*BLANK    #WEI
     C                     Z-ADD0         Z
     C                     ENDSR
     C**************************************************************************
     C           #TOTAL    BEGSR
     C**************************************************************************
     C* TOTAL BOX WEIGT
     C           1.554     MULT THAKO     HWEIT   82
     C                     Z-ADD@@P       PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      @PALE
     C* NET WEIGNT
     C                     MOVE *BLANK    NWEIT  10
     C                     Z-ADDTWEITT    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      NWEIT
     C*
     C* GROSS WEIGNT
     C           45        MULT @@P       @@BW    30
     C                     ADD  @@BW      TWEITT
     C                     Z-ADDTWEITT    PIN
     C                     MOVEL*BLANK    POUT
     C                     Z-ADD2         PLEN
     C                     CALL 'AB#R2O'
     C                     PARM           PIN    305
     C                     PARM           POUT   30
     C                     PARM           PLEN    20
     C                     MOVE POUT      GWEIT
     C*
     C                     ENDSR
     C**************************************************************************
     C           #LAST     BEGSR
     C**************************************************************************
     C*TOTAL // BILL OF LADING //
     C                     SETOF                     20
     C           *HIVAL    SETGTAFAPP70R
     C                     READPAFAPP70R                 20
     C           *IN20     IFEQ '0'
     C                     MOVE NWEIT     BFWTNH
     C                     MOVE @TWEIT    BFPTNH
     C                     UPDATAFAPP70R
     C                     END
     C*TOTAL // PURCHASE REQUISITION //
     C                     SETOF                     20
     C           *HIVAL    SETGTAFAPP75R
     C                     READPAFAPP75R                 20
     C           *IN20     IFEQ '0'
     C                     MOVE @PALET    PFREF1
     C                     UPDATAFAPP75R
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C           #ADDR     BEGSR
     C**************************************************************************
      * SUPPLIER
     C           SUPLY     CHAINEDIPL401             21
     C           *IN21     IFEQ '0'
     C           E4SKJY    ANDEQ*BLANK
     C                     MOVELE4ADD1    WTONM  40
     C                     MOVELE4ADD2    WSH01  40
     C                     MOVELE4ADD3    WSH02  40
     C                     MOVELE4ADD4    WSH03  40
     C                     ELSE
     C                     MOVELWVDNM     WTONM
     C                     ENDIF
      * IAF ADDRESS
     C                     MOVEL'0111'    WWSUPP  4
     C                     SETOF                     21
     C           WWSUPP    CHAINEDIPL401             21
     C           *IN21     IFEQ '0'
     C           E4SKJY    IFEQ *BLANK
     C                     MOVELE4ADD1    WFRNM  40
     C                     MOVELE4ADD2    WFR01  40
     C                     MOVELE4ADD3    WFR02  40
     C                     END
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C           #DUE      BEGSR
     C**************************************************************************
     C                     Z-ADD*ZERO     WNOKI
     C                     MOVELSUPLY     KSUPP   40
     C                     MOVEL'A'       KTAIP   1
     C           KEY2      CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ*BLANK
     C                     Z-ADD0         WSKR    30
     C           T2SKR1    MULT T2SKR3    WSKR
     C                     SETOF                     21
     C           KEY3      SETLLAGDPL111
     C           1         DO   WSKR
     C                     READ AGDPL111                 21
     C           *IN21     IFEQ '0'
     C                     Z-ADDF8KAHZ    WNOKI   80
     C                     ENDIF
     C  N21                ENDDO
     C                     ENDIF
     C*
     C                     ENDSR
      *---------------------------------------------------------
** CMD
F3:END    F5:CREATE
** ER
DATE ERROR
ENTER Y OR N
NO DATA.
** TAB1/TAB2
2222   TO CURTIS
2111   TO FOREST
2333   TO J & M
2444   TO ELM
2666   TO MMC
2555   TO MAC
2777   TO MPI
28881 TO T&S(RC)
28882 TO T&S(HN)
2424   TO PTC
2929   TO DEPOR
2999   TO EMT
2828   TO SWD
3333   TO TALMA
3111   TO SEKIDO
4456   TO MITSUCHI
3222   TO SRA
3444   TO VICO
2112   TO FCO
4444  TO ROCKFORD SECONDARIES
5555   TO FAS
