     H            Y.
     F** AFDR9U *********************************************
     F* CHECK OUTSOURCE STORE IN FILE, IF THERE THEN DELETE *
     F*  LEC                        2023.10.17              *
     F*******************************************************
     FAFDPP9V UF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   20WJI
     I                                        3   40WFN
     I                                        5   60WSC
     I                                        7  140WDATE
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
     I                                        1   60NOW
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           P#PGM  10
     C                     PARM           PBARCD 20
      *
      *----------------------------------------------------*
      * MAINLINE                                           *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
      *
     C           PBARCD    SETLLAFDPP9V
      *
     C                     DO   *HIVAL
      *
     C           PBARCD    READEAFDPP9V                  50
     C   50                LEAVE
      *
     C           AFSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVE 'D'       AFSKJY
     C                     MOVELPOPR      AFSKWK    P
     C                     Z-ADDWDATE     AFSKDT
     C                     Z-ADDNOW       AFSKTM
     C                     MOVELP#PGM     AFCOPG
     C                     UPDATAFDPP9V1
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *----------------------------------------------------*
