     H            Y.
     F** AFDR9U2 ********************************************
     F* CHECK OUTSOURCE STORE IN FILE, IF THERE UPDATE      *
     F* RECEIVE INFO                                        *
     F*  LEC                        2024.01.05              *
     F*******************************************************
     FAFDPP9V UF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   20WJI
     I                                        3   40WFN
     I                                        5   60WSC
     I                                        7  140WDATE
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
     I                                        1   60NOW
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           P#PGM  10
     C                     PARM           PBARCD 20
     C                     PARM           PSUPP   4
     C                     PARM           PBINN   3
     C                     PARM           PODNO   60
     C                     PARM           PODDT   80
      *
      *----------------------------------------------------*
      * MAINLINE                                           *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
      *
     C           PBARCD    SETLLAFDPP9V
      *
     C                     DO   *HIVAL
      *
     C           PBARCD    READEAFDPP9V                  50
     C   50                LEAVE
      *
     C           AFSKJY    IFEQ ' '
     C                     ITER
     C                     ENDIF
      *
     C           AFBIN#    IFEQ PBINN
     C                     MOVELPOPR      AFRCWK    P
     C                     Z-ADDWDATE     AFRCDT
     C                     Z-ADDNOW       AFRCTM
     C                     MOVELP#PGM     AFCOPG
     C                     MOVELPSUPP     AFSUPP
     C                     Z-ADDPODNO     AFODNO
     C                     Z-ADDPODDT     AFODDT
     C                     UPDATAFDPP9V1
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *----------------------------------------------------*
