     H            Y
      ** AFDR23 **********************************************
      *  PARAMETER ENTRY FOR OUTSRC ORDER WITH LOCATION      *
      *  JW      2018.08.15                                  *
      ********************************************************
     FAFDPW23 CF  E                    WORKSTN
      *-----------------------------------------------------------
     E                    MSG     1   9 70
     E                    SUP     1  19  4
     I            DS
     I                                        1  12 XPART
     I                                        1   5 XSHN1
     I                                        6  10 XSHN2
     I                                       11  12 XSHN3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ************************************************************
      *  MAIN ROUTINE
      ************************************************************
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
     C                     EXFMTDSP01
      * END?
     C           *INKA     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      * RESET INDICATOERS
     C                     MOVE *BLANK    XMSG
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     MOVE *OFF      *IN43
      *
     C                     EXSR #CHK1
      *
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #PRINT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
      * CHECK DATA
      *-----------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN85
      * SUPPLIER
     C           XSUPP     IFEQ *BLANK
     C                     SETON                     4185
     C                     MOVELMSG,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     Z-ADD1         IX      20
     C           XSUPP     LOKUPSUP,IX                   99
     C           *IN99     IFEQ *OFF
     C                     SETON                     4185
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * START DATE
     C           XDATE     IFEQ *BLANK
     C                     SETON                     4285
     C                     MOVELMSG,3     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELXDATE     $SRC
     C                     CALL 'UTLR01'
     C                     PARM           $SRC   10
     C                     PARM           $TRUE   8
     C                     PARM           $RTN    1
     C           $RTN      IFNE *BLANK
     C                     SETON                     4285
     C                     MOVELMSG,4     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
     C                     MOVEL$TRUE     XDATE     P
      * PART
     C           XPART     IFEQ *BLANK
     C                     SETON                     4385
     C                     MOVELMSG,5     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     MOVELXPART     $SHIN
     C                     CALL 'UTLR21'
     C                     PARM           $SHIN  12
     C                     PARM           $LLOC   6
     C                     PARM           $LQC    50
     C                     PARM           $LPRC   3
     C                     PARM           $LDPT   40
     C                     PARM           $ZETI   4
     C                     PARM           $RTN2   1
     C           $RTN2     IFNE *BLANK
     C                     SETON                     4385
     C                     MOVELMSG,6     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR
     C                     MOVELMSG,7     XMSG
      *
     C           XCHK1     ENDSR
      *-----------------------------------------------------------
     C           #PRINT    BEGSR
      *
     C                     MOVELXDATE     $DATE
     C                     CALL 'AFDR22'
     C                     PARM           XSUPP
     C                     PARM           $DATE   8
     C                     PARM           $ZETI
      *
     C                     ENDSR
      *-----------------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     ENDSR
** MSG ---------------------------------------------------------------> (70)
ENTER SUPPLIER!                                                           1
SUPPLIER NOT FOUND!                                                       2
ENTER START DATE!                                                         3
DATE IS INVALID!                                                          4
ENTER IAF PART!                                                           5
INVALID PART#                                                             6
PRESS F5 TO PRINT...                                                      7
                                                                          8
                                                                          9
** SUP, SUPPLIER (4)
2111 FOREST CITY                                                          1
2112 FCO                                                                  2
2222 CURTIS                                                               3
2333 J&M PLATING                                                          3
2424 PTC                                                                  3
2444 ELM PLATING                                                          3
2555 MAC                                                                  3
2666 MMC                                                                  3
2777 MPI                                                                  3
2828 SWD                                                                  3
2929 DEPOR                                                                3
2999 EMT                                                                  3
3111 SEKIDO                                                               3
4456 MITSUCHI                                                             3
3222 SRA                                                                  3
3333 TALMA                                                                3
3444 VICO                                                                 3
4444 ROCKFORD 2ND                                                         3
5555 FAS                                                                  3
