     H            Y.                                    1
     H** AFDR83 *******************************************************
     H*  OUT SOURCE ORDER RECEIVING(SRA INPROCESS)
     H*
     H* TCHK1 01/13/11 CREATE
     H* TCHK2 01/04/12 RMV SRA# DUPLICATE CHECK
     H**************************************************************************
     FAFDPW83 CF  E                    WORKSTN
     FFCETL11 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAFDPL50 UF  E           K        DISK                      A
     F*AFDPL51 IF  E           K        DISK
     F*            AFDPP501                          KRENAMEAFDPL50R
      *--------------------------------------------------------------
     E                    ER      1  10 15
     E*
     E                    CDEP       15  4 0             C DEPARTMENT
     E                    NDEP       15  4 0             N DEPARTMENT
     E                    ODEP       15  4 0             O DEPARTMENT
     E*
     E                    CHG        15 10 0
     I**************************************************************************
     I* BARCODE
     I* APICS(INTRA) KANBAN
     I*(KANRI CODE+ZETAI NO+TEHAI NO+PAGE NO+NIJI KAKO KUBUN+TAISYO KUBN+
     I            DS
     I                                        1  15 BARCD1
     I                                        1   1 BCOCD
     I                                        2   5 BZETI
     I                                        6   80BTEHI
     I                                        6   8 WTEHI
     I                                        8   8 KCLAS
     I                                        9  10 BPAGE
     I                                       11  11 BNIJI
     I                                       12  12 BTICD
     I                                       13  13 BYUKO
     I                                       14  14 BHASY
     I                                       15  15 BCKDT
     I            DS
     I                                        1   8 BARCD3
     I                                        1   7 B@LOT#
     I                                        8   8 B@LOTC
     I            DS
     I                                        1   8 W@LOT
     I                                        1   7 W@LOT#
     I                                        8   8 W@LOTC
     I**************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1  60 NDEP
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  60 ODEP
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I*
     I                                        1 150 CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  100@CHG
     I                                        1   80@CHGDT
      *-----------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C           @@ID      CASEQ'02'      #DSP02
     C           @@ID      CASEQ'03'      #DSP03
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C*
     C           *ENTRY    PLIST
     C                     PARM           PUSR   10
     C                     PARM           PWKCD   6
     C                     PARM           SUPLY   4
     C                     PARM           PID     1
      *
     C                     MOVELSUPLY     @SUPP   40
     C                     MOVELPID       @@3     3
     C                     MOVE '01'      @@ID    2
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
      *
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    W@DATE  80
     C                     Z-ADDWSSTM6    @@TIM   60
      * FOR KANBAN CHECK DEGIT
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
      *
     C                     ENDSR
     C**************************************************************************
     C*    1ST SCREEN (SCAN APICS(INTRA) KANBAN)
     C**************************************************************************
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
     C*
     C                     OTHER
     C                     EXSR @CHK1
     C           *IN30     IFEQ '0'
     C                     MOVEL'02'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK1
     C**************************************************************************
     C           @CHK1     BEGSR
     C*
     C                     MOVE *BLANK    MSG
     C                     SETOF                     3061
     C*
     C                     DO
     C*
     C           BARCD1    IFEQ *BLANK
     C                     SETON                     3061
     C                     MOVELER,1      MSG
     C                     LEAVE
     C                     END
     C*
     C           BZETI     CHAINFCETL11              90
     C           *IN90     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     SETON                     3061
     C                     MOVELER,2      MSG
     C                     LEAVE
     C                     END
     C* CHECK DIGIT
     C                     MOVELBARCD1    PMAREA    P
     C                     MOVE '014'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C           PMRTCD    IFNE *BLANK
     C                     SETON                     3061
     C                     MOVELER,3      MSG
     C                     LEAVE
     C                     END
     C           PMCHK     IFNE BCKDT
     C                     SETON                     3061
     C                     MOVELER,3      MSG
     C                     LEAVE
     C                     END
     C* SUPPLIER
     C           K#KEY     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#KEY     CHAINAAMPL11              90
     C           *IN90     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     SETON                     3061
     C                     MOVELER,4      MSG
     C                     LEAVE
     C                     END
     C*
     C                     EXSR @SET1@
     C           @SUPP     LOKUPCDEP                     91
     C  N91      @SUPP     LOKUPNDEP                     91
     C           *IN91     IFEQ *OFF
     C                     SETON                     3061
     C                     MOVELER,5      MSG
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *----------------------------------------------
     C           @SET1@    BEGSR
      *----------------------------------------------
     C                     CLEARCDEP
     C*
     C                     DO   15        J       20
     C*
     C                     MOVELCHG,J     @CHG
     C           @CHGDT    IFGT W@DATE
     C                     Z-ADDODEP,J    CDEP,J           DEPARTMENT
     C                     ELSE
     C                     Z-ADDNDEP,J    CDEP,J           DEPARTMENT
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*    2ND SCREEN (SRA PROCESS LOT#)
     C**************************************************************************
     C           #DSP02    BEGSR
      *
     C                     EXFMTDSP02
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
     C*
     C                     OTHER
     C                     EXSR @CHK2
     C           *IN30     IFEQ *OFF
     C                     MOVE '03'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     ENDIF
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK2
     C**************************************************************************
     C           @CHK2     BEGSR
     C*
     C                     DO
     C*
     C                     MOVE *BLANK    MSG
     C                     SETOF                     3062
     C*
     C           BARCD2    IFEQ *BLANK
     C                     MOVELER,1      MSG
     C                     SETON                     3062
     C                     LEAVE
     C                     END
     C*
TCHK2C*          K#L50A    KLIST
TCHK2C*                    KFLD           SUPLY
TCHK2C*                    KFLD           BZETI
TCHK2C*                    KFLD           WTEHI
TCHK2C*                    KFLD           BPAGE
TCHK2C*                    KFLD           BARCD2
TCHK2C*          K#L50A    CHAINAFDPL50              92
TCHK2C*          *IN92     IFEQ *OFF
TCHK2C*          A5SKJY    ANDEQ*BLANK
TCHK2C*                    MOVELER,6      MSG
TCHK2C*                    SETON                     3062
TCHK2C*                    LEAVE
TCHK2C*                    END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*    3RD SCREEN (LOT#)
     C**************************************************************************
     C           #DSP03    BEGSR
      *
     C                     EXFMTDSP03
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
     C                     OTHER
     C                     DO
     C                     EXSR @CHK3
     C           *IN30     IFEQ *ON
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     LEAVE
     C                     END
     C           *INKE     IFEQ *ON
     C           LOT#01    IFNE *BLANK
     C           LOT#02    ANDNE*BLANK
     C           LOT#03    ANDNE*BLANK
     C           BARCD3    ANDNE*BLANK
     C                     EXSR @UPD
     C                     MOVEL'01'      @@ID
     C                     ELSE
     C                     SETON                     3063
     C                     MOVELER,7      MSG
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     LEAVE
     C                     END
     C                     END
     C                     ENDDO
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK3
     C**************************************************************************
     C           @CHK3     BEGSR
     C*
     C                     DO
     C*
     C                     MOVE *BLANK    MSG
     C                     SETOF                     3063
     C*
     C           BARCD3    IFEQ *BLANK
     C                     MOVE ER,1      MSG
     C                     SETON                     3063
     C                     LEAVE
     C                     END
      *
     C           BARCD3    IFEQ LOT#01
     C           BARCD3    OREQ LOT#02
     C           BARCD3    OREQ LOT#03
     C                     MOVELER,6      MSG
     C                     SETON                     3063
     C                     LEAVE
     C                     END
      *
     C           K#L51A    KLIST
     C                     KFLD           SUPLY
     C                     KFLD           BZETI
     C                     KFLD           WTEHI
     C                     KFLD           BPAGE
     C                     KFLD           B@LOT#
TEMP C*          K#L51A    CHAINAFDPL51              92
TEMP C*          *IN92     IFEQ *OFF
TEMP C*          A5SKJY    ANDEQ*BLANK
TEMP C*                    MOVELER,6      MSG
TEMP C*                    SETON                     3063
TEMP C*                    LEAVE
TEMP C*                    END
     C*
     C                     SELEC
     C           LOT#01    WHEQ *BLANK
     C                     MOVELBARCD3    LOT#01
     C                     MOVEL*BLANK    BARCD3
     C           LOT#02    WHEQ *BLANK
     C                     MOVELBARCD3    LOT#02
     C                     MOVEL*BLANK    BARCD3
     C           LOT#03    WHEQ *BLANK
     C                     MOVELBARCD3    LOT#03
     C                     MOVEL*BLANK    BARCD3
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*        UPDATE
     C**************************************************************************
     C           @UPD      BEGSR
     C*
     C           K#L50B    KLIST
     C                     KFLD           SUPLY
     C                     KFLD           BZETI
     C                     KFLD           WTEHI
     C                     KFLD           BPAGE
     C                     KFLD           BARCD2
     C                     KFLD           K@LOT#  7
     C*
     C                     MOVELLOT#01    W@LOT
     C                     MOVELW@LOT#    K@LOT#
     C                     EXSR @UPDS1
     C*
     C                     MOVELLOT#02    W@LOT
     C                     MOVELW@LOT#    K@LOT#
     C                     EXSR @UPDS1
     C*
     C                     MOVELLOT#03    W@LOT
     C                     MOVELW@LOT#    K@LOT#
     C                     EXSR @UPDS1
     C*
     C                     MOVELBARCD3    W@LOT
     C                     MOVELW@LOT#    K@LOT#
     C                     EXSR @UPDS1
     C*
     C                     MOVEL*BLANK    BARCD1
     C                     MOVEL*BLANK    BARCD2
     C                     MOVEL*BLANK    BARCD3
     C                     MOVEL*BLANK    LOT#01
     C                     MOVEL*BLANK    LOT#02
     C                     MOVEL*BLANK    LOT#03
     C*
     C                     EXFMTDSPOK
     C*
     C                     ENDSR
     C* ----------------------------------------------------
     C           @UPDS1    BEGSR
     C*
     C           K#L50B    CHAINAFDPL50              92
     C*
     C                     CLEARAFDPP501
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KODT
     C                     Z-ADDWSSTM6    A5KOTM
     C                     MOVEL#USER     A5KOME                  USER
     C                     MOVEL#PGM      A5KOPG                  PGM-ID
     C                     MOVELPWKCD     A5WORK                  WORKER CD
     C                     MOVELBCOCD     A5KANR           CONTROL CODE
     C                     MOVELBZETI     A5ZETI           ABSOLUTE
     C                     MOVELWTEHI     A5TEHI           TEHAI #
     C                     MOVELBPAGE     A5PAGE           PAGE #
     C                     MOVELBNIJI     A5NIJI           2ND TREATMENT
     C                     MOVELBTICD     A5TAIS           TARGET TYPE
     C                     MOVELBYUKO     A5SYUK           SHIP EFECTIVE
     C                     MOVELBHASY     A5HKOS           CONTAINER TYPE
     C                     MOVELBCKDT     A5CHKD           CHECK DIGIT
     C                     MOVELSUPLY     A5SUPP
     C                     MOVELBARCD2    A5LOTS
     C                     MOVELW@LOT#    A5LTI1
     C                     MOVELW@LOTC    A5LTI2
     C                     Z-ADDWSSDAT    A5SCDT
     C                     Z-ADDWSSTM6    A5SCTM
     C           *IN92     IFEQ *ON
     C                     WRITEAFDPP501
     C                     ELSE
     C                     UPDATAFDPP501
     C                     END
     C*
     C                     ENDSR
      *---------------------------------------------------------
** ERROR MESSAGE
BARCODE ERROR.
PART# ERROR.
CHECK DIGIT ERROR.
PROCESS ERROR.
SUPPLIER ERROR.
DUPLICATE ERROR.
IAF LOT# NOT YET.



