     H            Y.                                    1
     H** AFDR73 *******************************************************
     H*  RETRIVAL 3POINT SCAN BY A-PICS
     H*
     H* KIRI  2017/02/22
     H**************************************************************************
     FAFDPW73 CF  E                    WORKSTN
     F*
     FFCETL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     F*
     FAFDPP40 O   E                    DISK
      *--------------------------------------------------------------
     E                    CHG        15 10 0
     E*
     E                    @DEP       15  4 0             DEPART
     E                    @K#        15  1               KANBAN
     E                    DP         15  4 0             N DEPART
     E                    KK         15  1               N KANBAN
     E                    DEX        15  4 0             O DEPARTMENT
     E                    KX         15  1               O KANBAN
     E*
     E                    ER      1  10 15
     E                    TAB1    1   5  4   TAB2   15
     E                    BCD2       14  1
     E                    BCDB       14  1
     E*
     E                    @BR1     9999 15               : BARCD1
     I**************************************************************************
     I* BARCODE
     I* APICS(INTRA) KANBAN
     I*(KANRI CODE+ZETAI NO+TEHAI NO+PAGE NO+NIJI KAKO KUBUN+TAISYO KUBN+
     I            DS
     I                                        1 240 BARCD1
     I                                        1  15 BCODE
     I                                        1   1 BCOCD
     I                                        2   5 BZETI
     I                                        6   80BTEHI
     I                                        6   8 WTEHI
     I                                        8   8 KCLAS
     I                                        9  10 BPAGE
     I                                       11  11 BNIJI
     I                                       12  12 BTICD
     I                                       13  13 BYUKO
     I                                       14  14 BHASY
     I                                       15  15 BCKDT
     I            DS
     I                                        1  14 BARCD2
     I            DS
     I                                        1  12 B@SHIN
     I                                        1   5 B@SHN1
     I                                        6  10 B@SHN2
     I                                       12  12 B@SHN3
     I            DS
     I                                        1  11 BARCD3
     I                                        1  11 B@SERL
     I**************************************************************************
     I            DS
     I                                        1 150 CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  100@CHG
     I                                        1   80@CHGDT
     I            DS
     I                                        1  60 DP
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  60 DEX
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  15 KX
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I*
     I**************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                        1  10 W#PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      *-----------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C           @@ID      CASEQ'02'      #DSP02
     C           @@ID      CASEQ'03'      #DSP03
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C*
     C           *ENTRY    PLIST
     C                     PARM           PWKCD   6
     C                     PARM           PUSR   10
     C                     PARM           SUPLY   4
     C*
     C           KEY1      KLIST
     C                     KFLD           A2BHB1           INTERNAL PART
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           K#AFD     KLIST
     C                     KFLD           SUPLY
     C                     KFLD           K@BIN   3
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C* AFDPL11
     C           K#11      KLIST
     C                     KFLD           BCOCD            CONTROL CD
     C                     KFLD           BZETI            ABSOLUTE #
     C                     KFLD           WTEHI            TEHAI
     C                     KFLD           BPAGE            PAGE
     C                     KFLD           BNIJI            2ND.TREATEMENT
     C                     KFLD           BTICD            TARGET TYPE
     C                     KFLD           BYUKO            SHIP EFFECTIVE
     C                     KFLD           BHASY            CONTAINER TYPE
     C                     KFLD           BCKDT            CHECK DIGIT
      *
     C                     MOVE SUPLY     @SUPP   40
     C                     Z-ADD*ZERO     K@YY
     C                     Z-ADD*ZERO     K@MM
     C                     Z-ADD*ZERO     K@DD
     C                     MOVE '01'      @@ID    2
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C           SUPLY     LOKUPTAB1      TAB2           10
     C                     MOVELTAB2      TITL
      *
     C                     CLEAR@BR1                       : BARCD1
     C                     Z-ADD0         K       40
      *
     C                     ENDSR
     C**************************************************************************
     C*    1ST SCREEN (APICS KANBAN)
     C**************************************************************************
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
     C                     SETOF                     30
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
     C*
     C                     OTHER
     C                     EXSR @CHK1
     C           *IN30     IFEQ '0'
     C                     MOVEL'02'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK1
     C**************************************************************************
     C           @CHK1     BEGSR
     C*
     C                     MOVE *OFF      *IN30
     C                     MOVE *BLANK    MSG
     C*
      *
      * convert qr code to 1D barcode....
     C                     MOVELBARCD1    KTYPE   3
      *
     C           KTYPE     IFEQ 'B01'
     C           KTYPE     OREQ 'C01'
     C                     MOVELBARCD1    P1QR1 256
     C                     MOVEL*BLANKS   P1QR2 256
     C                     MOVEL*BLANKS   P9BAR  20
     C                     CALL 'UEXR13'
     C                     PARM           P1QR1
     C                     PARM           P1QR2
     C                     PARM           P9BAR
      *
     C                     MOVEL*BLANKS   BARCD1
     C                     MOVELP9BAR     BCODE
     C                     MOVEL*BLANKS   P9BAR
     C                     ENDIF
      *
     C           KCLAS     IFEQ 'A'
     C                     SETON                     30
     C                     MOVE ER,1      MSG
     C                     GOTO #ECHK1
     C                     ENDIF
     C*
     C           BCODE     LOKUP@BR1                     90:EQ
     C           *IN90     IFEQ *ON
     C                     SETON                     30
     C                     MOVE ER,5      MSG
     C                     GOTO #ECHK1
     C                     ENDIF
     C*
     C* ABSOLUTE NUMBER CHECK
     C           BZETI     SETLLFCETL11
     C           #ZETI     TAG
     C           BZETI     READEFCETL11                  90
     C           *IN90     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     30
     C                     MOVE ER,2      MSG
     C                     GOTO #ECHK1
     C                     END
     C                     ELSE
     C                     SETON                     30
     C                     MOVE ER,2      MSG
     C                     GOTO #ECHK1
     C                     END
     C*
     C* WEIGHT CHECK
     C           A2KASI    IFEQ *ZERO
     C                     SETON                     30
     C                     MOVE ER,3      MSG
     C                     GOTO #ECHK1
     C                     END
      *
      * DIVISION CHECK
     C                     MOVE *BLANK    @KK
     C           KEY1      CHAINAAMPL11              91
     C           1         DO   15        X       30
     C                     MOVELCHG,X     @CHG
     C           @CHGDT    IFGT *DATE
     C                     MOVELKX,X      @K#,X            KANBAN
     C                     Z-ADDDEX,X     @DEP,X           DEPARTMENT
     C                     ELSE
     C                     MOVELKK,X      @K#,X            KANBAN
     C                     Z-ADDDP,X      @DEP,X           DEPARTMENT
     C                     END
     C                     ENDDO
     C           1         DO   15        X       30
     C           @DEP,X    IFEQ @SUPP
     C           @K#,X     ANDNE*BLANK
     C                     MOVE @K#,X     @KK     1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           @KK       IFEQ *BLANK
     C           1         DO   15        X       30
     C           DP,X      IFEQ @SUPP
     C           KK,X      ANDNE*BLANK
     C                     MOVE KK,X      @KK     1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           @KK       IFEQ *BLANK
     C                     SETON                     30
     C                     MOVE ER,4      MSG
     C                     GOTO #ECHK1
     C                     ENDIF
      *
     C           KEY1      CHAINAGAPL31              91
     C           *IN91     IFEQ *OFF
     C           CBSKJY    ANDNE*BLANK
     C                     SETON                     91
     C                     ENDIF
      *
     C           *IN91     IFEQ *ON
     C                     SETON                     30
     C                     MOVE ER,4      MSG
     C                     GOTO #ECHK1
     C                     ENDIF
     C*
     C                     Z-ADDA2SSYS    @@QTY   50       QTY/CONT.
     C           #ECHK1    TAG
      *
     C                     ENDSR
     C**************************************************************************
     C*    2ND SCREEN (PART#)
     C**************************************************************************
     C           #DSP02    BEGSR
      *
     C                     EXFMTDSP02
     C                     SETOF                     3039
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
      *
     C                     OTHER
     C                     EXSR @CHK2
     C           *IN30     IFEQ *OFF
     C                     MOVE '03'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C   39                EXSR #PASWD
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK2
     C**************************************************************************
     C           @CHK2     BEGSR
     C*
     C                     DO
     C*
     C                     MOVE *BLANK    MSG
     C                     SETOF                     3039
     C*
     C                     MOVEABARCD2    BCD2
     C                     MOVEL*BLANK    BCDB
     C                     Z-ADD*ZERO     X
     C                     Z-ADD*ZERO     Y       20
     C                     DO   *HIVAL
     C                     ADD  1         X
     C           X         IFGT 14
     C                     LEAVE
     C                     END
     C           BCD2,X    IFNE *BLANK
     C           BCD2,X    ANDNE'-'
     C                     ADD  1         Y
     C                     MOVELBCD2,X    BCDB,Y
     C                     END
     C                     ENDDO
     C                     MOVEABCDB      W@014  14
     C                     MOVELW@014     B@SHIN
     C*
     C           B@SHN1    IFEQ *BLANK
     C                     MOVE ER,7      MSG
     C                     SETON                     30
     C                     LEAVE
     C                     END
      *
     C                     MOVELB@SHN1    K@SHN1
     C                     MOVELB@SHN2    K@SHN2
     C                     MOVELB@SHN3    K@SHN3
      *
     C           K#FCE     KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C                     MOVEL*BLANK    K@SHN3
     C           K#FCE     CHAINFCEPL01              90
     C           *IN90     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     MOVELER,6      MSG
     C                     SETON                     30
     C                     LEAVE
     C                     END
     C*                                             ** 39 = PASSWORD **
     C           A2ZETI    IFNE BZETI
     C                     MOVELER,6      MSG
     C                     SETON                     3039
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*    3RD SCREEN (SERIAL#)
     C**************************************************************************
     C           #DSP03    BEGSR
      *
     C                     EXFMTDSP03
     C                     SETOF                     30
      *
     C                     SELEC
     C           *INKC     WHEQ '1'
     C                     MOVEL'99'      @@ID    2
     C*
     C                     OTHER
     C                     EXSR @CHK3
     C           *IN30     IFEQ *OFF
     C                     EXSR @UPD
     C                     MOVE '01'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK3
     C**************************************************************************
     C           @CHK3     BEGSR
     C*
     C                     DO
     C*
     C                     MOVE *BLANK    MSG
     C                     SETOF                     30
     C*
     C           BARCD3    IFEQ *BLANK
     C                     MOVE ER,7      MSG
     C                     SETON                     30
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*        UPDATE
     C**************************************************************************
     C           @UPD      BEGSR
     C*
     C                     TIME           WSDT
     C*
     C                     CLEARAFDPP401
     C                     Z-ADDWSSDAT    A4KODT
     C                     Z-ADDWSSTM6    A4KOTM
     C                     MOVEL#USER     A4KOME                  USER
     C                     MOVEL#PGM      A4KOPG                  PGM-ID
     C                     MOVELPWKCD     A4WORK                  WORKER CD
     C                     MOVELBCOCD     A4KANR           CONTROL CODE
     C                     MOVELBZETI     A4ZETI           ABSOLUTE
     C                     MOVELBTEHI     A4TEHI           TEHAI #
     C                     MOVELBPAGE     A4PAGE           PAGE #
     C                     MOVELBNIJI     A4NIJI           2ND TREATMENT
     C                     MOVELBTICD     A4TAIS           TARGET TYPE
     C                     MOVELBYUKO     A4SYUK           SHIP EFECTIVE
     C                     MOVELBHASY     A4HKOS           CONTAINER TYPE
     C                     MOVELBCKDT     A4CHKD           CHECK DIGIT
      *
     C                     MOVELSUPLY     A4SUPP
     C**********           MOVEL          A4FILR
     C                     Z-ADDWSSDAT    A4SCDT
     C                     Z-ADDWSSTM6    A4SCTM
     C                     Z-ADD0         A4ODYY
     C                     Z-ADD0         A4ODMM
     C                     Z-ADD0         A4ODDD
     C                     Z-ADD0         A4ODNO
     C                     MOVELB@SERL    A4SERL
     C                     WRITEAFDPP401
     C*
     C                     ADD  1         K
     C                     MOVELBARCD1    @BR1,K
     C*
     C                     MOVEL*BLANK    BARCD1
     C                     MOVEL*BLANK    BARCD2
     C                     MOVEL*BLANK    BARCD3
     C*
     C                     ENDSR
     C**************************************************************************
     C*        PASSWARD
     C**************************************************************************
     C           #PASWD    BEGSR
     C* ERR CHECK  PASSWORD LOCK
     C                     Z-ADD2         P1PGM
     C                     MOVELMSG       P1ERR     P
     C                     MOVELW#PGM     P1PID
     C                     MOVELPWKCD     P1KOME    P
     C                     Z-ADD*ZERO     P1DTTM
     C                     CALL 'AM#R09'
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM 140
     C                     ENDSR
      *---------------------------------------------------------
      *---------------------------------------------------------
** ERROR MESSAGE
NOT A-PICS                      01
ABSOLUTE NO.                    02
COMPLET. WEIGHT                 03
NOT THIS SUPPLY                 04
DUPLICATE.                      05
PART# ERROR.                    06
BLANK.                          07
                                08
                                09
                                10
** TAB1 / TAB2
5555** FAS RETRVL**
