     H            Y.                                    1
     H** AFDR71 *******************************************************
     H*  OUT SOURCE ORDER(FAS)
     H*
     H* TCHK1 09/20/12 CREATE
%1   H* KIRI  2017/02/22 INTRA KANBAN(KCLAS = 'A')
JW1  H* JW    2018/11/20 ADD AFDPP12
JW2  H* JW    2019/01/24 USE ADFIL2 FOR @@QTY
     H**************************************************************************
     FAFDPW71 CF  E                    WORKSTN
     F*
     FFCETL11 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAFDPL11 IF  E           K        DISK
     F            AFDPP101                          KRENAMEAFDL11
     FAFDPP10 O   E                    DISK
JW1  FAFDPP12 O   E                    DISK
     FAFDPP30 O   E                    DISK
%1    *
%1    * INTRA-PROCESS KANBAN M/F *
%1   FABHTL02 IF  E           K        DISK
      *--------------------------------------------------------------
     E                    CHG        15 10 0
     E*
     E                    @DEP       15  4 0             DEPART
     E                    @K#        15  1               KANBAN
     E                    DP         15  4 0             N DEPART
     E                    KK         15  1               N KANBAN
     E                    DEX        15  4 0             O DEPARTMENT
     E                    KX         15  1               O KANBAN
     E*
     E                    BCD        15  1
     E*
     E                    ER      1  13 15
     E                    TAB1    1   1  5   TAB2   15
%1   E                    KBN     1   2 13
     I*
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I**************************************************************************
     I* BARCODE
     I*(KANRI CODE+ZETAI NO+TEHAI NO+PAGE NO+NIJI KAKO KUBUN+TAISYO KUBN+
     I**************************************************************************
     I* APICS KANBAN
     I            DS
     I                                        1  15 BCD
     I                                        1  15 BARC1
     I                                        1   1 BCOCD
     I                                        2   5 BZETI
     I                                        6   80BTEHI
     I                                        6   8 WTEHI
     I                                        8   8 KCLAS
     I                                        9  10 BPAGE
     I                                        8  10 HNHN
     I                                       11  11 BNIJI
     I                                       12  12 BTICD
     I                                       13  13 BYUKO
     I                                       14  14 BHASY
     I                                       15  15 BCKDT
     I            DS
     I                                        1 150 CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  100@CHG
     I                                        1   80@CHGDT
     I            DS
     I                                        1  60 DP
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  60 DEX
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  15 KX
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I*
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      * SYSTEM DATE
JW1  I            DS
"    I                                        1  140SDATE
"    I                                        1   60NOW
"    I                                        7  140TODAY
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *-----------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      #DSP01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------
     C*
     C           *ENTRY    PLIST
     C                     PARM           PUSR   10
     C                     PARM           PWKCD   6
     C                     PARM           SUPLY   4
     C                     PARM           PID     1
     C*
     C           KEY1      KLIST
     C                     KFLD           A2BHB1           INTERNAL PART
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C*
     C           KEY4      KLIST
     C                     KFLD           BCOCD            CONTROL CD
     C                     KFLD           BZETI            ABSOLUTE #
     C                     KFLD           WTEHI            TEHAI
     C                     KFLD           BPAGE            PAGE
     C                     KFLD           BNIJI            2ND.TREATEMENT
     C                     KFLD           BTICD            TARGET TYPE
     C                     KFLD           BYUKO            SHIP EFFECTIVE
     C                     KFLD           BHASY            CONTAINER TYPE
     C                     KFLD           BCKDT            CHECK DIGIT
      *
     C                     MOVE SUPLY     @SUPP   40
     C           SUPLY     CAT  PID:0     SCODE   5 P
     C           SCODE     LOKUPTAB1      TAB2           10
     C                     MOVELTAB2      TITL
     C                     MOVE KBN,1     KANBN
%1   C                     MOVE KBN,2     KANBN2
      *
     C                     MOVE '01'      @@ID    2
     C                     MOVE *BLANK    MSG
     C                     SETOF                     30
     C*
     C                     TIME           WSDT
     C*
     C                     ENDSR
     C**************************************************************************
     C*    1ST SCREEN (SCAN APICS KANBAN)
     C**************************************************************************
     C           #DSP01    BEGSR
      *
     C                     EXFMTDSP01
      *
     C                     SELEC
     C*
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C*
     C                     OTHER
     C                     EXSR @CHK1
     C           *IN30     IFEQ '0'
     C                     EXSR @WRT
     C                     MOVEL*BLANK    BARC1
     C                     MOVE '01'      @@ID
     C                     ELSE
     C                     EXFMTERR99
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C                     END
     C*
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK1
     C**************************************************************************
     C           @CHK1     BEGSR
     C*
     C                     MOVE *OFF      *IN30
     C                     MOVE *BLANK    MSG
     C*
     C* ABSOLUTE NUMBER CHECK
     C           BZETI     SETLLFCETL11
     C           #ZETI     TAG
     C           BZETI     READEFCETL11                  90
     C           *IN90     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     30
     C                     MOVE ER,3      MSG
     C                     GOTO #ECHK1
     C                     END
     C                     ELSE
     C                     SETON                     30
     C                     MOVE ER,3      MSG
     C                     GOTO #ECHK1
     C                     END
     C*
     C* WEIGHT CHECK
     C           A2KASI    IFEQ *ZERO
     C                     SETON                     30
     C                     MOVE ER,7      MSG
     C                     GOTO #ECHK1
     C                     END
     C*
     C* ORDER DETAIL FILE
     C           KEY4      SETGTAFDPL11
     C           KEY4      REDPEAFDPL11                  93
     C           *IN93     IFEQ '0'
     C           ADODYY    IFEQ *ZERO
     C           ADSKJY    ANDEQ*BLANK
     C           ADSUPP    ANDEQSUPLY
     C                     SETON                     30
     C                     MOVE ER,4      MSG
     C                     GOTO #ECHK1
     C                     END
     C                     END
      *
      * DIVISION CHECK
     C                     MOVE *BLANK    @KK
     C           KEY1      CHAINAAMPL11              91
     C           1         DO   15        X       30
     C                     MOVELCHG,X     @CHG
     C           @CHGDT    IFGT *DATE
     C                     MOVELKX,X      @K#,X            KANBAN
     C                     Z-ADDDEX,X     @DEP,X           DEPARTMENT
     C                     ELSE
     C                     MOVELKK,X      @K#,X            KANBAN
     C                     Z-ADDDP,X      @DEP,X           DEPARTMENT
     C                     END
     C                     ENDDO
     C           1         DO   15        X       30
     C           @DEP,X    IFEQ @SUPP
     C           @K#,X     ANDNE*BLANK
     C                     MOVE @K#,X     @KK     1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           @KK       IFEQ *BLANK
     C           1         DO   15        X       30
     C           DP,X      IFEQ @SUPP
     C           KK,X      ANDNE*BLANK
     C                     MOVE KK,X      @KK     1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           @KK       IFEQ *BLANK
     C                     SETON                     30
     C                     MOVE ER,10     MSG
     C                     GOTO #ECHK1
     C                     ENDIF
      *
%1   C           KCLAS     IFNE 'A'
     C           KEY1      CHAINAGAPL31              91
     C           *IN91     IFEQ *OFF
     C           CBSKJY    ANDNE*BLANK
     C                     SETON                     91
     C                     ENDIF
     C                     Z-ADDA2SSYS    @@QTY   50       QTY/CONT.
JW2  C                     MOVEL'A2SSYS 1'ADFIL2
%1   C*
%1   C                     ELSE
%1   C                     EXSR #ABH
%1   C                     ENDIF
%1    *
%1   C           *IN91     IFEQ *ON
     C                     SETON                     30
     C                     MOVE ER,10     MSG
     C                     GOTO #ECHK1
%1   C                     ENDIF
     C*
     C           #ECHK1    TAG
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT
     C**************************************************************************
     C           @WRT      BEGSR
     C*
     C                     CLEARAFDPP101
     C                     CLEARAFDPP301
      *
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    ADKODT
     C                     Z-ADDWSSTM6    ADKOTM
     C                     MOVE PUSR      ADKOME                  USER
     C                     MOVEL#PGM      ADKOPG                  PGM-ID
     C                     MOVE PWKCD     ADWORK                  WORKER CD
     C                     MOVE BCOCD     ADKANR           CONTROL CODE
     C                     MOVE BZETI     ADZETI           ABSOLUTE
     C                     MOVE WTEHI     ADTEHI           TEHAI #
     C                     MOVE BPAGE     ADPAGE           PAGE #
     C                     MOVE BNIJI     ADNIJI           2ND TREATMENT
     C                     MOVE BTICD     ADTAIS           TARGET TYPE
     C                     MOVE BYUKO     ADSYUK           SHIP EFECTIVE
     C                     MOVE BHASY     ADHKOS           CONTAINER TYPE
     C                     MOVE BCKDT     ADCHKD           CHECK DIGIT
     C                     MOVE A2BHB1    ADPAR1           INTERNAL PART
     C                     MOVE A2BHB2    ADPAR2
     C                     MOVE A2BHB3    ADPAR3
     C                     Z-ADD@@QTY     ADSYOS           QTY/CONT.
     C                     MOVE SUPLY     ADSUPP
     C                     Z-ADDA2KASI    ADWGHT
      *
     C                     MOVELPID       ADFILR
      *
     C                     WRITEAFDPP101
      *
      * call pgm to update/remove from outsource store in file
     C                     MOVEL#PGM      P#PGM  10 P
     C                     MOVELBARC1     PBARCD 20 P
      *
     C                     CALL 'AFDR9U'
     C                     PARM           PWKCD
     C                     PARM           P#PGM
     C                     PARM           PBARCD
      *
     C                     WRITEAFDPP301
JW1   * CREATE AFDPP12
 |   C                     TIME           SDATE
 |   C                     Z-ADDTODAY     ADCRDT
 |   C                     Z-ADDNOW       ADCRTM
 |   C                     MOVEL#USER     ADCRME
 |   C                     MOVEL#WSID     ADCRWS
 |   C                     MOVEL#PGM      ADCRPG
 |   C                     MOVELBARC1     ADBAR
JW1  C                     WRITEAFDPP121
      *
     C                     ENDSR
     C*
%1    *================================================================
 |    * INTRA-PROCESS KANBAN M/F CHECK
 |    *================================================================
 |   C           #ABH      BEGSR
 |   C*
 |   C           KEY1      SETLLABHTL02
 |   C                     DO   *HIVAL
 |   C           KEY1      READEABHTL02                  91
 |   C   91                LEAVE
 |   C           M6SKJY    IFEQ 'D'
 |   C           M6SKHZ    ANDLEWSSDAT
 |   C                     ITER
 |   C                     ENDIF
 |   C           M6STYY    IFEQ 9999
 |   C           M6BMON    ANDEQ@SUPP
 |   C                     ELSE
 |   C                     ITER
 |   C                     ENDIF
 |   C                     Z-ADDM6SYUY    @@QTY
JW2  C                     MOVEL'M6SYUY  'ADFIL2
 |   C                     LEAVE
 |   C                     ENDDO
 |    *
 |   C           @@QTY     IFEQ 0
 |   C                     Z-ADDA2SSYS    @@QTY   50       QTY/CONT.
JW2  C                     MOVEL'A2SSYS 2'ADFIL2
 |   C                     ENDIF
 |    *
 |   C                     ENDSR
%1    *================================================================
** ERROR MESSAGE
                                01
                                02
ABSOLUTE NO.                    03
ALREADY SCANNED                 04
                                05
                                06
COMPLET. WEIGHT                 07
                                08
                                09
NOT THIS SUPPLY                 10
                                11
                                12
                                13
** TAB1 / TAB2
5555 **  TO  FAS  **
** KBN
APICS /
INTRA KANBAN:
