     H            Y.                                    1
     FAFDPP20 UP  E                    DISK
     C           AFODYY    IFEQ 2017
     C           AFODMM    ANDEQ03
     C           AFODDD    ANDEQ20
     C           AFSUPP    ANDEQ'5555'
     C                     ADD  1         @KEN    40
     C                     DELETAFDPP201
     C                     END
     CLR         *INLR     IFEQ '1'
     CLR                   Z-ADD@KEN      @KEN
     CLR                   END
