     H            Y.
     FAAMPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAAHTL06 IF  E           K        DISK
     FAAFTL06 IF  E           K        DISK
     FGHCPL21 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FABBPL74 IF  E           K        DISK
     FABBPL71 IF  E           K        DISK
     F            ABBPP701                          KRENAMEABBPL71R
     FAFDWP60 O   E                    DISK                      A
     F*
     E                    PRC        15  3               N PROCESS
     E                    LOC        15  6               N LOCATION
     E                    KK         15  1               N KANBAN
     E                    MCN        15  3               N MACHINE
     E                    PRT        15 12               N PART NUMBER
     E                    DEP        15  4 0             N DEPARTMENT
      *
     E                    TMCN       15  3               @ MACHINE
     E                    TLOC       15  9               @ LOCATION
     E                    TSHT       15  5 0             @ SHORTAGE
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1  45 PRC
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  90 LOC
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  15 KK
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1 180 PRT
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  60 DEP
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I* ---
     I            DS
     I                                        1  45 TMCN
     I                                        1   3 T1MC01
     I                                        4   6 T1MC02
     I                                        7   9 T1MC03
     I                                       10  12 T1MC04
     I                                       13  15 T1MC05
     I                                       16  18 T1MC06
     I                                       19  21 T1MC07
     I                                       22  24 T1MC08
     I                                       25  27 T1MC09
     I                                       28  30 T1MC10
     I                                       31  33 T1MC11
     I                                       34  36 T1MC12
     I                                       37  39 T1MC13
     I                                       40  42 T1MC14
     I                                       43  45 T1MC15
     I* ---
     I            DS
     I                                        1  12 W@SHN
     I                                        1   5 W@SHN1
     I                                        6  10 W@SHN2
     I                                       11  12 W@SHN3
     I            DS
     I                                        1  14 W@HIN
     I                                        1   5 W@HIN1
     I                                        6   6 W@HINA
     I                                        7  11 W@HIN2
     I                                       12  12 W@HINB
     I                                       13  14 W@HIN3
     I            DS
     I                                        1   9 W@LOC
     I                                        1   1 W@LOC1
     I I            '-'                       2   2 W@LOCA
     I                                        3   4 W@LOC2
     I I            '-'                       5   5 W@LOCB
     I                                        6   7 W@LOC3
     I I            '-'                       8   8 W@LOCC
     I                                        9   9 W@LOC4
     I            DS
     I                                        1   6 W#LOC
     I                                        1   1 W#LOC1
     I                                        2   3 W#LOC2
     I                                        4   5 W#LOC3
     I                                        6   6 W#LOC4
      *-----------------------------------------------------
     C                     TIME           WSDT
     C           K#71      KLIST
     C                     KFLD           WSSDAT
     C                     KFLD           K@SHFT  1
     C                     MOVEL'2'       K@SHFT
     C           K#71      CHAINABBPL71              93
     C           *IN93     IFEQ *ON
     C                     MOVEL'1'       K@SHFT
     C           K#71      CHAINABBPL71              93
     C           *IN93     IFEQ *ON
     C                     MOVEL'3'       K@SHFT
     C                     END
     C                     END
     C*-----------------------------------------------------
     C                     MOVEL'1'       K@SHFT
     C*-----------------------------------------------------
     C*
     C           *LOVAL    SETLLAAMPL11
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AAMPL11                  98
     C   98                LEAVE
     C           CKSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C                     Z-ADD*ZERO     X       20
     C                     Z-ADD*ZERO     Y       20
     C                     MOVEL*OFF      W@FND   1
     C*
     C                     MOVEL*OFF      W@OUTS  1
     C                     DO   *HIVAL
     C*
     C                     ADD  1         X
     C           X         IFGT 6
     C                     LEAVE
     C                     END
     C           DEP,X     IFEQ 0000
     C                     LEAVE
     C                     END
     C           DEP,X     IFEQ 0111
     C           DEP,X     OREQ 8990
     C           DEP,X     OREQ 0002
     C           DEP,X     OREQ 2323
     C           DEP,X     OREQ 2525
     C                     ITER
     C                     END
     C*
     C                     MOVELDEP,X     W@SUPP  4
     C                     MOVELKK,X      W@KK    1
     C                     MOVEL*ON       W@OUTS
     C                     LEAVE
     C*
     C                     ENDDO
     C*
     C           W@OUTS    IFEQ *OFF
     C                     ITER
     C                     END
     C*
     C                     CLEARTAN0010R
     C*
     C                     MOVEL*BLANK    W@HIN
     C                     MOVELCKHIN1    W@HIN1
     C                     MOVELCKHIN2    W@HIN2
     C                     MOVELCKHIN3    W@HIN3
     C           W@HIN2    IFNE *BLANK
     C                     MOVEL'-'       W@HINA
     C                     END
     C           W@HIN3    IFNE *BLANK
     C                     MOVEL'-'       W@HINB
     C                     END
     C                     MOVELW@HIN     T1SHIN
     C           DEP,X     CHAINFGBPL01              95
     C           *IN95     IFEQ *OFF
     C                     MOVELB2SMEI    T1SUNM
     C                     END
     C*
     C           K#FCE     KLIST
     C                     KFLD           CKHIN1
     C                     KFLD           CKHIN2
     C                     KFLD           CKHIN3
     C           K#FCE     CHAINFCEPL01              96
     C           *IN96     IFEQ *OFF
     C                     Z-ADDA2SSYS    T1QPC
     C                     END
     C* ---------
     C           K#FCE     SETLLGHCPL21
     C                     DO   *HIVAL
     C           K#FCE     READEGHCPL21                  96
     C   96                LEAVE
     C           CKHIN1    IFNE M7MHN1
     C           CKHIN2    ORNE M7MHN2
     C           CKHIN3    ORNE M7MHN3
     C                     MOVEL*BLANK    W@HIN
     C                     MOVELM7MHN1    W@HIN1
     C                     MOVELM7MHN2    W@HIN2
     C                     MOVELM7MHN3    W@HIN3
     C           W@HIN2    IFNE *BLANK
     C                     MOVEL'-'       W@HINA
     C                     END
     C           W@HIN3    IFNE *BLANK
     C                     MOVEL'-'       W@HINB
     C                     END
     C                     MOVELW@HIN     T1CHIN
     C                     LEAVE
     C                     END
     C                     ENDDO
     C* ---------
     C           K#FCE     SETGTAAHTL06
     C                     DO   *HIVAL
     C           K#FCE     REDPEAAHTL06                  97
     C   97                LEAVE
     C           L6SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           L6UKHZ    IFGT WSSDAT
     C                     ITER
     C                     END
     C           L6STHZ    IFLE WSSDAT
     C                     ITER
     C                     END
     C                     Z-ADDL6KMAX    T1KMAX
     C                     Z-ADDL6KTSU    T1KTSU
     C                     Z-ADDL6SYOS    T1QPC
     C           T1KTSU    DIV  T1QPC     T1CDAY
     C                     LEAVE
     C                     ENDDO
     C* ---------
     C           *IN97     IFEQ *ON
     C*
     C           K#FCE     SETGTAAFTL06
     C*
     C                     DO   *HIVAL
     C*
     C           K#FCE     REDPEAAFTL06                  97
     C   97                LEAVE
     C           A3SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           A3UKHZ    IFGT WSSDAT
     C                     ITER
     C                     END
     C           A3STHZ    IFLE WSSDAT
     C                     ITER
     C                     END
     C*          A3ATOB    IFEQ 0111
     C*                    ELSE
     C*                    ITER
     C*                    END
     C*
     C                     Z-ADDA3KMAX    T1KMAX
     C                     Z-ADDA3KTSU    T1KTSU
     C                     Z-ADDA3SSYS    T1QPC
     C           T1KTSU    DIV  T1QPC     T1CDAY
     C                     LEAVE
     C*
     C                     ENDDO
     C                     END
     C* ---------
     C           CKNB01    IFNE *BLANK
     C                     MOVELCKNB01    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC01
     C                     END
     C                     MOVELCKKB01    T1MC01
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH01
     C                     ADD  W@SHT     T1TTL
     C           CKNB02    IFNE *BLANK
     C                     MOVELCKNB02    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC02
     C                     END
     C                     MOVELCKKB02    T1MC02
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH02
     C                     ADD  W@SHT     T1TTL
     C           CKNB03    IFNE *BLANK
     C                     MOVELCKNB03    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC03
     C                     END
     C                     MOVELCKKB03    T1MC03
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH03
     C                     ADD  W@SHT     T1TTL
     C           CKNB04    IFNE *BLANK
     C                     MOVELCKNB04    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC04
     C                     END
     C                     MOVELCKKB04    T1MC04
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH04
     C                     ADD  W@SHT     T1TTL
     C           CKNB05    IFNE *BLANK
     C                     MOVELCKNB05    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC05
     C                     END
     C                     MOVELCKKB05    T1MC05
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH05
     C                     ADD  W@SHT     T1TTL
     C           CKNB06    IFNE *BLANK
     C                     MOVELCKNB06    W#LOC
     C                     MOVELW#LOC1    W@LOC1
     C                     MOVELW#LOC2    W@LOC2
     C                     MOVELW#LOC3    W@LOC3
     C                     MOVELW#LOC4    W@LOC4
     C                     MOVELW@LOC     T1LC06
     C                     END
     C                     MOVELCKKB06    T1MC06
     C                     EXSR @SUB1
     C                     Z-ADDW@SHT     T1SH06
     C                     ADD  W@SHT     T1TTL
     C* ---------
     C*
     C                     WRITETAN0010R
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C* ----------------------------------------------------
     C           @SUB1     BEGSR
     C*
     C                     Z-ADD*ZERO     W@SHT   50
     C           K#74      KLIST
     C                     KFLD           WSSDAT
     C                     KFLD           W#LOC
     C           K#74      SETLLABBPL74
     C                     DO   *HIVAL
     C           K#74      READEABBPL74                  94
     C   94                LEAVE
     C           A7SHFT    IFNE K@SHFT
     C                     ITER
     C                     END
     C           A7KNID    IFEQ 'A'
     C           A7KNID    OREQ 'P'
     C                     ADD  A7KQTY    W@SHT
     C                     ELSE
     C           A7KQTY    MULT A7LOTS    W@@SHT  50
     C                     ADD  W@@SHT    W@SHT
     C                     END
     C                     ENDDO
     C*
     C                     ENDSR
