     H            Y.
      ****************************************************************
      *  PROGRAM    : AFFR18                                         *
      *  WRITTEN    : 03/08/2023                                     *
      *  WRITTEN BY : LEC                                            *
      *  FUNCTION   : UPDATE TOYOTA CANADA BIN SCHEDULE              *
      *               FROM UPLOAD                                    *
      ****************************************************************
     FAFFWP18 IF  E           K        DISK
     FAB#PP80 O   E           K        DISK                      A
      *
     E                    FR         30  4 0
     E                    TO         30  4 0
      *-----------------------------------------------------------------
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I            DS
     I                                        1   80YYMMDD
     I                                        1   4 YY
     I                                        5   6 MM
     I                                        7   8 DD
      *
     I            DS
     I                                        1   40HHMM
     I                                        1   2 HH
     I                                        3   4 MN
      *
     I            DS
     I                                        1 120 FR
     I                                        1   40A8FR01
     I                                        5   80A8FR02
     I                                        9  120A8FR03
     I                                       13  160A8FR04
     I                                       17  200A8FR05
     I                                       21  240A8FR06
     I                                       25  280A8FR07
     I                                       29  320A8FR08
     I                                       33  360A8FR09
     I                                       37  400A8FR10
     I                                       41  440A8FR11
     I                                       45  480A8FR12
     I                                       49  520A8FR13
     I                                       53  560A8FR14
     I                                       57  600A8FR15
     I                                       61  640A8FR16
     I                                       65  680A8FR17
     I                                       69  720A8FR18
     I                                       73  760A8FR19
     I                                       77  800A8FR20
     I                                       81  840A8FR21
     I                                       85  880A8FR22
     I                                       89  920A8FR23
     I                                       93  960A8FR24
     I                                       97 1000A8FR25
     I                                      101 1040A8FR26
     I                                      105 1080A8FR27
     I                                      109 1120A8FR28
     I                                      113 1160A8FR29
     I                                      117 1200A8FR30
      *
     I            DS
     I                                        1 120 TO
     I                                        1   40A8TO01
     I                                        5   80A8TO02
     I                                        9  120A8TO03
     I                                       13  160A8TO04
     I                                       17  200A8TO05
     I                                       21  240A8TO06
     I                                       25  280A8TO07
     I                                       29  320A8TO08
     I                                       33  360A8TO09
     I                                       37  400A8TO10
     I                                       41  440A8TO11
     I                                       45  480A8TO12
     I                                       49  520A8TO13
     I                                       53  560A8TO14
     I                                       57  600A8TO15
     I                                       61  640A8TO16
     I                                       65  680A8TO17
     I                                       69  720A8TO18
     I                                       73  760A8TO19
     I                                       77  800A8TO20
     I                                       81  840A8TO21
     I                                       85  880A8TO23
     I                                       89  920A8TO22
     I                                       93  960A8TO24
     I                                       97 1000A8TO25
     I                                      101 1040A8TO26
     I                                      105 1080A8TO27
     I                                      109 1120A8TO28
     I                                      113 1160A8TO29
     I                                      117 1200A8TO30
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           *ENTRY    PLIST
     C                     PARM           EFFDAT  80
      *
      *----------------------------------------------------*
      * MAIN ROUTINE
      *----------------------------------------------------*
      *
     C                     TIME           WSDT
     C                     CLEARAB#PP801
      *
     C                     READ AFFWP18                  50
     C                     Z-ADDACSHID    FIRSTD  80
      *
     C           *IN50     DOWEQ*OFF
      *
     C           ACSHID    IFEQ FIRSTD
     C                     EXSR #GETBN
     C                     ENDIF
      *
     C                     READ AFFWP18                  50
      *
     C                     ENDDO
      *
     C           X         IFGT *ZERO
     C                     EXSR #WRT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * get the bin# for this route and move times to arrays
      *----------------------------------------------------*
     C           #GETBN    BEGSR
      *
     C                     ADD  1         X       20
     C                     Z-ADD*ZERO     BN      20
      *
     C                     CALL 'AB#R8M'
     C                     PARM           ACSHID
     C                     PARM           ACSURT
     C                     PARM           BN
      *
     C                     Z-ADDACSTIM    FR,BN
     C                     Z-ADDACETIM    TO,BN
      *
     C                     ENDSR
      *----------------------------------------------------*
      * write record to Toyota Canada Schedule file...
      *----------------------------------------------------*
     C           #WRT      BEGSR
      *
     C                     Z-ADDTODAY     A8KODT
     C                     Z-ADDNOW       A8KOTM
     C                     MOVEL#USER     A8KOME
     C                     MOVEL#PGM      A8UPGM
     C                     MOVEL#WSID     A8UPWS
     C                     Z-ADDEFFDAT    A8FRDT
     C                     Z-ADD99999999  A8TODT
      *
     C                     WRITEAB#PP801
     C                     CLEARAB#PP801
      *
     C                     Z-ADD*ZERO     X
     C                     ENDSR
      *----------------------------------------------------*
