     H            Y.
      ** AFFR73 ******************************************************
      *  PROGRAM    : CREATE ABAEP21 (EDI FORECAST FILE)             *
      *  WRITTEN    : JW (SRA) 2024.05.23                            *
      ****************************************************************
     FAFFWP71 IF  E           K        DISK
     FABAEP21 O   E                    DISK
      *----------------------------------------------------*
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *----------------------------------------------------*
      * MAIN ROUTINE
      *----------------------------------------------------*
     C                     TIME           WSDT
      * READ AFFWP71
     C                     DO   *HIVAL
     C                     READ AFFWP71                  98
     C   98                LEAVE
      * SET ABAEP21
     C                     EXSR #SET
     C                     WRITEABAEP201
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * SET DATA
      *----------------------------------------------------*
     C           #SET      BEGSR
      *
     C                     CLEARABAEP201
     C                     MOVELAFTYPE    AEESID
     C                     MOVELAFTOKU    AETOKU
     C                     MOVELAFNONY    AENONY
     C                     MOVE '0'       AENKOJ
     C                     MOVELAFNUKE    AENUKE
     C                     MOVELAFMHIN    AEMHIN
     C                     Z-ADDAFSHDT    AEDAT1
     C                     Z-ADDAFSRYO    AEEQTY
      *
     C                     Z-ADDTODAY     AERCVT
     C                     MOVEL'IFS    ' AEPRTR
     C                     MOVEL#USER     AEFLR1
     C                     MOVEL#PGM      AEFLR2
      *
     C                     ENDSR
