     H            Y.
     F** AFFR20  ************************************************************
     F*  TIEM LABEL   ---- SORT SEQUENCE                                    *
     F*  LEC  04/30/2020                                                    *
     F***********************************************************************
     FAL#PL62 IF  E           K        DISK
      *
      ***********************************************************
      *   start at the bottom so it will print and stack highest #
      *   (lowest priority) first and the lowest # (highest priority)
      *   last, which will end up on top.
      *
     C           *HIVAL    SETGTAL#PL62
      *
     C           *IN51     DOWEQ*OFF
     C                     READPAL#PL62                  51
      *
     C           *IN51     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           C6BLK     IFNE *BLANKS
     C           C6BLK2    ORNE *BLANKS
     C                     CALL 'AFFC20A'
     C                     PARM           C6BLK
     C                     PARM           C6BLK2
     C                     PARM           C6SITE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      ***********************************************************
