     H            Y.
     F** AFGR18 *******************************************************
     F* REVISE & SEND EDI ORDER FOR OUTSOURCE NOT USING GPS *
     F*             KIRI           2018.06.08
     F*****************************************************************
     FAFGPW17 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL01
     F                                              KINFDS @INFDS
      *
     FAFGPL01 UF  E           K        DISK
      *
     E                    ERR     1  11 50
      *
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
      *------------------------------
     I            DS
     I                                        1  31 S1INBR
     I                                        1  14 S1PART
     I                                        1   5 S1SHN1
     I                                        6   6 S1SF1
     I                                        7  11 S1SHN2
     I                                       12  12 S1SF2
     I                                       13  14 S1SHN3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * ENTRY LIST                                         *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1SUPP  4
     C                     PARM           P1SUPN 15
     C                     PARM           P1ODNO  60
     C                     PARM           P1CMD   2
      *----------------------------------------------------*
      * KEY LIST                                           *
      *----------------------------------------------------*
     C           KEY1      KLIST
     C                     KFLD           P1SUPP
     C                     KFLD           P1ODNO
     C**
     C           KEY3      KLIST
     C                     KFLD           P1SUPP
     C                     KFLD           P1ODNO
     C                     KFLD           S1SHN1
     C                     KFLD           S1SHN2
     C                     KFLD           S1SHN3
     C******************************************************
     C*  MAIN
     C******************************************************
     C*
     C                     EXSR @INT
     C*
     C                     EXSR @DSP01
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C******************************************************
     C*  INITIAL SET
     C******************************************************
     C           @INT      BEGSR
     C*
     C                     TIME           WTIME
     C*
     C                     MOVELP1SUPP    D1SUPP
     C                     MOVELP1SUPN    D1SUPN
     C                     MOVEL*BLANK    P1CMD
     C                     MOVEL*BLANK    D1GPPO 17
     C*
     C                     SETOF                     606162
     C                     SETOF                     636465
     C                     SETOF                     8899
     C*
     C*
     C                     ENDSR
     C******************************************************
     C*  @DSP01
     C******************************************************
     C           @DSP01    BEGSR
     C*
     C                     EXSR @SFSET
     C                     Z-ADD1         W#RNP2  40
     C*
S1   C                     DO   *HIVAL
     C** PROTECT
     C                     SETOF                     8687
     C*
     C                     WRITEFMT09
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL01
     C   KC                LEAVE
     C*
 S2  C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2           = TOP RRN
 E2  C                     END
     C*
     C                     SETOF                     606199
     C                     SETOF                     626364
     C                     SETOF                     65
     C                     MOVEL*BLANK    D1ERR
     C*-------------------------------
     C* F10 FOB HELP SCREEN
     C*-------------------------------
 S2  C           *INKJ     IFEQ *ON
     C                     DO   *HIVAL
     C                     EXFMTAFGPW178
     C   KC                LEAVE
     C                     ENDDO
     C                     ITER
 E2  C                     ENDIF
     C*-------------------------------
     C* F8  CHANGE SCREEN
     C*-------------------------------
 S2  C           *INKH     IFEQ *ON
     C                     EXSR @DSP02
     C   KC                LEAVE
     C** UPDATED
  S3 C           P1CMD     IFEQ 'UP'
     C                     LEAVE
  E3 C                     ENDIF
     C*
     C                     ITER
 E2  C                     ENDIF
     C*-----------------------
     C* CHECK INPUT
     C*-----------------------
     C                     EXSR @D1CHK
     C*
     C* NO ERROR
 S2  C           *IN99     IFEQ *OFF
  S3 C                     SELEC
     C*-------------------------------
     C* F5 UPDATE &CREATE EDI DATA
     C*-------------------------------
  -3 C           *INKE     WHEQ *ON
     C* UPDATE
     C                     EXSR @UPDAT
     C                     LEAVE
     C*
  E3 C                     ENDSL
     C*
     C                     ITER
 E2  C                     ENDIF
     C*
     C   KC                LEAVE
     C*
E1   C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C*  SFL01  SET
     C******************************************************
     C           @SFSET    BEGSR
     C*
     C                     MOVEL*ON       *IN41
     C                     WRITECTL01
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
     C                     Z-ADD*ZERO     WKTTQY  90
     C                     Z-ADD*ZERO     WKTTWG  90
     C                     Z-ADD1         XX      20
     C*
     C           KEY1      SETLLAFGPL01
     C                     DO   *HIVAL
     C           KEY1      READEAFGPL01                  80
     C   80                LEAVE
     C*  DELETED RECORD ?
     C           AGSKJY    IFEQ 'D'
     C           AGSKDT    ANDLEWTIHZ
     C                     ITER
     C                     END
     C* CREATE SUB-FILE
     C                     EXSR #SFSET
     C*
     C           RRN2      IFEQ 9999
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C*
     C           RRN2      IFEQ *ZERO
     C                     CLEARSFL01
     C                     Z-ADD1         RRN2
     C                     WRITESFL01
     C                     MOVEL*ON       *IN99
     C                     MOVELERR,2     D1ERR
     C                     END
     C*
     C           RRN2      IFEQ 9999
     C                     MOVEL*ON       *IN99
     C                     MOVELERR,3     D1ERR
     C                     END
     C*
     C                     Z-ADDRRN2      ENDRRN  40
     C*
     C                     ENDSR
      *----------------------------------------------------*
      * SET SUBFILE                                      *
      *----------------------------------------------------*
     CSR         #SFSET    BEGSR
      *
     C                     CLEARSFL01
      * ITEM #
     C                     MOVELAGPAR1    S1SHN1
     C                     MOVEL'-'       S1SF1
     C                     MOVELAGPAR2    S1SHN2
     C                     MOVEL'-'       S1SF2
     C                     MOVELAGPAR3    S1SHN3
     C           AGPAR3    IFEQ *BLANK
     C                     MOVEL*BLANK    S1SF2
     C                     ENDIF
      * REQ DATE
     C                     Z-ADDAGREQD    S1REQD
      * QTY
     C                     Z-ADDAGORDQ    S1ORDQ
     C* UNIT PRICE
     C                     Z-ADDAGUNTP    S1UNTP
     C* UNIT OF MEASURE
     C                     MOVELAGUOME    S1UOME
     C* EXTENDED COST
     C           S1ORDQ    MULT S1UNTP    S1EXTP
     C*
     C                     MOVELAGITDS    S1ITDS
      *
     C                     ADD  1         RRN2
      * LINE #
     C* SET DEFAULT VALUE
     C           RRN2      IFEQ 1
     C                     MOVELAGGPPO    D1GPPO
     C                     EXSR @CTSET
     C                     ENDIF
     C** PROTECT
     C                     SETOF                     8687
     C** PROTECT
     C                     MOVE RRN2      S1LINE
     C                     WRITESFL01
      *
     CSR         ESFSET    ENDSR
     C******************************************************
     C*  CTL01  SET
     C******************************************************
     C           @CTSET    BEGSR
     C*
     C*
     C* 2ND SCREEN
     C                     MOVELP1SUPP    D1VDCD
     C                     MOVELAGVDNM    D1VDNM
     C                     MOVELAGVDA1    D1VDA1
     C                     MOVELAGVDA2    D1VDA2
     C*
     C                     MOVELAGVDCI    D1VDCI
     C                     MOVELAGVDST    D1VDST
     C                     MOVELAGVDZI    D1VDZI
     C                     MOVELAGVDPN    D1VDPN
     C                     MOVELAGVDCP    D1VDCP
     C*
     C                     MOVELAGSTCD    D1STCD
     C*
     C                     MOVELAGSTNM    D1STNM
     C                     MOVELAGSTA1    D1STA1
     C                     MOVELAGSTA2    D1STA2
     C*
     C                     MOVELAGSTCI    D1STCI
     C                     MOVELAGSTST    D1STST
     C                     MOVELAGSTZI    D1STZI
     C                     MOVELAGSTPN    D1STPN
     C                     MOVELAGSTCP    D1STCP
     C*
     C                     MOVELAGSTCP    D1STCP
     C                     MOVELAGVDCP    D1VDCP
     C* 1ST SCREEN
     C                     MOVELAGPAYT    D1PAYT
     C                     MOVELAGCONF    D1CONF
      * FOB
     C                     MOVELAGFONB    D1FONB
     C***                  MOVELAGSHPM    D1SHPM
     C* COMMENT1
     C                     MOVELAGCMT1    D1CMT1
     C*  SELLING PARTY
     C                     MOVELAGSECD    D1SECD
     C                     MOVELAGSENM    D1SENM
     C*
     C                     ENDSR
     C******************************************************
     C*  1ST SCREEN INPUT CHECK
     C******************************************************
     C           @D1CHK    BEGSR
     C*
     C                     DO   ENDRRN    RRN2
     C           RRN2      CHAINSFL01                86
     C   86                LEAVE
     C                     MOVEA'00000'   *IN,60           60-64
     C                     EXSR #D1CHK
     C                     UPDATSFL01
     C  N99                ENDDO
     C   99                Z-ADDRRN2      W#RNP2
     C*
     C           D1FONB    IFEQ *BLANK
     C           D1FONB    ORNE 'CC'
     C           D1FONB    ANDNE'CF'
     C           D1FONB    ANDNE'PC'
     C           D1FONB    ANDNE'PP'
     C  N99                MOVELERR,10    D1ERR
     C  N99                SETON                     6599
     C                     ENDIF
     C*
     C                     ENDSR
     C******************************************************
     C           #D1CHK    BEGSR
     C*
     C                     MOVE S1REQD    PDATE   8
     C                     CALL 'DATR10'
     C                     PARM           PDATE   8
     C                     PARM           PRTN    1
     C           PRTN      IFEQ '1'
     C  N99                MOVELERR,4     D1ERR
     C  N99                SETON                     6199
     C                     ENDIF
     C*
     C           S1UOME    IFNE 'EACH'
     C           S1UOME    ANDNE'POUND'
     C  N99                MOVELERR,9     D1ERR
     C  N99                SETON                     6299
     C                     ENDIF
     C*
     C           S1ORDQ    IFEQ 0
     C  N99                MOVELERR,1     D1ERR
     C  N99                SETON                     6399
     C                     ENDIF
     C*
     C           S1UNTP    IFEQ 0
     C  N99                MOVELERR,1     D1ERR
     C  N99                SETON                     6499
     C                     ENDIF
     C*
     C  N99      S1ORDQ    MULT S1UNTP    S1EXTP
     C*
     C                     ENDSR
     C******************************************************
     C*  @DSP02
     C******************************************************
     C           @DSP02    BEGSR
     C*
     C                     DO   *HIVAL
     C*
     C                     EXFMTAFGPW172
     C   KC                LEAVE
     C*
     C                     SETOF                     606199
     C                     MOVEL*BLANK    D1ERR
     C*
     C*-------------------------------
     C* F8  CHANGE SCREEN
     C*-------------------------------
     C           *INKH     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C*-----------------------
     C* CHECK INPUT
     C*-----------------------
     C                     EXSR @D1CHK
     C*
     C* NO ERROR
     C           *IN99     IFEQ *OFF
     C                     SELEC
     C*-------------------------------
     C* F5 UPDATE &CREATE EDI DATA
     C*-------------------------------
     C           *INKE     WHEQ *ON
     C* UPDATE
     C                     EXSR @UPDAT
     C                     LEAVE
     C*
     C                     ENDSL
     C*
     C                     ITER
     C                     ENDIF
     C*
     C   KC                LEAVE
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C*  UPDATE FILES AND CREATE EDI DATA
     C******************************************************
     C           @UPDAT    BEGSR
     C*
     C* UPDATE AFGPL01
     C                     EXSR @UPDT1
     C* CREATE EDI ORDER
     C                     EXSR @CREDI
     C* DISPLAY P.O.#
     C                     EXSR @DSPPO
     C*
     C                     ENDSR
     C******************************************************
     C*  UPDATE AFGPL01
     C******************************************************
     C           @UPDT1    BEGSR
     C*
     C                     DO   ENDRRN    RRN2
     C           RRN2      CHAINSFL01                91
     C   91                LEAVE
     C                     EXSR #UPDT1
     C                     ENDDO
     C*
     C                     ENDSR
     C************************************
     C           #UPDT1    BEGSR
     C*
     C           KEY3      CHAINAFGPL01              82
S1   C           *IN82     IFEQ '0'
 S2  C           AGSKJY    IFEQ 'D'
     C           AGSKDT    ANDLEWTIHZ
 X2  C                     ELSE
     C*
     C****************??   MOVELD1GPPO    AGGPPO
     C                     MOVELS1INBR    AGINBR
     C                     MOVELD1PAYT    AGPAYT
     C                     MOVELD1CONF    AGCONF
     C***                  MOVELD1SHPM    AGSHPM
     C                     MOVELD1FONB    AGFONB
     C                     MOVELS1UOME    AGUOME
     C*
     C           S1UOME    IFEQ 'EACH'
     C                     MOVEL'EA'      AGUNCD
     C                     MOVEL'PE'      AGUOM2
     C                     ENDIF
     C           S1UOME    IFEQ 'POUND'
     C                     MOVEL'LB'      AGUNCD
     C                     MOVEL'PP'      AGUOM2
     C                     ENDIF
     C*
     C                     Z-ADDS1REQD    AGREQD
     C                     Z-ADDS1ORDQ    AGORDQ
     C                     Z-ADDS1UNTP    AGUNTP
     C                     Z-ADDS1EXTP    AGEXTP
     C                     MOVELS1ITDS    AGITDS
     C                     MOVELD1CMT1    AGCMT1
     C* 2ND SCREEN
     C                     MOVELD1VDCD    AGVDCD
     C                     MOVELD1VDNM    AGVDNM
     C                     MOVELD1VDA1    AGVDA1
     C                     MOVELD1VDA2    AGVDA2
     C                     MOVELD1VDCI    AGVDCI
     C                     MOVELD1VDST    AGVDST
     C                     MOVELD1VDZI    AGVDZI
     C                     MOVELD1VDPN    AGVDPN
     C                     MOVELD1VDCP    AGVDCP
     C                     MOVELD1STCD    AGSTCD
     C                     MOVELD1STNM    AGSTNM
     C                     MOVELD1STA1    AGSTA1
     C                     MOVELD1STA2    AGSTA2
     C                     MOVELD1STCI    AGSTCI
     C                     MOVELD1STST    AGSTST
     C                     MOVELD1STZI    AGSTZI
     C                     MOVELD1STPN    AGSTPN
     C                     MOVELD1STCP    AGSTCP
     C                     MOVELD1SECD    AGSECD
     C                     MOVELD1SENM    AGSENM
     C                     MOVELD1SEA1    AGSEA1
     C                     MOVELD1SEA2    AGSEA2
     C                     MOVELD1SECI    AGSECI
     C                     MOVELD1SEST    AGSEST
     C                     MOVELD1SEZI    AGSEZI
     C                     MOVELD1SEPN    AGSEPN
     C                     MOVELD1SECP    AGSECP
     C* FIXED VALUE
     C                     MOVEL'00'      AGSPCD           ORIGINAL
     C                     MOVEL'RL'      AGPOTC           RELEASE ORDER
     C                     MOVEL'USD'     AGCURR           CURRENCY
     C*
     C                     MOVEL'3'       AGUPID
     C                     MOVEL'05'      AGSPCD           REPLACE
     C                     Z-ADDWTIHZ     AGREVD
     C                     Z-ADDWTITM     AGREVT
     C*
     C                     UPDATAFGPL011
     C*
 E2  C                     ENDIF
E1   C                     ENDIF
     C*
     C                     ENDSR
     C******************************************************
     C*  CREATE EDI DATA
     C******************************************************
     C           @CREDI    BEGSR
     C*
     C                     CALL 'AFGC05'
     C                     PARM           P1SUPP  4
     C                     PARM           D1GPPO 17
     C*
     C                     MOVEL'UP'      P1CMD   2
     C*
     C                     ENDSR
     C******************************************************
     C*  DISPLAY P.O.#
     C******************************************************
     C           @DSPPO    BEGSR
     C*
     C                     DO   *HIVAL
     C                     EXFMTAFGPW179
     C*
     C           *INKE     IFEQ *ON
     C                     MOVEL*BLANK    D1GPPO
     C                     LEAVE
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C******************************************************
     C******************************************************
**
ER-1 INPUT REQUIRED.
ER-2 NO DATA.
ER-3 DATA EXCEED LIMIT 9999.
ER-4 INPUT CORRECT DATE.
ER-5 THE P.O. # IS ALREADY USED BY ANOTHER ORDER.
ER-6 THE P.O. # DOES NOT MATCH RETREIVED INFO.
ER-7 THE ITEM # DOES NOT MATCH.
ER-8 QUANTITY DOES NOT MATCH.
ER-9 'EACH' OR 'POUND'.
ER-10 'CC'/'CF'/'PC'/'PP'.
