     H            Y.
     F** AFGR05 *********************************************
     F* CREATE EDI ORDER 850 HEADER                         *
     F*     T.SAKAKI                        2016.11.15      *
     F*******************************************************
     FAFGPL03 IF  E           K        DISK
      * FLAT DATA
     FOUTPUT  O   F    1075            DISK
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        9  140@SYHZ6
     I                                        7  140@SYSHZ
     I            DS
     I                                        1  13 W1EXCA
     I                                        1   8 W1EXCL
     I                                        9  13 W1EXCR
     I            DS
     I                                        1  14 W2EXCA
     I                                        1   8 W2EXCL
     I                                        9   9 W2EXCC
     I                                       10  14 W2EXCR
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         DIGITS
     I              '(EXT. PRICE $'       C         WKEXC1
      *================================================================
      *  ENTRY LIST
      *================================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SUPP  4
     C                     PARM           P@GPPO 17
     C                     PARM           P@PTID 12
     C                     PARM           P@SERN 10
      *================================================================
      *  KEY LIST
      *================================================================
      *================================================================
     C* MAIN
      *================================================================
     C                     TIME           @TIME
     C                     MOVE P@SERN    P@SER6  6
      *
     C           P@GPPO    SETLLAFGPL031
     C                     DO   *HIVAL
     C           P@GPPO    READEAFGPL031                 80
     C   80                LEAVE
     C*  DELETED RECORD ?
     C           AGSKJY    IFEQ 'D'
     C           AGSKDT    ANDLE@SYSHZ
     C                     ITER
     C                     END
     C*  DOES NOT MATCH SUPPLIER ?
     C                     MOVELAGVDCD    WKSUPP  4
     C           P@SUPP    IFNE WKSUPP
     C                     ITER
     C                     END
      *
     C                     MOVE AGEXTP    W1EXCA
     C*
     C                     MOVE *BLANK    INSUJI
     C                     MOVE W1EXCL    INSUJI 110
     C                     MOVE *BLANK    OTMOJI 11
     C                     MOVE *BLANK    CHKFLG  1
     C                     CALL 'MRHR47'
     C                     PARM           INSUJI
     C                     PARM           OTMOJI
     C                     PARM           CHKFLG
     C           CHKFLG    IFEQ ' '
     C                     MOVE OTMOJI    W2EXCL
     C                     ENDIF
      *
     C                     MOVE OTMOJI    W2EXCL
     C                     MOVE '.'       W2EXCC
     C                     MOVE W1EXCR    W2EXCR
      *
      * FIXED VALUE
     C                     MOVEL')'       WKEXC2  1
      * OUTPUT
     C                     EXCPTHDWRT
     C                     LEAVE
      *
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      * OUTPUT
      *================================================================
     OOUTPUT  E                HDWRT
     O                                    1 'H'
     O* RECORD ID  2-7
     O                         P@SER6     7
     O* APPLICATION ID  8-10
     O                                   10 'PO '
     O* APPLICATION ALIAS  11-13
     O                                   13 '850'
     O* PARTNER ID  14-25
     O                         P@PTID    25
     O*------------------------------------------------
     O* BEG01 : TRANSACTION SET PURPOSE CODE  26-27
     O                         AGSPCD    27
     O* BEG02 : PURCHASE ORDER TYPE CODE  28-29
     O                         AGPOTC    29
     O* BEG03 : P.O.NUMBER  30-51 (17)
     O                         P@GPPO    46
     O* BEG04 : RELEASE NUMBER  52-81 (10)
     O                         P@SERN    61
     O* BEG06 : ORDER DATE  82-87
     O                         @SYHZ6    87
     O* NTE02 : PAYMENT TERMS  88-147 (21)
     O                         AGPAYT   108
     O*       : '(EXT. PRICE $'115-127
     O                         WKEXC1   127
     O*       :  EXT.PRICE    129-143
     O                         W2EXCA   143
     O*       : ')'           144-144
     O                         WKEXC2   144
     O*
     O* NTE02 : FREE FORM 1  148-207
     O                         AGCMT1   207
     O* NTE02 : FREE FORM 2  208-267
     O                         AGCMT2   267
     O* NTE02 : FREE FORM 3  268-327
     O                         AGCMT3   327
     O* NTE02 : FREE FORM 4  328-387
     O                         AGCMT4   387
     O*------------------------------------------
     O* PER02 : EXPEDITOR NAME  388-422
     O                         AGSTCP   422
     O* PER04 : EXPEDITOR PHONE NUMBER  423-443 (12)
     O                         AGSTPN   434
     O* PER02 : SHIPPING METHOD  444-445
     O                         AGFONB   445
     O*------------------------------------------
     O*  SHIP TO
     O*------------------------------------------
     O* PER02 : SHIP TO NAME  446-480
     O                         AGSTNM   480
     O* PER04 : SHIP TO CODE  481-497 (5)
     O                         AGSTCD   485
     O* N301  : SHIP TO ADDRESS 1  498-532
     O                         AGSTA1   532
     O* N302  : SHIP TO ADDRESS 2  533-567
     O                         AGSTA2   567
     O* N401  : SHIP TO CITY  568-586
     O                         AGSTCI   586
     O* N402  : SHIP TO STATE  587-588
     O                         AGSTST   588
     O* N403  : SHIP TO ZIP CODE  589-597
     O                         AGSTZI   597
     O* N404  : SHIP TO COUNTRY  598-599
     O                         AGSTCT   599
     O* PER02 : SHIP TO CONTACT PERSON  600-634 (15)
     O                         AGCONF   614
     O* PER04 : SHIP TO PHONE NUMBER  635-655 (12)
     O                         AGSTPN   646
     O*------------------------------------------
     O*  SELLING PARTY
     O*------------------------------------------
     O* PER02 : SELLING PARTY NAME  656-690
     O                         AGSENM   690
     O* PER04 :               CODE  691-707 (5)
     O                         AGSECD   695
     O* N301  :               ADDRESS 1  708-742
     O                         AGSEA1   742
     O* N302  :               ADDRESS 2  743-777
     O                         AGSEA2   777
     O* N401  :               CITY  778-796
     O                         AGSECI   796
     O* N402  :               STATE  797-798
     O                         AGSEST   798
     O* N403  :               ZIP CODE  799-807
     O                         AGSEZI   807
     O* N404  :               COUNTRY  808-809
     O                         AGSECT   809
     O* PER02 :               CONTACT PERSON  810-844
     O                         AGSECP   844
     O* PER04 :               PHONE NUMBER  845-865 (12)
     O                         AGSEPN   856
     O*------------------------------------------
     O*  SUPPLIER
     O*------------------------------------------
     O* PER02 : SUPPLIER      NAME  866-900
     O                         AGVDNM   900
     O* PER04 :               CODE  901-917 (5)
     O                         AGVDCD   905
     O* N301  :               ADDRESS 1  918-952
     O                         AGVDA1   952
     O* N302  :               ADDRESS 2  953-987
     O                         AGVDA2   987
     O* N401  :               CITY  988-1006
     O                         AGVDCI  1006
     O* N402  :               STATE  1007-1008
     O                         AGVDST  1008
     O* N403  :               ZIP CODE  1009-1017
     O                         AGVDZI  1017
     O* N404  :               COUNTRY  1018-1019
     O                         AGVDCT  1019
     O* PER02 :               CONTACT PERSON  1020-1054
     O                         AGVDCP  1054
     O* PER04 :               PHONE NUMBER  1055-1075 (12)
     O                         AGVDPN  1066
