     H            Y.
     F** AFGR00 *********************************************
     F* INPUT CHECK OUTSOURCE EDI MENU                      *
     F*             T.SAKAKI       2016.11.05               *
     F*******************************************************
     FAFGPW00 CF  E                    WORKSTN
     FEDIPP50 IF  E           K        DISK
     FEJKPL12 IF  E           K        DISK
      *
     E                    ER      1  20 60
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
     I                                        7  100WYYYY
     I                                       11  120WMMMM
     I                                       13  140WDDDD
      *
     I            DS
     I                                        1   80D1SDAT
     I                                        1   40D1SDYY
     I                                        5   60D1SDMM
     I                                        7   80D1SDDD
     I            DS
     I                                        1   80F8KYMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1OPTN  1
     C                     PARM           P1SUPP  4
     C                     PARM           P9CMD   2
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
     C           KEY1      KLIST
     C                     KFLD           D1SUPP
     C                     KFLD           K1SNRV  1
     C                     KFLD           K1DKBN  3
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    D1OPTN
     C                     MOVEL*BLANK    D1SUPP
     C                     MOVEL*BLANK    P9CMD
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * MAIN 2                                             *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAFGPW001
     C                     SETOF                     616299
     C                     MOVEL*BLANK    D1MSG
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      P9CMD
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      * OPTION
     C           D1OPTN    IFEQ ' '
     C                     MOVELER,1      D1MSG
     C                     SETON                     6199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1OPTN    IFEQ '1'                        ORDER
     C           D1OPTN    OREQ '2'                        RE-ORDER
     C           D1OPTN    OREQ '3'                        FORECAST
     C           D1OPTN    OREQ '4'                        MAINTE
     C           D1OPTN    OREQ '5'                        MAINTE
     C                     ELSE
     C                     MOVELER,4      D1MSG
     C                     SETON                     6199
     C                     GOTO ESB210
     C                     ENDIF
     C**
     C                     MOVEL'S'       K1SNRV
     C                     SELEC
     C           D1OPTN    WHEQ '1'
     C           D1OPTN    OREQ '2'
     C                     MOVEL'850'     K1DKBN
     C           D1OPTN    WHEQ '3'
     C                     MOVEL'830'     K1DKBN
     C                     ENDSL
     C*
      * VENDOR CODE
 1   C           D1OPTN    IFNE '4'                        MAINTENANCE
 1   C           D1OPTN    ANDNE'5'                        MAINTENANCE
     C*
 2   C           D1SUPP    IFEQ *BLANK
     C                     MOVELER,6      D1MSG
     C                     SETON                     6299
 2   C                     ELSE
     C*
     C           KEY1      CHAINEJKPL12              92
 3   C           *IN92     IFEQ '0'
 4   C           DPSKJY    IFEQ 'D'
      * NG1
     C                     MOVELER,5      D1MSG
     C                     SETON                     6299
 4   C                     ELSE
      * OK & CHECK EDIPP50
     C           KEY1      CHAINEDIPP50              93
 5   C           *IN93     IFEQ '0'
 6   C           E5SKJY    IFEQ 'D'
     C                     MOVELER,3      D1MSG
     C                     SETON                     6299
 6   C                     ELSE
 6   C                     ENDIF
 5   C                     ELSE
     C                     MOVELER,3      D1MSG
     C                     SETON                     6299
 5   C                     ENDIF
      *
 4   C                     ENDIF
      * NG2
 3   C                     ELSE
     C                     MOVELER,5      D1MSG
     C                     SETON                     6299
 3   C                     ENDIF
      *
 2   C                     ENDIF
      *
 1   C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVEL'99'      DSPSW
      *
     C                     MOVELD1OPTN    P1OPTN
     C                     MOVELD1SUPP    P1SUPP
     C                     MOVEL'05'      P9CMD
      *
     C                     ENDIF
      *
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
** ER
E-01 ENTER OPTION
E-02
E-03 PLEASE REGISTER B2B EDI ADDITIONAL INF M/F BY MENU #4.
E-04 OPTION SHOULD BE 1,2,3,4 OR 5
E-05 PLEASE CONTACT IT PERSON TO ENABLE EDI.(EJKPP10)
E-06 ENTER SUPPLIER
