     H            Y.
     F** AFGR02 *********************************************
     F* CREATE EDI ORDER DATA 850 FOR OUTSOURCE             *
     F*             T.SAKAKI       2016.11.13               *
     F*******************************************************
     FAFGPW02 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     FAFGWP01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   80Z1SKHZ
     I                                        1   40Z1SKYY
     I                                        5   60Z1SKMM
     I                                        7   80Z1SKDD
      *
     I            DS
     I                                        1  100WYDA
     I                                        1   80WYDATE
     I                                        9  100WYBB
      *
     I            DS
     I                                        1  100DYDA
     I                                        1   80DYDATE
     I                                        9  100DYBB
      *
     I            DS
     I                                        1  100D1D
     I                                        1   80D1DATE
     I                                        9  100D1BB
      *
     I            DS
     I                                        1   7 S1MTK
     I                                        1   2 S1MTK2
     I                                        3   3 S1TF2
     I                                        4   5 S1MTK3
     I                                        6   6 S1TF3
     I                                        7   7 S1MTK4
      *
     I            DS
     I                                        1  14 S1PART
     I                                        1   5 S1SHN1
     I                                        6   6 S1SF1
     I                                        7  11 S1SHN2
     I                                       12  12 S1SF2
     I                                       13  14 S1SHN3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * ENTRY LIST                                         *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1SUPP  4
     C                     PARM           P1CMD   2
      *----------------------------------------------------*
      * KEY LIST                                           *
      *----------------------------------------------------*
      *----------------------------------------------------*
      * MAIN ROUTINE                                       *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INITIALIZE                                         *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL*BLANK    P1CMD
      *
     C                     SETOF                     22
     C           P1SUPP    IFEQ '2323'
     C                     SETON                     22
     C                     ENDIF
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     MOVELP1SUPP    D1SUPP
     C                     MOVEL*BLANK    D1SUPN
      * VENDOR CODE
     C                     MOVE P1SUPP    K1SUPP  40
     C           K1SUPP    CHAINFGBPL011             92
     C           *IN92     IFEQ '0'
     C           B2SKJY    IFEQ 'D'
     C           B2SKHZ    ANDLEWTIHZ
     C                     ELSE
     C                     MOVELB2SMEI    D1SUPN
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      *  MAIN PROCESS                                      *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * SEARCH DATA                                        *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLAFGWP011
     C                     READ AFGWP011                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AFGWP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * 2ND SCREEN                                       *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEAFGPW029
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      * CHECK
     C                     SETOF                     3199
     C                     Z-ADD1         X       20
     C                     Z-ADD0         WKSEL   20
     C           X         DOWLE13
     C           X         CHAINSFL                  25
     C           *IN25     IFEQ '0'
     C           *IN99     ANDEQ'0'
     C                     SETOF                     31
     C                     EXSR #SB221
     C                     UPDATSFL
     C** UPDATED
     C           P1CMD     IFEQ 'UP'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
     C**
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C           *IN99     IFEQ '1'
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTAFGWP011
     C                     READPAFGWP011                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  13        CTRX
      *                         L-- MAXIMUM LINES
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPAFGWP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLAFGWP011
     C                     READ AFGWP011                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AFGWP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AFGWP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * CHECK SFL                                          *
      *----------------------------------------------------*
     CSR         #SB221    BEGSR
      *
     C                     SELEC
     C           S1SEL     WHEQ ' '
     C           S1SEL     WHEQ '1'
      *
     C                     SELEC
      * OUTSOURCE USING GPS -E.G. FCO
     C           P1SUPP    WHEQ '2112'
     C                     CALL 'AFGR03'
     C                     PARM           P1SUPP  4
     C                     PARM           D1SUPN 15
     C                     PARM           S1ODNO  60
     C                     PARM           S1SHN1  5
     C                     PARM           S1SHN2  5
     C                     PARM           S1SHN3  2
     C                     PARM           P1CMD   2
     C                     MOVEL*BLANK    S1SEL
      * NOT USING GPS,P.O. PER ORDER -E.G. FREEWAY
     C           P1SUPP    WHEQ '2323'
     C                     CALL 'AFGR35'
     C                     PARM           P1SUPP  4
     C                     PARM           D1SUPN 15
     C                     PARM           S1ODNO  60
     C                     PARM           P1CMD   2
     C                     MOVEL*BLANK    S1SEL
      * NOT USING GPS,P.O. PER PART -OTHERS
     C                     OTHER
     C                     CALL 'AFGR30'
     C                     PARM           P1SUPP  4
     C                     PARM           D1SUPN 15
     C                     PARM           S1ODNO  60
     C                     PARM           S1SHN1  5
     C                     PARM           S1SHN2  5
     C                     PARM           S1SHN3  2
     C                     PARM           P1CMD   2
     C                     MOVEL*BLANK    S1SEL
     C                     ENDSL
      *
     C                     ENDSL
      *
     CSR         ESB221    ENDSR
      *----------------------------------------------------*
      *  END PROCESS                                       *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * SEARCH DATA                                        *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 13
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * SEARCH DATA  REVERSE                               *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * JUDGEMENT                                          *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * DISPLAY ITEMS AND SUB FILE CLEAR                 *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVEL*BLANK    S1SEL
     C****                 MOVELW1DKBN    S1DKBN
     C                     Z-ADDW1ODNO    S1ODNO
      *
     C           P1SUPP    IFNE '2323'
     C                     MOVELW1PAR1    S1SHN1
     C                     MOVEL'-'       S1SF1
     C                     MOVELW1PAR2    S1SHN2
     C                     MOVEL'-'       S1SF2
     C                     MOVELW1PAR3    S1SHN3
     C           W1PAR3    IFEQ *BLANK
     C                     MOVEL*BLANK    S1SF2
     C                     ENDIF
      * FREEWAY
     C                     ELSE
     C                     MOVELW1PAR1    S1SHN1
     C                     MOVELW1PAR2    S1SHN2
      *
     C                     ENDIF
      *
     C                     Z-ADDW1IQTY    S1TQTY
     C                     Z-ADDW1IWGT    S1TWGT
     C                     Z-ADDW1HAKO    S1TBOX
      *
     C                     MOVELW1SUMD    S1B
     C                     MOVELW1SUMT    W1SUMX  4
     C                     MOVE W1SUMX    S1B
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT DATA                                          *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ AFGWP011                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PREVIOUS DATA                                      *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPAFGWP011                 81
      *
     CSR         ENEXTP    ENDSR
     C*----------------------------------------------------------------
**
ER-1 NO DATA.
ER-2 INPUT '1'.
