     H            Y.
     F** AFHR04 *********************************************
     F* CREATE EDI FORECAST 830 HEADER                      *
     F*     T.SAKAKI                          2016.11.04    *
     F*******************************************************
      * EDI PARAMETER FILE
     FEDIPP50 IF  E           K        DISK
      * FLAT DATA
     FOUTPUT  O   F     504            DISK
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        9  140@SYHZ6
     I                                        7  140@SYSHZ
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
      *
     I              '0123456789'          C         DIGITS
      *================================================================
      *  ENTRY LIST
      *================================================================
     C           *ENTRY    PLIST
     C                     PARM           P@SUPP  4
     C                     PARM           P@SNRV  1
     C                     PARM           P@DKBN  3
     C                     PARM           P@PTID 12
     C                     PARM           P@SERN 10
     C                     PARM           P@SDAT  80
     C                     PARM           P@EDAT  80
      *================================================================
      *  KEY LIST
      *================================================================
     C           KEY1      KLIST
     C                     KFLD           P@SUPP
     C                     KFLD           P@SNRV
     C                     KFLD           P@DKBN
      *================================================================
     C* MAIN
      *================================================================
     C                     TIME           @TIME
     C                     MOVE P@SERN    P@SER6  6
     C                     MOVE P@SDAT    P@SDT6  6
     C                     MOVE P@EDAT    P@EDT6  6
     C*
     C*
     C                     SETOF                     81
     C           KEY1      CHAINEDIPP501             81
     C           *IN81     IFEQ '0'
     C           E5SKJY    ANDNE'D'
      * OUTPUT
     C                     EXCPTHDWRT
      *
     C                     ENDIF
     C*
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      * OUTPUT
      *================================================================
     OOUTPUT  E                HDWRT
     O                                    1 'H'
     O* RECORD ID  2-7
     O                         P@SER6     7
     O* APPLICATION ID  8-10
     O                                   10 'PS '
     O* APPLICATION ALIAS  11-13
     O                                   13 '830'
     O* PARTNER ID  14-25
     O                         P@PTID    25
     O* RELEASE NUMBER  26-55 (10)  + BLANK 20
     O                         P@SERN    35
     O* BEGIN DATA  56-61
     O                         P@SDT6    61
     O* END DATA  62-67
     O                         P@EDT6    67
     O* ISSUE DATE  68-73
     O                         @SYHZ6    73
     O* FREE FORM 1  74-133
     O                         E5FRF1   133
     O* FREE FORM 2  134-193
     O                         E5FRF2   193
     O* FREE FORM 3  194-253
     O                         E5FRF3   253
     O* FREE FORM 4  254-313
     O                         E5FRF4   313
     O* SHIP TO  314-318
     O                         E5SHPT   318
     O* SHIP FROM  319-323
     O                         E5SHPF   323
     O* SELLING PARTY  324-328
     O                         E5SELP   328
