     H            Y/
     F** AG#R03 ********************************************
     F*  HONDA PRICE PLANT CODE LIST                       *
     F*                                                    *
     F*  J.WATANABE  2018.02.21                            *
     F******************************************************
     FAG#PP01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     C****************************************************
     C*  MAIN ROUTINE                                    *
     C****************************************************
     C                     EXSR #INIT
      *
     C           *LOVAL    SETLLAG#PP01
      *
     C           *IN95     DOWEQ*OFF
     C                     READ AG#PP01                  95
     C           *IN95     IFEQ *OFF
     C           G0SKJY    ANDNE'D'
     C                     EXSR #PRINT
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     EXCPT@FOT
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*-----------------------------------------------------
     C* PRINT
     C*-----------------------------------------------------
     C           #PRINT    BEGSR
      * GET CUST NAME
     C           G0TOKU    CHAINFGBPL01              99
     C           *IN99     IFEQ *OFF
     C                     MOVELB2SMEI    XTOKU  15
     C                     ELSE
     C                     MOVE *BLANK    XTOKU
     C                     ENDIF
      * GET DELIV NAME
     C           G0NONY    CHAINFGBPL01              99
     C           *IN99     IFEQ *OFF
     C                     MOVELB2SMEI    XNONY  15
     C                     ELSE
     C                     MOVE *BLANK    XNONY
     C                     ENDIF
      *
     C                     ADD  1         SEQ#
      *
     C           LINE#     IFGE 66
     C                     EXCPT@HED
     C                     Z-ADD4         LINE#
     C                     ENDIF
      *
     C           G0PLID    IFNE SVPLID
     C                     EXCPT@SPC
     C                     ADD  1         LINE#
     C                     MOVELG0PLID    SVPLID
     C                     ENDIF
      *
     C                     EXCPT@DTL
     C                     ADD  1         LINE#
      *
     C                     ENDSR
     C*-----------------------------------------------------
     C* INITIAL SET
     C*-----------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           WSDT
     C                     Z-ADD0         SEQ#    50
     C                     Z-ADD80        LINE#   30
     C                     MOVE *BLANK    SVPLID  3
      *
     C                     ENDSR
      ****************************************************
     OQPRINT  E   01           @HED
     O                         #PGM      10
     O                         #USER     20
     O                                   50 '** HONDA PRICE PLANT'
     O                                   70 ' CODE LIST **       '
     O                                   87 'DATE'
     O                         WSSDATY   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   02           @HED
     O                                   87 'TIME'
     O                         WSSTM6    98 '  :  :  '
     O        E   03           @HED
     O                                    5 'SEQ#'
     O                                   11 'PLANT'
     O                                   17 'CUST#'
     O                                   40 'DELIV#'
     O                                   74 'LAST_UPD'
     O                                   84 'TIME'
     O                                   93 'UPD_ID'
      *
     O        E 1              @DTL
     O                         SEQ#  Z    5
     O                         G0PLID    10
     O                         G0TOKU    16
     O                         XTOKU     32
     O                         G0NONY    38
     O                         XNONY     54
     O                         G0KODT    76 '    .  .  '
     O                         G0KOTM    85 '0 :  :  '
     O                         G0KOME    97
      *
     O        E 1              @FOT
     O                                   17 '** END OF LIST **'
      *
     O        E 1              @SPC
     O                                    1 '.'
