     H            Y.
     F** AG#R60 ********************************************
     F*  PRICE UPDATE DATA M/F UPDATE ERROR LIST 2         *
     F*    NEW PLANT CODE OR NOT IN SHIPPING MASTER        *
     F* T.SAKAKI   10.12.2015                              *
JW1  F* J.WATANABE 08.16.2016 CHG HEADER                   *
     F******************************************************
     FAG#WP40 IF  E                    DISK
     FQPRINT  O   F     132     OF     PRINTER
     F*
     E**JW1               TBL     1   3 72
JW1  E                    TBL     1   4 75
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1  25 W@MHIN
     I                                        1   5 W@MHN1
     I                                        6   6 W@MHNA
     I                                        7  11 W@MHN2
     I                                       12  12 W@MHNB
     I                                       13  17 W@MHN3
     I                                       18  18 W@MHNC
     I                                       19  23 W@MHN4
     C*
     C           1         SETLLAG#WP40
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AG#WP40                  99
     C   99                LEAVE
     C*
     C           W@1STP    IFEQ *ON
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     MOVEL*OFF      W@1STP
     C                     END
     C*
     C                     MOVEL*BLANK    W@MHIN
     C                     MOVELW4MHN1    W@MHN1
     C                     MOVELW4MHN2    W@MHN2
     C                     MOVELW4MHN3    W@MHN3
     C                     MOVELW4MHN4    W@MHN4
     C           W4MHN2    IFNE *BLANK
     C                     MOVEL'-'       W@MHNA
     C                     END
     C           W4MHN3    IFNE *BLANK
     C                     MOVEL'-'       W@MHNB
     C                     END
     C           W4MHN4    IFNE *BLANK
     C                     MOVEL'-'       W@MHNC
     C                     END
     C                     MOVELW@MHIN    P@MHIN 25
     C*
     C                     EXCPT@DTL
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*-----------------------------------------------------
     C* INITIAL SET
     C*-----------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C                     TIME           WSDT
     C*
     C                     MOVEL*ON       W@1STP  1
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     OQPRINT  E   01           @HED
     O**JW1                    #PGM      10
     O                         TBL,1     75
     O                                   87 'DATE'
     O                         WSSDATY   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
JW1  O                         #PGM     125
     O        E   02           @HED
     O                         TBL,2     75
     O                                   87 'TIME'
     O                         WSSTM6    98 '  :  :  '
     O        E   03           @HED
     O                         TBL,3     75
     O        E   04           @HED
     O                         TBL,4     75
     O        E   06           @HED
     O                                   12 'PLANT ID'
     O                                   26 'CUSTOMER'
     O                                   38 'DELIVERY'
     O                                   53 'USER PART'
     O                                   82 'UNIT PRICE'
     O                                  105 'EFECTIVE DATA'
     O                                  121 'EXPIRED DATA'
     O        E 1              @DTL
     O                         W4PPID    14
     O                         W4TOKU    24
     O                         W4NONY    36
     O                         P@MHIN    69
     O                         W4UPRC1   82
     O                         W4EDAT   102 '    /  /  '
     O                         W4XDAT   119 '    /  /  '
** TBL
<< EDI832 PRICE MASTER UPDATE DATA ERROR ** NEW DELIVERY CODE FOUND ** >>
 PLEASE REGISTER PLANT ID AND DELIVERY CODE FROM THE HONDA MENU -
 OPTION 13 (1 & 2). THEN ASK IT MENBER TO REQUEUE UPLOAD PRICE JOB
 OR REGISTER UNIT PRICE BY MANUAL.
