     FAG#PL20 UF  E           K        DISK
     FFBCPL07 UF  E           K        DISK                      A
     FAGDPL12 IF  E           K        DISK
JW1  FFBCPP05 O   E                    DISK
      *-----------------------------------------------------
      *  JW    2019.10.02 ADD FBCPP05
      *-----------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  20 WKMHIN
     I                                        1   5 FBMHN1
     I                                        6  10 FBMHN2
     I                                       11  15 FBMHN3
     I                                       16  20 FBMHN4
     I            DS
     I                                        1  12 FBSHIN
     I                                        1   5 FBSHN1
     I                                        6  10 FBSHN2
     I                                       11  12 FBSHN3
     I            DS
     I                                        1   80FBTKHZ
     I                                        1   40FBTKYY
     I                                        5   60FBTKMM
     I                                        7   80FBTKDD
     I            DS
     I                                        1   80FBTSHZ
     I                                        1   40FBTSYY
     I                                        5   60FBTSMM
     I                                        7   80FBTSDD
      *-----------------------------------------------------
     C                     TIME           WSDT
      *-----------------------------------------------------
     C                     MOVEL*BLANK    K@A001  1
     C           K@A001    SETLLAG#PL20
     C*
     C                     DO   *HIVAL
     C*
     C           K@A001    READEAG#PL20                  99
     C   99                LEAVE
      *
     C           K#KEYX    KLIST
     C                     KFLD           K@TOKU  40
     C                     KFLD           K@NONY  40
     C                     KFLD           G2MHN1
     C                     KFLD           G2MHN2
     C                     KFLD           G2MHN3
     C                     KFLD           G2MHN4
     C                     MOVELG2TOKU    K@TOKU
     C                     MOVELG2NONY    K@NONY
     C           K#KEYX    SETLLFBCPL07
      *
     C           *IN95     DOUEQ*ON
     C           K#KEYX    READEFBCPL07                  95
     C           *IN95     IFEQ *OFF
     C           FBSKJY    ANDEQ*BLANK
     C           FBTSHZ    ANDEQ99999999
     C           K#AGDP    KLIST
     C                     KFLD           G2EFYY
     C                     KFLD           G2EFMM
     C                     KFLD           G2EFDD
     C           K#AGDP    CHAINAGDPL12              94
     C  N94                READPAGDPL12                  94
     C  N94                Z-ADDF8KAYY    FBTSYY
     C  N94                Z-ADDF8KAMM    FBTSMM
     C  N94                Z-ADDF8KADD    FBTSDD
     C   94                Z-ADD7777      FBTSYY
     C   94                Z-ADD77        FBTSMM
     C   94                Z-ADD77        FBTSDD
     C                     Z-ADDWSSYYY    FBKOYY
     C                     Z-ADDWSSMMM    FBKOMM
     C                     Z-ADDWSSDDD    FBKODD
     C                     Z-ADDWSSHHH    FBKOHH
     C                     Z-ADDWSSNNN    FBKOSS
     C                     MOVEL'EDI832'  FBKOME    P
     C                     UPDATFBCPL071
JW1   * OUT LOG#
"    C                     MOVE 'C'       LOGFLG  1
"    C                     EXSR #LOG
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *-----------------------------------------------------
     C                     CLEARFBCPL071
     C                     Z-ADDWSSYYY    FBKOYY
     C                     Z-ADDWSSMMM    FBKOMM
     C                     Z-ADDWSSDDD    FBKODD
     C                     Z-ADDWSSHHH    FBKOHH
     C                     Z-ADDWSSNNN    FBKOSS
     C                     MOVEL'EDI832'  FBKOME    P
     C                     MOVELG2TOKU    FBTOKU
     C                     MOVELG2NONY    FBNONY
     C                     MOVELG2MHN1    FBMHN1
     C                     MOVELG2MHN2    FBMHN2
     C                     MOVELG2MHN3    FBMHN3
     C                     MOVELG2MHN4    FBMHN4
     C                     Z-ADDG2PRIC    FBNTAN
     C                     Z-ADDG2EFYY    FBTKYY
     C                     Z-ADDG2EFMM    FBTKMM
     C                     Z-ADDG2EFDD    FBTKDD
     C                     Z-ADD9999      FBTSYY
     C                     Z-ADD99        FBTSMM
     C                     Z-ADD99        FBTSDD
     C                     MOVELFBTOKU    PTOKU   4
     C                     MOVELFBNONY    PNONY   4
     C                     MOVELFBNKOJ    PNKOJ   1
     C                     MOVELFBNUKE    PNUKE   4
     C                     MOVELWKMHIN    PMHIN  20
     C                     MOVEL*BLANK    PSHIN  12
     C                     MOVEL*BLANK    @FLG    1
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           PSHIN  12
     C                     PARM           @FLG    1
      *
     C                     MOVELPSHIN     FBSHIN
JW   C                     MOVE 'N'       FBIND
     C                     WRITEFBCPL071
JW1   * OUT LOG#
 "   C                     MOVE 'A'       LOGFLG
 "   C                     EXSR #LOG
     C*-----------------------------------------------------
     C                     Z-ADDWSSDAT    G2KODT
     C                     Z-ADDWSSTM6    G2KOTM
     C                     MOVEL'1'       G2PROC
     C                     UPDATAG#PP201
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*-----------------------------------------------------
JW1  C* OUT LOG FILE
     C*-----------------------------------------------------
     C           #LOG      BEGSR
      *
     C                     CLEARFBCPP051
      *
     C                     MOVELFBSKJY    F5SKJY
     C                     Z-ADDFBTOKU    F5TOKU
     C                     Z-ADDFBNONY    F5NONY
     C                     MOVELFBNKOJ    F5NKOJ
     C                     MOVELFBNUKE    F5NUKE
     C                     MOVELFBMHN1    F5MHN1
     C                     MOVELFBMHN2    F5MHN2
     C                     MOVELFBMHN3    F5MHN3
     C                     MOVELFBMHN4    F5MHN4
JW   C                     MOVELFBSHN1    F5SHN1
     C                     MOVELFBSHN2    F5SHN2
     C                     MOVELFBSHN3    F5SHN3
      *
     C                     Z-ADDFBNTAN    F5NTAN
     C                     Z-ADDFBTKHZ    F5TKHZ
     C                     Z-ADDFBTSHZ    F5TSHZ
      *
     C                     TIME           WSDT
     C                     Z-ADDTODAY     F5PRHZ
     C                     Z-ADDNOW       F5PRTM
     C                     MOVEL#USER     F5PRUS
     C                     MOVEL#PGM      F5PRPG
     C                     SELEC
     C           LOGFLG    WHEQ 'A'
     C                     MOVEL'ADD'     F5PTYP
     C                     Z-ADDTODAY     F5CRHZ
     C                     Z-ADDNOW       F5CRTM
     C                     MOVEL#USER     F5CRUS
     C                     MOVEL#PGM      F5CRPG
     C           LOGFLG    WHEQ 'C'
     C                     MOVEL'CHG'     F5PTYP
     C                     Z-ADDTODAY     F5CHHZ
     C                     Z-ADDNOW       F5CHTM
     C                     MOVEL#USER     F5CHUS
     C                     MOVEL#PGM      F5CHPG
     C           LOGFLG    WHEQ 'D'
     C                     MOVEL'DLT'     F5PTYP
     C                     Z-ADDTODAY     F5DLHZ
     C                     Z-ADDNOW       F5DLTM
     C                     MOVEL#USER     F5DLUS
     C                     MOVEL#PGM      F5DLPG
     C                     ENDSL
      *
     C                     WRITEFBCPP051
      *
JW1  C                     ENDSR
