     H            Y.
     F*** AGAR70 *****************************************
     F*   平準化確定発注ファイル　運行便　一括変更     *
     F*            TCH : N.HYOTO   2001.04.25            *
     F****************************************************
     FAGAPW70 CF  E                    WORKSTN
     FAGAPP31 UF  E                    DISK
     E                    ER      1   1 60               ERROR MSG
     I            DS
     I                                        1   80CBKOHZ
     I                                        1   40CBKOYY
     I                                        5   60CBKOMM
     I                                        7   80CBKODD
     I*           DS
     I*                                       1  120@TIME
     I*                                       1   20@TIHH
     I*                                       3   40@TIMM
     I*                                       5   60@TISS
     I*                                       7   80@DTYY
     I*                                       9  100@DTMM
     I*                                      11  120@DTDD
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C***********************************************************
     C* @INZ:INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C*
     C                     ENDSR
     C***********************************************************
     C* @MAIN:CONTROL DISPLAY
     C***********************************************************
     C           @MAIN     BEGSR
     C*
B01  C           *INKC     DOWEQ'0'
     C*
     C                     EXFMTAGAPW701
     C* CLEAR MSG
     C                     MOVE *BLANK    @ERMSG
     C                     SETOF                     99
     C*
B02  C           *INKC     IFEQ '1'
     C*
     C                     ELSE
B03  C           *INKE     IFEQ '1'
     C                     EXSR @UPD
     C                     END
     C*
     C                     END
     C*
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @UPD:
     C***********************************************************
     C           @UPD      BEGSR
     C*
     C                     SETOF                     89
     C*
     C           *LOVAL    SETLLAGAPP311
     C                     READ AGAPP311                 90
     C           *IN90     DOWEQ'0'
     C*
     C           CBSKJY    IFEQ ' '
     C           CBHBNS    IFEQ @MKROM
     C                     Z-ADD*DATE     CBKOHZ
     C                     MOVE @MKROA    CBHBNS
     C                     UPDATAGAPP311
     C                     SETON                     89
     C                     END
     C                     END
     C*
     C                     READ AGAPP311                 90
     C                     END
     C*
     C           *IN89     IFEQ '0'
     C                     MOVEAER,1      @ERMSG
     C                     SETON                     99
     C                     END
     C*
     C                     ENDSR
     C***********************************************************
     C* @END:
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
** MSG
ERR-1該当データがありません。
