     H            Y
      **   AGAR50   *********************************
      *   UPDATE OF PROCESSING CYCLE CHECK M/F      *
      *                    WRITTEN ==> S.OOTAKE     *
      *                    UPDATE  ==> 1993/07/06   *
      *********************************   AGAR50   **
      ** SCREEN FILE
     FAGAPW50 CF  E                    WORKSTN
      *******************************************************
      ** LEVELLED PRODUCTION FILE PROCESSING CYCLE CHECK M/F
     FAGAPL50 UF  E           K        DISK                      A
      *******************************************************
      ** RATHER THIN M/F
     FFGBPL01 IF  E           K        DISK
      *******************************************************
     E                    ER      1   7 60
     E                    MAE         3  4
     E                    MAEN        3 15
      *** AN ARRANGEMENT OF SECTION CODE ***
     I            DS
     I                                        1  12 MAE
     I                                        1   4 SMAECD
     I                                        5   8 SMEKCD
     I                                        9  12 SKAKCD
      *** AN ARRANGEMENT OF A SECTION NAME ***
     I            DS
     I                                        1  45 MAEN
     I                                        1  15 DMAENM
     I                                       16  30 DMEKNM
     I                                       31  45 DKAKNM
      ***     DS OF TIME      ***
     I            DS
     I                                        1   60JIKAN
     I                                        1   20CCKOHH
     I                                        3   40CCKOSS
     I                                        5   60CCKOBY
      *** DS OF RATHER THIN DELETE DATE ***
     I            DS
     I                                        1   80SAIHIZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     C           KEY1      KLIST
     C                     KFLD           CCMBMN
     C                     KFLD           CCMMKR
     C                     KFLD           CCNEXT
      *
     C           KEY2      KLIST
     C                     KFLD           B2CODE
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      **************************************************
      ***        PGM START            (MAIN-RTN)     ***
      **************************************************
     C           STEP1     TAG
     C                     EXSR CLEAR
      *
     C           STEP2     TAG
     C                     EXFMTAGAPW501
     C                     SETOF                     010203
     C                     SETOF                     041520
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     363738
     C                     SETOF                     919293
     C                     SETOF                     949596
     C                     SETOF                     99
     C                     MOVE *BLANK    DMAENM
     C                     MOVE *BLANK    DMEKNM
     C                     MOVE *BLANK    DKAKNM
      *
     C           *INKA     IFEQ '1'
     C                     SETON                         LR
     C                     RETRN
     C                     END
      *
     C           *IN45     IFEQ '1'
     C                     CALL 'GGBR19'
     C                     SETOF                     45
     C                     GOTO STEP2
     C                     END
      ***** UPDATE INSTRUCTION CHECK ****
      *
     C           SKUBN     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STEP2
     C                     END
     C           SKUBN     IFNE '0'
     C           SKUBN     ANDNE'1'
     C           SKUBN     ANDNE'2'
     C                     SETON                     0199
     C                     MOVELER,2      MSG
     C                     GOTO STEP2
     C                     END
      ***** CHECK OF PART CODE *****
      *
     C           SMAECD    IFEQ *BLANK
     C           SMEKCD    ANDEQ*BLANK
     C           SKAKCD    ANDEQ*BLANK
     C                     SETON                     020304
     C                     SETON                     99
     C                     MOVELER,1      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           SMAECD    IFNE *BLANK
     C           SMEKCD    ANDEQ*BLANK
     C           SKAKCD    ANDNE*BLANK
     C                     SETON                     0399
     C                     MOVELER,4      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     EXSR SAIRED
      *
     C           FLG       IFNE 0
     C                     MOVELER,4      MSG
     C                     GOTO STEP2
     C                     END
      *
     C                     EXSR KEYSET
     C                     EXSR KAKRED
      *
     C           SW        IFNE 0
     C                     SETON                     020304
     C                     SETON                     99
     C                     GOTO STEP2
     C                     END
      *
     C                     EXSR HYOJI
      *
     C           STEP3     TAG
     C                     EXFMTAGAPW502
     C                     SETOF                     010203
     C                     SETOF                     0415
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     363738
     C                     SETOF                     99
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STEP1
     C                     END
      *
     C           SKUBN     IFEQ '0'
     C                     GOTO STEP4
     C                     END
      *
     C                     EXSR BLKCHK
     C           ERR       IFEQ 1
     C                     SETON                     99
     C                     MOVELER,1      MSG
     C                     GOTO STEP3
     C                     END
      *
     C           STEP4     TAG
     C           *INKE     IFNE '1'
     C                     GOTO STEP3
     C                     END
     C                     EXSR KOSHIN
     C                     SETOF                     20
     C                     GOTO STEP1
      ************************************
      * FORMAT OF SCREEN FIELD   (CLEAR) *
      ************************************
     C           CLEAR     BEGSR
     C                     MOVE *BLANK    SKUBN
     C                     MOVE *BLANK    SMAECD
     C                     MOVE *BLANK    SMEKCD
     C                     MOVE *BLANK    SKAKCD
     C                     MOVE *BLANK    DMAENM
     C                     MOVE *BLANK    DMEKNM
     C                     MOVE *BLANK    DKAKNM
     C                     MOVE *BLANK    SMAEHI
     C                     MOVE *BLANK    SMAEBN
     C                     MOVE *BLANK    SMAECI
     C                     MOVE *BLANK    SMEKHI
     C                     MOVE *BLANK    SMEKBN
     C                     MOVE *BLANK    SMEKCI
     C                     MOVE *BLANK    SKAKHI
     C                     MOVE *BLANK    SKAKBN
     C                     MOVE *BLANK    SKAKCI
     C                     ENDSR
      ************************************
      * RATHER THIN M/F   READ (SAIRED)  *
      ************************************
     C           SAIRED    BEGSR
     C                     Z-ADD1         I       10
     C                     Z-ADD0         FLG     10
      *
     C                     DO   3         I
     C           MAE,I     IFEQ *BLANK
     C                     GOTO EXIT
     C                     END
     C                     MOVE MAE,I     B2CODE
     C                     SETOF                     15
     C           KEY2      CHAINFGBPL011             15
     C           *IN15     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           SAIHIZ    ANDLE*DATE
     C                     Z-ADD1         FLG     10
     C                     EXSR INVLID
     C                     MOVELER,3      MSG
     C                     GOTO EXIT
     C                     END
     C           *IN15     IFEQ '1'
     C                     Z-ADD1         FLG     10
     C                     EXSR INVLID
     C                     MOVELER,3      MSG
     C                     GOTO EXIT
     C                     END
     C                     MOVE B2SMEI    MAEN,I
     C           EXIT      TAG
     C                     ENDDO
     C                     ENDSR
      ****************************************
      * RATHER THIN M/F  IN INVALID (INVALID)*
      ****************************************
     C           INVLID    BEGSR
     C           I         IFEQ 1
     C                     SETON                     02
     C                     END
     C           I         IFEQ 2
     C                     SETON                     03
     C                     END
     C           I         IFEQ 3
     C                     SETON                     04
     C                     END
     C                     SETON                     99
     C                     ENDSR
      ****************************
      * SETTING OF A KEY (KEYSET)*
      ****************************
     C           KEYSET    BEGSR
     C           SMAECD    IFEQ *BLANK
     C                     Z-ADD0         CCMBMN
     C                     ELSE
     C                     MOVE SMAECD    CCMBMN
     C                     END
     C           SMEKCD    IFEQ *BLANK
     C                     Z-ADD0         CCMMKR
     C                     ELSE
     C                     MOVE SMEKCD    CCMMKR
     C                     END
     C           SKAKCD    IFEQ *BLANK
     C                     Z-ADD0         CCNEXT
     C                     ELSE
     C                     MOVE SKAKCD    CCNEXT
     C                     END
     C                     ENDSR
      ********************************************
      * PROCESSING CYCLE CHECK M   READ (KAKRED) *
      ********************************************
     C           KAKRED    BEGSR
     C                     Z-ADD0         SW      10
     C                     SETOF                     20
     C           KEY1      CHAINAGAPL501             20
      *
     C           SKUBN     IFEQ '0'
     C           *IN20     ANDEQ'0'
     C           CCSKJY    ANDEQ'D'
     C           CCSKHZ    ANDLE*DATE
     C                     Z-ADD1         SW      10
     C                     MOVELER,5      MSG
     C                     GOTO KAKEND
     C                     END
      *
     C           SKUBN     IFEQ '0'
     C           *IN20     ANDEQ'1'
     C                     Z-ADD1         SW      10
     C                     MOVELER,6      MSG
     C                     GOTO KAKEND
     C                     END
      *
      *
     C           SKUBN     IFEQ '1'
     C           *IN20     ANDEQ'0'
     C           CCSKJY    ANDEQ'D'
     C           CCSKHZ    ANDLE*DATE
     C                     Z-ADD1         SW      10
     C                     MOVELER,5      MSG
     C                     GOTO KAKEND
     C                     END
      *
     C           SKUBN     IFEQ '1'
     C           *IN20     ANDEQ'1'
     C                     Z-ADD1         SW      10
     C                     MOVELER,6      MSG
     C                     GOTO KAKEND
     C                     END
      *
     C           SKUBN     IFEQ '2'
     C           *IN20     ANDEQ'0'
     C           CCSKJY    ANDEQ'D'
     C           CCSKHZ    ANDLE*DATE
     C                     GOTO KAKEND
     C                     END
      *
     C           SKUBN     IFEQ '2'
     C           *IN20     ANDEQ'0'
     C                     Z-ADD1         SW      10
     C                     MOVELER,7      MSG
     C                     GOTO KAKEND
     C                     END
     C           KAKEND    TAG
     C                     ENDSR
      *******************
      * DISPLAY (HYOJI) *
      *******************
     C           HYOJI     BEGSR
     C           SKUBN     IFEQ '0'
     C                     SETON                     919293
     C                     END
      *
     C           SKUBN     IFEQ '0'
     C           SMAECD    IFEQ *BLANK
     C                     SETON                     94
     C                     END
     C                     END
      *
     C           SKUBN     IFEQ '0'
     C           SMEKCD    IFEQ *BLANK
     C                     SETON                     95
     C                     END
     C                     END
      *
     C           SKUBN     IFEQ '0'
     C           SKAKCD    IFEQ *BLANK
     C                     SETON                     96
     C                     END
     C                     END
      *
     C           SKUBN     IFNE '0'
     C           SMAECD    IFEQ *BLANK
     C                     SETON                     9194
     C                     END
     C                     END
      *
     C           SKUBN     IFNE '0'
     C           SMEKCD    IFEQ *BLANK
     C                     SETON                     9295
     C                     END
     C                     END
      *
     C           SKUBN     IFNE '0'
     C           SKAKCD    IFEQ *BLANK
     C                     SETON                     9396
     C                     END
     C                     END
     C           SKUBN     IFEQ '0'
     C           SKUBN     OREQ '1'
     C                     ELSE
     C                     GOTO HYOEND
     C                     END
     C           SMAECD    IFEQ *BLANK
     C                     ELSE
     C                     Z-ADDCCMSA1    SMAEHI
     C                     Z-ADDCCMSA2    SMAEBN
     C                     Z-ADDCCMSA3    SMAECI
     C                     END
     C           SMEKCD    IFEQ *BLANK
     C                     ELSE
     C                     Z-ADDCCTSA1    SMEKHI
     C                     Z-ADDCCTSA2    SMEKBN
     C                     Z-ADDCCTSA3    SMEKCI
     C                     END
     C           SKAKCD    IFEQ *BLANK
     C                     ELSE
     C                     Z-ADDCCKSA1    SKAKHI
     C                     Z-ADDCCKSA2    SKAKBN
     C                     Z-ADDCCKSA3    SKAKCI
     C                     END
     C           HYOEND    TAG
     C                     ENDSR
      ***************************
      * BLANK CHECK  (BLKCHK)   *
      ***************************
     C           BLKCHK    BEGSR
     C                     Z-ADD0         ERR     10
     C           SMAECD    IFEQ *BLANK
     C                     GOTO END1
     C                     END
      *
     C           SMAEHI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     30
     C                     END
     C           SMAEBN    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     31
     C                     END
     C           SMAECI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     32
     C                     END
      *
     C           END1      TAG
     C           SMEKCD    IFEQ *BLANK
     C                     GOTO END2
     C                     END
      *
     C           SMEKHI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     33
     C                     END
     C           SMEKBN    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     34
     C                     END
     C           SMEKCI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     35
     C                     END
      *
     C           END2      TAG
     C           SKAKCD    IFEQ *BLANK
     C                     GOTO END3
     C                     END
      *
     C           SKAKHI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     36
     C                     END
     C           SKAKBN    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     37
     C                     END
     C           SKAKCI    IFEQ 0
     C                     Z-ADD1         ERR
     C                     SETON                     38
     C                     END
     C           END3      TAG
     C                     ENDSR
      *********************************************
      * AFTER TWO SCREEN  TO FILE UPDATE (KOSHIN) *
      *********************************************
     C           KOSHIN    BEGSR
     C                     EXSR TENKI
      *
     C           *IN20     IFEQ '0'
     C                     UPDATAGAPL501
     C                     ELSE
     C                     WRITEAGAPL501
     C                     END
     C                     ENDSR
      ************************************
      * POSTING TO FILE ITEM   (TENKI)   *
      ************************************
     C           TENKI     BEGSR
     C           SKUBN     IFEQ '0'
     C                     MOVE 'D'       CCSKJY
     C                     Z-ADD*YEAR     CCSKYY
     C                     Z-ADD*MONTH    CCSKMM
     C                     Z-ADD*DAY      CCSKDD
     C                     ELSE
     C                     MOVE ' '       CCSKJY
     C                     Z-ADD0         CCSKYY
     C                     Z-ADD0         CCSKMM
     C                     Z-ADD0         CCSKDD
     C                     END
     C                     Z-ADD*YEAR     CCKOYY
     C                     Z-ADD*MONTH    CCKOMM
     C                     Z-ADD*DAY      CCKODD
     C                     TIME           JIKAN
     C                     MOVE US        CCKOME
     C                     Z-ADDSMAEHI    CCMSA1
     C                     Z-ADDSMAEBN    CCMSA2
     C                     Z-ADDSMAECI    CCMSA3
     C                     Z-ADDSMEKHI    CCTSA1
     C                     Z-ADDSMEKBN    CCTSA2
     C                     Z-ADDSMEKCI    CCTSA3
     C                     Z-ADDSKAKHI    CCKSA1
     C                     Z-ADDSKAKBN    CCKSA2
     C                     Z-ADDSKAKCI    CCKSA3
     C                     ENDSR
**   MSG
E-01 INPUT TURNING OVER DEPARTMENT
E-02 IT IS RANGE OUTSIDE OF UPDATE INSTRUCTION
E-03 THERE ISN'T DATA COMING UNDER RATHER THIN M/F
E-04 INPUT SECTION CODE
E-05 IT IS ELIMINATED FROM PROCESSING CYCLE CHECK M/F
E-06 NOT DATA COMING UNDER PROCESSING CYCLE CHECK M/F
E-07 IT IS REGISTERED WITH PROCESSING CYCLE CHECK M/F
