     H            Y
      **   AGAR52   *********************************
      *    WORK FILE OUTPUT BUSINESS                *
      *                    WRITTEN ==> S.OOTAKE     *
      *                    UPDATE  ==> 1993/07/09   *
      *********************************   AGAR52   **
      ** LEVELLED PRODUCTION FILE PROCESSING CYCLE CHECK M/F
     FAGAPP50 IP  E           K        DISK
      ********************************************
      ** LEVELLED PRODUCTION FILE PROCESSING CYCLE CHECK M/F WK
     FAGAWP51 O   F      45            DISK
      ********************************************
      *****  ARRANGEMENT  *****
     E                    CCD         3  4 0
     E                    MCD         3  4 0
     E                    WCD         3  5 0
      *** AN ARRANGEMENT OF WK SECTION CODE ***
     I            DS
     I                                        1  150WCD
     I                                        1   50WKWBMN
     I                                        6  100WKWMKR
     I                                       11  150WKWNEX
      ***  AN ARRANGEMENT OF SECTION CODE  ***
     I            DS
     I                                        1  120CCD
     I                                        1   40CCMBMN
     I                                        5   80CCMMKR
     I                                        9  120CCNEXT
      ***  AN ARRANGEMENT OF SECTION CODE  ***
     I            DS
     I                                        1  120MCD
     I                                        1   40WKMBMN
     I                                        5   80WKMMKR
     I                                        9  120WKNEXT
     I            DS
     I                                        1   80CCSKHZ
     I                                        1   40CCSKYY
     I                                        5   60CCSKMM
     I                                        7   80CCSKDD
      *
      *****************************************
      ***         PGM START                 ***
      *****************************************
      *
     C           CCSKJY    IFEQ 'D'
     C           CCSKHZ    ANDLE*DATE
     C                     GOTO SKIP
     C                     END
     C                     Z-ADD1         I       10
      *
     C                     DO   3         I
     C           CCD,I     IFEQ 0
     C           I         IFEQ 1
     C                     Z-ADD99999     WCD,I
     C                     Z-ADD0         MCD,I
     C                     END
     C           I         IFEQ 2
     C           CCD,1     IFEQ 0
     C                     Z-ADD55555     WCD,I
     C                     Z-ADD0         MCD,I
     C                     ELSE
     C                     Z-ADD0         WCD,I
     C                     Z-ADD0         MCD,I
     C                     END
     C                     END
     C           I         IFEQ 3
     C                     Z-ADD0         WCD,I
     C                     Z-ADD0         MCD,I
     C                     END
     C                     ELSE
     C                     Z-ADDCCD,I     WCD,I
     C                     Z-ADDCCD,I     MCD,I
     C                     END
     C                     ENDDO
      *
     C                     Z-ADDCCMSA1    WKMSA1  20
     C                     Z-ADDCCMSA2    WKMSA2  20
     C                     Z-ADDCCMSA3    WKMSA3  20
     C                     Z-ADDCCTSA1    WKTSA1  20
     C                     Z-ADDCCTSA2    WKTSA2  20
     C                     Z-ADDCCTSA3    WKTSA3  20
     C                     Z-ADDCCKSA1    WKKSA1  20
     C                     Z-ADDCCKSA2    WKKSA2  20
     C                     Z-ADDCCKSA3    WKKSA3  20
      *
     C                     EXCPTDT
     C                     SETON                     U1
     C           SKIP      TAG
     OAGAWP51 E                DT
     O                         WKWBMN     5
     O                         WKWMKR    10
     O                         WKWNEX    15
     O                         WKMBMN    19
     O                         WKMMKR    23
     O                         WKNEXT    27
     O                         WKMSA1    29
     O                         WKMSA2    31
     O                         WKMSA3    33
     O                         WKTSA1    35
     O                         WKTSA2    37
     O                         WKTSA3    39
     O                         WKKSA1    41
     O                         WKKSA2    43
     O                         WKKSA3    45
