     H            Y.
     F*** AGAR60 *****************************************
     F*   平準化確定発注ファイル　運行経路一括変更     *
     F*            MSK : K.KUNIEDA      93.07.16         *
     F****************************************************
     FAGAPW60 CF  E                    WORKSTN
     FAAKPL21 IF  E           K        DISK
     FAAKPL41 UF  E           K        DISK
     FAGAPP31 UF  E                    DISK
     FAGAWP31 UF  E                    DISK
     FAGAWP60 O   F      64            DISK
     E                    ER      1   6 60               * d[ｰ xlﾈｰﾆﾞ
     I            DS
     I                                        1   80CBSKHZ
     I                                        1   40CBSKYY
     I                                        5   60CBSKMM
     I                                        7   80CBSKDD
     I            DS
     I                                        1   80WBSKHZ
     I                                        1   40WBSKYY
     I                                        5   60WBSKMM
     I                                        7   80WBSKDD
     I            DS
     I                                        1   60@TIME
     I                                        1   20@TIHH
     I                                        3   40@TIMM
     I                                        5   60@TISS
     C           *ENTRY    PLIST
     C                     PARM           PARM1  10
     C                     PARM           CANSW   1        * gz]ﾈﾓ
      *----------------------------------------------------*
      *    K E Y  L I S T                                  *
      *----------------------------------------------------*
      * c]ﾃc ibﾜ kdlh uﾇj-
     C           #KEYFH    KLIST
     C                     KFLD           #KMBMN  40
     C                     KFLD           #KMMKR  40
     C                     KFLD           #KNEXT  40
      *----------------------------------------------------*
      *  b p ﾆ z ﾓ  ﾈ l n                                  *
      *----------------------------------------------------*
     C                     Z-ADD0         @MMKR
     C                     Z-ADD0         @NEXT
     C                     MOVE *BLANK    @MKROM
     C                     MOVE *BLANK    @MKROA
     C                     MOVE *BLANK    @TKROM
     C                     MOVE *BLANK    @TKROA
     C                     MOVE *BLANK    @KKROM
     C                     MOVE *BLANK    @KKROA
     C                     TIME           @TIME
     C                     MOVELUDATE     @DATE
      *
     C           $DSP01    TAG
     C                     EXFMTAGAPW601
     C           *INKA     IFEQ '1'                        * CMD-1
     C                     MOVE '9'       CANSW
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     SETOF                     404142
     C                     SETOF                     606162
     C                     SETOF                     656667
     C                     SETOF                     20  99
      *
     C                     MOVE @MBMN     #KMBMN
     C                     MOVE @MMKR     #KMMKR
     C                     MOVE @NEXT     #KNEXT
     C           #KEYFH    CHAINAAKPL411             20
     C           *IN20     IFEQ '0'
     C                     UPDATAAKPL411
     C           FHSKJY    IFEQ 'D'
     C           FHSKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     END
     C                     END
     C           *IN20     IFEQ '1'
     C                     SETON                     606162
     C                     SETON                     404142
     C                     SETON                     99
     C                     MOVELER,01     @ERMSG
     C                     GOTO $DSP01
     C                     END
      *
      *== s]ﾃc ud c]ﾃc ibﾜ ﾈln
      *
     C                     MOVE FHMKRO    @MKROM
     C                     MOVE FHTKRO    @TKROM
     C                     MOVE FHKKRO    @KKROM
      *----------------------------------------------------*
      *   s]ﾃc ﾃﾞ c]ﾃc ibﾜ pﾏcﾒﾑh kdlh                     *
      *----------------------------------------------------*
      *== udﾃcmb
     C                     MOVE *BLANK    KEIRO   3
     C           @MBMN     IFNE *ZERO
     C           @MKROA    ANDEQ*BLANK
     C                     SETON                     606599
     C                     MOVELER,02     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C           @MKROA    IFNE '999'
     C           @MKROA    ANDNE*BLANK
     C                     MOVE @MKROA    KEIRO
     C                     EXSR $SB100
     C           *IN89     IFEQ '1'
     C                     SETON                       6599
     C                     MOVELER,05     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C                     END
      *== xlgﾃcmb
     C           @MMKR     IFNE *ZERO
     C           @TKROA    ANDEQ*BLANK
     C                     SETON                     616699
     C                     MOVELER,03     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C           @TKROA    IFNE '999'
     C           @TKROA    ANDNE*BLANK
     C                     MOVE @TKROA    KEIRO
     C                     EXSR $SB100
     C           *IN89     IFEQ '1'
     C                     SETON                       6699
     C                     MOVELER,05     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C                     END
      *== 2ﾆﾞfﾃc
     C           @NEXT     IFNE *ZERO
     C           @KKROA    ANDEQ*BLANK
     C                     SETON                     626799
     C                     MOVELER,04     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C           @KKROA    IFNE '999'
     C           @KKROA    ANDNE*BLANK
     C                     MOVE @KKROA    KEIRO
     C                     EXSR $SB100
     C           *IN89     IFEQ '1'
     C                     SETON                       6699
     C                     MOVELER,05     @ERMSG
     C                     GOTO $DSP01
     C                     END
     C                     END
      *
     C  NKE                GOTO $DSP01                     * CMD-5
      *----------------------------------------------------*
      *    ﾆﾑﾒ gz]ﾈﾓ ﾌ]jﾞ]                                 *
      *----------------------------------------------------*
     C                     SETOF                         70
     C           @MBMN     IFNE *ZERO
     C           @MKROA    IFEQ '999'
     C                     SETON                         70
     C                     END
     C                     END
     C           @MMKR     IFNE *ZERO
     C           *IN70     ANDEQ'1'
     C                     SETOF                         70
     C           @TKROA    IFEQ '999'
     C                     SETON                         70
     C                     END
     C                     END
     C           @NEXT     IFNE *ZERO
     C           *IN70     ANDEQ'1'
     C                     SETOF                         70
     C           @KKROA    IFEQ '999'
     C                     SETON                         70
     C                     END
     C                     END
     C           *IN70     IFEQ '1'
     C                     MOVE '9'       CANSW
     C                     SETON                         LR
     C                     RETRN
     C                     END
      *----------------------------------------------------*
      *sbﾆﾞﾏ]f fhmb FILE UPDATE & UPDATE FILE CREATE       *
      *----------------------------------------------------*
      *
      *  FSW1   ===>  ' '  ﾃcﾆ] mﾞｰj oﾆ
      *               '*'  ﾃcﾆ] mﾞｰj aﾒ
      *
     C                     SETOF                         81
     C           1         SETLLAGAPP311
     C                     DO   *HIVAL
     C                     READ AGAPP311                 81
     C           *IN81     IFEQ '0'
     C                     MOVE *BLANK    FSW1    1
     C                     SETOF                         82
      *
      *== sbﾆﾞﾏ]f ﾎabﾓ ﾑvnﾌﾞﾆ
      *
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                         82
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           @MBMN     ANDEQCBMBMN
     C           @MMKR     ANDEQCBMMKR
     C           @NEXT     ANDEQCBNEXT
      *
      *== ud ﾃcmb ibﾜ
      *
     C           @MKROA    IFNE '999'
     C           @MBMN     IFEQ CBMBMN
     C                     MOVE @MKROA    CBMKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
      *== xlg ﾃcmb ibﾜ
      *
     C           @TKROA    IFNE '999'
     C           @MMKR     IFEQ CBMMKR
     C                     MOVE @TKROA    CBTKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
      *
      *== 2ﾆﾞfﾃc  ibﾜ
      *
     C           @KKROA    IFNE '999'
     C           @NEXT     IFEQ CBNEXT
     C                     MOVE @KKROA    CBKKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
     C           FSW1      IFEQ '*'
      *
      *== c]ﾃ] ibﾜ kdlh uﾇjｰ UPDATE
      *
     C                     SETOF                     85
     C           #KEYFH    CHAINAAKPL411             85
     C           *IN85     IFEQ '0'
     C           FHSKJY    ANDEQ'D'
     C           FHSKHZ    ANDLE*DATE
     C                     SETON                     85
     C                     END
     C           *IN85     IFEQ '0'
     C                     MOVELPARM1     FHKOME
     C                     MOVELUYEAR     FHKOYY
     C                     MOVELUMONTH    FHKOMM
     C                     MOVELUDAY      FHKODD
     C                     MOVEL@TIHH     FHKOHH
     C                     MOVEL@TIMM     FHKOMM
     C           @MKROA    IFNE '999'
     C           @MBMN     ANDEQFHMBMN
     C                     MOVE @MKROA    FHMKRO
     C                     END
     C           @TKROA    IFNE '999'
     C           @MMKR     ANDEQFHMMKR
     C                     MOVE @TKROA    FHTKRO
     C                     END
     C           @KKROA    IFNE '999'
     C           @NEXT     ANDEQFHNEXT
     C                     MOVE @KKROA    FHKKRO
     C                     END
     C                     UPDATAAKPL411
     C                     END
      *== sbﾆﾞﾏ]f ﾎabﾓ UPDATE
     C                     MOVELPARM1     CBKOME
     C                     MOVELUYEAR     CBKOYY
     C                     MOVELUMONTH    CBKOMM
     C                     MOVELUDAY      CBKODD
     C                     MOVEL@TIHH     CBKOHH
     C                     MOVEL@TIMM     CBKOMM
     C                     UPDATAGAPP311
      * CHEK FILE CREATE
     C                     EXCPTFILE
     C                     END
      *
     C                     END
     C                     END
     C  N81                END
      *----------------------------------------------------*
      *sbﾆﾞﾏ]f fhmb WORK FILE UPDATE                       *
      *----------------------------------------------------*
      *
      *  FSW1   ===>  ' '  ﾃcﾆ] mﾞｰj oﾆ
      *               '*'  ﾃcﾆ] mﾞｰj aﾒ
      *
     C                     SETOF                         81
     C           1         SETLLAGAWP311
     C                     DO   *HIVAL
     C                     READ AGAWP311                 81
     C           *IN81     IFEQ '0'
     C                     MOVE *BLANK    FSW1    1
     C                     SETOF                         82
      *
      *== sbﾆﾞﾏ]f ﾎabﾓ ﾑvnﾌﾞﾆ
      *
     C           WBSKJY    IFEQ 'D'
     C           WBSKHZ    ANDLE*DATE
     C                     SETON                         82
     C                     END
      *
     C           *IN82     IFEQ '0'
     C           @MBMN     ANDEQWBMBMN
     C           @MMKR     ANDEQWBMMKR
     C           @NEXT     ANDEQWBNEXT
      *
      *== ud ﾃcmb ibﾜ
      *
     C           @MKROA    IFNE '999'
     C           @MBMN     IFEQ WBMBMN
     C                     MOVE @MKROA    WBMKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
      *== xlg ﾃcmb ibﾜ
      *
     C           @TKROA    IFNE '999'
     C           @MMKR     IFEQ WBMMKR
     C                     MOVE @TKROA    WBTKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
      *
      *== 2ﾆﾞfﾃc  ibﾜ
      *
     C           @KKROA    IFNE '999'
     C           @NEXT     IFEQ WBNEXT
     C                     MOVE @KKROA    WBKKRO
     C                     MOVE '*'       FSW1
     C                     END
     C                     END
      *
     C           FSW1      IFEQ '*'
     C                     MOVELPARM1     WBKOME
     C                     MOVELUYEAR     WBKOYY
     C                     MOVELUMONTH    WBKOMM
     C                     MOVELUDAY      WBKODD
     C                     MOVEL@TIHH     WBKOHH
     C                     MOVEL@TIMM     WBKOMM
     C                     UPDATAGAWP311
     C                     END
      *
     C                     END
     C                     END
     C  N81                END
      *----------------------------------------------------*
      *    ﾎﾟ ﾜ hﾞ [ w  ﾆ ﾏ c ﾒ ﾑ c                        *
      *----------------------------------------------------*
     C                     SETON                       LR
     C                     RETRN
      *----------------------------------------------------*
      *   c]ﾃc ibﾜ uﾇjｰ READ                               *
      *----------------------------------------------------*
     C           $SB100    BEGSR
     C                     SETOF                       89
     C           KEIRO     CHAINAAKPL21              89
     CSR                   ENDSR
     OAGAWP60 E                FILE
     O                         @MBMN      4
     O                         @MKROM     7
     O                         @MKROA    10
     O                         @MMKR     14
     O                         @TKROM    17
     O                         @TKROA    20
     O                         @NEXT     24
     O                         @KKROM    27
     O                         @KKROA    30
     O                         CBSHN1    35
     O                         CBSHN2    40
     O                         CBSHN3    42
     O                         @DATE     64
** MSG
ERR-1運行経路チェックマスターに存在しません。
ERR-2前工程　変更後運行経路を入力して下さい。
ERR-3メッキ工程　変更後運行経路を入力して下さい。
ERR-4２次加工　変更後運行経路を入力して下さい。
ERR-5入力された変更後運行経路の指定があやまりです。
