     H            Y.
     F** AGAR01 ****************************************************
     F*  RETRIEVE PRINTER DEFAULT BY WSID (DEVTYPE IGCDTA)         *
     F*  I-HASADA    97.11.12                                      *
     F* -----------------------------------------------------------*
     F*  CALLING SEQ.
     F*                    CALL 'AGAR01'
     F*                    PARM           PWSID  10
     F*                    PARM           PDEVT   6
     F*                    PARM           PIGCD   4
     F*  IN  PWSID: 10A WSID
     F*  OUT PDEVT:  6A PRINTER DEVICE TYPE (*SCS OR *AFPDS)
     F*      PIGCD:  4A DBCS DATA?          (*YES OR *NO )
     F* -----------------------------------------------------------*
     F*  FIRST 2 CHARACTER OF WSID = WA, WB, WE, WK OR WM --> *AFPDS AND *YES
     F*                            = OTHER THAN ABOVE     --> *SCS   AND *NO
     F*************************************************************
     E                    TB1     1   5  2
      *
     C           *ENTRY    PLIST
     C                     PARM           PWSID  10
     C                     PARM           PDEVT   6
     C                     PARM           PIGCD   4
     C                     MOVELPWSID     WWS     2
      *
     C                     MOVE '*SCS  '  PDEVT
     C                     MOVE '*NO '    PIGCD
      *
     C                     SETOF                     10
     C           WWS       LOKUPTB1                      10
     C           *IN10     IFEQ '1'
     C                     MOVE '*AFPDS'  PDEVT
     C                     MOVE '*YES'    PIGCD
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
** TB1
WA
WB
WE
WK
WM
