     H            Y.
      ** AGAR23 ********************************************
      * LEVELLED PRODUCTION FIXED FILE ACCOUNT BOOK      *
      *              M-OKUDA           86.10.31            *
     F* -------------------------------------------             *
JW1  F* JW       2021.08.12 CHK SKJY = 'D'                      *
      *****************************************************************
     FAGAPW23 CF  E                    WORKSTN
     FAGAPL31 IF  E           K        DISK
     FAGATL32 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FAGAPR23 O   E             21     PRINTER                        UC
      *****************************************************************
     E                    TYT     1   1 28               jbnﾓ
     E                    MSG     1   3 60               d[ｰ xｮﾈｰﾆﾞ
     E                    KOB     1  10  4 0             購買以外
     E                    KNI     1   4  4 0             可児工場
      *****************************************************************
     I            DS
     I                                        1   40CBSTYY
     I                                        3   40CBSTY2
      *****************************************************************
      *                      START PROGRAM  <AGAR22>       *
      *****************************************************************
     C                     MOVE *BLANK    TYTLE  28
     C                     MOVELTYT,1     TYTLE
     C                     MOVEA'000'     *IN,01
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD*ZERO     WMBMN   40
      *
     C           STP1      TAG
     C                     EXFMTAGAPW231
      *
     C   KA                SETON                     LR
     C   KA                RETRN
      *
     C                     MOVEA'00'      *IN,01
     C                     MOVEA'0'       *IN,99
      ******************************************************
      * M-NO               CMD-7 mﾞ ﾎﾞy]xb ﾉ ﾆｭcfb         *
      ******************************************************
     C           *INKG     IFEQ '1'
     C                     CALL 'GGBR19'
     C                     GOTO STP1
     C                     END
      *
     C           SEL       IFNE '1'
     C           SEL       ANDNE'2'
     C           SEL       ANDNE'3'
     C           SEL       ANDNE'4'
     C                     MOVELMSG,1     ERRMSG 60
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C           SEL       IFNE '1'
      *
     C           BMON      IFLE *BLANK
     C                     MOVELMSG,2     ERRMSG
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     ELSE
      *
     C           BMON      IFGT *BLANK
     C                     MOVELMSG,3     ERRMSG
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     END
      *
     C                     MOVE BMON      BMON4   40
     C                     OPEN AGAPR23
     C                     WRITEAGAPR231
      ******************************************************
      * M-NO               平準化確定ファイルの読込み    *
      ******************************************************
     C           STEP11    TAG
      *
     C           SEL       IFEQ '2'
     C                     READ AGATL32                  90
     C                     ELSE
     C                     READ AGAPL31                  90
     C                     END
      *
     C           *IN,90    CABEQ'1'       END
     C           CBSKJY    CABEQ'D'       STEP11
      *
     C           SEL       IFEQ '2'
      *
     C           BMON4     IFEQ 8907
     C                     SETOF                     30
     C           CBMBMN    LOKUPKOB                      30
      *
     C           *IN30     IFEQ '1'
     C                     GOTO STEP11
     C                     END
      *
     C                     EXSR SUB
     C                     ELSE
      *
     C           BMON4     IFEQ 9099
     C                     SETOF                     30
     C           CBMBMN    LOKUPKNI                      30
      *
     C           *IN30     IFEQ '0'
     C                     GOTO STEP11
     C                     END
      *
     C                     EXSR SUB
     C                     ELSE
      *
     C           BMON4     IFEQ 8990
      *
     C           CBMBMN    IFNE 8990
     C           CBMBMN    ANDNE8958
     C                     GOTO STEP11
     C                     END
      *
     C                     ELSE
      *
     C           BMON4     CABNECBMBMN    STEP11
      *
     C                     END
     C                     END
     C                     END
      *
     C           CBMBMN    IFNE WMBMN
     C                     Z-ADDCBMBMN    WMBMN
     C                     MOVEL*BLANK    MEMEI  16
     C           CBMBMN    CHAINFGBPL011             10
      *
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    MEMEI
     C                     END
      *
     C                     END
     C                     ELSE
      *
     C           SEL       IFEQ '3'
     C           BMON4     CABNECBMMKR    STEP11
      *
     C           *IN12     IFEQ '0'
     C                     SETON                     12
     C                     MOVEL*BLANK    MKMEI  16
     C           BMON4     CHAINFGBPL011             10
      *
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    MKMEI
     C                     END
      *
     C                     END
     C                     ELSE
      *
     C           SEL       IFEQ '4'
     C           BMON4     CABNECBNEXT    STEP11
      *
     C           *IN13     IFEQ '0'
     C                     SETON                     13
     C                     MOVEL*BLANK    KAMEI  16
     C           BMON4     CHAINFGBPL011             10
      *
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    KAMEI
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C                     END
      ******************************************************
      * M-NO               印刷条件合致データの処理　    *
      ******************************************************
     C                     MOVE *BLANK    KNMEI  20
     C           CBKDAI    CHAINGCMPL311             10
      *
     C           *IN10     IFEQ '0'
     C                     MOVELT3NAMN    KNMEI
     C                     END
      *
     C           SEL       IFNE '2'
     C                     MOVEL*BLANK    MEMEI
     C           CBMBMN    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    MEMEI
     C                     END
     C                     END
      *
     C           SEL       IFNE '3'
     C                     MOVEL*BLANK    MKMEI
     C           CBMMKR    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    MKMEI
     C                     END
     C                     END
      *
     C           SEL       IFNE '4'
     C                     MOVEL*BLANK    KAMEI
     C           CBNEXT    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
JW1  C           B2SKJY    ANDNE'D'
     C                     MOVELB2SMEI    KAMEI
     C                     END
     C                     END
      ******************************************************
      * M-NO               印刷出力　　　　　　　　　    *
      ******************************************************
     C           SEQNO     ADD  1         SEQNO   40
     C                     WRITEAGAPR232
     C   21                WRITEAGAPR231
     C                     SETOF                     21
     C                     GOTO STEP11
      *
     C           END       TAG
     C                     CLOSEAGAPR23
     C                     SETON                     LR
      ******************************************************
      * SUB                出力制御　　　　　　　　　    *
      ******************************************************
     C           SUB       BEGSR
      *
     C           *IN31     IFEQ '0'
     C                     Z-ADDCBMBMN    KMBMN   40
     C                     SETON                     31
     C                     END
      *
     C           CBMBMN    IFNE KMBMN
     C                     WRITEAGAPR231
     C                     SETOF                     11
     C                     Z-ADD0         SEQNO
     C                     Z-ADDCBMBMN    KMBMN
     C                     END
      *
     C                     ENDSR
      *
**  TYT (TITLE )
LVL PROD FIX ODR F ACNT BOOK
**  MSG (ERROR MESSAGE )
E-01 LIST CREATE SELECT NO. ISN'T INPUT JUSTLY
E-02 SELECT NO. IS NOT 1 THOUGH  DEPARTMNET ISN'T APPOINTED
E-03 SELECT NO. IS  1 THOUGH DEPARTMENT IS APPOINTED
**  BESIDES PURCHASE
0111
8974
8982
9032
9040
9245
9253
8990
9024
9431
**  KANI FACTORY
9032
9040
9245
9253
