     H            Y.
     F** AGAR46 *******************************************************
     F* A-PICS PRODUCTION INSTRUCTION ADD-DATA LIST * *
     F*つるべ平準化マスター            2020.07.13                    UMBER *
     F*****************************************************************
     FAGAWP46BIP  F     100            DISK
     FRGAPL11 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    M       1   1 51               vjﾞﾆxb
     IAGAWP46BAA  01
     I                                        1   40IISTYY
     I                                        5   60IISTMM
     I                                        7   80IISTDD
     I                                        9  120IITOKU
     I                                       13  160IINONY
     I                                       17  17 IINKOJ
     I                                       18  21 IINUKE
     I                                       22  26 IIMHN1
     I                                       27  31 IIMHN2
     I                                       32  36 IIMHN3
     I                                       37  41 IISHN1L1
     I                                       42  46 IISHN2L1
     I                                       47  48 IISHN3L1
     I                                       49  570IISRYO
     I                                       58  610IIMEYY
     I                                       62  630IIMEMM
     I                                       64  650IIMEDD
     I                                       66  690IITEYY
     I                                       70  710IITEMM
     I                                       72  730IITEDD
     I            DS
     I                                        1   80IITHHZ
     I                                        3   80IITHH6
     I                                        1   40IISTYY
     I                                        5   60IISTMM
     I                                        7   80IISTDD
     I            DS
     I                                        1   80IITEHZ
     I                                        3   80IITEH6
     I                                        1   40IITEYY
     I                                        5   60IITEMM
     I                                        7   80IITEDD
     I            DS
     I                                        1   80IIMEHZ
     I                                        3   80IIMEH6
     I                                        1   40IIMEYY
     I                                        5   60IIMEMM
     I                                        7   80IIMEDD
     C*
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C*
     C           PUSER     CHAINRGAPL11              20
     C           *IN20     IFEQ '0'
     C                     MOVELJ8NAME    @NAME   9
     C                     END
     C*
     C                     SETOF                     02
     C           *IN80     IFEQ '0'
     C                     TIME           WTIME   60
     C                     SETON                     8002
     C                     END
     C*
     C                     SETOF                     30
     C   OF                SETON                     30
     C   L1                SETON                     30
     C*
     OQPRINT  H  102   02
     O       OR        OF
     O                                  131 '.....................'
     O        H  1     02
     O       OR        OF
     O                                  131 '.GOVERNOR .IN CHARGE.'
     O        H  1     02
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  111 '.'
     O                                  121 '.'
     O                         @NAME    130
     O                                  131 '.'
     O        H  2     02
     O       OR        OF
     O                                   12 'PGM-AGAR46'
     O                         M         82
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O*       H  1     02
     O*      OR        OF
     O        H  2     02
     O       OR        OF
     O                                   16 'INTRAL CO P/N'
     O                                   28 'START DATE'
     O                                   37 'CUSTOMER'
     O                                   46 'RCV CO.'
     O                                   55 'FACTORY'
     O                                   60 'RCV'
     O                                   77 'USER PART NO'
     O                                   93 'PROE ODR DATE'
     O                                  103 'DELV DATE'
     O                                  116 'DELIVERY NBR'
     O        T  1     L1
     O                                    1 ' '
     O        D  1     01
     O                 30      IISHN1     8
     O                 30                 9 '-'
     O                 30      IISHN2    14
     O                 30                15 '-'
     O                 30      IISHN3    17
     O                         IITHH6Y   28
     O                         IITOKU    35
     O                         IINONY    44
     O                         IINKOJ    51
     O                         IINUKE    59
     O                         IIMHN1    68
     O                                   69 '-'
     O                         IIMHN2    74
     O                                   75 '-'
     O                         IIMHN3    80
     O                         IITEH6Y   91
     O                         IIMEH6Y  102
     O                         IISRYOJ  116
** M
* A-PICS PRODUCT INSTRUCTION ADDING DATA LIST *
