     H            Y.
     F** AGAR45 *******************************************************
     F*つるべ生産指示 UPDATE OF LEVELLED PRODUCTION FIXED ORDERING FILE *
     F*  2020.07.24
     F*****************************************************************
     FAGAPW45 CF  E                    WORKSTN
     F                                              KNUM        1
     F                                              KINFDS FEEDBK
     FAGAPL41 UF  E           K        DISK                      A
     FAAIPL11 IF  E           K        DISK
     FACAPL11 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAAFTL01 IF  E           K        DISK
     FAAGTL01 IF  E           K        DISK
     FAGLPP11 O   E                    DISK                      A
     E                    CBTR       24  2 0             m]c ﾆmbﾍﾞ]
     E                    CD      1  20  1   ME     20   f]ﾌﾞ]jﾞbxbﾆｭc
     E                    TBL1    1   8  1 0 TBL2    4   ﾆmbﾍﾞ].ﾍｭcﾆg
     E                    MSG     1  27 60               d[ｰxｮﾈｰﾆﾞ
     E                    CBHK       24  3 0             ﾌｮkｬc ﾌﾃﾇc (N)
     E                    CBHN       24  3 0             ﾌｮkｬc ﾌﾃﾇc (N+1)
     E                    ABHK       24  3 0             ﾌｮkｬc ﾌﾃﾇc (N)
     E                    ABHN       24  3 0             ﾌｮkｬc ﾌﾃﾇc (N+1)
     I            DS
     I                                        1  72 CBHK
     I                                        1   30CBHK01
     I                                        4   60CBHK02
     I                                        7   90CBHK03
     I                                       10  120CBHK04
     I                                       13  150CBHK05
     I                                       16  180CBHK06
     I                                       19  210CBHK07
     I                                       22  240CBHK08
     I                                       25  270CBHK09
     I                                       28  300CBHK10
     I                                       31  330CBHK11
     I                                       34  360CBHK12
     I                                       37  390CBHK13
     I                                       40  420CBHK14
     I                                       43  450CBHK15
     I                                       46  480CBHK16
     I                                       49  510CBHK17
     I                                       52  540CBHK18
     I                                       55  570CBHK19
     I                                       58  600CBHK20
     I                                       61  630CBHK21
     I                                       64  660CBHK22
     I                                       67  690CBHK23
     I                                       70  720CBHK24
     I            DS
     I                                        1  72 CBHN
     I                                        1   30CBHN01
     I                                        4   60CBHN02
     I                                        7   90CBHN03
     I                                       10  120CBHN04
     I                                       13  150CBHN05
     I                                       16  180CBHN06
     I                                       19  210CBHN07
     I                                       22  240CBHN08
     I                                       25  270CBHN09
     I                                       28  300CBHN10
     I                                       31  330CBHN11
     I                                       34  360CBHN12
     I                                       37  390CBHN13
     I                                       40  420CBHN14
     I                                       43  450CBHN15
     I                                       46  480CBHN16
     I                                       49  510CBHN17
     I                                       52  540CBHN18
     I                                       55  570CBHN19
     I                                       58  600CBHN20
     I                                       61  630CBHN21
     I                                       64  660CBHN22
     I                                       67  690CBHN23
     I                                       70  720CBHN24
     I            DS
     I            DS
     I                                        1   60TIME
     I                                        1   20AA
     I                                        3   40BB
     I            DS
     I                                        1   80SYHIZK
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80CDSTHZ
     I                                        1   40CDSTYY
     I                                        5   60CDSTMM
     I                                        7   80CDSTDD
     I            DS
     I                                        1   80CDENHZ
     I                                        1   40CDENYY
     I                                        5   60CDENMM
     I                                        7   80CDENDD
     I            DS
     I                                        1   80I1SKHZ
     I                                        1   40I1SKYY
     I                                        5   60I1SKMM
     I                                        7   80I1SKDD
     I            DS
     I                                        1  480CBTR
     I                                        1   20CBTR01
     I                                        3   40CBTR02
     I                                        5   60CBTR03
     I                                        7   80CBTR04
     I                                        9  100CBTR05
     I                                       11  120CBTR06
     I                                       13  140CBTR07
     I                                       15  160CBTR08
     I                                       17  180CBTR09
     I                                       19  200CBTR10
     I                                       21  220CBTR11
     I                                       23  240CBTR12
     I                                       25  260CBTR13
     I                                       27  280CBTR14
     I                                       29  300CBTR15
     I                                       31  320CBTR16
     I                                       33  340CBTR17
     I                                       35  360CBTR18
     I                                       37  380CBTR19
     I                                       39  400CBTR20
     I                                       41  420CBTR21
     I                                       43  440CBTR22
     I                                       45  460CBTR23
     I                                       47  480CBTR24
     IFEEDBK      DS
     I                                     *STATUS  @STTS
      *
     C           KEY1      KLIST
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
      *
     C           KEYM1     KLIST
     C                     KFLD           CBMBMN
     C                     KFLD           CBKDAI
      *
     C           KEYM2     KLIST
     C                     KFLD           CBMBMN
     C                     KFLD           CBKDAI
     C                     KFLD           CBSHN1
     C                     KFLD           CBSHN2
     C                     KFLD           CBSHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     TIME           TIME
      *
     C                     Z-ADD0         CBTR
      *
     C           STP0      TAG
     C                     MOVEA'0000'    *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVEL*BLANK    KBN
     C                     MOVEL*BLANK    CBSHN1
     C                     MOVEL*BLANK    CBSHN2
     C                     MOVEL*BLANK    CBSHN3
     C                     MOVEL*BLANK    ERRMSG
      *
     C           STP1      TAG
     C                     WRITEAGAPW451
     C                     READ AGAPW45                999999TIME eｰﾌﾞｰ
      *
     C                     MOVEA'0000'    *IN,01
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     MOVE *BLANK    KBNNM
     C           KBN       IFEQ *BLANK
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C           KBN       IFNE '0'
     C           KBN       ANDNE'1'
     C           KBN       ANDNE'2'
     C                     MOVELMSG,2     ERRMSG
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     MOVEA'0'       *IN,20
     C           KBN       IFEQ '0'
     C                     MOVEL'CANCEL'  KBNNM
     C                     MOVEA'1'       *IN,20
     C                     END
     C           KBN       IFEQ '1'
     C                     MOVEL'CHANGE'  KBNNM
     C                     END
     C           KBN       IFEQ '2'
     C                     MOVEL'ADD   '  KBNNM
     C                     END
      *
     C           CBSHN1    IFEQ *BLANK
     C           CBSHN2    ANDEQ*BLANK
     C           CBSHN3    ANDEQ*BLANK
     C                     MOVELMSG,3     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C******************************************************
     C* M-NO               ﾎﾞﾍ]uﾇjｰ ﾉ kｩｮh                 *
     C******************************************************
     C           KBN       IFEQ '2'
     C                     SETOF                     05
     C           KEY1      CHAINFCEPL011             05
     C           *IN05     IFEQ '1'
     C                     Z-ADD0         CBMAXH
     C                     MOVE *BLANK    CBZENO
%0001C                     MOVE *ALL'0'   CBLOTN
     C                     Z-ADD0         CBSYUY
     C                     MOVELMSG,7     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     ELSE
      *
     C           KBN       IFNE '0'
     C           A2GSKD    IFEQ 'D'
     C                     MOVELMSG,8     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C           A2TEHI    IFNE 'G'
     C                     MOVELMSG,9     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C                     END
     C                     MOVE A2ZETI    CBZENO
      *
     C           KBN       IFEQ '2'
%0001C                     MOVE *ALL'0'   CBLOTN
     C                     END
     C           SYHIZK    IFLE *DATE
     C                     Z-ADDA2SSYS    CBSYUY
     C                     ELSE
     C                     Z-ADDA2KSYS    CBSYUY
     C                     END
     C           A2GEKN    DIV  20        W7      70
     C           W7        DIV  CBSYUY    CBMAXH
     C                     END
     C                     END
      *
     C                     MOVEA'0'       *IN,44
     C           KEY1      CHAINAGAPL411             10
     C           KBN       IFEQ '2'
     C           *IN,10    IFEQ '0'
     C                     MOVEA'1'       *IN,44
     C           CBSKJY    IFEQ *BLANK
     C                     MOVELMSG,5     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
      *
     C           KBN       IFNE '2'
     C           *IN,10    IFEQ '1'
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C           CBSKJY    IFEQ 'D'
     C                     MOVELMSG,4     ERRMSG
     C                     MOVEA'111'     *IN,02
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C                     Z-ADD1         M       20
     C           CBKDAI    LOKUPCD,M                     11
     C           *IN11     IFEQ '1'
     C                     MOVE ME,M      T3NAMK 20
     C                     ELSE
     C                     MOVE *BLANK    T3NAMK
     C                     END
      *
     C                     MOVEL*BLANK    MEMEI
     C           CBMBMN    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    MEMEI
     C                     END
      *
     C                     MOVEL*BLANK    MKMEI
     C           CBMMKR    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    MKMEI
     C                     END
      *
     C                     MOVEL*BLANK    KAMEI
     C           CBNEXT    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    KAMEI
     C                     END
      *
     C                     CLEARABHK
     C                     CLEARABHN
      *
     C           KBN       IFEQ '2'
     C                     MOVE *BLANK    CBKDAI
     C                     MOVE *BLANK    T3NAMK
     C                     Z-ADD0         CBMBMN
     C                     MOVE *BLANK    CBKTYP
     C                     MOVE *BLANK    MEMEI
     C                     Z-ADD0         CBMMKR
     C                     MOVE *BLANK    CBMTYP
     C                     MOVE *BLANK    MKMEI
     C                     Z-ADD0         CBNEXT
     C                     MOVE *BLANK    CBTYPE
     C                     MOVE *BLANK    KAMEI
     C                     Z-ADD0         CBMSA1
     C                     Z-ADD0         CBMSA2
     C                     Z-ADD0         CBMSA3
     C                     Z-ADD0         CBTSA1
     C                     Z-ADD0         CBTSA2
     C                     Z-ADD0         CBTSA3
     C                     Z-ADD0         CBKSA1
     C                     Z-ADD0         CBKSA2
     C                     Z-ADD0         CBKSA3
     C                     MOVE *BLANK    CBMTYP
     C                     MOVE *BLANK    CBTYPE
     C                     MOVE *BLANK    CBMLIN
     C                     Z-ADD0         CBBARL
     C                     Z-ADD0         CBHASU
     C                     Z-ADD0         TANSU2
     C                     Z-ADD0         CBHK01
     C                     Z-ADD0         CBHK02
     C                     Z-ADD0         CBHK03
     C                     Z-ADD0         CBHK04
     C                     Z-ADD0         CBHK05
     C                     Z-ADD0         CBHK06
     C                     Z-ADD0         CBHK07
     C                     Z-ADD0         CBHK08
     C                     Z-ADD0         CBHK09
     C                     Z-ADD0         CBHK10
     C                     Z-ADD0         CBHK11
     C                     Z-ADD0         CBHK12
     C                     Z-ADD0         CBHK13
     C                     Z-ADD0         CBHK14
     C                     Z-ADD0         CBHK15
     C                     Z-ADD0         CBHK16
     C                     Z-ADD0         CBHK17
     C                     Z-ADD0         CBHK18
     C                     Z-ADD0         CBHK19
     C                     Z-ADD0         CBHK20
     C                     Z-ADD0         CBHK21
     C                     Z-ADD0         CBHK22
     C                     Z-ADD0         CBHK23
     C                     Z-ADD0         CBHK24
     C                     Z-ADD0         CBBI01
     C                     Z-ADD0         CBBI02
     C                     Z-ADD0         CBBI03
     C                     Z-ADD0         CBBI04
     C                     Z-ADD0         CBBI05
     C                     Z-ADD0         CBBI06
     C                     Z-ADD0         CBBI07
     C                     Z-ADD0         CBBI08
     C                     Z-ADD0         CBBI09
     C                     Z-ADD0         CBBI10
     C                     Z-ADD0         CBBI11
     C                     Z-ADD0         CBBI12
     C                     Z-ADD0         CBBI13
     C                     Z-ADD0         CBBI14
     C                     Z-ADD0         CBBI15
     C                     Z-ADD0         CBBI16
     C                     Z-ADD0         CBBI17
     C                     Z-ADD0         CBBI18
     C                     Z-ADD0         CBBI19
     C                     Z-ADD0         CBBI20
     C                     Z-ADD0         CBBI21
     C                     Z-ADD0         CBBI22
     C                     Z-ADD0         CBBI23
     C                     Z-ADD0         CBBI24
     C                     Z-ADD0         CBHN01
     C                     Z-ADD0         CBHN02
     C                     Z-ADD0         CBHN03
     C                     Z-ADD0         CBHN04
     C                     Z-ADD0         CBHN05
     C                     Z-ADD0         CBHN06
     C                     Z-ADD0         CBHN07
     C                     Z-ADD0         CBHN08
     C                     Z-ADD0         CBHN09
     C                     Z-ADD0         CBHN10
     C                     Z-ADD0         CBHN11
     C                     Z-ADD0         CBHN12
     C                     Z-ADD0         CBHN13
     C                     Z-ADD0         CBHN14
     C                     Z-ADD0         CBHN15
     C                     Z-ADD0         CBHN16
     C                     Z-ADD0         CBHN17
     C                     Z-ADD0         CBHN18
     C                     Z-ADD0         CBHN19
     C                     Z-ADD0         CBHN20
     C                     Z-ADD0         CBHN21
     C                     Z-ADD0         CBHN22
     C                     Z-ADD0         CBHN23
     C                     Z-ADD0         CBHN24
     C                     Z-ADD0         CBBN01
     C                     Z-ADD0         CBBN02
     C                     Z-ADD0         CBBN03
     C                     Z-ADD0         CBBN04
     C                     Z-ADD0         CBBN05
     C                     Z-ADD0         CBBN06
     C                     Z-ADD0         CBBN07
     C                     Z-ADD0         CBBN08
     C                     Z-ADD0         CBBN09
     C                     Z-ADD0         CBBN10
     C                     Z-ADD0         CBBN11
     C                     Z-ADD0         CBBN12
     C                     Z-ADD0         CBBN13
     C                     Z-ADD0         CBBN14
     C                     Z-ADD0         CBBN15
     C                     Z-ADD0         CBBN16
     C                     Z-ADD0         CBBN17
     C                     Z-ADD0         CBBN18
     C                     Z-ADD0         CBBN19
     C                     Z-ADD0         CBBN20
     C                     Z-ADD0         CBBN21
     C                     Z-ADD0         CBBN22
     C                     Z-ADD0         CBBN23
     C                     Z-ADD0         CBBN24
     C                     END
      *
     C                     Z-ADDCBHK      ABHK
     C                     Z-ADDCBHN      ABHN
     C*  PROTECT INDICATOR SET
     C*
     C                     MOVEA'00000'   *IN,31
     C                     MOVEA'00000'   *IN,36
     C                     MOVEA'00000'   *IN,41
     C                     MOVEA'00000'   *IN,46
     C                     MOVEA'00000'   *IN,51
     C                     MOVEA'00000'   *IN,56
     C                     MOVEA'00000'   *IN,61
     C                     MOVEA'00000'   *IN,66
     C                     SETOF                     798089
     C                     SETOF                     909192
     C                     SETOF                     939495
     C                     SETOF                     969798
     C                     SETOF                     060708
     C                     SETOF                     09
      *
     C*  ﾆﾞﾃhsﾞl ibﾅ]ﾍﾞ] uﾇjｰ READ
     C*
     C                     Z-ADD0         WBMON   40
     C                     MOVE *BLANK    WKCD1   1
     C                     MOVE *BLANK    WSW1    1
      *
     C           CBKDAI    IFEQ '0'
     C           CBMBMN    OREQ 8907
     C                     Z-ADD8907      WBMON
     C                     ELSE
      *
     C           KEYM1     SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     26
     C           KEYM1     READEACAPL111                 26
     C           *IN26     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     26
     C                     MOVE '*'       WSW1
     C                     Z-ADDI1BMON    WBMON
     C                     MOVE I1KCD1    WKCD1
      *
     C                     END
     C                     END
     C  N26                END
      *
     C           WSW1      IFEQ *BLANK
     C                     Z-ADD8990      WBMON
     C                     ELSE
      *
     C                     SETOF                     28
     C           KEYM2     CHAINACAPL111             28
     C           *IN28     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     28
     C                     END
     C           *IN28     IFEQ '0'
     C                     Z-ADDI1BMON    WBMON
     C                     ELSE
      *
     C           WBMON     IFEQ 8907
     C           WKCD1     IFNE '0'
     C                     Z-ADD8990      WBMON
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           WBMON     CHAINAAIPL111             10
     C           *IN,10    IFEQ '1'
     C                     Z-ADD0         CDCIHI
     C                     Z-ADD0         CDCIBI
     C                     Z-ADD0         CDCIKN
     C                     Z-ADD0         CDZNHZ
     C                     Z-ADD0         CDTOHZ
     C                     Z-ADD0         CDYOHZ
     C                     Z-ADD0         CDSTHZ
     C                     Z-ADD0         CDENHZ
     C                     END
      *
     C           WBMON     IFNE 8907
     C                     MOVE *BLANK    WHCK    1
     C                     MOVEA'11111111'*IN,31
     C                     MOVEA'11111111'*IN,39
     C                     MOVEA'11111111'*IN,51
     C                     MOVEA'11111111'*IN,59
      *
     C                     Z-ADD30        IX1     20       TODAY
     C                     Z-ADD50        IX2     20       NEXT DAY
     C                     Z-ADD1         X       20
     C           1         DO   24        X
     C           CBTR,X    IFNE 0
     C                     MOVE '*'       WHCK
     C                     Z-ADDCBTR,X    @BIN    10
      *
     C           CBTR,X    ADD  IX1       @1      20
     C           CBTR,X    ADD  IX2       @2      20
     C                     MOVEA'0'       *IN,@1
     C                     MOVEA'0'       *IN,@2
     C                     END
     C                     ENDDO
      *
     C           WHCK      IFEQ *BLANK
     C                     MOVEA'00000000'*IN,31
     C                     MOVEA'00000000'*IN,39
     C                     MOVEA'00000000'*IN,51
     C                     MOVEA'00000000'*IN,59
     C                     END
     C                     END
      *
     C           WBMON     IFEQ 8907
     C                     MOVEA'1111'    *IN,31
     C                     MOVEA'1111'    *IN,51
     C                     Z-ADD1         X       20
     C           1         DO   24        X
     C           CBTR,X    IFNE 0
     C                     Z-ADDCBTR,X    @BIN    10
      *
     C                     SETOF                     30
     C                     Z-ADD1         Y       20
     C           @BIN      LOKUPTBL1,Y                   30
     C           *IN30     IFEQ '1'
     C                     MOVELTBL2,Y    @1      20
     C                     MOVE TBL2,Y    @2      20
     C                     MOVEA'0'       *IN,@1
     C                     MOVEA'0'       *IN,@2
     C                     END
     C                     END
     C                     END
      *
     C                     MOVEA'11111'   *IN,35
     C                     MOVEA'11111'   *IN,40
     C                     MOVEA'11'      *IN,45
     C                     SETON                     798089
     C                     SETON                     909192
     C                     SETON                     9394
     C                     MOVEA'11111'   *IN,55
     C                     MOVEA'11111'   *IN,60
     C                     MOVEA'11'      *IN,65
     C                     SETON                     959697
     C                     SETON                     980607
     C                     SETON                     0809
     C                     ELSE
      *
     C*  ﾍgnﾒ CYCLE / 2
     C           CDCIBI    DIV  2         CYC     20
     C                     MVR            @@@     20
     C           @@@       IFNE 0
     C                     ADD  1         CYC
     C                     END
      *
     C*  1. zg] fbﾆﾍﾞ = ﾑhﾆﾞl
     C           CDSTHZ    IFEQ CDYOHZ
     C                     DO   CYC       I       50
     C           I         ADD  50        J       50
     C                     MOVEA'1'       *IN,J
     C                     END
     C                     END
      *
     C*  2. zg] ﾆｬcﾒｭcﾍﾞ = ﾑhﾆﾞl
     C           CDENHZ    IFEQ CDYOHZ
     C                     DO   CYC       I
     C           I         ADD  50        J
     C                     ADD  CYC       J
     C                     MOVEA'1'       *IN,J
     C                     END
     C                     END
      *
     C*  3. zg] fbﾆﾍﾞ = ncﾆﾞl
     C           CDSTHZ    IFEQ CDTOHZ
     C                     DO   CYC       I
     C           I         ADD  30        J
     C                     MOVEA'1'       *IN,J
     C                     END
     C                     END
      *
     C*  4. zg] ﾆｬcﾒｭcﾍﾞ = ncﾆﾞl
     C           CDENHZ    IFEQ CDTOHZ
     C                     DO   CYC       I
     C           I         ADD  30        J
     C                     ADD  CYC       J
     C                     MOVEA'1'       *IN,J
     C                     END
     C                     END
      *
     C*  ﾍgnﾒ CYCLE bﾃc ﾌ
     C*       ncﾆﾞl & ﾑhﾆﾞl nyp PROTECT
     C           CDCIBI    ADD  1         CYC01   20
     C           CYC01     DO   24        I
     C           I         IFLE 16
     C           I         ADD  30        J
     C                     MOVEA'1'       *IN,J
     C           I         ADD  50        J
     C                     MOVEA'1'       *IN,J
     C                     ELSE
     C                     SELEC
     C           I         WHEQ 17
     C                     SETON                     7995
     C           I         WHEQ 18
     C                     SETON                     8096
     C           I         WHEQ 19
     C                     SETON                     8997
     C           I         WHEQ 20
     C                     SETON                     9098
     C           I         WHEQ 21
     C                     SETON                     9106
     C           I         WHEQ 22
     C                     SETON                     9207
     C           I         WHEQ 23
     C                     SETON                     9308
     C           I         WHEQ 24
     C                     SETON                     9409
     C                     ENDSL
     C                     ENDIF
     C                     END
      *
     C                     END
      *
     C                     Z-ADDCBHASU    TANSU3  70
      *
     C           STP2      TAG
     C                     WRITEAGAPW452
     C                     READ AGAPW45                999999TIME eｰﾌﾞｰ
      *
     C                     SETOF                     212223
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     MOVEA'00000'   *IN,71
     C                     MOVEA'000'     *IN,76
     C                     MOVEA'00000'   *IN,81
     C                     MOVEA'000'     *IN,86
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     END
      *
     C           *IN99     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           CBHASU    IFNE TANSU3
     C           TANSU2    IFNE TANSU3
     C                     Z-ADDCBHASU    TANSU2
     C                     END
     C                     END
      *
     C           KBN       IFNE '0'
     C           CBKDAI    IFEQ *BLANK
     C                     SETON                     2199
     C                     MOVE MSG,10    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C                     Z-ADD1         M       20
     C           CBKDAI    LOKUPCD,M                     11
     C           *IN11     IFEQ '1'
     C                     MOVE ME,M      T3NAMK 20
     C                     ELSE
     C                     MOVE *BLANK    T3NAMK
      *
     C           KBN       IFNE '0'
     C                     SETON                     2199
     C                     MOVE MSG,23    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBMBMN    IFGT 0
     C           CBKTYP    IFEQ *BLANK
     C                     SETON                     2299
     C                     MOVE MSG,11    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBKTYP    IFNE *BLANK
     C                     SETON                     2299
     C                     MOVE MSG,12    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C                     MOVEL*BLANK    MEMEI
     C           CBMBMN    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    MEMEI
     C                     END
      *
     C           CBMMKR    IFGT 0
     C           CBMTYP    IFEQ *BLANK
     C                     SETON                     2399
     C                     MOVE MSG,13    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBMTYP    IFNE *BLANK
     C                     SETON                     2399
     C                     MOVE MSG,14    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C                     MOVEL*BLANK    MKMEI
     C           CBMMKR    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    MKMEI
     C                     END
      *
     C           CBNEXT    IFGT 0
     C           CBTYPE    IFEQ *BLANK
     C                     SETON                     2499
     C                     MOVE MSG,15    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBTYPE    IFNE *BLANK
     C                     SETON                     2499
     C                     MOVE MSG,16    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C                     MOVEL*BLANK    KAMEI
     C           CBNEXT    CHAINFGBPL011             10
     C           *IN,10    IFEQ '0'
     C                     MOVELB2SMEI    KAMEI
     C                     END
      *
     C           CBMSA1    IFGT 0
     C           CBMSA2    IFLE 0
     C                     SETON                     2599
     C                     MOVE MSG,17    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBMSA3    IFLE 0
     C                     SETON                     2599
     C                     MOVE MSG,17    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBMSA2    IFGT 0
     C                     SETON                     2599
     C                     MOVE MSG,17    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBMSA3    IFGT 0
     C                     SETON                     2599
     C                     MOVE MSG,17    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBTSA1    IFGT 0
     C           CBTSA2    IFLE 0
     C                     SETON                     2699
     C                     MOVE MSG,18    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBTSA3    IFLE 0
     C                     SETON                     2699
     C                     MOVE MSG,18    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBTSA2    IFGT 0
     C                     SETON                     2699
     C                     MOVE MSG,18    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBTSA3    IFGT 0
     C                     SETON                     2699
     C                     MOVE MSG,18    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBKSA1    IFGT 0
     C           CBKSA2    IFLE 0
     C                     SETON                     2799
     C                     MOVE MSG,19    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBKSA3    IFLE 0
     C                     SETON                     2799
     C                     MOVE MSG,19    EMG    60
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           CBKSA2    IFGT 0
     C                     SETON                     2799
     C                     MOVE MSG,19    EMG    60
     C                     GOTO STP2
     C                     END
      *
     C           CBKSA3    IFGT 0
     C                     SETON                     2799
     C                     MOVE MSG,19    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBMBMN    IFLE 0
     C           CBKSA1    IFGT 0
     C                     SETON                     2599
     C                     MOVE MSG,20    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBMMKR    IFLE 0
     C           CBTSA1    IFGT 0
     C                     SETON                     2699
     C                     MOVE MSG,21    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           CBNEXT    IFLE 0
     C           CBKSA1    IFGT 0
     C                     SETON                     2799
     C                     MOVE MSG,22    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C*          CBMLIN    IFEQ *BLANK
     C*                    SETON                     2899
     C*                    MOVE MSG,24    EMG    60
     C*                    GOTO STP2
     C*                    END
      *
     C           CBBARL    IFEQ 0
     C                     SETON                     2999
     C                     MOVE MSG,25    EMG    60
     C                     GOTO STP2
     C                     END
     C*
     C           CBKDAI    IFEQ 'C'
     C           CBKDAI    OREQ 'D'
     C                     EXSR #CHK1
     C*
      * ﾌﾃﾇc(ncﾆﾞl) kｩｮh   ﾌﾃﾇc = Cﾌﾞﾃﾍﾒl bﾆﾞｭc
     C*
     C                     DO   24        A       20
     C           CBHK,A    IFNE 0
     C           CBHK,A    IFLT @CBKO
     C           A         IFLE 8
     C           A         ADD  70        B       20
     C                     MOVEA'1'       *IN,B
     C                     ENDIF
     C                     MOVEA'1'       *IN,99
     C                     MOVE MSG,26    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
     C                     END
     C*
      * ﾌﾃﾇc(ﾑhﾆﾞl) kｩｮh   ﾌﾃﾇc = Cﾌﾞﾃﾍﾒl bﾆﾞｭc
     C*
     C                     DO   24        C       20
     C           CBHN,C    IFNE 0
     C           CBHN,C    IFLT @CBKO
     C           A         IFLE 8
     C           C         ADD  80        D       20
     C                     MOVEA'1'       *IN,D
     C                     ENDIF
     C                     MOVEA'1'       *IN,99
     C                     MOVE MSG,26    EMG    60
     C                     GOTO STP2
     C                     END
     C                     END
     C                     END
     C*
     C                     END
      *
     C*  ..ﾌｮﾃﾇc (N)..
     C                     Z-ADD1         A
     C           1         DO   24        A
     C           CBHK,A    IFLT 0
     C                     SETON                     99
     C                     MOVE MSG,27    EMG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C*  ..ﾌｮﾃﾇc (N+1)..
     C                     Z-ADD1         A
     C           1         DO   24        A
     C           CBHN,A    IFLT 0
     C                     SETON                     99
     C                     MOVE MSG,27    EMG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP2
     C                     END
      *
     C           KBN       IFEQ '0'
     C                     MOVE 'D'       CBSKJY
     C                     Z-ADD*YEAR     CBSKYY
     C                     Z-ADDUMONTH    CBSKMM
     C                     Z-ADDUDAY      CBSKDD
     C                     Z-ADD*YEAR     CBKOYY
     C                     Z-ADDUMONTH    CBKOMM
     C                     Z-ADDUDAY      CBKODD
     C                     TIME           TIME
     C                     Z-ADDAA        CBKOHH
     C                     Z-ADDBB        CBKOSS
     C                     MOVE PUSER     CBKOME
     C                     UPDATAGAPL411
     C                     END
      *
     C           KBN       IFEQ '2'
     C                     MOVEL*BLANK    CBSKJY
     C                     Z-ADD0         CBSKYY
     C                     Z-ADD0         CBSKMM
     C                     Z-ADD0         CBSKDD
     C                     Z-ADD*YEAR     CBKOYY
     C                     Z-ADDUMONTH    CBKOMM
     C                     Z-ADDUDAY      CBKODD
     C                     TIME           TIME
     C                     Z-ADDAA        CBKOHH
     C                     Z-ADDBB        CBKOSS
     C                     MOVE PUSER     CBKOME
     C  N44                WRITEAGAPL411
     C   44                UPDATAGAPL411
     C                     EXSR #SB361
     C                     END
      *
     C           KBN       IFEQ '1'
     C                     MOVEL*BLANK    CBSKJY
     C                     Z-ADD0         CBSKYY
     C                     Z-ADD0         CBSKMM
     C                     Z-ADD0         CBSKDD
     C                     Z-ADD*YEAR     CBKOYY
     C                     Z-ADDUMONTH    CBKOMM
     C                     Z-ADDUDAY      CBKODD
     C                     TIME           TIME
     C                     Z-ADDAA        CBKOHH
     C                     Z-ADDBB        CBKOSS
     C                     MOVE PUSER     CBKOME
     C                     UPDATAGAPL411
     C                     EXSR #SB362
     C                     END
      *------------------------------------------*
      *箱数変更履歴　新規追加時                *
      *------------------------------------------*
     CSR         #SB361    BEGSR
      *
     C           0111      CHAINAAIPL111             10
      *当日
     C                     Z-ADD1         II      30
     C                     Z-ADDCDTOHZ    WKAPHZ  80
     C           II        DOWLE24
     C           CBHK,II   IFNE 0
     C                     Z-ADDII        WKAPBN  20
     C                     Z-ADD0         WKBHAK  30
     C                     Z-ADDCBHK,II   WKAHAK  30
     C                     EXSR #SB363
     C                     ENDIF
     C                     ADD  1         II
     C                     ENDDO
      *翌日
     C                     Z-ADD1         II      30
     C                     Z-ADDCDYOHZ    WKAPHZ  80
     C           II        DOWLE24
     C           CBHN,II   IFNE 0
     C                     Z-ADDII        WKAPBN  20
     C                     Z-ADD0         WKBHAK  30
     C                     Z-ADDCBHN,II   WKAHAK  30
     C                     EXSR #SB363
     C                     ENDIF
     C                     ADD  1         II
     C                     ENDDO
      *
     CSR         ESB361    ENDSR
      *------------------------------------------*
      *箱数変更履歴　更新時                    *
      *------------------------------------------*
     CSR         #SB362    BEGSR
      *
     C           0111      CHAINAAIPL111             10
      *当日
     C                     Z-ADD1         II      30
     C                     Z-ADDCDTOHZ    WKAPHZ  80
     C           II        DOWLE24
     C           CBHK,II   IFNE ABHK,II
     C                     Z-ADDII        WKAPBN  20
     C                     Z-ADDABHK,II   WKBHAK  30
     C                     Z-ADDCBHK,II   WKAHAK  30
     C                     EXSR #SB363
     C                     ENDIF
     C                     ADD  1         II
     C                     ENDDO
      *翌日
     C                     Z-ADD1         II      30
     C                     Z-ADDCDYOHZ    WKAPHZ  80
     C           II        DOWLE24
     C           CBHN,II   IFNE ABHN,II
     C                     Z-ADDII        WKAPBN  20
     C                     Z-ADDABHN,II   WKBHAK  30
     C                     Z-ADDCBHN,II   WKAHAK  30
     C                     EXSR #SB363
     C                     ENDIF
     C                     ADD  1         II
     C                     ENDDO
      *
     CSR         ESB362    ENDSR
      *------------------------------------------*
      *箱数変更履歴                            *
      *------------------------------------------*
     CSR         #SB363    BEGSR
      *
     C                     CLEARAGLPP111
     C                     Z-ADD*DATE     Y1KOHZ
     C                     TIME           Y1KOTI
     C                     MOVELPUSER     Y1KOME
     C                     MOVELCBSHN1    Y1SHN1
     C                     MOVELCBSHN2    Y1SHN2
     C                     MOVELCBSHN3    Y1SHN3
     C                     Z-ADDWKBHAK    Y1BHAK
     C                     Z-ADDWKAHAK    Y1AHAK
     C                     Z-ADDWKAPHZ    Y1APHZ
     C                     Z-ADDWKAPBN    Y1APBN
     C                     WRITEAGLPP111
      *
     CSR         ESB363    ENDSR
     C*****************************************************************
     C           #CHK1     BEGSR
     C*****************************************************************
     C                     Z-ADD0         @CBKO   20
     C*
     C           CBKDAI    IFEQ 'C'
     C           KEY1      SETLLAAFTL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAAFTL011                 10
     C           *IN10     IFEQ '0'
     C           *DATE     IFGE A3UKHZ
     C           *DATE     ANDLTA3STHZ
     C                     Z-ADDA3CBKO    @CBKO
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
     C                     END
     C*
     C           CBKDAI    IFEQ 'D'
     C           KEY1      SETLLAAGTL011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAAGTL011                 10
     C           *IN10     IFEQ '0'
     C           *DATE     IFGE O4UKHZ
     C           *DATE     ANDLTO4STHZ
     C                     Z-ADDO4CBKO    @CBKO
     C                     SETON                     10
     C                     END
     C                     END
     C  N10                END
     C                     END
     C*
     C                     ENDSR
      *
**   KANBAN NAME
AINTRA-PROC KANBAN
BQUENCHING KANBAN
CPLATING KANBAN
DTUNNEL KANBAN
EPICK-UP KANBAN
FINSTRUCT KANBAN
GS KANBAN
HTUNNEL KANBAN 2
JWASHING KANBAN
KSHOT KANBAN
LNP KANBAN
NWAX KANBAN
MLIMITATION KANBAN
ZHAND MAKING KANBAN
0COMPLET PART KANBAN
1SMALL PROC KANBAN
2S PROC HEAT TREATMNT
3COMPONENTS KANBAN
4FLOW KANBAN
5FLOW HEAT TREATMENT
**  TBL1/TBL2 (APPOINTMENT BIN / MARK)
13151
23252
33353
43454
53555
63656
73757
83858
**       ERROR MESSAGE
E-01 BECAUSE UPDATE INSTRUCTION ISN'T INPUT, INPUT IT
E-02 UPDATE INSTRUCTION IS NOT INPUT 0 ,1,2
E-03 INTRAL COMPANY PART NO ISN'T INPUT , INPUT IT
E-04 APPOINTED CHANGE OR CANCEL,BUT THIS P/N IS CANCELLED
E-05 ADD WAS APPOINTED, BUT THIS PART NO IS INPUT ALREADY
E-06 APPOINTED CHANGE OR CANCEL, BUT THIS P/N ISN'T INPUT
E-07 THIS P/N OF PART M/F ISN'T INPUT SO THAT CAN'T UPDATE
E-08 THIS PART NO IS DELETED IN PART M/F
E-09 PART M/F OF THIS PART NO IS NOT VOLUME PORDUCTION
E-10 LAST KANBAN KIND ISN'T INPUT
E-11 PRECEDING PROC DEPT CODE IS INPUT, BUT LT TYPE IS NOT
E-12 PRECEDING PROC DEPT CODE IS NOR INPUT, BUT LT TYPE IS
E-13 PLATING DEPARTMENT CODE IS INPUT, BUT LT TYPE IS NOT
E-14 PLATING DEPT CODE IS NOT INPUT, BUT LT TYPE IS INPUT
E-15 PROCESSING POINT DEPT CODE IS INPUT, BUT LT TYPE IS NOT
E-16 PROCESSING POINT DEPT CODE IS NOT INPUT, AND LT TYPE IS
E-17 APPOINTMENT OF SHIP CYCLE OF PRE PROC DEPT IS WRONG
E-18 APPOINTMENT OF SHIP CYCLE OF PLATING DEPT IS WRONG
E-19 APPOINTMENT OF SHIP CYCLE OF PROC POINT DEPT IS WRONG
E-20 PRECEDING PROCESS DEPT CODE IS NOT INPUT, AND CYCLE IS
E-21 PLATING DEPARTMENT CODE IS NOT INPUT, AND CYCLE IS
E-22 PROCESSING POINT DEPT CODE IS NOT INPUT, AND CYCLE IS
E-23 KANBAN KIND INPUT  INTO DOESN'T EXIST IN M/F
E-24 PLATING LINE CODE ISN'T INPUT
E-25 PLATING BARREL ISN'T INPUT
E-26 NUMBER OF BOXES IS BIGGER THAN C BOX RATIO.
E-27 NUMBER OF BOXES  IS A MINUS.
