     H            Y.
     F** AGDR04 **********************************
     F* IAF PRODUCTION PLACE OPERATION CALENDAR -LIST CREATE - *
     F*                  S.YAMAGAMI   91.01.07   *
JW1  F* JW    06/19/18 ADD OVERWRITTEN FILE
     F******************************** AGDR04 ****
     FAGDPW04 CF  E                    WORKSTN
JW1  FAGDPL12 IF  E           K        DISK         KINFDS INF1
     FAGDPL22 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     E                    YBI        37  2 0             ﾍlﾞi
     E                    KYU        37 10               ﾍﾓ.ﾑﾓ.gﾏcﾆﾞl
     E                    KIN        37 12               zg]fbﾆ.kｬc.eﾝﾒ
     E                    RIN        37  6               ﾒ]ﾆｬl
     E                    ER      1   3 60                d[ｰxｮﾈｰﾆﾞ
     E                    HZ1     1   7  1 0 HZ2     1 0
     E                    KY1     1   3  1   KY2    10
     E                    KI1     1   3  1   KI2    12
      *
JW1  IINF1        DS
 |   I                                        1  10 PF
 |   I                                       83  84 OV2
 |   I                                       83  92 OVPF
JW1  I                                       93 102 OBLIB
     I            DS
     I                                        1  740YBI
     I                                        1   20YBI01
     I                                        3   40YBI02
     I                                        5   60YBI03
     I                                        7   80YBI04
     I                                        9  100YBI05
     I                                       11  120YBI06
     I                                       13  140YBI07
     I                                       15  160YBI08
     I                                       17  180YBI09
     I                                       19  200YBI10
     I                                       21  220YBI11
     I                                       23  240YBI12
     I                                       25  260YBI13
     I                                       27  280YBI14
     I                                       29  300YBI15
     I                                       31  320YBI16
     I                                       33  340YBI17
     I                                       35  360YBI18
     I                                       37  380YBI19
     I                                       39  400YBI20
     I                                       41  420YBI21
     I                                       43  440YBI22
     I                                       45  460YBI23
     I                                       47  480YBI24
     I                                       49  500YBI25
     I                                       51  520YBI26
     I                                       53  540YBI27
     I                                       55  560YBI28
     I                                       57  580YBI29
     I                                       59  600YBI30
     I                                       61  620YBI31
     I                                       63  640YBI32
     I                                       65  660YBI33
     I                                       67  680YBI34
     I                                       69  700YBI35
     I                                       71  720YBI36
     I                                       73  740YBI37
     I            DS
     I                                        1 370 KYU
     I                                        1  10 KYU01
     I                                       11  20 KYU02
     I                                       21  30 KYU03
     I                                       31  40 KYU04
     I                                       41  50 KYU05
     I                                       51  60 KYU06
     I                                       61  70 KYU07
     I                                       71  80 KYU08
     I                                       81  90 KYU09
     I                                       91 100 KYU10
     I                                      101 110 KYU11
     I                                      111 120 KYU12
     I                                      121 130 KYU13
     I                                      131 140 KYU14
     I                                      141 150 KYU15
     I                                      151 160 KYU16
     I                                      161 170 KYU17
     I                                      171 180 KYU18
     I                                      181 190 KYU19
     I                                      191 200 KYU20
     I                                      201 210 KYU21
     I                                      211 220 KYU22
     I                                      221 230 KYU23
     I                                      231 240 KYU24
     I                                      241 250 KYU25
     I                                      251 260 KYU26
     I                                      261 270 KYU27
     I                                      271 280 KYU28
     I                                      281 290 KYU29
     I                                      291 300 KYU30
     I                                      301 310 KYU31
     I                                      311 320 KYU32
     I                                      322 330 KYU33
     I                                      333 340 KYU34
     I                                      344 350 KYU35
     I                                      355 360 KYU36
     I                                      366 370 KYU37
     I            DS
     I                                        1 444 KIN
     I                                        1  12 KIN01
     I                                       13  24 KIN02
     I                                       25  36 KIN03
     I                                       35  48 KIN04
     I                                       49  60 KIN05
     I                                       61  72 KIN06
     I                                       73  84 KIN07
     I                                       85  96 KIN08
     I                                       97 108 KIN09
     I                                      109 120 KIN10
     I                                      121 132 KIN11
     I                                      133 144 KIN12
     I                                      145 156 KIN13
     I                                      157 168 KIN14
     I                                      169 180 KIN15
     I                                      181 192 KIN16
     I                                      193 204 KIN17
     I                                      205 216 KIN18
     I                                      217 228 KIN19
     I                                      229 240 KIN20
     I                                      241 252 KIN21
     I                                      253 264 KIN22
     I                                      265 276 KIN23
     I                                      277 288 KIN24
     I                                      289 300 KIN25
     I                                      301 312 KIN26
     I                                      313 324 KIN27
     I                                      325 336 KIN28
     I                                      337 348 KIN29
     I                                      349 360 KIN30
     I                                      361 372 KIN31
     I                                      373 384 KIN32
     I                                      385 396 KIN33
     I                                      397 408 KIN34
     I                                      409 420 KIN35
     I                                      421 432 KIN36
     I                                      433 444 KIN37
     I            DS
     I                                        1 222 RIN
     I                                        1   6 RIN01
     I                                        7  12 RIN02
     I                                       13  18 RIN03
     I                                       19  24 RIN04
     I                                       25  30 RIN05
     I                                       31  36 RIN06
     I                                       37  42 RIN07
     I                                       43  48 RIN08
     I                                       49  54 RIN09
     I                                       55  60 RIN10
     I                                       61  66 RIN11
     I                                       67  72 RIN12
     I                                       73  78 RIN13
     I                                       79  84 RIN14
     I                                       85  90 RIN15
     I                                       91  96 RIN16
     I                                       97 102 RIN17
     I                                      103 108 RIN18
     I                                      109 114 RIN19
     I                                      115 120 RIN20
     I                                      121 126 RIN21
     I                                      127 132 RIN22
     I                                      133 138 RIN23
     I                                      139 144 RIN24
     I                                      145 150 RIN25
     I                                      151 156 RIN26
     I                                      157 162 RIN27
     I                                      163 168 RIN28
     I                                      169 174 RIN29
     I                                      175 180 RIN30
     I                                      181 186 RIN31
     I                                      187 192 RIN32
     I                                      193 198 RIN33
     I                                      199 204 RIN34
     I                                      205 210 RIN35
     I                                      211 216 RIN36
     I                                      217 222 RIN37
     I            DS
     I                                        1   60@RST1
     I                                        1   40@RS1
     I                                        5   60@RS2
     I            DS
     I                                        1   60@RST2
     I                                        1   40@RS3
     I                                        5   60@RS4
     I            DS
     I                                        1   60WYM
     I                                        1   40WYY
     I                                        5   60WMM
     I            DS
     I                                        1   60@YM
     I                                        1   40@YY
     I                                        5   60@MM
     I              '(IAF PRODUCTION )  ' C         TITL
     I              '(FORECAST CALENDAR)' C         TITL@
     I              '(REGULAR CALENDAR) ' C         TITL$
     I              '(ASJ CALENDAR)     ' C         TITL#
      *-----*
      * KEY *
      *-----*
     C           KEY1      KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
     C           KEY2      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
      *------*
      * PARM *
      *------*
     C           *ENTRY    PLIST
     C                     PARM           NO1     1
     C                     PARM           NO2     1
      *------------------------------------------------*
      *                    １画面                    *
      *------------------------------------------------*
JW1  C                     MOVELOVPF      XFILE
      *
JW2  C                     SELEC
 .   C           OV2       WHEQ 'A@'
 .   C                     MOVELTITL@     XTITL
 .   C           OV2       WHEQ 'A$'
 .   C                     MOVELTITL$     XTITL
 .   C           OV2       WHEQ 'A#'
 .   C                     MOVELTITL#     XTITL
 .   C                     OTHER
 .   C                     MOVELTITL      XTITL
JW2  C                     ENDSL
      *
     C                     Z-ADD0         @RST1
     C                     Z-ADD0         @RST2
     C           STEP1     TAG
     C           NO1       IFEQ '1'
     C                     SETON                     08
     C                     END
     C           NO1       IFEQ '2'
     C                     SETOF                     08
     C                     END
     C                     EXFMTAGDPW041
     C                     SETOF                     010299
      *----------*
      * CMD-1 ON *
      *----------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *----------*
      * CMD-2 ON *
      *----------*
     C           *INKB     IFEQ '1'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
      *----------*
      *  ﾒﾇngf]  *
      *----------*
     C           @RST1     IFEQ 0
     C                     MOVE ER,1      MSG
     C                     SETON                     0199
     C                     GOTO STEP1
     C                     END
     C           @RST2     IFEQ 0
     C                     MOVE ER,1      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C           @RST1     IFGT @RST2
     C                     MOVE ER,2      MSG
     C                     SETON                     010299
     C                     GOTO STEP1
     C                     END
     C           @RS1      IFGE 1991
     C           @RS2      ANDGE1
     C           @RS2      ANDLE12
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0199
     C                     GOTO STEP1
     C                     END
     C           @RS3      IFGE 1991
     C           @RS4      ANDGE1
     C           @RS4      ANDLE12
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
      *---------*
      *  CHAIN  *
      *---------*
     C*---------------
     C*Ａ－ＰＩＣＳ
     C*---------------
     C           NO1       IFEQ '1'
     C                     Z-ADD@RST1     @YM
     C           LOP1      TAG
     C                     SETOF                     50
     C           KEY2      CHAINAGDPL121             50
     C           *IN50     IFEQ '1'
     C           @MM       IFEQ 12
     C                     ADD  1         @YY
     C                     Z-ADD1         @MM
     C                     ELSE
     C                     ADD  1         @MM
     C                     END
     C           @YM       IFLE @RST2
     C                     GOTO LOP1
     C                     END
     C*
     C                     MOVE ER,3      MSG
     C                     SETON                     010299
     C                     GOTO STEP1
     C                     END
     C                     END
     C*---------------
     C*設定数自動処理
     C*---------------
     C           NO1       IFEQ '2'
     C                     Z-ADD@RST1     @YM
     C           LOP2      TAG
     C                     SETOF                     50
     C           KEY2      CHAINAGDPL221             50
     C           *IN50     IFEQ '1'
     C           @MM       IFEQ 12
     C                     ADD  1         @YY
     C                     Z-ADD1         @MM
     C                     ELSE
     C                     ADD  1         @MM
     C                     END
     C           @YM       IFLE @RST2
     C                     GOTO LOP2
     C                     END
     C*
     C                     MOVE ER,3      MSG
     C                     SETON                     010299
     C                     GOTO STEP1
     C                     END
     C                     END
      ************
      * CMD-5/ON *
      ************
     C           *INKE     IFEQ '0'
     C                     GOTO STEP1
     C                     END
      *--------*
      * A-PICS *
      *--------*
     C           NO1       IFEQ '1'
     C                     Z-ADD@RST1     WYM
     C           @LOOP     TAG
     C           WYM       IFGT @RST2
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
     C                     MOVE *BLANK    SW      1
     C           KEY1      SETLLAGDPL121
     C                     Z-ADD0         YBI
     C                     MOVE *BLANK    KYU
     C                     MOVE *BLANK    KIN
     C                     MOVE *BLANK    RIN
     C                     Z-ADD0         @KAD    31
     C                     Z-ADD0         @JN1    31
     C                     Z-ADD0         @JN2    31
     C                     Z-ADD0         @JN3    31
      *
     C                     DO   *HIVAL
     C           KEY1      READEAGDPL121                 30
     C           *IN,30    IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADD1         @DD     21
     C                     ELSE
     C                     Z-ADD0.5       @DD
     C                     END
     C                     ADD  @DD       @KAD
      *
     C           F8KADD    IFGE 01
     C           F8KADD    ANDLE10
     C                     ADD  @DD       @JN1
     C                     ELSE
     C           F8KADD    IFGE 11
     C           F8KADD    ANDLE20
     C                     ADD  @DD       @JN2
     C                     ELSE
     C           F8KADD    IFGE 21
     C           F8KADD    ANDLE31
     C                     ADD  @DD       @JN3
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           SW        IFEQ *BLANK
     C                     TIME           TIME    60
     C                     Z-ADD1         P       50
     C                     MOVE '*'       SW
     C                     Z-ADD1         X       10
     C           F8YOBI    LOKUPHZ1,X                    20
     C           *IN20     IFEQ '1'
     C                     Z-ADDHZ2,X     P
     C                     END
     C                     END
      *------*
      * ﾍlﾞi *
      *------*
     C           F8KADD    IFNE 0
     C                     Z-ADDF8KADD    YBI,P
      *--------------------------*
      * zﾇv.ﾍﾓg]gｬcﾆﾞl.zg]gｬcﾆﾞl *
      *--------------------------*
     C                     MOVE *BLANK    M       1
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     MOVE '1'       M
     C                     END
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ*BLANK
     C                     MOVE '2'       M
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ'*'
     C                     MOVE '3'       M
     C                     END
     C                     Z-ADD1         E       20
     C           M         LOKUPKY1,E                    20
     C           *IN20     IFEQ '1'
     C                     MOVE *BLANK    KYU,P
     C                     MOVELKY2,E     KYU,P
     C                     END
      *-------------------------------*
      * udzg]fbﾆ.udzg]kｬc.udzg]ﾆｬcﾒｭc *
      *-------------------------------*
     C           F8MAEY    IFNE *BLANK
     C           F8MAEY    IFEQ 'S'
     C                     MOVE '1'       N       1
     C                     END
     C           F8MAEY    IFEQ 'E'
     C                     MOVE '3'       N
     C                     END
     C           F8MAEY    IFEQ 'M'
     C                     MOVE '2'       N
     C                     END
     C                     Z-ADD1         E
     C           N         LOKUPKI1,E                    20
     C           *IN20     IFEQ '1'
     C                     MOVELKI2,E     KIN,P
     C                     END
     C                     END
     C                     ADD  1         P
     C                     END
     C                     END
     C  N30                END
     C                     EXCPTDTA
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD1         WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     GOTO @LOOP
     C                     END
      *-----------------*
      * ﾈｮmbﾇc ﾆﾞnﾞcﾆｭﾒ *
      *-----------------*
     C           NO1       IFEQ '2'
     C                     Z-ADD@RST1     WYM
     C           @LOOP1    TAG
     C           WYM       IFGT @RST2
     C                     SETON                     LRU1
     C                     RETRN
     C                     END
     C                     MOVE *BLANK    SW      1
     C           KEY1      SETLLAGDPL221
     C                     Z-ADD0         YBI
     C                     MOVE *BLANK    KYU
     C                     MOVE *BLANK    KIN
     C                     MOVE *BLANK    RIN
     C                     Z-ADD0         @KAD
     C                     Z-ADD0         @JN1
     C                     Z-ADD0         @JN2
     C                     Z-ADD0         @JN3
      *
     C                     DO   *HIVAL
     C           KEY1      READEAGDPL221                 30
     C           *IN,30    IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C           F8RIKB    IFEQ *BLANK
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADD1         @DD
     C                     ELSE
     C                     Z-ADD0.5       @DD
     C                     END
     C                     ADD  @DD       @KAD
      *
     C           F8KADD    IFGE 01
     C           F8KADD    ANDLE10
     C                     ADD  @DD       @JN1
     C                     ELSE
     C           F8KADD    IFGE 11
     C           F8KADD    ANDLE20
     C                     ADD  @DD       @JN2
     C                     ELSE
     C           F8KADD    IFGE 21
     C           F8KADD    ANDLE31
     C                     ADD  @DD       @JN3
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           SW        IFEQ *BLANK
     C                     TIME           TIME    60
     C                     Z-ADD1         P       50
     C                     MOVE '*'       SW
     C                     Z-ADD1         X       10
     C           F8YOBI    LOKUPHZ1,X                    20
     C           *IN20     IFEQ '1'
     C                     Z-ADDHZ2,X     P
     C                     END
     C                     END
      *------*
      * ﾍlﾞi *
      *------*
     C           F8KADD    IFNE 0
     C                     Z-ADDF8KADD    YBI,P
      *--------------------------*
      * zﾇv.ﾍﾓg]gｬcﾆﾞl.zg]gｬcﾆﾞl *
      *--------------------------*
     C                     MOVE *BLANK    M       1
     C           F8HIRU    IFNE *BLANK
     C           F8YORU    ANDNE*BLANK
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     MOVE '1'       M       1
     C                     END
     C                     END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ*BLANK
     C                     MOVE '2'       M
     C                     END
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ'*'
     C                     MOVE '3'       M
     C                     END
     C                     Z-ADD1         E       20
     C           M         LOKUPKY1,E                    20
     C           *IN20     IFEQ '1'
     C                     MOVE *BLANK    KYU,P
     C                     MOVELKY2,E     KYU,P
     C                     END
      *-------------------------------*
      * udzg]fbﾆ.udzg]kｬc.udzg]ﾆｬcﾒｭc *
      *-------------------------------*
     C           F8MAEY    IFNE *BLANK
     C           F8MAEY    IFEQ 'S'
     C                     MOVE '1'       N       1
     C                     END
     C           F8MAEY    IFEQ 'E'
     C                     MOVE '3'       N
     C                     END
     C           F8MAEY    IFEQ 'M'
     C                     MOVE '2'       N
     C                     END
     C                     Z-ADD1         E
     C           N         LOKUPKI1,E                    20
     C           *IN20     IFEQ '1'
     C                     MOVELKI2,E     KIN,P
     C                     END
     C                     END
      *-------*
      * ﾒ]ﾆｬl *
      *-------*
     C           NO1       IFEQ '2'
     C           F8RIKB    ANDEQ'R'
     C                     MOVE 'UNWORK'  RIN,P
     C                     END
     C                     ADD  1         P
     C                     END
     C                     END
     C  N30                END
     C                     EXCPTDTA
     C           WMM       IFEQ 12
     C                     ADD  1         WYY
     C                     Z-ADD1         WMM
     C                     ELSE
     C                     ADD  1         WMM
     C                     END
     C                     GOTO @LOOP1
     C                     END
     OQPRINT  E   03           DTA
     O                                  131 '....................'
     O                                  111 '...................'
     O        E   04           DTA
     O                                   93 '.'
     O                                  119 'EACH DEPT CONFIRM MARK'
     O                                  122 '.'
     O                                  131 '.'
     O                                  130 'INF SECT'
     O        E   05           DTA
     O                                  131 '....................'
     O                                  111 '...................'
     O        E   06           DTA
     O                                  131 '.'
     O                                  129 'CHARGE'
     O                                  122 '.'
     O                                  120 'CHARGE'
     O                                  113 '.'
     O                                  112 'SB CHF'
     O                                  106 '.'
     O                                  105 'VICE / CHIEF'
     O                                   93 '.'
     O        E   07           DTA
     O                                  131 '....................'
     O                                  111 '...................'
     O        E   08           DTA
     O                                    7 'AGDR04'
     O                                   22 '**'
     O                                   46 'IAF'
     O                                   65 'OPERATION CALENDAR'
     O                                   77 'LIST CREATE'
     O                                   80 '**'
     O                                  131 '.'
     O                                  122 '.'
     O                                  113 '.'
     O                                  106 '.'
     O                                   93 '.'
     O        E   09           DTA
     O                                   81 'TIME'
     O                         TIME      90 '  :  :  '
     O                                  131 '.'
     O                                  122 '.'
     O                                  113 '.'
     O                                  106 '.'
     O                                   93 '.'
     O        E   10           DTA
     O                                   81 'DATE'
     O                         UDATE Y   90
     O                                  131 '....................'
     O                                  111 '...................'
     O        E   13           DTA
     O                         WYY   4    9
     O                                   14 'YEAR'
     O                         WMM   4   17
     O                                   23 'MONTH'
     O                                   40 'OPERATION DAYS ='
     O                         @KAD  3   45
     O                                   60 '1ST 10 DAYS ='
     O                         @JN1  3   65
     O                                   72 '2ND ='
     O                         @JN2  3   77
     O                                   84 '3RD ='
     O                         @JN3  3   89
     O        E   15           DTA
     O                 08                24 'A-PICS'
     O                 08                39 '<FILE-AGDPP11>'
     O                N08                26 'SET NBR AUTO HANDL'
     O                N08                41 '<FILE-AGDPP21>'
     O        E   2023         DTA
     O                                   20 '<SUNDAY>'
     O                                   35 '<MONDAY>'
     O                                   50 '<TUESDAY>'
     O                                   66 '<WEDNESDAY>'
     O                                   80 '<THURSDAY>'
     O                                   95 '<FRIDAY>'
     O                                  110 '<SATURDAY>'
     O        E  2             DTA
     O                         YBI,014   17
     O                         YBI,024   32
     O                         YBI,034   47
     O                         YBI,044   62
     O                         YBI,054   77
     O                         YBI,064   92
     O                         YBI,074  107
     O        E  1             DTA
     O                         KYU,01    20
     O                         KYU,02    35
     O                         KYU,03    50
     O                         KYU,04    65
     O                         KYU,05    80
     O                         KYU,06    95
     O                         KYU,07   110
     O        E  1             DTA
     O                         KIN,01    21
     O                         KIN,02    36
     O                         KIN,03    51
     O                         KIN,04    66
     O                         KIN,05    81
     O                         KIN,06    96
     O                         KIN,07   111
     O        E  3             DTA
     O                         RIN,01    18
     O                         RIN,02    33
     O                         RIN,03    48
     O                         RIN,04    63
     O                         RIN,05    78
     O                         RIN,06    93
     O                         RIN,07   108
     O        E  2             DTA
     O                         YBI,084   17
     O                         YBI,094   32
     O                         YBI,104   47
     O                         YBI,114   62
     O                         YBI,124   77
     O                         YBI,134   92
     O                         YBI,144  107
     O        E  1             DTA
     O                         KYU,08    20
     O                         KYU,09    35
     O                         KYU,10    50
     O                         KYU,11    65
     O                         KYU,12    80
     O                         KYU,13    95
     O                         KYU,14   110
     O        E  1             DTA
     O                         KIN,08    21
     O                         KIN,09    36
     O                         KIN,10    51
     O                         KIN,11    66
     O                         KIN,12    81
     O                         KIN,13    96
     O                         KIN,14   111
     O        E  3             DTA
     O                         RIN,08    18
     O                         RIN,09    33
     O                         RIN,10    48
     O                         RIN,11    63
     O                         RIN,12    78
     O                         RIN,13    93
     O                         RIN,14   108
     O        E  2             DTA
     O                         YBI,154   17
     O                         YBI,164   32
     O                         YBI,174   47
     O                         YBI,184   62
     O                         YBI,194   77
     O                         YBI,204   92
     O                         YBI,214  107
     O        E  1             DTA
     O                         KYU,15    20
     O                         KYU,16    35
     O                         KYU,17    50
     O                         KYU,18    65
     O                         KYU,19    80
     O                         KYU,20    95
     O                         KYU,21   110
     O        E  1             DTA
     O                         KIN,15    21
     O                         KIN,16    36
     O                         KIN,17    51
     O                         KIN,18    65
     O                         KIN,19    81
     O                         KIN,20    96
     O                         KIN,21   111
     O        E  3             DTA
     O                         RIN,15    18
     O                         RIN,16    33
     O                         RIN,17    48
     O                         RIN,18    63
     O                         RIN,19    78
     O                         RIN,20    93
     O                         RIN,21   108
     O        E  2             DTA
     O                         YBI,224   17
     O                         YBI,234   32
     O                         YBI,244   47
     O                         YBI,254   62
     O                         YBI,264   77
     O                         YBI,274   92
     O                         YBI,284  107
     O        E  1             DTA
     O                         KYU,22    20
     O                         KYU,23    35
     O                         KYU,24    50
     O                         KYU,25    65
     O                         KYU,26    80
     O                         KYU,27    95
     O                         KYU,28   110
     O        E  1             DTA
     O                         KIN,22    21
     O                         KIN,23    36
     O                         KIN,24    51
     O                         KIN,25    66
     O                         KIN,26    81
     O                         KIN,27    96
     O                         KIN,28   111
     O        E  3             DTA
     O                         RIN,22    18
     O                         RIN,23    33
     O                         RIN,24    48
     O                         RIN,25    63
     O                         RIN,26    78
     O                         RIN,27    93
     O                         RIN,28   108
     O        E  2             DTA
     O                         YBI,294   17
     O                         YBI,304   32
     O                         YBI,314   47
     O                         YBI,324   62
     O                         YBI,334   77
     O                         YBI,344   92
     O                         YBI,354  107
     O        E  1             DTA
     O                         KYU,29    20
     O                         KYU,30    35
     O                         KYU,31    50
     O                         KYU,32    65
     O                         KYU,33    80
     O                         KYU,34    95
     O                         KYU,35   110
     O        E  1             DTA
     O                         KIN,29    21
     O                         KIN,30    36
     O                         KIN,31    51
     O                         KIN,32    66
     O                         KIN,33    81
     O                         KIN,34    96
     O                         KIN,35   111
     O        E  3             DTA
     O                         RIN,29    18
     O                         RIN,30    33
     O                         RIN,31    48
     O                         RIN,32    63
     O                         RIN,33    78
     O                         RIN,34    93
     O                         RIN,35   108
     O        E  2             DTA
     O                         YBI,364   17
     O                         YBI,374   32
     O        E  1             DTA
     O                         KYU,36    20
     O                         KYU,37    35
     O        E  1             DTA
     O                         KIN,36    21
     O                         KIN,37    36
     O        E  1             DTA
     O                         RIN,36    18
     O                         RIN,37    33
**  ER (ERROR-MESSAGE)
E-01 ENTER DATA
E-02 DATA IS NOT ACCEPTEBLE
E-03 DATA DOES NOT EXIST
**  HZ (DAY IN A WEEK )
12
23
34
45
56
67
71
**  KY ( REST)
1HOLIDAY
2DAY AT HLD
3NGT AT HLD
**  KI ( UNWORKING NIGHT ATTENDANCE)
1UNWK NGT STR
2DUR UNWK NGT
3UNWK NGT END
