     H            Y.
     F* AGDR03 ***************************************************
     F* IAF PRODUCTION PLACE OPERATION CALENDAR  - UPDATE-       *
     F* S.YAMAGAMI   91.01.07                                    *
     F* -------------------------------------                    *
JW3  F* JW    12/06/22 ADD LOG FILE (AGDPP15)                    *
     F************************************************************
     FAGDPW03 CF  E                    WORKSTN
JW2  FAGDPL12 UF  E           K        DISK         KINFDS INF1  A
     FAGDPL22 UF  E           K        DISK                      A
JW3  FAGDPP15 O   E                    DISK
      *************************************************************
     E                    ER      1  11 60               d[-xｮﾈｰﾆﾞ
     E                    AA      1   7  1 0 BB      8
     E                    TB1     1   3  1   TB2     8
      ******
      * DS *
      ******
      *
JW2  IINF1        DS
 |   I                                        1  10 PF
 |   I                                       83  84 OV2
 |   I                                       83  92 OVPF
JW2  I                                       93 102 OBLIB
     I            DS
     I                                        1   80@HIZK
     I                                        1   40NEN
     I                                        5   60TSUKI
     I                                        7   80HI
     I              '(IAF PRODUCTION )  ' C         TITL
     I              '(FORECAST CALENDAR)' C         TITL@
     I              '(REGULAR CALENDAR) ' C         TITL$
     I              '(ASJ CALENDAR)     ' C         TITL#
JW3  I            DS
 .   I                                        1  140@SDATE
 .   I                                        1   60NOW
 .   I                                        7  140TODAY
 .   I           SDS
 .   I                                        1   8 #PGM
 .   I                                      244 253 #WSID
JW3  I                                      254 263 #USER
      ********
      * PARM *
      ********
     C           *ENTRY    PLIST
     C                     PARM           NO1     1
     C                     PARM           NO2     1
      *******
      * KEY *
      *******
     C           KEY1      KLIST
     C                     KFLD           NEN
     C                     KFLD           TSUKI
     C                     KFLD           HI
      *--------------------------------------*
      *             ﾎﾟﾜhﾞ[w ﾇj-n             *
      *--------------------------------------*
JW3  C                     TIME           @SDATE
JW2  C                     MOVELOVPF      XFILE
      *
JW2  C                     SELEC
 .   C           OV2       WHEQ 'A@'
 .   C                     MOVELTITL@     XTITL
 .   C           OV2       WHEQ 'A$'
 .   C                     MOVELTITL$     XTITL
 .   C           OV2       WHEQ 'A#'
 .   C                     MOVELTITL#     XTITL
 .   C                     OTHER
 .   C                     MOVELTITL      XTITL
JW2  C                     ENDSL
      *
     C           STP1      TAG
     C                     MOVE *BLANK    @COD
     C                     MOVE *BLANK    @CODM
     C                     Z-ADD0         @HIZK
     C           STEP1     TAG
     C           NO1       IFEQ '1'
     C                     SETON                     08
     C                     END
     C           NO1       IFEQ '2'
     C                     SETOF                     08
     C                     END
      *--------------------------------------*
      *            １画面表示              *
      *--------------------------------------*
     C                     MOVE *BLANK    @YBI
     C                     MOVE *BLANK    @CODM
     C                     MOVE *BLANK    @HIRU
     C                     MOVE *BLANK    @YORU
     C                     MOVE *BLANK    @YAKIN
     C                     MOVE *BLANK    @YOUBI
     C                     MOVE *BLANK    @RIN
     C                     EXFMTAGDPW031
     C                     SETOF                     0102
     C                     SETOF                     99
      *----------*
      * CMD-1 ON *
      *----------*
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *----------*
      * CMD-2 ON *
      *----------*
     C           *INKB     IFEQ '1'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
      *----------*
      * ﾃcﾆ]kｩｮh *
      *----------*
     C           @COD      IFEQ *BLANK
     C                     MOVE ER,7      MSG
     C                     SETON                     0199
     C                     GOTO STEP1
     C                     END
      *
     C           @COD      IFNE '0'
     C           @COD      ANDNE'1'
     C           @COD      ANDNE'2'
     C                     MOVE ER,8      MSG
     C                     SETON                     0199
     C                     GOTO STEP1
     C                     END
      *----------*
      * ﾍlﾞikｩｮh *
      *----------*
     C           @HIZK     IFEQ 0
     C                     MOVE ER,1      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
      *
     C           NEN       IFGE 1990
     C           TSUKI     ANDGE01
     C           TSUKI     ANDLE12
     C           HI        ANDGE01
     C           HI        ANDLE31
     C                     ELSE
     C                     MOVE ER,2      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
      *-----------------------------------------------*
      *                    A-PICS                     *
      *-----------------------------------------------*
     C           NO1       IFEQ '1'
     C                     SETOF                     10
     C           KEY1      CHAINAGDPL121             10
      *------*
      * nﾒiﾆ *
      *------*
     C           @COD      IFEQ '0'
     C           *IN10     IFEQ '1'
     C                     MOVE ER,9      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *------*
      * s]ﾃc *
      *------*
     C           @COD      IFEQ '1'
     C           *IN10     IFEQ '1'
     C                     MOVE ER,10     MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *-----*
      * lbf *
      *-----*
     C           @COD      IFEQ '2'
     C           *IN10     IFEQ '0'
     C                     MOVE ER,11     MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C                     END
      *-----------------------------------------------*
      *                 ﾈｮmbﾇcﾆﾞnﾞcﾆｭﾒ                *
      *-----------------------------------------------*
     C           NO1       IFEQ '2'
     C                     SETOF                     10
     C           KEY1      CHAINAGDPL221             10
      *------*
      * nﾒiﾆ *
      *------*
     C           @COD      IFEQ '0'
     C           *IN10     IFEQ '1'
     C                     MOVE ER,9      MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *------*
      * s]ﾃc *
      *------*
     C           @COD      IFEQ '1'
     C           *IN10     IFEQ '1'
     C                     MOVE ER,10     MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *-----*
      * lbf *
      *-----*
     C           @COD      IFEQ '2'
     C           *IN10     IFEQ '0'
     C                     MOVE ER,11     MSG
     C                     SETON                     0299
     C                     GOTO STEP1
     C                     END
     C                     END
      *
     C                     END
      *-------*
      * LOKUP *
      *-------*
     C           @COD      IFNE '2'
     C                     Z-ADD1         X       10
     C           F8YOBI    LOKUPAA,X                     20
     C           *IN20     IFEQ '1'
     C                     MOVELBB,X      @YBI
     C                     END
     C                     END
      *
     C                     Z-ADD1         X       10
     C           @COD      LOKUPTB1,X                    20
     C           *IN20     IFEQ '1'
     C                     MOVELTB2,X     @CODM
     C                     END
      *--------------------------------------------*
      *                 ２画面表示               *
      *--------------------------------------------*
     C           STP2      TAG
     C                     MOVE *BLANK    @YBI
     C                     MOVE *BLANK    @HIRU
     C                     MOVE *BLANK    @YORU
     C                     MOVE *BLANK    @YAKIN
     C                     MOVE *BLANK    @RIN
      *
     C           @COD      IFNE '2'
     C                     MOVE F8HIRU    @HIRU
     C                     MOVE F8YORU    @YORU
     C                     MOVE F8MAEY    @YAKIN
     C                     MOVE F8YOBI    @YOUBI
     C                     Z-ADD1         X       10
     C           F8YOBI    LOKUPAA,X                     20
     C           *IN20     IFEQ '1'
     C                     MOVELBB,X      @YBI
     C                     END
     C                     END
      *
     C           NO1       IFEQ '2'
     C                     MOVE F8RIKB    @RIN
     C                     END
      *
     C           STEP2     TAG
      *
     C           NO1       IFEQ '1'
     C                     SETOF                     40
     C                     END
     C           NO1       IFEQ '2'
     C                     SETON                     40
     C                     END
      *
     C                     EXFMTAGDPW032
     C                     SETOF                     030405
     C                     SETOF                     0699
      *----------*
      * CMD-3 ON *
      *----------*
     C           *INKC     IFEQ '1'
     C**                   GOTO STP1
JW   C                     GOTO STEP1
     C                     END
      *-----------------*
      * ﾍﾓg] gｬcﾆﾞlhﾎﾞ] *
      *-----------------*
     C           @HIRU     IFNE *BLANK
     C           @HIRU     ANDNE'*'
     C                     MOVE ER,4      MSG
     C                     SETON                     0399
     C                     GOTO STEP2
     C                     END
      *----------------*
      * zg] gｬcﾆﾞlhﾎﾞ] *
      *----------------*
     C           @YORU     IFNE *BLANK
     C           @YORU     ANDNE'*'
     C                     MOVE ER,4      MSG
     C                     SETON                     0499
     C                     GOTO STEP2
     C                     END
      *------------------*
      * udzg] gｬcﾆﾞlhﾎﾞ] *
      *------------------*
     C           @YAKIN    IFNE *BLANK
     C           @YAKIN    IFNE 'S'
     C           @YAKIN    ANDNE'M'
     C           @YAKIN    ANDNE'E'
     C                     MOVE ER,5      MSG
     C                     SETON                     0599
     C                     GOTO STEP2
     C                     END
     C                     END
      *------------*
      * ﾒ]ﾆｬl hﾎﾞ] *
      *------------*
     C           @RIN      IFNE *BLANK
     C           @RIN      ANDNE'R'
     C                     MOVE ER,6      MSG
     C                     SETON                     0699
     C                     GOTO STEP2
     C                     END
      *----------------------*
      * CMD-5 ON (mﾞｰjﾃcﾆb]) *
      *----------------------*
     C           *INKE     IFNE '1'
     C                     GOTO STEP2
     C                     END
      *
     C           @COD      IFEQ '2'
     C                     MOVE NEN       F8KAYY
     C                     MOVE TSUKI     F8KAMM
     C                     MOVE HI        F8KADD
     C                     END
      *-------*
      * DELET *
      *-------*
     C           @COD      IFEQ '0'
     C           NO1       IFEQ '1'
     C  N10                DELETAGDPL121
JW3   * LOG FILE
 .   C           *IN10     IFEQ *OFF
 .   C                     MOVEL'DLT'     F8KO
 .   C                     Z-ADDTODAY     F8KOHZ
 .   C                     Z-ADDNOW       F8KOTM
 .   C                     MOVEL#USER     F8KOUS
 .   C                     MOVEL#PGM      F8KOPG
 .   C                     MOVELOV2       F8KOPG
 .   C                     MOVELOVPF      F8KOFL
 .   C                     WRITEAGDPP151
JW3  C                     ENDIF
     C                     END
      *
     C           NO1       IFEQ '2'
     C  N10                DELETAGDPL221
     C                     END
     C                     END
      *
     C           @COD      IFNE '0'
     C                     MOVE @HIRU     F8HIRU
     C                     MOVE @YORU     F8YORU
     C                     MOVE @YAKIN    F8MAEY
     C                     MOVE @YOUBI    F8YOBI
     C                     END
     C           NO1       IFEQ '2'
     C                     MOVE @RIN      F8RIKB
     C                     END
      *--------*
      * A-PICS *
      *--------*
     C           @COD      IFNE '0'
     C           NO1       IFEQ '1'
     C           *IN10     IFEQ '1'
     C                     WRITEAGDPL121
JW3   * LOG FILE
 .   C                     MOVEL'ADD'     F8KO
 .   C                     Z-ADDTODAY     F8KOHZ
 .   C                     Z-ADDNOW       F8KOTM
 .   C                     MOVEL#USER     F8KOUS
 .   C                     MOVEL#PGM      F8KOPG
 .   C                     MOVELOV2       F8KOPG
 .   C                     MOVELOVPF      F8KOFL
JW3  C                     WRITEAGDPP151
     C                     ELSE
      *
     C                     UPDATAGDPL121
JW3   * LOG FILE
 .   C                     MOVEL'UPD'     F8KO
 .   C                     Z-ADDTODAY     F8KOHZ
 .   C                     Z-ADDNOW       F8KOTM
 .   C                     MOVEL#USER     F8KOUS
 .   C                     MOVEL#PGM      F8KOPG
 .   C                     MOVELOV2       F8KOPG
 .   C                     MOVELOVPF      F8KOFL
JW3  C                     WRITEAGDPP151
     C                     END
     C                     END
      *----------------*
      * ﾈｮmbﾇcﾆﾞnﾞcﾆｭﾒ *
      *----------------*
     C           NO1       IFEQ '2'
     C           *IN10     IFEQ '1'
     C                     WRITEAGDPL221
     C                     ELSE
     C                     UPDATAGDPL221
     C                     END
     C                     END
     C                     END
      *
     C**                   GOTO STP1
JW   C                     GOTO STEP1
**  ER (ERROR-MESSAGE)
E-01 ENTER DATE
E-02 DATE IS NOT VALID
E-03 ENTER CREATE DAY
E-04 ENTER * OR BLANK
E-05 ENTER S,M,E OR BLANK
E-06 ENTER R OR BLANK
E-07 ENTER 0, 1 OR 2
E-08 ENTER 0, 1 OR 2
E-09 DATE DOES NOT EXIST
E-10 DATE IS NOT CORRECT
E-11 DATA EXISTS ALREADY
**  AA1/BB2
1MONDAY
2TUESDAY
3WEDNSDAY
4THURSDAY
5FRIDAY
6SATURDAY
7SUNDAY
**  TB1/TB2
0 CANCEL
1 CHANGE
2 ADD
