     H            Y.
     F**********************************
     F* USER OPERATION CALENDAR CREATE *
     F* C:Y.AOYAMA 1991.09.06 *
     F**********************************
     FAGDPW31 CF  E                    WORKSTN
     FFGBPL01 IF  E           K        DISK
     FAGDPL31 UF  E           K        DISK                      A
     E                    ER      1   7 60               ERRMSG
     I*---------------
     I*    ＤＳ
     I*---------------
     I            DS
     I                                        1   60@SKYM
     I                                        1   40SKYY
     I                                        5   60SKMM
     C*---------------
     C*   ＫＥＹ
     C*---------------
     C           KEY       KLIST
     C                     KFLD           @TOKU
     C                     KFLD           @NOKJ
     C                     KFLD           SKYY
     C                     KFLD           SKMM
     C*---------------
     C* fﾞx] ﾉ ﾆｭgf
     C*---------------
     C           LAB1      TAG
     C                     Z-ADD0         @TOKU
     C                     MOVE *BLANK    @NOKJ
     C                     Z-ADD0         @SKYM
     C                     Z-ADD0         @SKD1
     C                     Z-ADD0         @SKD2
     C                     Z-ADD0         @YOBI
     C           LAB2      TAG
     C*---------------
     C* AGDPW311 ﾍｭcﾆﾞ
     C*---------------
     C                     EXFMTAGDPW311
     C                     SETOF                     010203
     C                     SETOF                     0499
     C*---------------
     C* CMD-1 kｩｮh
     C*---------------
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*---------------
     C* CMD-2 kｩｮh
     C*---------------
     C           *INKB     IFEQ '1'
     C                     SETON                     U1LR
     C                     RETRN
     C                     END
     C*---------------
     C* CMD-12 kｩｮh
     C*---------------
     C           *INKL     IFEQ '1'
     C           *IN40     ANDEQ'1'
     C                     SETOF                     40
     C           KEY       SETLLAGDPL311
     C                     DO   *HIVAL
     C                     SETOF                         30
     C           KEY       READEAGDPL311                 30
     C           *IN30     IFEQ '0'
     C                     DELETAGDPL311
     C                     END
     C  N30                END
     C                     Z-ADD@SKD1     ST      20
     C                     Z-ADD@YOBI     DA      10
     C                     DO   *HIVAL
     C                     Z-ADD@TOKU     F8TOKU
     C                     MOVE @NOKJ     F8KOJO
     C                     Z-ADDSKYY      F8KAYY
     C                     Z-ADDSKMM      F8KAMM
     C                     Z-ADDDA        F8YOBI
     C                     MOVE *BLANK    F8HIRU
     C                     MOVE *BLANK    F8YORU
     C                     MOVE *BLANK    F8MAEY
     C                     MOVE *BLANK    F8RIKB
     C                     ADD  1         DA
     C           DA        IFEQ 8
     C                     Z-ADD1         DA
     C                     END
     C                     Z-ADDST        F8KADD
     C                     ADD  1         ST
     C                     WRITEAGDPL311
     C           ST        IFGT @SKD2
     C                     GOTO LAB1
     C                     END
     C                     END
     C                     END
     C*---------------
     C* nhbﾅg kｩｮh
     C*---------------
     C           @TOKU     IFEQ 0
     C                     SETON                     9901
     C                     MOVE ER,1      @ERR
     C                     GOTO LAB2
     C                     END
     C           @TOKU     CHAINFGBPL01              90
     C           *IN90     IFEQ '1'
     C                     SETON                     9901
     C                     MOVE ER,2      @ERR
     C                     GOTO LAB2
     C                     END
     C*---------------
     C* r].iﾞl kｩｮh
     C*---------------
     C           @SKYM     IFEQ 0
     C                     SETON                     9902
     C                     MOVE ER,3      @ERR
     C                     GOTO LAB2
     C                     END
     C*
     C           SKYY      IFGE 1990
     C           SKMM      ANDGE01
     C           SKMM      ANDLE12
     C                     ELSE
     C                     SETON                     9902
     C                     MOVE ER,4      @ERR
     C                     GOTO LAB2
     C                     END
     C*---------------
     C* ﾅhﾈbﾍﾞkｩｮh
     C*---------------
     C           @SKD1     IFEQ 0
     C           @SKD2     OREQ 0
     C                     SETON                     9903
     C                     MOVE ER,3      @ERR
     C                     GOTO LAB2
     C                     END
     C*
     C           @SKD1     IFGE 1
     C           @SKD1     ANDLE31
     C           @SKD2     ANDGE1
     C           @SKD2     ANDLE31
     C                     ELSE
     C                     SETON                     9903
     C                     MOVE ER,4      @ERR
     C                     GOTO LAB2
     C                     END
     C*---------------
     C* ﾑcﾍﾞﾉ kｩｮh
     C*---------------
     C           @YOBI     IFEQ 0
     C                     SETON                     9904
     C                     MOVE ER,5      @ERR
     C                     GOTO LAB2
     C                     END
     C*
     C           @YOBI     IFGE 1
     C           @YOBI     ANDLE7
     C                     ELSE
     C                     SETON                     9904
     C                     MOVE ER,6      @ERR
     C                     GOTO LAB2
     C                     END
     C*---------------
     C* CMD-5 kｩｮh
     C*---------------
     C           *INKE     IFEQ '0'
     C                     GOTO LAB2
     C                     END
     C*--          --*
     C*  mﾞｰj ﾉ kｩｮh
     C*--          --*
     C                     SETON                     10
     C           KEY       CHAINAGDPL311             10
     C           *IN10     COMP '0'                      40
     C           *IN10     IFEQ '0'
     C                     MOVE ER,7      @ERR
     C                     SETON                     010203
     C                     SETON                     044099
     C                     GOTO LAB2
     C                     END
     C*--         --*
     C*  mﾞｰj fgﾃv
     C*--         --*
     C                     Z-ADD@SKD1     ST      20
     C                     Z-ADD@YOBI     DA      10
     C                     DO   *HIVAL
     C                     Z-ADD@TOKU     F8TOKU
     C                     MOVE @NOKJ     F8KOJO
     C                     Z-ADDSKYY      F8KAYY
     C                     Z-ADDSKMM      F8KAMM
     C                     Z-ADDDA        F8YOBI
     C                     MOVE *BLANK    F8HIRU
     C                     MOVE *BLANK    F8YORU
     C                     MOVE *BLANK    F8MAEY
     C                     MOVE *BLANK    F8RIKB
     C                     ADD  1         DA
     C           DA        IFEQ 8
     C                     Z-ADD1         DA
     C                     END
     C                     Z-ADDST        F8KADD
     C                     ADD  1         ST
     C                     WRITEAGDPL311
     C           ST        IFGT @SKD2
     C                     GOTO LAB1
     C                     END
     C                     END
**
ER-1 INPUT CUSTOMER.
ER-2 THERE ISN'T THIS CODE IN DETAILS M/F.
ER-3 INPUT DATE.
ER-4 DATE IS NOT RIGHT.
ER-5 INPUT DAY IN A WEEK NUMBER.
ER-6 DAY IN A WEEK NUMBER IS NOT RIGHT.
ER-7 DATA EXISTS ALREADY. MAKING IT AGAIN IS <CMD-12>
