     H            Y.
     F** AGDR06  *********************************************************
     F*  IAF PRODUCTION CALENDAR INQ V.2                                 *
     F*      (ADDED PAGE UP/DOWN)                                        *
     F*  JW   2023.05.12                                                 *
     F********************************************************************
     FAGDPW06 CF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK                           UC
     E                    MSG     1  15 60
     E                    CMD     1   4 60
      *
     E                    XYM         4  6 0
     E                    XWK         4  2 0
     E                    XD1        38  3
     E                    XD2        38  3
     E                    XD3        38  3
     E                    XD4        38  3
     I            DS
     I                                        1  240XYM
     I                                        1   60XYM01
     I                                        7  120XYM02
     I                                       13  180XYM03
     I                                       19  240XYM04
     I            DS
     I                                        1   80XWK
     I                                        1   20XWK01
     I                                        3   40XWK02
     I                                        5   60XWK03
     I                                        7   80XWK04
     I            DS
     I                                        1 114 XD1
     I                                        1   3 XD101
     I                                        4   6 XD102
     I                                        7   9 XD103
     I                                       10  12 XD104
     I                                       13  15 XD105
     I                                       16  18 XD106
     I                                       19  21 XD107
     I                                       22  24 XD108
     I                                       25  27 XD109
     I                                       28  30 XD110
     I                                       31  33 XD111
     I                                       34  36 XD112
     I                                       37  39 XD113
     I                                       40  42 XD114
     I                                       43  45 XD115
     I                                       46  48 XD116
     I                                       49  51 XD117
     I                                       52  54 XD118
     I                                       55  57 XD119
     I                                       58  60 XD120
     I                                       61  63 XD121
     I                                       64  66 XD122
     I                                       67  69 XD123
     I                                       70  72 XD124
     I                                       73  75 XD125
     I                                       76  78 XD126
     I                                       79  81 XD127
     I                                       82  84 XD128
     I                                       85  87 XD129
     I                                       88  90 XD130
     I                                       91  93 XD131
     I                                       94  96 XD132
     I                                       97  99 XD133
     I                                      100 102 XD134
     I                                      103 105 XD135
     I                                      106 108 XD136
     I                                      109 111 XD137
     I                                      112 114 XD138
     I            DS
     I                                        1 114 XD2
     I                                        1   3 XD201
     I                                        4   6 XD202
     I                                        7   9 XD203
     I                                       10  12 XD204
     I                                       13  15 XD205
     I                                       16  18 XD206
     I                                       19  21 XD207
     I                                       22  24 XD208
     I                                       25  27 XD209
     I                                       28  30 XD210
     I                                       31  33 XD211
     I                                       34  36 XD212
     I                                       37  39 XD213
     I                                       40  42 XD214
     I                                       43  45 XD215
     I                                       46  48 XD216
     I                                       49  51 XD217
     I                                       52  54 XD218
     I                                       55  57 XD219
     I                                       58  60 XD220
     I                                       61  63 XD221
     I                                       64  66 XD222
     I                                       67  69 XD223
     I                                       70  72 XD224
     I                                       73  75 XD225
     I                                       76  78 XD226
     I                                       79  81 XD227
     I                                       82  84 XD228
     I                                       85  87 XD229
     I                                       88  90 XD230
     I                                       91  93 XD231
     I                                       94  96 XD232
     I                                       97  99 XD233
     I                                      100 102 XD234
     I                                      103 105 XD235
     I                                      106 108 XD236
     I                                      109 111 XD237
     I                                      112 114 XD238
     I            DS
     I                                        1 114 XD3
     I                                        1   3 XD301
     I                                        4   6 XD302
     I                                        7   9 XD303
     I                                       10  12 XD304
     I                                       13  15 XD305
     I                                       16  18 XD306
     I                                       19  21 XD307
     I                                       22  24 XD308
     I                                       25  27 XD309
     I                                       28  30 XD310
     I                                       31  33 XD311
     I                                       34  36 XD312
     I                                       37  39 XD313
     I                                       40  42 XD314
     I                                       43  45 XD315
     I                                       46  48 XD316
     I                                       49  51 XD317
     I                                       52  54 XD318
     I                                       55  57 XD319
     I                                       58  60 XD320
     I                                       61  63 XD321
     I                                       64  66 XD322
     I                                       67  69 XD323
     I                                       70  72 XD324
     I                                       73  75 XD325
     I                                       76  78 XD326
     I                                       79  81 XD327
     I                                       82  84 XD328
     I                                       85  87 XD329
     I                                       88  90 XD330
     I                                       91  93 XD331
     I                                       94  96 XD332
     I                                       97  99 XD333
     I                                      100 102 XD334
     I                                      103 105 XD335
     I                                      106 108 XD336
     I                                      109 111 XD337
     I                                      112 114 XD338
     I            DS
     I                                        1 114 XD4
     I                                        1   3 XD401
     I                                        4   6 XD402
     I                                        7   9 XD403
     I                                       10  12 XD404
     I                                       13  15 XD405
     I                                       16  18 XD406
     I                                       19  21 XD407
     I                                       22  24 XD408
     I                                       25  27 XD409
     I                                       28  30 XD410
     I                                       31  33 XD411
     I                                       34  36 XD412
     I                                       37  39 XD413
     I                                       40  42 XD414
     I                                       43  45 XD415
     I                                       46  48 XD416
     I                                       49  51 XD417
     I                                       52  54 XD418
     I                                       55  57 XD419
     I                                       58  60 XD420
     I                                       61  63 XD421
     I                                       64  66 XD422
     I                                       67  69 XD423
     I                                       70  72 XD424
     I                                       73  75 XD425
     I                                       76  78 XD426
     I                                       79  81 XD427
     I                                       82  84 XD428
     I                                       85  87 XD429
     I                                       88  90 XD430
     I                                       91  93 XD431
     I                                       94  96 XD432
     I                                       97  99 XD433
     I                                      100 102 XD434
     I                                      103 105 XD435
     I                                      106 108 XD436
     I                                      109 111 XD437
     I                                      112 114 XD438
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I                                        7  100SYY
     I                                       11  120SMM
      *----------------------------------------------------
      * MAIN ROUTINE
      *----------------------------------------------------
     C                     EXSR #INIT
      *
     C                     DO   *HIVAL
      *
     C                     EXFMTDSP01
     C                     MOVE *BLANK    XMSG
      * F1: EXIT
     C           *INKA     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      * ENTER KEY
     C                     EXSR #CHK1
     C           *IN85     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR #DSP2
     C                     MOVE *BLANK    XMSG
     C                     ELSE
     C**                   MOVELMSG,5     XMSG
     C                     EXSR #DSP2
     C                     MOVE *BLANK    XMSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * CHECK YEAR/MONTH
      *----------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     MOVE *OFF      *IN43
     C                     MOVE *OFF      *IN85
      *
     C           XYEAR     IFEQ 0
     C           XMON      OREQ 0
     C                     SETON                     414285
     C                     MOVELMSG,1     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XYEAR     IFLE 1997
     C           XYEAR     ORGE 3000
     C                     SETON                     41  85
     C                     MOVELMSG,2     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XMON      IFLE 0
     C           XMON      ORGE 13
     C                     SETON                     42  85
     C                     MOVELMSG,3     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * CHECK CALENDAR
     C                     OPEN AGDPL12
     C                     Z-ADDXYEAR     K#YY
     C                     Z-ADDXMON      K#MM
     C                     Z-ADD01        K#DD
     C           K#AG1A    CHAINAGDPL12              99
      *
     C                     CLOSEAGDPL12
      *
     C           *IN99     IFEQ *ON
     C                     SETON                     414285
     C                     MOVELMSG,4     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * SELECTION
     C           XCAL      IFNE '1'
     C           XCAL      ANDNE'2'
     C           XCAL      ANDNE'3'
     C           XCAL      ANDNE'4'
     C                     SETON                     43  85
     C                     MOVELMSG,6     XMSG
     C                     GOTO XCHK1
     C                     ENDIF
      * IF NO ERROR...
     C                     Z-ADDXYEAR     @YEAR   40
     C                     Z-ADDXMON      @MONTH  20
     C                     EXSR #SET1
      *
     C           XCHK1     ENDSR
      *--------------------------------------*
      * SCREEN 2                             *
      *--------------------------------------*
     C           #DSP2     BEGSR
      *
     C           #BEG2     TAG
     C                     EXFMTDSP02
      *
     C                     SELEC
      * PAGE/UP  (BACK)
     C           *IN51     WHEQ *ON
     C           *INKH     OREQ *ON
     C                     MOVEL@YEAR     $DT6
     C                     MOVE @MONTH    $DT6
     C                     MOVE '-'       $SIGN
     C                     MOVE '07'      $MON
     C                     CALL 'UTLR25'
     C                     PARM           $DT6    6
     C                     PARM           $SIGN   1
     C                     PARM           $MON    2
     C                     PARM           $TGT6   6
     C                     PARM           $RTN    1
     C                     MOVEL$TGT6     @YEAR
     C                     MOVE $TGT6     @MONTH
     C                     EXSR #SET1
     C                     GOTO #BEG2
      * PAGE/DOWN (NEXT)
     C           *IN52     WHEQ *ON
     C           *INKI     OREQ *ON
     C                     MOVEL@YEAR     $DT6
     C                     MOVE @MONTH    $DT6
     C                     MOVE '+'       $SIGN
     C                     MOVE '01'      $MON
     C                     CALL 'UTLR25'
     C                     PARM           $DT6    6
     C                     PARM           $SIGN   1
     C                     PARM           $MON    2
     C                     PARM           $TGT6   6
     C                     PARM           $RTN    1
     C                     MOVEL$TGT6     @YEAR
     C                     MOVE $TGT6     @MONTH
     C                     EXSR #SET1
     C                     GOTO #BEG2
      *
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------*
      * SET CALENDAR DATA                    *
      *--------------------------------------*
     C           #SET1     BEGSR
      * OVRDBF CALENDAR FILE
     C                     MOVELXCAL      IZ      10
     C                     MOVELCMD,IZ    P@CMD
     C                     Z-ADD60        P@LEN
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AGDPL12
      *
     C                     EXSR #CLR1
      * HEADER
     C                     SELEC
     C           XCAL      WHEQ '1'
     C                     MOVELMSG,11    XCALN
     C           XCAL      WHEQ '2'
     C                     MOVELMSG,12    XCALN
     C           XCAL      WHEQ '3'
     C                     MOVELMSG,13    XCALN
     C           XCAL      WHEQ '4'
     C                     MOVELMSG,14    XCALN
     C                     OTHER
     C                     MOVE *BLANK    XCALN
     C                     ENDSL
      * MONTH 01
     C                     Z-ADD1         @M      20
     C                     MOVE *ON       *IN81
     C                     EXSR #MON1
      * MONTH 02
     C                     ADD  1         @MONTH
     C           @MONTH    IFGE 13
     C                     SUB  12        @MONTH
     C                     ADD  1         @YEAR
     C                     ENDIF
     C                     ADD  1         @M
     C                     MOVE *ON       *IN82
     C                     EXSR #MON2
      * MONTH 03
     C                     ADD  1         @MONTH
     C           @MONTH    IFGE 13
     C                     SUB  12        @MONTH
     C                     ADD  1         @YEAR
     C                     ENDIF
     C                     ADD  1         @M
     C                     MOVE *ON       *IN82
     C                     EXSR #MON3
      * MONTH 04
     C                     ADD  1         @MONTH
     C           @MONTH    IFGE 13
     C                     SUB  12        @MONTH
     C                     ADD  1         @YEAR
     C                     ENDIF
     C                     ADD  1         @M
     C                     MOVE *ON       *IN82
     C                     EXSR #MON4
      *
     C                     CLOSEAGDPL12
      *
     C                     ENDSR
      *--------------------------------------*
      * SET DISPLAY DATA                     *
      *--------------------------------------*
     C           #MON1     BEGSR
      *
     C                     Z-ADD@MONTH    XYM,@M
     C                     MOVEL@YEAR     XYM,@M
     C                     Z-ADD0         XWK,@M
     C**                   MOVEALTR38     *IN,01
      * GET CALENDAR MASTER
     C                     Z-ADD@YEAR     K#YY
     C                     Z-ADD@MONTH    K#MM
     C                     Z-ADD01        K#DD
     C           K#AG1A    SETLLAGDPL12
     C                     DO   *HIVAL
     C           K#AG1B    READEAGDPL12                  98
     C   98                LEAVE
     C           F8KADD    IFEQ 1
     C                     Z-ADDF8YOBI    IX      20
     C                     ENDIF
     C                     ADD  1         IX
     C                     MOVELF8KADD    XD1,IX
     C           F8HIRU    IFEQ '*'
     C                     MOVE '*'       XD1,IX
     C                     ELSE
     C                     ADD  1         XWK,@M
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------*
      * SET DISPLAY DATA                     *
      *--------------------------------------*
     C           #MON2     BEGSR
      *
     C                     Z-ADD@MONTH    XYM,@M
     C                     MOVEL@YEAR     XYM,@M
     C                     Z-ADD0         XWK,@M
     C**                   MOVEALTR38     *IN,01
      * GET CALENDAR MASTER
     C                     Z-ADD@YEAR     K#YY
     C                     Z-ADD@MONTH    K#MM
     C                     Z-ADD01        K#DD
     C           K#AG1A    SETLLAGDPL12
     C                     DO   *HIVAL
     C           K#AG1B    READEAGDPL12                  98
     C   98                LEAVE
     C           F8KADD    IFEQ 1
     C                     Z-ADDF8YOBI    IX      20
     C                     ENDIF
     C                     ADD  1         IX
     C                     MOVELF8KADD    XD2,IX
     C           F8HIRU    IFEQ '*'
     C                     MOVE '*'       XD2,IX
     C                     ELSE
     C                     ADD  1         XWK,@M
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------*
      * SET DISPLAY DATA                     *
      *--------------------------------------*
     C           #MON3     BEGSR
      *
     C                     Z-ADD@MONTH    XYM,@M
     C                     MOVEL@YEAR     XYM,@M
     C                     Z-ADD0         XWK,@M
      * GET CALENDAR MASTER
     C                     Z-ADD@YEAR     K#YY
     C                     Z-ADD@MONTH    K#MM
     C                     Z-ADD01        K#DD
     C           K#AG1A    SETLLAGDPL12
     C                     DO   *HIVAL
     C           K#AG1B    READEAGDPL12                  98
     C   98                LEAVE
     C           F8KADD    IFEQ 1
     C                     Z-ADDF8YOBI    IX      20
     C                     ENDIF
     C                     ADD  1         IX
     C                     MOVELF8KADD    XD3,IX
     C           F8HIRU    IFEQ '*'
     C                     MOVE '*'       XD3,IX
     C                     ELSE
     C                     ADD  1         XWK,@M
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------*
      * SET DISPLAY DATA                     *
      *--------------------------------------*
     C           #MON4     BEGSR
      *
     C                     Z-ADD@MONTH    XYM,@M
     C                     MOVEL@YEAR     XYM,@M
     C                     Z-ADD0         XWK,@M
      * GET CALENDAR MASTER
     C                     Z-ADD@YEAR     K#YY
     C                     Z-ADD@MONTH    K#MM
     C                     Z-ADD01        K#DD
     C           K#AG1A    SETLLAGDPL12
     C                     DO   *HIVAL
     C           K#AG1B    READEAGDPL12                  98
     C   98                LEAVE
     C           F8KADD    IFEQ 1
     C                     Z-ADDF8YOBI    IX      20
     C                     ENDIF
     C                     ADD  1         IX
     C                     MOVELF8KADD    XD4,IX
     C           F8HIRU    IFEQ '*'
     C                     MOVE '*'       XD4,IX
     C                     ELSE
     C                     ADD  1         XWK,@M
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------*
      * CLEAR VALUES                         *
      *--------------------------------------*
     C           #CLR1     BEGSR
      *
     C                     MOVELMSG,1     LTR38  38
     C                     MOVEALTR38     *IN,01
     C                     SETOF                     818283
     C                     SETOF                     848586
      *
     C                     Z-ADD0         XYM
     C                     Z-ADD0         XWK
     C                     MOVEA*BLANK    XD1
     C                     MOVEA*BLANK    XD2
     C                     MOVEA*BLANK    XD3
     C                     MOVEA*BLANK    XD4
      *
     C                     ENDSR
      *-----------------------------------------
      * INITIAL SETTING
      *-----------------------------------------
     C           #INIT     BEGSR
      *
     C           K#AG1A    KLIST
     C                     KFLD           K#YY    40
     C                     KFLD           K#MM    20
     C                     KFLD           K#DD    20
      *
     C           K#AG1B    KLIST
     C                     KFLD           K#YY    40
     C                     KFLD           K#MM    20
      *
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C                     TIME           SDATE
     C                     Z-ADDSYY       XYEAR
     C                     Z-ADDSMM       XMON
     C                     MOVE '1'       XCAL
      * CLEAR INDICATORS
     C                     EXSR #CLR1
      *
     C                     ENDSR
** MSG(60A) .......2.........3.........4.........5.........6
ENTER YEAR/MONTH!                                            01
YEAR IS INVALID!                                             02
MONTH IS INVALID!                                            03
ENTERED YEAR/MONTH DOES NOT EXIST IN IAF CALENDAR MASTER!    04
PRESS F5 TO RUN...                                           05
SELECT 1 TO 4                                                06
                                                             07
                                                             08
                                                             09
00000000000000000000000000000000000000                       10
IAF PRODUCTION                                               11
IAF FORECAST                                                 12
ASJ CALENDAR                                                 13
REGULAR                                                      14
                                                             15
** CMD(60A) .......2.........3.........4.........5.........6
OVRDBF FILE(AGDPL12) TOFILE(HFILE1/AGDPL12)                  1.IAF PRODUCTION
OVRDBF FILE(AGDPL12) TOFILE(HFILE1/A@DPL12)                  2.IAF FORECAST
OVRDBF FILE(AGDPL12) TOFILE(HFILE1/A#DPL12)                  3.ASJ
OVRDBF FILE(AGDPL12) TOFILE(HFILE1/A$DPL12)                  4.REGULAR
