     H            Y.
     F** AGGR05 **************************
     F*  ..自動ＳＮＤＮＥＴＳＰＬＦ..  *
     F*     I-HASADA      2000.12.11     *
     F**************** COPY FROM AGGR01 **
     FAGGWP05 IP  F     150            DISK
     IAGGWP05 AA  01
     I                                        3  12 SPLF
     I                                       96 101 JOBNAM
     I                                       14  18 JOBUSR
     I                                       85  92 JOBNBR
     I                                       76  79 SPLNBR
     I                                       37  39 STS
     I                                       85  95 WS
     I            DS
     I                                        1  10 INQ
      *
     C           SPLF      IFEQ 'GDGPR13'
     C           SPLF      OREQ 'GDIPR13'
      *
     C           STS       IFEQ 'HLD'
      *
     C                     MOVEL'V0002'   INQ
      *
     C                     CALL 'AGGC06'
     C                     PARM           INQ
     C                     PARM           SPLF
     C                     PARM           JOBNAM
     C                     PARM           JOBUSR
     C                     PARM           JOBNBR
     C                     PARM           SPLNBR
      *
     C                     END
     C                     END
