     H            Y.
     F** AGIR23 *********************************************
     F* A-PICS SORT                                         *
     F*    ITS.             2013.11.25                      *
     F*******************************************************
     FAGIWP30 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FAGIPP21 O   E                    DISK                      A
     E                    JN         99  3 0
     E                    CDBI       24  2 0             ﾍﾞ] xb     (ncﾆﾞl)
      *
     I            DS
     I                                        1  48 CDBI
     I                                        1   20CDBI01
     I                                        3   40CDBI02
     I                                        5   60CDBI03
     I                                        7   80CDBI04
     I                                        9  100CDBI05
     I                                       11  120CDBI06
     I                                       13  140CDBI07
     I                                       15  160CDBI08
     I                                       17  180CDBI09
     I                                       19  200CDBI10
     I                                       21  220CDBI11
     I                                       23  240CDBI12
     I                                       25  260CDBI13
     I                                       27  280CDBI14
     I                                       29  300CDBI15
     I                                       31  320CDBI16
     I                                       33  340CDBI17
     I                                       35  360CDBI18
     I                                       37  380CDBI19
     I                                       39  400CDBI20
     I                                       41  420CDBI21
     I                                       43  440CDBI22
     I                                       45  460CDBI23
     I                                       47  480CDBI24
      *
     I            DS
     I                                        1   40HHMM1
     I                                        1   20HH1
     I                                        3   40MM1
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
     I                                        7  100SDATEY
     I                                       11  120SDATEM
     I                                       12  140SDATED
     I                                        1   20STIMEH
     I                                        3   40STIMEM
     I                                        5   60STIMES
      *
     I            DS
     I                                        1  100WKDB
     I                                        1   80WKDATE
     I                                        9  100WKBIN
      *
     I            DS
     I                                        1   60HMS
     I                                        1   20HH
     I                                        3   40MM
     I                                        5   60SS
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           F04     4
      *
     C                     TIME           WTIME
     C                     Z-ADD0         HMS
     C                     MOVELF04       HMS
     C                     Z-ADD1         I       50
      *
     C                     Z-ADD0         WKTOHZ  80
     C                     Z-ADD0         WKYOHZ  80
     C                     Z-ADD0         WKCIBI  20
     C                     MOVELF04       HHMM1
     C           0111      CHAINAAIPL111             44
     C           *IN44     IFEQ '0'
     C                     Z-ADDCDTOHZ    WKTOHZ
     C                     Z-ADDCDYOHZ    WKYOHZ
     C                     Z-ADDCDCIBI    WKCIBI
     C                     MOVE CDBI,HH1  I
     C                     ENDIF
      *
     C                     READ AGIWP301                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ AGIWP301                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * LAST SEQ                                           *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAGIPP211
     C                     Z-ADDSDATE     D#KOHZ
     C                     Z-ADDSTIME     D#KOTI
     C                     MOVELW#USER    D#KOME
     C                     Z-ADDWKTOHZ    D#CRHZ
     C                     Z-ADDI         D#CRBB
     C                     MOVELW0SHN1    D#SHN1
     C                     MOVELW0SHN2    D#SHN2
     C                     MOVELW0SHN3    D#SHN3
     C                     Z-ADDW0HAKO    D#HAKO
     C                     Z-ADDW0BARL    D#BARL
     C                     Z-ADDW0CIBI    D#CIBI
     C                     MOVELW0SORT    D#SORT
     C                     MOVELW0K001    D#K001
     C                     MOVELW0K002    D#K002
     C                     MOVELW0K003    D#K003
     C                     MOVELW0K004    D#K004
     C                     MOVELW0K005    D#K005
     C                     MOVELW0K006    D#K006
     C                     MOVELW0K007    D#K007
     C                     MOVELW0K008    D#K008
     C                     MOVELW0K009    D#K009
     C                     MOVELW0K010    D#K010
     C                     MOVELW0MS01    D#MS01
     C                     MOVELW0MS02    D#MS02
     C                     MOVELW0MS03    D#MS03
     C                     MOVELW0MS04    D#MS04
     C                     MOVELW0MS05    D#MS05
     C                     MOVELW0MS06    D#MS06
     C                     MOVELW0MS07    D#MS07
     C                     MOVELW0MS08    D#MS08
     C                     MOVELW0MS09    D#MS09
     C                     MOVELW0MS10    D#MS10
     C                     Z-ADDW0GEKN    D#GEKN
     C                     Z-ADDW0SYUY    D#SYUY
     C                     Z-ADDW0GEKH    D#GEKH
     C                     WRITEAGIPP211
      *
     CSR         ESB500    ENDSR
