     H            Y.
     F** AGIR15 *********************************************
     F* A-PICS SORT                                         *
     F*    ITS.             2013.11.25                      *
     F*******************************************************
     FAGIWP30 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FAGIWP31 O   E                    DISK                      A
     FAGIPP41 IF  E                    DISK
     FAGIPL51 UF  E           K        DISK                      A
     FAGIPP31 IF  E           K        DISK
     E                    CDBI       24  2 0             ﾍﾞ] xb     (ncﾆﾞl)
     E                    KAI        99  3 0
      *
     I            DS
     I                                        1  48 CDBI
     I                                        1   20CDBI01
     I                                        3   40CDBI02
     I                                        5   60CDBI03
     I                                        7   80CDBI04
     I                                        9  100CDBI05
     I                                       11  120CDBI06
     I                                       13  140CDBI07
     I                                       15  160CDBI08
     I                                       17  180CDBI09
     I                                       19  200CDBI10
     I                                       21  220CDBI11
     I                                       23  240CDBI12
     I                                       25  260CDBI13
     I                                       27  280CDBI14
     I                                       29  300CDBI15
     I                                       31  320CDBI16
     I                                       33  340CDBI17
     I                                       35  360CDBI18
     I                                       37  380CDBI19
     I                                       39  400CDBI20
     I                                       41  420CDBI21
     I                                       43  440CDBI22
     I                                       45  460CDBI23
     I                                       47  480CDBI24
      *
     I            DS
     I                                        1   40HHMM1
     I                                        1   20HH1
     I                                        3   40MM1
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
     I                                        7  100SDATEY
     I                                       11  120SDATEM
     I                                       12  140SDATED
     I                                        1   20STIMEH
     I                                        3   40STIMEM
     I                                        5   60STIMES
      *
     I            DS
     I                                        1   60HMS
     I                                        1   20HH
     I                                        3   40MM
     I                                        5   60SS
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           F04     4
      *
     C                     TIME           WTIME
     C                     Z-ADD0         HMS
     C                     MOVELF04       HMS
     C                     Z-ADD1         I       50
      *
     C                     Z-ADD0         WKHI    81
     C           1         SETLLAGIPP411
     C                     READ AGIPP411                 28
     C           *IN28     IFEQ '0'
     C                     Z-ADDE#HI      WKHI
     C                     ELSE
     C                     Z-ADD0         WKHI
     C                     ENDIF
      *
     C                     Z-ADD0         WKTOHZ  80
     C                     Z-ADD0         WKYOHZ  80
     C                     Z-ADD0         WKCIBI  20
     C                     MOVELF04       HHMM1
     C           0111      CHAINAAIPL111             44
     C           *IN44     IFEQ '0'
     C                     Z-ADDCDTOHZ    WKTOHZ
     C                     Z-ADDCDYOHZ    WKYOHZ
     C                     Z-ADDCDCIBI    WKCIBI
     C                     MOVE CDBI,HH1  I
     C                     ENDIF
      *
     C                     READ AGIWP301                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB400
     C                     READ AGIWP301                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C                     Z-ADD0         W0HI    81
     C           W0GEKH    DIV  20        W0HI
     C           W0HI      IFLT WKHI
     C                     MOVEL'1'       GET
     C                     ENDIF
      *
     C           GET       IFEQ '1'
     C                     EXSR #SB450
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB450    BEGSR
      *
     C           W0BARL    IFEQ 0
     C                     Z-ADD0         X       30
     C                     ELSE
     C           W0HAKO    DIV  W0BARL    X       30
     C                     ENDIF
      *
     C                     EXSR #SB470
     C                     EXSR #SB453
      *
     C                     Z-ADD1         Y       30
     C           Y         DOWLEX
     C                     EXSR #SB460
     C                     Z-ADDW0BARL    ##HAKO  50
     C           ##BIN     IFGE I
     C                     Z-ADDWKTOHZ    ##APHZ  80
     C                     MOVEL'0'       ##FLG   1
     C                     ELSE
     C                     Z-ADDWKYOHZ    ##APHZ  80
     C                     MOVEL'1'       ##FLG   1
     C                     ENDIF
     C                     Z-ADD##BIN     ##APBB  20
     C                     EXSR #SB451
     C                     EXSR #SB550
     C                     EXSR #SB452
     C                     EXSR #SB453
     C                     ADD  1         Y
     C                     ENDDO
      *
     CSR         ESB450    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB451    BEGSR
      *
     C                     CLEARAGIWP311
     C                     MOVELW0SHN1    W#SHN1
     C                     MOVELW0SHN2    W#SHN2
     C                     MOVELW0SHN3    W#SHN3
     C                     Z-ADD##APHZ    W#APHZ
     C                     Z-ADD##APBB    W#APBB
     C                     Z-ADD##HAKO    W#HAKO
     C                     MOVEL'0'       W#SITE
     C                     MOVEL##FLG     W#FLG
     C                     WRITEAGIWP311
      *
     CSR         ESB451    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB452    BEGSR
      *
     C                     Z-ADD##APBB    AA      30
     C                     ADD  ##HAKO    KAI,AA
      *
     CSR         ESB452    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB453    BEGSR
      *
     C                     Z-ADD*HIVAL    MIN     30
     C                     Z-ADD1         AA
     C           AA        DOWLEWKCIBI
     C           KAI,AA    IFLT MIN
     C                     Z-ADDKAI,AA    MIN
     C                     ENDIF
     C                     ADD  1         AA
     C                     ENDDO
      *
     CSR         ESB453    ENDSR
      *----------------------------------------------------*
      * BIN                                                *
      *----------------------------------------------------*
     CSR         #SB460    BEGSR
      *
     C           KEYF#2    KLIST
     C                     KFLD           KKAPHZ  80
     C                     KFLD           KKAPBB  20
     C                     KFLD           W0SORT
     C                     Z-ADDWKTOHZ    KKAPHZ
     C                     Z-ADDI         KKAPBB
     C                     Z-ADDWKCIBI    WKKEIS  20
      *
     C                     Z-ADDI         ##BIN   20
     C                     Z-ADD*HIVAL    MNHAKO  81
     C                     Z-ADD1         ##Z     30
     C           ##Z       DOWLEWKCIBI
     C                     EXSR #SB461
     C                     ADD  1         KKAPBB
     C           KKAPBB    IFGT WKCIBI
     C                     Z-ADDWKYOHZ    KKAPHZ
     C                     Z-ADD1         KKAPBB
     C                     ENDIF
     C                     ADD  1         ##Z
     C                     SUB  1         WKKEIS
     C                     ENDDO
      *
     CSR         ESB460    ENDSR
      *----------------------------------------------------*
      * BIN                                                *
      *----------------------------------------------------*
     CSR         #SB461    BEGSR
      *
     C                     Z-ADD0         ZZHAKO  70
     C           KEYF#2    CHAINAGIPL511             27
     C           *IN27     IFEQ '0'
     C                     Z-ADDF#HAKO    ZZHAKO
     C                     ELSE
     C                     Z-ADD0         ZZHAKO
     C                     ENDIF
      *
     C                     Z-ADD0         KEIS    72
     C                     Z-ADD0         HAKO    81
     C           WKKEIS    IFNE 0
     C           WKCIBI    DIV  WKKEIS    KEIS
     C                     ENDIF
     C                     Z-ADD1         KEIS
     C           ZZHAKO    MULT KEIS      HAKO
      *
     C                     Z-ADDKKAPBB    AA      30
     C           HAKO      IFLT MNHAKO
     C           KAI,AA    ANDEQMIN
     C                     Z-ADDHAKO      MNHAKO
     C                     Z-ADDKKAPBB    ##BIN
     C                     ENDIF
      *
     CSR         ESB461    ENDSR
      *----------------------------------------------------*
      * BIN                                                *
      *----------------------------------------------------*
     CSR         #SB470    BEGSR
      *
     C           KEYC#     KLIST
     C                     KFLD           W0SHN1
     C                     KFLD           W0SHN2
     C                     KFLD           W0SHN3
     C                     KFLD           KKAPHZ  80
     C                     KFLD           KKAPBB  20
     C                     Z-ADDWKTOHZ    KKAPHZ
     C                     Z-ADDI         KKAPBB
      *
     C                     CLEARKAI
     C                     Z-ADD0         MIN     30
     C                     Z-ADD1         ##Z     30
     C           ##Z       DOWLEWKCIBI
     C                     EXSR #SB471
     C                     ADD  1         KKAPBB
     C           KKAPBB    IFGT WKCIBI
     C                     Z-ADDWKYOHZ    KKAPHZ
     C                     Z-ADD1         KKAPBB
     C                     ENDIF
     C                     ADD  1         ##Z
     C                     ENDDO
      *
     CSR         ESB470    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB471    BEGSR
      *
     C           KEYC#     SETLLAGIPP311
     C           KEYC#     READEAGIPP311                 49
     C           *IN49     DOWEQ'0'
     C           C#SKJY    IFEQ 'D'
     C           C#SKHZ    ANDLESDATE
     C                     ELSE
     C                     Z-ADDC#APBB    AA      30
     C                     ADD  C#HAKO    KAI,AA
     C                     ENDIF
     C           KEYC#     READEAGIPP311                 49
     C                     ENDDO
      *
     CSR         ESB471    ENDSR
      *----------------------------------------------------*
      * TOTAL BOX                                          *
      *----------------------------------------------------*
     CSR         #SB550    BEGSR
      *
     C           KEYF#     KLIST
     C                     KFLD           ##APHZ
     C                     KFLD           ##APBB
     C                     KFLD           W0SORT
     C           KEYF#     CHAINAGIPL511             27
     C           *IN27     IFEQ '0'
     C                     ADD  ##HAKO    F#HAKO
     C                     UPDATAGIPL511
     C                     ELSE
     C                     CLEARAGIPL511
     C                     Z-ADDSDATE     F#KOHZ
     C                     Z-ADDSTIME     F#KOTI
     C                     MOVELW#USER    F#KOME
     C                     Z-ADDWKTOHZ    F#CRHZ
     C                     Z-ADDI         F#CRBB
     C                     Z-ADD##APHZ    F#APHZ
     C                     Z-ADD##APBB    F#APBB
     C                     MOVELW0SORT    F#SORT
     C                     Z-ADD##HAKO    F#HAKO
     C                     MOVELW0K001    F#K001
     C                     MOVELW0K002    F#K002
     C                     MOVELW0K003    F#K003
     C                     MOVELW0K004    F#K004
     C                     MOVELW0K005    F#K005
     C                     MOVELW0K006    F#K006
     C                     MOVELW0K007    F#K007
     C                     MOVELW0K008    F#K008
     C                     MOVELW0K009    F#K009
     C                     MOVELW0K010    F#K010
     C                     MOVELW0MS01    F#MS01
     C                     MOVELW0MS02    F#MS02
     C                     MOVELW0MS03    F#MS03
     C                     MOVELW0MS04    F#MS04
     C                     MOVELW0MS05    F#MS05
     C                     MOVELW0MS06    F#MS06
     C                     MOVELW0MS07    F#MS07
     C                     MOVELW0MS08    F#MS08
     C                     MOVELW0MS09    F#MS09
     C                     MOVELW0MS10    F#MS10
     C                     WRITEAGIPL511
     C                     ENDIF
      *
     CSR         ESB550    ENDSR
