     H            Y.
     F** AGJR07 **************************************
     F* UPDATE A-PICS SORT M/F                       *
     F*        ITS.         2013.11.25               *
     F************************************************
     FAGJWP01 IF  E           K        DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P9SORT  5
     C                     PARM           P9BLK   2
     C                     PARM           P9BLK2  2
     C                     PARM           P9STS   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     MOVE P9SORT    WKSORT  50
     C                     MOVEL'0'       P9STS
     C                     READ AGJWP011                 20
     C           *IN20     DOWEQ'0'
     C           P9BLK2    IFEQ W1BLK
     C           P9BLK     OREQ W1BLK2
     C           WKSORT    IFNE W1SORT
     C                     MOVEL'9'       P9STS
     C                     ENDIF
     C                     ENDIF
     C                     READ AGJWP011                 20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
