     H            Y.
     F** AGJR90 **************************************
     F* UPDATE   LOCATION M/F                        *
     F*        ITS.         2013.12.05               *
     F************************************************
     FADAPL62 UF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
      *
     I            DS
     I                                        1   6 W2BAN
     I                                        1   1 W2BAN1
     I                                        2   3 W2BAN2
     I                                        4   5 W2BAN3
     I                                        6   6 W2BAN4
      *
     I            DS
     I                                        1   80W2CHHZ
     I                                        1   40W2CHYY
     I                                        5   60W2CHMM
     I                                        7   80W2CHDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C                     READ ADAPL621                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB400
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------*
      *                                        *
      *----------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB410
     C                     READ ADAPL621                 80
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------*
      *                                        *
      *----------------------------------------*
     CSR         #SB410    BEGSR
      *
     C           KEYAJ1    KLIST
     C                     KFLD           W2BAN1  1
     C                     KFLD           W2BAN2  2
     C                     KFLD           W2BAN3  2
     C                     KFLD           W2BAN4  1
     C                     KFLD           W2CHYY
     C                     KFLD           W2CHMM
     C                     KFLD           W2CHDD
     C                     KFLD           W2CHBI
     C*
     C                     MOVEL*BLANK    DABLOK
     C                     MOVEL*BLANK    DASORT
     C                     MOVEL*BLANK    W2BAN
     C                     MOVEL'00'      DABLOK
     C                     MOVEL000       DASORT
     C                     MOVELDABAN2    W2BAN
     C                     Z-ADD99999999  W2CHHZ  80
     C                     Z-ADD99        W2CHBI  20
     C           KEYAJ1    CHAINAAJPL111             20
     C           *IN20     IFEQ '0'
     C                     MOVELCJBLK1    DABLOK
     C                     MOVE CJBLK2    DABLOK
     C                     Z-ADDCJBLK3    DASORT
     C                     UPDATADAPL621
     C                     ENDIF
      *
     CSR         ESB410    ENDSR
