     H            Y.
     F** AGJR94 **************************************
     F* UPDATE   LOCATION M/F                        *
     F*        ITS.         2013.12.05               *
     F************************************************
     FAGJPP01 IF  E           K        DISK
      *
     I            DS
     I                                        1   2 ##BLK
     I                                        1   1 ##BLK1
     I                                        2   2 ##BLK2
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C                     TIME           WTIME
     C                     READ AGJPP011                 80
     C           *IN80     DOWEQ'0'
     C           CISKJY    IFEQ 'D'
     C           CISKHZ    ANDLESDATE
     C                     ELSE
     C           CIBLK2    IFNE *BLANK
     C                     EXSR #SB400
     C                     ENDIF
     C                     ENDIF
     C                     READ AGJPP011                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------*
      *                                        *
      *----------------------------------------*
     CSR         #SB400    BEGSR
      *
     C                     Z-ADD1000      #1BLK3  40
     C                     Z-ADD0         #2BLK3  40
      *
     C                     MOVEL'1'       WKBAN1  1
     C                     Z-ADD1         BAN3    20
     C                     Z-ADD1         X       30
     C           X         DOWLE99
     C                     MOVELCIBLK     WKBAN2  2
     C                     MOVELBAN3      WKBAN3  2
     C                     EXSR #SB420
     C                     MOVELCIBLK2    WKBAN2  2
     C                     MOVELBAN3      WKBAN3  2
     C                     EXSR #SB420
     C                     ADD  1         BAN3
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------*
      *                                        *
      *----------------------------------------*
     CSR         #SB420    BEGSR
      *
     C                     MOVE CISORT    PPSORT
     C                     MOVELCISITE    PPSITE
     C                     MOVELWKBAN1    PPBAN1
     C                     MOVELWKBAN2    PPBAN2
     C                     MOVELWKBAN3    PPBAN3
     C                     MOVE #1BLK3    P1BLK3
     C                     MOVE #2BLK3    P2BLK3
     C                     CALL 'AGJR93'
     C                     PARM           PPSORT  5
     C                     PARM           PPSITE  1
     C                     PARM           PPBAN1  1
     C                     PARM           PPBAN2  2
     C                     PARM           PPBAN3  2
     C                     PARM           P1BLK3  4
     C                     PARM           P2BLK3  4
     C                     MOVE P1BLK3    #1BLK3
     C                     MOVE P2BLK3    #2BLK3
      *
     CSR         ESB420    ENDSR
