     H            Y.
     F** AGJR43 **********************************
     F* INQ #OF A-PICS KANBAN (GROUPING CSV)
     F*     SAKAKI.        2019.10.23            *
     F********************************************
     FAGJWP40 IF  E           K        DISK
     FAGJWP41 IF  E           K        DISK
     FAGJWP42 IF  E           K        DISK
     FAGJWP43 O   F     512            DISK                      A
     E                    GR         99  3
     E                    MS         99  5 0
      *
     I            DS
     I                                        1  100W1AP
     I                                        1   80W1APHZ
     I                                        9  100W1APBN
      *
     I            DS
     I                                        1  100W2AP
     I                                        1   80W2APHZ
     I                                        9  100W2APBN
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C           *ENTRY    PLIST
     C                     PARM           P1DATA  1
      *
     C                     EXSR #SB100
     C                     EXSR #SB110
     C                     READ AGJWP41                  80
     C           *IN80     DOWEQ'0'
     C                     CLEARMS
     C                     EXSR #SB400
     C                     EXSR #SB410
     C                     READ AGJWP41                  80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-------------------------------*
      *
      *-------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     Z-ADD0         X       30
     C                     READ AGJWP40                  80
     C           *IN80     DOWEQ'0'
     C                     ADD  1         X
     C                     MOVELW0GROP    GR,X
     C                     READ AGJWP40                  80
     C                     ENDDO
     C                     Z-ADDX         MAX     30
      *
     CSR         ESB100    ENDSR
      *-------------------------------*
      *
      *-------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     MOVEL*BLANK    W@TXT 256
     C                     Z-ADD1         X       30
     C           X         DOWLE99
     C           GR,X      IFEQ '999'
     C           W@TXT     CAT  'OTH':0   W@TXT
     C                     ELSE
     C           W@TXT     CAT  GR,X:0    W@TXT
     C                     ENDIF
     C           W@TXT     CAT  ',':0     W@TXT
     C                     ADD  1         X
     C                     ENDDO
     C                     EXCPTOHED
      *
     CSR         ESB110    ENDSR
      *-------------------------------*
      *
      *-------------------------------*
     CSR         #SB400    BEGSR
      *
     C           *LOVAL    SETLLAGJWP42
     C                     READ AGJWP42                  82
     C           *IN82     DOWEQ'0'
     C           W2AP      IFEQ W1AP
     C                     Z-ADD1         X
     C           W2GROP    LOKUPGR,X                     29
     C           *IN29     IFEQ '1'
     C                     ADD  W2MAIS    MS,X
     C                     ENDIF
     C                     ENDIF
     C                     READ AGJWP42                  82
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *-------------------------------*
      *
      *-------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     MOVEL*BLANK    W@TXT 256
     C                     Z-ADD1         X       30
     C           X         DOWLEMAX
     C                     MOVE MS,X      W@MAIS  5
     C           W@TXT     CAT  W@MAIS:0  W@TXT
     C           W@TXT     CAT  ',':0     W@TXT
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     SELEC
     C           P1DATA    WHEQ '3'
     C           P1DATA    OREQ '5'
     C                     EXCPTODAT1
     C           P1DATA    WHEQ '4'
     C           P1DATA    OREQ '6'
     C                     EXCPTODAT2
     C                     ENDSL
      *
     CSR         ESB410    ENDSR
      ******************************************************
     OAGJWP43 EADD             OHED
     O                                      'DATE/GROUP,'
     O                         W@TXT
     O        EADD             ODAT1
     O                         W1APHZ
     O                                      ','
     O                         W@TXT
     O        EADD             ODAT2
     O                         W1APHZ
     O                                      '-'
     O                         W1APBN
     O                                      ','
     O                         W@TXT
