     H            Y.
     F** AGJR04 **************************************
     F* UPDATE A-PICS SORT M/F                       *
     F*        ITS.         2013.11.25               *
     F************************************************
     FAGJWP01 IF  E           K        DISK
     FAGJPL02 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     READ AGJWP011                 80
     C           *IN80     DOWEQ'0'
     C           W1SORT    CHAINAGJPL021             20
     C                     MOVEL*BLANK    CISKJY
     C                     Z-ADD0         CISKHZ
     C                     Z-ADD*DATE     CIKOHZ
     C                     TIME           CIKOTI
     C                     MOVELW#USER    CIKOME
     C                     MOVELW1SORT    CISORT
     C                     MOVELW1BLK     CIBLK
     C                     MOVELW1BLK2    CIBLK2
     C                     MOVELW1SITE    CISITE
     C           *IN20     IFEQ '0'
     C                     UPDATAGJPL021
     C                     ELSE
     C                     WRITEAGJPL021
     C                     ENDIF
     C                     READ AGJWP011                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
