     H            Y.
     F** AGJR27 **************************************
     F* DUPLICATE ERR CHECK                          *
     F*      IWATA.         2018.04.19               *
     F************************************************
     FAGJWP20 IF  E           K        DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P9NO    5
     C                     PARM           P9BLK   1
     C                     PARM           P9BLK2  2
     C                     PARM           P9STS   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     MOVE P9NO      WKNO    50
     C                     MOVEL'0'       P9STS
     C                     READ AGJWP201                 20
     C           *IN20     DOWEQ'0'
     C           P9BLK     IFEQ W1BLK
     C           P9BLK2    ANDEQW1BLK2
     C           WKNO      IFNE W1NO
     C                     MOVEL'9'       P9STS
     C                     ENDIF
     C                     ENDIF
      *
     C                     READ AGJWP201                 20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
