     H            Y.
     F** AGJR03 **************************************
     F* UPDATE A-PICS SORT M/F                       *
     F*        ITS.         2013.11.25               *
     F************************************************
     FAGJPL01 IF  E           K        DISK
     FAGJWP01 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     Z-ADD1         WKSORT  50
     C           WKSORT    DOWLE999
     C                     MOVELWKSORT    W1SORT
     C                     WRITEAGJWP011
     C                     ADD  1         WKSORT
     C                     ENDDO
      *
     C                     READ AGJPL011                 80
     C           *IN80     DOWEQ'0'
     C           CISKJY    IFEQ 'D'
     C           CISKHZ    ANDLE*DATE
     C                     ELSE
     C           CISORT    CHAINAGJWP011             20
     C           *IN20     IFEQ '0'
     C                     MOVELCISORT    W1SORT
     C                     MOVELCIBLK     W1BLK
     C                     MOVELCIBLK2    W1BLK2
     C                     MOVELCISITE    W1SITE
     C                     UPDATAGJWP011
     C                     ENDIF
     C                     ENDIF
     C                     READ AGJPL011                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
