     H            Y.
     F** AGKR01 *********************************************
     F* KANBAN MAINTENANCE BZ                               *
     F*    ITS.             2013.12.24                      *
     F*******************************************************
     FAGKPW01 CF  E                    WORKSTN
     FAGKPP01 UF  E           K        DISK                      A
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              'BZ        '          C         KKPROC
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD0         D1TM01
     C                     Z-ADD0         D1TM02
     C                     Z-ADD0         D1TM03
     C                     Z-ADD0         D1TM04
     C                     Z-ADD0         D1TM05
     C                     Z-ADD0         D1TM06
     C                     Z-ADD0         D1TM07
     C                     Z-ADD0         D1TM08
     C                     Z-ADD0         D1TM09
     C                     Z-ADD0         D1TM10
     C                     Z-ADD0         D1TM11
     C                     Z-ADD0         D1TOTL
     C                     TIME           WTIME
      *
     C                     MOVEL'0'       GET     1
     C           KKPROC    CHAINAGKPP011             80
     C           *IN80     IFEQ '0'
     C                     Z-ADDCITM01    D1TM01
     C                     Z-ADDCITM02    D1TM02
     C                     Z-ADDCITM03    D1TM03
     C                     Z-ADDCITM04    D1TM04
     C                     Z-ADDCITM05    D1TM05
     C                     Z-ADDCITM06    D1TM06
     C                     Z-ADDCITM07    D1TM07
     C                     Z-ADDCITM08    D1TM08
     C                     Z-ADDCITM09    D1TM09
     C                     Z-ADDCITM10    D1TM10
     C                     Z-ADDCITM11    D1TM11
     C                     ENDIF
     C                     Z-ADDD1TM01    D1TOTL
     C                     ADD  D1TM02    D1TOTL
     C                     ADD  D1TM03    D1TOTL
     C                     ADD  D1TM04    D1TOTL
     C                     ADD  D1TM05    D1TOTL
     C                     ADD  D1TM06    D1TOTL
     C                     ADD  D1TM07    D1TOTL
     C                     ADD  D1TM08    D1TOTL
     C                     ADD  D1TM09    D1TOTL
     C                     ADD  D1TM10    D1TOTL
     C                     ADD  D1TM11    D1TOTL
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAGKPW011
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     3099
      *
     C                     TIME           WTIME
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1TM01    MULT D1TM02    WK1440  50
     C           WK1440    IFNE 1440
     C                     SETON                     3099
     C                     MOVELER,1      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADDD1TM01    D1TOTL
     C                     ADD  D1TM02    D1TOTL
     C                     ADD  D1TM03    D1TOTL
     C                     ADD  D1TM04    D1TOTL
     C                     ADD  D1TM05    D1TOTL
     C                     ADD  D1TM06    D1TOTL
     C                     ADD  D1TM07    D1TOTL
     C                     ADD  D1TM08    D1TOTL
     C                     ADD  D1TM09    D1TOTL
     C                     ADD  D1TM10    D1TOTL
     C                     ADD  D1TM11    D1TOTL
     C                     EXSR #SB500
     C                     CALL 'AGKC02'
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * OUTPUT                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KKPROC    CHAINAGKPP011             80
     C                     CLEARAGKPP011
     C                     MOVELKKPROC    CIPROC
     C                     Z-ADDD1TM01    CITM01
     C                     Z-ADDD1TM02    CITM02
     C                     Z-ADDD1TM03    CITM03
     C                     Z-ADDD1TM04    CITM04
     C                     Z-ADDD1TM05    CITM05
     C                     Z-ADDD1TM06    CITM06
     C                     Z-ADDD1TM07    CITM07
     C                     Z-ADDD1TM08    CITM08
     C                     Z-ADDD1TM09    CITM09
     C                     Z-ADDD1TM10    CITM10
     C                     Z-ADDD1TM11    CITM11
     C           *IN80     IFEQ '0'
     C                     UPDATAGKPP011
     C                     ELSE
     C                     WRITEAGKPP011
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
**
ER-1 SET A ANSER = 1440 (MULTPLICATION).
