     H            Y.
     F** AH#R82 ********************************************
     F*  PRIORITY KANBAN LIST (WASHER)                     *
     F*                                                    *
     F* TCHK1 10/04/06 CREATE                              *
     F* TCHK2 02/27/07 ADD TOTAL WHEN MULTI ITEM           *
     F******************************************************
     FABBPL71 IF  E           K        DISK
     FAH#PL71 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FFCEPL11 IF  E           K        DISK
     FAKBPL03 IF  E           K        DISK
     FAKBPL07 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAH#WP82 UF  E           K        DISK                      A
     FAH#WL82 IF  E           K        DISK
     F            AH#WP821                          KRENAMEAH#WL821
     FQPRINT  O   F     132     OF     PRINTER
     E*-----------------------------------------------------
     E                    ASJ     1   1 15
     E*-----------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1   80W@YMD
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1   80BADAT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80K@NODT
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8DAT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1  12 A2KOS1
     I                                        1   5 A21HB5
     I                                        6  10 A22HB5
     I                                       11  12 A23HB2
     I            DS
     I                                        1  12 A2KOS2
     I                                        1   5 A24HB5
     I                                        6  10 A25HB5
     I                                       11  12 A26HB2
     I            DS
     I                                        1  12 A2KOS3
     I                                        1   5 A27HB5
     I                                        6  10 A28HB5
     I                                       11  12 A29HB2
     I            DS
     I                                        1  12 A2KOS4
     I                                        1   5 A210H5
     I                                        6  10 A211H5
     I                                       11  12 A212H2
     I            DS
     I                                        1  14 PRWPRT
     I                                        1   5 PRWPR1
     I                                        6   6 PRWPR2
     I                                        7  11 PRWPR3
     I                                       12  12 PRWPR4
     I                                       13  14 PRWPR5
     I            DS
     I                                        1   9 PRWLOC
     I                                        1   1 PRWLC1
     I                                        2   2 PRWLC2
     I                                        3   4 PRWLC3
     I                                        5   5 PRWLC4
     I                                        6   7 PRWLC5
     I                                        8   8 PRWLC6
     I                                        9   9 PRWLC7
     I            DS
     I                                        1  14 PRPART
     I                                        1   5 PRPAR1
     I                                        6   6 PRPAR2
     I                                        7  11 PRPAR3
     I                                       12  12 PRPAR4
     I                                       13  14 PRPAR5
     I            DS
     I                                        1   9 PRLOC
     I                                        1   1 PRLO1
     I                                        2   2 PRLO2
     I                                        3   4 PRLO3
     I                                        5   5 PRLO4
     I                                        6   7 PRLO5
     I                                        8   8 PRLO6
     I                                        9   9 PRLO7
     I            DS
     I                                        1  22 W@NP
     I                                        1   4 AWWSPL
     I                                        5   5 AWWLC1
     I                                        6   7 AWWLC2
     I                                        8   9 AWWLC3
     I                                       10  10 AWWLC4
     I                                       11  15 AWWPT1
     I                                       16  20 AWWPT2
     I                                       21  22 AWWPT3
     I            DS
     I                                        1   6 W@LOC
     I                                        1   1 W@LOC1
     I                                        2   3 W@LOC2
     I                                        4   5 W@LOC3
     I                                        6   6 W@LOC4
      *-----------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PDAT    8
      *-----------------------------------------------------
     C                     EXSR #MAIN
     C                     EXSR #OUT
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------
     C           K#71      KLIST
     C                     KFLD           W@YMD   80
     C                     KFLD           W@SHFT
     C           K#FCE     KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
     C           K#AGD     KLIST
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#AP70    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           @@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           @@ODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C           K#18      KLIST
     C                     KFLD           K@PRT1  5
     C                     KFLD           K@PRT2  5
     C                     KFLD           K@PRT3  2
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
     C*
     C                     MOVE PDAT      W@YMD   80
     C                     MOVE '2'       W@SHFT  1
     C           K#71      CHAINABBPL71              90
     C           *IN90     IFEQ *ON
     C                     MOVE '1'       W@SHFT
     C           K#71      CHAINABBPL71              90
     C                     ENDIF
     C*
     C           *IN90     IFEQ *ON
     C                     MOVE '3'       W@SHFT
     C                     ENDIF
     C*
     C                     MOVE *ALL'-'   @LINE 132
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     SETGTAGDPL121
     C           *IN90     DOUEQ*ON
     C                     READ AGDPL121                 90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C                     Z-ADDF8DAT     @NXDAY  80
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MAIN     BEGSR
     C*-----------------------------------------------------
     C*
     C           K#71      SETLLABBPL71
     C*
     C                     DO   *HIVAL
     C*
     C           K#71      READEABBPL71                  80
     C   80                LEAVE
     C           A7KQTY    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C                     MOVE A7PRT1    K@PRT1
     C                     MOVE A7PRT2    K@PRT2
     C                     MOVE A7PRT3    K@PRT3
     C*
     C                     MOVEL'Y'       W@AFLG  1
     C                     EXSR #MSUB
     C*
     C                     ENDDO
     C*
     C*-----------------------------------------------------
     C*
     C           W@YMD     SETLLAH#PL71
     C*
     C           *IN80     DOUEQ*ON
     C*
     C           W@YMD     READEAH#PL71                  80
     C   80                LEAVE
     C           AHINVQ    IFEQ *ZERO
     C                     ITER
     C                     END
     C*
     C                     MOVE AHPRT1    K@PRT1
     C                     MOVE AHPRT2    K@PRT2
     C                     MOVE AHPRT3    K@PRT3
     C*
     C                     MOVEL'N'       W@AFLG
     C                     EXSR #MSUB
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*-----------------------------------------------------
     C           #MSUB     BEGSR
     C*-----------------------------------------------------
     C*
     C                     DO
     C*
     C           K#FCE     CHAINFCEPL01              90
     C   90                LEAVE
     C           A2ZANM    IFEQ ASJ,1
     C                     LEAVE
     C                     END
     C*
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    W@SYOS  50
     C                     ELSE
     C                     Z-ADDA2SSYS    W@SYOS
     C                     END
     C*
     C           K#WP82    KLIST
     C                     KFLD           K@WPT1  5
     C                     KFLD           K@WPT2  5
     C                     KFLD           K@WPT3  2
     C                     KFLD           K@PRT1
     C                     KFLD           K@PRT2
     C                     KFLD           K@PRT3
      *
     C           A2KOS1    IFNE *BLANK
     C                     MOVELA21HB5    K@WPT1
     C                     MOVELA22HB5    K@WPT2
     C                     MOVELA23HB2    K@WPT3
     C                     EXSR #MSUB1
     C                     END
     C           A2KOS2    IFNE *BLANK
     C                     MOVELA24HB5    K@WPT1
     C                     MOVELA25HB5    K@WPT2
     C                     MOVELA26HB2    K@WPT3
     C                     EXSR #MSUB1
     C                     END
     C           A2KOS3    IFNE *BLANK
     C                     MOVELA27HB5    K@WPT1
     C                     MOVELA28HB5    K@WPT2
     C                     MOVELA29HB2    K@WPT3
     C                     EXSR #MSUB1
     C                     END
     C           A2KOS4    IFNE *BLANK
     C                     MOVELA210H5    K@WPT1
     C                     MOVELA211H5    K@WPT2
     C                     MOVELA212H2    K@WPT3
     C                     EXSR #MSUB1
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *-----------------------------------------------
     C           #MSUB1    BEGSR
      *-----------------------------------------------
     C*
     C           K#WP82    CHAINAH#WP82              91
     C*
     C           *IN91     IFEQ *ON
     C*
     C                     CLEARAH#WP821
     C*
     C                     MOVELK@WPT1    AWWPT1
     C                     MOVELK@WPT2    AWWPT2
     C                     MOVELK@WPT3    AWWPT3
     C           K#AKB1    KLIST
     C                     KFLD           K@WPT1
     C                     KFLD           K@WPT2
     C                     KFLD           K@WPT3
     C                     KFLD           K@9999  40
     C                     Z-ADD9999      K@9999
     C           K#AKB1    SETGTAKBPL07
     C           K#AKB2    KLIST
     C                     KFLD           K@WPT1
     C                     KFLD           K@WPT2
     C                     KFLD           K@WPT3
     C                     DO   *HIVAL
     C           K#AKB2    REDPEAKBPL07                  92
     C   92                LEAVE
     C           L1SKJY    IFNE *BLANK
     C           L1SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     MOVELL1TKR1    AWWLC1
     C                     MOVELL1TKR2    AWWLC2
     C                     MOVELL1TKR3    AWWLC3
     C                     MOVELL1TKR4    AWWLC4
     C                     MOVELL1BMON    AWWSPL
     C                     Z-ADDL1SYOS    AWSYOS
     C                     LEAVE
     C                     ENDDO
     C           *IN92     IFEQ *ON
     C           K#AKB2    SETLLAAMPL11
     C                     DO   *HIVAL
     C           K#AKB2    READEAAMPL11                  94
     C   94                LEAVE
     C           CKSKJY    IFNE *BLANK
     C           CKSKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C           *IN94     IFEQ *OFF
     C                     MOVELCKNB01    W@LOC
     C           K#AKB3    KLIST
     C                     KFLD           W@LOC1
     C                     KFLD           W@LOC2
     C                     KFLD           W@LOC3
     C                     KFLD           W@LOC4
     C           K#AKB3    SETGTAKBPL03
     C                     DO   *HIVAL
     C           K#AKB3    REDPEAKBPL03                  95
     C   95                LEAVE
     C           L1SKJY    IFNE *BLANK
     C           L1SKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C                     MOVELL1TKR1    AWWLC1
     C                     MOVELL1TKR2    AWWLC2
     C                     MOVELL1TKR3    AWWLC3
     C                     MOVELL1TKR4    AWWLC4
     C                     MOVELL1BMON    AWWSPL
     C                     Z-ADDL1SYOS    AWSYOS
     C                     LEAVE
     C                     ENDDO
     C                     END
     C                     END
     C*
     C                     MOVE K@PRT1    AWPRT1
     C                     MOVE K@PRT2    AWPRT2
     C                     MOVE K@PRT3    AWPRT3
     C                     MOVE A2STRK    AWLOC1
     C                     MOVE A2STRT    AWLOC2
     C                     MOVE A2STRR    AWLOC3
     C                     MOVE A2STRD    AWLOC4
      *
     C           K#FCE     CHAINFCEPL11              93
     C           *IN93     IFEQ *OFF
     C           FCGK01    ANDNE*ZERO
     C           FCGK01    DIV  FCCD01    WSTEI   90H
     C                     Z-ADDWSTEI     AWSETQ
     C                     END
      *
     C                     EXSR #NSCN
     C                     SUB  @@NSCN    AWNSCN
      *
     C                     END
      *
     C           W@AFLG    IFEQ 'Y'
     C           A7KNID    IFEQ 'A'
     C                     Z-ADDA7KQTY    W@QTY  132
     C                     ELSE
     C           A7KQTY    MULT A7LOTS    W@QTY
     C           W@QTY     IFEQ 0
     C                     Z-ADDA7KQTY    W@QTY
     C                     END
     C                     END
     C           W@QTY     MULT W@SYOS    W@QTY
     C                     SUB  W@QTY     AWNSCN
     C                     END
      *
     C           *IN91     IFEQ *ON
     C                     WRITEAH#WP821
     C                     ELSE
     C                     UPDATAH#WP821
     C                     ENDIF
      *
     C                     ENDSR
     C*-----------------------------------------------------
     C           #NSCN     BEGSR
     C*-----------------------------------------------------
     C                     Z-ADD*DATE     K@NODT
     C                     Z-ADD*ZERO     @@NSCN  90
     C           K#18      SETLLAB#PL18
     C           *IN26     DOUEQ*ON
     C           K#FCE     READEAB#PL18                  26
     C           *IN26     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BADAT     IFGT @NXDAY
     C                     LEAVE
     C                     ENDIF
     C*
     C                     Z-ADD*ZERO     WWQTY   70
     C                     MOVE BANOBN    K@NOBN
     C                     MOVELBAODRN    @@ODRN    P
     C                     MOVE BANONY    @@NONY
     C           K#AP70    SETLLAB#PL70
     C           *IN82     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  82
     C           *IN82     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    WWQTY
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           WWQTY     IFEQ *ZERO
     C                     MOVELBAINVN    @@ODRN    P
     C           K#AP70    SETLLAB#PL70
     C           *IN82     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  82
     C           *IN82     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    WWQTY
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           WWQTY     IFLT BASRYO
     C           BASRYO    SUB  WWQTY     @@BAL   90
     C                     ADD  @@BAL     @@NSCN
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #OUT      BEGSR
      *-----------------------------------------------------
     C                     TIME           @TIME   60
     C                     MOVE *OFF      *IN98
     C                     MOVEL*BLANK    W@OP   22
TCHK2C                     Z-ADD*ZERO     TWSETQ
TCHK2C                     Z-ADD*ZERO     TWNSCN
TCHK2C                     Z-ADD*ZERO     TWCANS
TCHK2C                     Z-ADD*ZERO     @COUNT
      *
     C           *LOVAL    SETLLAH#WL82
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AH#WL82                  80
     C   80                LEAVE
     C*
     C                     MOVEL*OFF      W@HDSW  1
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     EXCPT@DTL0
     C                     MOVEL*ON       W@HDSW
     C                     ENDIF
     C*
     C  N98                MOVE *ON       *IN98
     C*
     C                     MOVEL*BLANK    PRWPRT
     C                     MOVEL*BLANK    PRWLOC
     C                     MOVEL*BLANK    PRLOC
     C                     MOVEL*BLANK    PRPART
     C                     MOVEL*BLANK    PRWSPL  4
     C           W@HDSW    IFEQ *ON
     C           W@NP      ORNE W@OP
     C           W@HDSW    IFEQ *OFF
TCHK2C           @COUNT    IFGT 1
TCHK2C                     EXCPT@TTL
TCHK2C                     END
TCHK2C                     Z-ADD*ZERO     TWSETQ
TCHK2C                     Z-ADD*ZERO     TWNSCN
TCHK2C                     Z-ADD*ZERO     TWCANS
TCHK2C                     Z-ADD*ZERO     @COUNT
     C                     EXCPT@DTL0
     C                     END
     C                     MOVELW@NP      W@OP
     C                     MOVELAWWPT1    PRWPR1
     C           AWWPT2    IFNE *BLANK
     C                     MOVEL'-'       PRWPR2
     C                     END
     C                     MOVELAWWPT2    PRWPR3
     C           AWWPT3    IFNE *BLANK
     C                     MOVEL'-'       PRWPR4
     C                     END
     C                     MOVELAWWPT3    PRWPR5
     C           AWWLC1    IFNE *BLANK
     C           AWWLC2    ORNE *BLANK
     C           AWWLC3    ORNE *BLANK
     C           AWWLC4    ORNE *BLANK
     C                     MOVELAWWLC1    PRWLC1
     C                     MOVEL'-'       PRWLC2
     C                     MOVELAWWLC2    PRWLC3
     C                     MOVEL'-'       PRWLC4
     C                     MOVELAWWLC3    PRWLC5
     C                     MOVEL'-'       PRWLC6
     C                     MOVELAWWLC4    PRWLC7
     C                     END
     C                     MOVELAWWSPL    PRWSPL
     C                     END
     C*
     C                     MOVELAWPRT1    PRPAR1
     C           AWPRT2    IFNE *BLANK
     C                     MOVEL'-'       PRPAR2
     C                     END
     C                     MOVELAWPRT2    PRPAR3
     C           AWPRT3    IFNE *BLANK
     C                     MOVEL'-'       PRPAR4
     C                     END
     C*
     C                     MOVELAWPRT3    PRPAR5
     C                     MOVELAWLOC1    PRLO1
     C                     MOVEL'-'       PRLO2
     C                     MOVELAWLOC2    PRLO3
     C                     MOVEL'-'       PRLO4
     C                     MOVELAWLOC3    PRLO5
     C                     MOVEL'-'       PRLO6
     C                     MOVELAWLOC4    PRLO7
     C*
     C           AWSYOS    IFNE *ZERO
     C           AWNSCN    DIV  AWSYOS    W@CANS  51H
     C                     ELSE
     C                     Z-ADD*ZERO     W@CANS
     C                     END
     C*
     C                     EXCPT@DTL
     C*
TCHK2C                     ADD  1         @COUNT  20
TCHK2C                     ADD  AWSETQ    TWSETQ  90
TCHK2C                     ADD  AWNSCN    TWNSCN  90
TCHK2C                     ADD  W@CANS    TWCANS  61
     C*
     C                     ENDDO
     C*
TCHK2C           @COUNT    IFGT 1
TCHK2C                     EXCPT@TTL
TCHK2C                     END
     C*
     C                     ENDSR
      *-----------------------------------------------------*
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y   60
     O                         @TIME     69 '  :  :  '
     O                                   71 'P.'
     O                         PAGE  Z   75
     O        E   02           @HED
     O                                   40 'WASHER LIST'
     O        E   04           @HED
     O                                   15 'WASHER PART#  '
     O                                   27 'W.LOCATION'
     O                                   34 'SUPPL'
     O                                   42 'PART#'
     O                                   62 'LOCATION'
     O                                   75 'PCS/DAY'
     O                                   90 'PCS NEEDED'
     O                                  100 '#CANS'
     O                                  111 'INV'
     O                                  117 '|'
     O                                  125 'WHO'
     O        E 1              @DTL
     O                         PRWPRT    15
     O                         PRWLOC    26
     O                         PRWSPL    33
     O                         PRPART    51
     O                         PRLOC     63
     O                         AWSETQ1   75
     O                         AWNSCNJ   90
     O                         W@CANS1  100
     O                                  117 '|'
TEST O*******                  AWSYOS1  120
     O        E 1              @DTL0
     O                         @LINE    132
TCHK2O        E 1              @TTL
TCHK2O                                   07 '*TOTAL*'
TCHK2O                         TWSETQ1   75
TCHK2O                         TWNSCNJ   90
TCHK2O                         TWCANS1  100
** ASJ
ASJ SUPPLY
