     H            Y.
     F** AH#R3C ********************************
     F* .. A-PICS KANBAN INVESTIGATION LIST .. *
     F*                                        *
     F*       MSK.KUNIEDA       99.11.11       *
     F*********************  BASE OF   AH#R3C **
     FAH#WP34 IP  E           K        DISK
     FAU#PL22 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAD#PL11 IF  E           K        DISK                           UC
     FBTAPL02 IF  E           K        DISK                           UC
     FBTAPL04 IF  E           K        DISK                           UC
      * MSK 99.11.11
     FDA#TL15 IF  E           K        DISK                           UC
      *
     FAH#WP32 O   F     200            DISK
     E                    HMA        31  3 0             箱数
     E                    HBU        31  1 0             分割
     E                    HMH        31  3 0             箱数uboﾇ
     E                    HPH        31  3 0             箱数ﾎﾟ[ﾇ
     E                    HZM        31  1               割振済
     IBTAPL041
     I              BTSKJY                          $$SKJY
     I              BTSKYY                          $$SKYY
     I              BTSKMM                          $$SKMM
     I              BTSKDD                          $$SKDD
     I              BTKOYY                          $$KOYY
     I              BTKOMM                          $$KOMM
     I              BTKODD                          $$KODD
     I              BTKOHH                          $$KOHH
     I              BTKOSS                          $$KOSS
     I              BTKOME                          $$KOME
     I              BTSHN1                          $$SHN1
     I              BTSHN2                          $$SHN2
     I              BTSHN3                          $$SHN3
     I              BTKEYM                          $$KEYM
     I              BTMH01                          $$MH01
     I              BTMH02                          $$MH02
     I              BTMH03                          $$MH03
     I              BTMH04                          $$MH04
     I              BTMH05                          $$MH05
     I              BTMH06                          $$MH06
     I              BTMH07                          $$MH07
     I              BTMH08                          $$MH08
     I              BTMH09                          $$MH09
     I              BTMH10                          $$MH10
     I              BTMH11                          $$MH11
     I              BTMH12                          $$MH12
     I              BTMH13                          $$MH13
     I              BTMH14                          $$MH14
     I              BTMH15                          $$MH15
     I              BTMH16                          $$MH16
     I              BTMH17                          $$MH17
     I              BTMH18                          $$MH18
     I              BTMH19                          $$MH19
     I              BTMH20                          $$MH20
     I              BTMH21                          $$MH21
     I              BTMH22                          $$MH22
     I              BTMH23                          $$MH23
     I              BTMH24                          $$MH24
     I              BTMH25                          $$MH25
     I              BTMH26                          $$MH26
     I              BTMH27                          $$MH27
     I              BTMH28                          $$MH28
     I              BTMH29                          $$MH29
     I              BTMH30                          $$MH30
     I              BTMH31                          $$MH31
     I              BTPH01                          $$PH01
     I              BTPH02                          $$PH02
     I              BTPH03                          $$PH03
     I              BTPH04                          $$PH04
     I              BTPH05                          $$PH05
     I              BTPH06                          $$PH06
     I              BTPH07                          $$PH07
     I              BTPH08                          $$PH08
     I              BTPH09                          $$PH09
     I              BTPH10                          $$PH10
     I              BTPH11                          $$PH11
     I              BTPH12                          $$PH12
     I              BTPH13                          $$PH13
     I              BTPH14                          $$PH14
     I              BTPH15                          $$PH15
     I              BTPH16                          $$PH16
     I              BTPH17                          $$PH17
     I              BTPH18                          $$PH18
     I              BTPH19                          $$PH19
     I              BTPH20                          $$PH20
     I              BTPH21                          $$PH21
     I              BTPH22                          $$PH22
     I              BTPH23                          $$PH23
     I              BTPH24                          $$PH24
     I              BTPH25                          $$PH25
     I              BTPH26                          $$PH26
     I              BTPH27                          $$PH27
     I              BTPH28                          $$PH28
     I              BTPH29                          $$PH29
     I              BTPH30                          $$PH30
     I              BTPH31                          $$PH31
     I              BTZM01                          $$ZM01
     I              BTZM02                          $$ZM02
     I              BTZM03                          $$ZM03
     I              BTZM04                          $$ZM04
     I              BTZM05                          $$ZM05
     I              BTZM06                          $$ZM06
     I              BTZM07                          $$ZM07
     I              BTZM08                          $$ZM08
     I              BTZM09                          $$ZM09
     I              BTZM10                          $$ZM10
     I              BTZM11                          $$ZM11
     I              BTZM12                          $$ZM12
     I              BTZM13                          $$ZM13
     I              BTZM14                          $$ZM14
     I              BTZM15                          $$ZM15
     I              BTZM16                          $$ZM16
     I              BTZM17                          $$ZM17
     I              BTZM18                          $$ZM18
     I              BTZM19                          $$ZM19
     I              BTZM20                          $$ZM20
     I              BTZM21                          $$ZM21
     I              BTZM22                          $$ZM22
     I              BTZM23                          $$ZM23
     I              BTZM24                          $$ZM24
     I              BTZM25                          $$ZM25
     I              BTZM26                          $$ZM26
     I              BTZM27                          $$ZM27
     I              BTZM28                          $$ZM28
     I              BTZM29                          $$ZM29
     I              BTZM30                          $$ZM30
     I              BTZM31                          $$ZM31
     I            DS
     I                                        1  930HMA
     I                                        1   30BTMA01
     I                                        4   60BTMA02
     I                                        7   90BTMA03
     I                                       10  120BTMA04
     I                                       13  150BTMA05
     I                                       16  180BTMA06
     I                                       19  210BTMA07
     I                                       22  240BTMA08
     I                                       25  270BTMA09
     I                                       28  300BTMA10
     I                                       31  330BTMA11
     I                                       34  360BTMA12
     I                                       37  390BTMA13
     I                                       40  420BTMA14
     I                                       43  450BTMA15
     I                                       46  480BTMA16
     I                                       49  510BTMA17
     I                                       52  540BTMA18
     I                                       55  570BTMA19
     I                                       58  600BTMA20
     I                                       61  630BTMA21
     I                                       64  660BTMA22
     I                                       67  690BTMA23
     I                                       70  720BTMA24
     I                                       73  750BTMA25
     I                                       76  780BTMA26
     I                                       79  810BTMA27
     I                                       82  840BTMA28
     I                                       85  870BTMA29
     I                                       88  900BTMA30
     I                                       91  930BTMA31
     I            DS
     I                                        1  310HBU
     I                                        1   10BTBU01
     I                                        2   20BTBU02
     I                                        3   30BTBU03
     I                                        4   40BTBU04
     I                                        5   50BTBU05
     I                                        6   60BTBU06
     I                                        7   70BTBU07
     I                                        8   80BTBU08
     I                                        9   90BTBU09
     I                                       10  100BTBU10
     I                                       11  110BTBU11
     I                                       12  120BTBU12
     I                                       13  130BTBU13
     I                                       14  140BTBU14
     I                                       15  150BTBU15
     I                                       16  160BTBU16
     I                                       17  170BTBU17
     I                                       18  180BTBU18
     I                                       19  190BTBU19
     I                                       20  200BTBU20
     I                                       21  210BTBU21
     I                                       22  220BTBU22
     I                                       23  230BTBU23
     I                                       24  240BTBU24
     I                                       25  250BTBU25
     I                                       26  260BTBU26
     I                                       27  270BTBU27
     I                                       28  280BTBU28
     I                                       29  290BTBU29
     I                                       30  300BTBU30
     I                                       31  310BTBU31
     I            DS
     I                                        1  930HMH
     I                                        1   30$$MH01
     I                                        4   60$$MH02
     I                                        7   90$$MH03
     I                                       10  120$$MH04
     I                                       13  150$$MH05
     I                                       16  180$$MH06
     I                                       19  210$$MH07
     I                                       22  240$$MH08
     I                                       25  270$$MH09
     I                                       28  300$$MH10
     I                                       31  330$$MH11
     I                                       34  360$$MH12
     I                                       37  390$$MH13
     I                                       40  420$$MH14
     I                                       43  450$$MH15
     I                                       46  480$$MH16
     I                                       49  510$$MH17
     I                                       52  540$$MH18
     I                                       55  570$$MH19
     I                                       58  600$$MH20
     I                                       61  630$$MH21
     I                                       64  660$$MH22
     I                                       67  690$$MH23
     I                                       70  720$$MH24
     I                                       73  750$$MH25
     I                                       76  780$$MH26
     I                                       79  810$$MH27
     I                                       82  840$$MH28
     I                                       85  870$$MH29
     I                                       88  900$$MH30
     I                                       91  930$$MH31
     I            DS
     I                                        1  930HPH
     I                                        1   30$$PH01
     I                                        4   60$$PH02
     I                                        7   90$$PH03
     I                                       10  120$$PH04
     I                                       13  150$$PH05
     I                                       16  180$$PH06
     I                                       19  210$$PH07
     I                                       22  240$$PH08
     I                                       25  270$$PH09
     I                                       28  300$$PH10
     I                                       31  330$$PH11
     I                                       34  360$$PH12
     I                                       37  390$$PH13
     I                                       40  420$$PH14
     I                                       43  450$$PH15
     I                                       46  480$$PH16
     I                                       49  510$$PH17
     I                                       52  540$$PH18
     I                                       55  570$$PH19
     I                                       58  600$$PH20
     I                                       61  630$$PH21
     I                                       64  660$$PH22
     I                                       67  690$$PH23
     I                                       70  720$$PH24
     I                                       73  750$$PH25
     I                                       76  780$$PH26
     I                                       79  810$$PH27
     I                                       82  840$$PH28
     I                                       85  870$$PH29
     I                                       88  900$$PH30
     I                                       91  930$$PH31
     I            DS
     I                                        1  31 HZM
     I                                        1   1 $$ZM01
     I                                        2   2 $$ZM02
     I                                        3   3 $$ZM03
     I                                        4   4 $$ZM04
     I                                        5   5 $$ZM05
     I                                        6   6 $$ZM06
     I                                        7   7 $$ZM07
     I                                        8   8 $$ZM08
     I                                        9   9 $$ZM09
     I                                       10  10 $$ZM10
     I                                       11  11 $$ZM11
     I                                       12  12 $$ZM12
     I                                       13  13 $$ZM13
     I                                       14  14 $$ZM14
     I                                       15  15 $$ZM15
     I                                       16  16 $$ZM16
     I                                       17  17 $$ZM17
     I                                       18  18 $$ZM18
     I                                       19  19 $$ZM19
     I                                       20  20 $$ZM20
     I                                       21  21 $$ZM21
     I                                       22  22 $$ZM22
     I                                       23  23 $$ZM23
     I                                       24  24 $$ZM24
     I                                       25  25 $$ZM25
     I                                       26  26 $$ZM26
     I                                       27  27 $$ZM27
     I                                       28  28 $$ZM28
     I                                       29  29 $$ZM29
     I                                       30  30 $$ZM30
     I                                       31  31 $$ZM31
     I            DS
     I                                        1   80AHYMD
     I                                        1   40@YY
     I                                        5   60@MM
     I                                        7   80@DD
     I            DS
     I                                        1   80WYMD
     I                                        1   60WYM
     I            DS
     I                                        1   80WHYMD
     I                                        1   60WHYM
     I                                        7   80WHDD
     I            DS
     I                                        1   80$$SKHZ
     I                                        1   40$$SKYY
     I                                        5   60$$SKMM
     I                                        7   80$$SKDD
      *
      *
     C           KEY1      KLIST
     C                     KFLD           AHHIN1
     C                     KFLD           AHHIN2
     C                     KFLD           AHHIN3
      *
     C           KEY2      KLIST
     C                     KFLD           AHHIN1
     C                     KFLD           AHHIN2
     C                     KFLD           AHHIN3
     C                     KFLD           @YY
     C                     KFLD           @MM
     C                     KFLD           @DD
      *-----------------------------------------------------*
      *   出荷情報                                        *
      *-----------------------------------------------------*
     C                     MOVE '1'       NOTFG   1
     C*------------------------------------------*
     C*   ..Ａ－ＰＩＣＳ　抜出累積ファイル..   *
     C*------------------------------------------*
     C           KEY2      SETGTAU#PL221
     C                     SETOF                     07
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAU#PL221                 10
     C           *IN10     IFEQ '0'
     C           CQNOHZ    ANDGT*DATE
      *
     C***        CQGYOM    IFNE '13'
     C***        CQGYOM    ANDNE'14'
     C           CQGYOM    IFNE '16'
     C           CQGYOM    ANDNE'17'
     C***        CQGYOM    ANDNE'20'
     C***        CQGYOM    ANDNE'23'
     C***        CQGYOM    ANDNE'24'
     C***        CQGYOM    ANDNE'26'
     C***        CQGYOM    ANDNE'27'
     C***        CQGYOM    ANDNE'29'
     C***        CQGYOM    ANDNE'35'
     C***        CQGYOM    ANDNE'32'
     C                     SETON                     U207
     C                     Z-ADDAHYMD     YMD     80
     C                     Z-ADDAHBIN     BIN     20
     C                     EXCPTF01
     C                     END
      *
     C                     END
     C  N10                END
      *
      *
     C*------------------------------------------*
     C*   ..受注累積データ                     *
     C*------------------------------------------*
     C                     OPEN DA#TL15
     C           KEY2      SETGTDA#TL15
     C                     SETOF                     80
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEDA#TL151                 10
     C           *IN10     IFEQ '0'
     C           B8NOHZ    ANDGT*DATE
      *
     C           B8STBN    IFEQ 'X'
     C                     SETON                     U280
     C                     Z-ADDAHYMD     YMD
     C                     Z-ADDAHBIN     BIN
     C                     EXCPTF03
     C                     END
      *
     C                     END
     C  N10                END
      *
     C                     CLOSEDA#TL15
      *
      *-----------------------------------------------------*
      *   未手配情報                                      *
      *-----------------------------------------------------*
     C*--------------------------------------*
     C*  ..未手配ファイル（受注データ）..  *
     C*--------------------------------------*
     C                     OPEN AD#PL11
     C           KEY2      SETLLAD#PL111
     C                     SETOF                     07
      *
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY1      READEAD#PL111                 20
     C           *IN20     IFEQ '0'
     C           CASKJY    IFEQ *BLANK
     C*          CANOHZ    ANDGT*DATE
      *
     C                     SETON                     U207
     C                     Z-ADDAHYMD     WKYMD   80
     C                     Z-ADDAHBIN     WKBIN   20
     C                     MOVELCASHN1    WSHN1   5
     C                     MOVELCASHN2    WSHN2   5
     C                     MOVELCASHN3    WSHN3   2
     C                     Z-ADDCATOKU    WTOKU   40
     C                     Z-ADDCANONY    WNONY   40
     C                     MOVELCANKOJ    WNKOJ   1
     C                     MOVELCANUKE    WNUKE   4
     C                     Z-ADDCANOHZ    WNOHZ   80
     C                     MOVELCASKKB    WSKKB   1
     C                     MOVELCAGYOM    WGYOM   2
     C                     Z-ADDCANSRY    WNSRY   70
     C                     Z-ADDCATEHZ    WTEHZ   80
     C                     Z-ADDCATEHF    WTEHF   40
     C                     EXCPTF02
      *
     C                     END
     C                     END
     C  N20                END
     C                     CLOSEAD#PL11
      *
     C*----------------------------------------------*
     C*  ..Ａ－ＰＩＣＳ計画発行受注累積ファイル..  *
     C*----------------------------------------------*
     C                     OPEN BTAPL02
     C           KEY1      SETLLBTAPL021
     C                     Z-ADDUDATE     WYMD
      *
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY1      READEBTAPL021                 20
     C           *IN20     IFEQ '0'
     C           BTNOHZ    ANDGT*DATE
     C           BTSKJY    IFEQ 'D'
     C           BTSKHZ    ANDLE*DATE
     C                     ELSE
     C           BTKEYM    IFGE WYM
      *
     C                     Z-ADDAHYMD     WKYMD
     C                     Z-ADDAHBIN     WKBIN
     C                     MOVELBTSHN1    WSHN1
     C                     MOVELBTSHN2    WSHN2
     C                     MOVELBTSHN3    WSHN3
     C                     Z-ADDBTTOKU    WTOKU
     C                     Z-ADDBTNONY    WNONY
     C                     MOVELBTNKOJ    WNKOJ
     C                     MOVELBTNUKE    WNUKE
     C                     MOVEL'S'       WSKKB
     C                     MOVEL'27'      WGYOM
      *
     C                     Z-ADDBTKEYM    WHYM
      *
     C                     Z-ADD1         A       20
     C           1         DO   31        A
     C           HMA,A     IFNE 0
     C           HBU,A     IFEQ 0
      *
     C                     SETON                     U207
     C                     Z-ADDA         WHDD
     C                     Z-ADDWHYMD     WNOHZ
     C                     Z-ADDWHYMD     WTEHZ
     C                     Z-ADD800       WTEHF
     C           HMA,A     MULT BTSYUY    WNSRY
     C                     EXCPTF02
      *
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N20                END
     C                     CLOSEBTAPL02
      *
     C*------------------------------------*
     C* Ａ－ＰＩＣＳ計画発行管理マスター *
     C*              ..マイナス分登録..  *
     C*------------------------------------*
     C                     OPEN BTAPL04
     C           KEY1      SETLLBTAPL041
     C                     Z-ADD*DATE     WYMD
      *
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY1      READEBTAPL041                 20
     C           *IN20     IFEQ '0'
     C           $$SKJY    IFEQ 'D'
     C           $$SKHZ    ANDLE*DATE
     C                     ELSE
     C           $$KEYM    IFGE WYM
      *
     C                     Z-ADDAHYMD     WKYMD
     C                     Z-ADDAHBIN     WKBIN
     C                     MOVEL$$SHN1    WSHN1
     C                     MOVEL$$SHN2    WSHN2
     C                     MOVEL$$SHN3    WSHN3
     C                     Z-ADD0         WTOKU
     C                     Z-ADD0         WNONY
     C                     MOVEL*BLANK    WNKOJ
     C                     MOVEL*BLANK    WNUKE
     C                     MOVEL'K'       WSKKB
     C                     MOVEL'35'      WGYOM
      *
     C                     Z-ADD$$KEYM    WHYM
      *
     C                     SETOF                     11
     C                     Z-ADD0         WSYOS   50
     C           KEY1      CHAINAGAPL311             11
     C           *IN11     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     11
     C                     END
     C           *IN11     IFEQ '0'
     C                     Z-ADDCBSYUY    WSYOS
     C                     END
      *
     C                     Z-ADD1         A       20
     C           1         DO   31        A
     C           HZM,A     IFEQ *BLANK
      *
     C           HMH,A     IFNE 0
     C                     SETON                     U207
     C                     Z-ADDA         WHDD
     C                     Z-ADDWHYMD     WNOHZ
     C                     Z-ADDWHYMD     WTEHZ
     C                     Z-ADD800       WTEHF
     C                     Z-SUBHMH,A     WHKMS   30
     C           WHKMS     MULT WSYOS     WNSRY
     C                     EXCPTF02
     C                     END
      *
     C           HPH,A     IFNE 0
     C                     SETON                     U207
     C                     Z-ADDA         WHDD
     C                     Z-ADDWHYMD     WNOHZ
     C                     Z-ADDWHYMD     WTEHZ
     C                     Z-ADD800       WTEHF
     C           HPH,A     MULT WSYOS     WNSRY
     C                     EXCPTF02
     C                     END
      *
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N20                END
     C                     CLOSEBTAPL04
      *
     C           *IN07     IFEQ '0'
     C                     SETON                     U2
     C                     MOVE AHHIN1    WSHN1
     C                     MOVE AHHIN2    WSHN2
     C                     MOVE AHHIN3    WSHN3
     C                     EXCPTF02
     C                     END
      *
     OAH#WP32 E                F01
     O                         CQSHN1     5
     O                         CQSHN2    10
     O                         CQSHN3    12
     O                         CQTOKU    16
     O                         CQNONY    20
     O                         CQNKOJ    21
     O                         CQNUKE    25
     O                         CQTHHZ    33
     O                         CQNOYY    37
     O                         CQNOMM    39
     O                         CQNODD    41
     O                         CQSRYO    48
     O                         CQSKKB    49
     O                         CQGYOM    51
     O                 07                52 '0'
     O                         YMD       60
     O                         BIN       62
     O                         CQSKHZ    70
     O                         CQSKTI    74
      * MSK 99.12.13
     O                         CQTHTI    78
     O                         CQNOBB    80
      *MSK 99.11.11
      *受注累積データ分
     O        E                F03
     O                         B8SHN1     5
     O                         B8SHN2    10
     O                         B8SHN3    12
     O                         B8TOKU    16
     O                         B8NONY    20
     O                         B8NKOJ    21
     O                         B8NUKE    25
     O                         B8TEHZ    33
     O                         B8MEYY    37
     O                         B8MEMM    39
     O                         B8MEDD    41
     O                         B8SRYO    48
     O                                   49 'S'
     O                                   51 '18'
     O                 80                52 '0'
     O                         YMD       60
     O                         BIN       62
     O                                  100 'X'
      *
     O        E                F02
     O                         WSHN1      5
     O                         WSHN2     10
     O                         WSHN3     12
     O                         WTOKU     16
     O                         WNONY     20
     O                         WNKOJ     21
     O                         WNUKE     25
     O                         WTEHZ     33
     O                         WNOHZ     41
     O                         WNSRY  B  48
     O                         WSKKB     49
     O                         WGYOM     51
     O                 07                52 '2'
     O                N07                52 '3'
     O                         WKYMD     60
     O                         WKBIN     62
     O                         WTEHF     66
