     H            Y/
     F******************************************************
     F*  TOYOTA SHIP VS NOSCAN BIN# DETAIL                 *
     F*                                                    *
     F* TCHK1 01/18/08 ADD BIN#5,BIN#6                     *
     F******************************************************
     FAB#PL12 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FAH#WP7AEUF  E           K        DISK                      A
     F            AH#WP7AE1                         KRENAMEAH#EAST
     FAH#WP7AWUF  E           K        DISK                      A
     F            AH#WP7AW1                         KRENAMEAH#WEST
     F*QPRINT  O   F     198     OF     PRINTER
      *------------------------------------------------------------
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@HMS
     I                                        1   20W@HH
     I                                        3   40W@MN
     I                                        7  140W@YMD
     I                                        7  100W@YY
     I                                       11  120W@MM
     I                                       13  140W@DD
     I            DS
     I                                        1   80W@DAT1
     I                                        1   40W@D1YY
     I                                        5   60W@D1MM
     I                                        7   80W@D1DD
     I            DS
     I                                        1   80W@DAT2
     I                                        1   40W@D2YY
     I                                        5   60W@D2MM
     I                                        7   80W@D2DD
     I            DS
     I                                        1   80F8YMD
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80BANODT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I            DS
     I                                        1   80A2TRDT
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I            DS
     I                                        1   80A2SYDT
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *------------------------------------------------------
      * MAIN
      *------------------------------------------------------
     C*
     C                     EXSR @INT
     C*
     C                     EXSR @PRC10
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      * INITIAL DATE SET
      *------------------------------------------------------
     C           @INT      BEGSR
     C*
     C                     TIME           W@TIME
     C                     Z-ADDW@YMD     W@DAT1
     C                     Z-ADDW@YMD     W@DAT2
     C*
     C           K#AGDP    KLIST
     C                     KFLD           W@D1YY
     C                     KFLD           W@D1MM
     C                     KFLD           W@D1DD
     C           K#AGDP    SETGTAGDPL12
     C                     DO   *HIVAL
     C                     READ AGDPL12                  98
     C   98                LEAVE
     C           F8HIRU    IFEQ *BLANK
     C                     Z-ADDF8YMD     W@DAT2
     C                     LEAVE
     C                     END
     C                     END
     C*
     C                     ENDSR
      *------------------------------------------------------
      * GET ORDER DATA
      *------------------------------------------------------
     C           @PRC10    BEGSR
     C*
     C           K#PL12    KLIST
     C                     KFLD           W@D1YY
     C                     KFLD           W@D1MM
     C                     KFLD           W@D1DD
     C           K#PL12    SETLLAB#PL12
     C*
     C                     DO   *HIVAL
     C*
     C                     READ AB#PL12                  97
     C   97                LEAVE
     C           BANODT    IFGT W@DAT2
     C                     LEAVE
     C                     END
     C           BASKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C                     MOVEL*BLANK    W@SWEW  1
     C                     SELEC
     C           BANONY    WHEQ 3764                       TMMAL
     C           BANONY    OREQ 3503                       TMMC
     C           BANONY    OREQ 3804                       TMMI
     C           BANONY    OREQ 3347                       TMMK
     C           BANONY    OREQ 3220                       TMMNK
     C           BANONY    OREQ 3931                       TMMWV
     C                     MOVEL'E'       W@SWEW
     C           BANONY    WHEQ 3481                       TMMBC
     C           BANONY    OREQ 3851                       TMMTX
     C           BANONY    OREQ 0541                       NUMMI
     C                     MOVEL'W'       W@SWEW
     C                     OTHER
     C                     ITER
     C                     ENDSL
     C*
     C           K#HP7A    KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C           W@SWEW    IFEQ 'E'
     C           K#HP7A    CHAINAH#WP7AE             96
     C                     ELSE
     C           K#HP7A    CHAINAH#WP7AW             96
     C                     END
     C           *IN96     IFEQ *ON
     C           W@SWEW    IFEQ 'E'
     C                     CLEARAH#EAST
     C                     ELSE
     C                     CLEARAH#WEST
     C                     END
     C                     MOVELBASHN1    AHPRT1
     C                     MOVELBASHN2    AHPRT2
     C                     MOVELBASHN3    AHPRT3
     C                     Z-ADDW@DAT1    AHDAT1
     C                     Z-ADDW@DAT2    AHDAT2
     C           K#FCEP    KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
     C           K#FCEP    CHAINFCEPL01              95
     C           *IN95     IFEQ *OFF
     C           BANODT    IFGE A2TRDT                     LOCATION
     C                     MOVE A2STRK    AHLOC1           NEW
     C                     MOVE A2STRT    AHLOC2
     C                     MOVE A2STRR    AHLOC3
     C                     MOVE A2STRD    AHLOC4
     C                     ELSE
     C                     MOVE A2KTRK    AHLOC1           OLD
     C                     MOVE A2KTRT    AHLOC2
     C                     MOVE A2KTRR    AHLOC3
     C                     MOVE A2KTRD    AHLOC4
     C                     END
     C                     END
     C                     END
     C*
     C                     Z-ADD*ZERO     W@HQ    90
     C                     Z-ADD*ZERO     W@HC    90
     C                     Z-ADD*ZERO     W@CQ    90
     C                     Z-ADD*ZERO     W@CC    90
     C                     EXSR @PRC11
     C                     SELEC
     C           BANOBN    WHEQ 01
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH11HQ
     C                     ADD  W@HC      AH11HC
     C                     ADD  W@CQ      AH11CQ
     C                     ADD  W@CC      AH11CC
     C                     ELSE
     C                     ADD  W@HQ      AH21HQ
     C                     ADD  W@HC      AH21HC
     C                     ADD  W@CQ      AH21CQ
     C                     ADD  W@CC      AH21CC
     C                     END
     C           BANOBN    WHEQ 02
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH12HQ
     C                     ADD  W@HC      AH12HC
     C                     ADD  W@CQ      AH12CQ
     C                     ADD  W@CC      AH12CC
     C                     ELSE
     C                     ADD  W@HQ      AH22HQ
     C                     ADD  W@HC      AH22HC
     C                     ADD  W@CQ      AH22CQ
     C                     ADD  W@CC      AH22CC
     C                     END
     C           BANOBN    WHEQ 03
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH13HQ
     C                     ADD  W@HC      AH13HC
     C                     ADD  W@CQ      AH13CQ
     C                     ADD  W@CC      AH13CC
     C                     ELSE
     C                     ADD  W@HQ      AH23HQ
     C                     ADD  W@HC      AH23HC
     C                     ADD  W@CQ      AH23CQ
     C                     ADD  W@CC      AH23CC
     C                     END
     C           BANOBN    WHEQ 04
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH14HQ
     C                     ADD  W@HC      AH14HC
     C                     ADD  W@CQ      AH14CQ
     C                     ADD  W@CC      AH14CC
     C                     ELSE
     C                     ADD  W@HQ      AH24HQ
     C                     ADD  W@HC      AH24HC
     C                     ADD  W@CQ      AH24CQ
     C                     ADD  W@CC      AH24CC
     C                     END
     C           BANOBN    WHEQ 05
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH15HQ
     C                     ADD  W@HC      AH15HC
     C                     ADD  W@CQ      AH15CQ
     C                     ADD  W@CC      AH15CC
     C                     ELSE
     C                     ADD  W@HQ      AH25HQ
     C                     ADD  W@HC      AH25HC
     C                     ADD  W@CQ      AH25CQ
     C                     ADD  W@CC      AH25CC
     C                     END
     C           BANOBN    WHEQ 06
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH16HQ
     C                     ADD  W@HC      AH16HC
     C                     ADD  W@CQ      AH16CQ
     C                     ADD  W@CC      AH16CC
     C                     ELSE
     C                     ADD  W@HQ      AH26HQ
     C                     ADD  W@HC      AH26HC
     C                     ADD  W@CQ      AH26CQ
     C                     ADD  W@CC      AH26CC
     C                     END
     C                     OTHER
     C           BANODT    IFEQ W@DAT1
     C                     ADD  W@HQ      AH1ZHQ
     C                     ADD  W@HC      AH1ZHC
     C                     ADD  W@CQ      AH1ZCQ
     C                     ADD  W@CC      AH1ZCC
     C                     ELSE
     C                     ADD  W@HQ      AH2ZHQ
     C                     ADD  W@HC      AH2ZHC
     C                     ADD  W@CQ      AH2ZCQ
     C                     ADD  W@CC      AH2ZCC
     C                     END
     C                     ENDSL
     C*
     C           W@SWEW    IFEQ 'E'
     C  N96                UPDATAH#EAST
     C   96                WRITEAH#EAST
     C                     ELSE
     C  N96                UPDATAH#WEST
     C   96                WRITEAH#WEST
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *------------------------------------------------------
      *  GET LABEL DATA(SCANNED QTY)
      *------------------------------------------------------
     C           @PRC11    BEGSR
     C*
     C                     Z-ADDBASRYO    W@HQ
     C*
     C           BASYOS    IFNE *ZERO
     C           BASRYO    DIV  BASYOS    W@HC
     C                     Z-ADDBASYOS    W@SYOS
     C                     ELSE
     C           K#FCEP    CHAINFCEPL01              94
     C           *IN94     IFEQ *OFF
     C           A2SYDT    IFGT *DATE
     C                     Z-ADDA2KSYS    W@SYOS  50
     C                     ELSE
     C                     Z-ADDA2SSYS    W@SYOS
     C                     END
     C           BASRYO    DIV  W@SYOS    W@HC
     C                     ELSE
     C                     Z-ADDBASRYO    W@SYOS
     C                     Z-ADD1         W@HC
     C                     END
     C                     END
     C*
     C           K#AP70    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           @@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C                     KFLD           @@ODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
     C*
     C                     Z-ADD*ZERO     W@QTY   70
     C                     MOVE BANONY    @@NONY
     C                     MOVE BANOBN    K@NOBN
     C                     MOVELBAODRN    @@ODRN    P
     C           K#AP70    SETLLAB#PL70
     C           *IN93     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  93
     C           *IN93     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    W@QTY
     C                     END
     C                     ENDDO
      *
     C           W@QTY     IFEQ *ZERO
     C                     MOVELBAINVN    @@ODRN    P
     C           K#AP70    SETLLAB#PL70
     C           *IN93     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  93
     C           *IN93     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    W@QTY
     C                     END
     C                     ENDDO
     C                     END
     C*
     C                     Z-ADDW@QTY     W@CQ
     C           W@QTY     DIV  W@SYOS    W@CC
     C*
     C                     ENDSR
