     H            Y/
     F***************************************************
     F*   LOCATION LIST                                 *
     F*                                                 *
     F*                                                 *
     F*                                                 *
     F***************************************************
     FAH#PW75 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFCEPL03 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAH#WP75 O   E                    DISK
      *------------------------------------------------------------
     E                    KEY     1   1 78
     E                    NKAN       15  1
     E                    NTOK       15  6
     E                    KANK       15 10 0
     E                    NKOT       15  3                    PROCESS
     E                    NKBN       15  3                    MACHINE
     E                    LOC       100  6
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   6 S@LOC
     I                                        1   1 S@LOC1
     I                                        2   3 S@LOC2
     I                                        4   5 S@LOC3
     I                                        6   6 S@LOC4
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  45 NKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  15 NKAN
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  90 NTOK
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 1500KANK
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  100KHIB
     I                                        1   80KHIZ
     I                                        1   40KNE
     I                                        5   60KTU
     I                                        7   80KHI
     I                                        9  100KBIN
     I            DS
     I                                        1   6 W@LOC
     I                                        1   1 W@LOC1
     I                                        2   3 W@LOC2
     I                                        4   5 W@LOC3
     I                                        6   6 W@LOC4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FC3     KLIST
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
     C                     KFLD           S@LOC3
     C                     KFLD           S@LOC4
     C           K#FC3X    KLIST
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
      *
     C           K#FC1     KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C           K#AFX     KLIST
     C                     KFLD           AWLOC1
     C                     KFLD           AWLOC2
     C                     KFLD           AWLOC3
     C                     KFLD           AWLOC4
     C                     KFLD           KNE
     C                     KFLD           KTU
     C                     KFLD           KHI
     C                     KFLD           KBIN
      *
     C           K#APL     KLIST
     C                     KFLD           K@JOKN  2
     C                     KFLD           K@KANB  1
      *
     C                     MOVE '01'      W@ID    2
     C                     EXSR #SET
      *
     C                     ENDSR
      *------------------------------------------------------
      *   SET DATA FOR 1ST SCREEN
      *------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     DO   68
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELKEY,1     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
      *
     C                     SELEC
      * F3
     C           *INKC     WHEQ *ON
     C                     MOVEL'99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
      * F5
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
      *
     C                     EXSR #OUT
     C                     MOVEL'99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
      *
     C                     MOVE *BLANK    LOC
     C                     Z-ADD*ZERO     @@RRN
     C                     Z-ADD*ZERO     A       30
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVEA'000'     *IN,61
     C           S@LOC     IFNE *BLANK
     C           S@LOC     LOKUPLOC                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         A
     C                     MOVE S@LOC     LOC,A
     C                     ELSE
     C                     SETON                     6199
     C                     ENDIF
      *
     C           S@LOC2    IFEQ '**'
     C           S@LOC4    OREQ '*'
     C                     SETON                     6199
     C                     ENDIF
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           A         IFEQ *ZERO
     C           1         CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     SETON                     6199
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CLEAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #OUT      BEGSR
      *------------------------------------------------------
     C                     MOVEA'00'      *IN,31
     C                     Z-ADD*ZERO     @@RRN
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@LOC     ANDNE*BLANK
      *
     C                     EXSR #WRT
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #WRT      BEGSR
      *------------------------------------------------------
     C           K#FC3     SETLLFCEPL03              80
     C           *IN80     DOUEQ*ON
     C           K#FC3X    READEFCEPL03                  80
     C           *IN80     IFEQ *OFF
     C           A2GSKD    ANDEQ*BLANK
     C           S@LOC3    IFNE '* '
     C           S@LOC3    ANDNE' *'
     C           S@LOC3    ANDNE'**'
     C           S@LOC3    ANDNEA2STRR
     C                     LEAVE
     C                     ENDIF
      *
     C           S@LOC4    IFNE A2STRD
     C                     ITER
     C                     ENDIF
      *
     C                     CLEARAH#WP751
     C                     MOVE A2STRK    AWLOC1
     C                     MOVE A2STRT    AWLOC2
     C                     MOVE A2STRR    AWLOC3
     C                     MOVE A2STRD    AWLOC4
     C                     MOVE A2BHB1    AWHIN1
     C                     MOVE A2BHB2    AWHIN2
     C                     MOVE A2BHB3    AWHIN3
      * PROCESS
     C                     EXSR #PRC
      *
     C                     WRITEAH#WP751
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
     C           #PRC      BEGSR
      *------------------------------------------------------
     C           K#FC1     CHAINAAMPL11              95
     C           *IN95     IFEQ *OFF
      *
     C                     Z-ADD15        K       20
     C                     Z-ADD*ZERO     B       20
     C                     DO   15
     C           NTOK,K    IFNE *BLANK
     C           NTOK,K    ANDNE'------'
     C                     ADD  1         B
     C           B         IFEQ 1
     C                     MOVE NKAN,K    KANSY   1
     C                     Z-ADDKANK,K    KHIB
     C                     MOVELNKOT,K    AWPROC
     C                     MOVELNKBN,K    AWPICK
     C                     ENDIF
     C           B         IFEQ 2
     C                     MOVELNTOK,K    W@LOC
     C                     MOVE W@LOC1    AWSLC1
     C                     MOVE W@LOC2    AWSLC2
     C                     MOVE W@LOC3    AWSLC3
     C                     MOVE W@LOC4    AWSLC4
     C                     MOVELNKOT,K    AWPRC2
     C                     ENDIF
      *
     C           B         IFEQ 3
     C                     MOVELNKOT,K    AWPRC3
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDIF
     C                     SUB  1         K
     C                     ENDDO
      * PICKUP-1
     C                     MOVE *BLANK    W@20   20
      *
     C                     SELEC
     C* ----------- *
     C           KANSY     WHEQ 'D'
     C           K#AFX     CHAINAAGPL031             26
     C           *IN26     IFEQ *OFF
      *
     C                     MOVE KANSY     K@KANB
     C                     MOVELO4KAK1    K@JOKN
     C           K#APL     CHAINAAAPL01              26
     C  N26                MOVELA5JOKM    W@20
      *
     C                     ENDIF
     C* ----------- *
     C           KANSY     WHEQ 'E'
     C           K#AFX     CHAINAAHPL031             26
     C           *IN26     IFEQ *OFF
      *
     C                     MOVE KANSY     K@KANB
     C                     MOVELL6JOK1    K@JOKN
     C           K#APL     CHAINAAAPL01              26
     C  N26                MOVELA5JOKM    W@20
     C                     ENDIF
     C* ----------- *
     C                     ENDSL
      *
     C           W@20      IFNE *BLANK
     C                     MOVELW@20      AWPICK
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
**  CMD
F3: EXIT   F5: WRITE
