     H            Y.
     F** AH#R30 **********************************
     F* .. A-PICS KANBAN INVESTIGATION LIST ..   *
     F* I-HASADA                88.10.05         *
     F* N-HYOTO   2001.05.24 DISPLAY SYSTEM DATE *
     F******************************** AH#R30 ****
     FAH#PW30 CF  E                    WORKSTN
     FAGAPL31 IF  E           K        DISK
     FAH#WP30 IF  E           K        DISK                      A
     E                    ER      1   8 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1   80YMD
     I                                        1   40YY
     I                                        5   60MM
     I                                        7   80DD
     I            DS
     I                                        1   80AHSKHZ
     I                                        1   40AHSKYY
     I                                        5   60AHSKMM
     I                                        7   80AHSKDD
     I            DS
     I                                        1   80AHKOHZ
     I                                        1   40AHKOYY
     I                                        5   60AHKOMM
     I                                        7   80AHKODD
     I            DS
     I                                        1   60WTIME
     I                                        1   20AHKOHH
     I                                        3   40AHKOSS
     C           KEY       KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      *
     C           KEYA      KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
     C                     KFLD           YMD
     C                     KFLD           BIN
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10        ﾏｰﾅﾞｰ xb
     C                     Z-ADD0         AHSKHZ
      *
     C**********           Z-ADD0         YMD
     C                     Z-ADD*DATE     YMD
     C                     Z-ADD1         BIN
     C                     SETOF                     60
      *
     C           STP1      TAG
     C                     MOVE *BLANK    HIN1
     C                     MOVE *BLANK    HIN2
     C                     MOVE *BLANK    HIN3
      *
     C           STP2      TAG
     C                     EXFMTAH#PW301
     C                     SETOF                     010203
     C                     SETOF                     0405
     C                     SETOF                     99
      *
     C*  CMD-1
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*  ﾆｫob ﾍ]ﾌﾞ] kｩｮh
     C           HIN1      IFEQ *BLANK
     C           HIN2      ANDEQ*BLANK
     C           HIN3      ANDEQ*BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     SETOF                     10
     C           KEY       CHAINAGAPL311             10
     C           *IN10     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C*  kｭcﾅﾍﾞ kｩｮh
     C           YMD       IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
      *
     C           YY        IFLT 1988
     C           MM        ORGT 12
     C           MM        ORLT 01
     C           DD        ORGT 31
     C           DD        ORLT 01
     C                     SETON                     0299
     C                     MOVE ER,4      MSG
     C                     GOTO STP2
     C                     END
      *
     C*  ﾆﾞf] & ﾍﾞ] kｩｮh
     C           BIN       IFEQ 0
     C                     SETON                     0399
     C                     MOVE ER,5      MSG
     C                     GOTO STP2
     C                     END
      *
     C  NKE                GOTO STP2
     C*  lbf
     C                     SETOF                     90
     C           KEYA      CHAINAH#WP301             90
     C           *IN90     IFEQ '0'
     C           AHSKJY    IFEQ 'D'
     C           AHSKHZ    ANDLE*DATE
     C                     GOTO STP2
     C                     END
     C                     SETON                     010203
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     Z-ADD*DATE     AHKOHZ
     C                     TIME           WTIME
     C                     MOVELUS        AHKOME
     C                     MOVELHIN1      AHHIN1
     C                     MOVELHIN2      AHHIN2
     C                     MOVELHIN3      AHHIN3
     C                     Z-ADDYMD       AHYMD
     C                     Z-ADDBIN       AHBIN
      *
     C                     SETON                     U1
     C   90                WRITEAH#WP301
      *
     C                     SETON                       60
     C                     GOTO STP1
      *
**  ERR
E-01 INPUT INTRAL COMPANY PART NO
E-02 THERE ISN'T INT CO P/N IN LEVELD PROD FIXED ORDERING F
E-03 INPUT INVESTIGATION DAY
E-04 INVESTIGATION DAY ISN'T RIGHT
E-05 INPUT INVESTIGATION TIME OR BIN
E-06 ADD WAS APPOINTED, BUT M/F EXIST.
E-07 SHIPMENT INFORMATION IS < Y/N >.
E-08 STAYRDAY KANBAN INFOMATION IS < Y/N >
