     H            Y.                                    1
     H** AH#R3B1 ***************************************************************
     H*  GET JUDGE TS LINE                                                     *
     H*
     H* TCHK  09/22/10 CREATE
     H**************************************************************************
     FAAMPL11 IF  E           K        DISK
      *
     FFCDPP9A IF  E           K        DISK
      **************************************************************************
     E                    CHG        15 10 0
     E* NEW
     E                    MCN        15  3               N MACHINE
     E                    PRT        15 12               N PART NUMBER
     E* OLD
     E                    MCX        15  3               O MACHINE
     E                    PRX        15 12               O PART NUMBER
     E* CURRENT
     E                    @MCN       15  3               MACHINE
     E                    @PRT       15 12               PART NUMBER
     E*
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I            DS
     I                                        1 150 CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  100@CHG
     I                                        1   80@CHGDT
     I            DS
     I                                        1  45 N@MCN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  45 O@MCX
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1 180 N@PRT
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1 180 O@PRX
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
      *----------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PMHIN1  5
     C                     PARM           PMHIN2  5
     C                     PARM           PMHIN3  2
     C                     PARM           PMRSLT  1
     C                     MOVEL*BLANK    PMRSLT
     C*
     C                     TIME           WSDT
     C*
     C           K#AMP     KLIST
     C                     KFLD           PMHIN1
     C                     KFLD           PMHIN2
     C                     KFLD           PMHIN3
     C           K#AMP     CHAINAAMPL11              99
     C           *IN99     IFEQ *ON
     C           CKSKJY    ORNE *BLANK
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C                     END
     C*
     C                     MOVEAN@MCN     MCN
     C                     MOVEAN@PRT     PRT
     C                     MOVEAO@MCX     MCX
     C                     MOVEAO@PRX     PRX
     C*
     C                     DO   15        J       20
     C                     MOVELCHG,J     @CHG
     C           @CHGDT    IFGT WSSDAT
     C                     MOVELMCX,J     @MCN,J           MACHINE
     C                     MOVELPRX,J     @PRT,J           PART NUMBER
     C                     ELSE
     C                     MOVELMCN,J     @MCN,J           MACHINE
     C                     MOVELPRT,J     @PRT,J           PART NUMBER
     C                     END
     C                     ENDDO
     C*
     C                     DO   15        J       20
     C           @MCN,J    IFNE *BLANK
     C           @MCN,J    CHAINFCDPP9A              97
     C           *IN97     IFEQ *OFF
     C           F9SKBN    ANDEQ*BLANK
     C                     MOVEL*ON       PMRSLT
     C                     LEAVE
     C                     END
     C                     END
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C**************************************************************************
