     H            Y.
     F*** AH#R11 *************************************
     F* ... A-PICS KANBAN PUBLICATION TOTALIZATION LIST...*
     F* ...DEPARTMENT CODE / YEAR MONTH APPOINTMENT... *
     F* I-HASADA                     96.03.04        *
     F************************************* AH#R11 ***
     FAH#TL11 IF  E           K        DISK
     FAH#WP11 O   F     100            DISK
     E                    HBM        10  4 0             ﾎﾞy]ﾃｰnﾞ
     I            DS
     I                                        1   60WYYMM
     I                                        1   40WYY
     I                                        5   60WMM
      *
     C           KEY       KLIST
     C                     KFLD           WBMON
     C                     KFLD           WYY
     C                     KFLD           WMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PBMON   4
     C                     PARM           PYYMM   6
     C                     MOVE PBMON     WBMON   40
     C                     MOVE PYYMM     WYYMM
      *
     C                     Z-ADD0         HBM
     C                     Z-ADDWBMON     HBM,1
     C           WBMON     IFEQ 8990
     C                     Z-ADD5665      HBM,2
     C                     Z-ADD8958      HBM,3
     C                     END
      *
     C                     Z-ADD1         X       20
     C           1         DO   10        X
     C           HBM,X     IFNE 0
     C                     Z-ADDHBM,X     WBMON
      *
     C           KEY       SETLLAH#TL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY       READEAH#TL111                 02
     C           *IN02     IFEQ '0'
      *
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
     C           CFHTBB    IFGT 12
     C                     GOTO END
     C                     END
      *
     C                     EXCPTDT
      *
     C           END       TAG
     C                     END
     C  N02                END
      *
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OAH#WP11 E                DT
     O                         CFBMON     4
     O                         CFHTYY     8
     O                         CFHTMM    10
     O                         CFHTDD    12
     O                         CFHTBB    14
     O                         CFMAIS    17
