     H            Y
     F**************************************************************/
     F* ST ONEWAY INQUIRY & UPDATE OF FIXED ORDERING ACCUMULATION  */
     F*      Y.MAEDA               2021.03.04                      */
     F**************************************************************/
     FAHAPW15 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL01
     F                                              KINFDS @INFDS
     FACAPL11 IF  E           K        DISK
     FAH#TL29 IF  E           K        DISK
     FAH#PL23 UF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAS#PL11 IF  E           K        DISK
     FATAPLI2 IF  E           K        DISK
     F            ATAPL051                          KRENAMEMINOI1R
     E                    $MSG    1  17 60
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  140WTIME
     I                                        1   20WTIM1
     I                                        3   40WTIM2
     I                                        5   60WTIM3
     I                                        7  140WKYM
     I            DS
     I                                        1   5 @HIN1
     I                                        6   6 @H1
     I                                        7  11 @HIN2
     I                                       12  12 @H2
     I                                       13  14 @HIN3
     I                                        1  14 @HIN
     I            DS
     I                                        1   80WYMD
     I                                        1   40WHTYY
     I                                        5   60WHTMM
     I                                        7   80WHTDD
     I            DS
     I                                        1   80WWDATE
     I                                        1   40WWHY
     I                                        5   60WWHM
     I                                        7   80WWHD
     I            DS
     I                                        1   40WCFYY
     I                                        5   60WCFMM
     I                                        7   80WCFDD
     I                                        1   80WCDATE
     I            DS
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
     I                                        1   80WKYMD
     I            DS
     I                                        1   4 WHY
     I                                        5   5 WS1
     I                                        6   7 WHM
     I                                        8   8 WS2
     I                                        9  10 WHD
     I                                       11  11 WS3
     I                                       12  13 WBI
     I                                        1  13 WK01
     I            DS
     I                                        1  14 @MKMEI
     I                                       14  14 @MK14
     I            DS
     I                                        1   80W@HTHZ
     I                                        1   40W@HTYY
     I                                        5   60W@HTMM
     I                                        7   80W@HTDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 USER
     C*------------------------*
     C*   KLIST の作成       *
     C*------------------------*
     C           #KEY      KLIST
     C                     KFLD           WBUMN   40
     C                     KFLD           WHIN1   5
     C                     KFLD           WHIN2   5
     C                     KFLD           WHIN3   2
     C*
     C           #KEY1     KLIST
     C                     KFLD           WBUMN
     C                     KFLD           WHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C                     KFLD           WKTYY   40
     C                     KFLD           WKTMM   20
     C                     KFLD           WKTDD   20
     C*
     C           #KEY2     KLIST
     C                     KFLD           WFLD1   4
     C                     KFLD           WFLD2   3
     C           #AH23     KLIST
     C                     KFLD           WFLD1   4
     C                     KFLD           WFLD2   3
     C                     KFLD           K@HTHZ  80
     C                     KFLD           K@HTBB  20
     C*
     C           #KEY3     KLIST
     C                     KFLD           WFLD1
     C                     KFLD           WFLD2
     C                     KFLD           W@HTYY  40
     C                     KFLD           W@HTMM  20
     C                     KFLD           W@HTDD  20
     C*
     C                     MOVEL$MSG,5    @HEAD
     C*
     C***************************
     C* 第１画面処理　　    *
     C***************************
     C           $100S     TAG
     C*
     C                     EXFMTAHAPW151
     C                     SETOF                     2099
     C                     MOVE *BLANK    @ERR
     C                     MOVE *ZERO     X       40
     C                     MOVE *ZERO     CTRX   100
     C           *IN01     IFEQ '1'
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C*
     C* HELP ﾎﾞy]ﾆｭcfb
     C*
     C           *INKI     IFEQ *ON
     C                     CALL 'GGBR19'
     C                     GOTO $100S
     C                     END
     C*
     C* 部門コードチェツク
     C                     MOVE @BUMN     WBUMN
     C                     MOVE *BLANK    WSW1    1
     C           WBUMN     SETLLACAPL111
     C*
     C                     DO   *HIVAL
     C                     SETOF                     56
     C           WBUMN     READEACAPL111                 56
     C           *IN56     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
     C*
     C                     SETON                     56
     C                     MOVE '*'       WSW1
     C*
     C                     END
     C                     END
     C  N56                END
     C*
     C***************************
     C* 第２画面処理　　    *
     C***************************
     C           $200S     TAG
     C*
     C                     MOVE WBUMN     @BUMN
     C           WBUMN     CHAINFGBPL011             56
     C           *IN56     IFEQ '0'
     C                     MOVELB2SMEI    @BMNM
     C                     ELSE
     C                     MOVE *BLANK    @BMNM
     C                     END
     C*
     C           $200SS    TAG
     C*
     C                     MOVEL$MSG,5    @HEAD
     C                     EXFMTAHAPW152
     C                     MOVE *BLANK    @ERR
     C                     SETOF                     992021
     C           *IN01     IFEQ '1'
     C                     SETON                       LR
     C                     RETRN
     C                     END
     C           *IN03     IFEQ '1'
     C                     MOVE *BLANK    @HIN1
     C                     MOVE *BLANK    @HIN2
     C                     MOVE *BLANK    @HIN3
     C                     MOVE *ZERO     @DATE
     C                     MOVE *BLANK    @ERR
     C                     SETOF                     99
     C*
     C                     MOVE *BLANK    @BUMN
     C                     MOVE *BLANK    @BMNM
     C                     GOTO $100S
     C                     END
     C           @HIN      IFEQ *BLANK
     C                     SETON                       9921
     C                     MOVEL$MSG,2    @ERR
     C                     GOTO $200S
     C                     END
     C                     MOVE '-'       @H1
     C           @HIN3     IFEQ *BLANK
     C                     MOVE *BLANK    @H2
     C                     ELSE
     C                     MOVE '-'       @H2
     C                     END
     C                     MOVE @BUMN     WBUMN
     C                     MOVE @HIN1     WHIN1
     C                     MOVE @HIN2     WHIN2
     C                     MOVE @HIN3     WHIN3
     C                     MOVE @DATE     WYMD
     C                     MOVE WHTYY     WKTYY
     C                     MOVE WHTMM     WKTMM
     C                     MOVE WHTDD     WKTDD
     C                     SETOF                     81
     C                     Z-ADD0         RRN
     C                     Z-ADD0         WKRRN
     C                     Z-ADD1         W#RRNP  40
     C                     Z-ADD0         X
     C*
     C                     MOVEL*ON       *IN70
     C                     MOVEL*OFF      *IN71
     C                     WRITESCTL
     C                     MOVEL*OFF      *IN70
     C*
     C           #KEY1     SETLLAH#TL291
     C*
     C           RETRY     TAG
     C*
     C                     DO   *HIVAL
     C           #KEY      READEAH#TL291                 81
     C   81                LEAVE
     C           CFSKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     MOVE CFHTYY    WCFYY
     C                     MOVE CFHTMM    WCFMM
     C                     MOVE CFHTDD    WCFDD
     C*
     C           WCDATE    IFGE @DATE
     C                     EXSR @SUBFL
     C                     Z-ADD*ZERO     @HTYMD
     C                     ADD  1         RRN     40
     C                     MOVE *BLANK    @KUBNX
     C                     WRITESFL01
     C                     END
     C                     ENDDO
     C*
     C           DSPLAY    TAG
     C*
     C           RRN       IFEQ *ZERO
     C                     SETON                     99
     C                     MOVEL$MSG,1    @ERR
     C                     GOTO $200SS
     C                     END
     C                     Z-ADDRRN       WKRRN   40
     C***************************
     C* 第３画面処理　　    *
     C***************************
     C           $300S     TAG
     C*
     C                     SETON                     71
     C                     WRITEAHAPW153
     C                     Z-ADDW#RRNP    @SFRCD
     C                     EXFMTSCTL
     C                     SETOF                     71
     C                     SETOF                       99
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RRNP
     C                     END
     C                     MOVE *BLANK    @ERR
     C                     MOVE *BLANK    WKAN
     C           *INKC     IFEQ '1'
     C                     SETOF                       99
     C                     MOVE *BLANK    @ERR
     C                     MOVE *BLANK    @HIN1
     C                     MOVE *BLANK    @HIN2
     C                     MOVE *BLANK    @HIN3
     C                     Z-ADD*ZERO     @DATE
     C                     GOTO $200SS
     C                     END
     C* 更新区分チェック
     C                     Z-ADD0         S       30
     C                     SETOF                     8560
     C                     DO   *HIVAL
     C                     ADD  1         S
     C           S         CHAINSFL01                85
     C           *IN85     IFEQ '0'
     C*
     C           @KUBNX    IFNE *BLANK
     C           @KUBNX    ANDNE'0'
     C           @KUBNX    ANDNE'1'
     C                     SETON                       9960
     C                     MOVEL$MSG,6    @ERR
     C                     UPDATSFL01
     C                     SETOF                       60
     C                     GOTO $300S
     C                     END
     C*
     C           @KUBNX    IFEQ '0'
     C           @KUBNX    OREQ '1'
     C                     MOVE @ZZZ      WFLD1
     C                     MOVE @TEHAI    WFLD2
     C                     Z-ADD@HTHZ     K@HTHZ
     C                     Z-ADD@HTBB     K@HTBB
     C* 詳細明細へ
     C           @KUBNX    IFEQ '1'
     C                     ELSE
     C                     SETOF                     75
     C                     SETON                     45
     C                     END
     C                     EXSR $SB200
     C                     MOVE *BLANK    @KUBNX
     C*
     C                     END
     C                     UPDATSFL01
     C*
     C                     END
     C  N85                END
     C           SW        IFEQ '1'
     C                     MOVE '0'       SW      1
     C                     GOTO $200S
     C                     END
     C                     GOTO $300S
     C*-----------------------------------------------------*
     C* EDIT SUB-FILE                                       *
     C*-----------------------------------------------------*
     C           @SUBFL    BEGSR
     C*
     C                     ADD  1         X
     C                     ADD  1         CTRX
     C* 種　セット *
     C                     MOVE CFKDAI    @SHURI
     C* 発行日　便　セット *
     C           CFHTYY    IFEQ *ZERO
     C                     MOVE *BLANK    @HAKOD
     C                     ELSE
     C                     MOVE CFHTYY    WHY
     C                     MOVE '.'       WS1
     C                     MOVE CFHTMM    WHM
     C                     MOVE '.'       WS2
     C                     MOVE CFHTDD    WHD
     C                     MOVE '-'       WS3
     C                     MOVE CFHTBB    WBI
     C                     MOVE WK01      @HAKOD
     C                     END
     C* 手配　セット *
     C                     MOVE CFTHNO    @TEHAI
     C* 枚数　セット *
     C                     MOVE CFMAIS    @MAISU
     C* 前工程出庫日　セット *
     C           CFSYYY    IFEQ *ZERO
     C                     MOVE *BLANK    @MAKOT
     C                     ELSE
     C                     MOVE CFSYYY    WHY
     C                     MOVE '.'       WS1
     C                     MOVE CFSYMM    WHM
     C                     MOVE '.'       WS2
     C                     MOVE CFSYDD    WHD
     C                     MOVE '-'       WS3
     C                     MOVE CFSYBB    WBI
     C                     MOVE WK01      @MAKOT
     C                     END
     C* メッキ納入日　セット *
     C           CFMKYY    IFEQ *ZERO
     C                     MOVE *BLANK    @MEKID
     C                     ELSE
     C                     MOVE CFMKYY    WHY
     C                     MOVE '.'       WS1
     C                     MOVE CFMKMM    WHM
     C                     MOVE '.'       WS2
     C                     MOVE CFMKDD    WHD
     C                     MOVE '-'       WS3
     C                     MOVE CFMKBB    WBI
     C                     MOVE WK01      @MEKID
     C                     END
     C* ２加工納入日　セット *
     C           CFKAYY    IFEQ *ZERO
     C                     MOVE *BLANK    @2KAKO
     C                     ELSE
     C                     MOVE CFKAYY    WHY
     C                     MOVE '.'       WS1
     C                     MOVE CFKAMM    WHM
     C                     MOVE '.'       WS2
     C                     MOVE CFKADD    WHD
     C                     MOVE '-'       WS3
     C                     MOVE CFKABB    WBI
     C                     MOVE WK01      @2KAKO
     C                     END
     C* 絶対番号　セット *
     C                     MOVE CFZENO    @ZZZ
     C                     Z-ADDCFHTHZ    @HTHZ
     C                     Z-ADDCFHTBB    @HTBB
     C*
     C                     ENDSR
     C*
     C*-----------------------------------------------------*
     C           $SB200    BEGSR
     C*
     C                     SETOF                     45
     C           @HTYMD    IFEQ *ZERO
     C           #AH23     CHAINAH#PL23              30
     C                     ELSE
     C                     Z-ADD@HTYMD    W@HTHZ
     C                     END
     C                     MOVE @KUBNX    @KU
     C           @KUBNX    IFEQ '0'
     C                     SETON                       45
     C                     MOVE '取消'  @KUBN
     C                     END
     C           @KUBNX    IFEQ '1'
     C                     MOVE '変更'  @KUBN
     C                     END
     C                     MOVE CFKDAI    @KBN
     C                     MOVE CFTBMN    @KBCD
     C           @KBN      IFEQ 'C'
     C                     MOVEL$MSG,8    @KBNM
     C                     END
     C           @KBN      IFEQ 'D'
     C                     MOVEL$MSG,9    @KBNM
     C                     END
     C           @KBN      IFEQ 'E'
     C                     MOVEL$MSG,7    @KBNM
     C                     END
     C           @KBN      IFEQ '0'
     C                     MOVEL$MSG,15   @KBNM
     C                     END
     C           @KBCD     CHAINFGBPL011             31
     C           *IN31     IFEQ '0'
     C                     MOVELB2SMEI    @KBMEI
     C                     ELSE
     C                     MOVE *BLANK    @KBMEI
     C                     END
     C                     MOVE CFOFFL    @OFFLN
     C                     MOVE CFBLOK    @TEN2
     C                     MOVELCFBLOK    @TEN1
     C                     MOVE CFZENO    @SAGY1
     C                     MOVE CFTHNO    @SAGY2
     C                     MOVE CFCHYU    @HAKU
     C                     MOVE CFBMON    @MKCD
     C                     MOVELCFHTHZ    @HAKO
     C                     MOVE CFHTBB    @HAKO
     C                     MOVELCFSYHZ    @MAKO
     C                     MOVE CFSYBB    @MAKO
     C           @MKCD     CHAINFGBPL011             32
     C           *IN32     IFEQ '0'
     C                     MOVELB2SMEI    @MKMEI
     C                     ELSE
     C                     MOVE *BLANK    @MKMEI
     C                     END
     C                     MOVE CFMAIS    @MAISU
     C                     MOVE CFMNKB    @MIKU
     C                     MOVE CFMHKO    @MHAKO
     C                     MOVE CFBHK1    @BANHK
     C                     MOVE CFBYY1    WCFYY
     C                     MOVE CFBMM1    WCFMM
     C                     MOVE CFBDD1    WCFDD
     C                     MOVE WCDATE    @BANHI
     C                     MOVE CFBBB1    @BANBI
     C                     MOVE CFCIHI    @CYHI
     C                     MOVE CFCIBI    @CYBI
     C                     MOVE CFCIOK    @CYOK
     C                     MOVE CFKBAN    @KBAN1
     C                     MOVE CFKBNC    @KBAN2
     C                     MOVE CFBHK2    @BANKA
     C                     MOVE CFBYY2    WCFYY
     C                     MOVE CFBMM2    WCFMM
     C                     MOVE CFBDD2    WCFDD
     C                     MOVE WCDATE    @BANK1
     C                     MOVE CFBBB2    @BANK2
     C                     MOVE CFMBMN    @MEKCD
     C           CFMBMN    CHAINFGBPL011             33
     C           *IN33     IFEQ '0'
     C                     MOVELB2SMEI    @MEKME
     C                     ELSE
     C                     MOVE *BLANK    @MEKME
     C                     END
     C                     MOVELCFMKHZ    @MEKHI
     C                     MOVE CFMKBB    @MEKHI
     C                     MOVE CFBARL    @BAREL
     C                     MOVE CFMLIN    @LINE
     C                     MOVE CFJYKN    @JYOKN
     C                     MOVE CFMEK1    @HYOM1
     C                     MOVE CFMEK2    @HYOM2
     C                     MOVE CFMEK3    @HYOM3
     C                     MOVE CFSIZE    @SIZE
     C                     MOVE CFKUBI    @KUBI
     C                     MOVE CFSYUY    @SYUYO
     C                     MOVE CFCOLR    @IRO
     C                     MOVE CFTYPE    @TYPE
     C                     MOVE CFKHAK    @KAKO
     C           CFKHAK    CHAINFGBPL011             34
     C           *IN34     IFEQ '0'
     C                     MOVELB2SMEI    @KAKME
     C                     ELSE
     C                     MOVE *BLANK    @KAKME
     C                     END
     C                     MOVE CFTOKU    @TOKCD
     C           CFTOKU    CHAINFGBPL011             35
     C           *IN35     IFEQ '0'
     C                     MOVELB2SMEI    @TOKME
     C                     ELSE
     C                     MOVE *BLANK    @TOKME
     C                     END
     C                     MOVE CFNOYY    WCFYY
     C                     MOVE CFNOMM    WCFMM
     C                     MOVE CFNODD    WCFDD
     C                     MOVELCFKAHZ    @NOBI
     C                     MOVE CFKABB    @NOBI
     C                     MOVE CFHKAN    @HOKAN
     C*
     C           $400S     TAG
     C*
     C                     EXFMTAHAPW154
     C                     SETOF                     669968
     C                     SETOF                     616263
     C                     SETOF                     649098
     C                     SETOF                     657597
     C                     MOVE *BLANK    @ERR
     C           *IN03     IFEQ '1'
     C                     GOTO $200E
     C                     END
     C* 更新処理   *
     C           @KUBNX    IFEQ '1'
     C           *IN05     IFEQ '1'
     C           @HTYMD    IFEQ *ZERO
     C           #AH23     CHAINAH#PL23              30
     C                     ELSE
     C                     Z-ADD@HTYMD    W@HTHZ
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVEL@HAKO     WWDATE
     C                     MOVE @HAKO     CFHTBB
     C                     MOVE WWHY      CFHTYY
     C                     MOVE WWHM      CFHTMM
     C                     MOVE WWHD      CFHTDD
     C                     MOVEL@MAKO     WWDATE
     C                     MOVE @MAKO     CFSYBB
     C                     MOVE WWHY      CFSYYY
     C                     MOVE WWHM      CFSYMM
     C                     MOVE WWHD      CFSYDD
     C                     MOVEL@MEKHI    WWDATE
     C                     MOVE @MEKHI    CFMKBB
     C                     MOVE WWHY      CFMKYY
     C                     MOVE WWHM      CFMKMM
     C                     MOVE WWHD      CFMKDD
     C                     MOVEL@NOBI     WWDATE
     C                     MOVE @NOBI     CFKABB
     C                     MOVE WWHY      CFKAYY
     C                     MOVE WWHM      CFKAMM
     C                     MOVE WWHD      CFKADD
     C                     MOVE CFMAIS    WKMAIS  30
     C                     MOVE @MAISU    CFMAIS
     C                     Z-ADD*YEAR     CFKOYY
     C                     Z-ADDUMONTH    CFKOMM
     C                     Z-ADDUDAY      CFKODD
     C                     Z-ADD0         CFSKYY
     C                     Z-ADD0         CFSKMM
     C                     Z-ADD0         CFSKDD
     C                     TIME           WTIME
     C                     Z-ADDWTIM1     CFKOHH
     C                     Z-ADDWTIM2     CFKOSS
     C                     MOVE USER      CFKOME
     C                     MOVE ' '       CFSKJY
     C                     MOVE @OFFLN    CFOFFL
     C           @HTYMD    IFEQ *ZERO
     C                     EXCPTCHG
     C                     EXSR @SUBFL
     C                     ELSE
     C                     EXSR @SUBFL
     C                     Z-ADDCFHTYY    W@HTYY
     C                     Z-ADDCFHTMM    W@HTMM
     C                     Z-ADDCFHTDD    W@HTDD
     C                     Z-ADDW@HTHZ    @HTYMD
     C                     END
     C*
     C                     SETOF                         88
     C           #KEY2     CHAINAS#PL11              88
     C           *IN88     IFEQ '0'
     C                     MOVE @MAISU    CUMAIS
     C*                    UPDATAS#PL111
     C                     END
     C*
     C                     Z-ADD0         FLG     10
     C           CFTBMN    IFEQ 0111
     C                     SETOF                         80
     C           #KEY2     CHAINATAPLI2              80
     C           *IN80     IFEQ '0'
     C                     MOVE @MAISU    CTMAIS
     C           WKMAIS    SUB  @MAISU    WKSA    30
     C           WKSA      IFEQ CTGMHK
     C*                    DELETMINOI1R
     C                     ELSE
     C           @MAISU    IFGT WKMAIS
     C           WKSA      MULT -1        WKSA
     C           CTGMHK    ADD  WKSA      CTGMHK
     C                     ELSE
     C           CTGMHK    SUB  WKSA      CTGMHK
     C                     END
     C*                    UPDATMINOI1R
     C                     Z-ADD1         FLG
     C                     END
     C                     END
     C                     END
     C*
     C                     MOVE *ZERO     CFHTBB
     C                     MOVE *ZERO     CFHTYY
     C                     MOVE *ZERO     CFHTMM
     C                     MOVE *ZERO     CFHTDD
     C                     MOVE *ZERO     CFSYBB
     C                     MOVE *ZERO     CFSYYY
     C                     MOVE *ZERO     CFSYMM
     C                     MOVE *ZERO     CFSYDD
     C                     MOVE *ZERO     CFMKBB
     C                     MOVE *ZERO     CFMKYY
     C                     MOVE *ZERO     CFMKMM
     C                     MOVE *ZERO     CFMKDD
     C                     MOVE *ZERO     CFKABB
     C                     MOVE *ZERO     CFKAYY
     C                     MOVE *ZERO     CFKAMM
     C                     MOVE *ZERO     CFKADD
     C                     SETOF                     808283
     C                     SETOF                     848687
     C                     SETOF                     88
     C                     GOTO $200E
     C                     END
     C                     END
     C                     ELSE
     C*
     C           *IN05     IFEQ '1'
     C           @HTYMD    IFEQ *ZERO
     C           #AH23     CHAINAH#PL23              30
     C                     ELSE
     C                     Z-ADD@HTYMD    W@HTHZ
     C                     END
     C           *IN30     IFEQ '0'
     C           CFTBMN    IFEQ 8907
     C                     GOTO ESC
     C                     END
     C                     MOVEL@HAKO     WWDATE
     C                     MOVE @HAKO     CFHTBB
     C                     MOVE WWHY      CFHTYY
     C                     MOVE WWHM      CFHTMM
     C                     MOVE WWHD      CFHTDD
     C                     MOVEL@MAKO     WWDATE
     C                     MOVE @MAKO     CFSYBB
     C                     MOVE WWHY      CFSYYY
     C                     MOVE WWHM      CFSYMM
     C                     MOVE WWHD      CFSYDD
     C                     MOVEL@MEKHI    WWDATE
     C                     MOVE @MEKHI    CFMKBB
     C                     MOVE WWHY      CFMKYY
     C                     MOVE WWHM      CFMKMM
     C                     MOVE WWHD      CFMKDD
     C                     MOVEL@NOBI     WWDATE
     C                     MOVE @NOBI     CFKABB
     C                     MOVE WWHY      CFKAYY
     C                     MOVE WWHM      CFKAMM
     C                     MOVE WWHD      CFKADD
     C                     MOVE @MAISU    CFMAIS
     C                     MOVE 'D'       CFSKJY
     C                     Z-ADD*YEAR     CFKOYY
     C                     Z-ADDUMONTH    CFKOMM
     C                     Z-ADDUDAY      CFKODD
     C                     Z-ADD*YEAR     CFSKYY
     C                     Z-ADDUMONTH    CFSKMM
     C                     Z-ADDUDAY      CFSKDD
     C                     TIME           WTIME
     C                     Z-ADDWTIM1     CFKOHH
     C                     Z-ADDWTIM2     CFKOSS
     C                     MOVE USER      CFKOME
     C           @HTYMD    IFEQ *ZERO
     C                     EXCPTCHG
     C                     EXSR @SUBFL
     C                     ELSE
     C                     EXSR @SUBFL
     C                     Z-ADDCFHTYY    W@HTYY
     C                     Z-ADDCFHTMM    W@HTMM
     C                     Z-ADDCFHTDD    W@HTDD
     C                     Z-ADDW@HTHZ    @HTYMD
     C                     END
     C                     MOVE '1'       SW      1
     C*
     C                     SETOF                         88
     C           #KEY2     CHAINAS#PL11              88
     C           *IN88     IFEQ '0'
     C                     MOVE 'D'       CUSKJY
     C*                    UPDATAS#PL111
     C                     END
     C*
     C                     Z-ADD0         FLG     10
     C           CFTBMN    IFEQ 0111
     C                     SETOF                     80
     C           #KEY2     CHAINATAPLI2              80
     C           *IN80     IFEQ '0'
     C*                    DELETMINOI1R
     C                     Z-ADD1         FLG
     C                     END
     C                     END
     C*
     C           FLG       IFEQ 1
     C                     GOTO E
     C                     END
     C           CFTBMN    IFEQ 0111
     C                     SETOF                     86
     C           #KEY2     CHAINATAPLI2              86
     C           *IN86     IFEQ '0'
     C*                    DELETMINOI1R
     C                     END
     C                     END
     C*
     C           E         TAG
     C*
     C                     END
     C                     MOVE *ZERO     CFHTBB
     C                     MOVE *ZERO     CFHTYY
     C                     MOVE *ZERO     CFHTMM
     C                     MOVE *ZERO     CFHTDD
     C                     MOVE *ZERO     CFSYBB
     C                     MOVE *ZERO     CFSYYY
     C                     MOVE *ZERO     CFSYMM
     C                     MOVE *ZERO     CFSYDD
     C                     MOVE *ZERO     CFMKBB
     C                     MOVE *ZERO     CFMKYY
     C                     MOVE *ZERO     CFMKMM
     C                     MOVE *ZERO     CFMKDD
     C                     MOVE *ZERO     CFKABB
     C                     MOVE *ZERO     CFKAYY
     C                     MOVE *ZERO     CFKAMM
     C                     MOVE *ZERO     CFKADD
     C*
     C           ESC       TAG
     C*
     C                     SETOF                     808283
     C                     SETOF                     848687
     C                     SETOF                     88
     C                     GOTO $200E
     C                     END
     C                     END
     C************************
     C*  チェツク処理      *
     C************************
     C                     MOVEL@HAKO     WKYMD
     C                     EXSR $SB210
     C           *IN90     IFEQ '1'
     C           *IN98     OREQ '1'
     C                     SETON                       9961
     C                     MOVEL$MSG,3    @ERR
     C                     GOTO $400S
     C                     END
     C           @MAKO     IFNE *ZERO
     C                     MOVEL@MAKO     WKYMD
     C                     EXSR $SB210
     C                     END
     C           *IN90     IFEQ '1'
     C           *IN98     OREQ '1'
     C                     SETON                       9962
     C                     MOVEL$MSG,3    @ERR
     C                     GOTO $400S
     C                     END
     C           @MEKHI    IFNE *ZERO
     C                     MOVEL@MEKHI    WKYMD
     C                     EXSR $SB210
     C                     END
     C           *IN90     IFEQ '1'
     C           *IN98     OREQ '1'
     C                     SETON                       9963
     C                     MOVEL$MSG,3    @ERR
     C                     GOTO $400S
     C                     END
     C           @NOBI     IFNE *ZERO
     C                     MOVEL@NOBI     WKYMD
     C                     EXSR $SB210
     C                     END
     C*
     C           @MAISU    IFEQ *ZERO
     C                     SETON                     657599
     C                     SETON                     6899
     C                     MOVEL$MSG,16   @ERR
     C                     GOTO $400S
     C                     END
     C           *IN90     IFEQ '1'
     C           *IN98     OREQ '1'
     C                     SETON                       9964
     C                     MOVEL$MSG,3    @ERR
     C                     GOTO $400S
     C                     END
     C           @HAKO     IFEQ *ZERO
     C                     SETON                       9962
     C                     MOVEL$MSG,10   @ERR
     C                     GOTO $400S
     C                     END
     C           @HAKO     IFGT @MAKO
     C                     SETON                     619962
     C                     MOVEL$MSG,11   @ERR
     C                     GOTO $400S
     C                     END
     C*
     C           @OFFLN    IFEQ '*'
     C           @OFFLN    OREQ *BLANK
     C                     ELSE
     C                     SETON                     9799
     C                     MOVEL$MSG,17   @ERR
     C                     GOTO $400S
     C                     END
     C           @MEKHI    IFNE *ZERO
     C           @MEKHI    IFNE 9999999999
     C           @MAKO     IFGT @MEKHI
     C                     SETON                     629963
     C                     MOVEL$MSG,12   @ERR
     C                     GOTO $400S
     C                     END
     C                     END
     C                     END
     C           @NOBI     IFNE *ZERO
     C           @NOBI     IFNE 9999999999
     C           @MEKHI    IFGT @NOBI
     C                     SETON                     639964
     C                     MOVEL$MSG,13   @ERR
     C                     GOTO $400S
     C                     END
     C                     END
     C                     END
     C           @HOKAN    IFNE 'N'
     C           @HOKAN    IFNE 'K'
     C           @HOKAN    IFNE *BLANK
     C                     SETON                       9966
     C                     MOVEL$MSG,14   @ERR
     C                     GOTO $400S
     C                     END
     C                     END
     C                     END
     C                     GOTO $400S
     C*
     C           $200E     TAG
     C*
     C                     SETOF                       99
     C                     MOVE *BLANK    @ERR
     C                     MOVE *ZERO     @KBCD
     C                     MOVE *BLANK    @KBMEI
     C                     MOVE *BLANK    @HAKO
     C                     MOVE *BLANK    @OFFLN
     C                     MOVE *BLANK    @TEN1
     C                     MOVE *BLANK    @TEN2
     C                     MOVE *BLANK    @SAGY1
     C                     MOVE *BLANK    @SAGY2
     C                     MOVE *BLANK    @HAKU
     C                     MOVE *ZERO     @MKCD
     C                     MOVE *BLANK    @MKMEI
     C                     MOVE *BLANK    @MAKO
     C                     MOVE *BLANK    @MIKU
     C                     MOVE *ZERO     @MHAKO
     C                     MOVE *ZERO     @BANHK
     C                     MOVE *ZERO     @BANBI
     C                     MOVE *ZERO     @CYHI
     C                     MOVE *ZERO     @CYBI
     C                     MOVE *ZERO     @CYOK
     C                     MOVE *BLANK    @KBAN1
     C                     MOVE *BLANK    @KBAN2
     C                     MOVE *ZERO     @BANKA
     C                     MOVE *ZERO     @BANK1
     C                     MOVE *ZERO     @BANK2
     C                     MOVE *ZERO     @MEKCD
     C                     MOVE *BLANK    @MEKME
     C                     MOVE *BLANK    @MEKHI
     C                     MOVE *BLANK    @BAREL
     C                     MOVE *BLANK    @LINE
     C                     MOVE *BLANK    @JYOKN
     C                     MOVE *BLANK    @HYOM1
     C                     MOVE *BLANK    @HYOM2
     C                     MOVE *BLANK    @HYOM3
     C                     MOVE *ZERO     @SIZE
     C                     MOVE *ZERO     @KUBI
     C                     MOVE *ZERO     @SYUYO
     C                     MOVE *BLANK    @IRO
     C                     MOVE *BLANK    @TYPE
     C                     MOVE *ZERO     @KAKO
     C                     MOVE *BLANK    @KAKME
     C                     MOVE *ZERO     @TOKCD
     C                     MOVE *BLANK    @TOKME
     C                     MOVE *ZERO     @NOBI
     C                     MOVE *BLANK    @HOKAN
     C                     MOVE 'C'       WKAN    1
     C                     ENDSR
     C*******  日付のチエック   *************************
     C           $SB210    BEGSR
     C*
     C                     MOVEA'0000'    *IN,90
     C                     MOVE WKYY      HY      40
     C                     MOVE WKMM      HM      20
     C                     MOVE WKDD      HD      20
     C*
     C           K#AGD     KLIST
     C                     KFLD           HY
     C                     KFLD           HM
     C                     KFLD           HD
     C           K#AGD     CHAINAGDPL12              90
     C*
     C           HM        IFLT 01
     C           HM        ORGT 12
     C                     SETON                       98
     C                     END
     C*
     C                     ENDSR
     OAH#PL231E                CHG
     O                         CFHTBB
     O                         CFHTYY
     O                         CFHTMM
     O                         CFHTDD
     O                         CFSYBB
     O                         CFSYYY
     O                         CFSYMM
     O                         CFSYDD
     O                         CFMKBB
     O                         CFMKYY
     O                         CFMKMM
     O                         CFMKDD
     O                         CFKABB
     O                         CFKAYY
     O                         CFKAMM
     O                         CFKADD
     O                         CFMAIS
     O                         CFSKJY
     O                         CFSKYY
     O                         CFSKMM
     O                         CFSKDD
     O                         CFKOYY
     O                         CFKOMM
     O                         CFKODD
     O                         CFKOHH
     O                         CFKOSS
     O                         CFKOME
     O                         CFOFFL
**
THERE ISN'T APPLICABLE DATA
INPUT PART NO
DATE APPOINTMENT ERROR
APPLICABLE DATA DISPLAYED ENTIRELY
ST ONEWAY INQ & UPD OF FIXED ODR ACCUMULATION F
DIFFERENT IN UPDATE INSTRUCTION 1:CHANGE 0:CANCEL
PICK-UP KANBAN
PLATING KANBAN
TUNNEL KANBAN
INPUT PRECEDING PROCESS OUTGOING DAY BIN
KANBAN PUBLICATION DATE BIN > PRE PROC OUTGOING DAY BIN
PRE PROC OUTGOING DAY BIN > PLATING DATE OF DELIVERY BIN
PLATING DATE OF DELV BIN > PROC POINT DATE OF DELV BIN
<N> OR <K> DIFFERENT IN SAFEKEEPING INSTRUCTION
COMPLETION PART KANBAN
NUMBER OF KANBAN SHOULD MORE THAN ONE
WORNG EXCEPTION UNDELIVERED
