     H            Y.
     F** AHBR02 *******************************************************
     F*  A-PICS ORDER STATUS INFO.                                    *
     F*  14.06.20 KIRI                                                *
     F*---------------------------------------------------------------*
     F*  CALL PARAMETERS
     F*                    CALL 'AHBR02'
     F*                    PARM           P@MODE  1      IN
     F*                    PARM           P@HIN1  5      IN
     F*                    PARM           P@HIN2  5      IN
     F*                    PARM           P@HIN3  2      IN
     F*  P@MODE=1  --> READ AJZPL31  (KANBAN ISSUE FILE2)
     F*  P@MODE<>1 --> READ AH#TL19  (KANBAN ORDER DATA ACCUMULATION)
     F*---------------------------------------------------------------*
     F* CHANGE DATE| PROGRAMMER  | ID  | MEMO                         *
     F*---------------------------------------------------------------*
     F* 2015/10/26 | JW (SRA)    | JW1 | ADD F22:INV                  *
     F* 2015/11/3  | JW (SRA)    | JW2 | ADD INV ON SCREEN            *
     F* 2016/06/21 | JW (SRA)    | JW3 | CHG START DATE               *
     F* 2016/08/04 | T.SAKAKI    |%0001| ADD LOGIC FOR COMMON PART    *
     F* 2017/01/18 | JW (SRA)    | JW4 | REVERCE UNS FIELD            *
     F* 2018/02/23 | JW (SRA)    | JW5 | DISPLAY SORT SCAN DATE/TIME  *
     F* 2018/05/09 | JW (SRA)    | JW6 | FIX A BUG (SRT FIELD COLOR)  *
     F* 2019/02/04 | JW (SRA)    | JW7 | CHG COLOR OF PICKUP DATE     *
     F* 2019/08/21 | JW (SRA)    | JW8 | SET PART TO 1ST SCREEN       *
     F* 2019/09/13 | JW (SRA)    | JW9 | FIX INDEX ISSUE              *
     F* 2019/11/13 | JW (SRA)    | JWA | USE SYSTEM DATE INSTEAD OF *DATE
     F* 2020/04/17 | JW (SRA)    | JWB | CHG APLC11 --> UTLC11        *
     F* 2020/12/09 | TM (DCS)    |     | ADDING F23=AHBR10 CALL       *
     F*     //     |    //       |     | APPEARANCES ARE ARRANGED.    *
     F* 2022/04/19 | JW (SRA)    | JWC | REMOVE TEST LINE             *
     F*****************************************************************
     FAHBPW02 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FFCEPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAH#TL19 IF  E           K        DISK
     FAJZPL31 IF  E           K        DISK
JW7  FALCPL06 IF  E           K        DISK
      *
     FAFAPL94 IF  E           K        DISK
      *================================================================
     E                    ER      1  10 60               d[ｰxｮﾈｰﾆﾞ
     E**** FOR SCREEN ************************************************
     E                    DKT         6  3               工程
     E                    DBM         6  4 0             部門
     E                    DNM         6 10               部門名
     E                    DKB         6  3               機番
     E                    DBN         6  6               番地
     E                    DHN         6 10               代品番
     E                    DHZ         6  8 0             切替日
      **** FOR PROCESS MASTER ****************************************
     E                    KKO        15  3               製造工程
     E                    KBM        15  4 0             製造部門
     E                    KHB        15 12               工程内品番
     E                    KKB        15  3               引当機番
     E                    KNB        15  6               所番地
     E                    KTY        15  1               かんばん種類
%0001E                    SSU        15  9 0             工程設定数
     E*
     E                    KQK        15  3               旧製造工程
     E                    KQB        15  4 0             旧製造部門
     E                    KQH        15 12               旧工程内品番
     E                    KQN        15  3               旧引当機番
     E                    KQT        15  6               旧所番地
     E                    KQS        15  1               旧かんばん種類
     E                    KHZ        15 10 0             切替日・便
      **** AFTER EXCHANGE ********************************************
     E                    @KT        15  3               工程
     E                    @BM        15  4 0             部門
     E                    @HN        15 12               代品番
     E                    @KB        15  3               機番
     E                    @BN        15  6               番地
     E                    @KS        15  1               かんばん種類
     E                    @HZ        15 10 0             切替日
      *================================================================
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W$JBNO
      *---------------------------------------------
      *(FCEPL01)
      * SCHEDULED DELETION DATE
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I*収容数切替日
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *---------------------------------------------
      *(AAMPL11)社内かんばん切り替えマスタ
     I*製造工程コード
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      *旧製造工程コード
     I            DS
     I                                        1  45 KQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
      *製造部門コード
     I            DS
     I                                        1  60 KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      *旧製造部門コード
     I            DS
     I                                        1  60 KQB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
      *工程内品番
     I            DS
     I                                        1 180 KHB
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
      *旧工程内品番
     I            DS
     I                                        1 180 KQH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
      *引き当て機番
     I            DS
     I                                        1  45 KKB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      *旧引き当て機番
     I            DS
     I                                        1  45 KQN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
      *所番地
     I            DS
     I                                        1  90 KNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
      *旧所番地
     I            DS
     I                                        1  90 KQT
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
      *かんばん種類
     I            DS
     I                                        1  15 KTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
      * %0001 工程設定数
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
      *旧かんばん種類
     I            DS
     I                                        1  15 KQS
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
      *'f]ﾌﾞ]切替日、便
     I            DS
     I                                        1 150 KHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   80D1DATE
     I                                        1   40D1YY
     I                                        5   60D1MM
     I                                        7   80D1DD
      *---------------------------------------------
      *(AH#TL19)確定発注データ累積ファイル
     I*かんばん発行日
     I            DS
     I                                        1   80CFHTHZ
     I                                        1   40CFHTYY
     I                                        5   60CFHTMM
     I                                        7   80CFHTDD
     I            DS
     I                                        1   80J1PRHZ
     I                                        1   40J1PRYY
     I                                        5   60J1PRMM
     I                                        7   80J1PRDD
     I            DS
     I                                        1  15 J1BARC
     I                                        2   5 J1ZETI
      *---------------------------------------------
      *画面
     I*工程
     I            DS
     I                                        1  18 DKT
     I                                        1   3 D2KT1
     I                                        4   6 D2KT2
     I                                        7   9 D2KT3
     I                                       10  12 D2KT4
     I                                       13  15 D2KT5
     I                                       16  18 D2KT6
     I*部門
     I            DS
     I                                        1  240DBM
     I                                        1   40D2BM1
     I                                        5   80D2BM2
     I                                        9  120D2BM3
     I                                       13  160D2BM4
     I                                       17  200D2BM5
     I                                       21  240D2BM6
     I*部門名
     I            DS
     I                                        1  60 DNM
     I                                        1  10 D2NM1
     I                                       11  20 D2NM2
     I                                       21  30 D2NM3
     I                                       31  40 D2NM4
     I                                       41  50 D2NM5
     I                                       51  60 D2NM6
     I*機番
     I            DS
     I                                        1  18 DKB
     I                                        1   3 D2KB1
     I                                        4   6 D2KB2
     I                                        7   9 D2KB3
     I                                       10  12 D2KB4
     I                                       13  15 D2KB5
     I                                       16  18 D2KB6
     I*所番地
     I            DS
     I                                        1  36 DBN
     I                                        1   6 D2BN1
     I                                        7  12 D2BN2
     I                                       13  18 D2BN3
     I                                       19  24 D2BN4
     I                                       25  30 D2BN5
     I                                       31  36 D2BN6
     I*代表品番
     I            DS
     I                                        1  60 DHN
     I                                        1  10 D2DH1
     I                                       11  20 D2DH2
     I                                       21  30 D2DH3
     I                                       31  40 D2DH4
     I                                       41  50 D2DH5
     I                                       51  60 D2DH6
     I*工程切替日
     I            DS
     I                                        1  480DHZ
     I                                        1   80D2HZ1
     I                                        9  160D2HZ2
     I                                       17  240D2HZ3
     I                                       25  320D2HZ4
     I                                       33  400D2HZ5
     I                                       41  480D2HZ6
      *---------------------------------------------
     I            DS
     I                                        1   8 $$HB
     I                                        1   20$$HBMM
     I                                        3   3 $$HB1
     I                                        4   50$$HBDD
     I                                        6   6 $$HB2
     I                                        7   80$$HBBB
     I            DS
     I                                        1   80$$YMD
     I                                        1   40$$YY
     I                                        5   60$$MM
     I                                        7   80$$DD
     I            DS
     I                                        1   5 S@BANB
     I                                        1   2 S@BAN2
     I                                        3   3 S@BANC
     I                                        4   5 S@BAN3
      *---------------------------------------------
      *  日付WORK
     I            DS
     I                                        1   80W$DATE
     I                                        5   60W$MM
     I                                        7   80W$DD
      *  時刻WORK
     I            DS
     I                                        1   60W$TIME
     I                                        1   20W$JJ
     I                                        3   40W$FF
      *
     I            DS
     I                                        1  12 D1HIN
     I                                        1   5 D1HIN1
     I                                        6  10 D1HIN2
     I                                       11  12 D1HIN3
     I            DS
     I                                        1  12 PQKHIN
     I                                        1   5 PQKHN1
     I                                        6  10 PQKHN2
     I                                       11  12 PQKHN3
JW5  I            DS
 |   I                                        1   5 WDAT
 |   I                                        1   2 WDAT1
 |   I                                        3   3 PD1
JW5  I                                        4   5 WDAT2
      *
JW5  I            DS
 |   I                                        1   5 WTIM
 |   I                                        1   2 WTIM1
 |   I                                        3   3 PC1
JW5  I                                        4   5 WTIM2
      * ***
     I            DS
     I                                        1  12 @@HIN
     I                                        1   5 @@HIN1
     I                                        6  10 @@KHN2
     I                                       11  12 @@KHN3
      *
     I            DS
     I                                        1   80A9ODHZ
     I                                        1   40A9ODYY
     I                                        5   60A9ODMM
     I                                        7   80A9ODDD
      * ***
      *  SYSTEM DATE
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *             'XXXXXXXXXXXXXXXXXXXX'C         $$SIW2
     C           *ENTRY    PLIST
     C                     PARM           P@MODE  1
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
      *================================================================
     C           KEY01     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#D2SET  '#D2SET
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C           @STEP     CASEQ'#CALL2  '#CALL2
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * INITIALIZATION
      *===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
      *
     C           P@MODE    IFEQ '1'
     C                     SETON                     35
     C                     END
      *
     C                     CLEARDSP01
JW8  C                     MOVELP@HIN1    D1HIN1
 |   C                     MOVELP@HIN2    D1HIN2
JW8  C                     MOVELP@HIN3    D1HIN3
      *
     C                     TIME           @TIME
     C                     Z-ADD@SYSHZ    $$YMD
     C**JW8                Z-ADD1         $$DD
     C                     Z-ADD$$YMD     D1DATE
     C                     Z-ADD1         D1BIN
     C*
     C                     MOVE D1DATE    QQDATE  8
     C                     MOVE '-'       QQPORM  1        + OR -
     C                     MOVE '0010'    QQDAYS  4
     C                     MOVE *BLANK    QQRDAT  8
     C                     MOVE *BLANK    QQRTN   1
     C                     CALL 'DATR1A'
     C                     PARM           QQDATE  8
     C                     PARM           QQPORM  1        + OR -
     C                     PARM           QQDAYS  4
     C                     PARM           QQRDAT  8
     C                     PARM           QQRTN   1
     C*
     C                     SETON                     44
     C                     SETOF                     454647
     C                     SETOF                     484943
     C*
     C                     MOVE QQRDAT    D1DATE
     C*
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSR
     C*===============================================================
      * SCREEN 1
     C*===============================================================
     C           #DSP1     BEGSR
     C                     EXFMTDSP01
     C                     MOVEA'000'     *IN,01
     C                     MOVEA'0'       *IN,99
      *----*
     C                     SELEC
     C* F1 *
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C******
     C                     OTHER
     C                     MOVE '#CHK1   '@STEP
     C                     ENDSL
      *----*
     C                     ENDSR
     C*===============================================================
      * CHECK SCREEN 1
     C*===============================================================
     C           #CHK1     BEGSR
     C**
     C           D1HIN1    IFEQ *BLANK
     C           D1HIN2    ANDEQ*BLANK
     C           D1HIN3    ANDEQ*BLANK
     C           D1TKR2    ANDNE*BLANK
     C           D1TKR3    ORNE *BLANK
     C                     MOVEL'0'       P@TKR1  1        LOCATION 1
     C                     MOVELD1TKR2    P@TKR2  2        LOCATION 2
     C                     MOVELD1TKR3    P@TKR3  2        LOCATION 3
     C                     MOVEL'0'       P@TKR4  1        LOCATION 4
     C                     CALL 'FCERS2'
     C                     PARM           P@TKR1  1        LOCATION 1
     C                     PARM           P@TKR2  2        LOCATION 2
     C                     PARM           P@TKR3  2        LOCATION 3
     C                     PARM           P@TKR4  1        LOCATION 4
     C                     PARM           P@HIN1  5        PART NO. 1
     C                     PARM           P@HIN2  5        PART NO. 2
     C                     PARM           P@HIN3  2        PART NO. 3
     C                     PARM           P@RTN   1        9:該当なし
     C           P@HIN1    IFNE *BLANK                     PART NO. 1
     C                     MOVELP@HIN1    D1HIN1           PART NO. 1
     C                     MOVELP@HIN2    D1HIN2           PART NO. 2
     C                     MOVELP@HIN3    D1HIN3           PART NO. 3
     C                     ENDIF
     C                     ENDIF
     C**
      * IAF PARTS#
     C           D1HIN1    IFEQ *BLANK
     C           D1HIN2    ANDEQ*BLANK
     C           D1HIN3    ANDEQ*BLANK
     C           D1TKR2    IFNE *BLANK
     C           D1TKR3    ORNE *BLANK
     C                     SETON                     0399
     C                     MOVELER,7      D1ERR
     C                     GOTO @CHK1
     C                     ELSE
     C                     SETON                     0199
     C                     MOVELER,1      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
     C                     ENDIF
     C*
     C           KEY01     CHAINFCEPL01              91
     C  N91      A2GSKD    IFEQ 'D'
     C**         A2GSHZ    ANDLE*DATE
JWA  C           A2GSHZ    ANDLE@SYSHZ
     C                     SETON                     91
     C                     ENDIF
     C           *IN91     IFEQ *ON
     C                     SETON                     0199
     C                     MOVELER,2      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
      * DATE AND BIN#
     C                     MOVELD1DATE    P$DATE
     C                     CALL 'DATR10'
     C                     PARM           P$DATE  8
     C                     PARM           P$RTN   1
     C           P$RTN     IFEQ '1'
     C                     SETON                     0299
     C                     MOVELER,3      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
     C*
     C           D1BIN     IFLT 01
     C           D1BIN     ORGT 24
     C                     SETON                     0299
     C                     MOVELER,4      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
     C*********************
JW4  C                     SETOF                     57     (BL)
JW4  C                     SETOF                     58     (BL)
     C                     SETOF                     59     (BL)
     C*********************
      *
      *社内かんばん切り替えマスタ
     C           KEY01     CHAINAAMPL11              91
     C  N91      CKSKJY    IFEQ 'D'
     C**         CKSKHZ    ANDLE*DATE
JWA  C           CKSKHZ    ANDLE@SYSHZ
     C                     SETON                     91
     C                     ENDIF
     C           *IN91     IFEQ *ON
     **   E-03工程切替えマスターが存在しない
     C                     SETON                     0199
     C                     MOVELER,5      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
      *
      *  CHECK A-PICS STATUS
     C                     CALL 'UEXR32'
     C                     PARM           D1HIN1  5
     C                     PARM           D1HIN2  5
     C                     PARM           D1HIN3  2
     C                     PARM           @SYSHZ  80
     C                     PARM           P@APTP  2
     C                     PARM           P@RTN   1
      *-------------
     C           @CHK1     TAG
     C           *IN99     IFEQ *OFF
      * A-PICS1
     C                     MOVE '#D2SET  '@STEP
      * A-PICS2
     C           P@APTP    IFEQ 'A2'
TEST C**JWC      W#USER    IFEQ 'QPGMR'
TEST C**         W#USER    OREQ 'I0033'                    TAKA
TEST C**         W#USER    OREQ 'I0208'                    KATHY
     C                     MOVE '#CALL2  '@STEP
     C**                   ENDIF
     C                     ENDIF
      *
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      * SET A-PICS2 STATUS
      *===============================================================
     C           #CALL2    BEGSR
     C*
     C                     CALL 'CHBR02'
     C                     PARM           D1HIN1  5
     C                     PARM           D1HIN2  5
     C                     PARM           D1HIN3  2
     C                     PARM D1DATE    CCDATE  80
     C                     PARM           D1BIN   20
     C*
     C                     MOVE '#DSP1   '@STEP
     C*
     C           ECALL2    ENDSR
      *===============================================================
      * SET A-PICS1 STATUS
      *===============================================================
     C           #D2SET    BEGSR
     C* %0001
     C                     SETOF                     212223
     C                     SETOF                     242526
     C*         手配名称
     C                     MOVEL*BLANK    D2TEHM
     C                     SELEC
     C           A2TEHI    WHEQ 'Z'
     C                     MOVEL'LIMIT '  D2TEHM           限定
     C           A2TEHI    WHEQ 'S'
     C                     MOVEL'TRIAL '  D2TEHM           試作
     C           A2TEHI    WHEQ 'G'
     C                     MOVEL'VOLUM '  D2TEHM           号口
     C                     ENDSL
      *収容数切替日
     C**         A2SYHZ    IFLE *DATE
JWA  C           A2SYHZ    IFLE @SYSHZ
     C                     Z-ADDA2SSYS    D2SYSU  50       新収容数
     C                     ELSE
     C                     Z-ADDA2KSYS    D2SYSU           旧収容数
     C                     ENDIF
      *日当箱数
     C           A2GEKN    DIV  20        W$HIS   90       日当数量
     C           W$HIS     DIV  D2SYSU    HAKO      H      日当数量
     C*
     C                     MOVEL*BLANK    @KT              旧製造工程
     C                     Z-ADD0         @BM              旧製造部門
     C                     MOVEL*BLANK    @HN              旧工程内品番
     C                     MOVEL*BLANK    @KB              旧引当機番
     C                     MOVEL*BLANK    @BN              旧所番地
     C                     MOVEL*BLANK    @KS              旧かんばん種類
     C                     Z-ADD0         @HZ              切替日・便
     C*
S1   C           1         DO   15        A       20
     C           KHZ,A     IFNE 0
     C                     MOVELKHZ,A     $CHKDT  80       1
     C                     MOVELKQK,A     @KT,A            旧製造工程
     C                     MOVELKQB,A     @BM,A            旧製造部門
     C                     MOVELKQH,A     @HN,A            旧工程内品番
     C                     MOVELKQN,A     @KB,A            旧引当機番
     C                     MOVELKQT,A     @BN,A            旧所番地
     C                     MOVELKQS,A     @KS,A            旧かんばん種類
     C                     MOVELKHZ,A     @HZ,A            切替日・便
     C**         *DATE     IFGE $CHKDT
JWA  C           @SYSHZ    IFGE $CHKDT
     C                     MOVELKKO,A     @KT,A            製造工程
     C                     MOVELKBM,A     @BM,A            製造部門
     C                     MOVELKHB,A     @HN,A            工程内品番
     C                     MOVELKKB,A     @KB,A            引当機番
     C                     MOVELKNB,A     @BN,A            所番地
     C                     MOVELKTY,A     @KS,A            かんばん種類
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETOF                     79
     C           'SB '     LOKUP@KT                      79
      *
      *最終工程から前の６工程と表示
      *
     C                     MOVE *BLANK    DKT              工程
     C                     Z-ADD0         DBM              部門
     C                     MOVEL*BLANK    DNM
     C                     MOVEL*BLANK    DKB              機番
     C                     MOVEL*BLANK    DBN              番地
     C                     MOVEL*BLANK    DHN              品番
     C                     Z-ADD0         DHZ              切替日
     C                     Z-ADD6         B       20
     C                     Z-ADD15        C       20
     C                     MOVE *BLANK    LAST
     C                     MOVEL*BLANK    WCHK    1
     C                     Z-ADD0         K       20
     C                     MOVE *BLANK    @@GAI   4        外注
     C*-------------------------
S1   C           1         DO   15        A       20
     C*------------------S2
 S2  C           @KT,C     IFNE *BLANK                     工程
  S3 C           C         IFLT B
     C                     Z-ADDC         B
  E3 C                     ENDIF
     C*
     C                     MOVE @KT,C     DKT,B            工程
     C                     Z-ADD@BM,C     DBM,B            部門
     C                     MOVEL@KB,C     DKB,B            機番
     C                     MOVEL@BN,C     DBN,B            番地
     C                     MOVEL@HN,C     DHN,B            品番
     C                     MOVE @HZ,C     DHZ,B            切替日
     C** *
     C           @@GAI     IFEQ *BLANK                     外注= *
     C           C         SUB  1         C1      20
     C           @BM,C     IFNE 111                        部門
     C                     MOVE @BM,C     @@GAI            外注= *
     C                     MOVE @HN,C     @@HIN            品番
     C                     ELSE
     C**JW9      @BN,C1    IFNE '------'                   番地
JW9  C           C1        IFNE 0                          番地
"    C           @BN,C1    ANDNE'------'                   番地
     C                     MOVE @BM,C     @@GAI            外注= *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C** %0001
     C           B         ADD  20        K
     C           WCHK      IFEQ *BLANK
     C           SSU,C     IFNE 0
     C           A2GEKN    ANDNESSU,C
     C                     MOVE '1'       *IN,K
     C                     MOVEL'1'       WCHK    1
     C                     ENDIF
     C                     ENDIF
     C**
     C           LAST      IFEQ *BLANK
     C                     MOVE DBM,B     LAST    4
     C                     END
     C           DBM,B     CHAINFGBPL01              91
     C  N91                MOVELB2SMEI    DNM,B
     C*
     C           B         IFLE 1
     C                     LEAVE
     C                     ENDIF
     C           B         SUB  1         B
 E2  C                     ENDIF
     C*------------------E2
     C           C         IFLE 1
     C                     LEAVE
     C                     ENDIF
     C           C         SUB  1         C
E1   C                     ENDDO
      *-----------------------------------
      *
      *-----------------------------------
     C*  SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
      *
     C           KEY02     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C                     KFLD           D1YY
     C                     KFLD           D1MM
     C                     KFLD           D1DD
     C                     KFLD           D1BIN
      *
     C           KEY03     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C                     KFLD           D1YY
     C                     KFLD           D1MM
     C                     KFLD           D1DD
     C  N35      KEY02     SETLLAH#TL19
     C   35      KEY03     SETLLAJZPL31
      *
     C                     MOVE '.'       $$HB1
     C                     MOVE '-'       $$HB2
     C                     EXSR #SFSET
      *
     C           RRN       IFEQ 0
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*BLANK    S1SYHB           出庫日便
     C                     MOVEL*BLANK    S1THNO           手配番号
     C                     Z-ADD0         S1MAIS           枚数
     C                     MOVEL*BLANK    S1PDAY
     C                     MOVEL*BLANK    S1PTIM
     C                     MOVEL*BLANK    S1WDAY           投入日
     C                     MOVEL*BLANK    S1WTIM           投入時刻
     C                     MOVEL*BLANK    S1KDAY           計量日
     C                     MOVEL*BLANK    S1KTIM           計量時刻
     C                     MOVEL*BLANK    S1ODAY
     C                     MOVEL*BLANK    S1RDAY
     C                     MOVEL*BLANK    S1OTIM
      *
JW5  C                     MOVEL*BLANK    S1SDAY
JW5  C                     MOVEL*BLANK    S1STIM
      *
     C                     MOVEL*BLANK    S1CHYU           発注区分
JW7  C                     MOVEL*BLANK    S1PCK
JW6  C                     MOVEL*BLANK    S1SRT
     C                     MOVEL*BLANK    S1ZENO           絶対番号
     C                     MOVEL*BLANK    S1IN92
     C                     MOVEL*BLANK    S1IN93
     C                     MOVEL*BLANK    S1IN94
     C                     ADD  1         RRN
     C                     WRITESFREC1
     C                     SETON                     99
     C                     MOVELER,6      D2ERR
     C                     ENDIF
     C*
     C                     MOVE '1'       PZMODE
     C                     CALL 'ALDR95'
     C                     PARM           PZMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PZUCNT  5
     C                     MOVE PZUCNT    D2UCNT
JW2  C* SET INVENTORY
JW2  C                     MOVELD1HIN1    $HIN1   5
JW2  C                     MOVELD1HIN2    $HIN2   5
JW2  C                     MOVELD1HIN3    $HIN3   2
JW2  C**JW3                MOVELD1YY      $HAYY   4
JW2  C**JW3                MOVELD1MM      $HAMM   2
JW2  C                     MOVELD1DD      $HADD   2
JW2  C                     MOVELD1BIN     $HABB   2
      * SET START DATE
JW3  C                     Z-ADDD1YY      WYY1    40
JW3  C                     Z-ADDD1MM      WMM1    20
JW3   *
JW3  C                     SELEC
JW3  C           HAKO      WHGE 4
JW3  C           WMM1      SUB  0         WMM2    20
JW3  C           HAKO      WHGE 0.5
JW3  C           WMM1      SUB  2         WMM2
JW3  C                     OTHER
JW3  C           WMM1      SUB  11        WMM2
JW3  C                     ENDSL
JW3   *
JW3  C           WMM2      IFLE 0
JW3  C           WMM2      ADD  12        WMM2
JW3  C           WYY1      SUB  1         WYY2    40
JW3  C                     ELSE
JW3  C                     Z-ADDWYY1      WYY2
JW3  C                     ENDIF
JW3  C                     MOVELWYY2      $HAYY   4
JW3  C                     MOVELWMM2      $HAMM   2
      *
JW2  C                     CALL 'NYUR21'
JW2  C                     PARM           $HIN1   5
JW2  C                     PARM           $HIN2   5
JW2  C                     PARM           $HIN3   2
JW2  C                     PARM           $HAYY   4
JW2  C                     PARM           $HAMM   2
JW2  C                     PARM           $HADD   2
JW2  C                     PARM           $HABB   2
JW2   *OUT
JW2  C                     PARM           $OHKSU  5
JW2  C                     PARM           $OSISU  5
JW2  C                     PARM           $ONYSU  5
JW2  C                     PARM           $OSYSU  5
JW2  C                     PARM           $OKISU  5
JW2  C                     PARM           $OINV   5
JW2  C                     MOVEL$OINV     D2INV
      *
     C**                   MOVE *DATE     PZSDAT  8
JWA  C                     MOVE @SYSHZ    PZSDAT  8
     C                     CALL 'AB#CAY0'
     C                     PARM           PZMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PZSDAT  8
     C                     PARM           PZDAT1  8
     C                     PARM           PZTOL1  6
     C                     PARM           PZUNS1  6
     C                     PARM           PZDAT2  8
     C                     PARM           PZTOL2  6
     C                     PARM           PZUNS2  6
     C                     PARM           PZDAT3  8
     C                     PARM           PZTOL3  6
     C                     PARM           PZUNS3  6
     C                     MOVE PZTOL1    D@TOL1  61
     C                     MOVE PZUNS1    D@UNS1  61
     C                     MOVE PZTOL2    D@TOL2  61
     C                     MOVE PZUNS2    D@UNS2  61
     C                     MOVE PZTOL3    D@TOL3  61
     C                     MOVE PZUNS3    D@UNS3  61
      *
JW4   * SET INDICATOR TO REVERSE FIELDS
 |   C                     MOVE *OFF      *IN57
 |   C                     MOVE *OFF      *IN58
 |   C           D@UNS1    IFNE 0
 |   C           D@UNS2    ANDNED@TOL2
 |   C                     MOVE *ON       *IN57
 |   C                     ENDIF
 |   C           D@UNS1    IFNE 0
 |   C           D@UNS3    ANDNED@TOL3
 |   C                     MOVE *ON       *IN58
 |   C                     ENDIF
 |   C           D@UNS1    IFEQ 0
 |   C           D@UNS2    ANDNE0
 |   C           D@UNS3    ANDNED@TOL3
 |   C                     MOVE *ON       *IN58
JW4  C                     ENDIF
     C*
     C                     CALL 'FCERS9'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           S@BAN1  1
     C                     PARM           S@BAN2  2
     C                     PARM           S@BAN3  2
     C                     PARM           S@BAN4  1
     C                     MOVE '-'       S@BANC
     C*
     C                     CALL 'AAFRS7'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           T@BAN1  1
     C                     PARM           T@BAN2  2
     C                     PARM           T@BAN3  2
     C                     PARM           T@BAN4  1
     C                     PARM           T@SRTN 20
     C                     PARM           T@SRT# 20
     C*
     C                     MOVELT@SRTN    U@CHR1128
     C                     MOVELT@SRT#    U@CHR2128
     C                     MOVEL*BLANK    U@CHR3128
     C* U@CHR1 + U@CHR2 --> U@CHR3
JWB  C**                   CALL 'APLC11'
"    C                     CALL 'UTLC11'
     C                     PARM           U@CHR1
     C                     PARM           U@CHR2
     C                     PARM           U@CHR3
     C                     MOVELU@CHR3    O@SRT
     C*
     C*********  @@GAI     COMP *BLANK               7878  外注
     C           @@GAI     COMP '0111'               7878  外注
     C*
     C                     MOVE '#DSP2   '@STEP
     C                     Z-ADDRRN       ENDRRN  40
     C                     Z-ADD1         DSPRRN
     C*
     C                     ENDSR
      *===============================================================
      *  SUBFILE SET
      *===============================================================
     C           #SFSET    BEGSR
     C                     Z-ADDENDRRN    RRN
     C                     Z-ADD0         $CTR    20
     C*-------------------------
S1   C                     DO   *HIVAL
      *
     C           *IN35     IFEQ '0'
      *
     C           KEY01     READEAH#TL19                  90
     C   90                LEAVE
 S2  C           CFSKJY    IFEQ 'D'
     C**         CFSKHZ    ANDLE*DATE
JWA  C           CFSKHZ    ANDLE@SYSHZ
     C                     ITER
 E2  C                     ENDIF
      *
     C                     ELSE
      *
     C           KEY01     READEAJZPL31                  90
     C   90                LEAVE
     C                     Z-ADDJ1PRYY    CFHTYY
     C                     Z-ADDJ1PRMM    CFHTMM
     C                     Z-ADDJ1PRDD    CFHTDD
     C                     Z-ADD99        CFHTBB
     C                     MOVE J1PTEH    CFTHNO
     C                     MOVE J1KANK    CFCHYU
     C                     Z-ADD1         CFMAIS
     C                     MOVE J1ZETI    CFZENO
      *
     C                     END
     C*
     C                     MOVEL*BLANK    S1SEL
     C*                                  前工程出庫日・便
     C                     Z-ADDCFHTMM    $$HBMM
     C                     Z-ADDCFHTDD    $$HBDD
     C                     Z-ADDCFHTBB    $$HBBB
     C                     MOVE $$HB      S1SYHB           出庫日便
     C                     MOVELCFTHNO    S1THNO           手配番号
     C                     MOVELCFCHYU    S1CHYU           発注区分
     C           S1CHYU    COMP 'R'                      41発注区分
     C                     Z-ADDCFMAIS    S1MAIS           枚数
     C*
     C                     MOVE CFZENO    S1ZENO           絶対番号
     C*         　　　・時刻
     C                     MOVEL*BLANK    S1PDAY           投入日
     C                     MOVEL*BLANK    S1PTIM           投入時刻
     C                     EXSR ##PIC
     C*         投入日・時刻
     C                     MOVEL*BLANK    S1WDAY           投入日
     C                     MOVEL*BLANK    S1WTIM  5        投入時刻
     C                     EXSR ##WIN
     C           S1WDAY    IFEQ *BLANK
     C                     EXSR ##WIN2
     C                     END
     C           S1WDAY    IFEQ *BLANK
     C           *IN79     IFEQ '1'
     C                     EXSR ##WIN3
     C                     ENDIF
     C                     END
     C           S1WDAY    IFEQ *BLANK
     C                     EXSR ##WIN4                     <ALHR0Z>
     C                     ENDIF
     C*         計量日・時刻
     C                     MOVEL*BLANK    S1KDAY           計量日
     C                     MOVEL*BLANK    S1KTIM  5        計量時刻
     C                     EXSR ##KEI2
     C           S1KDAY    IFEQ *BLANK
     C                     EXSR ##KEI
     C                     ENDIF
     C*
     C*        *外注日・時刻
     C*
     C                     SETOF                     5152
     C                     MOVE '0'       S1IN51
     C                     MOVE '0'       S1IN52
     C*          @@GAI     IFNE *BLANK                     外注= *
     C           @@GAI     IFNE '0111'                     外注= *
     C                     EXSR ##GAI
     C                     ENDIF
     C*
     C*        *外注日・時刻
     C           CFTHNO    IFEQ '293'
     C                     Z-ADD0         SAKA    40
     C                     END
     C*         外注日・時刻
     C                     MOVE '0'       S1IN94
     C                     SETOF                     94
     C                     MOVEL*BLANK    S1ODAY
     C                     MOVEL*BLANK    S1RDAY
     C                     MOVEL*BLANK    S1OTIM
      *
     C           LAST      IFNE '0111'
     C                     EXSR ##OUTS
     C                     END
     C   94                MOVE '1'       S1IN94
     C*
     C                     MOVE CFHTHZ    PHHTHZ
     C           CFTHNO    IFEQ '293'
     C                     Z-ADD0         SAKA    40
     C                     END
     C*
     C           CFTHNO    IFEQ '707'
     C                     Z-ADD0         SAKA    40
     C                     END
     C*
     C                     MOVE '0'       S1IN92
     C                     MOVE '0'       S1IN93
     C                     SETOF                     9293
     C                     CALL 'ALDRS1'
     C                     PARM CFCHYU    PHCHYU  1
     C                     PARM CFZENO    PHZENO  4
     C                     PARM CFTHNO    PHTHNO  3
     C                     PARM           PHHTHZ  8
     C                     PARM           PHMAIS  4
     C                     MOVE PHMAIS    @@MAIS  40
     C           @@MAIS    IFNE 0
     C                     SETON                     92
     C                     END
     C           @@MAIS    IFGE CFMAIS
     C                     SETOF                     92
     C                     SETON                     93
     C                     END
     C   92                MOVE '1'       S1IN92
     C   93                MOVE '1'       S1IN93
      *
JW5   * GET SORT SCAN DATE/TIME
JW5  C                     EXSR ##SRT
     C*
     C                     ADD  1         RRN
     C                     ADD  1         $CTR
     C                     WRITESFREC1
     C*
     C           $CTR      IFEQ 1
     C                     Z-ADDRRN       DSPRRN
     C                     ENDIF
     C           $CTR      IFGE 11
     C                     LEAVE
     C                     ENDIF
E1   C                     ENDDO
     C*-------------------------
     C                     Z-ADDRRN       ENDRRN
     C                     ENDSR
      *===============================================================
      *  GET DATE/TIME
      *===============================================================
     C           ##PIC     BEGSR
      *
JW7  C                     MOVE *OFF      *IN50            DISP COLOR
JW7  C                     MOVE *BLANK    S1PCK
      *
     C                     CALL 'ALCRS1'
     C                     PARM           CFCHYU  1
     C                     PARM CFZENO    CFZENO  4
     C                     PARM CFTHNO    CFTHNO  3
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@PKHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@PKTM  60       WORK ADMITTABLE TIME
      *
     C                     Z-ADDP@PKHZ    W$DATE           WORK DATE
     C                     Z-ADDP@PKTM    W$TIME           WORK TIME
      * EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1PDAY
     C                     MOVEL$$TIME    S1PTIM
JW7  C** PART REMOVED ?
 |   C           ALCKEY    KLIST
 |   C                     KFLD           K@CHYU  1
 |   C                     KFLD           K@ZETI  4
 |   C                     KFLD           K@PAGE  3
 |    *
 |   C                     MOVELCFCHYU    K@CHYU
 |   C                     MOVELCFZENO    K@ZETI
 |   C                     MOVELCFTHNO    K@PAGE
 |   C           ALCKEY    SETGTALCPL06
 |   C                     DO   *HIVAL
 |   C           ALCKEY    REDPEALCPL06                  88
 |   C   88                LEAVE
 |   C**         A8B2LZ    IFEQ *BLANK
 |   C**                   ITER
 |   C**                   ENDIF
 |   C           A8DATE    IFLT CFHTHZ
 |   C                     ITER
 |   C                     ENDIF
 |   C           A8ERR     IFEQ 'E'
 |   C                     ITER
 |   C                     ENDIF
 |    * ZETI=NUMERIC ?
 |   C                     MOVELA8BRC2    LTR4    4
 |   C                     TESTN          LTR4       98
 |   C  N98                MOVE *BLANK    P@PCK   1
 |   C   98                MOVE 'Y'       P@PCK
 |   C                     LEAVE
JW7  C                     ENDDO
     C*
JW7   * COLOR GREEN/RED FOR PICKUP FIELD
 |   C           P@PCK     IFEQ 'Y'
 |   C                     MOVE *ON       *IN50
 |   C                     MOVE 'R'       S1PCK
 |   C                     ELSE
 |   C                     MOVE *OFF      *IN50
 |   C                     MOVE *BLANK    S1PCK
JW7  C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      * SCAN DATE AND TIME
      *===============================================================
     C           ##WIN     BEGSR
     C                     CALL 'AJSR1Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C                     Z-ADDP@WIHZ    W$DATE           WORK DATE
     C                     Z-ADDP@WITM    W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1WDAY
     C                     MOVE $$TIME    S1WDAY
     C*                    MOVEL$$TIME    S1WTIM
     C*
     C                     ENDSR
      *===============================================================
      *  SCAN DATE AND TIME
      *===============================================================
     C           ##WIN2    BEGSR
     C                     CALL 'AJSR2Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C                     Z-ADDP@WIHZ    W$DATE           WORK DATE
     C                     Z-ADDP@WITM    W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1WDAY
     C                     MOVE $$TIME    S1WDAY
     C*                    MOVEL$$TIME    S1WTIM
     C*
     C                     ENDSR
      *===============================================================
      *  SCAN DATE AND TIME
      *===============================================================
     C           ##WIN3    BEGSR
     C                     CALL 'ALMR0Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C                     Z-ADDP@WIHZ    W$DATE           WORK DATE
     C                     Z-ADDP@WITM    W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1WDAY
     C                     MOVE $$TIME    S1WDAY
     C*                    MOVEL$$TIME    S1WTIM
     C*
     C                     ENDSR
      *===============================================================
     C           ##WIN4    BEGSR
     C                     CALL 'ALHR0Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
      *
     C                     Z-ADDP@WIHZ    W$DATE           WORK DATE
     C                     Z-ADDP@WITM    W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1WDAY
     C                     MOVE $$TIME    S1WDAY
     C*                    MOVEL$$TIME    S1WTIM
     C*
     C                     ENDSR
      *===============================================================
      *  ORDER DATE AND TIME  (OUTSRC)
      *===============================================================
     C           ##OUTS    BEGSR
      *
     C                     CALL 'AFARS1'
     C                     PARM           CFCHYU  1
     C                     PARM CFZENO    CFZENO  4
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@OTHZ  8
     C                     PARM           P@PNHZ  8
     C                     PARM           P@RCHZ  8
     C                     PARM           P@OMAI  4
      *
     C                     MOVE P@OTHZ    W$DATE           WORK DATE
     C                     Z-ADD0         W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1ODAY
     C                     MOVEL$$TIME    S1OTIM
      *
     C                     MOVE P@RCHZ    W$DATE           WORK DATE
     C                     Z-ADD0         W$TIME           WORK TIME
      *  EDIT DATE AND TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1RDAY
     C                     MOVEL$$TIME    S1OTIM
     C*
     C           S1RDAY    IFEQ *BLANK
     C           P@PNHZ    ANDNE*BLANK
      *
     C                     SETON                     94
      *
     C                     MOVE P@PNHZ    W$DATE           WORK DATE
     C                     Z-ADD0         W$TIME           WORK TIME
      *  EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1RDAY
     C                     MOVEL$$TIME    S1OTIM
      *
     C                     END
      *
     C                     ENDSR
      *===============================================================
      * FAFAPL94
      *===============================================================
     C           ##GAI     BEGSR
      *
     C           KEY94     KLIST
     C                     KFLD           @@GAI            外注= *
     C                     KFLD           @@HIN1
     C                     KFLD           @@KHN2
     C                     KFLD           @@KHN3
      *
     C           KEY94     SETGTAFAPL94
     C                     MOVE *BLANK    S1WDAY
     C                     MOVE *BLANK    S1KDAY
      *
     C                     DO   *HIVAL
     C           KEY94     REDPEAFAPL94                  94
     C   94                LEAVE
     C           A9SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C********** A9TEHI         3A         COLHDG('TEHAI NO.')
     C           A9TEHI    IFNE S1THNO
     C                     ITER
     C                     ENDIF
     C*
     C           A9ODHZ    IFLT CFHTHZ
     C                     ITER
     C                     ENDIF
     C*
     C*           A9HAKO         3S 0       COLHDG('# OF HAKO')
     C           A9HAKO    IFLT S1MAIS
     C                     SETON                     51
     C                     MOVE '1'       S1IN51
     C                     ENDIF
     C*
     C                     MOVE A9ODYY    W$04    4
     C           W$04      CAT  '.':0     S1WDAY
     C                     MOVE A9ODMM    W$02    2
     C           S1WDAY    CAT  W$02:0    S1WDAY
     C           S1WDAY    CAT  '.':0     S1WDAY
     C                     MOVE A9ODDD    W$02    2
     C           S1WDAY    CAT  W$02:0    S1WDAY
     C*
     C           A9NOYY    IFEQ 0
     C                     SETON                     52
     C                     MOVE '1'       S1IN52
     C                     MOVE A9NYYY    W$04
     C                     MOVE A9NYMM    W$02
     C                     MOVE A9NYDD    W$02D   2
     C                     ELSE
     C                     MOVE A9NOYY    W$04
     C                     MOVE A9NOMM    W$02
     C                     MOVE A9NODD    W$02D   2
     C                     ENDIF
     C           W$04      CAT  '.':0     S1KDAY
     C           S1KDAY    CAT  W$02:0    S1KDAY
     C           S1KDAY    CAT  '.':0     S1KDAY
     C           S1KDAY    CAT  W$02D:0   S1KDAY
     C*
     C                     LEAVE
     C                     ENDDO
      *
     C                     ENDSR
      *===============================================================
      *  SCALE DATE AND TIME
      *===============================================================
     C           ##KEI     BEGSR
     C                     CALL 'AJHR2Z'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
      *
     C                     Z-ADDP@KEHZ    W$DATE           WORK DATE
     C                     Z-ADDP@KETM    W$TIME           WORK TIME
      *  EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1KDAY
     C                     MOVE $$TIME    S1KDAY
     C*                    MOVEL$$TIME    S1KTIM
     C*
     C                     ENDSR
      *===============================================================
      *         計量日・時刻
      *===============================================================
     C           ##KEI2    BEGSR
     C                     CALL 'AJHR2W'
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
      *
     C                     Z-ADDP@KEHZ    W$DATE           WORK DATE
     C                     Z-ADDP@KETM    W$TIME           WORK TIME
      *  EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1KDAY
     C                     MOVE $$TIME    S1KDAY
     C*                    MOVEL$$TIME    S1KTIM
     C*
     C                     ENDSR
JW5   *===============================================================
 |    * GET SORT SCAN DATE/TIME
 |    *===============================================================
 |   C           ##SRT     BEGSR
 |   C                     MOVE *OFF      *IN49            DISP COLOR
 |   C                     MOVE *OFF      *IN43            DISP COLOR
 |   C                     MOVEL*BLANK    S1SDAY
 |   C                     MOVEL*BLANK    S1STIM
 |   C                     MOVE *BLANK    S1SRT
 |   C                     MOVEL*BLANK    WDAT
 |   C                     MOVEL*BLANK    WTIM
 |    *
 |    * GET SORT SACN DATE/TIME
 |   C                     MOVELD1HIN1    P@SHN1
 |   C                     MOVELD1HIN2    P@SHN2
 |   C                     MOVELD1HIN3    P@SHN3
 |   C                     MOVELS1THNO    P@TEHI
 |   C                     MOVELCFHTHZ    P@IDAT
 |   C                     CALL 'ALCRS5'
 |   C                     PARM           P@SHN1  5
 |   C                     PARM           P@SHN2  5
 |   C                     PARM           P@SHN3  2
 |   C                     PARM           P@TEHI  3
 |   C                     PARM           P@IDAT  8
 |   C*                               GET ------
 |   C                     PARM           P@SDAT  8
 |   C                     PARM           P@STIM  6
 |   C                     PARM           P@STK   1
JW5  C                     PARM           P@RTN   1
      * CHECK ISSUE DATE
JW5B C           P@RTN     IFEQ *BLANK
 |   C                     MOVELP@SDAT    SRT80   80
 |   C           SRT80     IFLT CFHTHZ
 |   C                     GOTO ##SRTX
 |   C                     ENDIF
JW5B C                     ENDIF
      *
JW5  C           P@RTN     IFEQ *BLANK
 |   C                     MOVE P@SDAT    LTR4    4
 |   C                     MOVELLTR4      WDAT1
 |   C                     MOVE LTR4      WDAT2
 |   C                     MOVE '.'       PD1
 |   C                     MOVELWDAT      S1SDAY
 |    * EDIT
 |   C                     MOVELP@STIM    LTR4    4
 |   C                     MOVELLTR4      WTIM1
 |   C                     MOVE LTR4      WTIM2
 |   C                     MOVE ':'       PC1
 |   C                     MOVELWTIM      S1STIM
 |   C                     ENDIF
 |    * COLOR GREEN/RED FOR SRT/SHIPPING FIELD
 |   C           P@STK     IFEQ 'Y'
 |   C                     MOVE *OFF      *IN49
 |   C                     MOVE *BLANK    S1SRT
 |   C                     ELSE
 |   C                     MOVE *ON       *IN49
 |   C                     MOVE 'R'       S1SRT
JW5  C                     ENDIF
      *
      * COLOR PINK FOR SHIPPING PRIORITY PARTS
     C           P@STK     IFEQ 'P'
     C                     MOVE *OFF      *IN49
 |   C                     MOVE *ON       *IN43
     C                     MOVE 'P'       S1SRT
     C                     ENDIF
      *
     C           ##SRTX    ENDSR
     C*===============================================================
     C*  SCREEN 2
     C*===============================================================
     C           #DSP2     BEGSR
     C*
     C                     SETON                     71
     C                     WRITEDSP02
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
     C*
     C                     SELEC
     C* F1 *
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C*
     C* F2  SWHICH CMD
     C           *INKB     WHEQ *ON
     C                     SELEC
     C           *IN44     WHEQ '1'
     C                     SETON                     45
     C                     SETOF                     444647
     C                     SETOF                     4849
     C           *IN45     WHEQ '1'
     C                     SETON                     46
     C                     SETOF                     444547
     C                     SETOF                     4849
     C           *IN46     WHEQ '1'
     C                     SETON                     47
     C                     SETOF                     444546
     C                     SETOF                     4849
     C           *IN47     WHEQ '1'
     C                     SETON                     48
     C                     SETOF                     444546
     C                     SETOF                     4749
     C           *IN48     WHEQ '1'
     C                     SETON                     49
     C                     SETOF                     444546
     C                     SETOF                     4748
     C           *IN49     WHEQ '1'
     C                     SETON                     44
     C                     SETOF                     454647
     C                     SETOF                     4849
     C                     ENDSL
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F3 *
     C           *INKC     WHEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C*
     C* F4 *
     C           *INKD     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
     C                     EXSR #SB
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@SB      IFEQ 'SB '
     C                     CALL 'ALMR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C           W@SB      IFEQ 'KRO'
     C                     CALL 'ALMR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F5 *
     C           *INKE     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
     C                     EXSR #LAN
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@LAN     IFEQ 'LAN'
     C                     CALL 'ALLR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C           W@LAN     IFEQ 'AOQ'
     C                     CALL 'ALLR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F6 *
     C           *INKF     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
     C                     EXSR #OQ
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@OQ      IFEQ 'OQ '
     C                     CALL 'ALGR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C           W@OQ      IFEQ 'LOQ'
     C                     CALL 'ALHR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     END
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F7 *
     C           *INKG     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
%02  C                     MOVEL'BZ '     PQKOTE  3
     C                     EXSR #ST
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@ST      IFEQ 'BZ '
     C                     MOVE '1'       PQMODE
     C                     CALL 'AJSR30'
     C                     PARM           PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     END
     C*
%02  C                     MOVEL'DS '     PQKOTE
     C                     EXSR #ST
     C*
     C           W@ST      IFEQ 'DS '
     C                     MOVE '1'       PQMODE
     C                     CALL 'AJSR35'
     C                     PARM           PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     END
     C*
     C* F8 *
     C           *INKH     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
     C                     MOVE '1'       PQMODE
     C                     MOVE D1DATE    P#RDAT
     C                     CALL 'AJHR16'
     C                     PARM           PQMODE  1
     C                     PARM D1HIN1    PQKHN1
     C                     PARM D1HIN2    PQKHN2
     C                     PARM D1HIN3    PQKHN3
     C                     PARM           P#RDAT  8
     C*
     C* F9 *
     C           *INKI     WHEQ *ON
     C                     CALL 'AFDRS1'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F10 *
     C           *INKJ     WHEQ *ON
     C                     MOVE '2'       PXMODE
     C                     CALL 'ALDR95'
     C                     PARM           PXMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PXUCNT  5
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F11 *
     C           *INKK     WHEQ *ON
     C                     EXSR ##AKAR
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F12 *
     C           *INKL     WHEQ *ON
     C                     MOVE '4'       PPMODE
     C                     CALL 'AKAC31'
     C                     PARM           PPMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F13 *
     C           *INKM     WHEQ *ON
     C                     MOVEL*BLANK    P@MPAR 20
     C                     MOVEL*BLANK    P@TOKU  4
     C                     MOVEL*BLANK    P@NONY  4
     C                     MOVEL*BLANK    P@NKOJ  1
     C                     MOVEL*BLANK    P@NUKE  4
     C                     MOVEL*BLANK    P@SEBN  4
     C**                   CALL 'ABBR25'
JW   C                     CALL 'ABBR25A'
     C                     PARM           D1HIN
     C                     PARM           P@MPAR 20
     C                     PARM           P@TOKU  4
     C                     PARM           P@NONY  4
     C                     PARM           P@NKOJ  1
     C                     PARM           P@NUKE  4
     C                     PARM           P@SEBN  4
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F14 *
     C           *INKN     WHEQ *ON
JWA  C                     MOVE @SYSHZ    PPDATE
     C                     CALL 'ALDR461'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PPDATE  8
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F15 *
     C           *INKP     WHEQ *ON
     C                     CALL 'MBER71'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PYYYYY  4
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F16 *
     C           *INKQ     WHEQ *ON
     C                     MOVELD1DATE    P$SDT
     C                     MOVEL'99999999'P$EDT
     C                     CALL 'AB#C18'
     C                     PARM           P$SDT   8
     C                     PARM           P$EDT   8
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F17 *
     C           *INKR     WHEQ *ON
     C                     CALL 'ANYC23'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           GGBAN1  1
     C                     PARM           GGBAN2  2
     C                     PARM           GGBAN3  2
     C                     PARM           GGBAN4  1
     C                     PARM           GGBAN1
     C                     PARM           GGBAN2
     C                     PARM           GGBAN3
     C                     PARM           GGBAN1
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F18 *
     C           *INKS     WHEQ *ON
     C                     MOVE D1DATE    PPDATE
     C                     CALL 'AJZR60'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PPDATE
     C*
     C                     MOVE '#DSP2   '@STEP
     C*
     C* F19 *
     C           *INKT     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
%02  C                     MOVEL'BZ '     PQKOTE
     C                     EXSR #ST
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@ST      IFEQ 'BZ '
     C                     MOVE '1'       PQMODE
     C                     CALL 'AJSR31'
     C                     PARM           PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     END
     C*
%02  C                     MOVEL'DS '     PQKOTE
     C                     EXSR #ST
     C*
     C           W@ST      IFEQ 'DS '
     C                     MOVE '1'       PQMODE
     C                     CALL 'AJSR36'
     C                     PARM           PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     END
     C*
     C* F20 *
     C           *INKU     WHEQ *ON
JWA  C                     MOVE @SYSHZ    P#DATE  8
     C                     MOVE '-'       P#PORM  1        + OR -
     C                     MOVE '0003'    P#DAYS  4
     C                     MOVE *BLANK    P#RDAT  8
     C                     MOVE *BLANK    P#RTN   1
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE
     C                     PARM           P#PORM  1        + OR -
     C                     PARM           P#DAYS  4
     C                     PARM           P#RDAT  8
     C                     PARM           P#RTN   1
     C*
     C                     MOVE '1'       PQMODE
     C                     MOVE D1DATE    P#RDAT
     C                     CALL 'AJHR26'
     C                     PARM           PQMODE  1
     C                     PARM D1HIN1    PQKHN1
     C                     PARM D1HIN2    PQKHN2
     C                     PARM D1HIN3    PQKHN3
     C                     PARM           P#RDAT  8
     C*
     C* F21 *
     C           *INKV     WHEQ *ON
JWA  C                     MOVEL@SYSHZ    PDATE
     C                     MOVEL'-'       PPORM
     C                     MOVEL'0090'    PDAYS
     C                     MOVEL*BLANK    PRDAT
     C                     MOVEL*BLANK    PRTN
     C*
     C                     CALL 'DATR12'
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C*
     C                     MOVE PRDAT     ##FRM   6
     C                     MOVE '01'      ##FRM
     C                     MOVEL'999999'  ##TO    6
     C*
     C                     MOVEL*BLANK    P1HIN  15
     C                     MOVELD1HIN     P1HIN
     C                     CALL 'GDGC8Z'
     C                     PARM           P1HIN
     C                     PARM           ##FRM
     C                     PARM           ##TO
     C*
JW1  C* F22 * WIP SATTUS INQUIRY (INV)
JW1  C           *INKW     WHEQ *ON
JW1  C                     MOVELD1HIN1    $HIN1
JW1  C                     MOVELD1HIN2    $HIN2
JW1  C                     MOVELD1HIN3    $HIN3
JW1  C                     MOVELD1DD      $HADD
JW1  C                     MOVELD1BIN     $HABB
     C* SET START DATE
JW3  C                     Z-ADDD1YY      WYY1    40
JW3  C                     Z-ADDD1MM      WMM1    20
JW3  C*
JW3  C                     SELEC
JW3  C           HAKO      WHGE 4
JW3  C           WMM1      SUB  0         WMM2
JW3  C           HAKO      WHGE 0.5
JW3  C           WMM1      SUB  2         WMM2
JW3  C                     OTHER
JW3  C           WMM1      SUB  11        WMM2
JW3  C                     ENDSL
JW3  C*
JW3  C           WMM2      IFLE 0
JW3  C           WMM2      ADD  12        WMM2
JW3  C           WYY1      SUB  1         WYY2    40
JW3  C                     ELSE
JW3  C                     Z-ADDWYY1      WYY2
JW3  C                     ENDIF
JW3  C                     MOVELWYY2      $HAYY   4
JW3  C                     MOVELWMM2      $HAMM   2
     C*
JW1  C                     CALL 'NYUR20'
JW1  C                     PARM           $HIN1   5
JW1  C                     PARM           $HIN2   5
JW1  C                     PARM           $HIN3   2
JW1  C                     PARM           $HAYY   4
JW1  C                     PARM           $HAMM   2
JW1  C                     PARM           $HADD   2
JW1  C                     PARM           $HABB   2
     C*
     C* F23 * ST ONEWAY
     C           *INKX     WHEQ *ON
     C                     Z-ADDD1DATE    P@DATE
     C                     Z-ADDD1BIN     P@BIN
     C                     CALL 'AHBR10'
     C                     PARM           P@MODE
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           P@DATE  80
     C                     PARM           P@BIN   20
     C                     PARM           P@STS   1
     C*
     C           P@STS     IFEQ '*'
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP2   '@STEP
     C                     END
     C*
     C* F24 * STOCK (INY)
     C           *INKY     WHEQ *ON
     C                     CALL 'STAC40'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C* 73 *(ROLL UP)
     C           *IN73     WHEQ *ON
     C  N90                EXSR #SFSET
     C                     MOVE '#DSP2   '@STEP
     C*
     C* 77 *(ROLL DOWN)
     C           *IN74     WHEQ *ON
     C                     MOVE '#DSP2   '@STEP
     C*
     C                     OTHER
     C                     MOVE '#CHK2   '@STEP
     C                     ENDSL
     C*
     C                     ENDSR
      *===============================================================
      * CHECK SCREEN 2
      *===============================================================
     C           #CHK2     BEGSR
     C                     MOVE '#DSP2   '@STEP
     C*-------------------------
S1   C                     DO   ENDRRN    RRN
     C           RRN       CHAINSFREC1               91
     C   91                LEAVE
     C                     MOVE *BLANK    P$FLG   1        1=F1,3=F3
     C           S1SEL     IFEQ '1'
     C                     CALL 'AHBR03'
     C                     PARM           S1ZENO
     C                     PARM           S1THNO
     C                     PARM           P$FLG            1=F1,3=F3
     C                     ENDIF
     C                     MOVE ' '       S1SEL
     C           S1CHYU    COMP 'R'                      41
     C                     SETOF                     9293
     C           S1IN92    IFEQ '1'
     C                     SETON                     92
     C                     END
     C           S1IN93    IFEQ '1'
     C                     SETON                     93
     C                     END
     C           S1IN94    IFEQ '1'
     C                     SETON                     94
     C                     END
      * PICKUP DATE
JW7  C           S1PCK     IFEQ 'R'
 |   C                     MOVE *ON       *IN50
 |   C                     ELSE
 |   C                     MOVE *OFF      *IN50
JW7  C                     ENDIF
      * SRT/SHIPPING DATE
JW6  C           S1SRT     IFEQ 'R'
 |   C                     MOVE *ON       *IN49
 |   C                     ELSE
 |   C                     MOVE *OFF      *IN49
JW6  C                     ENDIF
      *
     C           S1IN51    COMP '1'                      51
     C           S1IN52    COMP '1'                      52
      *
     C                     UPDATSFREC1
     C           P$FLG     IFEQ '1'                        1=F1,3=F3
     C                     MOVE '#END    '@STEP
     C                     LEAVE
     C                     ENDIF
E1   C  N99                ENDDO
     C*-------------------------
     C                     ENDSR
      *===============================================================
      * EDIT DATE AND TIME
      *===============================================================
     C           ##EDIT    BEGSR
     C                     MOVEL*BLANK    $$DAY   5
     C                     MOVEL*BLANK    $$TIME  5
     C*
     C           W$DATE    IFNE 0
     C                     Z-ADDW$MM      $$HBMM
     C                     MOVE '.'       $$HB1
     C                     Z-ADDW$DD      $$HBDD
     C                     MOVEL$$HB      $$DAY
     C                     Z-ADDW$JJ      $$HBMM
     C                     MOVE ':'       $$HB1
     C                     Z-ADDW$FF      $$HBDD
     C                     MOVEL$$HB      $$TIME
     C                     ENDIF
     C*
     C                     MOVE '.'       $$HB1
     C                     ENDSR
      *===============================================================
      * INQUIRE PRODUCTION PROCESS INFORMATION
      *===============================================================
     C           ##AKAR    BEGSR
      *
     C                     MOVE 'X'       P$SNO   1
     C                     MOVE *BLANK    P$F3    1
     C                     MOVE *BLANK    P$ERR   1
      *-------------------------
     C                     DO   *HIVAL
     C                     MOVE P$SNO     P$NO
     C                     CALL 'AKAR27'
     C                     PARM           P$F3    1
     C                     PARM           P$ERR   1
     C                     PARM D1HIN     P$HIN  12
     C                     PARM           P$NO    1
     C*
     C           P$F3      IFEQ '1'
     C           P$ERR     ORNE *BLANK
     C                     LEAVE
     C                     ENDIF
      *
     C                     CALL 'AKAR28'
     C                     PARM           P$F3
     C                     PARM           P$SNO   1
     C                     PARM           P$ERR   1
     C                     PARM D1HIN1    P$SHN1  5
     C                     PARM D1HIN2    P$SHN2  5
     C                     PARM D1HIN3    P$SHN3  2
     C*
     C           P$F3      IFEQ '1'
     C           P$ERR     ORNE *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *-------------------------
      *
     C           P$ERR     IFEQ 'E'
     C                     SETON                       99
     C                     MOVELER,8      D2ERR
     C                     ENDIF
      *
     C           P$ERR     IFEQ '9'
     C                     SETON                       99
     C                     MOVELER,9      D2ERR
     C                     ENDIF
     C*
     C                     ENDSR
      *-----------------------------------------------------
     C           #OQ       BEGSR
      *
     C                     MOVE *BLANK    W@OQ    3
      *
     C                     MOVEL*BLANK    PQBAN1  1
     C                     MOVEL*BLANK    PQBAN2  2
     C                     MOVEL*BLANK    PQBAN3  2
     C                     MOVEL*BLANK    PQBAN4  1
     C                     MOVEL*BLANK    PQBMON  4
     C                     MOVEL'OQ '     PQKOTE  3
     C                     MOVEL*BLANK    PQKIBN  3
     C                     MOVEL*BLANK    PQKHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
     C           AAMRS9    PLIST
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PQBAN1  1
     C                     PARM           PQBAN2  2
     C                     PARM           PQBAN3  2
     C                     PARM           PQBAN4  1
     C                     PARM           PQBMON  4
     C                     PARM           PQKOTE  3
     C                     PARM           PQKIBN  3
     C                     PARM           PQKHIN 12
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'OQ '     W@OQ
     C                     GOTO EOQ
     C                     END
      *
     C                     MOVEL'LOQ'     PQKOTE  3
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'LOQ'     W@OQ
     C                     GOTO EOQ
     C                     END
      *
     C           EOQ       ENDSR
      *-----------------------------------------------------
     C           #LAN      BEGSR
      *
     C                     MOVE *BLANK    W@LAN   3
      *
     C                     MOVEL*BLANK    PQBAN1  1
     C                     MOVEL*BLANK    PQBAN2  2
     C                     MOVEL*BLANK    PQBAN3  2
     C                     MOVEL*BLANK    PQBAN4  1
     C                     MOVEL*BLANK    PQBMON  4
     C                     MOVEL'LAN'     PQKOTE  3
     C                     MOVEL*BLANK    PQKIBN  3
     C                     MOVEL*BLANK    PQKHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'LAN'     W@LAN
     C                     GOTO ELAN
     C                     END
      *
     C                     MOVEL'AOQ'     PQKOTE  3
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'AOQ'     W@LAN
     C                     GOTO ELAN
     C                     END
      *
     C           ELAN      ENDSR
      *-----------------------------------------------------
     C           #SB       BEGSR
      *
     C                     MOVE *BLANK    W@SB    3
      *
     C                     MOVEL*BLANK    PQBAN1  1
     C                     MOVEL*BLANK    PQBAN2  2
     C                     MOVEL*BLANK    PQBAN3  2
     C                     MOVEL*BLANK    PQBAN4  1
     C                     MOVEL*BLANK    PQBMON  4
     C                     MOVEL'SB '     PQKOTE  3
     C                     MOVEL*BLANK    PQKIBN  3
     C                     MOVEL*BLANK    PQKHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'SB '     W@SB
     C                     GOTO ESB
     C                     END
      *
     C                     MOVEL'KRO'     PQKOTE  3
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'KRO'     W@SB
     C                     GOTO ESB
     C                     END
      *
     C           ESB       ENDSR
      *===============================================================
     C           #ST       BEGSR
      *
     C                     MOVE *BLANK    W@ST    3
      *
     C                     MOVEL*BLANK    PQBAN1  1
     C                     MOVEL*BLANK    PQBAN2  2
     C                     MOVEL*BLANK    PQBAN3  2
     C                     MOVEL*BLANK    PQBAN4  1
     C                     MOVEL*BLANK    PQBMON  4
%02  C*         *          MOVEL'BZ '     PQKOTE  3
     C                     MOVEL*BLANK    PQKIBN  3
     C                     MOVEL*BLANK    PQKHIN 12
      *
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
%02  C*         *          MOVEL'BZ '     W@ST
%02  C                     MOVELPQKOTE    W@ST
     C                     GOTO EST
     C                     END
      *
%02  C*         *          MOVEL'DS '     PQKOTE  3
%02  C*         *          CALL 'AAMRS9'  AAMRS9
%02  C*         *PQKHIN    IFNE *BLANK
%02  C*         *          MOVEL'DS '     W@ST
%02  C*         *          GOTO EST
%02  C*         *          END
      *
%02  C           PQKOTE    IFEQ 'DS '
     C                     MOVEL'DSM'     PQKOTE  3
     C                     CALL 'AAMRS9'  AAMRS9
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'DS '     W@ST
     C                     GOTO EST
     C                     END
%02  C                     ENDIF
      *
     C           EST       ENDSR
      *===============================================================
**  ERR
ENTER IAF PART#
IAF PART# IS INVALID
DATE FROM IS INVALID
BIN IS INVALID
E-05 IAF PART# IS NOT IN KANBAN EXCHANGE MASTER
DATA NOT FOUND
STORE IS INVALID
E-08 IAF PART# IS NOT IN KANBAN EXCHANGE MASTER
E-09 IAF PART# DOES NOT HAVE DATA TO DISPLAY
E-10
