     H            Y.
     F** AHBR10 *******************************************
     F* ST ONEWAY ORDER STATUS INFO.
     F*  2020.07.24
     F*---------------------------------------------------------------*
     F*   DATE   |CO.LTD| NAME     | THE CONTENTS                     *
     F*---------------------------------------------------------------*
     F*2021.01.12|DCS   |T.MITSUI  |CORRESPONDING TO THE BUG.         *
     F*2021.03.12|DCS   |T.MITSUI  |ALCRS3 CHANGE                     *
     F*****************************************************************
     FAHBPW10 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FFCEPL01 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAH#PL22 IF  E           K        DISK
     FAJZPL31 IF  E           K        DISK
     FALCPL06 IF  E           K        DISK
     FAFAPL94 IF  E           K        DISK
     FNZUPL20 IF  E           K        DISK
     F*
     E*====================================================
     E                    ER      1  10 60               d[ｰxｮﾈｰﾆﾞ
     E* FOR SCREEN
     E                    DKT         6  3               工程
     E                    DBM         6  4 0             部門
     E                    DNM         6 10               部門名
     E                    DKB         6  3               機番
     E                    DBN         6  6               番地
     E                    DHN         6 10               代品番
     E                    DHZ         6  8 0             切替日
     E* FOR PROCESS MASTER
     E                    KKO        15  3               製造工程
     E                    KBM        15  4 0             製造部門
     E                    KHB        15 12               工程内品番
     E                    KKB        15  3               引当機番
     E                    KNB        15  6               所番地
     E                    KTY        15  1               かんばん種類
     E                    SSU        15  9 0             工程設定数
     E*
     E                    KQK        15  3               旧製造工程
     E                    KQB        15  4 0             旧製造部門
     E                    KQH        15 12               旧工程内品番
     E                    KQN        15  3               旧引当機番
     E                    KQT        15  6               旧所番地
     E                    KQS        15  1               旧かんばん種類
     E                    KHZ        15 10 0             切替日・便
     E* AFTER EXCHANGE
     E                    @KT        15  3               工程
     E                    @BM        15  4 0             部門
     E                    @HN        15 12               代品番
     E                    @KB        15  3               機番
     E                    @BN        15  6               番地
     E                    @KS        15  1               かんばん種類
     E                    @HZ        15 10 0             切替日
     E*
     I*================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W$JBNO
     I*(FCEPL01)
     I* SCHEDULED DELETION DATE
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I*収容数切替日
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I*(AAMPL11)社内かんばん切り替えマスタ
     I*製造工程コード
     I            DS
     I                                        1  45 KKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I*旧製造工程コード
     I            DS
     I                                        1  45 KQK
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I*製造部門コード
     I            DS
     I                                        1  60 KBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I*旧製造部門コード
     I            DS
     I                                        1  60 KQB
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I*工程内品番
     I            DS
     I                                        1 180 KHB
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I*旧工程内品番
     I            DS
     I                                        1 180 KQH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I*引き当て機番
     I            DS
     I                                        1  45 KKB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I*旧引き当て機番
     I            DS
     I                                        1  45 KQN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I*所番地
     I            DS
     I                                        1  90 KNB
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I*旧所番地
     I            DS
     I                                        1  90 KQT
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I*かんばん種類
     I            DS
     I                                        1  15 KTY
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I*工程設定数
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I*旧かんばん種類
     I            DS
     I                                        1  15 KQS
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I* f]ﾌﾞ]切替日、便
     I            DS
     I                                        1 150 KHZ
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1   80D1DATE
     I                                        1   40D1YY
     I                                        5   60D1MM
     I                                        7   80D1DD
     I*(AH#PL22)確定発注データ累積ファイル
     I*かんばん発行日
     I            DS
     I                                        1   80CFHTHZ
     I                                        1   40CFHTYY
     I                                        5   60CFHTMM
     I                                        7   80CFHTDD
     I            DS
     I                                        1   80J1PRHZ
     I                                        1   40J1PRYY
     I                                        5   60J1PRMM
     I                                        7   80J1PRDD
     I            DS
     I                                        1  15 J1BARC
     I                                        2   5 J1ZETI
     I*画面
     I*工程
     I            DS
     I                                        1  18 DKT
     I                                        1   3 D2KT1
     I                                        4   6 D2KT2
     I                                        7   9 D2KT3
     I                                       10  12 D2KT4
     I                                       13  15 D2KT5
     I                                       16  18 D2KT6
     I*部門
     I            DS
     I                                        1  240DBM
     I                                        1   40D2BM1
     I                                        5   80D2BM2
     I                                        9  120D2BM3
     I                                       13  160D2BM4
     I                                       17  200D2BM5
     I                                       21  240D2BM6
     I*部門名
     I            DS
     I                                        1  60 DNM
     I                                        1  10 D2NM1
     I                                       11  20 D2NM2
     I                                       21  30 D2NM3
     I                                       31  40 D2NM4
     I                                       41  50 D2NM5
     I                                       51  60 D2NM6
     I*機番
     I            DS
     I                                        1  18 DKB
     I                                        1   3 D2KB1
     I                                        4   6 D2KB2
     I                                        7   9 D2KB3
     I                                       10  12 D2KB4
     I                                       13  15 D2KB5
     I                                       16  18 D2KB6
     I*所番地
     I            DS
     I                                        1  36 DBN
     I                                        1   6 D2BN1
     I                                        7  12 D2BN2
     I                                       13  18 D2BN3
     I                                       19  24 D2BN4
     I                                       25  30 D2BN5
     I                                       31  36 D2BN6
     I*代表品番
     I            DS
     I                                        1  60 DHN
     I                                        1  10 D2DH1
     I                                       11  20 D2DH2
     I                                       21  30 D2DH3
     I                                       31  40 D2DH4
     I                                       41  50 D2DH5
     I                                       51  60 D2DH6
     I*工程切替日
     I            DS
     I                                        1  480DHZ
     I                                        1   80D2HZ1
     I                                        9  160D2HZ2
     I                                       17  240D2HZ3
     I                                       25  320D2HZ4
     I                                       33  400D2HZ5
     I                                       41  480D2HZ6
     I*
     I            DS
     I                                        1   8 $$HB
     I                                        1   20$$HBMM
     I                                        3   3 $$HB1
     I                                        4   50$$HBDD
     I                                        6   6 $$HB2
     I                                        7   80$$HBBB
     I            DS
     I                                        1   5 S@BANB
     I                                        1   2 S@BAN2
     I                                        3   3 S@BANC
     I                                        4   5 S@BAN3
     I*  日付WORK
     I            DS
     I                                        1   80W$DATE
     I                                        5   60W$MM
     I                                        7   80W$DD
     I*  時刻WORK
     I            DS
     I                                        1   60W$TIME
     I                                        1   20W$JJ
     I                                        3   40W$FF
     I*
     I            DS
     I                                        1  12 D1HIN
     I                                        1   5 D1HIN1
     I                                        6  10 D1HIN2
     I                                       11  12 D1HIN3
     I            DS
     I                                        1  12 PQKHIN
     I                                        1   5 PQKHN1
     I                                        6  10 PQKHN2
     I                                       11  12 PQKHN3
     I            DS
     I                                        1   5 WDAT
     I                                        1   2 WDAT1
     I                                        3   3 PD1
     I                                        4   5 WDAT2
      *
     I            DS
     I                                        1   5 WTIM
     I                                        1   2 WTIM1
     I                                        3   3 PC1
     I                                        4   5 WTIM2
     I*
     I            DS
     I                                        1  12 @@HIN
     I                                        1   5 @@HIN1
     I                                        6  10 @@KHN2
     I                                       11  12 @@KHN3
     I*
     I            DS
     I                                        1   80A9ODHZ
     I                                        1   40A9ODYY
     I                                        5   60A9ODMM
     I                                        7   80A9ODDD
     I*  SYSTEM DATE
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
     I*
     C*====================================================
     C*
     C*====================================================
     C           *ENTRY    PLIST
     C                     PARM           P$MODE  1
     C                     PARM           P$HIN1  5
     C                     PARM           P$HIN2  5
     C                     PARM           P$HIN3  2
     C                     PARM           P$DATE  80
     C                     PARM           P$BIN   20
     C                     PARM           P$STS   1
     C*
     C           AAMRS9    PLIST
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PQBAN1  1
     C                     PARM           PQBAN2  2
     C                     PARM           PQBAN3  2
     C                     PARM           PQBAN4  1
     C                     PARM           PQBMON  4
     C                     PARM           PQKOTE  3
     C                     PARM           PQKIBN  3
     C                     PARM           PQKHIN 12
     C*
     C*====================================================
     C*
     C*====================================================
     C           KEY01     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C*
     C           KEY02     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C                     KFLD           D1YY
     C                     KFLD           D1MM
     C                     KFLD           D1DD
     C                     KFLD           D1BIN
     C*
     C           KEY03     KLIST
     C                     KFLD           D1HIN1
     C                     KFLD           D1HIN2
     C                     KFLD           D1HIN3
     C                     KFLD           D1YY
     C                     KFLD           D1MM
     C                     KFLD           D1DD
     C*
     C           ALCKEY    KLIST
     C                     KFLD           K@CHYU  1
     C                     KFLD           K@ZETI  4
     C                     KFLD           K@PAGE  3
     C*
     C           KEY94     KLIST
     C                     KFLD           @@GAI            外注= *
     C                     KFLD           @@HIN1
     C                     KFLD           @@KHN2
     C                     KFLD           @@KHN3
     C*
     C           K@NZUP    KLIST
     C                     KFLD           K@SHN1  5         PART NO.1
     C                     KFLD           K@SHN2  5         PART NO.2
     C                     KFLD           K@SHN3  2         PART NO.3
     C                     KFLD           K@HAHZ  80        KANBAN ISSUE DATE
     C                     KFLD           K@HABB  20        KANBAN ISSUE BIN
     C                     KFLD           K@TEHI  3         LOT NO.
     C*
     C*====================================================
     C*
     C*====================================================
     C                     MOVEL'#D2SET  '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#D2SET  '#D2SET
     C           @STEP     CASEQ'#DSP2   '#DSP2
     C           @STEP     CASEQ'#CHK2   '#CHK2
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*====================================================
     C*
     C*====================================================
     C           #D2SET    BEGSR
     C*
     C           P$MODE    IFEQ '1'
     C                     SETON                     35
     C                     ELSE
     C                     SETOF                     35
     C                     ENDIF
     C                     TIME           @TIME
     C                     MOVELP$HIN1    D1HIN1
     C                     MOVELP$HIN2    D1HIN2
     C                     MOVELP$HIN3    D1HIN3
     C                     Z-ADDP$DATE    D1DATE
     C                     Z-ADDP$BIN     D1BIN   20
     C*
     C           KEY01     CHAINFCEPL01              91
     C*
     C           *IN91     IFEQ '1'
     C           *IN91     OREQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE@SYSHZ
     C                     Z-ADD*ZERO     A2GEKN
     C                     Z-ADD*ZERO     A2KSYS
     C                     Z-ADD*ZERO     A2SSYS
     C                     Z-ADD*ZERO     A2SYHZ
     C                     MOVEL*BLANK    A2TEHI
     C                     ENDIF
     C*
     C           KEY01     CHAINAAMPL11              92
     C*
     C           *IN92     IFEQ '1'
     C           *IN92     OREQ '0'
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLE@SYSHZ
     C                     MOVEL*BLANK    KKO              製造工程
     C                     Z-ADD*ZERO     KBM              製造部門
     C                     MOVEL*BLANK    KHB              工程内品番
     C                     MOVEL*BLANK    KKB              引当機番
     C                     MOVEL*BLANK    KNB              所番地
     C                     MOVEL*BLANK    KTY              かんばん種類
     C                     Z-ADD*ZERO     SSU              工程設定数
     C                     MOVEL*BLANK    KQK              Ｑ製造工程
     C                     Z-ADD*ZERO     KQB              Ｑ製造部門
     C                     MOVEL*BLANK    KQH              Ｑ工程内品番
     C                     MOVEL*BLANK    KQN              Ｑ引当機番
     C                     MOVEL*BLANK    KQT              Ｑ所番地
     C                     MOVEL*BLANK    KQS              Ｑかんばん種類
     C                     Z-ADD*ZERO     KHZ              切替日・便
     C                     ENDIF
     C*
     C*         手配名称
     C                     SELEC
     C           A2TEHI    WHEQ 'Z'
     C                     MOVEL'LIMIT '  D2TEHM           限定
     C           A2TEHI    WHEQ 'S'
     C                     MOVEL'TRIAL '  D2TEHM           試作
     C           A2TEHI    WHEQ 'G'
     C                     MOVEL'VOLUM '  D2TEHM           号口
     C                     OTHER
     C                     MOVEL*BLANK    D2TEHM
     C                     ENDSL
     C*収容数切替日
     C           A2SYHZ    IFLE @SYSHZ
     C                     Z-ADDA2SSYS    D2SYSU           新収容数
     C                     ELSE
     C                     Z-ADDA2KSYS    D2SYSU           旧収容数
     C                     ENDIF
     C*日当箱数
     C           A2GEKN    DIV  20        W$HIS   90       日当数量
     C           W$HIS     DIV  D2SYSU    HAKO      H      日当数量
     C*
     C                     MOVEL*BLANK    @KT              旧製造工程
     C                     Z-ADD*ZERO     @BM              旧製造部門
     C                     MOVEL*BLANK    @HN              旧工程内品番
     C                     MOVEL*BLANK    @KB              旧引当機番
     C                     MOVEL*BLANK    @BN              旧所番地
     C                     MOVEL*BLANK    @KS              旧かんばん種類
     C                     Z-ADD*ZERO     @HZ              切替日・便
     C*
     C           1         DO   15        A       30
     C           KHZ,A     IFNE *ZERO
     C           KHZ,A     DIV  100       $CHKDT  80
     C                     MOVELKQK,A     @KT,A            旧製造工程
     C                     Z-ADDKQB,A     @BM,A            旧製造部門
     C                     MOVELKQH,A     @HN,A            旧工程内品番
     C                     MOVELKQN,A     @KB,A            旧引当機番
     C                     MOVELKQT,A     @BN,A            旧所番地
     C                     MOVELKQS,A     @KS,A            旧かんばん種類
     C                     Z-ADDKHZ,A     @HZ,A            切替日・便
     C*
     C           @SYSHZ    IFGE $CHKDT
     C                     MOVELKKO,A     @KT,A            製造工程
     C                     Z-ADDKBM,A     @BM,A            製造部門
     C                     MOVELKHB,A     @HN,A            工程内品番
     C                     MOVELKKB,A     @KB,A            引当機番
     C                     MOVELKNB,A     @BN,A            所番地
     C                     MOVELKTY,A     @KS,A            かんばん種類
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*
     C           'SB '     LOKUP@KT                      79
     C*
     C*最終工程から前の６工程と表示
     C                     MOVEL*BLANK    DKT              工程
     C                     Z-ADD*ZERO     DBM              部門
     C                     MOVEL*BLANK    DNM
     C                     MOVEL*BLANK    DKB              機番
     C                     MOVEL*BLANK    DBN              番地
     C                     MOVEL*BLANK    DHN              品番
     C                     Z-ADD*ZERO     DHZ              切替日
     C                     Z-ADD6         B       30
     C                     Z-ADD15        C       30
     C                     MOVEL*BLANK    LAST    4
     C                     MOVEL*BLANK    WCHK    1
     C                     Z-ADD*ZERO     K       30
     C                     MOVEL*BLANK    @@GAI   4        外注
     C*
     C           1         DO   15        A       30
     C           @KT,C     IFNE *BLANK                     工程
     C           C         IFLT B
     C                     Z-ADDC         B
     C                     ENDIF
     C*
     C                     MOVEL@KT,C     DKT,B            工程
     C                     Z-ADD@BM,C     DBM,B            部門
     C                     MOVEL@KB,C     DKB,B            機番
     C                     MOVEL@BN,C     DBN,B            番地
     C                     MOVEL@HN,C     DHN,B            品番
     C                     Z-ADD@HZ,C     DHZ,B            切替日
     C*
     C           @@GAI     IFEQ *BLANK                     外注= *
     C           C         SUB  1         C1      30
     C           @BM,C     IFNE 111                        部門
     C                     MOVEL@BM,C     @@GAI            外注= *
     C                     MOVEL@HN,C     @@HIN            品番
     C*
     C                     ELSE
     C           C1        IFNE *ZERO                      番地
     C           @BN,C1    ANDNE'------'                   番地
     C                     MOVEL@BM,C     @@GAI            外注= *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           B         ADD  20        K
     C           WCHK      IFEQ *BLANK
     C           SSU,C     IFNE *ZERO
     C           A2GEKN    ANDNESSU,C
     C                     MOVEL'1'       *IN,K
     C                     MOVEL'1'       WCHK    1
     C                     ENDIF
     C                     ENDIF
     C*
     C           LAST      IFEQ *BLANK
     C                     MOVELDBM,B     LAST
     C                     ENDIF
     C*
     C           DBM,B     CHAINFGBPL01              91
     C*
     C  N91                MOVELB2SMEI    DNM,B
     C*
     C           B         IFLE 1
     C                     LEAVE
     C                     ENDIF
     C*
     C           B         SUB  1         B
     C                     ENDIF
     C*
     C           C         IFLE 1
     C                     LEAVE
     C                     ENDIF
     C*
     C           C         SUB  1         C
     C                     ENDDO
     C*
     C*  SFLCLR
     C                     SETON                     72
     C                     WRITESFCTL1
     C                     SETOF                     72
     C*
     C                     Z-ADD*ZERO     RRN     40
     C                     Z-ADD*ZERO     ENDRRN  40
     C*
     C  N35      KEY02     SETLLAH#PL22
     C   35      KEY03     SETLLAJZPL31
     C                     EXSR #READ
     C*
     C                     MOVEL'.'       $$HB1
     C                     MOVEL'-'       $$HB2
     C                     EXSR #SFSET
     C*
     C           RRN       IFEQ *ZERO
     C*                    MOVEL*BLANK    S1SEL
     C                     MOVEL*BLANK    S1SYHB           出庫日便
     C                     MOVEL*BLANK    S1THNO           手配番号
     C                     Z-ADD*ZERO     S1MAIS           枚数
     C                     MOVEL*BLANK    S1PDAY
     C                     MOVEL*BLANK    S1PTIM
     C                     MOVEL*BLANK    S1WDAY           投入日
     C                     MOVEL*BLANK    S1WTIM           投入時刻
     C                     MOVEL*BLANK    S1KDAY           計量日
     C                     MOVEL*BLANK    S1KTIM           計量時刻
     C                     MOVEL*BLANK    S1ODAY
     C                     MOVEL*BLANK    S1RDAY
     C                     MOVEL*BLANK    S1OTIM
     C                     MOVEL*BLANK    S1SDAY
     C                     MOVEL*BLANK    S1STIM
     C                     MOVEL*BLANK    S1CHYU           発注区分
     C                     MOVEL*BLANK    S1ZENO           絶対番号
     C                     MOVEL*BLANK    S1IN92
     C                     MOVEL*BLANK    S1IN93
     C                     MOVEL*BLANK    S1IN94
     C                     ADD  1         RRN
     C*
     C                     WRITESFREC1
     C*
     C                     SETON                     99
     C                     MOVELER,6      D2ERR
     C                     ENDIF
     C*
     C                     MOVEL'1'       PZMODE
     C                     CALL 'ALDR95'
     C                     PARM           PZMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PZUCNT  5
     C                     MOVE PZUCNT    D2UCNT
     C* SET INVENTORY
     C                     MOVELD1HIN1    $HIN1   5
     C                     MOVELD1HIN2    $HIN2   5
     C                     MOVELD1HIN3    $HIN3   2
     C                     MOVELD1DD      $HADD   2
     C                     MOVELD1BIN     $HABB   2
     C* SET START DATE
     C                     Z-ADDD1YY      WYY1    40
     C                     Z-ADDD1MM      WMM1    20
     C*
     C                     SELEC
     C           HAKO      WHGE 4
     C           WMM1      SUB  0         WMM2    20
     C           HAKO      WHGE 0.5
     C           WMM1      SUB  2         WMM2
     C                     OTHER
     C           WMM1      SUB  11        WMM2
     C                     ENDSL
     C*
     C           WMM2      IFLE *ZERO
     C           WMM2      ADD  12        WMM2
     C           WYY1      SUB  1         WYY2    40
     C                     ELSE
     C                     Z-ADDWYY1      WYY2
     C                     ENDIF
     C*
     C                     MOVELWYY2      $HAYY   4
     C                     MOVELWMM2      $HAMM   2
     C*
     C                     CALL 'NYUR31'
     C                     PARM           $HIN1   5
     C                     PARM           $HIN2   5
     C                     PARM           $HIN3   2
     C                     PARM           $HAYY   4
     C                     PARM           $HAMM   2
     C                     PARM           $HADD   2
     C                     PARM           $HABB   2
     C*                    OUT
     C                     PARM           $OHKSU  5
     C                     PARM           $OSISU  5
     C                     PARM           $ONYSU  5
     C                     PARM           $OSYSU  5
     C                     PARM           $OKISU  5
     C                     PARM           $OINV   5
     C                     MOVEL$OINV     D2INV
     C*
     C                     MOVE @SYSHZ    PZSDAT  8
     C                     CALL 'AB#CAY0'
     C                     PARM           PZMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PZSDAT  8
     C                     PARM           PZDAT1  8
     C                     PARM           PZTOL1  6
     C                     PARM           PZUNS1  6
     C                     PARM           PZDAT2  8
     C                     PARM           PZTOL2  6
     C                     PARM           PZUNS2  6
     C                     PARM           PZDAT3  8
     C                     PARM           PZTOL3  6
     C                     PARM           PZUNS3  6
     C*
     C                     MOVE PZTOL1    D@TOL1  61
     C                     MOVE PZUNS1    D@UNS1  61
     C                     MOVE PZTOL2    D@TOL2  61
     C                     MOVE PZUNS2    D@UNS2  61
     C                     MOVE PZTOL3    D@TOL3  61
     C                     MOVE PZUNS3    D@UNS3  61
     C*
     C* SET INDICATOR TO REVERSE FIELDS
     C                     SETOF                     5758
     C           D@UNS1    IFNE *ZERO
     C           D@UNS2    ANDNED@TOL2
     C                     SETON                     57
     C                     ENDIF
     C*
     C           D@UNS1    IFNE *ZERO
     C           D@UNS3    ANDNED@TOL3
     C                     SETON                     58
     C                     ENDIF
     C*
     C           D@UNS1    IFEQ *ZERO
     C           D@UNS2    ANDNE*ZERO
     C           D@UNS3    ANDNED@TOL3
     C                     SETON                     58
     C                     ENDIF
     C*
     C                     CALL 'FCERS9'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           S@BAN1  1
     C                     PARM           S@BAN2  2
     C                     PARM           S@BAN3  2
     C                     PARM           S@BAN4  1
     C                     MOVEL'-'       S@BANC
     C*
     C                     CALL 'AAFRS7'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           T@BAN1  1
     C                     PARM           T@BAN2  2
     C                     PARM           T@BAN3  2
     C                     PARM           T@BAN4  1
     C                     PARM           T@SRTN 20
     C                     PARM           T@SRT# 20
     C*
     C                     MOVELT@SRTN    U@CHR1    P
     C                     MOVELT@SRT#    U@CHR2    P
     C                     CALL 'UTLC11'
     C                     PARM           U@CHR1128
     C                     PARM           U@CHR2128
     C                     PARM *BLANK    U@CHR3128
     C                     MOVELU@CHR3    O@SRT
     C           @@GAI     COMP '0111'               7878  外注
     C*
     C                     MOVEA'10000'   *IN,44
     C                     Z-ADDRRN       ENDRRN  40
     C                     Z-ADD1         DSPRRN
     C                     MOVEL'#DSP2   '@STEP
     C*
     C                     ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #READ     BEGSR
     C*
     C           #READ1    TAG
     C*
     C           *IN35     IFEQ '0'
     C*
     C           KEY01     READEAH#PL22                  90
     C*
     C           *IN90     CABEQ'1'       #READE
     C*
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLE@SYSHZ
     C                     GOTO #READ1
     C                     ENDIF
     C*
     C                     ELSE
     C*
     C           KEY01     READEAJZPL31                  90
     C*
     C           *IN90     CABEQ'1'       #READE
     C*
     C                     MOVELJ1SHN1    CFHIN1
     C                     MOVELJ1SHN2    CFHIN2
     C                     MOVELJ1SHN3    CFHIN3
     C                     Z-ADDJ1PRYY    CFHTYY
     C                     Z-ADDJ1PRMM    CFHTMM
     C                     Z-ADDJ1PRDD    CFHTDD
     C                     Z-ADD99        CFHTBB
     C                     MOVE J1PTEH    CFTHNO
     C                     MOVE J1KANK    CFCHYU
     C                     Z-ADD1         CFMAIS
     C                     MOVE J1ZETI    CFZENO
     C                     ENDIF
     C*
     C                     MOVELCFHIN1    K@SHN1            PART NO.1
     C                     MOVELCFHIN2    K@SHN2            PART NO.2
     C                     MOVELCFHIN3    K@SHN3            PART NO.3
     C                     Z-ADDCFHTHZ    K@HAHZ            KANBAN ISSUE DATE
     C                     Z-ADDCFHTBB    K@HABB            KANBAN ISSUE BIN
     C                     MOVELCFTHNO    K@TEHI            LOT NO.
     C                     MOVEL'01'      WWPAGN  2
     C                     Z-ADD0         XXMAIS
     C                     SETOF                     95
     C           K@NZUP    SETGTNZUPL20
     C                     DO   *HIVAL
     C           K@NZUP    REDPENZUPL20                  95
     C           *IN95     IFEQ '1'
     C                     LEAVE
     C                     ENDIF
     C                     MOVELN2PAGN    WWPAGN
     C                     ADD  1         XXMAIS  30
     C                     ENDDO
     C*
     C           #READE    ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #SFSET    BEGSR
     C*
     C                     Z-ADDENDRRN    RRN
     C                     Z-ADD*ZERO     $CTR    30
     C*
     C           *IN90     DOWEQ'0'
     C           $CTR      ANDLT11
     C*                    MOVEL*BLANK    S1SEL
     C*     前工程出庫日・便
     C                     Z-ADDCFHTMM    $$HBMM
     C                     Z-ADDCFHTDD    $$HBDD
     C                     Z-ADDCFHTBB    $$HBBB
     C                     MOVEL$$HB      S1SYHB           出庫日便
     C                     MOVELCFTHNO    S1THNO           手配番号
     C                     MOVELWWPAGN    S1PAGE           ページ
     C                     MOVELCFCHYU    S1CHYU           発注区分
     C           S1CHYU    COMP 'R'                      41発注区分
     C                     Z-ADD*ZERO     S1MAIS           枚数
     C                     Z-ADD*ZERO     @@MAIS  40
     C                     MOVELCFZENO    S1ZENO           絶対番号
     C*         　　　・時刻
     C                     MOVEL*BLANK    S1PDAY           投入日
     C                     MOVEL*BLANK    S1PTIM           投入時刻
     C                     EXSR ##PIC
     C*         投入日・時刻
     C                     MOVEL*BLANK    S1WDAY           投入日
     C                     MOVEL*BLANK    S1WTIM  5        投入時刻
     C*****                EXSR ##WIN
     C*****
     C*****      S1WDAY    IFEQ *BLANK
     C*****                EXSR ##WIN2
     C*****                ENDIF
     C*****
     C*****      S1WDAY    IFEQ *BLANK
     C*****      *IN79     IFEQ '1'
     C*****                EXSR ##WIN3
     C*****                ENDIF
     C*****                ENDIF
     C*****
     C*****      S1WDAY    IFEQ *BLANK
     C*****                EXSR ##WIN4                     <ALHR0Z>
     C*****                ENDIF
     C           *IN79     IFEQ '1'
     C                     Z-ADD3         P@LM01           SERCH SEQ. OF ALMPP01
     C                     Z-ADD4         P@LH01           SERCH SEQ. OF ALHPP01
     C                     ELSE
     C                     Z-ADD0         P@LM01           SERCH SEQ. OF ALMPP01
     C                     Z-ADD3         P@LH01           SERCH SEQ. OF ALHPP01
     C                     ENDIF
     C           P@PKHZ    IFNE *ZERO
     C                     Z-ADDP@PKHZ    P@DATE           SERCH START DATE
     C                     Z-ADDP@PKTM    P@TIME           SERCH START TIME
     C                     ELSE
     C                     Z-ADD99999999  P@DATE           SERCH START DATE
     C                     Z-ADD999999    P@TIME           SERCH START TIME
     C                     ENDIF
     C                     CALL 'AJSR0Z'
     C*                   ( IN )
     C                     PARM CFHIN1    P@HNB1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HNB2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HNB3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER NO.
     C                     PARM WWPAGN    P@PAGE  2        PAGE NO
     C                     PARM CFHTHZ    P@DATE  80       SERCH START DATE
     C                     PARM N2KOTI    P@TIME  60       SERCH START TIME
     C                     PARM 1         P@JS10  10       SERCH SEQ. OF AJSPP10
     C                     PARM 2         P@JS50  10       SERCH SEQ. OF AJSPP50
     C                     PARM           P@LM01  10       SERCH SEQ. OF ALMPP01
     C                     PARM           P@LH01  10       SERCH SEQ. OF ALHPP01
     C*                   ( OUT )
     C                     PARM *ZERO     P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM *ZERO     P@WITM  60       WORK ADMITTABLE TIME
     C*
     C                     Z-ADDP@WIHZ    W$DATE           WORK DATE
     C                     Z-ADDP@WITM    W$TIME           WORK TIME
     C*                   日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1WDAY
     C                     MOVE $$TIME    S1WDAY
     C*
     C*         計量日・時刻
     C                     MOVEL*BLANK    S1KDAY           計量日
     C                     MOVEL*BLANK    S1KTIM  5        計量時刻
     C*****                EXSR ##KEI2
     C*****      S1KDAY    IFEQ *BLANK
     C*****                EXSR ##KEI
     C*****                ENDIF
     C           P@WIHZ    IFNE *ZERO
     C                     Z-ADDP@WIHZ    P@HTHZ           DATE OF KANBAN PUB.
     C                     Z-ADDP@WITM    P#HTTM           TIME OF KANBAN PUB.
     C                     ELSE
     C                     Z-ADD99999999  P@HTHZ           DATE OF KANBAN PUB.
     C                     Z-ADD999999    P#HTTM           TIME OF KANBAN PUB.
     C                     ENDIF
     C                     CALL 'ALCRS4'
     C*                   ( IN )
     C                     PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C                     PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C                     PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM WWPAGN    P@PAGE  2
     C                     PARM XXMAIS    P@MAIS  30
     C                     PARM           P@HTHZ  80       DATE OF KANBAN PUB.
     C                     PARM           P#HTTM  60       TIME OF KANBAN PUB.
     C*                   ( OUT )
     C                     PARM *ZERO     P@KEHZ  80       WEIGHING DATE
     C                     PARM *ZERO     P@KETM  60       WEIGHING TIME
     C*
     C                     Z-ADDP@KEHZ    W$DATE           WORK DATE
     C                     Z-ADDP@KETM    W$TIME           WORK TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1KDAY
     C                     MOVE $$TIME    S1KDAY
     C*
     C*        *外注日・時刻
     C                     SETOF                     5152
     C           @@GAI     IFNE '0111'                     外注= *
     C                     EXSR ##GAI
     C                     ENDIF
     C                     MOVEL*IN51     S1IN51
     C                     MOVEL*IN52     S1IN52
     C*         外注日・時刻
     C                     SETOF                     94
     C                     MOVEL*BLANK    S1ODAY
     C                     MOVEL*BLANK    S1RDAY
     C                     MOVEL*BLANK    S1OTIM
     C           LAST      IFNE '0111'
     C                     EXSR ##OUTS
     C                     ENDIF
     C                     MOVEL*IN94     S1IN94
     C*
     C                     Z-ADDCFHTHZ    S@HTHZ  80
     C                     Z-ADDCFHTBB    S@HTBB  20
     C*
     C           *IN90     DOWEQ'0'
     C           CFHTHZ    ANDEQS@HTHZ
     C           CFHTBB    ANDEQS@HTBB
     C                     ADD  CFMAIS    S1MAIS           枚数
     C*
     C*****                MOVE CFHTHZ    PHHTHZ
     C*****                CALL 'ALDRS1'
     C*****                PARM CFCHYU    PHCHYU  1
     C*****                PARM CFZENO    PHZENO  4
     C*****                PARM CFTHNO    PHTHNO  3
     C*****                PARM           PHHTHZ  8
     C*****                PARM           PHMAIS  4
     C*****                MOVE PHMAIS    W@MAIS  40
     C*****                ADD  W@MAIS    @@MAIS
     C                     CALL 'ALDRS8'
     C                     PARM           CFCHYU
     C                     PARM           CFZENO
     C                     PARM           CFTHNO
     C                     PARM CFHTHZ    PHHTHZ  80
     C                     PARM *ZERO     PHMAIS  50
     C                     ADD  PHMAIS    @@MAIS
     C* GET SORT SCAN DATE/TIME
     C                     EXSR ##SRT
     C*
     C                     EXSR #READ
     C                     ENDDO
     C*
     C                     SETOF                     9293
     C           @@MAIS    IFNE *ZERO
     C                     SETON                     92
     C                     ENDIF
     C*
     C           @@MAIS    IFGE S1MAIS
     C                     SETOF                     92
     C                     SETON                     93
     C                     ENDIF
     C*
     C                     MOVEL*IN92     S1IN92
     C                     MOVEL*IN93     S1IN93
     C*
     C*
     C                     ADD  1         RRN
     C                     ADD  1         $CTR
     C*
     C                     WRITESFREC1
     C*
     C           $CTR      IFEQ 1
     C                     Z-ADDRRN       DSPRRN
     C                     ENDIF
     C*
     C                     ENDDO
     C*
     C                     Z-ADDRRN       ENDRRN
     C*
     C                     ENDSR
     C*====================================================
     C*  GET DATE/TIME
     C*====================================================
     C           ##PIC     BEGSR
     C*
     C*****                CALL 'ALCRS1'
     C*****                PARM           CFCHYU  1
     C*****                PARM CFZENO    CFZENO  4
     C*****                PARM CFTHNO    CFTHNO  3
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@PKHZ  80       WORK ADMITTABLE DATE
     C*****                PARM           P@PKTM  60       WORK ADMITTABLE TIME
     C                     CALL 'ALCRS3'
     C*                   ( IN )
     C                     PARM CFCHYU    P@CHYU  1
     C                     PARM CFZENO    P@ZETI  4
     C                     PARM CFTHNO    P@TEHI  3
     C                     PARM WWPAGN    P@PAGE  2
     C                     PARM CFHTHZ    P@HTHZ  80
     C                     PARM CFHTBB    P@HTBB  20
     C                     PARM *ZERO     P@HTTM  60
     C*                   ( OUT )
     C                     PARM *ZERO     P@PKHZ  80       WORK ADMITTABLE DATE
     C                     PARM *ZERO     P@PKTM  60       WORK ADMITTABLE TIME
     C*
     C                     Z-ADDP@PKHZ    W$DATE           WORK DATE
     C                     Z-ADDP@PKTM    W$TIME           WORK TIME
     C* EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1PDAY
     C                     MOVEL$$TIME    S1PTIM
     C** PART REMOVED ?
     C                     MOVELCFCHYU    K@CHYU
     C                     MOVELCFZENO    K@ZETI
     C                     MOVELCFTHNO    K@PAGE
     C*
     C           ALCKEY    SETGTALCPL06
     C*
     C                     DO   *HIVAL
     C*
     C           ALCKEY    REDPEALCPL06                  88
     C   88                LEAVE
     C*
     C           A8DATE    IFLT CFHTHZ
     C                     ITER
     C                     ENDIF
     C*
     C           A8ERR     IFEQ 'E'
     C                     ITER
     C                     ENDIF
     C* ZETI=NUMERIC ?
     C                     MOVELA8BRC2    LTR4    4
     C                     TESTN          LTR4       98
     C  N98                MOVEL*BLANK    P@PCK   1
     C   98                MOVEL'Y'       P@PCK
     C                     LEAVE
     C                     ENDDO
     C*
     C* COLOR GREEN/RED FOR PICKUP FIELD
     C           P@PCK     IFEQ 'Y'
     C                     SETON                     50
     C                     ELSE
     C                     SETOF                     50
     C                     ENDIF
     C*
     C                     MOVEL*IN50     S1IN50
     C*
     C                     ENDSR
     C*====================================================
     C* SCAN DATE AND TIME
     C*====================================================
     C*****      ##WIN     BEGSR
     C*****
     C*****                CALL 'AJSR1Z'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C*****                PARM           P@WITM  60       WORK ADMITTABLE TIME
     C*****
     C*****                Z-ADDP@WIHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@WITM    W$TIME           WORK TIME
     C*****      日付・時刻の編集
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1WDAY
     C*****                MOVE $$TIME    S1WDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C*  SCAN DATE AND TIME
     C*====================================================
     C*****      ##WIN2    BEGSR
     C*****
     C*****                CALL 'AJSR2Z'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C*****                PARM           P@WITM  60       WORK ADMITTABLE TIME
     C*****
     C*****                Z-ADDP@WIHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@WITM    W$TIME           WORK TIME
     C*****      日付・時刻の編集
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1WDAY
     C*****                MOVE $$TIME    S1WDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C*  SCAN DATE AND TIME
     C*====================================================
     C*****      ##WIN3    BEGSR
     C*****
     C*****                CALL 'ALMR0Z'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C*****                PARM           P@WITM  60       WORK ADMITTABLE TIME
     C*****
     C*****                Z-ADDP@WIHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@WITM    W$TIME           WORK TIME
     C*****      日付・時刻の編集
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1WDAY
     C*****                MOVE $$TIME    S1WDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C*
     C*====================================================
     C*****      ##WIN4    BEGSR
     C*****
     C*****                CALL 'ALHR0Z'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C*****                PARM           P@WITM  60       WORK ADMITTABLE TIME
     C*****
     C*****                Z-ADDP@WIHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@WITM    W$TIME           WORK TIME
     C*****      日付・時刻の編集
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1WDAY
     C*****                MOVE $$TIME    S1WDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C*  ORDER DATE AND TIME  (OUTSRC)
     C*====================================================
     C           ##OUTS    BEGSR
     C*
     C                     CALL 'AFARS1'
     C                     PARM           CFCHYU
     C                     PARM           CFZENO
     C                     PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C                     PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*                               GET ------
     C                     PARM           P@OTHZ  8
     C                     PARM           P@PNHZ  8
     C                     PARM           P@RCHZ  8
     C                     PARM           P@OMAI  4
     C*
     C                     MOVE P@OTHZ    W$DATE           WORK DATE
     C                     Z-ADD*ZERO     W$TIME           WORK TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1ODAY
     C                     MOVEL$$TIME    S1OTIM
     C*
     C                     MOVE P@RCHZ    W$DATE           WORK DATE
     C                     Z-ADD*ZERO     W$TIME           WORK TIME
     C*  EDIT DATE AND TIME
     C*          日付・時刻の編集
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1RDAY
     C                     MOVEL$$TIME    S1OTIM
     C*
     C           S1RDAY    IFEQ *BLANK
     C           P@PNHZ    ANDNE*BLANK
     C                     SETON                     94
     C                     MOVE P@PNHZ    W$DATE           WORK DATE
     C                     Z-ADD*ZERO     W$TIME           WORK TIME
     C*  EDIT DATE AND TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1RDAY
     C                     MOVEL$$TIME    S1OTIM
     C                     ENDIF
     C*
     C                     ENDSR
     C*====================================================
     C* FAFAPL94
     C*====================================================
     C           ##GAI     BEGSR
     C*
     C           KEY94     SETGTAFAPL94
     C                     MOVEL*BLANK    S1WDAY
     C                     MOVEL*BLANK    S1KDAY
     C*
     C                     DO   *HIVAL
     C           KEY94     REDPEAFAPL94                  94
     C   94                LEAVE
     C*
     C           A9SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C*
     C           A9TEHI    IFNE S1THNO
     C                     ITER
     C                     ENDIF
     C*
     C           A9ODHZ    IFLT CFHTHZ
     C                     ITER
     C                     ENDIF
     C*
     C           A9HAKO    IFLT S1MAIS
     C                     SETON                     51
     C                     ENDIF
     C*
     C                     MOVE A9ODYY    W$04    4
     C           W$04      CAT  '.':0     S1WDAY
     C                     MOVE A9ODMM    W$02    2
     C           S1WDAY    CAT  W$02:0    S1WDAY
     C           S1WDAY    CAT  '.':0     S1WDAY
     C                     MOVE A9ODDD    W$02    2
     C           S1WDAY    CAT  W$02:0    S1WDAY
     C*
     C           A9NOYY    IFEQ *ZERO
     C                     SETON                     52
     C                     MOVE A9NYYY    W$04
     C                     MOVE A9NYMM    W$02
     C                     MOVE A9NYDD    W$02D   2
     C                     ELSE
     C                     MOVE A9NOYY    W$04
     C                     MOVE A9NOMM    W$02
     C                     MOVE A9NODD    W$02D   2
     C                     ENDIF
     C*
     C           W$04      CAT  '.':0     S1KDAY
     C           S1KDAY    CAT  W$02:0    S1KDAY
     C           S1KDAY    CAT  '.':0     S1KDAY
     C           S1KDAY    CAT  W$02D:0   S1KDAY
     C*
     C                     LEAVE
     C                     ENDDO
     C*
     C                     ENDSR
     C*====================================================
     C*  SCALE DATE AND TIME
     C*====================================================
     C*****      ##KEI     BEGSR
     C*****
     C*****                CALL 'AJHR2Z'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM           P@KEHZ  80       WEIGHING DATE
     C*****                PARM           P@KETM  60       WEIGHING TIME
     C*****
     C*****                Z-ADDP@KEHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@KETM    W$TIME           WORK TIME
     C*****IT DATE AND TIME
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1KDAY
     C*****                MOVE $$TIME    S1KDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C*         計量日・時刻
     C*====================================================
     C*****      ##KEI2    BEGSR
     C*****
     C*****                CALL 'AJHR2W'
     C*****                PARM CFHIN1    P@HIN1  5        PART NUMBER 1
     C*****                PARM CFHIN2    P@HIN2  5        PART NUMBER 2
     C*****                PARM CFHIN3    P@HIN3  2        PART NUMBER 3
     C*****                PARM CFTHNO    P@THAI  3        PRODUCTION ORDER
     C*****                PARM CFHTHZ    P@HTHZ  80       KANBAN PUBLICATION
     C*****                           GET ------
     C*****                PARM *ZERO     P@KEHZ  80       WEIGHING DATE
     C*****                PARM *ZERO     P@KETM  60       WEIGHING TIME
      *****
     C*****                Z-ADDP@KEHZ    W$DATE           WORK DATE
     C*****                Z-ADDP@KETM    W$TIME           WORK TIME
     C*****IT DATE AND TIME
     C*****                EXSR ##EDIT
     C*****                MOVEL$$DAY     S1KDAY
     C*****                MOVE $$TIME    S1KDAY
     C*****
     C*****                ENDSR
     C*====================================================
     C* GET SORT SCAN DATE/TIME
     C*====================================================
     C           ##SRT     BEGSR
     C*
     C                     MOVEL*BLANK    S1SDAY
     C                     MOVEL*BLANK    S1STIM
     C                     MOVEL*BLANK    WDAT
     C                     MOVEL*BLANK    WTIM
     C*
     C* GET SORT SACN DATE/TIME
     C*****                MOVELS@HTHZ    P@IDAT
     C*****                CALL 'ALCRS5'
     C*****                PARM D1HIN1    P@SHN1  5
     C*****                PARM D1HIN2    P@SHN2  5
     C*****                PARM D1HIN3    P@SHN3  2
     C*****                PARM S1THNO    P@TEHI  3
     C*****                PARM           P@IDAT  8
     C*****                PARM '00000000'P@SDAT  8
     C*****                PARM '000000'  P@STIM  6
     C*****                PARM *BLANK    P@STK   1
     C*****                PARM *BLANK    P@RTN   1
     C* CHECK ISSUE DATE
     C*****      P@RTN     IFEQ *BLANK
     C*****                MOVE P@SDAT    SRT80   80
     C*****      SRT80     IFLT CFHTHZ
     C*****                GOTO ##SRTX
     C*****                ENDIF
     C*****                ENDIF
     C*****
     C*****      P@RTN     IFEQ *BLANK
     C*****                MOVE P@SDAT    LTR4    4
     C*****                MOVELLTR4      WDAT1
     C*****                MOVE LTR4      WDAT2
     C*****                MOVEL'.'       PD1
     C*****                MOVELWDAT      S1SDAY
     C* EDIT
     C*****                MOVELP@STIM    LTR4    4
     C*****                MOVELLTR4      WTIM1
     C*****                MOVE LTR4      WTIM2
     C*****                MOVEL':'       PC1
     C*****                MOVELWTIM      S1STIM
     C*****                ENDIF
     C           P@KEHZ    IFNE *ZERO
     C                     Z-ADDP@KEHZ    P@DATE           DATE OF KANBAN PUB.
     C                     Z-ADDP@KETM    P@TIME           TIME OF KANBAN PUB.
     C                     ELSE
     C                     Z-ADD99999999  P@DATE           DATE OF KANBAN PUB.
     C                     Z-ADD999999    P@TIME           TIME OF KANBAN PUB.
     C                     ENDIF
     C                     CALL 'ALDRS7'
     C*                   ( IN )
     C                     PARM CFHIN1    P@LHN1  5        PART NO1
     C                     PARM CFHIN2    P@LHN2  5        PART NO2
     C                     PARM CFHIN3    P@LHN3  2        PART NO3
     C                     PARM CFTHNO    P@TEHA  3        PLASTIC PRODUCT NO.
     C                     PARM WWPAGN    P@PAGE  2        PLASTIC PAGE NO.
     C                     PARM           P@DATE  80       DATE OF KANBAN PUB.
     C                     PARM           P@TIME  60       TIME OF KANBAN PUB.
     C*                   ( OUT )
     C                     PARM *ZERO     P@CODT  80       PICKING DATE
     C                     PARM *ZERO     P@COTM  60       PICKING TIME
     C                     PARM *BLANK    P@STK   1        STOCK Y/N
     C*
     C                     Z-ADDP@CODT    W$DATE           WORK DATE
     C                     Z-ADDP@COTM    W$TIME           WORK TIME
     C                     EXSR ##EDIT
     C                     MOVEL$$DAY     S1SDAY
     C                     MOVEL$$TIME    S1STIM
     C*
     C* COLOR GREEN/RED FOR SRT/SHIPPING FIELD
     C           P@STK     IFEQ 'Y'
     C                     SETOF                     49
     C                     ELSE
     C                     SETON                     49
     C                     ENDIF
     C*
     C                     MOVEL*IN49     S1IN49
     C*
     C           ##SRTX    ENDSR
     C*===============================================================
     C*  SCREEN 2
     C*===============================================================
     C           #DSP2     BEGSR
     C*
     C                     SETON                     71
     C*
     C                     WRITEDSP02
     C                     EXFMTSFCTL1
     C*
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
     C*
     C                     SELEC
     C* F1  EXIT
     C           *INKA     WHEQ *ON
     C                     MOVEL'*'       P$STS
     C                     MOVEL'#END    '@STEP
     C* F2  SWHICH CMD
     C           *INKB     WHEQ *ON
     C                     SELEC
     C           *IN44     WHEQ '1'
     C                     MOVEA'01000'   *IN,44
     C           *IN45     WHEQ '1'
     C                     MOVEA'00100'   *IN,44
     C           *IN46     WHEQ '1'
     C                     MOVEA'00010'   *IN,44
     C           *IN47     WHEQ '1'
     C                     MOVEA'00001'   *IN,44
     C           *IN48     WHEQ '1'
     C                     MOVEA'10000'   *IN,44
     C                     ENDSL
     C                     MOVEL'#DSP2   '@STEP
     C* F3 *
     C           *INKC     WHEQ *ON
     C                     MOVEL' '       P$STS
     C                     MOVEL'#END    '@STEP
     C* F4 *
     C           *INKD     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     EXSR #SB
     C                     MOVE D1DATE    P#RDAT
     C*
     C                     SELEC
     C           W@SB      WHEQ 'SB '
     C                     CALL 'ALMR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C*
     C           W@SB      WHEQ 'KRO'
     C                     CALL 'ALMR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     ENDSL
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F5 *
     C           *INKE     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     EXSR #LAN
     C                     MOVE D1DATE    P#RDAT
     C*
     C                     SELEC
     C           W@LAN     WHEQ 'LAN'
     C                     CALL 'ALLR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C*
     C           W@LAN     WHEQ 'AOQ'
     C                     CALL 'ALLR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     ENDSL
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F6 *
     C           *INKF     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     EXSR #OQ
     C                     MOVE D1DATE    P#RDAT
     C*
     C                     SELEC
     C           W@OQ      WHEQ 'OQ '
     C                     CALL 'ALGR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C*
     C           W@OQ      WHEQ 'LOQ'
     C                     CALL 'ALHR11'
     C                     PARM           P#RDAT  8
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     ENDSL
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F7 *
     C           *INKG     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     MOVEL'BZ '     PQKOTE  3
     C                     EXSR #ST
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@ST      IFEQ 'BZ '
     C                     CALL 'AJSR30'
     C                     PARM '1'       PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     ENDIF
     C*
     C                     MOVEL'DS '     PQKOTE
     C                     EXSR #ST
     C*
     C           W@ST      IFEQ 'DS '
     C                     CALL 'AJSR35'
     C                     PARM '1'       PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     ENDIF
     C* F8 *
     C           *INKH     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     MOVE D1DATE    P#RDAT
     C                     CALL 'AJHR16'
     C                     PARM '1'       PQMODE  1
     C                     PARM D1HIN1    PQKHN1
     C                     PARM D1HIN2    PQKHN2
     C                     PARM D1HIN3    PQKHN3
     C                     PARM           P#RDAT  8
     C* F9 *
     C           *INKI     WHEQ *ON
     C                     CALL 'AFDRS1'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F10 *
     C           *INKJ     WHEQ *ON
     C                     CALL 'ALDR95'
     C                     PARM '2'       PXMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PXUCNT  5
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F11 *
     C           *INKK     WHEQ *ON
     C                     EXSR ##AKAR
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F12 *
     C           *INKL     WHEQ *ON
     C                     CALL 'AKAC31'
     C                     PARM '4'       PPMODE  1
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F13 *
     C           *INKM     WHEQ *ON
     C**                   CALL 'ABBR25'
JW   C                     CALL 'ABBR25A'
     C                     PARM           D1HIN
     C                     PARM *BLANK    P@MPAR 20
     C                     PARM *BLANK    P@TOKU  4
     C                     PARM *BLANK    P@NONY  4
     C                     PARM *BLANK    P@NKOJ  1
     C                     PARM *BLANK    P@NUKE  4
     C                     PARM *BLANK    P@SEBN  4
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F14 *
     C           *INKN     WHEQ *ON
     C                     MOVE @SYSHZ    PPDATE
     C                     CALL 'ALDR461'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PPDATE  8
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F15 *
     C           *INKP     WHEQ *ON
     C                     CALL 'MBER71'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PYYYYY  4
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F16 *
     C           *INKQ     WHEQ *ON
     C                     MOVELD1DATE    P$SDT
     C                     CALL 'AB#C18'
     C                     PARM           P$SDT   8
     C                     PARM '99999999'P$EDT   8
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F17 *
     C           *INKR     WHEQ *ON
     C                     CALL 'ANYC2C'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           GGBAN1  1
     C                     PARM           GGBAN2  2
     C                     PARM           GGBAN3  2
     C                     PARM           GGBAN4  1
     C                     PARM           GGBAN1
     C                     PARM           GGBAN2
     C                     PARM           GGBAN3
     C                     PARM           GGBAN1
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F18 *
     C           *INKS     WHEQ *ON
     C                     MOVE D1DATE    PPDATE
     C                     CALL 'AJZR60'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C                     PARM           PPDATE
     C*
     C                     MOVEL'#DSP2   '@STEP
     C* F19 *
     C           *INKT     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     MOVEL'BZ '     PQKOTE
     C                     EXSR #ST
     C                     MOVE D1DATE    P#RDAT
     C*
     C           W@ST      IFEQ 'BZ '
     C                     CALL 'AJSR31'
     C                     PARM '1'       PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     ENDIF
     C*
     C                     MOVEL'DS '     PQKOTE
     C                     EXSR #ST
     C*
     C           W@ST      IFEQ 'DS '
     C                     CALL 'AJSR36'
     C                     PARM '1'       PQMODE  1
     C                     PARM           PQKHN1
     C                     PARM           PQKHN2
     C                     PARM           PQKHN3
     C                     PARM           P#RDAT  8
     C                     ENDIF
     C* F20 *
     C           *INKU     WHEQ *ON
     C                     MOVE @SYSHZ    P#DATE
     C                     CALL 'DATR1A'
     C                     PARM           P#DATE  8
     C                     PARM '-'       P#PORM  1        + OR -
     C                     PARM '0003'    P#DAYS  4
     C                     PARM *BLANK    P#RDAT  8
     C                     PARM *BLANK    P#RTN   1
     C*
     C                     MOVE D1DATE    P#RDAT
     C                     CALL 'AJHR26'
     C                     PARM '1'       PQMODE  1
     C                     PARM D1HIN1    PQKHN1
     C                     PARM D1HIN2    PQKHN2
     C                     PARM D1HIN3    PQKHN3
     C                     PARM           P#RDAT  8
     C*
     C* F21 *
     C           *INKV     WHEQ *ON
     C                     MOVE @SYSHZ    PDATE
     C                     CALL 'DATR12'
     C                     PARM           PDATE   8
     C                     PARM '-'       PPORM   1        + OR -
     C                     PARM '0090'    PDAYS   4
     C                     PARM *BLANK    PRDAT   8
     C                     PARM *BLANK    PRTN    1
     C*
     C                     MOVE PRDAT     ##FRM
     C                     MOVE '01'      ##FRM
     C                     MOVEL'999999'  ##TO
     C                     MOVELD1HIN     P1HIN     P
     C*
     C                     CALL 'GDGC8Z'
     C                     PARM           P1HIN  15
     C                     PARM           ##FRM   6
     C                     PARM           ##TO    6
     C*
     C* F22 * WIP SATTUS INQUIRY (INV)
     C           *INKW     WHEQ *ON
     C                     MOVELD1HIN1    $HIN1
     C                     MOVELD1HIN2    $HIN2
     C                     MOVELD1HIN3    $HIN3
     C                     MOVELD1DD      $HADD
     C                     MOVELD1BIN     $HABB
     C*
     C                     Z-ADDD1YY      WYY1    40
     C                     Z-ADDD1MM      WMM1    20
     C*
     C                     SELEC
     C           HAKO      WHGE 4
     C           WMM1      SUB  0         WMM2
     C           HAKO      WHGE 0.5
     C           WMM1      SUB  2         WMM2
     C                     OTHER
     C           WMM1      SUB  11        WMM2
     C                     ENDSL
     C*
     C           WMM2      IFLE *ZERO
     C           WMM2      ADD  12        WMM2
     C           WYY1      SUB  1         WYY2    40
     C                     ELSE
     C                     Z-ADDWYY1      WYY2
     C                     ENDIF
     C                     MOVELWYY2      $HAYY   4
     C                     MOVELWMM2      $HAMM   2
     C*
     C                     CALL 'NYUR30'
     C                     PARM           $HIN1   5
     C                     PARM           $HIN2   5
     C                     PARM           $HIN3   2
     C                     PARM           $HAYY   4
     C                     PARM           $HAMM   2
     C                     PARM           $HADD   2
     C                     PARM           $HABB   2
     C* F24 * STOCK (INY)
     C           *INKY     WHEQ *ON
     C                     CALL 'STAC40'
     C                     PARM           D1HIN1
     C                     PARM           D1HIN2
     C                     PARM           D1HIN3
     C* 73 *(ROLL UP)
     C           *IN73     WHEQ *ON
     C  N90                EXSR #SFSET
     C                     MOVEL'#DSP2   '@STEP
     C* 74 *(ROLL DOWN)
     C           *IN74     WHEQ *ON
     C                     MOVEL'#DSP2   '@STEP
     C*
     C                     OTHER
     C                     MOVEL'#CHK2   '@STEP
     C                     ENDSL
     C*
     C                     ENDSR
     C*===============================================================
     C* CHECK SCREEN 2
     C*===============================================================
     C           #CHK2     BEGSR
     C*
     C                     MOVEL'#DSP2   '@STEP
     C*
     C                     DO   ENDRRN    RRN
     C*
     C           RRN       CHAINSFREC1               91
     C   91                LEAVE
     C*
     C*          S1SEL     IFEQ '1'
     C*                    CALL 'AHBR11'
     C*                    PARM           S1ZENO
     C*                    PARM           S1THNO
     C*                    PARM *BLANK    P$FLG   1        1=F1,3=F3
     C*                    ENDIF
     C*
     C*                    MOVEL*BLANK    S1SEL
     C           S1CHYU    COMP 'R'                      41
     C                     MOVELS1IN92    *IN92
     C                     MOVELS1IN93    *IN93
     C                     MOVELS1IN94    *IN94
     C                     MOVELS1IN50    *IN50
     C                     MOVELS1IN51    *IN51
     C                     MOVELS1IN52    *IN52
     C                     MOVELS1IN49    *IN49
     C*
     C                     UPDATSFREC1
     C*
     C*          P$FLG     IFEQ '1'                        1=F1,3=F3
     C*                    MOVEL'#END    '@STEP
     C*                    LEAVE
     C*                    ENDIF
     C  N99                ENDDO
     C*
     C                     ENDSR
     C*===============================================================
     C* EDIT DATE AND TIME
     C*===============================================================
     C           ##EDIT    BEGSR
     C*
     C                     MOVEL*BLANK    $$DAY   5
     C                     MOVEL*BLANK    $$TIME  5
     C*
     C           W$DATE    IFNE *ZERO
     C                     Z-ADDW$MM      $$HBMM
     C                     MOVEL'.'       $$HB1
     C                     Z-ADDW$DD      $$HBDD
     C                     MOVEL$$HB      $$DAY
     C                     Z-ADDW$JJ      $$HBMM
     C                     MOVEL':'       $$HB1
     C                     Z-ADDW$FF      $$HBDD
     C                     MOVEL$$HB      $$TIME
     C                     ENDIF
     C*
     C                     MOVEL'.'       $$HB1
     C*
     C                     ENDSR
     C*===============================================================
     C* INQUIRE PRODUCTION PROCESS INFORMATION
     C*===============================================================
     C           ##AKAR    BEGSR
     C*
     C                     MOVEL'X'       P$SNO   1
     C                     MOVEL*BLANK    P$F3    1
     C                     MOVEL*BLANK    P$ERR   1
     C*
     C                     DO   *HIVAL
     C                     MOVE P$SNO     P$NO
     C                     CALL 'AKAR27'
     C                     PARM           P$F3    1
     C                     PARM           P$ERR   1
     C                     PARM D1HIN     P$HIN  12
     C                     PARM           P$NO    1
     C*
     C           P$F3      IFEQ '1'
     C           P$ERR     ORNE *BLANK
     C                     LEAVE
     C                     ENDIF
     C*
     C                     CALL 'AKAR28'
     C                     PARM           P$F3
     C                     PARM           P$SNO   1
     C                     PARM           P$ERR   1
     C                     PARM D1HIN1    P$SHN1  5
     C                     PARM D1HIN2    P$SHN2  5
     C                     PARM D1HIN3    P$SHN3  2
     C*
     C           P$F3      IFEQ '1'
     C           P$ERR     ORNE *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C*
     C           P$ERR     IFEQ 'E'
     C                     SETON                       99
     C                     MOVELER,8      D2ERR
     C                     ENDIF
     C*
     C           P$ERR     IFEQ '9'
     C                     SETON                       99
     C                     MOVELER,9      D2ERR
     C                     ENDIF
     C*
     C                     ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #OQ       BEGSR
     C*
     C                     MOVEL*BLANK    W@OQ    3
     C*
     C                     MOVEL*BLANK    PQBAN1
     C                     MOVEL*BLANK    PQBAN2
     C                     MOVEL*BLANK    PQBAN3
     C                     MOVEL*BLANK    PQBAN4
     C                     MOVEL*BLANK    PQBMON
     C                     MOVEL'OQ '     PQKOTE
     C                     MOVEL*BLANK    PQKIBN
     C                     MOVEL*BLANK    PQKHIN
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'OQ '     W@OQ
     C*
     C                     ELSE
     C                     MOVEL'LOQ'     PQKOTE
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'LOQ'     W@OQ
     C                     ENDIF
     C                     ENDIF
     C*
     C           EOQ       ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #LAN      BEGSR
     C*
     C                     MOVEL*BLANK    W@LAN   3
     C*
     C                     MOVEL*BLANK    PQBAN1
     C                     MOVEL*BLANK    PQBAN2
     C                     MOVEL*BLANK    PQBAN3
     C                     MOVEL*BLANK    PQBAN4
     C                     MOVEL*BLANK    PQBMON
     C                     MOVEL'LAN'     PQKOTE
     C                     MOVEL*BLANK    PQKIBN
     C                     MOVEL*BLANK    PQKHIN
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'LAN'     W@LAN
     C*
     C                     ELSE
     C                     MOVEL'AOQ'     PQKOTE
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'AOQ'     W@LAN
     C                     ENDIF
     C                     ENDIF
     C*
     C           ELAN      ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #SB       BEGSR
     C*
     C                     MOVEL*BLANK    W@SB    3
     C*
     C                     MOVEL*BLANK    PQBAN1
     C                     MOVEL*BLANK    PQBAN2
     C                     MOVEL*BLANK    PQBAN3
     C                     MOVEL*BLANK    PQBAN4
     C                     MOVEL*BLANK    PQBMON
     C                     MOVEL'SB '     PQKOTE
     C                     MOVEL*BLANK    PQKIBN
     C                     MOVEL*BLANK    PQKHIN
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'SB '     W@SB
     C*
     C                     ELSE
     C                     MOVEL'KRO'     PQKOTE
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'KRO'     W@SB
     C                     ENDIF
     C                     ENDIF
     C*
     C           ESB       ENDSR
     C*====================================================
     C*
     C*====================================================
     C           #ST       BEGSR
     C*
     C                     MOVEL*BLANK    W@ST    3
     C*
     C                     MOVEL*BLANK    PQBAN1
     C                     MOVEL*BLANK    PQBAN2
     C                     MOVEL*BLANK    PQBAN3
     C                     MOVEL*BLANK    PQBAN4
     C                     MOVEL*BLANK    PQBMON
     C                     MOVEL*BLANK    PQKIBN
     C                     MOVEL*BLANK    PQKHIN
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVELPQKOTE    W@ST
     C*
     C                     ELSE
     C           PQKOTE    IFEQ 'DS '
     C                     MOVEL'DSM'     PQKOTE
     C                     CALL 'AAMRS9'  AAMRS9
     C*
     C           PQKHIN    IFNE *BLANK
     C                     MOVEL'DS '     W@ST
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
     C*
     C           EST       ENDSR
     C*====================================================
**  ERR
ENTER IAF PART#
IAF PART# IS INVALID
DATE FROM IS INVALID
BIN IS INVALID
E-05 IAF PART# IS NOT IN KANBAN EXCHANGE MASTER
DATA NOT FOUND
STORE IS INVALID
E-08 IAF PART# IS NOT IN KANBAN EXCHANGE MASTER
E-09 IAF PART# DOES NOT HAVE DATA TO DISPLAY
E-10
