     H            Y.
     F** AI#R81 ********************************************
     F*    ..  A-PICS JOBLOG DATA FILE REFORMATION  ..     *
     F*                                                    *
     F* TCHK1 10/18/07 CRATE(COPY FROM AI#R80)             *
     F******************************************** AI#R81 **
     FAIAPP60 IP  E                    DISK
     FAIAWP60 O   E                    DISK
      *
     I            DS
     I                                        1   80DATHZ
     I                                        1   40D6TUYY
     I                                        5   60D6TUMM
     I                                        7   80D6TUDD
      *
     I            DS
     I                                        1   80WHIZK
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   8
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
     C                     MOVE PHIZK     WHIZK   80
      *
     C                     ADD  1         WRECD   70
      *
     C           DATHZ     IFGT WHIZK
     C                     ADD  1         WKENS   70
     C                     WRITEAIAWP601
     C                     END
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
