     H            Y.
     F** AIAR08 ****************************************
     F* ...M/F DATA FOR  DAILY HANDLING TRANSMISSION || *.
     F* I-HASADA                        86.11.21       *
     F**************************************** AIAR08 **
     FAZZPPDF UF  E           K        DISK                      A
     FAALPL11 UF  E           K        DISK
     I            DS
     I                                        1   60ZZTIME
     I                                        1   20ZZHORS
     I                                        3   40ZZMINS
     I                                        5   60ZZSECS
     I            DS
     I                                        1   80CLDTHZ
     I                                        1   40CLDTYY
     I                                        5   60CLDTMM
     I                                        7   80CLDTDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PKBN    1
     C                     MOVEL'AIANP04' WFILE  10
     C           STP1      TAG
      *
     C                     SETOF                     01
     C           WFILE     CHAINAZZPPDF1             01
     C           *IN01     IFEQ '1'
     C                     MOVE WFILE     ZZFILE
     C                     Z-ADD0         ZZTIME
     C                     WRITEAZZPPDF1
     C                     GOTO STP1
     C                     END
      *
     C           PKBN      IFEQ *BLANK
      *
     C                     Z-ADD1         A       10
     C           1         DO   1         A
      *
     C           A         IFEQ 1
     C                     Z-ADD0111      WBMON   40
     C                     END
      *
     C                     SETOF                     01
     C           WBMON     CHAINAALPL111             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       CLDTOK
     C                     MOVE *BLANK    CLTENS
     C                     Z-ADD*DATE     CLDTHZ
     C                     UPDATAALPL111
     C                     END
     C                     END
      *
     C                     CALL 'AIAC04'
     C                     MOVEL'AIAC04'  ZZPROG
      *
     C                     ELSE
      *
     C                     CALL 'AIAC07'
     C                     MOVEL'AIAC07'  ZZPROG
      *
     C                     END
      *
     C                     TIME           ZZTIME
     C                     UPDATAZZPPDF1
      *
     C                     SETON                     LR
     C                     RETRN
