     H            Y.
     F** AIAR18 **********************
     F*  DAILY MASTER DATA TRANSFER  *
     F*   I-HASADA      1997.04.16   *
     F********************** AIAR18 **
     FAALPL11 UF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           PBMON   4
     C                     PARM           PKUBN   1
     C                     PARM           PEROR   1
     C                     PARM           PDATE   8
     C                     MOVE PBMON     WBMON   40
      *
     C*------------------------------*
     C*  ..時刻別計算便マスター..  *
     C*------------------------------*
     C                     SETOF                     10
     C           WBMON     CHAINAALPL111             10
     C           *IN10     IFEQ '1'
     C                     SETON                     U1
     C                     ELSE
      *
     C                     MOVE CLDTHZ    PDATE
      *
     C           PKUBN     IFEQ *BLANK
      *
     C*----------------------------------*
     C*  ..準備中か？　の　チェック..  *
     C*----------------------------------*
     C           CLDTOK    IFEQ 'H'
     C           CLTENS    ANDEQ*BLANK
     C                     MOVE '2'       PEROR
     C                     ELSE
      *
     C*--------------------------------------------------*
     C*  ..既にＦＤ処理が処理済みか？　の　チェック..  *
     C*--------------------------------------------------*
     C           CLDTHZ    IFEQ *DATE
     C           CLDTOK    IFEQ '*'
     C           CLTENS    ANDEQ'*'
     C                     MOVE '3'       PEROR
     C                     END
     C                     ELSE
      *
     C*------------------------------------------*
     C*  ..準備されているか？　の　チェック..  *
     C*------------------------------------------*
     C           CLDTHZ    IFLE *DATE
     C           CLDTOK    IFEQ '*'
     C           CLTENS    ANDEQ'*'
     C                     MOVE '1'       PEROR
     C                     ELSE
      *
     C*------------------------------------------------*
     C*  ..ＦＤ処理がされているか？　の　チェック..  *
     C*------------------------------------------------*
     C           CLDTOK    IFEQ '*'
     C           CLTENS    ANDEQ*BLANK
     C                     MOVE '4'       PEROR
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C*------------------------*
     C*  ..転送完了マーク..  *
     C*------------------------*
     C                     ELSE
     C                     MOVE '*'       CLTENS
     C                     UPDATAALPL111
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
