     H            Y.
      ****************************************************************
      *     PROGRAM NAME.  : DATA TRANSMISSION CONTROL FILE INQUIRY SCREEN *
      *     PROGRAM ID.    : AAKR12.      <RPG>                      *
      *     CREATE DATE.   : SEP.18,'86.                             *
      *     AUTHOR.        : E.K                                     *
      ****************************************************************
     FAIAPW12 CF  E                    WORKSTN
     FAALPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     F*
     F*
     E                    BCD         9  4 0             m]cﾅg ﾎﾞy] ﾃｰnﾞ
     E                    BNM         9 16               m]cﾅg ﾎﾞy] xb
     E                    GRP         9  2               mﾞｰj hﾞﾓｰﾎﾟ ﾃｰnﾞ
     E                    GNM         9 20               mﾞｰj hﾞﾓｰﾎﾟ xb
     E                    JYU         9  1               mﾞｰj ﾆﾞｬ]ﾍﾞ f]ﾒｭc ﾃｰnﾞ
     E                    JNM         9  8               mﾞｰj ﾆﾞｬ]ﾍﾞ f]ﾒｭc xb
     E                    SKB         9  1               m]c f]ﾒｭc ﾃｰnﾞ
     E                    SNM         9  6               m]c f]ﾒｭc xb
     E                    TAB1    1   1  2   TAB2   20   mﾞｰj hﾞﾓｰﾎﾟ ﾃｰnﾞ.xb
     E                    TAB3    1   9  1   TAB4    8   ﾆﾞｬ]ﾍﾞ f]ﾒｭc ﾃｰnﾞ.xb
     E                    TAB5    1   9  1   TAB6    6   m]c f]ﾒｭc ﾃｰnﾞ.xb
     E                    HIZ         9  8 0             mﾞｰj ﾅhﾈbﾍﾞ
     E                    MSG     1   1 60               d[ｰ xｮﾈｰﾆﾞ
     E*
     E*    m]cﾅg ﾎﾞy] ﾃｰnﾞ
     E*
     I            DS
     I                                        1  36 BCD
     I                                        1   40BCD01
     I                                        5   80BCD02
     I                                        9  120BCD03
     I                                       13  160BCD04
     I                                       17  200BCD05
     I                                       21  240BCD06
     I                                       25  280BCD07
     I                                       29  320BCD08
     I                                       33  360BCD09
     I*
     I*    m]cﾅg ﾎﾞy] xb
     I*
     I            DS
     I                                        1 144 BNM
     I                                        1  16 BNM01
     I                                       17  32 BNM02
     I                                       33  48 BNM03
     I                                       49  64 BNM04
     I                                       65  80 BNM05
     I                                       81  96 BNM06
     I                                       97 112 BNM07
     I                                      113 128 BNM08
     I                                      129 144 BNM09
     I*
     I*    mﾞｰj hﾞﾓｰﾎﾟ ﾃｰnﾞ
     I*
     I            DS
     I                                        1  18 GRP
     I                                        1   2 GRP01
     I                                        3   4 GRP02
     I                                        5   6 GRP03
     I                                        7   8 GRP04
     I                                        9  10 GRP05
     I                                       11  12 GRP06
     I                                       13  14 GRP07
     I                                       15  16 GRP08
     I                                       17  18 GRP09
     I*
     I*    mﾞｰj hﾞﾓｰﾎﾟ xb
     I*
     I            DS
     I                                        1 180 GNM
     I                                        1  20 GNM01
     I                                       21  40 GNM02
     I                                       41  60 GNM03
     I                                       61  80 GNM04
     I                                       81 100 GNM05
     I                                      101 120 GNM06
     I                                      121 140 GNM07
     I                                      141 160 GNM08
     I                                      161 180 GNM09
     I*
     I*    mﾞｰj ﾆﾞｬ]ﾍﾞ f]ﾒｭc ﾃｰnﾞ
     I*
     I            DS
     I                                        1   9 JYU
     I                                        1   1 JYU01
     I                                        2   2 JYU02
     I                                        3   3 JYU03
     I                                        4   4 JYU04
     I                                        5   5 JYU05
     I                                        6   6 JYU06
     I                                        7   7 JYU07
     I                                        8   8 JYU08
     I                                        9   9 JYU09
     I*
     I*    mﾞｰj ﾆﾞｬ]ﾍﾞ f]ﾒｭc xb
     I*
     I            DS
     I                                        1  72 JNM
     I                                        1   8 JNM01
     I                                        9  16 JNM02
     I                                       17  24 JNM03
     I                                       25  32 JNM04
     I                                       33  40 JNM05
     I                                       41  48 JNM06
     I                                       49  56 JNM07
     I                                       57  64 JNM08
     I                                       65  72 JNM09
     I*
     I*    m]c f]ﾒｭc ﾃｰnﾞ
     I*
     I            DS
     I                                        1   9 SKB
     I                                        1   1 SKB01
     I                                        2   2 SKB02
     I                                        3   3 SKB03
     I                                        4   4 SKB04
     I                                        5   5 SKB05
     I                                        6   6 SKB06
     I                                        7   7 SKB07
     I                                        8   8 SKB08
     I                                        9   9 SKB09
     I*
     I*    m]c f]ﾒｭc xb
     I*
     I            DS
     I                                        1  54 SNM
     I                                        1   6 SNM01
     I                                        7  12 SNM02
     I                                       13  18 SNM03
     I                                       19  24 SNM04
     I                                       25  30 SNM05
     I                                       31  36 SNM06
     I                                       37  42 SNM07
     I                                       43  48 SNM08
     I                                       49  54 SNM09
     I*
     I*    mﾞｰj ﾅhﾈbﾍﾞ
     I*
     I            DS
     I                                        1  72 HIZ
     I                                        1   80HIZ01
     I                                        9  160HIZ02
     I                                       17  240HIZ03
     I                                       25  320HIZ04
     I                                       33  400HIZ05
     I                                       41  480HIZ06
     I                                       49  560HIZ07
     I                                       57  640HIZ08
     I                                       65  720HIZ09
     I*
     I*    ﾎｦbﾓ ﾉ mﾞｰj ﾅhﾈbﾍﾞ
     I*
     I            DS
     I                                        1   80HIZKE
     I                                        1   40CLDTYY
     I                                        5   60CLDTMM
     I                                        7   80CLDTDD
     C****************************************************************
     C*  START PROGRAM  <AIAR12>                                     *
     C****************************************************************
     C                     MOVEA'00'      *IN,81
     C                     MOVEA'0'       *IN,99
     C*
     C*   ﾌbﾛl ﾉ CLR
     C*
     C           STP0      TAG
     C                     Z-ADD*ZERO     BCD
     C                     Z-ADD*ZERO     HIZ
     C                     MOVE *BLANK    BNM
     C                     MOVE *BLANK    GRP
     C                     MOVE *BLANK    GNM
     C                     MOVE *BLANK    JYU
     C                     MOVE *BLANK    JNM
     C                     MOVE *BLANK    SKB
     C                     MOVE *BLANK    SNM
     C                     Z-ADD*ZERO     I       50
     C*
     C*   ﾅbﾆｭ ﾉ ﾈｮn
     C*
     C           *LOVAL    SETLLAALPL111
     C*
     C*
     C*
B001 C                     DO   *HIVAL
     C                     READ AALPL111                 10
     C   10                GOTO STP1
     C                     ADD  1         I
     C           I         CABGT9         STP1
     C                     Z-ADDCLBMON    BCD,I
     C           BCD,I     CHAINFGBPL011             10
     C  N10                MOVELB2SMEI    BNM,I
     C                     MOVELCLDATA    GRP,I
     C           GRP,I     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      GNM,I
     C                     MOVELCLDTOK    JYU,I
     C           JYU,I     LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      JNM,I
     C                     MOVELCLTENS    SKB,I
     C           SKB,I     LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      SNM,I
     C                     Z-ADDHIZKE     HIZ,I
E001 C                     END
     C*
     C*
     C*
     C           STP1      TAG
     C                     EXFMTAIAPW121
     C                     MOVEL*BLANK    ERRMSG
     C*
     C*  CMD:1
     C*
     C                     SETOF                     99
     C   KA                SETON                     LR
     C   KA                RETRN
     C*
     C*  ﾜｰﾓaｮﾎﾟ.ﾜｰﾓjﾞc]
     C*
     C   81                GOTO STP81
     C   82                GOTO STP82
     C                     GOTO STP1
     C*
     C*  ﾜｰﾓ aｮﾎﾟ
     C*
     C           STP82     TAG
B001 C           BCD,9     IFEQ 0
B002 C           *IN,82    IFEQ '1'
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'0'       *IN,82
     C                     GOTO STP1
E002 C                     END
E001 C                     END
     C*
     C*
     C           APLKEY    KLIST
     C                     KFLD           WWBUMN
     C                     KFLD           WWDATA
     C                     Z-ADDBCD,9     WWBUMN  40
     C                     MOVE GRP,9     WWDATA  2
     C           APLKEY    SETGTAALPL111
     C*
     C*
     C                     SETOF                     11
     C                     DO   *HIVAL
     C                     READ AALPL111                 12
     C           *IN,12    IFEQ '0'
B002 C           *IN,11    IFEQ '0'
     C                     Z-ADD*ZERO     I
     C                     Z-ADD*ZERO     BCD
     C                     Z-ADD*ZERO     HIZ
     C                     MOVE *BLANK    BNM
     C                     MOVE *BLANK    GRP
     C                     MOVE *BLANK    GNM
     C                     MOVE *BLANK    JYU
     C                     MOVE *BLANK    JNM
     C                     MOVE *BLANK    SKB
     C                     MOVE *BLANK    SNM
     C                     MOVEA'1'       *IN,11
E002 C                     END
     C                     ADD  1         I
     C           I         CABGT9         STP1
     C                     Z-ADDCLBMON    BCD,I
     C           BCD,I     CHAINFGBPL011             10
     C  N10                MOVELB2SMEI    BNM,I
     C                     MOVELCLDATA    GRP,I
     C           GRP,I     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      GNM,I
     C                     MOVELCLDTOK    JYU,I
     C           JYU,I     LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      JNM,I
     C                     MOVELCLTENS    SKB,I
     C           SKB,I     LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      SNM,I
     C                     Z-ADDHIZKE     HIZ,I
     C                     END
     C  N12                END
     C           I         CABLT0         STP2
     C                     GOTO STP1
     C*
     C*  ﾜｰﾓ jﾞc]
     C*
     C           STP81     TAG
B001 C           BCD,1     IFEQ 0
B002 C           *IN,81    IFEQ '1'
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'0'       *IN,81
     C                     GOTO STP1
E002 C                     END
E001 C                     END
     C*
     C*
     C*
     C                     Z-ADDBCD,1     WWBUMN
     C                     MOVE GRP,1     WWDATA
     C           APLKEY    SETLLAALPL111
     C                     SETOF                     11
     C*
     C*
     C                     DO   *HIVAL
     C                     READPAALPL111                 12
     C           *IN,12    IFEQ '0'
B001 C           *IN,11    IFEQ '0'
     C                     Z-ADD10        I
     C                     Z-ADD*ZERO     BCD
     C                     Z-ADD*ZERO     HIZ
     C                     MOVE *BLANK    BNM
     C                     MOVE *BLANK    GRP
     C                     MOVE *BLANK    GNM
     C                     MOVE *BLANK    JYU
     C                     MOVE *BLANK    JNM
     C                     MOVE *BLANK    SKB
     C                     MOVE *BLANK    SNM
     C                     MOVEA'1'       *IN,11
E001 C                     END
     C                     SUB  1         I
     C           I         CABLE0         STP1
     C                     Z-ADDCLBMON    BCD,I
     C           BCD,I     CHAINFGBPL011             10
     C  N10                MOVELB2SMEI    BNM,I
     C                     MOVELCLDATA    GRP,I
     C           GRP,I     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      GNM,I
     C                     MOVELCLDTOK    JYU,I
     C           JYU,I     LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      JNM,I
     C                     MOVELCLTENS    SKB,I
     C           SKB,I     LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      SNM,I
     C                     Z-ADDHIZKE     HIZ,I
     C                     END
     C  N12                END
     C           I         CABEQ10        STP3
     C                     GOTO STP1
     C*
     C*
     C           STP2      TAG
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C*
     C*
     C           STP3      TAG
     C                     MOVELMSG,1     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C*
     C*
**  TAB1 / TAB2 (DATA GROUP )
CAAPICS CONNECTION M/F
**  TAB3 / TAB4 (DATA PREPARATIONS COMPLETED)
  NON
* CMPLET
H PREPAR
**  TAB5 / TAB6 (TRANSMISSION COMPLETED)
  NON
*CMPLT
**  MSG (ERROR MESSAGE )
E-01 OVER THE FIRST OR THE LAST RECORD IN ROL-UP/DOWN
