     H            Y.                      F
     F** AIAR04 ******************************
     F* KANBAN M/F SEND
     F*        H.ITO        86.10.13         *
     F* UPDATE:K.OKACHI 2001.12.03 %0001     *
     F****************************** AIAR04 **
     FINPUT   IP  F     300  2AI     1 DISK
     FACAPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     FAIA0111 O   F     256            DISK                      A
     IINPUT   AA  01
     I                                        1   2 AMK
     I                                        3  43 ADAT0
     I                                        3 249 ADAT1
     I                                        4   8 @HIN1
     I                                        9  13 @HIN2
     I                                       14  15 @HIN3
     I                                      250 300 ADAT2
     I                                       94  97 A3MAKB
     I                                       44  47 AMAKB
     I                                      107 107 AKCD11
     I                                      197 197 AKCD12
     I                                       30  34 HIN1
     I                                       35  39 HIN2
     I                                       40  41 HIN3
      *
     C           KEYA      KLIST
     C                     KFLD           XMAKB
     C                     KFLD           WKCD
      *
     C           KEYB      KLIST
     C                     KFLD           XMAKB
     C                     KFLD           WKCD
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
      *
     C           KEY1      KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      *
     C           AMK       IFEQ 'ZM'
     C                     GOTO @END
     C                     MOVE @HIN1     KHIN1   5
     C                     MOVE @HIN2     KHIN2   5
     C                     MOVE @HIN3     KHIN3   2
      *
     C                     SETOF                     02
     C                     MOVE AMAKB     XMAKB   40
     C                     MOVE AKCD11    WKCD    1
      *
     C                     Z-ADD0         WMAKB   40
     C                     MOVE *BLANK    WKCD1   1
     C                     MOVE *BLANK    WSW1    1
      *
     C           WKCD      IFEQ '0'
     C           XMAKB     OREQ 8907
     C***                  Z-ADD8907      WMAKB
%0001C                     Z-ADD0111      WMAKB
     C                     ELSE
      *
     C           KEYA      SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEYA      READEACAPL111                 02
     C           *IN02     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     02
     C                     MOVE '*'       WSW1
     C                     Z-ADDI1BMON    WMAKB
     C                     MOVE I1KCD1    WKCD1
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           WSW1      IFEQ *BLANK
     C                     Z-ADD8990      WMAKB
     C                     ELSE
      *
     C                     SETOF                     03
     C           KEYB      CHAINACAPL111             03
     C           *IN03     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
     C           *IN03     IFEQ '0'
     C                     Z-ADDI1BMON    WMAKB
     C                     ELSE
      *
     C           WMAKB     IFEQ 8907
     C           WKCD1     IFNE '0'
     C                     Z-ADD8990      WMAKB
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     03
     C           KEY1      CHAINAGAPL311             03
     C           *IN03     IFEQ '0'
     C           CBSKJY    ANDEQ'D'
     C           CBSKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
     C           *IN03     IFEQ '0'
     C           WKCD      CABNECBKDAI    END
     C                     END
      *
     C                     Z-ADD0         WKEIZ
     C                     MOVELADAT0     WDATA
      *
     C           WMAKB     IFEQ 0111
     C                     EXCPTDT1
     C                     END
      *
     C           END       TAG
     C                     END
      *
     C           AMK       IFEQ 'MK'
     C           AMK       OREQ 'TN'
     C           AMK       OREQ 'HT'
     C           AMK       OREQ 'KN'
      *
     C                     MOVE *BLANK    WKCD
     C           AMK       IFEQ 'TN'
     C                     MOVE AKCD12    WKCD
     C                     ELSE
     C                     MOVE AKCD11    WKCD
     C                     END
      *
     C                     SETOF                     02
     C                     MOVE HIN1      KHIN1
     C                     MOVE HIN2      KHIN2
     C                     MOVE HIN3      KHIN3
     C                     MOVE A3MAKB    XMAKB
      *
     C                     Z-ADD0         WMAKB
     C                     MOVE *BLANK    WKCD1
     C                     MOVE *BLANK    WSW1
      *
     C           WKCD      IFEQ '0'
     C           XMAKB     OREQ 8907
     C***                  Z-ADD8907      WMAKB
%0001C                     Z-ADD0111      WMAKB
     C                     ELSE
      *
     C           KEYA      SETLLACAPL111
      *
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEYA      READEACAPL111                 02
     C           *IN02     IFEQ '0'
     C           I1SKJY    IFEQ 'D'
     C           I1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     02
     C                     MOVE '*'       WSW1
     C                     Z-ADDI1BMON    WMAKB
     C                     MOVE I1KCD1    WKCD1
      *
     C                     END
     C                     END
     C  N02                END
      *
     C           WSW1      IFEQ *BLANK
     C                     Z-ADD8990      WMAKB
     C                     ELSE
      *
     C                     SETOF                     03
     C           KEYB      CHAINACAPL111             03
     C           *IN03     IFEQ '0'
     C           I1SKJY    ANDEQ'D'
     C           I1SKHZ    ANDLE*DATE
     C                     SETON                     03
     C                     END
     C           *IN03     IFEQ '0'
     C                     Z-ADDI1BMON    WMAKB
     C                     ELSE
      *
     C           WMAKB     IFEQ 8907
     C           WKCD1     IFNE '0'
     C                     Z-ADD8990      WMAKB
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD0         WKEIZ   10
      *
     C           WMAKB     IFEQ 0111
     C           AMK       IFEQ 'TN'
     C                     Z-ADD1         WKEIZ
     C                     MOVELADAT1     WDATA 247
     C                     EXCPTDT1
     C                     Z-ADD0         WKEIZ
     C                     MOVELADAT2     WDATA
     C                     EXCPTDT1
     C                     ELSE
     C                     MOVELADAT1     WDATA
     C                     EXCPTDT1
     C                     END
     C                     END
     C                     END
      *
     C           @END      TAG
      *
     OAIA0111 EADD             DT1
     O                                    2 'DT'
     O                                    6 '0000'
     O                         AMK        8
     O                         WKEIZ      9
     O                         WDATA  B 256
      *
**  CODE TRANSLATION TABLE  FROM ASCII TO EBCDIC
*EQUATE AIA0111
*EQUATE 00000101020203039C04090586067F0797088D098E0A0B0B0C0C0D0D0E0E0F0F10101111
*EQUATE 121213139D140A150816871718181919921A8F1B1C1C1D1D1E1E1F1F8020812182228323
*EQUATE 8424852517261B27882889298A2A8B2B8C2C052D062E072F903091311632933394349535
*EQUATE 96360437983899399A3A9B3B143C153D9E3E1A3F2040A141A242A343A444A545A646A747
*EQUATE A848A9495B4A2E4B3C4C284D2B4E214F2650AA51AB52AC53AD54AE55AF566157B0586259
*EQUATE 5D5A5C5B2A5C295D3B5E5E5F2D602F6163626463656466656766686769686A697C6A2C6B
*EQUATE 256C5F6D3E6E3F6F6B706C716D726E736F74707571767277737860793A7A237B407C277D
*EQUATE 3D7E227F7480B181B282B383B484B585B686B787B888B989BA8A758BBB8CBC8DBD8EBE8F
*EQUATE BF90C091C192C293C394C495C596C697C798C899C99A769B779CCA9DCB9ECC9F78A07EA1
*EQUATE CDA2CEA3CFA4D0A5D1A6D2A7D3A8D4A9D5AA79ABD6ACD7ADD8AED9AF7AB0A0B1E0B2E1B3
*EQUATE E2B4E3B5E4B6E5B7E6B8E7B9DABADBBBDCBCDDBDDEBEDFBF7BC041C142C243C344C445C5
*EQUATE 46C647C748C849C9E8CAE9CBEACCEBCDECCEEDCF7DD04AD14BD24CD34DD44ED54FD650D7
*EQUATE 51D852D9EEDAEFDBF0DCF1DDF2DEF3DF24E09FE153E254E355E456E557E658E759E85AE9
*EQUATE F4EAF5EBF6ECF7EDF8EEF9EF30F031F132F233F334F435F536F637F738F839F9FAFAFBFB
*EQUATE FCFCFDFDFEFEFFFF
