     H            Y.
      *************************************************************
      *   ROGRAM NAME.   :COMMUNICATION JOBLOG BETWEEN IBM AS/400-Q/700 *
      *   PROGRAM ID.    : AIAR11.      <RPG>                     *
      *   CREATE DATE.   : SEP.29,'86.                            *
      *   AUTHOR.        : E.K                                    *
      *                               (INC."G.B.C.")              *
      *************************************************************
     FAIAPW11 CF  E                    WORKSTN
     FAI#PL02 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E*
     E*     ﾌbﾛl
     E*
     E                    HIZ        16  8 0             lcﾆ] ﾍlﾞi
     E                    JIK        16  6 0             lcﾆ] ﾆﾞﾃh
     E                    BMN        16  4 0             ﾎﾞy] ﾃｰnﾞ
     E                    JOB        16  5 0             JOB-NO
     E                    R#         16  2               R#
     E                    DTA        16  2               mﾞｰj
     E                    SAI        16  1               ﾅb
     E                    GSM        16  2               MSG
     E                    BLK        16  2               BLK
     E                    KAT        16  1               ﾎﾞ]fl
     E                    ERR        16  2               d[ｰ
     E                    TER        16  4               lcﾆ] d[ｰ
     E                    TAB1    1  12  2   TAB2   18   mﾞｰj ﾆｬsﾞl ﾃｰnﾞ.xb
     E                    TAB3    1  33  2   TAB4   72   ﾑcgｬc xｮﾈｰﾆﾞ
     E                    TAB5    1  88  4   TAB6   72   ﾒjｰ]ﾃｰnﾞ.xｮﾈｰﾆﾞ
     E                    MSG     1   8 60               d[ｰ xｮﾈｰﾆﾞ
     I**
     I**   lcﾆ] ﾍlﾞi
     I**
     I            DS
     I                                        1 128 HIZ
     I                                        1   80HIZ01
     I                                        9  160HIZ02
     I                                       17  240HIZ03
     I                                       25  320HIZ04
     I                                       33  400HIZ05
     I                                       41  480HIZ06
     I                                       49  560HIZ07
     I                                       57  640HIZ08
     I                                       65  720HIZ09
     I                                       73  800HIZ10
     I                                       81  880HIZ11
     I                                       89  960HIZ12
     I                                       97 1040HIZ13
     I                                      105 1120HIZ14
     I                                      113 1200HIZ15
     I                                      121 1280HIZ16
     I*
     I*    lcﾆ] ﾆﾞﾃh
     I*
     I            DS
     I                                        1  96 JIK
     I                                        1   60JIK01
     I                                        7  120JIK02
     I                                       13  180JIK03
     I                                       19  240JIK04
     I                                       25  300JIK05
     I                                       31  360JIK06
     I                                       37  420JIK07
     I                                       43  480JIK08
     I                                       49  540JIK09
     I                                       55  600JIK10
     I                                       61  660JIK11
     I                                       67  720JIK12
     I                                       73  780JIK13
     I                                       79  840JIK14
     I                                       85  900JIK15
     I                                       91  960JIK16
     I*
     I*    ﾎﾞy] ﾃｰnﾞ
     I*
     I            DS
     I                                        1  64 BMN
     I                                        1   40BMN01
     I                                        5   80BMN02
     I                                        9  120BMN03
     I                                       13  160BMN04
     I                                       17  200BMN05
     I                                       21  240BMN06
     I                                       25  280BMN07
     I                                       29  320BMN08
     I                                       33  360BMN09
     I                                       37  400BMN10
     I                                       41  440BMN11
     I                                       45  480BMN12
     I                                       49  520BMN13
     I                                       53  560BMN14
     I                                       57  600BMN15
     I                                       61  640BMN16
     I*
     I*    JOB-NO
     I*
     I            DS
     I                                        1  80 JOB
     I                                        1   50JOB01
     I                                        6  100JOB02
     I                                       11  150JOB03
     I                                       16  200JOB04
     I                                       21  250JOB05
     I                                       26  300JOB06
     I                                       31  350JOB07
     I                                       36  400JOB08
     I                                       41  450JOB09
     I                                       46  500JOB10
     I                                       51  550JOB11
     I                                       56  600JOB12
     I                                       61  650JOB13
     I                                       66  700JOB14
     I                                       71  750JOB15
     I                                       76  800JOB16
     I*
     I*    R#
     I*
     I            DS
     I                                        1  32 R#
     I                                        1   2 R#01
     I                                        3   4 R#02
     I                                        5   6 R#03
     I                                        7   8 R#04
     I                                        9  10 R#05
     I                                       11  12 R#06
     I                                       13  14 R#07
     I                                       15  16 R#08
     I                                       17  18 R#09
     I                                       19  20 R#10
     I                                       21  22 R#11
     I                                       23  24 R#12
     I                                       25  26 R#13
     I                                       27  28 R#14
     I                                       29  30 R#15
     I                                       31  32 R#16
     I*
     I*    mﾞｰj
     I*
     I            DS
     I                                        1  32 DTA
     I                                        1   2 DTA01
     I                                        3   4 DTA02
     I                                        5   6 DTA03
     I                                        7   8 DTA04
     I                                        9  10 DTA05
     I                                       11  12 DTA06
     I                                       13  14 DTA07
     I                                       15  16 DTA08
     I                                       17  18 DTA09
     I                                       19  20 DTA10
     I                                       21  22 DTA11
     I                                       23  24 DTA12
     I                                       25  26 DTA13
     I                                       27  28 DTA14
     I                                       29  30 DTA15
     I                                       31  32 DTA16
     I*
     I*    ﾅb
     I*
     I            DS
     I                                        1  16 SAI
     I                                        1   1 SAI01
     I                                        2   2 SAI02
     I                                        3   3 SAI03
     I                                        4   4 SAI04
     I                                        5   5 SAI05
     I                                        6   6 SAI06
     I                                        7   7 SAI07
     I                                        8   8 SAI08
     I                                        9   9 SAI09
     I                                       10  10 SAI10
     I                                       11  11 SAI11
     I                                       12  12 SAI12
     I                                       13  13 SAI13
     I                                       14  14 SAI14
     I                                       15  15 SAI15
     I                                       16  16 SAI16
     I*
     I*    MSG
     I*
     I            DS
     I                                        1  32 GSM
     I                                        1   2 GSM01
     I                                        3   4 GSM02
     I                                        5   6 GSM03
     I                                        7   8 GSM04
     I                                        9  10 GSM05
     I                                       11  12 GSM06
     I                                       13  14 GSM07
     I                                       15  16 GSM08
     I                                       17  18 GSM09
     I                                       19  20 GSM10
     I                                       21  22 GSM11
     I                                       23  24 GSM12
     I                                       25  26 GSM13
     I                                       27  28 GSM14
     I                                       29  30 GSM15
     I                                       31  32 GSM16
     I*
     I*    BLK
     I*
     I            DS
     I                                        1  32 BLK
     I                                        1   2 BLK01
     I                                        3   4 BLK02
     I                                        5   6 BLK03
     I                                        7   8 BLK04
     I                                        9  10 BLK05
     I                                       11  12 BLK06
     I                                       13  14 BLK07
     I                                       15  16 BLK08
     I                                       17  18 BLK09
     I                                       19  20 BLK10
     I                                       21  22 BLK11
     I                                       23  24 BLK12
     I                                       25  26 BLK13
     I                                       27  28 BLK14
     I                                       29  30 BLK15
     I                                       31  32 BLK16
     I*
     I*    ﾎﾞ]fl
     I*
     I            DS
     I                                        1  16 KAT
     I                                        1   1 KAT01
     I                                        2   2 KAT02
     I                                        3   3 KAT03
     I                                        4   4 KAT04
     I                                        5   5 KAT05
     I                                        6   6 KAT06
     I                                        7   7 KAT07
     I                                        8   8 KAT08
     I                                        9   9 KAT09
     I                                       10  10 KAT10
     I                                       11  11 KAT11
     I                                       12  12 KAT12
     I                                       13  13 KAT13
     I                                       14  14 KAT14
     I                                       15  15 KAT15
     I                                       16  16 KAT16
     I*
     I*    d[ｰ
     I*
     I            DS
     I                                        1  32 ERR
     I                                        1   2 ERR01
     I                                        3   4 ERR02
     I                                        5   6 ERR03
     I                                        7   8 ERR04
     I                                        9  10 ERR05
     I                                       11  12 ERR06
     I                                       13  14 ERR07
     I                                       15  16 ERR08
     I                                       17  18 ERR09
     I                                       19  20 ERR10
     I                                       21  22 ERR11
     I                                       23  24 ERR12
     I                                       25  26 ERR13
     I                                       27  28 ERR14
     I                                       29  30 ERR15
     I                                       31  32 ERR16
     I*
     I*    lcﾆ] d[ｰ
     I*
     I            DS
     I                                        1  64 TER
     I                                        1   4 TER01
     I                                        5   8 TER02
     I                                        9  12 TER03
     I                                       13  16 TER04
     I                                       17  20 TER05
     I                                       21  24 TER06
     I                                       25  28 TER07
     I                                       29  32 TER08
     I                                       33  36 TER09
     I                                       37  40 TER10
     I                                       41  44 TER11
     I                                       45  48 TER12
     I                                       49  52 TER13
     I                                       53  56 TER14
     I                                       57  60 TER15
     I                                       61  64 TER16
     I*
     I*    ﾍlﾞi
     I*
     I            DS
     I                                        1   80HIZKE
     I                                        1   40DATUYY
     I                                        5   60DATUMM
     I                                        7   80DATUDD
     I*
     I*    ﾍlﾞi
     I*
     I            DS
     I                                        1   80DATE
     I                                        1   40DATEY1
     I                                        3   40DATEYY
     I                                        5   60DATEMM
     I                                        7   80DATEDD
     I*
     I*    ﾆﾞﾃh
     I*
     I            DS
     I                                        1   60JIKOK
     I                                        1   20DATUHH
     I                                        3   40DATUFF
     I                                        5   60DATUSS
     I*
     I*    ﾆﾞﾃh
     I*
     I            DS
     I                                        1   60TIME
     I                                        1   20TIMEHH
     I                                        3   40TIMEMM
     I                                        5   60TIMESS
     I*
     I*    m]c ﾛﾃｰnﾞ ﾛbacn
     I*
     I            DS
     I                                        1 256 DADATA
     I                                        1   2 RECKBN
     I                                        3   60RQKOJ
     I                                        7   8 RQGRP
     I                                        9   9 RQSAI
     I                                       10  11 RQMSG
     I                                       12  17 RQAKI
     I                                       18  210RQYY
     I                                       22  230RQMM
     I                                       24  250RQDD
     I                                       26  270RQBIN
     I                                       28  29 RQBLK
     I                                       30  30 RQKAN
     I                                        3   4 BKBLK
     I                                        5   5 BKKAN
     I                                        3   60DTREN
     I                                        7   8 DTSYU
     I                                        9   90DTKAI
     I                                        3   60EEKEN
     I                                        1  64 DATA01
     I                                       65 128 DATA02
     I                                      129 192 DATA03
     I*
     I*    ﾆﾞf]
     I*
     I            DS
     I                                        1   60HMS
     I                                        1   20HOUR
     I                                        3   40MINUTE
     I                                        5   60SECOND
     C****************************************************************
     C*  START PROGRAM  <AIAR11>                                     *
     C****************************************************************
     C*
     C*   ﾍｭcﾆg ﾉ CLR
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'00'      *IN,81
     C                     MOVEA'0'       *IN,99
     C*
     C*   ﾌbﾛl ﾉ CLR
     C*
     C           STP0      TAG
     C                     Z-ADD0         HIZ
     C                     Z-ADD0         JIK
     C                     Z-ADD0         BMN
     C                     Z-ADD0         JOB
     C                     MOVE *BLANK    ERR
     C                     MOVE *BLANK    TER
     C                     MOVE *BLANK    R#
     C                     MOVE *BLANK    DTA
     C                     MOVE *BLANK    SAI
     C                     MOVE *BLANK    GSM
     C                     MOVE *BLANK    BLK
     C                     MOVE *BLANK    KAT
     C                     Z-ADD0         I       50
     C                     Z-ADD0         DATE
     C                     Z-ADD0         TIME
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     MOVEA'00000'   *IN,31
     C                     MOVEA'00000'   *IN,36
     C*
     C*   ﾅbﾆｭ ﾉ ﾈｮn
     C*
     C                     Z-ADD*YEAR     YYY     40
     C                     Z-ADDUMONTH    MMM     20
     C                     Z-ADDUDAY      DDD     20
     C                     TIME           HMS
     C                     SUB  1         HOUR
     C           HOUR      IFLT 0
     C                     Z-ADD0         HOUR
     C                     END
     C           XXXKEY    KLIST
     C                     KFLD           YYY
     C                     KFLD           MMM
     C                     KFLD           DDD
     C                     KFLD           HOUR
     C                     KFLD           MINUTE
     C                     KFLD           SECOND
     C           XXXKEY    SETLLAI#PL021
     C*
     C*
     C                     MOVEA'0'       *IN,50
B001 C                     DO   *HIVAL
     C                     READ AI#PL021                 50
     C   50                GOTO STP1
     C                     ADD  1         I
     C           I         ADD  20        J       50
     C                     MOVEA'1'       *IN,J
     C                     Z-ADDHIZKE     HIZ,I
     C                     Z-ADDJIKOK     JIK,I
     C                     Z-ADDDABUCD    BMN,I
     C                     Z-ADDDAJBNO    JOB,I
     C                     MOVE DAERCD    ERR,I
     C                     MOVE DARETN    TER,I
B002 C           RECKBN    IFEQ 'HD'
     C           RECKBN    OREQ 'RQ'
     C           RECKBN    OREQ 'AT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE RQGRP     DTA,I
     C                     MOVE RQSAI     SAI,I
     C                     MOVE RQMSG     GSM,I
     C                     MOVE RQBLK     BLK,I
     C                     MOVE RQKAN     KAT,I
E002 C                     END
B002 C           RECKBN    IFEQ 'BK'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE BKBLK     BLK,I
     C                     MOVE BKKAN     KAT,I
E002 C                     END
B002 C           RECKBN    IFEQ 'DT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE DTSYU     DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E002 C                     END
B002 C           RECKBN    IFEQ 'EE'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E002 C                     END
     C           I         CABGE16        STP1
E001 C                     END
     C*
     C*   fﾞx] 1 ﾉ ﾈｮn
     C*
     C           STP1      TAG
     C                     EXFMTAIAPW111
     C                     MOVEL*BLANK    ERRMSG
     C                     MOVEA'00000'   *IN,01
     C                     SETOF                     99
     C*
     C*  CMD:1
     C*
     C   KA                SETON                     LR
     C   KA                RETRN
     C*
     C*  ﾜｰﾓaｮﾎﾟ.ﾜｰﾓjﾞc]
     C*
     C   81                GOTO STP81
     C   82                GOTO STP82
B001 C           CODE      IFEQ 0
     C           DATE      ANDEQ0
     C           TIME      CABEQ0         STP81
E001 C                     END
     C*
     C*  fﾞx] 1 ﾉ kｩｮh
     C*
B001 C           CODE      IFNE 0
B002 C           CODE      IFGT 16
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERRMSG
     C                     GOTO STP1
E002 C                     END
     C                     Z-ADDCODE      J
B002 C           HIZ,J     IFEQ 0
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERRMSG
     C                     GOTO STP1
E002 C                     END
     C                     GOTO STP2
     C*
X001 C                     ELSE
     C*
B002 C           DATE      IFEQ 0
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERRMSG
     C                     GOTO STP1
E002 C                     END
B002 C           DATEYY    IFLT 86
     C           DATEMM    ORLT 01
     C           DATEMM    ORGT 12
     C           DATEDD    ORLT 01
     C           DATEDD    ORGT 31
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     ERRMSG
     C                     GOTO STP1
E002 C                     END
B002 C           TIME      IFEQ 0
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     ERRMSG
     C                     GOTO STP1
E002 C                     END
B002 C           TIMEHH    IFLT 00
     C           TIMEHH    ORGT 24
     C           TIMEMM    ORLT 00
     C           TIMEMM    ORGT 60
     C           TIMESS    ORLT 00
     C           TIMESS    ORGT 60
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,5     ERRMSG
     C                     GOTO STP1
E002 C                     END
     C                     GOTO STP90
E001 C                     END
     C*
     C*  ﾜｰﾓ aｮﾎﾟ
     C*
     C           STP81     TAG
B001 C           HIZ,16    IFEQ 0
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     MOVEA'0'       *IN,82
     C                     GOTO STP1
E001 C                     END
     C*
     C*
     C                     SETOF                     11
B001 C                     DO   *HIVAL
     C                     READ AI#PL021                 50
B002 C           *IN,50    IFEQ '0'
B003 C           *IN,11    IFEQ '0'
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     MOVEA'00000'   *IN,31
     C                     MOVEA'00000'   *IN,36
     C                     Z-ADD0         I
     C                     Z-ADD0         HIZ
     C                     Z-ADD0         JIK
     C                     Z-ADD0         BMN
     C                     Z-ADD0         JOB
     C                     MOVE *BLANK    ERR
     C                     MOVE *BLANK    TER
     C                     MOVE *BLANK    R#
     C                     MOVE *BLANK    DTA
     C                     MOVE *BLANK    SAI
     C                     MOVE *BLANK    GSM
     C                     MOVE *BLANK    BLK
     C                     MOVE *BLANK    KAT
     C                     MOVEA'1'       *IN,11
E003 C                     END
     C                     ADD  1         I
     C           I         ADD  20        J
     C                     MOVEA'1'       *IN,J
     C                     Z-ADDHIZKE     HIZ,I
     C                     Z-ADDJIKOK     JIK,I
     C                     Z-ADDDABUCD    BMN,I
     C                     Z-ADDDAJBNO    JOB,I
     C                     MOVE DAERCD    ERR,I
     C                     MOVE DARETN    TER,I
B003 C           RECKBN    IFEQ 'HD'
     C           RECKBN    OREQ 'RQ'
     C           RECKBN    OREQ 'AT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE RQGRP     DTA,I
     C                     MOVE RQSAI     SAI,I
     C                     MOVE RQMSG     GSM,I
     C                     MOVE RQBLK     BLK,I
     C                     MOVE RQKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'BK'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE BKBLK     BLK,I
     C                     MOVE BKKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'DT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE DTSYU     DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'EE'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
     C           I         CABGE16        STP81E
E002 C                     END
E001 C  N50                END
     C*
     C*
     C           STP81E    TAG
     C                     Z-ADD0         CODE
     C                     Z-ADD0         DATE
     C                     Z-ADD0         TIME
     C  N11                GOTO STP3
     C                     GOTO STP1
     C*
     C*  ﾜｰﾓ jﾞc]
     C*
     C           STP82     TAG
     C*
     C*
     C   50      *HIVAL    SETLLAI#PL021
     C           I         ADD  17        K       50
B001 C                     DO   K
     C                     READPAI#PL021                 50
E001 C  N50                END
     C*
     C*
     C   50      *LOVAL    SETLLAI#PL021
     C*
     C*
     C                     SETOF                     11
B001 C                     DO   *HIVAL
     C                     READ AI#PL021                 50
B002 C           *IN,50    IFEQ '0'
B003 C           *IN,11    IFEQ '0'
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     MOVEA'00000'   *IN,31
     C                     MOVEA'00000'   *IN,36
     C                     Z-ADD0         I
     C                     Z-ADD0         HIZ
     C                     Z-ADD0         JIK
     C                     Z-ADD0         BMN
     C                     Z-ADD0         JOB
     C                     MOVE *BLANK    ERR
     C                     MOVE *BLANK    TER
     C                     MOVE *BLANK    R#
     C                     MOVE *BLANK    DTA
     C                     MOVE *BLANK    SAI
     C                     MOVE *BLANK    GSM
     C                     MOVE *BLANK    BLK
     C                     MOVE *BLANK    KAT
     C                     MOVEA'1'       *IN,11
E003 C                     END
     C                     ADD  1         I
     C           I         ADD  20        J
     C                     MOVEA'1'       *IN,J
     C                     Z-ADDHIZKE     HIZ,I
     C                     Z-ADDJIKOK     JIK,I
     C                     Z-ADDDABUCD    BMN,I
     C                     Z-ADDDAJBNO    JOB,I
     C                     MOVE DAERCD    ERR,I
     C                     MOVE DARETN    TER,I
B003 C           RECKBN    IFEQ 'HD'
     C           RECKBN    OREQ 'RQ'
     C           RECKBN    OREQ 'AT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE RQGRP     DTA,I
     C                     MOVE RQSAI     SAI,I
     C                     MOVE RQMSG     GSM,I
     C                     MOVE RQBLK     BLK,I
     C                     MOVE RQKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'BK'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE BKBLK     BLK,I
     C                     MOVE BKKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'DT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE DTSYU     DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'EE'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
     C           I         CABGE16        STP82E
E002 C                     END
E001 C  N50                END
     C*
     C*
     C           STP82E    TAG
     C                     Z-ADD0         CODE
     C                     Z-ADD0         DATE
     C                     Z-ADD0         TIME
     C  N11                GOTO STP4
     C                     GOTO STP1
     C*
     C*   ﾆｭcfb ﾍlﾞi & ﾆﾞf] mﾞ ﾅb ﾈｮn
     C*
     C           STP90     TAG
     C           YYYKEY    KLIST
     C                     KFLD           DATEY1
     C                     KFLD           DATEMM
     C                     KFLD           DATEDD
     C                     KFLD           TIMEHH
     C                     KFLD           TIMEMM
     C                     KFLD           TIMESS
     C           YYYKEY    SETLLAI#PL021
     C*
     C*
     C                     SETOF                     11
B001 C                     DO   *HIVAL
     C                     READ AI#PL021                 50
B002 C           *IN,50    IFEQ '0'
B003 C           *IN,11    IFEQ '0'
     C                     MOVEA'00000'   *IN,21
     C                     MOVEA'00000'   *IN,26
     C                     MOVEA'00000'   *IN,31
     C                     MOVEA'00000'   *IN,36
     C                     Z-ADD0         I
     C                     Z-ADD0         HIZ
     C                     Z-ADD0         JIK
     C                     Z-ADD0         BMN
     C                     Z-ADD0         JOB
     C                     MOVE *BLANK    ERR
     C                     MOVE *BLANK    TER
     C                     MOVE *BLANK    R#
     C                     MOVE *BLANK    DTA
     C                     MOVE *BLANK    SAI
     C                     MOVE *BLANK    GSM
     C                     MOVE *BLANK    BLK
     C                     MOVE *BLANK    KAT
     C                     MOVEA'1'       *IN,11
E003 C                     END
     C                     ADD  1         I
     C           I         ADD  20        J
     C                     MOVEA'1'       *IN,J
     C                     Z-ADDHIZKE     HIZ,I
     C                     Z-ADDJIKOK     JIK,I
     C                     Z-ADDDABUCD    BMN,I
     C                     Z-ADDDAJBNO    JOB,I
     C                     MOVE DAERCD    ERR,I
     C                     MOVE DARETN    TER,I
B003 C           RECKBN    IFEQ 'HD'
     C           RECKBN    OREQ 'RQ'
     C           RECKBN    OREQ 'AT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE RQGRP     DTA,I
     C                     MOVE RQSAI     SAI,I
     C                     MOVE RQMSG     GSM,I
     C                     MOVE RQBLK     BLK,I
     C                     MOVE RQKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'BK'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE BKBLK     BLK,I
     C                     MOVE BKKAN     KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'DT'
     C                     MOVE RECKBN    R#,I
     C                     MOVE DTSYU     DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
B003 C           RECKBN    IFEQ 'EE'
     C                     MOVE RECKBN    R#,I
     C                     MOVE *BLANK    DTA,I
     C                     MOVE *BLANK    SAI,I
     C                     MOVE *BLANK    GSM,I
     C                     MOVE *BLANK    BLK,I
     C                     MOVE *BLANK    KAT,I
E003 C                     END
     C           I         CABGE16        STP90E
E002 C                     END
E001 C  N50                END
     C*
     C*
     C           STP90E    TAG
B001 C           *IN,11    IFEQ '0'
     C                     MOVEA'11'      *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,7     ERRMSG
X001 C                     ELSE
     C                     Z-ADD0         CODE
     C                     Z-ADD0         DATE
     C                     Z-ADD0         TIME
E001 C                     END
     C                     GOTO STP1
     C*
     C*   fﾞx] 2 ﾉ ﾈｮn
     C*
     C           STP2      TAG
     C                     Z-ADD0         HIZKE
     C                     Z-ADD0         JIKOK
     C                     Z-ADDCODE      I
     C                     Z-ADDHIZ,I     HIZKE
     C                     Z-ADDJIK,I     JIKOK
     C                     Z-ADD0         CODE
     C                     Z-ADD0         DATE
     C                     Z-ADD0         TIME
     C                     MOVEA'0'       *IN,90
     C                     MOVEA'0'       *IN,20
     C           APLKEY    KLIST
     C                     KFLD           DATUYY
     C                     KFLD           DATUMM
     C                     KFLD           DATUDD
     C                     KFLD           DATUHH
     C                     KFLD           DATUFF
     C                     KFLD           DATUSS
     C           APLKEY    SETLLAI#PL021
B001 C                     DO   *HIVAL
     C           APLKEY    READEAI#PL021                 20
B002 C           *IN,20    IFEQ '0'
B003 C           R#,I      IFEQ RECKBN
     C                     MOVEA'1'       *IN,20
     C                     MOVEA'1'       *IN,90
     C           DABUCD    CHAINFGBPL011             10
     C   10                MOVE *BLANK    B2SMEI
B004 C           RECKBN    IFEQ 'HD'
     C           RECKBN    OREQ 'RQ'
     C           RECKBN    OREQ 'AT'
     C                     MOVE RECKBN    R#CD
     C                     MOVE RQGRP     DTACD
     C                     MOVEL*BLANK    SYUNM
     C           DTSYU     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      SYUNM
     C                     MOVEL*BLANK    MSGNM
     C           DAERCD    LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      MSGNM
     C                     MOVEL*BLANK    RTNNM
     C           DARETN    LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      RTNNM
     C                     MOVE DATA01    NAI01
     C                     MOVE DATA02    NAI02
     C                     MOVE DATA03    NAI03
E004 C                     END
B004 C           RECKBN    IFEQ 'BK'
     C                     MOVE RECKBN    R#CD
     C                     MOVE RQGRP     DTACD
     C                     MOVEL*BLANK    SYUNM
     C           DTSYU     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      SYUNM
     C                     MOVEL*BLANK    MSGNM
     C           DAERCD    LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      MSGNM
     C                     MOVEL*BLANK    RTNNM
     C           DARETN    LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      RTNNM
     C                     MOVE DATA01    NAI01
     C                     MOVE DATA02    NAI02
     C                     MOVE DATA03    NAI03
E004 C                     END
B004 C           RECKBN    IFEQ 'DT'
     C                     MOVE RECKBN    R#CD
     C                     MOVE RQGRP     DTACD
     C                     MOVEL*BLANK    SYUNM
     C           DTSYU     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      SYUNM
     C                     MOVEL*BLANK    MSGNM
     C           DAERCD    LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      MSGNM
     C                     MOVEL*BLANK    RTNNM
     C           DARETN    LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      RTNNM
     C                     MOVE DATA01    NAI01
     C                     MOVE DATA02    NAI02
     C                     MOVE DATA03    NAI03
E004 C                     END
B004 C           RECKBN    IFEQ 'EE'
     C                     MOVE RECKBN    R#CD
     C                     MOVE RQGRP     DTACD
     C                     MOVEL*BLANK    SYUNM
     C           DTSYU     LOKUPTAB1      TAB2           10
     C   10                MOVELTAB2      SYUNM
     C                     MOVEL*BLANK    MSGNM
     C           DAERCD    LOKUPTAB3      TAB4           10
     C   10                MOVELTAB4      MSGNM
     C                     MOVEL*BLANK    RTNNM
     C           DARETN    LOKUPTAB5      TAB6           10
     C   10                MOVELTAB6      RTNNM
     C                     MOVE DATA01    NAI01
     C                     MOVE DATA02    NAI02
     C                     MOVE DATA03    NAI03
E004 C                     END
E003 C                     END
E002 C                     END
E001 C  N20                END
     C*
     C*
B001 C           *IN,90    IFEQ '0'
     C                     MOVELMSG,8     ERRMSG
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
E001 C                     END
     C*
     C*
     C                     EXFMTAIAPW112
     C                     GOTO STP1
     C*
     C*
     C           STP3      TAG
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C*
     C*
     C           STP4      TAG
     C                     MOVELMSG,6     ERRMSG
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C*
     C*
**  TAB1 / TAB2 (DATA CLASSIFICATION CODE )
TNTUNNEL KANBAN M/F
HTPICK-UP KANBAN M/F
MKPLATING KANBAN M/F
KNCMPLET PART K M/F
BMSECTION NAME M/F
JKCONDITION M/F
KSKANBAN KIND M/F
SCPROD INST DATA
YIQUENCHING K DATA
KTINTRA-PROC K DATA
GTLIMIT KANBAN DATA
ZMDRAWING M/F
**  TAB3 / TAB4 ( DEMAND MESSAGE )
00NORMALITY
01THERE IS NO DATA IN DATA TRANSMISSION CONTROL FILE(FOR M/F)
02THERE IS NO DATA IN CALCULATION BIN M/F BY TIME(FOR PROD INST DATA)
03AS FOR DATA GROUP OF TRANSMISSION RECORD, 'OA.AA' IS REQUIRED
04NOW LINE OCCUPIED
05BECAUSE PROD INST DATA FOR TODAY WERE CMPLETED ENTIRELY,REQ IS VOIDED
06PROD INST DATA GO WITH BEING EARLY THAN RULE TIME BY RULE
07COUNT TRANSMITTED TO TOSHIBA  IS WRONG
08AS FOR PROD INST DATA, HNDLING IS LATE.NEXT DATA IS PREPARED COMPLETLY
09PROD INST DATA IS LATER THAN RULE TIME, BUT DATA PREPARES
10PROD INST DATA PREPARES NOW
11PROD INST DATA IS EARLIER THAN RULE TIME, BUT DATA PREPARES
12PROD INST DATA IS LATER THAN RULE TIME, BUT DATA ISN'T PREPARED
13EVEN IF PROD INST DATA BECOMES RULE TIME, DATA ISN'T PREPARED
14PROD INST DATA ISN'T PREPARED WITH BEING EARLY THAN RULE TIME
15RE-RUN PROD INST DATA, BUT DATE OF DELIVERY IS WRONG
16RE-RUN PROD INSTRUCTION DATA, BUT BIN OF DATE OF DELIVERY IS WRONG
17RE-RUN PROD INST DATA, BUT THERE ISN'T DATA OF THE DAY BEFORE
18RE-RUN PROD INST DATA, BUT DATA IS TRANSMITTED WITH NEXT BIN
19BECAUSE M/F DATA OF TODAY WERE COMPLETED ENTIRELY, REQUEST IS VOIDED
20M/F DATA PREPARES DATA NOW
21M/F DATA ISN'T PREPARED
22THERE ISN'T M/F DATA FOR TODAY
23THERE IS NO DATA  TRANSMITTED
24AS FOR INST OF TRANSMISSION  RECORD, 'RQ.AT' IS REQUIRED
25FACTORY CODE OF TRANSMISSION RECORD IS WRONG
26THERE IS NOT RECORD CLASSIFICATION OF LOCAL DTAARA WITH 'AT.EE'
27RECORD CLASSIFICATION OF LOCAL DTAARA IS 'AT'
28DIFFERENT FROM TRANSMISSION FACTORY CODE OF LDA AND FACTORY CODE OF
29THERE IS NOT RECORD CLASSIFICATION OF LDA WITH 'EE'
30BECAUSE AT RECORD DOESN'T COME RULE TIME BY RQ RECORD,RECEPT RQ RECORD
31RE-RUN PROD INST DATA, BUT THERE IS NOT DATA OF BIN APPOINTED
32THERE IS NO DATA TRANSMITTED( THERE IS NO FILE)
**  TAB5 / TAB6 (RETURN CODE MESSAGE )
0000EXCEPTION/ERROR NO EXIST
0002DISPLAY WAS BROKEN OFF BY USE OF  ORDER KEY
0011THE END OF FILE BY READ
0012IT IS NO RECORD BY CHAIN ORDER
0013THERE IS FULL OF SUBFILE
1011RECORD TYPE ISN'T DEFINED(INPUT RECORD AND RECORD DEFINE AREN'T MATCHED)
1021IT WILL BE WRITTEN ALREADY EXISTING RECORD
1031ORDER ERROR OF COMPARE WITH FIELD
1041IT IS ORDER ERROR WITH LOADING DISPOSISION / TABLE
1051DISPOSISION / TABLE. THE ITEM WHICH IS A SURPLUS IN A FILE
1052BEING CLEAR TABLE BEFORE DOING DUMP OF DATA WHICH WASN'T DONE NORMALY
1071ORDER ERROR OF NUMBER
1122THERE IS NOT A MARK ABOUT ROLL UP KEY IN DDS KEY WORD
1123THERE IS NOT A MARK ABOUT ROLL DOWN KEY IN DDS KEY WORD
1124THERE IS NOT A MARK ABOUT CLEAR KEY IN DDS KEY WORD
1125THERE IS NOT A MARK ABOUT HELP KEY IN DDS KEY WORD
1126THERE IS NOT A MARK ABOUT HOME KEY IN DDS KEY WORD
1211INPUT AND OUTPUT OPERATION FOR  FILE CLOSED
1215OPEN WAS REQUIRED FOR FILE OPENED ALREADY
1216IT IS ERROR BY TACIT OPEN / CLOSING OPERATION
1218CAN'T ASSIGN RECORD
1221BEING UPDATE WITHOUT READ
1231IT IS ERROR WITH SPECIAL FILE
1235IT IS ERROR IN SPACE OR SKIP OF PRTCTL
1241NO EXISTENCE OF RECORD NUMBER
126EXCEED MAXIMUM NUMBER OF DEVICE ACQUIRED
1271BEING ACQUIRED IMPOSSIBLE TO USE DEVICE
1281AN ORDER FOR DEVICE WHICH ISN'T ACQUIRED
1282JOB EXIT BY OUT OF CONTROL OPTION
1285BEING ACQUIRED DEVICE ACQUIRED ALREADY
1286BEING OPEN COMMON USE FILE BY SAVDS OR IND OPTION
1287REPLY MARK AND IND MARK ARE OVERLAPPING GRIP
1299INPUT AND OUTPUT ERROR  WAS DETECTED
1331EXCEEDED WAITING TIME BY READ ORDER FROM WORKSTN FILE
0001PGM CALLED TURNED LR MARK INTO ON
0101A SQUARE ROOT OF MINUS NUMBER
0102DIVISION BY  ZERO
0121AN INDEX OF DISPOSITION IS WRONG
0122OCUR IS OUT OF RANGE
0202PGM CALLED WASN'T DONE BY NORMALY
0211PGM APPOINTED WITH CALL OR FREE ISN'T FOUND
0221BEING USE THE PARM WHICH  PGM CALLED WASN'T CARRIED TO
023 PGM CALLED TURNED STANDSTILL MARK INTO  ON AND CAME BACK
0232STANDSTILL MARK BECAME ON WITH THIS PGM
0233STANDSTILL MARK BECAME ON WHEN EXECUTED RETRN ORDER
0299A DUMP STYLIZED OF RPG WASN'T DONE BY NORMALY
0333IT IS ERROR BY DSPLY ORDER
0401DATA AREA APPOINTED WITH IN/OUT ISN'T FOUND
0411TYPE OF DATA AREA OR LENGTH DOESN'T AGREE
0412DATA AREA IS LOCKED FOR OUTPUT
0413IT IS ERROR BY IN/OUT ORDER
0414USER ISN'T ADMITTED USE OF DATA AREA
0415USER ISN'T ADMITTED A CHANGE OF DATA AREA
0421IT IS ERROR BY UNLCK ORDER
0431DATA AREA IS LOCKED EARLIER ON  OTHER PGM
0432DATA AREA IS LOCKED WITH EQUAL HANDLING BY PGM
0907DECIMAL DATA. ERROR(NUMBER OR MARK IS NOT RIGHT)
0970LVL NBR OF COMPILER DOESN'T AGREE WITH LVL NBR OF SBRTN IN RPG EXECUTE
9998RPG3 COMPILER OR IT IS INSIDE OBSTACLE OF A SUBROUTINE IN EXECUTE
9999IT IS PGM EXCEPTION BY CPF ROUTINE
0000PGM CONTROLS A SESSION **** REPETITION ****
0001REMOTE PGM CONTROLS A SESSION **** REPETITION ****
0002TRANSACTION EXIT(COMPETITON STATE) **** REPETITION ****
0004SEND INFORMATION REQUEST REFUSAL
0300PGM CONTROLS A SESSION
0301REMOTE PGM CONTROLS A SESSION
0302TRANSACTION EXIT(COMPETITION STATE)
0304TRANSACTION EXIT
0400IT IS DATA EXIST TO INPUT BUFFER
0401DATA REFUSAL BY REMOTE PGM
0402CONTRADICTION OF UNJUST RECORD NAME OR INPUT & OUTPUT DEVICE FILE
0403UNJUST USER DATA
0404SEND INFORMATION REQUEST IS REFUSED
0405A RECEIPT OF WRONG DIRECTION CONVERSION REQUEST
3400DATA CUT  OFF IN INPUT AREA
3401A CANCELLATION OF DATA BY REMOTE PGM
3402UNJUST RECORD NAME
3403A RECEIPT OF FILE EXIT
8000UNJUST INPUT & OUTPUT DEVICE FILE DEFINITION
8001AN OBSTACLE OF INPUT AND OUTPUT DEVICE
8002SYSTEM ERROR
8003AN OBSTACLE OF TERMINAL
8004AN OBSTACLE OF LINES
8100NOTICE EXCEPTION OF NON HANDLING
8101PERMANENT SESSION. ERROR
8300FALLING OFF COMMUNICATIONS APPARATUS OF DATA IN OUTPUT
8301RECEIPT / CREATION COMMUNICATIONS APPARATUS OF EXCEPTIONAL REQUEST
8302WRONG DIRECTION CONVERSION REQUEST
**  MSG (ERROR MESSAGE )
E-01 DETAILS DISPLAY CODE IS WRONG
E-02 INPUT INQUIRY DATE
E-03 INQUIRY DATE IS WRONG
E-04 INPUT INQUIRY TIME
E-05 INQUIRY TIME IS WRONG
E-06 OVER THE FIRST OR THE LAST RECORD IN ROL-UP/DOWN
E-07 THERE IS NOT DATA AFTER INQUIRY DATE TIME
E-08 THERE IS NOT APPLICABLE DATA
