     H            Y.
     F** AIAR06 *************************
     F* M/F DATA SEND
     F* H.ITO              86.10.13     *
     F************************* AIAR06 **
     FAIA0111 IF  F     256            DISK
     FOUTPUT1 O   F     256            DISK                      A
     IAIA0111 AA  01
     I                                        1 256 KDATA
     I            DS
     I                                        1  30 HDATA
     I                                        1   2 HRECD
     I                                        3   60HNKOJ
     I                                        7   8 HGRUP
     I                                        9   9 HKUBN
     I                                       10  11 HMESG
     I                                       18  250HNOHZ
     I                                       18  210HNOYY
     I                                       22  230HNOMM
     I                                       24  250HNODD
     I            DS
     I                                        1  30 EDATA
     I                                        1   2 ERECD
     I                                        3   60EKENS
     I            DS
     I                                        1 256 KDATA
     I                                        3   6 KKENS
      *
     C           *ENTRY    PLIST
     C                     PARM           PKBN    1
      *
     C*---------------*
     C*   ＩＡＦ    *
     C*---------------*
     C                     SETOF                     16
     C                     Z-ADD0         EKENS
      *
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     READ AIA0111                  15
     C           *IN15     IFEQ '1'
     C           *IN16     IFEQ '1'
     C                     MOVE *BLANK    WDATA
     C                     MOVE 'EE'      ERECD
     C                     MOVELEDATA     WDATA  30
     C                     EXSR SUBRTN
     C                     EXCPTEE1
     C                     END
     C                     GOTO STP1
     C                     ELSE
      *
     C           *IN16     IFEQ '0'
     C                     SETON                     16
     C                     MOVE 'HD'      HRECD
     C                     Z-ADD0111      HNKOJ
     C                     MOVE '0A'      HGRUP
     C                     MOVE PKBN      HKUBN
     C                     MOVE '00'      HMESG
     C                     Z-ADD*DATE     HNOHZ
     C                     MOVELHDATA     WDATA
     C                     EXSR SUBRTN
     C                     EXCPTHD1
     C                     END
     C                     END
      *
     C                     ADD  1         EKENS
     C                     MOVE EKENS     KKENS
     C                     MOVELKKENS     WDATA
     C                     EXSR SUBRTN
     C                     MOVELWDATA     KKENS
     C                     EXCPTDT1
     C                     END
     C           STP1      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C*----------------------*
     C*   EBCDIC ---> ASCII  *
     C*----------------------*
     C           SUBRTN    BEGSR
     C                     CALL 'AZZR11'
     C                     PARM           WDATA
     C                     ENDSR
      *
     OOUTPUT1 EADD             HD1
     O                         WDATA     30
     O        EADD             DT1
     O                         KDATA    256
     O        EADD             EE1
     O                         WDATA     30
