     H            Y.
     F** AIAR53 **************************************
     F* ..通信ＰＣ　送受信コントロールプログラム.. *
     F*      I-HASADA                  89.07.03      *
     F*      A-INOUE                 2004.08.09      *
     F**************************** COPY FROM AIAR02 **
     FINPUT   IF  F     256            DISK                           UC
     FAZZPPDF UF  E           K        DISK                      A
     FAIAPP60 O   E                    DISK                      A
     FOUTPUT  O   F     256            DISK
     IINPUT   AA  90
     I                                        1 256 IDATA
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1   50UJOBN
     I                                        6   7 URECD
     I                                        8  110UBMON
     I                                       12  13 UGRUP
     I                                       14  190UTIME
     I                                       20  270UNOHZ
     I                                       28  290UNBIN
     I                                       30  30 UKUBN
     I                                       31  40 UFILE
     I                                       41  42 UMESG
     I                                       43  45 UBLKA
     I                                       43  44 UBLOK
     I                                       45  45 UKANB
     I                                       46  47 U0111
     I                                       48  49 U8974
     I                                       50  51 U8982
     I                                       52  53 U9032
     I                                       54  55 U8907
     I                                       56  57 U9431
     I                                       58  59 U9024
     I                                        1 116 UALL
     I            DS
     I                                        1 256 ADATA
     I                                        1   2 ARECD
     I                                        3   60ABMON
     I                                        7   8 AGRUP
     I                                        9   9 AKUBN
     I                                       10  11 AMESG
     I                                       18  250ANOHZ
     I                                       26  270ANBIN
     I                                       28  29 ABLOK
     I                                       30  30 AKANB
     I                                       28  30 ABLKA
     I                                       31  50 AKFLG
     I                                       31  34 ALOCA
     I                                       35  36 APCSY
     I                                       37  44 ACRHZ
     I                                       45  50 ACRTM
     I            DS
     I                                        1 256 IDATA
     I                                        1   2 IRECD
     I                                        3   6 IREBN
     I                                        9   9 IKUBN
     I                                       10  10 IMES1
     I                                       11  11 IMES2
     I                                       28  30 IBLKA
     I                                       31  50 IKFLG
     I                                        3   5 IBLKB
     I            DS
     I                                        1   3 WBLKB
     I                                        1   2 WBLOK
     I                                        3   3 WKANB
     I            DS
     I                                        1 256 WDATA
     I                                        1   2 WRECD
     I                                        3   60WKENS
     I            DS
     I                                        1   60D6TIME
     I                                        1   20D6TUHH
     I                                        3   40D6TUFF
     I                                        5   60D6TUSS
     I            DS
     I                                        1   80D6TUHZ
     I                                        1   40D6TUYY
     I                                        5   60D6TUMM
     I                                        7   80D6TUDD
     I            DS
     I                                        1   80D6KOHZ
     I                                        1   40D6KOYY
     I                                        5   60D6KOMM
     I                                        7   80D6KODD
     I            DS
     I                                        1   60D6KOTM
     I                                        1   20D6KOHH
     I                                        3   40D6KOSS
     I            DS
     I                                        1   60ZZTIME
     I                                        1   20ZZHORS
     I                                        3   40ZZMINS
     I                                        5   60ZZSECS
     I            DS
     I                                        1  140LDATE
     I                                        1   60LTIME
     I                                        7  140LDAY
      *
     C           *ENTRY    PLIST
     C                     PARM           PSTS    1
     C                     PARM           PLOCAT  4        ﾜiｰﾆｭ]
     C                     PARM           PSYSTM  2        ﾆﾇmwhﾎﾞ]
     C                     PARM           PKFLG  20        ﾆｰi]ﾇﾃｰnﾞ
     C                     PARM           PFILE  10        ﾎｦbﾓxb
     C                     PARM           PSFLG   1        cﾎ cw
     C                     PARM           PUALL 116        ﾌﾟ[xｰj
     C                     MOVE PUALL     UALL
      *
     C                     Z-ADD0         WKENS
     C           UGRUP     IFEQ '0A'
     C                     SETON                     04
     C                     MOVEL'AIANP04' WFILE  10
     C           CTP1      TAG
     C                     SETOF                     03
     C           WFILE     CHAINAZZPPDF1             03
     C           *IN03     IFEQ '1'
     C                     MOVE WFILE     ZZFILE
     C                     Z-ADD0         ZZTIME
     C                     WRITEAZZPPDF1
     C                     GOTO CTP1
     C                     END
     C                     END
      *
     C*-----------------------------------------------------------*
     C*  ＲＱレコード                                           *
     C*  ブロック№・かんばん種類（大）に　指定されている場合   *
     C*  データをチェック                                       *
     C*-----------------------------------------------------------*
     C           UGRUP     IFNE '0A'
     C           UBLOK     IFNE *BLANK
     C                     OPEN INPUT
     C                     DO   *HIVAL
     C                     SETOF                     03
     C                     READ INPUT                    03
     C           *IN03     IFEQ '1'
     C                     EXSR SHD
      *
     C*--------------------------------------*
     C*           （ＨＤの場合）           *
     C*  通信装置ファイル　ヘ　ＷＲＩＴＥ  *
     C*--------------------------------------*
     C                     EXCPTDAT
     C                     MOVE UALL      PUALL
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     MOVELIRECD     WAE
     C                     EXSR SUBAE
     C                     MOVELWAE       WRECD
     C           WRECD     IFEQ 'BK'
     C                     MOVELIBLKB     WAE
     C                     EXSR SUBAE
     C                     MOVELWAE       WBLKB
     C           UBLOK     IFEQ WBLOK
     C           UKANB     ANDEQWKANB
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
     C           STP1      TAG
     C                     CLOSEINPUT
     C                     END
     C                     END
      *
     C*-----------------------------------------------------------*
     C*  全データをチェックして　通信パソコンに送信   *
     C*-----------------------------------------------------------*
     C                     OPEN INPUT
     C                     DO   *HIVAL
     C                     SETOF                     03
     C                     READ INPUT                    03
      *
     C*--------------------------*
     C*  ファイルは、終りか？  *
     C*--------------------------*
     C           *IN03     IFEQ '1'
     C                     CLOSEINPUT
     C*----------------------------*
     C*  データ件数は、０件か？  *
     C*----------------------------*
     C           WKENS     IFEQ 0
     C                     EXSR SHD
      *
     C*--------------------------------------*
     C*           （ＨＤの場合）           *
     C*  通信装置ファイル　ヘ　ＷＲＩＴＥ  *
     C*--------------------------------------*
     C                     EXCPTDAT
     C                     END
     C                     MOVE UALL      PUALL
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     MOVELIRECD     WAE    50
     C                     EXSR SUBAE
     C                     MOVELWAE       WRECD
     C           WRECD     IFNE CRECD
     C                     MOVE WRECD     CRECD   2
     C                     EXSR SRE
     C                     END
      *
     C*------------------------------*
     C*  レコード種別は、ＥＥか？  *
     C*------------------------------*
     C           WRECD     IFEQ 'EE'
     C*-----------------------------------------*
     C*           （ＥＥの場合）              *
     C*  ＪＯＢＬＯＧファイル　へ　ＷＲＩＴＥ *
     C*       エラーコード　＝　＇００＇      *
     C*-----------------------------------------*
     C                     MOVE '1'       *IN01
     C                     MOVELWKENS     WEA
     C                     EXSR SUBEA
     C                     MOVELWEA       IREBN
     C                     MOVE IDATA     SDATA 256
     C                     MOVE WRECD     URECD
     C                     TIME           UTIME
     C                     MOVE WDATA     D6DATA
     C                     MOVE UBMON     D6BUCD
     C                     MOVE '00'      D6ERCD
     C                     EXSR SUBJOB
      *
     C*--------------------------------------*
     C*         （ＥＥの場合）             *
     C*  通信装置ファイル　ヘ　ＷＲＩＴＥ  *
     C*--------------------------------------*
     C                     EXCPTDAT
     C                     CLOSEINPUT
     C           UGRUP     IFEQ '0A'
     C                     MOVEL'AIAR53'  ZZPROG
     C                     TIME           ZZTIME
     C                     UPDATAZZPPDF1
     C                     END
     C                     MOVE UALL      PUALL
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*-------------------------------------------*
     C*  ローカルデータエリアの変更             *
     C*   レコード種別　　＝　ＨＤ・ＢＫ・ＤＴ  *
     C*-------------------------------------------*
     C                     MOVE WRECD     URECD
     C                     TIME           UTIME
     C*------------------------------------*
     C*  レコード種別は、ＢＫ・ＤＴか？  *
     C*------------------------------------*
     C           WRECD     IFNE 'HD'
     C           WRECD     IFEQ 'BK'
     C*--------------------------*
     C*  レコード種別は、ＢＫ  *
     C*--------------------------*
     C                     SETOF                     04
     C           UBLOK     IFEQ *BLANK
     C                     SETON                     04
     C                     ELSE
     C                     MOVELIBLKB     WAE
     C                     EXSR SUBAE
     C                     MOVELWAE       WBLKB
     C           UBLOK     IFEQ WBLOK
     C           UKANB     ANDEQWKANB
     C                     SETON                     04
     C                     ELSE
     C                     GOTO END
     C                     END
     C                     END
     C                     Z-ADD0         WREBN   40
     C                     ELSE
      *
     C*--------------------------*
     C*  レコード種別は、ＤＴ  *
     C*--------------------------*
     C           *IN04     IFEQ '0'
     C                     GOTO END
     C                     END
     C                     ADD  1         WREBN   40
     C                     MOVELWREBN     WEA
     C                     EXSR SUBEA
     C                     MOVELWEA       IREBN
     C                     END
     C                     ADD  1         WKENS
     C                     MOVE IDATA     SDATA
      *
     C*--------------------------------------*
     C*          （ＢＫ・ＤＴの時）        *
     C*  通信装置ファイル　ヘ　ＷＲＩＴＥ  *
     C*--------------------------------------*
     C                     EXCPTDAT
     C                     ELSE
      *
     C*-----------------------------------------*
     C*              （ＨＤの時）             *
     C*  ＪＯＢＬＯＧファイル　へ　ＷＲＩＴＥ *
     C*       エラーコード　＝　＇００＇      *
     C*-----------------------------------------*
     C           UMESG     IFNE '00'
     C                     BITOF'01234567'IMES1
     C                     BITON'23'      IMES1
     C                     BITOF'01234567'IMES2
     C                     BITON'234'     IMES2
     C                     END
     C                     MOVELUKUBN     WEA
     C                     EXSR SUBEA
     C                     MOVELWEA       IKUBN
     C                     MOVELUBLKA     WEA
     C                     EXSR SUBEA
     C                     MOVELWEA       IBLKA
     C                     MOVELPKFLG     WEA
     C                     EXSR SUBEA
     C                     MOVELWEA       IKFLG
     C                     MOVE IDATA     SDATA
     C                     MOVELIDATA     WAE
     C                     EXSR SUBAE
     C                     MOVE *BLANK    D6DATA
     C                     MOVELWAE       WAEH   50
     C                     MOVELWAEH      D6DATA
     C                     MOVE UBMON     D6BUCD
     C                     TIME           D6TIME
     C                     MOVE '00'      D6ERCD
     C                     EXSR SUBJOB
      *
     C*--------------------------------------*
     C*              （ＨＤの時）          *
     C*  通信装置ファイル　ヘ　ＷＲＩＴＥ  *
     C*--------------------------------------*
     C                     EXCPTDAT
     C                     END
     C           END       TAG
     C                     END
      *
     C*---------------------------------------*
     C*  サブルーチン                       *
     C*           （ＨＤの場合）            *
     C*  ＨＤレコード項目のセット           *
     C*     メッセージコード　＝　＇２３＇  *
     C*---------------------------------------*
     C           SHD       BEGSR
     C                     MOVE '1'       *IN01
     C                     MOVE 'HD'      ARECD
     C                     Z-ADDUBMON     ABMON
     C                     MOVE UGRUP     AGRUP
     C                     MOVE UKUBN     AKUBN
     C                     MOVE '23'      AMESG
     C                     Z-ADDUNOHZ     ANOHZ
     C                     Z-ADDUNBIN     ANBIN
     C                     MOVE UBLOK     ABLOK
     C                     MOVE UKANB     AKANB
     C                     MOVE PKFLG     AKFLG
     C                     MOVE *BLANK    SDATA
     C                     MOVELADATA     WEA    50
     C                     EXSR SUBEA
     C                     MOVELWEA       SDATA
      *
     C*---------------------------------*
     C*        （ＨＤの場合）         *
     C*  ローカルデータエリアの変更   *
     C*     レコード種別　　＝　ＡＴ  *
     C*---------------------------------*
     C                     MOVE 'AT'      URECD
     C                     MOVE 'AT'      WRECD
     C                     EXSR SRE
     C                     TIME           UTIME
      *
     C*-----------------------------------------*
     C*           （ＨＤの場合）              *
     C*  ＪＯＢＬＯＧファイル　へ　ＷＲＩＴＥ *
     C*          エラーコード　＝　＇２３＇   *
     C*-----------------------------------------*
     C                     MOVE PKFLG     AKFLG
     C                     MOVE ADATA     D6DATA
     C                     MOVE ABMON     D6BUCD
     C                     MOVE '23'      D6ERCD
     C                     EXSR SUBJOB
     C                     ENDSR
      *
     C*----------------------------------------------------*
     C*  サブルーチン　　ＨＤ・ＢＫ・ＤＴ・ＥＥ          *
     C*  ローカルデータエリア　工場別レコード区分変更    *
     C*----------------------------------------------------*
     C           SRE       BEGSR
     C           UBMON     IFEQ 0111
     C                     MOVE WRECD     U0111
     C                     END
     C                     ENDSR
      *
     C*------------------------------------------------*
     C*   ＥＢＣＤＩＣ　から　ＡＳＣＩＩ　へ　変換   *
     C*------------------------------------------------*
     C           SUBEA     BEGSR
     C                     CALL 'AZZR14'
     C                     PARM           WEA
     C                     ENDSR
      *
     C*------------------------------------------------*
     C*   ＡＳＣＩＩ　から　ＥＢＣＤＩＣ　へ　変換   *
     C*------------------------------------------------*
     C           SUBAE     BEGSR
     C                     CALL 'AZZR15'
     C                     PARM           WAE
     C                     ENDSR
      *
     C*----------------------------------------------------*
     C*  サブルーチン                                    *
     C*  ＪＯＢＬＯＧファイル　ＷＲＩＴＥ (AIAPP60)      *
     C*----------------------------------------------------*
     C           SUBJOB    BEGSR                           *
     C                     TIME           LDATE
     C                     MOVE *BLANK    D6SKJY           *
     C                     Z-ADD0         D6SKYY           *
     C                     Z-ADD0         D6SKMM           *
     C                     Z-ADD0         D6SKDD           *
     C                     Z-ADDLDAY      D6KOHZ           *
     C                     Z-ADDLTIME     D6KOTM           *
     C                     MOVE *BLANK    D6KOME
     C                     MOVELW$WSID    D6KOME
     C                     MOVE *BLANK    D6KOPG
     C                     MOVEL'AIAR53'  D6KOPG
     C                     Z-ADDUJOBN     D6JBNO
     C                     Z-ADDLDAY      D6TUHZ           *
     C                     Z-ADDLTIME     D6TIME           *
     C                     MOVE *BLANK    D6RETN
     C                     MOVE PLOCAT    D6LOCA           *
     C                     MOVE PSYSTM    D6PCCD           *
     C                     MOVE PKFLG     D6SCSY           *
     C                     WRITEAIAPP601                   *
     C                     ENDSR                           *
      *
     OOUTPUT  E                DAT
     O                         SDATA    256
