     H            Y.
     F** AIAR56 **********************************
     F*  ..Ａ－ＰＩＣＳ通信プログラム実行有無  *
     F*       A.MAMIYA          2004.08.29       *
     F********************************** AIAR56 **
     FAGDPL12 IF  E           K        DISK
     I            DS
     I                                        1   80UYMD
     I                                        1   40UYY
     I                                        5   60UMM
     I                                        7   80UDD
     C           *ENTRY    PLIST
     C                     PARM           PCHK    1
      *
     C           KEY01     KLIST
     C                     KFLD           UYY
     C                     KFLD           UMM
     C                     KFLD           UDD
      *
     C                     Z-ADD*DATE     UYMD
     C                     MOVE '0'       PCHK
      *
     C                     SETOF                     01
     C           KEY01     CHAINAGDPL121             01
     C           *IN01     IFEQ '0'
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
     C                     MOVE '1'       PCHK
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
