     H            Y.
     F** AIAR50 **************************************
     F* ..通信ＰＣ　送受信コントロールプログラム.. *
     F*      エラーログ出力                        *
     F*      A-INOUE                 2004.08.09      *
     F**************************** COPY FROM AIAR02 **
     FAIAPP60 O   E                    DISK                      A
     I            DS
     I                                        1   50UJOBN
     I                                        6   7 URECD
     I                                        8  110UBMON
     I                                       12  13 UGRUP
     I                                       14  190UTIME
     I                                       20  270UNOHZ
     I                                       28  290UNBIN
     I                                       30  30 UKUBN
     I                                       31  40 UFILE
     I                                       41  42 UMESG
     I                                       43  45 UBLKA
     I                                       43  44 UBLOK
     I                                       45  45 UKANB
     I                                       46  47 U0111
     I                                       48  49 U8974
     I                                       50  51 U8982
     I                                       52  53 U9032
     I                                       54  55 U8907
     I                                       56  57 U9431
     I                                       58  59 U9024
     I                                        1 116 UALL
     I            DS
     I                                        1 256 ADATA
     I                                        1   2 ARECD
     I                                        3   60ABMON
     I                                        7   8 AGRUP
     I                                        9   9 AKUBN
     I                                       10  11 AMESG
     I                                       18  25 ANOHZ
     I                                       26  27 ANBIN
     I                                       28  29 ABLOK
     I                                       30  30 AKANB
     I                                       28  30 ABLKA
     I                                       31  50 AKFLG
     I                                       31  34 ALOCA
     I                                       35  36 APCSY
     I                                       37  44 ACRHZ
     I                                       45  50 ACRTM
     I                                       51 256 ABLAK
     I            DS
     I                                        1   60D6TIME
     I                                        1   20D6TUHH
     I                                        3   40D6TUFF
     I                                        5   60D6TUSS
     I            DS
     I                                        1   80D6TUHZ
     I                                        1   40D6TUYY
     I                                        5   60D6TUMM
     I                                        7   80D6TUDD
     I            DS
     I                                        1   80D6KOHZ
     I                                        1   40D6KOYY
     I                                        5   60D6KOMM
     I                                        7   80D6KODD
     I            DS
     I                                        1   60D6KOTM
     I                                        1   20D6KOHH
     I                                        3   40D6KOSS
     I            DS
     I                                        1  140LDATE
     I                                        1   60LTIME
     I                                        7  140LDAY
      *
     C           *ENTRY    PLIST
     C                     PARM           PERROR  2        d[ｰﾃｰnﾞ
     C                     PARM           PLOCAT  4        ﾜiｰﾆｭ]
     C                     PARM           PSYSTM  2        ﾆﾇmwhﾎﾞ]
     C                     PARM           PKFLG  20        ﾆｰi]ﾇﾃｰnﾞ
     C                     PARM           PUALL 116        ﾌﾟ[xｰj
     C                     MOVE PUALL     UALL
      *
     C                     CLEARARECD
     C                     CLEARABMON
     C                     CLEARAGRUP
     C                     CLEARAKUBN
     C                     CLEARAMESG
     C                     CLEARANOHZ
     C                     CLEARANBIN
     C                     CLEARABLOK
     C                     CLEARAKANB
     C                     CLEARABLKA
     C                     CLEARAKFLG
     C                     CLEARABLAK
      *
     C                     MOVE 'ER'      ARECD
     C                     MOVE PLOCAT    ABMON
     C                     MOVE PKFLG     AKFLG
     C                     MOVE PERROR    AMESG
     C                     MOVE *BLANK    D6DATA
     C                     MOVE ADATA     D6DATA
     C                     MOVE PLOCAT    D6BUCD
     C                     TIME           D6TIME
     C                     MOVE PERROR    D6ERCD
     C                     EXSR SUBJOB
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C*----------------------------------------------------*
     C*  サブルーチン                                    *
     C*  ＪＯＢＬＯＧファイル　ＷＲＩＴＥ (AIAPP60)      *
     C*----------------------------------------------------*
     C           SUBJOB    BEGSR                           *
     C                     TIME           LDATE
     C                     MOVE *BLANK    D6SKJY           *
     C                     Z-ADD0         D6SKYY           *
     C                     Z-ADD0         D6SKMM           *
     C                     Z-ADD0         D6SKDD           *
     C                     Z-ADDLDAY      D6KOHZ           *
     C                     Z-ADDLTIME     D6KOTM           *
     C                     MOVE *BLANK    D6KOME
     C                     MOVE *BLANK    D6KOPG
     C                     MOVEL'AIAR50'  D6KOPG
     C                     Z-ADDUJOBN     D6JBNO
     C                     Z-ADDLDAY      D6TUHZ           *
     C                     Z-ADDLTIME     D6TIME           *
     C                     MOVE *BLANK    D6RETN
     C                     MOVE PLOCAT    D6LOCA           *
     C                     MOVE PSYSTM    D6PCCD           *
     C                     MOVE PKFLG     D6SCSY           *
     C                     WRITEAIAPP601                   *
     C                     ENDSR                           *
