     H            Y.
     F** AJ#R76 **************************************
     F* PRIORITY LIST(HD,RL,OQ,SURFACE TREATMENT)    *
     F*        ITS.         2015.05.13               *
     F************************************************
     FAJ#WP75 IF  E           K        DISK
     FAJ#WP76 UF  E           K        DISK                      A
     E                    TK         10  5
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1  50 TK
     I                                       01  05 W3TK01
     I                                       06  10 W3TK02
     I                                       11  15 W3TK03
     I                                       16  20 W3TK04
     I                                       21  25 W3TK05
     I                                       26  30 W3TK06
     I                                       31  35 W3TK07
     I                                       36  40 W3TK08
     I                                       41  45 W3TK09
     I                                       46  50 W3TK10
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     READ AJ#WP751                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ AJ#WP751                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *--------------------------------------------------*
      * AJ#WP76                                          *
      *--------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYW3     KLIST
     C                     KFLD           W2SECT
     C                     KFLD           W2SORT
     C                     KFLD           W2TKR2
     C                     MOVEL'0'       GET     1
     C           KEYW3     SETLLAJ#WP761
     C           KEYW3     READEAJ#WP761                 26
     C           *IN26     DOWEQ'0'
     C           GET       ANDEQ'0'
     C                     Z-ADD1         X       20
     C           X         DOWLE10
     C           GET       ANDEQ'0'
     C           TK,X      IFEQ *BLANK
     C                     MOVELW2TKR     TK,X
     C                     UPDATAJ#WP761
     C                     MOVEL'1'       GET
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C           KEYW3     READEAJ#WP761                 26
     C                     ENDDO
      *
     C           GET       IFEQ '0'
     C                     EXSR #SB510
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *--------------------------------------------------*
      * AJ#WP76                                          *
      *--------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C                     CLEARAJ#WP761
     C                     MOVELW2SECT    W3SECT
     C                     MOVELW2SORT    W3SORT
     C                     MOVELW2TKR2    W3BLK2
     C                     MOVELW2TKR     W3TK01
     C                     WRITEAJ#WP761
      *
     CSR         ESB510    ENDSR
