     H            Y.
     F** AJ#R01 **************************************
     F* SECTION M/F FOR FLAG LIST SCANNING           *
     F*        ITS.         2015.05.12               *
     F************************************************
     FAJ#PW01 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     FAJ#WP01 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCMD    2
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLAJ#WP011
     C                     READ AJ#WP011                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AJ#WP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * 1ST.                                               *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEAJ#PW019
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     303199
     C                     SETOF                     32
     C                     MOVEL*BLANK    D9ERR
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE15
     C           *IN99     ANDEQ'0'
     C           X         CHAINSFL                  21
     C           *IN21     IFEQ '0'
     C                     EXSR #SFCHK
     C           *IN99     IFEQ '0'
     C                     EXSR #SB221
     C                     ENDIF
     C                     UPDATSFL
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      * F10 INSERT
     C           *IN10     IFEQ '1'
     C                     SETOF                     303199
     C                     SETOF                     3233
     C                     WRITEW1
     C                     EXSR #SB810
     C           WKCMD     IFEQ '05'
     C                     EXSR #SB100
     C                     ENDIF
     C                     GOTO ESB220
     C                     ENDIF
      * F12 DELETE
     C           *IN12     IFEQ '1'
     C                     SETOF                     303199
     C                     SETOF                     32
     C                     WRITEW2
     C                     EXSR #SB820
     C           WKCMD     IFEQ '05'
     C                     EXSR #SB100
     C                     ENDIF
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           *IN99     IFEQ '1'
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTAJ#WP011
     C                     READPAJ#WP011                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  15        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPAJ#WP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLAJ#WP011
     C                     READ AJ#WP011                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AJ#WP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AJ#WP011                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      * F5
     C           *IN05     IFEQ '1'
     C                     MOVEL'05'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SFCHK    BEGSR
      *
     C           S1SECT    IFEQ 0
     C           S1BLK2    IFNE *BLANK
     C                     SETON                     3099
     C                     MOVELER,3      D9ERR
     C                     GOTO ESFCHK
     C                     ENDIF
     C                     ENDIF
      *
     C           S1SECT    IFNE 0
     C           S1BLK2    IFEQ *BLANK
     C                     SETON                     3299
     C                     MOVELER,5      D9ERR
     C                     GOTO ESFCHK
     C                     ENDIF
     C                     ENDIF
      *
     C           S1BLK2    IFNE *BLANK
     C                     MOVELS1SORT    P9SORT
     C                     MOVELS1SECT    P9SECT
     C                     MOVELS1BLK2    P9BLK2
     C                     CALL 'AJ#R07'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9BLK2  2
     C                     PARM           P9STS   1
     C           P9STS     IFEQ '9'
     C                     SETON                     3299
     C                     MOVELER,7      D9ERR
     C                     GOTO ESFCHK
     C                     ENDIF
      *
     C                     CALL 'AJ#R08'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9STS   1
     C           P9STS     IFEQ '9'
     C                     SETON                     3099
     C                     MOVELER,8      D9ERR
     C                     GOTO ESFCHK
     C                     ENDIF
      *
     C                     ENDIF
      *
     CSR         ESFCHK    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB221    BEGSR
      *
     C                     MOVELS1SORT    P9SORT
     C                     MOVELS1SECT    P9SECT
     C                     MOVELS1BLK2    P9BLK2
      *
     C                     CALL 'AJ#R02'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9BLK2  2
      *
     CSR         ESB221    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 15
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT DATA                                        *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR ITEM                                         *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT ITEM                                          *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVELW1SORT    S1SORT
     C                     MOVELW1SECT    S1SECT
     C                     MOVELW1BLK2    S1BLK2
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT DATA                                          *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ AJ#WP011                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV DATA                                           *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPAJ#WP011                 81
      *
     CSR         ENEXTP    ENDSR
      *----------------------------------------------------*
      * INSERT                                             *
      *----------------------------------------------------*
     CSR         #SB810    BEGSR
      *
     C                     Z-ADD0         DASORT
     C                     MOVEL*BLANK    DASECT
     C                     MOVEL*BLANK    DABLK2
     C                     MOVEL*BLANK    WKCMD   2
     C           DSP01A    TAG
     C                     EXFMTAJ#PW01A
     C                     SETOF                     313299
     C                     SETOF                     33
     C                     MOVEL*BLANK    DAERR
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'03'      WKCMD   2
     C                     GOTO ESB810
     C                     ENDIF
      *
     C           DASORT    IFEQ 0
     C                     SETON                     3199
     C                     MOVELER,4      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
      *
     C           DASORT    IFGE 1000
     C                     SETON                     3199
     C                     MOVELER,6      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
      *
     C           DASORT    IFNE 0
     C           DASECT    IFEQ 0
     C                     SETON                     3299
     C                     MOVELER,3      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
     C           DABLK2    IFEQ *BLANK
     C                     SETON                     3299
     C                     MOVELER,5      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
     C                     ENDIF
      *
     C           DABLK2    IFNE *BLANK
     C                     MOVELDASORT    P9SORT
     C                     MOVELDASECT    P9SECT
     C                     MOVELDABLK2    P9BLK2
     C                     CALL 'AJ#R07'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9BLK2  2
     C                     PARM           P9STS   1
     C           P9STS     IFEQ '9'
     C                     SETON                     3399
     C                     MOVELER,7      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
      *
     C                     CALL 'AJ#R08'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9STS   1
     C           P9STS     IFEQ '9'
     C                     SETON                     3299
     C                     MOVELER,8      DAERR
     C                     GOTO DSP01A
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     MOVELDASORT    P9SORT
     C                     MOVELDASECT    P9SECT
     C                     MOVELDABLK2    P9BLK2
     C                     CALL 'AJ#R05'
     C                     PARM           P9SORT  5
     C                     PARM           P9SECT  2
     C                     PARM           P9BLK2  2
     C                     MOVEL'05'      WKCMD   2
     C                     GOTO ESB810
     C                     ENDIF
      *
     C                     GOTO DSP01A
      *
     CSR         ESB810    ENDSR
      *----------------------------------------------------*
      * DELETE                                             *
      *----------------------------------------------------*
     CSR         #SB820    BEGSR
      *
     C                     Z-ADD0         DBSORT
     C                     MOVEL*BLANK    WKCMD   2
     C           DSP01B    TAG
     C                     EXFMTAJ#PW01B
     C                     SETOF                     313299
     C                     MOVEL*BLANK    DBERR
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'03'      WKCMD   2
     C                     GOTO ESB820
     C                     ENDIF
      *
     C           DBSORT    IFEQ 0
     C                     SETON                     3199
     C                     MOVELER,4      DBERR
     C                     GOTO DSP01B
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     MOVELDBSORT    P9SORT
     C                     CALL 'AJ#R06'
     C                     PARM           P9SORT  5
     C                     MOVEL'05'      WKCMD   2
     C                     GOTO ESB820
     C                     ENDIF
      *
     C                     GOTO DSP01B
      *
     CSR         ESB820    ENDSR
     C*----------------------------------------------------------------
**
ER-1 THERE ARE NO DATA.
ER-2 INPUT 1 OR 2.
ER-3 INPUT SCANNING SECTION.
ER-4 INPUT SORT NO.
ER-5 INPUT LOCATION.
ER-6 INPUT UNDER 1000.
ER-7 DUPLICATE ERR.
ER-8 SECTION ERR.
