     H            Y.                                    1
     FAJ#PP40 IP  E           K        DISK
     FFCETL11 IF  E           K        DISK
     FAEBPL01 IF  E           K        DISK
     FMFAPL25 IF  E           K        DISK
     FABBPL9A1IF  E           K        DISK
     FAB#PL72 IF  E           K        DISK
     FAGDPL11 IF  E           K        DISK
     FAB#PL18 IF  E           K        DISK
     FINVWP41 O   E                    DISK
      *
     E                    OBM        15  4               部門
     E                    OKB        15  3               機番
     E                    OTK        15  6               所番地
     E                    OSH        15  1               かんばん種類
     E                    OKO        15  3               工程
     E                    OHB        15 12               品番
      *
     I            DS
     I                                        1   6 I2LOC
     I                                        1   1 I2LOC1
     I                                        2   3 I2LOC2
     I                                        4   5 I2LOC3
     I                                        6   6 I2LOC4
     I            DS
     I                                        1   6 K@BANA
     I                                        1   1 K@BAN1
     I                                        2   3 K@BAN2
     I                                        4   5 K@BAN3
     I                                        6   6 K@BAN4
     I            DS
     I                                        1   6 K#BANA
     I                                        1   1 K#BAN1
     I                                        2   3 K#BAN2
     I                                        4   5 K#BAN3
     I                                        6   6 K#BAN4
     I            DS
     I                                        1  12 P#HINA
     I                                        1   5 P#HIN1
     I                                        6  10 P#HIN2
     I                                       11  12 P#HIN3
     I            DS
     I                                        1  12 A2BHBA
     I                                        1   5 A2BHB1
     I                                        6  10 A2BHB2
     I                                       11  12 A2BHB3
     I            DS
     I                                        1   80A2SYDT
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80I2DATE
     I                                        1   40I2YY
     I                                        5   60I2MM
     I                                        7   80I2DD
     I            DS
     I                                        1   8 P@DATE
     I                                        1   40ZZYY
     I                                        5   60ZZMM
     I                                        7   80ZZDD
     I            DS
     I                                        1   60I2TIME
     I                                        1   20I2JJ
     I                                        3   40I2MN
     I                                        5   60I2SS
      *
     C           *ENTRY    PLIST
     C                     PARM           PRBAN1  1
     C                     PARM           PRBAN2  2
     C                     PARM           PRBAN3  2
     C                     PARM           PRBAN4  1
     C                     PARM           PRMODE  1
      *
     C                     MOVE *DATE     P@DATE
      *
     C                     Z-ADD0         @@TDYN
     C                     Z-ADD0         @@TDYB
      *
     C                     Z-ADD0         @@NSCN
     C                     Z-ADD0         @@NSNB
     C                     Z-ADD0         P#RUNB
     C                     Z-ADD0         P#RUN2
     C                     Z-ADD0         W@KANQ
      *
     C           PRBAN1    IFNE *BLANK
     C           PRBAN1    IFNE I2LOC1
     C           PRBAN2    ORNE I2LOC2
     C           PRBAN3    ORNE I2LOC3
     C           PRBAN4    ORNE I2LOC4
     C                     GOTO @END
     C                     END
     C                     END
      *番地->絶対番号
     C                     CALL 'FCERS1'
     C                     PARM           I2LOC1
     C                     PARM           I2LOC2
     C                     PARM           I2LOC3
     C                     PARM           I2LOC4
     C                     PARM           P@DATE  8
     C                     PARM           P@ZETI  4
     C                     PARM           P@FLG   1
      *
     C           P@ZETI    CHAINFCETL11              11
     C   11                MOVE *BLANK    A2BHB1
     C   11                MOVE *BLANK    A2BHB2
     C   11                MOVE *BLANK    A2BHB3
     C   11                GOTO @JUMP
      *
     C                     MOVE A21HB5    W@KHN1  5
     C                     MOVE A22HB5    W@KHN2  5
     C                     MOVE A23HB2    W@KHN3  2
     C                     EXSR #AEB
     C                     MOVE W@KOTI    AFKOT1
      *
     C                     MOVE A24HB5    W@KHN1
     C                     MOVE A25HB5    W@KHN2
     C                     MOVE A26HB2    W@KHN3
     C                     EXSR #AEB
     C                     MOVE W@KOTI    AFKOT2
      *
     C                     MOVE A27HB5    W@KHN1
     C                     MOVE A28HB5    W@KHN2
     C                     MOVE A29HB2    W@KHN3
     C                     EXSR #AEB
     C                     MOVE W@KOTI    AFKOT3
      *
     C                     MOVE A210H5    W@KHN1
     C                     MOVE A211H5    W@KHN2
     C                     MOVE A212H2    W@KHN3
     C                     EXSR #AEB
     C                     MOVE W@KOTI    AFKOT4
      *
      * 90119A0302
     C           A2BHB1    IFEQ '90119'
     C           A2BHB2    ANDEQ'A0302'
     C           A2BHB3    ANDEQ'  '
     C                     Z-ADD0         SAKA
     C                     END
     C           A2BHB1    IFEQ '90080'
     C           A2BHB2    ANDEQ'11546'
     C           A2BHB3    ANDEQ'  '
     C                     Z-ADD0         SAKA
     C                     END
      *
      * YELLOW FLAG読み取り後の出荷照合
     C                     EXSR #AB#
      *
     C           *DATE     IFLT A2SYDT
     C                     Z-ADDA2KSYS    A2SSYS
     C                     END
      * TODAY NON SCAN
     C                     MOVE *DATE     P@DATE
     C                     MOVE *DATE     PRDAT
      * TODAYの時はAB#WPS3を作成しない
     C                     MOVE *BLANK    P@CRTD  1
      *
     C                     CALL 'AB#RS3'
     C                     PARM           A2BHB1
     C                     PARM           A2BHB2
     C                     PARM           A2BHB3
     C                     PARM           P@DATE  8
     C                     PARM           PRDAT   8
     C                     PARM           @@TDYN  90
     C                     PARM           @@SDAT
     C                     PARM           @@STIM
     C                     PARM           P@DAT1
     C                     PARM           P@NON1
     C                     PARM           P@DAT2
     C                     PARM           P@NON2
     C                     PARM           P@DAT3
     C                     PARM           P@NON3
     C                     PARM           P@DAT4
     C                     PARM           P@NON4
     C                     PARM           P@CRTD
      *
     C           @@TDYN    DIV  A2SSYS    @@TDYB  51
      * TODAY & +1 DAY NON SCAN
     C                     Z-ADD0         @@NSCN
      *
     C                     MOVE '+'       PPORM   1        + OR -
     C                     MOVE '0001'    PDAYS   4
     C                     MOVE *BLANK    PRDAT   8
     C                     MOVE *BLANK    PRTN    1
     C                     CALL 'DATR1A'
     C                     PARM           P@DATE  8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
      *
     C           A2BHB1    IFEQ '90080'
     C           A2BHB2    ANDEQ'10343'
     C           A2BHB3    ANDEQ'  '
     C                     Z-ADD0         SAKA
     C                     END
      *
     C                     MOVE '1'       P@CRTD
      *
     C                     CALL 'AB#RS3'
     C                     PARM           A2BHB1
     C                     PARM           A2BHB2
     C                     PARM           A2BHB3
     C                     PARM           P@DATE  8
     C                     PARM           PRDAT   8
     C                     PARM           @@NSCN  90
     C                     PARM           @@SDAT
     C                     PARM           @@STIM
     C                     PARM           P@DAT1
     C                     PARM           P@NON1
     C                     PARM           P@DAT2
     C                     PARM           P@NON2
     C                     PARM           P@DAT3
     C                     PARM           P@NON3
     C                     PARM           P@DAT4
     C                     PARM           P@NON4
     C                     PARM           P@CRTD
      *
     C           PRMODE    IFEQ ' '
     C           @@NSCN    IFEQ 0
     C******               GOTO @END
     C                     END
     C                     END
      * NON SCAN BOXES
     C           @@NSCN    DIV  A2SSYS    @@NSNB  51
      *
     C           @JUMP     TAG
      *工程切替マスター情報
     C           AAMRSB    PLIST
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVE *BLANK    PBMN   60
     C                     MOVE *BLANK    PKBN   45
     C                     MOVE *BLANK    PTKR   90
     C                     MOVE *BLANK    PSHR   15
     C                     MOVE *BLANK    PKOT   45
     C                     MOVE *BLANK    PHBN  180
     C                     MOVE *BLANK    STATUS  1
      *
     C                     MOVEA*BLANK    OBM
     C                     MOVEA*BLANK    OKB
     C                     MOVEA*BLANK    OTK
     C                     MOVEA*BLANK    OSH
     C                     MOVEA*BLANK    OKO
     C                     MOVEA*BLANK    OHB
      *
     C           OPNFLG    IFEQ *BLANK
     C                     MOVE '1'       OPNFLG  1
     C                     MOVE '1'       OPNCLS  1
     C                     ELSE
     C                     MOVE '0'       OPNCLS
     C                     END
      *
     C                     CALL 'AAMRSB'  AAMRSB
      *
     C           STATUS    IFNE '1'
     C                     GOTO @END
     C                     END
      *
     C                     MOVEAPBMN      OBM
     C                     MOVEAPKBN      OKB
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSH
     C                     MOVEAPKOT      OKO
     C                     MOVEAPHBN      OHB
      *
     C           1         DO   15        @X      20
      *
     C           OKO,@X    IFEQ *BLANK
     C                     LEAVE
     C                     END
      *
     C           A2BHB1    IFEQ '90105'
     C           A2BHB2    ANDEQ'A0119'
     C           A2BHB3    ANDEQ'  '
     C                     Z-ADD0         SAKA    40
     C                     END
      *
     C                     MOVE OBM,@X    P#BMON  4
     C                     MOVE OKO,@X    P#KOTE  3
     C                     MOVE OKB,@X    P#KIBN  3
     C                     MOVE OSH,@X    P#KCD1  1
     C                     MOVE *DATE     P#DATE  8
     C                     MOVE OHB,@X    P#HINA
     C                     MOVE OTK,@X    K@BANA
     C                     MOVE OTK,@X    K#BANA
      *
     C           K#BANA    IFEQ '------'
     C           @X        DO   15        @Y      20
     C           OTK,@Y    IFEQ '------'
     C                     ITER
     C                     END
     C                     MOVE OTK,@Y    K#BANA
     C                     LEAVE
     C                     ENDDO
     C                     END
      * 1TQ040
     C           K@BAN1    IFEQ '1'
     C           K@BAN2    ANDEQ'TQ'
     C           K@BAN3    ANDEQ'04'
     C           K@BAN4    ANDEQ'0'
     C                     Z-ADD0         SAKA    40
     C                     END
     C           K@BAN1    IFEQ '1'
     C           K@BAN2    ANDEQ'W1'
     C           K@BAN3    ANDEQ'15'
     C           K@BAN4    ANDEQ'0'
     C                     Z-ADD0         SAKA    40
     C                     END
      * LOT & QRY./BOX
     C                     MOVE '01'      P@BIN
     C                     CALL 'AAMRT1'
     C                     PARM           K@BAN1
     C                     PARM           K@BAN2
     C                     PARM           K@BAN3
     C                     PARM           K@BAN4
     C                     PARM           P@DATE
     C                     PARM           P@BIN   2
     C                     PARM           P#LOTO
     C                     PARM           P@SSYS
     C                     PARM           P@SSYT
      *
     C           K@BAN1    IFEQ '1'
     C           K@BAN2    ANDEQ'G1'
     C           K@BAN3    ANDEQ'76'
     C           K@BAN4    ANDEQ'0'
     C                     Z-ADD0         @STOP   40
     C                     END
      *
     C                     CALL 'AAMRT2'
     C                     PARM           K@BAN1
     C                     PARM           K@BAN2
     C                     PARM           K@BAN3
     C                     PARM           K@BAN4
     C                     PARM           P@DATE
     C                     PARM           P@BIN   2
     C                     PARM           P@LT    42
      *
     C           P@SSYS    IFEQ 0
     C                     Z-ADD0         SAKA
     C                     END
      *
     C           P@SSYS    MULT P#LOTO    P#LOTQ
     C           P#LOTQ    IFEQ 0
     C           K@BAN1    ANDNE'-'
     C                     Z-ADD0         SAKA    40
     C                     END
      * PRE LOAD
     C                     Z-ADD0         P#QTY   90
     C           P#KOTE    IFEQ 'BZ '
     C                     CALL 'ABBRS7'
     C                     PARM           P#KOTE  3
     C                     PARM           P#KIBN  3
     C                     PARM           P#DATE  8
     C                     PARM           P#HIN1  5
     C                     PARM           P#HIN2  5
     C                     PARM           P#HIN3  2
     C                     PARM           P#QTY   90
     C                     ELSE
     C                     CALL 'ABBRS3'
     C                     PARM           P#KOTE  3
     C                     PARM           P#KIBN  3
     C                     PARM           P#DATE  8
     C                     PARM           P#HIN1  5
     C                     PARM           P#HIN2  5
     C                     PARM           P#HIN3  2
     C                     PARM           P#QTY   90
     C                     END
      * OQ RUNNNING
     C                     Z-ADD0         P#QTY2  90
     C                     CALL 'ABBRS4'
     C                     PARM           P#KOTE  3
     C                     PARM           P#KIBN  3
     C                     PARM           P#DATE  8
     C                     PARM           P#HIN1  5
     C                     PARM           P#HIN2  5
     C                     PARM           P#HIN3  2
     C                     PARM           P#QTY2  90
      * QD
     C                     Z-ADD0         P#QTY3  90
     C           I2LOC     IFEQ K@BANA
     C                     CALL 'ABBRS5'
     C                     PARM           P#KOTE  3
     C                     PARM           P#KIBN  3
     C                     PARM           P#DATE  8
     C                     PARM           P#HIN1  5
     C                     PARM           P#HIN2  5
     C                     PARM           P#HIN3  2
     C                     PARM           P#QTY3  90
     C                     END
      *
     C           P#KOTE    IFEQ 'RL '
     C           P#QTY2    ANDNE0
     C                     Z-ADD0         SAKA
     C                     END
      * OUTSOURCE
     C                     Z-ADD0         AFBOXS
     C                     Z-ADD0         AFQTYS
     C           OSH,@X    IFNE *BLANK
     C           OBM,@X    IFEQ '2255'
     C           OBM,@X    OREQ '6666'
     C                     CALL 'AFARS2'
     C                     PARM           P#BMON
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           AFBOXS
     C                     ELSE
     C                     CALL 'AFDRS2'
     C                     PARM           P#BMON
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           AFBOXS
     C                     END
     C                     END
      *
     C           AFBOXS    MULT P@SSYS    AFQTYS
      * STORE STOCK
     C                     EXSR #SSTK
     C           I2LOC     IFEQ OTK,@X
     C                     Z-ADDI2QTY     W@KANS
     C                     END
      *
     C           P@SSYS    MULT W@KANS    W@KANQ
      *
     C           A2BHB1    IFEQ 'U1105'
     C           A2BHB2    ANDEQ'B3040'
     C                     Z-ADD0         SAKA    40
     C                     END
      * IN MACHINE
     C                     Z-ADD0         P#RUNB
     C           OKO,@X    IFEQ 'BZ '
     C                     CALL 'AJSRS2'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           P#RUNB  40
     C                     END
     C           OKO,@X    IFEQ 'DS '
     C           OKO,@X    OREQ 'DSM'
     C                     CALL 'AJSRS3'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           P#RUNB  40
     C                     END
      * IN MACHINE(NON COUNT)
     C                     Z-ADD0         P#RUN2
     C           OKO,@X    IFEQ 'OQ '
     C                     CALL 'ALGRS1'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           P#RUN2  40
     C                     END
     C           OKO,@X    IFEQ 'LOQ'
     C                     CALL 'ALHRS1'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           P#RUN2  40
     C                     END
      *
     C                     SETOF                     33
     C           OHB,@X    IFNE A2BHBA
     C                     SETON                     33
     C                     END
      *
     C                     EXSR #MFA
      * SRT
     C                     CALL 'AAFRS7'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           K@BAN1
     C                     PARM           K@BAN2
     C                     PARM           K@BAN3
     C                     PARM           K@BAN4
     C                     PARM           P@SRTN 20
     C                     PARM           P@SRT# 20
      * JC/KRO
     C                     MOVE *BLANK    P@JNAM
     C           P#KOTE    IFEQ 'JC '
     C           P#KOTE    OREQ 'KRO'
     C                     CALL 'AAHRS7'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           K#BAN1
     C                     PARM           K#BAN2
     C                     PARM           K#BAN3
     C                     PARM           K#BAN4
     C                     PARM           P@JNAM 20
     C                     END
      * ADH
     C                     Z-ADD0         P@HOJI  20
     C                     Z-ADD0         P@ONDO  30
     C                     Z-ADD0         P@CO2P  32
     C           P#KOTE    IFEQ 'LAN'
     C           P#KOTE    OREQ 'AOQ'
     C           P#KOTE    OREQ 'OQ '
     C           P#KOTE    OREQ 'LOQ'
     C                     CALL 'ADHRS2'
     C                     PARM           P#HIN1
     C                     PARM           P#HIN2
     C                     PARM           P#HIN3
     C                     PARM           K#BAN1
     C                     PARM           K#BAN2
     C                     PARM           K#BAN3
     C                     PARM           K#BAN4
     C                     PARM           P@HOJI  20
     C                     PARM           P@ONDO  30
     C                     PARM           P@CO2P  32
     C                     END
      *
     C           P#BMON    IFNE '0111'
     C           P#BMON    ANDNE'8990'
     C                     Z-ADD2         P@LT
     C                     ENDIF
     C*
     C                     MOVEL*BLANK    @CHK1   1
     C****                 EXSR #SB500
     C           @CHK1     IFEQ '1'
     C****                 GOTO @END
     C                     ENDIF
     C*
     C                     WRITEINVWP411
      *
     C                     ENDDO
      *
     C           @END      TAG
      *
     CLR                   EXSR #SB999
      *---------------------------------------------------------------*
      *ＡＡＭＲ９８終了処理                                         *
      *---------------------------------------------------------------*
     CSR         #SB999    BEGSR
     C                     MOVE *BLANK    A2BHB1
     C                     MOVE *BLANK    A2BHB2
     C                     MOVE *BLANK    A2BHB3
     C                     MOVE '9'       OPNCLS
     C                     MOVE *BLANK    OBM
     C                     MOVE *BLANK    OKB
     C                     MOVE *BLANK    OTK
     C                     MOVE *BLANK    OSH
     C                     MOVE *BLANK    OKO
     C                     MOVE *BLANK    OHB
     C                     MOVE *BLANK    STATUS
     C                     CALL 'AAMRSB'  AAMRSB
     CSR         #S999E    ENDSR
      *-----------------------------------------------------
     C           #SSTK     BEGSR
      * 1EA180
     C           K@BAN1    IFEQ '1'
     C           K@BAN2    ANDEQ'EA'
     C           K@BAN3    ANDEQ'18'
     C           K@BAN4    ANDEQ'0'
     C                     Z-ADD0         W@KANS
     C                     END
      *
     C                     Z-ADD0         W@KANS
      *
     C           BANKEY    KLIST
     C                     KFLD           K@BAN1  1
     C                     KFLD           K@BAN2  2
     C                     KFLD           K@BAN3  2
     C                     KFLD           K@BAN4  1
     C           BANKEY    CHAINABBPL9A1             66
     C           *IN66     IFEQ '0'
     C           A9SKJY    ANDEQ'D'
     C                     SETON                     66
     C                     END
     C           *IN66     IFEQ '0'
     C                     Z-ADDA9KANS    W@KANS
     C                     END
      *
     C           ESSTK     ENDSR
      *-----------------------------------------------------
     C           #AB#      BEGSR
      *
     C                     Z-ADD0         I2SCAN
      *
     C           AB#KEY    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           I2YY
     C                     KFLD           I2MM
     C                     KFLD           I2DD
     C                     KFLD           I2TIME
     C           HINKEY    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C           AB#KEY    SETLLAB#PL72
     C                     DO   *HIVAL
     C           HINKEY    READEAB#PL72                  96
     C   96                LEAVE
     C           EKSKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     ADD  EKSRYO    I2SCAN
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #AEB      BEGSR
      *
     C                     MOVE *BLANK    W@KOTI  3
      *
     C           HINKEY    SETLLAEBPL01
     C                     DO   *HIVAL
     C           HINKEY    READEAEBPL01                  97
     C   97                LEAVE
     C           AFSKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C           AFKHN1    IFEQ W@KHN1
     C           AFKHN2    ANDEQW@KHN2
     C           AFKHN3    ANDEQW@KHN3
     C                     ELSE
     C                     ITER
     C                     END
      *
     C                     MOVE AFKOTI    W@KOTI
     C                     LEAVE
      *
     C                     ENDDO
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #MFA      BEGSR
      *
     C                     MOVE P#BMON    N@BMON  40
     C           MFAKEY    KLIST
     C                     KFLD           N@BMON
     C                     KFLD           P#KIBN
     C* * *                KFLD           P#KOTE
      *
     C           MFAKEY    SETLLMFAPL25
     C                     DO   *HIVAL
     C           MFAKEY    READEMFAPL25                  54
     C   54                LEAVE
     C           M@SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
      *
     C           *IN54     IFEQ '1'
     C                     MOVE *BLANK    M@KGUN
     C                     MOVE *BLANK    M@COS1
     C                     MOVE *BLANK    M@COS2
     C                     MOVE *BLANK    M@COS3
     C                     END
      *
     C                     ENDSR
     C*****************************************************************
     C           #SB500    BEGSR
     C                     Z-ADDZZYY      ##YY    40
     C                     Z-ADDZZMM      ##MM    20
     C                     Z-ADDZZDD      ##DD    20
     C           AGDKEY    KLIST
     C                     KFLD           ##YY
     C                     KFLD           ##MM
     C                     KFLD           ##DD
     C*
     C                     Z-ADD0         @@YY    40
     C                     Z-ADD0         @@MM    20
     C                     Z-ADD0         @@DD    20
     C*
     C                     SETOF                     69
     C           AGDKEY    SETGTAGDPL111
     C                     DO   6
     C                     READPAGDPL111                 69
     C   69                LEAVE
     C                     ENDDO
     C                     Z-ADDF8KAYY    @@YY
     C                     Z-ADDF8KAMM    @@MM
     C                     Z-ADDF8KADD    @@DD
     C*
     C           AB#KE2    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           @@YY
     C                     KFLD           @@MM
     C                     KFLD           @@DD
     C           AB#KE3    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C*
     C                     SETOF                     68
     C           AB#KE2    SETLLAB#PL181
     C                     DO
     C           AB#KE3    READEAB#PL181                 68
     C   68                LEAVE
     C                     LEAVE
     C                     ENDDO
     C*
     C           *IN68     IFEQ '1'
     C                     MOVEL'1'       @CHK1
     C                     ENDIF
     C           *IN68     IFEQ '0'
     C                     Z-ADD0         SAME    10
     C                     ENDIF
     C*
     C                     ENDSR
      *
