     H            Y.
     F** AJAR81 *********************************************
     F*   SELECT COMMON PASS-THOURGH DEVICE TO ASJ          *
     F*          T.SAKAKI           02/12/2018              *
JW1  F*   JW   03/07/2018 ADD START/END DATE TIME AND ID    *
     F********************************************* AJAR81 **
     FAJAPP81 UF  E           K        DISK
      *
JW1  I* SYSTEM TIME
 |   I            DS
 |   I                                        1  140WSDT
 |   I                                        1   60NOW
 |   I                                        7  140TODAY
 |   I                                        1   20WSHH
 |   I                                        3   40WSMN
 |   I                                        5   60WSSS
 |   I                                        7  100WSYY
 |   I                                       11  120WSMM
 |   I                                       13  140WSDD
 |   I                                        1   40WSTM4
 |    *
 |   I           SDS
 |   I                                        1   8 #PGM
 |   I                                      244 253 #WSID
JW1  I                                      254 263 #USER
     I                                      264 269 #JOB
      *---------------------------------------------------------
      * ENTRY
      *---------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           PVWS   10
     C                     PARM           PSTS    1
JW1   * RETRIEVE SYSTEM TIME
 "   C                     TIME           WSDT
      *---------------------------------------------------------
      * MAIN
      *---------------------------------------------------------
      * START
     C           PSTS      IFEQ 'S'
      *
     C                     MOVEL*BLANK    PVWS
     C                     SETOF                       21
      *
     C           *LOVAL    SETLLAJAPP81                  21
     C                     DO   *HIVAL
     C                     READ AJAPP81                  21
     C   21                LEAVE
      *
     C           A8STS     IFNE 'S'
     C                     MOVELA8VWS     PVWS
     C                     MOVEL'S'       A8STS
      *
JW1  C                     Z-ADDTODAY     A8DAT
 |   C                     TIME           A8TIM
 |   C                     MOVEL#WSID     A8WSID
 |   C**                   MOVE 'S'       A8WSID
JW1  C                     MOVEL#USER     A8USR
JW1  C                     MOVEL#JOB      A8JOB
      *
     C                     UPDATAJAPP811
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDIF
      ** END
     C           PSTS      IFEQ 'E'
      *
     C                     SETOF                       22
     C           PVWS      CHAINAJAPP81              22
     C           *IN22     IFEQ '0'
     C                     MOVEL'E'       A8STS
      *
JW1  C                     Z-ADDTODAY     A8DAT
 |   C                     TIME           A8TIM
 |   C                     MOVEL#WSID     A8WSID
 |   C**                   MOVE 'E'       A8WSID
JW1  C                     MOVEL#USER     A8USR
JW1  C                     MOVEL#JOB      A8JOB
      *
     C                     UPDATAJAPP811
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     SETON                       LR
     C                     RETRN
