     H            Y.
     F** AJAR83 *********************************************
     F*  CLEAR AJAPP81 (PASS-THROUGH DEVICE TABLE)          *
     F*  JW    03.19.2018                                   *
     F********************************************* AJAR81 **
     FAJAPP81 UF  E           K        DISK
      *
      *==================================================
     C           *ENTRY    PLIST
     C                     PARM           $UPD    1
     C           $UPD      IFNE 'Y'
     C                     GOTO ENDP
     C                     ENDIF
      *
     C                     TIME           NUM14  140
     C                     Z-ADDNUM14     @SYSDT  80
      *---------------------------------------------------------
      * MAIN
      *---------------------------------------------------------
      *
     C           *LOVAL    SETLLAJAPP81
     C                     DO   *HIVAL
     C                     READ AJAPP81                  98
     C   98                LEAVE
      *
     C           A8DAT     IFNE 0
     C           A8DAT     ANDLT@SYSDT
     C                     MOVEL'E'       A8STS
     C                     CLEARA8DAT
     C                     CLEARA8TIM
     C                     CLEARA8WSID
     C                     CLEARA8USR
     C                     UPDATAJAPP811
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           ENDP      TAG
     C                     SETON                       LR
     C                     RETRN
