     H            Y.
     F** AJBR62 ******************************************
     F*  ..AS/400 IAF ATC<-->AOYAMA DATABASE TRANSFER..  *
     F*      I-HASADA                      97.12.22      *
     F****************************************** AJBR62 **
     FAJBPW62 CF  E                    WORKSTN
     E                    HFIL       30  7
     E                    TB1     1  18  1
     E                    TB2     1   5  2   TB3     8
     E                    ER      1   4 60
     I            DS
     I                                        1 210 HFIL
     I                                        1   7 NO201
     I                                        8  14 NO202
     I                                       15  21 NO203
     I                                       22  28 NO204
     I                                       29  35 NO205
     I                                       36  42 NO206
     I                                       43  49 NO207
     I                                       50  56 NO208
     I                                       57  63 NO209
     I                                       64  70 NO210
     I                                       71  77 NO211
     I                                       78  84 NO212
     I                                       85  91 NO213
     I                                       92  98 NO214
     I                                       99 105 NO215
     I                                      106 112 NO216
     I                                      113 119 NO217
     I                                      120 126 NO218
     I                                      127 133 NO219
     I                                      134 140 NO220
     I                                      141 147 NO221
     I                                      148 154 NO222
     I                                      155 161 NO223
     I                                      162 168 NO224
     I                                      169 175 NO265
     I                                      176 182 NO226
     I                                      183 189 NO227
     I                                      190 196 NO228
     I                                      197 203 NO229
     I                                      204 210 NO230
     I            DS
     I                                        1   7 WFILE
     I                                        1   1 WA1
     I                                        4   5 WA45
      *
     C           *ENTRY    PLIST
     C                     PARM           PIN98   1
      *
     C                     MOVE PIN98     *IN98
      *
     C           STP1      TAG
     C                     EXFMTAJBPW621
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     070809
     C                     SETOF                     101112
     C                     SETOF                     131415
     C                     SETOF                     161718
     C                     SETOF                     192021
     C                     SETOF                     222324
     C                     SETOF                     252627
     C                     SETOF                     282930
     C                     SETOF                     99
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     SETOF                     50
     C                     Z-ADD1         A       20
     C           1         DO   30        A
     C           HFIL,A    IFNE *BLANK
     C                     SETON                     50
     C                     END
     C  N50                END
      *
     C           *IN50     IFEQ '0'
     C                     SETON                     010203
     C                     SETON                     040506
     C                     SETON                     070809
     C                     SETON                     101112
     C                     SETON                     131415
     C                     SETON                     161718
     C                     SETON                     192021
     C                     SETON                     222324
     C                     SETON                     252627
     C                     SETON                     282930
     C                     SETON                     99
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------*
     C*  ..ファイル頭１桁..      *
     C*  ..ファイル頭４～５桁..  *
     C*----------------------------*
     C                     Z-ADD1         A
     C                     Z-ADD0         B       20
     C           1         DO   30        A
     C                     ADD  1         B
     C           HFIL,A    IFNE *BLANK
     C                     MOVE HFIL,A    WFILE
      *
     C                     SETOF                     50
     C           WA1       LOKUPTB1                      50
     C           *IN50     IFEQ '0'
     C                     SETON                     99
     C                     MOVE '1'       *IN,B
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETOF                     50
     C           WA45      LOKUPTB2                      50
     C           *IN50     IFEQ '0'
     C*                    SETON                     99
     C*                    MOVE '1'       *IN,B
     C*                    MOVE ER,3      MSG
     C*                    GOTO STP1
     C                     END
      *
     C                     END
     C                     END
      *
     C  NKE                GOTO STP1
      *
     C                     Z-ADD1         A
     C           1         DO   30        A
     C           HFIL,A    IFNE *BLANK
     C                     MOVELHFIL,A    WFILE
      *
     C                     SETOF                     50
     C                     Z-ADD1         B
     C                     MOVE *BLANK    WLIBR   8
     C           WA45      LOKUPTB2,B                    50
     C           *IN50     IFEQ '1'
     C                     MOVE TB3,B     WLIBR
     C                     END
      *
     C                     MOVE *BLANK    PER     2
      *
     C                     CALL 'AJBC63'
     C                     PARM           WFILE
     C                     PARM           WLIBR
     C                     PARM           PER
      *
     C           PER       IFNE *BLANK
     C                     SETON                     99
     C                     MOVEL'1'       *IN,A
     C                     END
      *
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVELER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
** TB1
A
D
M
R
F
T
U
B
E
N
K
G
S
V
O
I
C
J
** TB2.TB3
PPHFILE1
TPHFILE1
NPHWFILE1
WPHWFILE1
01HFILE1
** ER
E-01ファイルを入力して下さい。
E-02ファイル名１桁目が違っています。
E-03ファイル名４～５桁目が違っています。
E-04反転しているファイルは有りません。
