     H            Y.
     F** AJCR01 *****************************
     F* ..SELECT ELECTRIC POWER OFF MENU..  *
     F*    I-HASADA            97.01.22     *
     F***************************** AJCR01 **
     FAJCPW01 CF  E                    WORKSTN
     E                    ER      1   4 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1   6 JIKN
     I                                        1   2 @HH
     I                                        3   4 @MM
     I                                        5   6 @SS
      *
     C                     Z-ADD2         INO1
     C                     MOVEL'010000'  JIKN
     C                     MOVEL'Y'       INO3
      *
     C           STP1      TAG
     C                     EXFMTAJCPW011
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           INO1      IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INO1      IFNE 1
     C           INO1      ANDNE2
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C           INO1      IFEQ 1
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     ELSE
      *
     C                     MOVE INO1      PNO1    1
     C                     MOVE *BLANK    PNO2    1
     C                     MOVE *BLANK    JIKN
     C                     MOVE *BLANK    PNO3    1
      *
     C                     CALL 'AJCC02'
     C                     PARM           PNO1
     C                     PARM           PNO2
     C                     PARM           JIKN
     C                     PARM           PNO3
     C                     END
     C                     END
      *
     C                     Z-ADD1         INO2
      *
     C           STP2      TAG
     C                     EXFMTAJCPW012
     C                     SETOF                     0299
     C                     SETOF                     0304
      *
     C           *INKB     IFEQ '1'
     C                     Z-ADD0         INO1
     C                     GOTO STP1
     C                     END
      *
     C           INO2      IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,1      MSG
     C                     GOTO STP2
     C                     END
      *
     C           INO2      IFNE 1
     C           INO2      ANDNE2
     C           INO2      ANDNE3
     C           INO2      ANDNE4
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C           INO2      IFEQ 1
     C           JIKN      IFNE *BLANK
     C           @HH       IFGT '23'
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
     C           @MM       IFGT '59'
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
     C           @SS       IFGT '59'
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           INO3      IFNE 'Y'
     C           INO3      ANDNE'N'
     C                     SETON                     0499
     C                     MOVE ER,4      MSG
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP2
     C                     END
      *
     C                     MOVE INO1      PNO1    1
     C                     MOVE INO2      PNO2    1
     C                     MOVE INO3      PNO3    1
      *
     C                     CALL 'AJCC02'
     C                     PARM           PNO1
     C                     PARM           PNO2
     C                     PARM           JIKN
     C                     PARM           PNO3
      *
     C                     SETON                     LR
     C                     RETRN
      *
** ER
E-01 NUMBER IS NOT INPUT.
E-02 NUMBER IS NOT RIGHT.
E-03 BUCK UP TIME IS NOT RIGHT.
E-03 POWER DOWN OPTION IS NOT RIGHT.
