     H            Y.                                    1
     F** AJER11 ******************************
     F* .. PGM OTHER MENU ACCOUNT BOOK.. *
     F* .. USE DEPARTMENT UNIT             *
     F* I-HASADA                88.11.18     *
     F****************************** AJER11 **
     FEGBPL13 IP  E           K        DISK
     FQPRINT  O   F      80     OF     PRINTER
     E                    TB1     1   3  2   TB2    16   ﾎﾞﾆｭxb
     IEGBPL131
     I                                              MLPGMNL1
     I            DS
     I                                        1  10 MLUSRC
     I                                        1   2 USRC
      *
     C                     TIME           WTIME   60
     C           *IN02     IFEQ '0'
     C                     SETON                     02
     C                     Z-ADD0         RECD    20
     C                     EXCPTHD
     C                     END
      *
     C           *INL1     IFEQ '1'
     C                     SETOF                     01
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WUNM   16
     C                     MOVE USRC      WUSRC   2
     C           USRC      LOKUPTB1,A                    01
     C           *IN01     IFEQ '1'
     C                     MOVELTB2,A     WUNM
     C                     END
      *
     C           RECD      IFGT 52
     C                     Z-ADD2         RECD
     C                     EXCPTHD
     C                     EXCPTDT1
     C                     ELSE
      *
     C                     ADD  2         RECD
     C                     EXCPTDT1
     C                     END
     C                     ELSE
      *
     C           USRC      IFNE WUSRC
     C                     MOVE USRC      WUSRC
      *
     C                     SETOF                     01
     C                     Z-ADD1         A
     C                     MOVE *BLANK    WUNM
     C           USRC      LOKUPTB1,A                    01
     C           *IN01     IFEQ '1'
     C                     MOVELTB2,A     WUNM
     C                     END
      *
     C           RECD      IFGT 52
     C                     Z-ADD2         RECD
     C                     EXCPTHD
     C                     EXCPTDT1
     C                     ELSE
      *
     C                     ADD  1         RECD
     C                     EXCPTDT2
     C                     END
     C                     END
     C                     END
      *
     OQPRINT  E   02           HD
     O                                   80 '...........'
     O        E 1              HD
     O                                   58 'TIME'
     O                         WTIME Y   67
     O                                   80 '.         .'
     O        E 1              HD
     O                                   10 'AJER11-1'
     O                                   58 'DATE'
     O                         UDATE Y   67
     O                                   80 '.         .'
     O        E 1              HD
     O                                   15 'UNIT USE DEPT'
     O                                   42 '** MENU ACCOUNT BOOK '
     O                                   53 'BY PGM NAME'
     O                                   63 'PAGE'
     O                         PAGE  Z   67
     O                                   80 '...........'
     O        E 2              HD
     O                                   16 'PGM NAME'
     O                                   30 'MENU TEXT'
     O                                   71 'USING DEPARTMENT'
     O        E 2              DT1
     O                         MLPGMN    13
     O                         MLTEXT    57
     O                         WUNM      75
     O        E 1              DT2
     O                         WUNM      75
      *
** TB1.TB2
I0IAF
QPQPGMR
QSQSECOFR
