     H            Y.
     F*** AJER03 *******************************************
     F* MENU MANAGEMENT M/F UPDATE KANJI < EACH PART STATION INPUT > *
     F*          M-OKUDA            1983.02.01             *
TCHK1F* TCHK1 12/02/05 CHG USER-ID CHECK
     F* %0001 11/18/15 CHECK EXIST OR NOT
JW1  F* JW    05/27/16 ADD 'J' FOR LIBRARY NAME
JW2  F* JW    05/11/22 ADD UPD DATE AND USER#
     F******************************************************
     FAJEPW03 CF  E                    WORKSTN
     FEGBPL11 IF  E           K        DISK
     FEGBPL12 UF  E           K        DISK                      A
     FEGBPL14 IF  E           K        DISK
     FRGAPL11 IF  E           K        DISK
     E                    ER      1  28 60               ERROR MSG
     IEGBPL111    04
     I              M1SKJY                          FSKJY
     I              M1USRC                          FUSRC
     I              M1MNNO                          FMNNO
     I              M1MNDN                          FMNDN
     I              M1PGMN                          FPGMN
     I              M1TEXT                          FTEXT
     I              M1KNJI                          FKNJI
     I              M1KIMT                          FKIMT
     I              M1KOYY                          FKOYY
     I              M1KOMM                          FKOMM
     I              M1KODD                          FKODD
     I              M1SAYY                          FSAYY
     I              M1SAMM                          FSAMM
     I              M1SADD                          FSADD
     I            DS
     I                                        1   80KOHIZK
     I                                        1   40M1KOYY
     I                                        5   60M1KOMM
     I                                        7   80M1KODD
     I            DS
     I                                        1  10 UUSER
     I                                        1   5 BSYO1
     I                                        1   2 BSYO
     I                                        4   5 PTANT
     I            DS
     I                                        1   6 PGMN
     I                                        1   1 LIBN
     I                                        1   4 PMENU
     I                                        4   4 PKBN
     I            DS
     I                                        1  10 TANT
     I                                        1   7 TANT7
     I                                        1   1 TCHK
     I                                        1   2 BUSY
     I                                        3   5 RBAN
     I                                        6  10 TNBL
     I            DS
     I                                        1   80SAHIZK
     I                                        1   40M1SAYY
     I                                        5   60M1SAMM
     I                                        7   80M1SADD
     I            DS
     I                                        1   2 UM1
     I                                        3   4 UM2
     I            DS
     I                                        1  10 M1USRC
     I                                        1   2 UBSYO
     I                                        4   5 UTANT
     I            DS
     I                                        1   6 FPGMN
     I                                        1   4 PGMN4
     I            DS
     I                                        1   3 UMNO
     I                                        1   2 MENU
     I                                        3   3 DAN
JW2  I            DS
 .   I                                        1  140SDATE
 .   I                                        1   60NOW
 .   I                                        7  140TODAY
 .   I           SDS
 .   I                                        1   8 #PGM
 .   I                                      244 253 #WSID
JW2  I                                      254 263 #USER
      **********************************************************
     C           KEY12     KLIST
     C                     KFLD           TANT
     C                     KFLD           WMENU
     C                     KFLD           WDAN
      *
     C           KEY11     KLIST
     C                     KFLD           TANT
     C                     KFLD           PGMN
      *
     C           *ENTRY    PLIST
     C                     PARM           PUSER  10
     C                     MOVE PUSER     UUSER
      *
     C           CHPARM    PLIST
     C                     PARM           PGMN
     C                     PARM           ERRC    1
      *
JW2  C                     TIME           SDATE
      *
     C                     MOVE *BLANK    MENTA   1
     C                     MOVE *BLANK    TANTA  10
     C                     MOVE *BLANK    UMNOA   3
     C                     MOVE *BLANK    PGMNA   6
     C                     MOVE '01'      UM1
     C                     MOVE '99'      UM2
      *
     C           BSYO      COMP 'I0'                     80電算
     C  N80      BSYO1     COMP 'QPGMR'                  80ﾎﾟﾜhﾞ[w xpｬｰ
      *
     C           BSYO      CABEQ'A0'      STEP1
     C           BSYO      CABEQ'D1'      STEP1
     C           BSYO1     CABEQ'QPGMR'   STEP1
     C           TANT7     CABEQ'QPGMR  ' STEP1
     C           TANT7     CABEQ'QSECOFR' STEP1
     C           TANT7     CABEQ'QSYSOPR' STEP1
      *
     C           STEP1     TAG
     C                     EXFMTAJEPW031
     C   KA                GOTO END
      *
     C                     SETOF                     99
     C                     SETOF                     101112
      *
     C           BSYO      CABEQ'A0'      STEP7
     C           BSYO      CABEQ'D1'      STEP7
     C           BSYO1     CABEQ'QPGMR'   STEP7
     C           TANT7     CABEQ'QPGMR  ' STEP7
     C           TANT7     CABEQ'QSECOFR' STEP7
     C           TANT7     CABEQ'QSYSOPR' STEP7
      *
      *
     C           STEP7     TAG
     C           MENT      COMP '0'                      10
     C  N10      MENT      COMP '1'                      11
     C  N10N11   MENT      COMP '2'                  999912
     C   99                MOVE ER,2      MSG
     C   99                GOTO STEP1
      *
     C                     SETOF                     99
     C           TANT      COMP *BLANK                 9999
     C   99                MOVELER,6      MSG
     C   99                GOTO STEP1
      *
     C           TANT7     IFNE 'QPGMR  '
     C           TANT7     IFNE 'QSECOFR'
     C           TANT7     IFNE 'QSYSOPR'
      *
     C  N10      TANT      CHAINRGAPL11              99
     C  N99      J8SKJY    COMP 'D'                      99
     C           MENT      IFNE '0'
     C   99                MOVELER,23     MSG
     C   99                MOVEL'********'TMEI
     C   99                GOTO STEP1
     C                     ELSE
      *
     C                     SETOF                     99
     C                     END
     C                     MOVELJ8NAME    TMEI   10
     C                     ELSE
     C                     MOVEL'SECURITY'TMEI
     C                     END
     C                     ELSE
     C                     MOVEL'SYSTEM  'TMEI
     C                     END
     C                     ELSE
     C                     MOVEL'PGMR    'TMEI
     C                     END
      *
     C           TCHK      COMP 'A'                    99
     C  N99      TCHK      COMP 'Z'                  99
     C   99                MOVELER,13     MSG
     C   99                GOTO STEP1
      *
     C           TANT7     IFNE 'IAF    '
     C           TANT7     IFNE 'QPGMR  '
     C           TANT7     IFNE 'QSECOFR'
     C           TANT7     IFNE 'QSYSOPR'
     C           TANT7     IFNE 'A400T  '
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           TANT7     IFNE 'QSECOFR'
     C           TANT7     IFNE 'QSYSOPR'
     C           TNBL      COMP *BLANK               9999
     C   99                MOVELER,7      MSG
     C   99                GOTO STEP1
     C                     END
     C                     END
      *
     C           MENU      COMP '00'                   99
     C   99                MOVELER,15     MSG
     C   99                GOTO STEP1
     C           MENU      COMP UM1                    99
     C   99                MOVELER,21     MSG
     C   99                GOTO STEP1
     C           MENU      COMP UM2                  99
     C   99                MOVELER,22     MSG
     C   99                GOTO STEP1
      *
     C                     SETOF                     03
     C           DAN       COMP '0'                    99
     C  N99      DAN       COMP '9'                  99
     C   99                MOVELER,16     MSG
     C   99                GOTO STEP1
      *
     C           STEP5     TAG
     C                     MOVE MENU      WMENU   20
     C                     MOVE DAN       WDAN    10
      *
     C   10                MOVE 'CANCEL'  CMNT    6
     C   11                MOVE 'CHANGE'  CMNT
     C   12                MOVE 'ADD   '  CMNT
      *
     C           STEP4     TAG
     C                     SETOF                     0102
     C           KEY12     CHAINEGBPL121             02
     C  N02      M1SKJY    COMP 'D'                      01
      *
     C   02 10             SETON                     99
     C   99                MOVELER,8      MSG
     C   99                GOTO STEP1
     C   02 11             SETON                     99
     C   99                MOVE ER,9      MSG
     C   99                GOTO STEP1
      *
     C   01 10             SETON                     99
     C   99                MOVELER,10     MSG
     C   99                GOTO STEP1
     C   01 11             SETON                     99
     C   99                MOVELER,11     MSG
     C   99                GOTO STEP1
      *
     C  N01 12N02          SETON                     99
     C   99                MOVELER,12     MSG
     C   99                GOTO STEP1
      *
     C           BSYO1     IFNE 'QPGMR'
     C           BSYO1     ANDNE'I1000'
     C  N80      BUSY      COMP BSYO                 9999
     C   99                MOVELER,14     MSG
     C   99                GOTO STEP1
     C                     END
      *
     C           *IN12     IFEQ '1'
     C                     MOVE *BLANK    PGMN
     C                     MOVE *BLANK    TEXT
     C                     MOVE *BLANK    KNJI   40
     C                     MOVEL*BLANK    KIMT
     C                     Z-ADD0         SAHIZK
     C                     MOVE *DATE     KOHIZK
     C                     ELSE
     C                     MOVE M1PGMN    PGMN
     C                     MOVE M1TEXT    TEXT
     C*                    MOVE M1KNJI    KNJI
     C                     MOVE M1KIMT    KIMT
     C                     END
      *
     C           STEP3     TAG
     C                     EXFMTAJEPW032
     C           *INKC     IFEQ '1'
     C           *IN80     IFEQ '0'
     C                     MOVE *BLANK    MENT
     C                     MOVE *BLANK    CMNT
     C                     MOVE *BLANK    MENU
     C                     MOVE *BLANK    DAN
     C                     MOVE *BLANK    TANT
     C                     END
     C                     GOTO STEP1
     C                     END
      *
     C                     SETOF                     99
     C   10                GOTO STEP11
     C           PMENU     CABEQ'MENU'    STEP8
      *
     C           PGMN      IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,3      MSG
     C                     GOTO STEP3
     C                     END
      *
     C           MENT      IFNE '0'
     C           PMENU     IFNE 'MENU'
     C                     MOVE *BLANK    ERRC
     C                     CALL 'EGBC00'  CHPARM
     C           ERRC      IFEQ 'E'
     C                     SETON                     99
     C                     MOVELER,27     MSG
     C                     GOTO STEP3
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     0599
     C           LIBN      COMP 'F'                      05
     C  N05      LIBN      COMP 'C'                      05
     C  N05      LIBN      COMP 'M'                      05
     C  N05      LIBN      COMP 'R'                      05
     C  N05      LIBN      COMP 'D'                      05
     C  N05      LIBN      COMP 'U'                      05
     C  N05      LIBN      COMP 'K'                      05
     C  N05      LIBN      COMP 'T'                      05
     C  N05      LIBN      COMP 'E'                      05
     C  N05      LIBN      COMP 'N'                      05
     C  N05      LIBN      COMP 'G'                      05
     C  N05      LIBN      COMP 'S'                      05
     C  N05      LIBN      COMP 'V'                      05
     C  N05      LIBN      COMP 'A'                      05
     C  N05      LIBN      COMP 'I'                      05
     C  N05      LIBN      COMP 'B'                      05
     C  N05      LIBN      COMP 'Z'                      05
JW1  C  N05      LIBN      COMP 'J'                      05
     C  N05      LIBN      COMP 'O'                  9999
     C   99                MOVELER,4      MSG
     C   99                GOTO STEP3
      *
     C           PKBN      IFNE 'R'
     C           PKBN      IFNE 'C'
     C                     SETON                     99
     C                     MOVELER,5      MSG
     C                     GOTO STEP3
     C                     END
     C                     END
      *
     C           BSYO      CABEQ'A0'      STEP8
     C           BSYO      CABEQ'D1'      STEP8
     C           BSYO1     CABEQ'QPGMR'   STEP8
     C           TANT7     CABEQ'QPGMR  ' STEP8
     C           TANT7     CABEQ'QSECOFR' STEP8
     C           TANT7     CABEQ'QSYSOPR' STEP8
      *
     C                     SETOF                     1314
     C           RBAN      COMP '003'                13
     C           PGMN      COMP 'EGBC01'                 14
     C  N14      PGMN      COMP 'EGBC02'                 14
     C  N14      PGMN      COMP 'EGBC03'                 14
     C  N14      PGMN      COMP 'FGBC01'                 14
      *
     C           *IN13     IFEQ '1'
     C           *IN14     IFEQ '1'
     C                     SETON                     99
     C                     MOVELER,24     MSG
     C                     GOTO STEP3
     C                     END
     C                     END
      *
     C           STEP8     TAG
     C           KEY11     SETLLEGBPL111
      *
     C           STEP77    TAG
     C                     SETOF                     0615
     C           KEY11     READEEGBPL111                 06
     C           *IN06     IFEQ '0'
     C           FSKJY     CABEQ'D'       STEP77
     C           TANT      CABNEFUSRC     STEPAA
      *
     C           PGMN      IFEQ FPGMN
     C           PGMN4     CABEQ'MENU'    STEP77
     C                     MOVE DAN       CDAN    10
     C                     MOVE MENU      CMNO    20
     C           FMNNO     COMP CMNO                     15
     C           FMNDN     COMP CDAN                     17
      *
      * %0001 TUCKER
     C           FMNNO     MULT 10        WNUM1   30
     C           WNUM1     ADD  FMNDN     WNUM1   30
     C                     MOVE WNUM1     WNUM2   3
     C  N06N17
     CORN06N15             SETON                     99
     C   99                MOVELER,20     WMSG   50
     C           WMSG      CAT  WNUM2:0   WMSG
     C   99                MOVELWMSG      MSG
     C   99                GOTO STEP3
     C                     END
     C                     END
      *
     C           STEPAA    TAG
      *
     C  NKF                GOTO STEP6
      *
     C           PMENU     CABEQ'MENU'    STEP6
      *
     C           PGMN      CHAINEGBPL141             99
     C           *IN99     IFEQ '1'
     C                     MOVE *BLANK    TEXT
     C                     MOVE *BLANK    KNJI
     C                     MOVELER,26     MSG
     C                     GOTO STEP3
     C                     END
      *
     C           TEXT      IFEQ *BLANK
     C                     MOVE MPTEXT    TEXT
     C                     END
      *
     C           KNJI      IFEQ *BLANK
     C                     END
      *
      *
     C           STEP10    TAG
      *
     C           STEP6     TAG
     C                     SETOF                     03
     C           TEXT      IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,17     MSG
     C                     GOTO STEP3
     C                     END
      *
     C           *IN14     IFEQ '1'
     C           KIMT      IFNE 'M'
     C                     MOVELER,25     MSG
     C                     GOTO STEP3
     C                     END
     C                     END
      *
     C           KIMT      IFNE 'M'
     C           KIMT      IFNE *BLANK
     C                     SETON                     99
     C                     MOVELER,18     MSG
     C                     GOTO STEP3
     C                     END
     C                     END
      *っ
     C           STEP11    TAG
      *
     C   KE                GOTO STEP2
      *
     C                     GOTO STEP3
      *
     C           STEP2     TAG
     C           *IN10     IFEQ '0'
     C                     MOVE TANT      M1USRC
     C                     MOVE MENU      M1MNNO
     C                     MOVE DAN       M1MNDN
     C                     MOVE PGMN      M1PGMN
     C                     MOVE TEXT      M1TEXT
     C*                    MOVE KNJI      M1KNJI
     C                     MOVE KIMT      M1KIMT
     C                     MOVE *BLANK    M1SKJY
     C                     ELSE
     C                     MOVE 'D'       M1SKJY
     C                     END
      *
     C                     MOVE *DATE     KOHIZK
     C   12                Z-ADD0         SAHIZK
      *
JW2  C   10                MOVEL'DLT '    LTR10  10
 .   C   11                MOVEL'CHG '    LTR10
 .   C   12                MOVEL'ADD '    LTR10
 .   C                     MOVEL#USER     #USR6   6
 .   C                     MOVE #USR6     LTR10
 .   C                     MOVELLTR10     LTR20  20
 .   C                     MOVE #WSID     LTR20
 .   C           *IN12     IFEQ *OFF                       DLT/UPD
 .   C                     MOVELLTR20     M1KNJI
 .   C                     ELSE
 .   C                     MOVE LTR20     M1KNJI    P      ADD
 .   C                     Z-ADDTODAY     SAHIZK
JW2  C                     ENDIF
      *
     C   02N10             WRITEEGBPL121
     C  N02N10             UPDATEGBPL121
     C  N02 10             DELETEGBPL121
      *
     C                     MOVE MENT      MENTA
     C                     MOVE TANT      TANTA
     C                     MOVE UMNO      UMNOA
     C                     MOVE PGMN      PGMNA
     C  N80                MOVE *BLANK    MENT
     C  N80                MOVE *BLANK    CMNT
     C  N80                MOVE *BLANK    MENU
     C  N80                MOVE *BLANK    DAN
     C  N80                MOVE *BLANK    TANT
     C                     GOTO STEP1
      *
     C           END       TAG
     C                     SETON                     LR
JW2  C                     RETRN
**
E-01 YOU DO NOT HAVE AUTHORITY TO UPDATE MENU
E-02 SELECT 0, 1 OR 2 FOR UPDATE INSTRUCTION
E-03 ENTER PGM NAME
E-04 1ST CHARACTER OF PGM NAME IS INVALID
E-05 4TH CHARACTER OF PGM NAME IS INVALID
E-06 ENTER TEAM MEMBER CODE
E-07 TEAM MEMBER CODE MUST BE 5 CHARACTERS
E-08 DATA DOES NOT EXIST, 0(CANCEL) WAS IGNORED
E-09 DATA DOES NOT EXIST, 1(CHANGE) WAS IGNORED
E-10 DATA WAS ALREADY CANCELLED, 0(CANCEL) WAS IGNORED
E-11 DATA WAS ALREADY CANCELLED, 1(CHANGE) WAS IGNORED
E-12 DATA ALREADY EXISTS, 2(ADD) WAS IGNORED
E-13 1ST CHARACTER OF TEAM MEMBER CODE MUST BE AN ALPHABET
E-14 TEAM MEMBER'S DEPARTMENT IS INVALID
E-15 FIRST 2 NUMBER OF MENU-NO IS INVALID
E-16 3RD NUMBER OF MENU-NO IS INVALID
E-17 ENTER MENU TEXT
E-18 ENTER M OR BLANK FOR SECURITY
E-19 3RD TO 5TH CHARACTER OF TEAM MEMBER CODE IS INVALID
E-20 THIS USER ALREADY HAS THE PGM AT #
E-21 MENU NO IS TOO SMALL
E-22 MENU NO IS TOO LARGE
E-23 TEAM MEMBER CODE IS INVALID
E-24 UPDATE OF TEAM MEMBER CODE WAS IGNORED
E-25 ENTER SECURITY FOR THIS PROGRAM
E-26 PROGRAM NAME CANNOT COPY
E-27 PGM NAME DOES NOT EXIST
E-28
