     H            Y.
     F** YA010R ****************************
     F* ソースの編集履歴取得　　　　　　 *
     F*  CREATE SOURCE PROGRAM COMPILE LOG *
     F*    Y.MAEDA           2012/06/09    *
     F**************************** YA001R **
     F*YA002L0 IF  E           K        DISK
     FAJFPP90 O   E                    DISK
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 K#WSID
     I                                      254 263 K#USER
     I                                      264 269 K#JBNO
     I            DS
     I                                        1  140Y3OSHZ
     I                                        1   80Y3OSH8
     I                                        9  140Y3OJFB
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJIKN
     I                                        1   20WJJ
     I                                        3   40WHH
     I                                        5   60WBB
     I                                        7  140WDATE
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
     C           KEY1      KLIST
     C                     KFLD           K#USER 10
     C                     KFLD           K#WSID 10
     C                     KFLD           K#JBNO  6
      *
     C           *ENTRY    PLIST
     C                     PARM           PLIB   10
     C                     PARM           PSRC   10
     C                     PARM           PPGM   10
     C                     PARM           PSYORI  1
      *
     C                     TIME           WTIME
      *
     C                     CLEARYA003P01
      *
     C                     Z-ADDWYY       Y3GKYY
     C                     Z-ADDWMM       Y3GKMM
     C                     Z-ADDWDD       Y3GKDD
     C                     Z-ADDWJJ       Y3GKJI
     C                     Z-ADDWHH       Y3GKHU
     C                     MOVELW$PGM     Y3GKPG
     C                     MOVELK#USER    Y3GKNM
      *
     C*                    SETOF                     12
     C*          KEY1      SETGTYA002L01             12
      *
SDO  C*                    DO   *HIVAL
     C*          KEY1      REDPEYA002L01                 12
     C*  12                LEAVE
      *
     C*          Y2GSKD    IFEQ 'D'
     C*                    ITER
     C*                    END
      *
     C*                    MOVELY2TANT    Y3TANT
     C*                    MOVELY2TAMI    Y3TAMI
     C*                    MOVELY2TAM2    Y3TAM2
     C*                    MOVELY2SUSR    Y3SUSR
     C*                    MOVELY2WSID    Y3WSID
     C*                    MOVELY2JONO    Y3JONO
     C*                    Z-ADDY2SLJI    Y3SLJI
      *
EDO  C*                    ENDDO
      *
     C                     MOVELK#USER    Y3SUSR
     C                     MOVELK#WSID    Y3WSID
     C                     MOVELK#JBNO    Y3JONO
      *
     C                     MOVELPLIB      Y3SLIB
     C                     MOVELPSRC      Y3SFIL
     C                     MOVELPPGM      Y3SMBR
     C                     Z-ADDWDATE     Y3OSH8
     C                     Z-ADDWJIKN     Y3OJFB
     C                     MOVELPSYORI    Y3OPER
      *
     C                     WRITEYA003P01
      *
     C                     SETON                     LR
     C                     RETRN
