     H            Y.                                                      DAD000
     F** AJHR85 *************************************
     F* FA M/F FOR 2ND PROC FROM CADPP01            *
     F* C:T.SAKAKI        2020.09.21                *
     F***********************************************
     FCADTL03 IP  E                    DISK
     FAJHPPTB IT  F      22           EDISK
     FAJHPP80 O   E                    DISK
      *
     E                    JKT         3  2
     E***                 SCD     1  13  2
     E    AJHPPTB         TB1     1  50  2   TB2     1
      *
     I            DS
     I                                        1   6 JKT
     I                                        1   2 C2SJK1
     I                                        3   4 C2SJK2
     I                                        5   6 C2SJK3
     I            DS
     I                                        1   7 JHMEKA
     I                                        1   4 JHMEK1
     I                                        5   6 JHMEK2
     I                                        7   7 JHMEK3
     I            DS
     I                                        1  140WTIME
     I                                        1   20WTITH
     I                                        3   40WTITM
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      ****************************************************
      *  MAIN
      ****************************************************
     C*
     C           *IN04     IFEQ *OFF
     C                     TIME           WTIME
     C                     SETON                     04
     C                     ENDIF
     C*
     C           C2SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
     C*有効日・失効日のチェック*
     C           C2UKHZ    IFLE *DATE
     C           C2STHZ    ANDGT*DATE
     C                     ELSE
     C                     GOTO @END
     C                     END
      *
      * 2ND PROC CONDITION CODE EXSIST?
     C                     SETOF                     77
     C           1         DO   3         CT      20
     C           JKT,CT    IFNE *BLANK
     C           JKT,CT    LOKUPTB1                      77
     C                     ENDIF
     C  N77                ENDDO
     C           *IN77     IFEQ '0'
     C                     GOTO @END
     C                     END
      *
     C                     EXSR #MOVE
      *
     C                     WRITEAJHPP801
      *
     C           @END      TAG
      *-----------------------------------------------------
     C           #MOVE     BEGSR
     C                     MOVE *BLANK    JHSKJY
     C                     Z-ADD0         JHSKYY
     C                     Z-ADD0         JHSKMM
     C                     Z-ADD0         JHSKDD
     C                     Z-ADDWTIYY     JHKOYY
     C                     Z-ADDWTIMM     JHKOMM
     C                     Z-ADDWTIDD     JHKODD
     C                     Z-ADDWTITH     JHKOHH
     C                     Z-ADDWTITM     JHKOSS
     C                     MOVEL'AJHR85'  JHKOME
     C                     MOVEL*BLANK    JHMENT
     C                     MOVELC2ZETI    JHZETI
     C                     MOVELC2SHN1    JHSHN1
     C                     MOVELC2SHN2    JHSHN2
     C                     MOVELC2SHN3    JHSHN3
     C                     Z-ADDC2SYOS    JHNSYU
     C                     MOVELC2SYOT    JHNHKS
     C                     Z-ADDC2SYOS    JHOSYU
     C                     MOVELC2SYOT    JHOHKS
     C                     Z-ADDC2UKYY    JHSKIY
     C                     Z-ADDC2UKMM    JHSKIM
     C                     Z-ADDC2UKDD    JHSKID
     C                     Z-ADD0         JHTANJ
     C                     MOVELC2MEKI    JHMEKA
     C                     Z-ADD0         JH21CD
     C                     MOVEL*BLANK    JH21M1
     C                     MOVEL*BLANK    JH21M2
     C                     Z-ADDC2BMON    JH22CD
     C                     MOVELC2SJK1    JH22K1
     C                     MOVELC2SJK2    JH22K2
     C                     MOVELC2SJK3    JH22K3
     C                     MOVELC2NJK1    JHNS11
     C                     MOVELC2NJK2    JHNS21
     C                     MOVELC2NJK3    JHNS22
     C                     MOVELC2NJK4    JHNS23
     C                     MOVELC2KCD1    JHKDAI
     C                     MOVELC2KCD2    JHKSYO
     C                     MOVE *BLANK    JHMKBN
     C                     Z-ADDC2BARA    JHBAB1
     C                     Z-ADDC2BARB    JHBAB2
     C                     Z-ADD0         JHMSKB
     C                     Z-ADD0         JHMSKE
     C                     MOVE *BLANK    JHMSKJ
     C                     Z-ADD0         JHMSWS
     C                     Z-ADD0         JHMSNT
     C                     MOVEL*BLANK    JHMSNS
     C                     MOVEL*BLANK    JHMSZK
     C                     Z-ADD0         JHMSMA
     C                     MOVEL*BLANK    JHMSCK
     C                     MOVEL*BLANK    JHMSAK
     C                     Z-ADD0         JHMKRI
     C                     Z-ADD0         JHMKJI
     C                     MOVEL*BLANK    JHMKSK
     C                     MOVELC2TKR1    JHNBN1
     C                     MOVELC2TKR2    JHNBN2
     C                     MOVELC2TKR3    JHNBN3
     C                     MOVELC2TKR4    JHNBN4
     C                     MOVELC2TKR1    JHOBN1
     C                     MOVELC2TKR2    JHOBN2
     C                     MOVELC2TKR3    JHOBN3
     C                     MOVELC2TKR4    JHOBN4
     C                     Z-ADDC2UKYY    JHBKIY
     C                     Z-ADDC2UKMM    JHBKIM
     C                     Z-ADDC2UKDD    JHBKID
     C                     Z-ADD0         JHKANS
     C                     Z-ADD0         JHHHAK
     C                     MOVE *BLANK    JHNOP
     C                     Z-ADDC2KALL    JHKALL
     C                     Z-ADDC2KMIN    JHKMIN
     C                     Z-ADDC2KMAX    JHKMAX
     C                     Z-ADDC2SRMS    JHSRMS
     C                     MOVELC2SJK1    JHJOK1
     C                     MOVELC2SJK2    JHJOK2
     C                     MOVELC2SJK3    JHJOK3
     C                     MOVELC2NJK1    JHJOK4
     C                     MOVELC2NJK2    JHJOK5
     C                     MOVELC2NJK3    JHJOK6
     C                     MOVELC2KTR1    JHMTK1
     C                     MOVELC2KTR2    JHMTK2
     C                     MOVELC2KTR3    JHMTK3
     C                     MOVELC2KTR4    JHMTK4
     C                     Z-ADD0111      JHMAKB
     C                     MOVEL'A'       JHMTYP
     C                     MOVEL'JC'      JHATOK
     C                     Z-ADDC2BMON    JHATOB
     C                     MOVEL'A'       JHATYP
     C                     MOVELC2RAIN    JHRAIN
     C                     Z-ADDC2BARA    JHBARA
     C                     Z-ADDC2BARB    JHBARB
     C                     Z-ADD0         JHCBKO
     C                     Z-ADD1         JHYOSI
     C                     ENDSR
      ********************************************
      ** SCD    **DELETED ON 09/21/2020
     **  LG             LUBE GREEN
     **  D3             AR8133
     **  DR             SAFETY DRAW 711                                711
     **  LC             LUBE CLEAR
     **  KW             WASHING
     **  M1             RED
     **  TN             TNT15
     **  JL             JL BLACK
     **  MF             M-CON F
     **  AQ             AQUASAFE614
     **  V9             PROT.A09
     **  VB             PROT.A20
     **  JB             JL BLUE
