     H            Y.
     F** AJHR15 *************************************
     F*FA M/F FOR PLATING(PERSONAL COMPUTER LAYOUT) *
     F* C:T.SAKASHITA           2006.11.22          *
     F***********************************************
     FAJHPL01 UP  E           K        DISK
     FAAHTL06 IF  E           K        DISK
     FAJHWP15 O   F     147            DISK
     I            DS
     I                                        1   4 JHMEK1
     I                                        1   2 MEK12
     I                                        1   1 MEK1
     I                                        2   2 MEK2
     I                                        3   3 MEK3
     I                                        4   4 MEK4
     I            DS
     I                                        1   40JHSKIY
     I                                        3   40J@SKIY
     I            DS
     I                                        1   40JHBKIY
     I                                        3   40J@BKIY
     I            DS
     I                                        1   40JHKOYY
     I                                        3   40J@KOYY
     C           *ENTRY    PLIST
     C                     PARM           TVMENT  1
     C                     MOVE TVMENT    MENT    1
     C*
     C           *IN05     IFEQ '0'
     C                     SETON                     05
     C           MENT      IFEQ '2'
     C                     EXCPTCLR
     C                     END
     C                     END
     C*
     C           JHSKJY    IFEQ 'D'
     C                     GOTO END
     C                     END
     C****************************************
     C*ＦＡの品番がメッキに無い時ＦＡを削除*
     C****************************************
     C           KEY1      KLIST
     C                     KFLD           JHSHN1
     C                     KFLD           JHSHN2
     C                     KFLD           JHSHN3
     C**********************************************************
     C*引き取りかんばんからＦＡマスターの未使用品番をチェック*
     C**********************************************************
     C           KEY1      SETLLAAHTL061
     C                     SETOF                     10
     C           MELOOP    TAG
     C           KEY1      READEAAHTL061                 10
     C           *IN10     IFEQ '1'
     C                     MOVE 'D'       JHSKJY
     C                     Z-ADD*YEAR     JHSKYY
     C                     Z-ADDUMONTH    JHSKMM
     C                     Z-ADDUDAY      JHSKDD
     C                     MOVEL'AJHR15'  JHKOME
     C                     MOVE '0'       JHMENT
     C                     UPDATAJHPL011
     C                     GOTO END
     C                     ELSE
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    IFLE *DATE
     C                     GOTO MELOOP
     C                     END
     C                     END
     C                     END
     C*有効日・失効日のチェック*
     C           L6UKHZ    IFLE *DATE
     C           L6STHZ    ANDGT*DATE
     C                     ELSE
     C                     GOTO MELOOP
     C                     END
     C*引き取りかんばんマスターに有りの時ＯＫ*
     C                     GOTO OK
     C***********************************************************
     C* xｮgに有る時ファイル出力*
     C***********************************************************
     C           OK        TAG
     C*
     C           ALLKEN    ADD  1         ALLKEN  60
     C*
     C* * *      MEK2      IFEQ 'A'
     C           AENKEN    ADD  1         AENKEN  60
     C* * *                ELSE
     C* * *      NANKEN    ADD  1         NANKEN  60
     C* * *                GOTO END
     C* * *                END
     C*
     C           DKTKEN    ADD  1         DKTKEN  60
     C                     EXCPTDAT
     C           END       TAG
     OAJHWP15 E                DAT
     O                         JHMENT     1
     O                         JHZETI     5
     O                         JHSHN1    10
     O                         JHSHN2    15
     O                         JHSHN3    17
     O                         JHNSYU    22
     O                         JHNHKS    23
     O                         JHOSYU    28
     O                         JHOHKS    29
     O                         JHSKIY    33
     O                         JHSKIM    35
     O                         JHSKID    37
     O                         JHTANJ    44
     O                         JHMEK1    48
     O                         JHMEK2    50
     O                         JHMEK3    51
     O                         JH21CD    55
     O                         JH21M1    57
     O                         JH21M2    59
     O                         JH22CD    63
     O                         JH22K1    65
     O                         JH22K2    67
     O                         JH22K3    69
     O                         JHNS11    71
     O                         JHNS21    73
     O                         JHNS22    75
     O                         JHNS23    77
     O                         JHKDAI    78
     O                         JHKSYO    79
     O                         JHMKBN    82
     O                         JHBAB1    84
     O                         JHBAB2    87
     O                         JHMSKB    91
     O                         JHMSKE    93
     O                         JHMSKJ    95
     O                         JHMSWS    96
     O                         JHMSNT    97
     O                         JHMSNS    98
     O                         JHMSZK   100
     O                         JHMSMA   103
     O                         JHMSCK   104
     O                         JHMSAK   106
     O                         JHMKRI   109
     O                         JHMKJI   112
     O                         JHMKSK   113
     O                         JHNBN1   114
     O                         JHNBN2   116
     O                         JHNBN3   118
     O                         JHNBN4   119
     O                         JHOBN1   120
     O                         JHOBN2   122
     O                         JHOBN3   124
     O                         JHOBN4   125
     O                         JHBKIY   129
     O                         JHBKIM   131
     O                         JHBKID   133
     O                         JHKANS   136
     O                         JHHHAK   139
     O                         JHKOYY   143
     O                         JHKOMM   145
     O                         JHKODD   147
     O        E                CLR
     O                                    1 '2'
