     H            Y
     F**AJSR1Z ********************************************************
     F*<IN>品番＋手配番号＋発行日--> <OUT>計量日＋計量時刻        *
     F*                                                               *
     F*  14.06.23 KIRI                                                *
     F*****************************************************************
      * JC LOADING                    RESULTS FILES. *
     FAJHPL11 IF  E           K        DISK
      *===============================================================
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     **かんばん発行日
     I            DS
     I                                        1   80W$HTHZ
     I                                        1   40W$HTYY
     I                                        5   60W$HTMM
     I                                        7   80W$HTDD
     **
     I            DS
     I                                        1   80JCSKHZ
     I                                        1   40JCSKYY
     I                                        5   60JCSKMM
     I                                        7   80JCSKDD
     **計量日
     I            DS
     I                                        1   80JCKEHZ
     I                                        1   40JCKEIY
     I                                        5   60JCKEIM
     I                                        7   80JCKEID
     **計量時刻
     I            DS
     I                                        1   60JCKETM
     I                                        1   20JCKEIJ
     I                                        3   40JCKEIF
     I                                        5   60JCKEIB
     I            DS
     I                                        1   80JCWKHZ
     I                                        1   40JCWINY
     I                                        5   60JCWINM
     I                                        7   80JCWIND
     I            DS
     I                                        1   60JCWKTM
     I                                        1   20JCWINJ
     I                                        3   40JCWINF
     I                                        5   60JCWINB
     **
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *===============================================================
     C           *ENTRY    PLIST
     C*                                IN ------
     C                     PARM           P@HIN1  5        PART NUMBER 1
     C                     PARM           P@HIN2  5        PART NUMBER 2
     C                     PARM           P@HIN3  2        PART NUMBER 3
     C                     PARM           P@THAI  3        PRODUCTION ORDER
     C                     PARM           P@HTHZ  80       KANBAN PUBLICATION
     C*                               OUT ------
     C                     PARM           P@KEHZ  80       WEIGHING DATE
     C                     PARM           P@KETM  60       WEIGHING TIME
     C*------------------------*
     C*   KLIST の作成       *
     C*------------------------*
     C           #KEY1     KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
     C                     KFLD           W$HTYY  40       KANBAN PUBLICATION Y
     C                     KFLD           W$HTMM  20       KANBAN PUBLICATION M
     C                     KFLD           W$HTDD  20       KANBAN PUBLICATION D
     C           #KEY11    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C******               KFLD           P@THAI  3        PRODUCTION ORDER
      *===============================================================
     C                     Z-ADDP@HTHZ    W$HTHZ           KANBAN PUBLICATION
     C                     Z-ADD0         P@KEHZ  80       WEIGHING DATE
     C                     Z-ADD0         P@KETM  60       WEIGHING TIME
     C                     MOVEL'0'       GET     1
     C           #KEY11    SETGTAJHPL11
     C*
     C           #KEY11    REDPEAJHPL11                  90
     C*
     C           *IN90     DOWEQ*OFF
     C           GET       ANDEQ'0'
     C           JCSKJY    IFEQ 'D'
     C           JCSKHZ    ANDLE*DATE
     C                     ELSE
     C           JCTHAI    IFEQ P@THAI
     C           JCWKHZ    ANDGEW$HTHZ
     C                     MOVEL'1'       GET     1
     C                     Z-ADDJCWKHZ    P@KEHZ  80       WEIGHING DATE
     C                     Z-ADD0         JCWINB
     C                     Z-ADDJCWKTM    P@KETM  60       WEIGHING TIME
     C                     ENDIF
     C                     ENDIF
     C           #KEY11    REDPEAJHPL11                  90
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
