     H            Y.
     FAJHPWS6 CF  E                    WORKSTN
     FAJHPPS1 UF  E           K        DISK                      A
     FAJHWPS1 O   E           K        DISK                      A
      *
     E                    ER      1   8 60
      *
     I           SDS
     I                                     *PROGRAM S@PGID
     I                                      244 253 S@WSID
     I                                      254 263 S@USID
     I                                      264 269 S@JBID
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        7  140WTIHZ
      *
     C           *ENTRY    PLIST
     C                     PARM           P@KOTE  3
     C                     PARM           WORKER  6
      *
     C                     MOVELP@KOTE    PROC
     C                     Z-ADD0         CONT
      *
     C           @DSP01    TAG
      *
     C                     EXFMTDSP01
     C                     SETOF                     30
     C                     MOVEL*BLANK    MSG
      *
     C           *IN03     IFEQ '1'
     C                     GOTO @END
     C                     END
      *
     C           BARC      IFEQ *BLANK
     C                     SETON                     30
     C                     MOVELER,01     MSG
     C                     GOTO @DSP01
     C                     END
      *
     C                     MOVELBARC      P@APCS 15
     C                     CALL 'BARR82'
     C                     PARM           P@APCS 15
     C                     PARM           P@OKNG  2
     C           P@OKNG    IFNE 'OK'
     C                     SETON                     30
     C                     MOVELER,02     MSG
     C                     GOTO @DSP01
     C                     END
      *
     C                     MOVELP@KOTE    K@KOTE  3
     C                     MOVELBARC      K@BARC 20
     C           KEY       KLIST
     C                     KFLD           K@KOTE  3
     C                     KFLD           K@BARC 20
      *
     C           KEY       CHAINAJHPPS1              77
     C           *IN77     IFEQ '0'
     C           JDSKJY    IFEQ ' '
     C                     SETON                     30
     C                     MOVELER,03     MSG
     C                     GOTO @DSP01
     C                     END
     C                     END
      *
      * only write to file if program doesn't find in JC result files
      *   if RTN is blank, part/lot/page was not found, so write...
      *
     C                     CALL 'AJHRS1'
     C                     PARM           BARC
     C                     PARM           RTN     1
     C                     PARM           P@WINY  40
     C                     PARM           P@WINM  20
     C                     PARM           P@WIND  20
     C                     PARM           P@WINJ  20
     C                     PARM           P@WINF  20
     C                     PARM           P@WMJY  20
     C                     PARM           P@MKKB  2
      *
     C           RTN       IFEQ *BLANK
      *
     C                     TIME           WTIME
      *
     C                     MOVE *BLANK    JDSKJY
     C                     Z-ADD0         JDSKDT
     C                     Z-ADDWTIHZ     JDKODT
     C                     Z-ADDWJFB      JDKOTM
     C                     MOVELS@PGID    JDKOPG
      *
     C                     MOVELS@WSID    JDWSID
     C                     MOVELS@USID    JDKOME
     C                     MOVE S@JBID    JDJOBN
      *
     C                     MOVELWORKER    JDWOKR
      *
     C                     MOVELP@KOTE    JDKOTE
     C                     MOVELBARC      JDBARC
      *
     C   77                WRITEAJHPPS11
     C  N77                UPDATAJHPPS11
      *
      * add to workfile for reporting...
     C   77                WRITEAJHWPS11
      *
     C                     ADD  1         CONT
      *
     C                     ENDIF
      *
     C                     GOTO @DSP01
      *
     C           @END      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
** ER
READ
BARCODE ERROR
ALREADY SCANNED
