     H            Y.                                                      DAD000
     F** AJHR40 **************************************************
     F* CREATE FA M/F FOR 2ND
     F* PART WITHDRAWAL KANBAN M/F
     F* C:T.SAKASHITA          2006.11.22
     F* ---------------------------------------------------------
JW1  F* JW     2018.06.11 ADD  PASS 20180618 (EFFECTIVE DATE)
     F************************************************************
     FAAHTL06 IF  E           K        DISK
     FAJHPL01 IF  E           K        DISK
     FAJHWP40 O   E                    DISK                      A
      *
     C************************************
     C*引き取りかんばんマスターの読込み*
     C************************************
     C           *LOVAL    SETLLAAHTL061
     C                     SETOF                     10
SDO  C                     DO   *HIVAL
     C                     READ AAHTL061                 10
     C   10                LEAVE
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     END
     C*有効日・失効日のチェック*
      *
JW1   * TEMP1 - IF JBD, THEN ITER
 |   C           L6JOK1    IFEQ 'JB'
 |   C           *DATE     ANDEQ20180618
 |   C                     ITER
JW1  C                     ENDIF
      *
JW1   * TEMP2 - IF PART=U1219-B4031, THEN ITER
 |   C           L6SHN1    IFEQ 'U1219'
 |   C           L6SHN2    ANDEQ'B4031'
 |   C           *DATE     ANDEQ20180618
 |   C                     ITER
JW1  C                     ENDIF
      *
     C           L6UKHZ    IFLE *DATE
     C           L6STHZ    ANDGT*DATE
     C                     ELSE
     C                     ITER
     C                     END
      *
     C           L6SHN1    IFEQ '90119'
     C           L6SHN2    ANDEQ'A0085'
     C                     Z-ADD0         SAKA    40
     C                     END
     C**********************************
     C*    ＦＡマスターにチェイン    *
     C**********************************
     C                     SETOF                     99
     C           KEY1      KLIST
     C                     KFLD           L6SHN1
     C                     KFLD           L6SHN2
     C                     KFLD           L6SHN3
     C           KEY1      SETLLAJHPL011
     C                     SETOF                     20
SDO  C                     DO   *HIVAL
     C           KEY1      READEAJHPL011                 20
     C*引けない*
     C   20                SETON                     99
     C   20                LEAVE
     C*引ける*
     C           JHSKJY    IFEQ 'D'
     C           JHSKHZ    IFLE *DATE
     C                     ITER
     C                     END
     C                     END
     C                     LEAVE
EDO  C                     ENDDO
     C**********************************
     C*         更新区分入力         *
     C**********************************
     C           *IN99     IFEQ '1'
     C                     MOVE '0'       UPKBN   1
     C                     MOVE ' '       SYKBN   1
     C                     Z-ADD0         JISEN   31
     C                     ELSE
     C                     MOVE '1'       UPKBN
     C                     MOVE JHMKSK    SYKBN
     C                     Z-ADDJHMKJI    JISEN
     C                     END
     C*
     C                     WRITEAJHWP401
EDO  C                     ENDDO
     C**************************
     C*         終了         *
     C**************************
     C           MEKEND    TAG
     C                     SETON                     LR
     C                     RETRN
