     H            Y/
     F******************************************************
     F* ADD A-PICS KANBAN KIND                             *
     F* T.SAKAKI           2019.04.18                      *
     F******************************************************
     FAJJWP01 UP  F     512            DISK
     FAGAPL31 IF  E           K        DISK
     FAGAWL31 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
      *
     IAJJWP01 AA  01
     I                                        1 512 DATA
     I                                        6  10 HIN1
     I                                       11  15 HIN2
     I                                       16  17 HIN3
      *
     I            DS
     I                                        1   7 A2MEKA
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTIJJ
     I                                        3   40WTIHH
     I                                        5   60WTIBB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     C******************************************************
     C*      MAIN                                          *
     C******************************************************
     C                     TIME           WTIME
      *
     C           KEYHIN    KLIST
     C                     KFLD           WHIN1   5
     C                     KFLD           WHIN2   5
     C                     KFLD           WHIN3   2
      *
     C                     MOVELHIN1      WHIN1   5
     C                     MOVELHIN2      WHIN2   5
     C                     MOVELHIN3      WHIN3   2
      *
     C                     SETOF                     88
     C           KEYHIN    CHAINAGAPL31              88
     C           *IN88     IFEQ '0'
     C           CBSKJY    IFEQ 'D'
     C           CBSKHZ    ANDLEWTIHZ
     C                     SETON                     88
     C                     ELSE
     C                     MOVELCBKDAI    WKDAI   1
     C                     ENDIF
     C                     ENDIF
      *****
     C           *IN88     IFEQ '1'
     C           KEYHIN    CHAINAGAWL31              89
     C           *IN89     IFEQ '0'
     C           WBSKJY    IFEQ 'D'
     C           WBSKHZ    ANDLEWTIHZ
     C                     SETON                     89
     C                     ELSE
     C                     MOVELWBKDAI    WKDAI   1
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVEL*BLANK    WMEKI   7
     C                     SETOF                     90
     C           KEYHIN    CHAINFCEPL01              90
     C           *IN90     IFEQ '0'
     C           A2GSKD    ANDEQ*BLANK
     C                     MOVELA2MEKA    WMEKI
     C                     ENDIF
     C*
     C                     EXCPTODAT
      *
      *
     OAJJWP01 E                ODAT
     O                         WMEKI     51
     O                         WKDAI     78
