     H            Y.
     F** AJNR00 **************************************
     F* ON-TIME DELIVERY RATE INQUIRY (STAGNATION)   *
     F*       SAKAKI.       2019.09.30               *
     F************************************************
     FAJNPW00 CF  E                    WORKSTN
     FAJNWP00 IF  E           K        DISK                           UC
     FAJNPP05 IF  E           K        DISK
     E                    ER      1  19 65
     E                    HH          6  4 0
     E                    HH1         6  4 0
     E                    HH2         6  4 0
     E                    HH3         6  4 0
     E                    HH4         6  4 0
     E                    HH5         6  4 0
     E                    HH6         6  4 0
     E                    HH7         6  4 0
     E                    OK          6  5 2
     E                    OK1         6  5 2
     E                    OK2         6  5 2
     E                    OK3         6  5 2
     E                    OK4         6  5 2
     E                    OK5         6  5 2
     E                    OK6         6  5 2
     E                    OK7         6  5 2
     E                    HK          6  6 0
     E                    HK1         6  6 0
     E                    HK2         6  6 0
     E                    HK3         6  6 0
     E                    HK4         6  6 0
     E                    HK5         6  6 0
     E                    HK6         6  6 0
     E                    HK7         6  6 0
      *
     I            DS
     I                                        1  240HH
     I                                        1   40D1HH01
     I                                        5   80D1HH02
     I                                        9  120D1HH03
     I                                       13  160D1HH04
     I                                       17  200D1HH05
     I                                       21  240D1HH06
      *
     I            DS
     I                                        1  302OK
     I                                        1   52D1OK01
     I                                        6  102D1OK02
     I                                       11  152D1OK03
     I                                       16  202D1OK04
     I                                       21  252D1OK05
     I                                       26  302D1OK06
      *
     I            DS
     I                                        1  240HH1
     I                                        1   40D1H101
     I                                        5   80D1H102
     I                                        9  120D1H103
     I                                       13  160D1H104
     I                                       17  200D1H105
     I                                       21  240D1H106
      *
     I            DS
     I                                        1  240HH2
     I                                        1   40D1H201
     I                                        5   80D1H202
     I                                        9  120D1H203
     I                                       13  160D1H204
     I                                       17  200D1H205
     I                                       21  240D1H206
      *
     I            DS
     I                                        1  240HH3
     I                                        1   40D1H301
     I                                        5   80D1H302
     I                                        9  120D1H303
     I                                       13  160D1H304
     I                                       17  200D1H305
     I                                       21  240D1H306
      *
     I            DS
     I                                        1  240HH4
     I                                        1   40D1H401
     I                                        5   80D1H402
     I                                        9  120D1H403
     I                                       13  160D1H404
     I                                       17  200D1H405
     I                                       21  240D1H406
      *
     I            DS
     I                                        1  240HH5
     I                                        1   40D1H501
     I                                        5   80D1H502
     I                                        9  120D1H503
     I                                       13  160D1H504
     I                                       17  200D1H505
     I                                       21  240D1H506
      *
     I            DS
     I                                        1  240HH6
     I                                        1   40D1H601
     I                                        5   80D1H602
     I                                        9  120D1H603
     I                                       13  160D1H604
     I                                       17  200D1H605
     I                                       21  240D1H606
      *
     I            DS
     I                                        1  240HH7
     I                                        1   40D1H701
     I                                        5   80D1H702
     I                                        9  120D1H703
     I                                       13  160D1H704
     I                                       17  200D1H705
     I                                       21  240D1H706
      *
     I            DS
     I                                        1  302OK1
     I                                        1   52D1O101
     I                                        6  102D1O102
     I                                       11  152D1O103
     I                                       16  202D1O104
     I                                       21  252D1O105
     I                                       26  302D1O106
      *
     I            DS
     I                                        1  302OK2
     I                                        1   52D1O201
     I                                        6  102D1O202
     I                                       11  152D1O203
     I                                       16  202D1O204
     I                                       21  252D1O205
     I                                       26  302D1O206
      *
     I            DS
     I                                        1  302OK3
     I                                        1   52D1O301
     I                                        6  102D1O302
     I                                       11  152D1O303
     I                                       16  202D1O304
     I                                       21  252D1O305
     I                                       26  302D1O306
      *
     I            DS
     I                                        1  302OK4
     I                                        1   52D1O401
     I                                        6  102D1O402
     I                                       11  152D1O403
     I                                       16  202D1O404
     I                                       21  252D1O405
     I                                       26  302D1O406
      *
     I            DS
     I                                        1  302OK5
     I                                        1   52D1O501
     I                                        6  102D1O502
     I                                       11  152D1O503
     I                                       16  202D1O504
     I                                       21  252D1O505
     I                                       26  302D1O506
      *
     I            DS
     I                                        1  302OK6
     I                                        1   52D1O601
     I                                        6  102D1O602
     I                                       11  152D1O603
     I                                       16  202D1O604
     I                                       21  252D1O605
     I                                       26  302D1O606
      *
     I            DS
     I                                        1  302OK7
     I                                        1   52D1O701
     I                                        6  102D1O702
     I                                       11  152D1O703
     I                                       16  202D1O704
     I                                       21  252D1O705
     I                                       26  302D1O706
      *
     I            DS
     I                                        1  360HK
     I                                        1   60D1HK01
     I                                        7  120D1HK02
     I                                       13  180D1HK03
     I                                       19  240D1HK04
     I                                       25  300D1HK05
     I                                       31  360D1HK06
      *
     I            DS
     I                                        1  360HK1
     I                                        1   60D1B101
     I                                        7  120D1B102
     I                                       13  180D1B103
     I                                       19  240D1B104
     I                                       25  300D1B105
     I                                       31  360D1B106
      *
     I            DS
     I                                        1  360HK2
     I                                        1   60D1B201
     I                                        7  120D1B202
     I                                       13  180D1B203
     I                                       19  240D1B204
     I                                       25  300D1B205
     I                                       31  360D1B206
      *
     I            DS
     I                                        1  360HK3
     I                                        1   60D1B301
     I                                        7  120D1B302
     I                                       13  180D1B303
     I                                       19  240D1B304
     I                                       25  300D1B305
     I                                       31  360D1B306
      *
     I            DS
     I                                        1  360HK4
     I                                        1   60D1B401
     I                                        7  120D1B402
     I                                       13  180D1B403
     I                                       19  240D1B404
     I                                       25  300D1B405
     I                                       31  360D1B406
      *
     I            DS
     I                                        1  360HK5
     I                                        1   60D1B501
     I                                        7  120D1B502
     I                                       13  180D1B503
     I                                       19  240D1B504
     I                                       25  300D1B505
     I                                       31  360D1B506
      *
     I            DS
     I                                        1  360HK6
     I                                        1   60D1B601
     I                                        7  120D1B602
     I                                       13  180D1B603
     I                                       19  240D1B604
     I                                       25  300D1B605
     I                                       31  360D1B606
      *
     I            DS
     I                                        1  360HK7
     I                                        1   60D1B701
     I                                        7  120D1B702
     I                                       13  180D1B703
     I                                       19  240D1B704
     I                                       25  300D1B705
     I                                       31  360D1B706
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     I              '0123456789'          C         WKCKSU
     I              X'0E0F40'             C         WKCKCH
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PCMD    2
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVE '01'      DSPSW   2
     C                     MOVEL'02'      DSPFLG  2
      * 1 DAY AGO
     C                     MOVE *DATE     QQDATE  8
     C                     MOVE '-'       QQPORM  1        + OR -
     C                     MOVE '0001'    QQDAYS  4
     C                     MOVE *BLANK    QQRDAT  8
     C                     MOVE *BLANK    QQRTN   1
     C                     CALL 'DATR1A'                   CALCULATE DATE
     C                     PARM           QQDATE  8
     C                     PARM           QQPORM  1        + OR -
     C                     PARM           QQDAYS  4
     C                     PARM           QQRDAT  8
     C                     PARM           QQRTN   1
     C                     MOVELQQRDAT    W@DAT   80
      *
     C                     Z-ADDW@DAT     D1CR1
     C                     Z-ADDW@DAT     D1CR2
      *
     C                     MOVEL*BLANK    D1DATA
     C                     EXSR #SB105
      *
     C                     MOVEL'0'       D1FILT
      *
     C                     MOVEL*BLANK    P1CR1
     C                     MOVEL*BLANK    P1CR2
     C                     MOVEL*BLANK    P1DATA
     C                     Z-ADD0         P1HH01
     C                     Z-ADD0         P1HH02
     C                     Z-ADD0         P1HH03
     C                     Z-ADD0         P1HH04
     C                     Z-ADD0         P1HH05
     C                     Z-ADD0         P1HH06
     C                     MOVEL*BLANK    PCMD
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB105    BEGSR
      *
     C                     CLEARHH1
     C                     CLEARHH2
     C                     CLEARHH3
     C                     CLEARHH4
     C                     CLEARHH5
     C                     CLEARHH6
     C                     CLEARHH7
     C                     Z-ADD1         X       20
     C           X         DOWLE7
     C                     EXSR #SB110
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB105    ENDSR
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     Z-ADD0         Y       20
     C                     MOVE X         K1TYPE  1
     C           K1TYPE    SETLLAJNPP05
     C           K1TYPE    READEAJNPP05                  20
     C           *IN20     DOWEQ'0'
     C           CNSKJY    IFEQ 'D'
     C           CNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         Y
     C                     SELEC
     C           K1TYPE    WHEQ '1'
     C                     Z-ADDCNHH      HH1,Y
     C           K1TYPE    WHEQ '2'
     C                     Z-ADDCNHH      HH2,Y
     C           K1TYPE    WHEQ '3'
     C                     Z-ADDCNHH      HH3,Y
     C           K1TYPE    WHEQ '4'
     C                     Z-ADDCNHH      HH4,Y
     C           K1TYPE    WHEQ '5'
     C                     Z-ADDCNHH      HH5,Y
     C           K1TYPE    WHEQ '6'
     C                     Z-ADDCNHH      HH6,Y
     C           K1TYPE    WHEQ '7'
     C                     Z-ADDCNHH      HH7,Y
     C                     ENDSL
     C                     ENDIF
     C           K1TYPE    READEAJNPP05                  20
     C                     ENDDO
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
      *
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * 1ST.                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAJNPW001
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     414243
     C                     SETOF                     444546
     C                     SETOF                     9930
     C                     SETOF                     3738
     C                     MOVEL*BLANK    D1ERR
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      * F8
     C           *IN08     IFEQ '1'
     C                     CALL 'AJNC05'
     C                     EXSR #SB105
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1DATA    IFEQ '1'
     C           D1DATA    OREQ '2'
     C           D1DATA    OREQ '3'
     C           D1DATA    OREQ '4'
     C           D1DATA    OREQ '5'
     C           D1DATA    OREQ '6'
     C           D1DATA    OREQ '7'
     C           D1DATA    OREQ '9'
     C                     ELSE
     C                     MOVELER,2      D1ERR
     C                     SETON                     3099
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1CR1     IFEQ 0
     C                     MOVELER,1      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1CR2     IFEQ 0
     C                     MOVELER,1      D1ERR
     C                     SETON                     3299
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1CR1     IFGT D1CR2
     C                     MOVELER,3      D1ERR
     C                     SETON                     313299
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1FILT    IFEQ '0'
     C           D1FILT    OREQ '1'
     C                     ELSE
     C                     MOVELER,2      D1ERR
     C                     SETON                     3899
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     CLEAROK
     C                     CLEAROK1
     C                     CLEAROK2
     C                     CLEAROK3
     C                     CLEAROK4
     C                     CLEAROK5
     C                     CLEAROK6
     C                     CLEAROK7
     C                     CLEARHK
     C                     CLEARHK1
     C                     CLEARHK2
     C                     CLEARHK3
     C                     CLEARHK4
     C                     CLEARHK5
     C                     CLEARHK6
     C                     CLEARHK7
     C                     Z-ADD0         D1O107
     C                     Z-ADD0         D1O207
     C                     Z-ADD0         D1O307
     C                     Z-ADD0         D1O407
     C                     Z-ADD0         D1O507
     C                     Z-ADD0         D1O607
     C                     Z-ADD0         D1O707
     C                     Z-ADD0         D1B107
     C                     Z-ADD0         D1B207
     C                     Z-ADD0         D1B307
     C                     Z-ADD0         D1B407
     C                     Z-ADD0         D1B507
     C                     Z-ADD0         D1B607
     C                     Z-ADD0         D1B707
      *
     C                     Z-ADD1         X
     C           X         DOWLE6
     C                     CLEARHH
     C                     SELEC
     C           X         WHEQ 1
     C                     Z-ADDHH1       HH
     C           X         WHEQ 2
     C                     Z-ADDHH2       HH
     C           X         WHEQ 3
     C                     Z-ADDHH3       HH
     C           X         WHEQ 4
     C                     Z-ADDHH4       HH
     C           X         WHEQ 5
     C                     Z-ADDHH5       HH
     C           X         WHEQ 6
     C                     Z-ADDHH6       HH
     C           X         WHEQ 7
     C                     Z-ADDHH7       HH
     C                     ENDSL
     C                     EXSR #SB211
     C           *IN99     IFEQ '1'
     C                     ADD  40        X
     C                     MOVEL'1'       *IN,X
     C                     GOTO ESB210
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     MOVELD1CR1     P1CR1
     C                     MOVELD1CR2     P1CR2
      *
     C                     MOVELD1FILT    P1FILT
      *
     C                     SELEC
      * CV
     C           D1DATA    WHEQ '1'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH1       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK1
     C                     Z-ADDHK        HK1
     C                     Z-ADDD1OK07    D1O107
     C                     Z-ADDD1OKBT    D1B107
      * BZ
     C           D1DATA    WHEQ '2'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH2       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK2
     C                     Z-ADDHK        HK2
     C                     Z-ADDD1OK07    D1O207
     C                     Z-ADDD1OKBT    D1B207
      * DS
     C           D1DATA    WHEQ '3'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH3       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK3
     C                     Z-ADDHK        HK3
     C                     Z-ADDD1OK07    D1O307
     C                     Z-ADDD1OKBT    D1B307
      * JC
     C           D1DATA    WHEQ '4'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH4       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK4
     C                     Z-ADDHK        HK4
     C                     Z-ADDD1OK07    D1O407
     C                     Z-ADDD1OKBT    D1B407
      * INSPECTION
     C           D1DATA    WHEQ '5'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH5       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK5
     C                     Z-ADDHK        HK5
     C                     Z-ADDD1OK07    D1O507
     C                     Z-ADDD1OKBT    D1B507
      * BZ/DS/JC
     C           D1DATA    WHEQ '6'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH6       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK6
     C                     Z-ADDHK        HK6
     C                     Z-ADDD1OK07    D1O607
     C                     Z-ADDD1OKBT    D1B607
      * A-PICS
     C           D1DATA    WHEQ '7'
     C                     CALL 'AJNC03'
     C                     CLEARHH
     C                     Z-ADDHH7       HH
     C                     MOVELD1DATA    P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK7
     C                     Z-ADDHK        HK7
     C                     Z-ADDD1OK07    D1O707
     C                     Z-ADDD1OKBT    D1B707
      * ALL
     C           D1DATA    WHEQ '9'
     C                     CALL 'AJNC03'
      * CV
     C                     CLEARHH
     C                     Z-ADDHH1       HH
     C                     MOVEL'1'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK1
     C                     Z-ADDHK        HK1
     C                     Z-ADDD1OK07    D1O107
     C                     Z-ADDD1OKBT    D1B107
      * BZ
     C                     CLEARHH
     C                     Z-ADDHH2       HH
     C                     MOVEL'2'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK2
     C                     Z-ADDHK        HK2
     C                     Z-ADDD1OK07    D1O207
     C                     Z-ADDD1OKBT    D1B207
      * DS
     C                     CLEARHH
     C                     Z-ADDHH3       HH
     C                     MOVEL'3'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK3
     C                     Z-ADDHK        HK3
     C                     Z-ADDD1OK07    D1O307
     C                     Z-ADDD1OKBT    D1B307
      * JC
     C                     CLEARHH
     C                     Z-ADDHH4       HH
     C                     MOVEL'4'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK4
     C                     Z-ADDHK        HK4
     C                     Z-ADDD1OK07    D1O407
     C                     Z-ADDD1OKBT    D1B407
      * INSPECTION
     C                     CLEARHH
     C                     Z-ADDHH5       HH
     C                     MOVEL'5'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK5
     C                     Z-ADDHK        HK5
     C                     Z-ADDD1OK07    D1O507
     C                     Z-ADDD1OKBT    D1B507
      * BZ/DS/JC
     C                     CLEARHH
     C                     Z-ADDHH6       HH
     C                     MOVEL'6'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK6
     C                     Z-ADDHK        HK6
     C                     Z-ADDD1OK07    D1O607
     C                     Z-ADDD1OKBT    D1B607
      * A-PICS
     C                     CLEARHH
     C                     Z-ADDHH7       HH
     C                     MOVEL'7'       P1DATA
     C                     EXSR #SB215
     C                     Z-ADDOK        OK7
     C                     Z-ADDHK        HK7
     C                     Z-ADDD1OK07    D1O707
     C                     Z-ADDD1OKBT    D1B707
      *
     C                     ENDSL
      *
     C                     MOVE '02'      DSPSW   2
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB211    BEGSR
      *
     C           D1HH01    IFEQ 0
     C           D1HH02    ANDEQ0
     C           D1HH03    ANDEQ0
     C           D1HH04    ANDEQ0
     C           D1HH05    ANDEQ0
     C**         D1HH06    ANDEQ0
     C                     MOVELER,4      D1ERR
     C                     SETON                     333435
     C                     SETON                     363738
     C                     SETON                     99
     C                     GOTO ESB211
     C                     ENDIF
      *
     C                     SETOF                     88
      *
     C           D1HH01    IFNE 0
     C           D1HH02    IFNE 0
     C           D1HH01    ANDGED1HH02
     C                     SETON                     88
     C                     ENDIF
     C           D1HH03    IFNE 0
     C           D1HH01    ANDGED1HH03
     C                     SETON                     88
     C                     ENDIF
     C           D1HH04    IFNE 0
     C           D1HH01    ANDGED1HH04
     C                     SETON                     88
     C                     ENDIF
     C           D1HH05    IFNE 0
     C           D1HH01    ANDGED1HH05
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C****
     C           D1HH02    IFNE 0
     C           D1HH03    IFNE 0
     C           D1HH02    ANDGED1HH03
     C                     SETON                     88
     C                     ENDIF
     C           D1HH04    IFNE 0
     C           D1HH02    ANDGED1HH04
     C                     SETON                     88
     C                     ENDIF
     C           D1HH05    IFNE 0
     C           D1HH02    ANDGED1HH05
     C                     SETON                     88
     C                     ENDIF
     C**         D1HH06    IFNE 0
     C**         D1HH02    ANDGED1HH06
     C**                   SETON                     88
     C**                   ENDIF
     C                     ENDIF
     C****
     C           D1HH03    IFNE 0
     C           D1HH04    IFNE 0
     C           D1HH03    ANDGED1HH04
     C                     SETON                     88
     C                     ENDIF
     C           D1HH05    IFNE 0
     C           D1HH03    ANDGED1HH05
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C***
     C           D1HH04    IFNE 0
     C           D1HH05    IFNE 0
     C           D1HH04    ANDGED1HH05
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C***
     C           D1HH05    IFNE 0
     C                     ENDIF
      *
     C           *IN88     IFEQ *ON
     C                     MOVELER,5      D1ERR
     C                     SETON                     333435
     C                     SETON                     363738
     C                     SETON                     99
     C                     GOTO ESB211
     C                     ENDIF
      *
     CSR         ESB211    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB215    BEGSR
      *
     C                     Z-ADDD1HH01    P1HH01
     C                     Z-ADDD1HH02    P1HH02
     C                     Z-ADDD1HH03    P1HH03
     C                     Z-ADDD1HH04    P1HH04
     C                     Z-ADDD1HH05    P1HH05
     C                     Z-ADDD1HH06    P1HH06
     C                     CALL 'AJNC01'
     C                     PARM           P1CR1   8
     C                     PARM           P1CR2   8
     C                     PARM           P1DATA  1
     C                     PARM           P1FILT  1
     C                     PARM           P1HH01  40
     C                     PARM           P1HH02  40
     C                     PARM           P1HH03  40
     C                     PARM           P1HH04  40
     C                     PARM           P1HH05  40
     C                     PARM           P1HH06  40
      *
     C                     CLEAROK
     C                     Z-ADD0         D1OK01  52
     C                     Z-ADD0         D1OK02  52
     C                     Z-ADD0         D1OK03  52
     C                     Z-ADD0         D1OK04  52
     C                     Z-ADD0         D1OK05  52
     C                     Z-ADD0         D1OK06  52
     C                     Z-ADD0         D1OKT   52
     C                     Z-ADD0         D1HK01  60
     C                     Z-ADD0         D1HK02  60
     C                     Z-ADD0         D1HK03  60
     C                     Z-ADD0         D1HK04  60
     C                     Z-ADD0         D1HK05  60
     C                     Z-ADD0         D1HK06  60
     C                     Z-ADD0         D1HKT   60
      *
     C                     OPEN AJNWP00
      *
     C                     Z-ADDD1HH01    K1HH01  40
     C           K1HH01    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK    54H
     C           @1OK      MULT 100       D1OK01
     C                     ADD  D1OK01    D1OKT
     C                     Z-ADDW0OKH     D1HK01
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDD1HH02    K1HH02  40
     C           K1HH02    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK      H
     C           @1OK      MULT 100       D1OK02
     C                     ADD  D1OK02    D1OKT
     C                     Z-ADDW0OKH     D1HK02
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDD1HH03    K1HH03  40
     C           K1HH03    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK      H
     C           @1OK      MULT 100       D1OK03
     C                     ADD  D1OK03    D1OKT
     C                     Z-ADDW0OKH     D1HK03
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDD1HH04    K1HH04  40
     C           K1HH04    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK      H
     C           @1OK      MULT 100       D1OK04
     C                     ADD  D1OK04    D1OKT
     C                     Z-ADDW0OKH     D1HK04
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDD1HH05    K1HH05  40
     C           K1HH05    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK      H
     C           @1OK      MULT 100       D1OK05
     C                     ADD  D1OK05    D1OKT
     C                     Z-ADDW0OKH     D1HK05
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDD1HH06    K1HH06  40
     C           K1HH06    CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C           W0ALL     IFNE 0
     C           W0OK      DIV  W0ALL     @1OK      H
     C           @1OK      MULT 100       D1OK06
     C                     ADD  D1OK06    D1OKT
     C                     Z-ADDW0OKH     D1HK06
     C                     ADD  W0OKH     D1HKT
     C                     ENDIF
     C                     ENDIF
      * OTHER
     C                     Z-ADD0         D1OK07  52
     C           100       SUB  D1OKT     D1OK07
      *
     C                     Z-ADD0         D1OKBT  60
     C           9999      CHAINAJNWP00              45
     C           *IN45     IFEQ '0'
     C                     Z-ADDW0OKH     D1OKBT
     C                     ENDIF
      *
     C                     CLOSEAJNWP00
      *
     CSR         ESB215    ENDSR
      *----------------------------------------------------*
      * 2ND.                                               *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           DSPFLG    IFEQ '02'
     C                     EXFMTAJNPW002
     C                     ELSE
     C                     EXFMTAJNPW003
     C                     ENDIF
     C                     MOVEL*BLANK    D1ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      * F9
     C           *IN09     IFEQ '1'
     C           DSPFLG    IFEQ '02'
     C                     MOVEL'03'      DSPFLG
     C                     ELSE
     C                     MOVEL'02'      DSPFLG
     C                     ENDIF
     C                     ENDIF
      * F10 (GRAPH DATA)
     C           *IN10     IFEQ '1'
     C                     CALL 'AJNC04'
     C                     ENDIF
      * F12
     C           *IN12     IFEQ '1'
     C                     CALL 'AJNC02'
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
**
ER-01 INPUT APICS ISSUE DATE.
ER-02 SELECT ERROR.
ER-03 DATE ERR. (FROM > TO)
ER-04 TIME ERROR.
ER-05 SEQUENCE ERROR.
ER-06
ER-07
ER-08
ER-09
