     H            Y.
     F** AJNR05 *********************************************
     F* ON-TIME DELIVERY RATE(TIME RANGE M/F)
     F*    SAKAKI.          2019.10.04                      *
     F*******************************************************
     FAJNPW05 CF  E                    WORKSTN
     FAJNPP05 UF  E           K        DISK                      A
     E                    ER      1  11 65
     E                    HH          6  4 0
      *
     I            DS
     I                                        1  240HH
     I                                        1   40D2HH01
     I                                        5   80D2HH02
     I                                        9  120D2HH03
     I                                       13  160D2HH04
     I                                       17  200D2HH05
     I                                       21  240D2HH06
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAJNPW051
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     349930
      *
     C                     TIME           WTIME
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1UPD     IFEQ '0'
     C           D1UPD     OREQ '1'
     C           D1UPD     OREQ '2'
     C                     ELSE
     C                     SETON                     3099
     C                     MOVELER,1      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1TYPE    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1TYPE    IFEQ '1'
     C           D1TYPE    OREQ '2'
     C           D1TYPE    OREQ '3'
     C           D1TYPE    OREQ '4'
     C           D1TYPE    OREQ '5'
     C           D1TYPE    OREQ '6'
     C           D1TYPE    OREQ '7'
     C                     ELSE
     C                     SETON                     3199
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADD0         D2HH01
     C                     Z-ADD0         D2HH02
     C                     Z-ADD0         D2HH03
     C                     Z-ADD0         D2HH04
     C                     Z-ADD0         D2HH05
     C                     Z-ADD0         D2HH06
     C                     Z-ADD0         X       20
     C           D1TYPE    SETLLAJNPP051
     C           D1TYPE    READEAJNPP051                 20
     C           *IN20     DOWEQ'0'
     C           CNSKJY    IFEQ 'D'
     C           CNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         X
     C                     Z-ADDCNHH      HH,X
     C                     ENDIF
     C           D1TYPE    READEAJNPP051                 20
     C                     ENDDO
      *
     C                     SETOF                     19
     C           D1UPD     IFEQ '0'
     C                     SETON                     19
     C                     ENDIF
      *
     C                     MOVEL'02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTAJNPW052
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     99
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           D2HH01    IFEQ 0
     C           D2HH02    ANDEQ0
     C           D2HH03    ANDEQ0
     C           D2HH04    ANDEQ0
     C           D2HH05    ANDEQ0
     C           D2HH06    ANDEQ0
     C                     MOVELER,4      D1ERR
     C                     SETON                     333435
     C                     SETON                     363738
     C                     SETON                     99
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     SETOF                     88
      *
     C           D2HH01    IFNE 0
     C           D2HH02    IFNE 0
     C           D2HH01    ANDGED2HH02
     C                     SETON                     88
     C                     ENDIF
     C           D2HH03    IFNE 0
     C           D2HH01    ANDGED2HH03
     C                     SETON                     88
     C                     ENDIF
     C           D2HH04    IFNE 0
     C           D2HH01    ANDGED2HH04
     C                     SETON                     88
     C                     ENDIF
     C           D2HH05    IFNE 0
     C           D2HH01    ANDGED2HH05
     C                     SETON                     88
     C                     ENDIF
     C           D2HH06    IFNE 0
     C           D2HH01    ANDGED2HH06
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C****
     C           D2HH02    IFNE 0
     C           D2HH03    IFNE 0
     C           D2HH02    ANDGED2HH03
     C                     SETON                     88
     C                     ENDIF
     C           D2HH04    IFNE 0
     C           D2HH02    ANDGED2HH04
     C                     SETON                     88
     C                     ENDIF
     C           D2HH05    IFNE 0
     C           D2HH02    ANDGED2HH05
     C                     SETON                     88
     C                     ENDIF
     C           D2HH06    IFNE 0
     C           D2HH02    ANDGED2HH06
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C****
     C           D2HH03    IFNE 0
     C           D2HH04    IFNE 0
     C           D2HH03    ANDGED2HH04
     C                     SETON                     88
     C                     ENDIF
     C           D2HH05    IFNE 0
     C           D2HH03    ANDGED2HH05
     C                     SETON                     88
     C                     ENDIF
     C           D2HH06    IFNE 0
     C           D2HH03    ANDGED2HH06
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C***
     C           D2HH04    IFNE 0
     C           D2HH05    IFNE 0
     C           D2HH04    ANDGED2HH05
     C                     SETON                     88
     C                     ENDIF
     C           D2HH06    IFNE 0
     C           D2HH04    ANDGED2HH06
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
     C***
     C           D2HH05    IFNE 0
     C           D2HH06    IFNE 0
     C           D2HH05    ANDGED2HH06
     C                     SETON                     88
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN88     IFEQ *ON
     C                     MOVELER,5      D1ERR
     C                     SETON                     313233
     C                     SETON                     343536
     C                     SETON                     99
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB490
     C           D1UPD     IFEQ '1'
     C           D1UPD     OREQ '2'
     C                     EXSR #SB500
     C                     ENDIF
     C                     MOVEL*BLANK    D1UPD
     C                     MOVEL*BLANK    D1TYPE
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * DELETE ALL                                         *
      *----------------------------------------------------*
     CSR         #SB490    BEGSR
      *
     C           D1TYPE    SETLLAJNPP051
     C           D1TYPE    READEAJNPP051                 20
     C           *IN20     DOWEQ'0'
     C           CNSKJY    IFEQ 'D'
     C           CNSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'D'       CNSKJY
     C                     Z-ADD*DATE     CNSKHZ
     C                     UPDATAJNPP051
     C                     ENDIF
     C           D1TYPE    READEAJNPP051                 20
     C                     ENDDO
      *
     CSR         ESB490    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYAJ     KLIST
     C                     KFLD           D1TYPE
     C                     KFLD           K1HH    40
     C                     Z-ADD1         X
     C           X         DOWLE6
     C                     Z-ADDHH,X      K1HH
     C           K1HH      IFNE 0
     C           KEYAJ     CHAINAJNPP051             20
     C                     CLEARAJNPP051
     C                     Z-ADD*DATE     CNKOHZ
     C                     TIME           CNKOTI
     C                     MOVELW#USER    CNKOME
     C                     MOVELD1TYPE    CNTYPE
     C                     Z-ADDK1HH      CNHH
     C           *IN20     IFEQ '0'
     C                     UPDATAJNPP051
     C                     ELSE
     C                     WRITEAJNPP051
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
**
ER-1 UPDATE ERROR.
ER-2 TABEL # ERROR.
ER-3 NO DATA.
ER-4 TIME RANGE ERROR.
ER-5 SEQUENCE ERROR.
