     H            Y.
      ** AJSR67 *******************************************************
      * INQUIRY OF DACRODIZING PLATING DISCHARGE RESULT DATA. (MACHINE NO)*
      * PROGRAM ID.  : AJSR52. <RPG>                                  *
      * CREATE DATE. : 1997/MAR/17.                                   *
      * AUTHOR.      : S.OHTAKE.                                      *
      * T.SAKASHITA 2013/JUN/18
      ******************************************************* AJSR67 **
     FAJSPW67 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FAJSPL21 IF  E           K        DISK
      *****************************************************************
     E                    MSG     1   6 60               d[ｰxｮﾈｰﾆﾞ
      *****************************************************************
     I            DS
     I                                        1  14 HIN
     I                                        1   5 J2HIN1
     I                                        6   6 HINA
     I                                        7  11 J2HIN2
     I                                       12  12 HINB
     I                                       13  14 J2HIN3
     I            DS
     I                                        1   80J2SKHZ
     I                                        1   40J2SKYY
     I                                        5   60J2SKMM
     I                                        7   80J2SKDD
     I            DS
     I                                        1   80J2WKHZ
     I                                        1   40J2WINY
     I                                        5   60J2WINM
     I                                        7   80J2WIND
     I            DS
     I                                        1   40J2WKTM
     I                                        1   20J2WINJ
     I                                        3   40J2WINF
     I            DS
     I                                        1   80J2KEHZ
     I                                        1   40J2KEIY
     I                                        5   60J2KEIM
     I                                        7   80J2KEID
     I            DS
     I                                        1   40J2KETM
     I                                        1   20J2KEIJ
     I                                        3   40J2KEIF
     I            DS
     I                                        1   80SHIZ
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I            DS
     I                                        1   80EHIZ
     I                                        1   40EYY
     I                                        5   60EMM
     I                                        7   80EDD
      *****************************************************************
      *  START  PROGRAM <AJSR51>
      *****************************************************************
     C           STP0      TAG
     C                     MOVE *BLANK    MACH
     C                     Z-ADD*ZERO     SHIZ
     C                     Z-ADD*ZERO     EHIZ
      ******************************************************
      *  EXFMT  <fﾞx] 1>                                   *
      ******************************************************
     C           STP1      TAG
     C                     Z-ADD*ZERO     RRN     50
     C                     EXFMTAJSPW671
     C                     MOVEA'000'     *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
B001 C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
      ******************************************************
      *  <fﾞx] 1 ﾉ kｩｮh>                                   *
      ******************************************************
B001 C           MACH      IFEQ *BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
E001 C                     END
      *
B001 C           SHIZ      IFNE *ZERO
B002 C           SMM       IFGT 12
     C           SMM       ORLT 01
     C           SDD       ORGT 31
     C           SDD       ORLT 01
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     ERR
     C                     GOTO STP1
E002 C                     END
E001 C                     END
      *
B001 C           EHIZ      IFNE *ZERO
B002 C           EMM       IFGT 12
     C           EMM       ORLT 01
     C           EDD       ORGT 31
     C           EDD       ORLT 01
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,6     ERR
     C                     GOTO STP1
E002 C                     END
E001 C                     END
      *
     C           KEY1      KLIST
     C                     KFLD           MACH
     C                     KFLD           SYY
     C                     KFLD           SMM
     C                     KFLD           SDD
      *
     C           KEY2      KLIST
     C                     KFLD           MACH
      *
     C           @LOOP     TAG
     C                     Z-ADD*ZERO     CNTR    50
     C                     EXSR #SET
      *
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      ******************************************************
      *  EXFMT  (fﾞx] 2)                                   *
      ******************************************************
     C           STP2      TAG
     C                     MOVEA'0'       *IN,81
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
      *
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
B001 C           *INKC     IFEQ '1'
     C                     GOTO STP0
E001 C                     END
      *  ﾜｰﾓ aｮﾎﾟ
     C           *IN,81    IFEQ '1'
     C                     Z-ADD*ZERO     CNTR
     C                     EXSR ROLLUP
     C                     Z-ADDRRN       RCDNBR
     C   44                MOVEA'1'       *IN,99
     C                     GOTO STP2
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      *
     C                     Z-ADDRRN       XXRRN   50
B001 C                     DO   *HIVAL    RRN@@   50
     C           RRN@@     CHAINDSP2R                42
B002 C           *IN,42    IFEQ '0'
B003 C           OP        IFEQ 'M'
      *  ﾅﾎﾞﾎｦbﾓ ﾍﾍｭcﾆﾞ ---> fﾞx]2 ﾉ ﾎｧｰﾓnﾞ
     C                     MOVEL#KNKB     XXKNKB
     C                     MOVEL#ZNO      XXZNO
     C                     MOVEL#TNO      XXTNO
     C                     MOVEL#PNO1     XXPNO1
     C                     MOVEL#PNO2     XXPNO2
     C                     MOVEL#PNO3     XXPNO3
     C                     MOVEL#PNO4     XXPNO4
     C                     MOVEL#2JIK     XX2JIK
     C                     MOVEL#TISG     XXTISG
     C                     MOVEL#SYKB     XXSYKB
     C                     MOVEL#HAKO     XXHAKO
     C                     Z-ADD#KEIS     XXKEIS
     C                     MOVEL#IRO      XXIRO
     C                     Z-ADD#SYOS     XXSYOS
     C                     MOVEL#MHKO     XXMHKO
     C                     Z-ADD#TANJ     XXTANJ
     C                     Z-ADD#THIZ     XXTHIZ
     C                     Z-ADD#TTIM     XXTTIM
     C                     Z-ADD#TNMJ     XXTNMJ
     C                     MOVE #KIBN     XXKIBN
     C                     Z-ADD#KHIZ     XXKHIZ
     C                     Z-ADD#KTIM     XXKTIM
     C                     Z-ADD#KEIJ     XXKEIJ
     C                     MOVE #TOCD     XXTOCD
     C                     MOVE #ZAI1     XXZAI1
     C                     MOVE #ZAI2     XXZAI2
      *  EXFMT fﾞx] 2
     C                     EXSR #SET2
     C                     MOVE *BLANK    OP
     C                     UPDATDSP2R
E003 C                     END
E002 C                     END
E001 C  N42                END
      *
     C                     Z-ADD*ZERO     RRN
     C                     GOTO @LOOP
      ******************************************************
     C           #SET      BEGSR                           *
      ******************************************************
      *  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
     C           KEY1      SETLLAJSPL211
      *  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ CLR
     C                     MOVE *BLANK    OP
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @THI
     C                     MOVE *BLANK    @PNO1
     C                     MOVE *BLANK    @PNO2
     C                     MOVE *BLANK    @PNO3
     C                     MOVE *BLANK    @PNO4
     C                     Z-ADD*ZERO     @KEIS
     C                     MOVE *BLANK    @IRO
     C                     Z-ADD*ZERO     @THIZ
     C                     Z-ADD*ZERO     @TTIM
     C                     Z-ADD*ZERO     @GRYO
     C                     MOVE *BLANK    #KNKB
     C                     MOVE *BLANK    #ZNO
     C                     MOVE *BLANK    #TNO
     C                     MOVE *BLANK    #PNO1
     C                     MOVE *BLANK    #PNO2
     C                     MOVE *BLANK    #PNO3
     C                     MOVE *BLANK    #PNO4
     C                     MOVE *BLANK    #2JIK
     C                     MOVE *BLANK    #TISG
     C                     MOVE *BLANK    #SYKB
     C                     MOVE *BLANK    #HAKO
     C                     Z-ADD*ZERO     #KEIS
     C                     MOVE *BLANK    #IRO
     C                     Z-ADD*ZERO     #SYOS
     C                     MOVE *BLANK    #MHKO
     C                     Z-ADD*ZERO     #TANJ
     C                     Z-ADD*ZERO     #THIZ
     C                     Z-ADD*ZERO     #TTIM
     C                     Z-ADD*ZERO     #TNMJ
     C                     MOVE *ZERO     #KIBN
     C                     Z-ADD*ZERO     #KHIZ
     C                     Z-ADD*ZERO     #KTIM
     C                     Z-ADD*ZERO     #KEIJ
     C                     MOVE *BLANK    #TOCD
     C                     MOVE *BLANK    #ZAI1
     C                     MOVE *BLANK    #ZAI2
      *
B001 C                     DO   *HIVAL
     C           MORE1     TAG
     C           KEY2      READEAJSPL211                 40
     C   40                GOTO @@@
      *
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    IFLE *DATE
     C                     GOTO MORE1
     C                     END
     C                     END
      *
B002 C           *IN,40    IFEQ '0'
     C                     MOVEA'0'       *IN,21
     C           J2KEHZ    CABLTSHIZ      @END
     C           J2KEHZ    CABGTEHIZ      @@@
      *
     C           J2HIN2    IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
      *
     C           J2HIN3    IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
     C                     MOVE HIN       @HIN
     C                     MOVELJ2THAI    @THI
     C                     MOVELJ2PAG1    @PNO1
     C                     MOVELJ2PAG2    @PNO2
     C                     MOVELJ2PAG3    @PNO3
     C                     MOVELJ2PAG4    @PNO4
     C                     Z-ADDJ2MKSU    @KEIS
     C                     MOVELJ2IROK    @IRO
     C                     Z-ADDJ2KEHZ    @THIZ
     C                     Z-ADDJ2KETM    @TTIM
     C                     Z-ADDJ2WMJY    @GRYO
     C                     MOVELJ2KANK    #KNKB
     C                     MOVELJ2ZETI    #ZNO
     C                     MOVELJ2THAI    #TNO
     C                     MOVELJ2PAG1    #PNO1
     C                     MOVELJ2PAG2    #PNO2
     C                     MOVELJ2PAG3    #PNO3
     C                     MOVELJ2PAG4    #PNO4
     C                     MOVELJ22JKA    #2JIK
     C                     MOVELJ2TASY    #TISG
     C                     MOVELJ2SYKO    #SYKB
     C                     MOVELJ2HKBR    #HAKO
     C                     Z-ADDJ2MKSU    #KEIS
     C                     MOVELJ2IROK    #IRO
     C                     Z-ADDJ2SYUY    #SYOS
     C                     MOVELJ2HKFA    #MHKO
     C                     Z-ADDJ2TANJ    #TANJ
     C                     Z-ADDJ2WKHZ    #THIZ
     C                     Z-ADDJ2WKTM    #TTIM
     C                     Z-ADDJ2WMJY    #TNMJ
     C                     MOVE J2MKKB    #KIBN
     C                     Z-ADDJ2KEHZ    #KHIZ
     C                     Z-ADDJ2KETM    #KTIM
     C                     Z-ADDJ2WAIT    #KEIJ
     C                     MOVE J2TOCD    #TOCD
     C                     MOVE J2ZBR1    #ZAI1
     C                     MOVE J2ZBR2    #ZAI2
      *
     C           J2SAIK    IFEQ '0'
     C           J2SAIK    OREQ ' '
     C                     MOVEA'0'       *IN,21
     C                     ELSE
     C                     MOVEA'1'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
      * MAX mﾞｰj <15>
     C           CNTR      CABEQ15        @@@
E002 C                     END
     C           @END      TAG
E001 C  N40                END
      *
     C           @@@       TAG
      *  fﾞbnc mﾞｰj oﾆ
B001 C           RRN       IFEQ 0
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     END
      *
     C                     ENDSR
      ******************************************************
     C           #SET2     BEGSR                           *
      ******************************************************
     C           STP3      TAG
     C                     EXFMTAJSPW672
      *
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
B001 C           *INKC     IFEQ '1'
     C                     MOVEA'1'       *IN,42
     C                     GOTO #SET2E
E001 C                     END
      *
     C           #SET2E    ENDSR
      ******************************************************
     C           ROLLUP    BEGSR                           *
      ******************************************************
     C                     MOVE *BLANK    SW      1
B001 C                     DO   *HIVAL
     C           KEY2      READEAJSPL211                 40
     C           MORE2     TAG
     C   40                GOTO @ROLE
      *
     C           J2SKJY    IFEQ 'D'
     C           J2SKHZ    IFLE *DATE
     C                     GOTO MORE2
     C                     END
     C                     END
      *
B002 C           *IN,40    IFEQ '0'
     C           J2KEHZ    CABLTSHIZ      @END1
     C           J2KEHZ    CABGTEHIZ      @ROLE
     C                     MOVEL'*'       SW
     C                     MOVE HIN       @HIN
     C                     MOVELJ2THAI    @THI
     C                     MOVELJ2PAG1    @PNO1
     C                     MOVELJ2PAG2    @PNO2
     C                     MOVELJ2PAG3    @PNO3
     C                     MOVELJ2PAG4    @PNO4
     C                     Z-ADDJ2MKSU    @KEIS
     C                     MOVELJ2IROK    @IRO
     C                     Z-ADDJ2KEHZ    @THIZ
     C                     Z-ADDJ2KETM    @TTIM
     C                     Z-ADDJ2WMJY    @GRYO
     C                     MOVELJ2KANK    #KNKB
     C                     MOVELJ2ZETI    #ZNO
     C                     MOVELJ2THAI    #TNO
     C                     MOVELJ2PAG1    #PNO1
     C                     MOVELJ2PAG2    #PNO2
     C                     MOVELJ2PAG3    #PNO3
     C                     MOVELJ2PAG4    #PNO4
     C                     MOVELJ22JKA    #2JIK
     C                     MOVELJ2TASY    #TISG
     C                     MOVELJ2SYKO    #SYKB
     C                     MOVELJ2HKBR    #HAKO
     C                     Z-ADDJ2MKSU    #KEIS
     C                     MOVELJ2IROK    #IRO
     C                     Z-ADDJ2SYUY    #SYOS
     C                     MOVELJ2HKFA    #MHKO
     C                     Z-ADDJ2TANJ    #TANJ
     C                     Z-ADDJ2WKHZ    #THIZ
     C                     Z-ADDJ2WKTM    #TTIM
     C                     Z-ADDJ2WMJY    #TNMJ
     C                     MOVE J2MKKB    #KIBN
     C                     Z-ADDJ2KEHZ    #KHIZ
     C                     Z-ADDJ2KETM    #KTIM
     C                     Z-ADDJ2WAIT    #KEIJ
     C                     MOVE J2TOCD    #TOCD
     C                     MOVE J2ZBR1    #ZAI1
     C                     MOVE J2ZBR2    #ZAI2
      *
     C           J2SAIK    IFEQ '0'
     C           J2SAIK    OREQ ' '
     C                     MOVEA'0'       *IN,21
     C                     ELSE
     C                     MOVEA'1'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
     C           CNTR      CABEQ15        @ROLE
E002 C                     END
     C           @END1     TAG
E001 C  N40                END
      *
     C           @ROLE     TAG
      *  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
B001 C           SW        IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
E001 C                     END
      *
     C                     ENDSR
      *****************************************************************
**  MSG (ERROR MESSAGE )
E-01 INPUT
E-02 THERE ISN'T APPLICABLE DATA.
E-03 INPUT ADMITTED DAY START
E-04 ADMITTED DAY START ISN'T RIGHT
E-05 INPUT ADMITTED DAY EXIT
E-06 ADMITTED DAY EXIT ISN'T RIGHT
