     H            Y.                                    1                 DAD000
     F** AJSR44 **********************************
     F* TUNNEL PLATING ARRSINSTRUCTION                         *
     F* CREATE  OF FA DATA WHICH THERE IS NOT IN COMPONENTS TUNNEL .PLATING
     F* C:N.HAYAKAWA           1993.07.23        *
     F*
     F* TCHK1 02/25/09 ADD AAFTL06 SELECT CONDITION
     F********************************************
     FAJSPL01 IF  E           K        DISK
     FAAFTL06 IF  E           K        DISK
     FCADTL04 IF  E           K        DISK
     FAJSWP42 O   F      14            DISK                      A
      *
     C********************************************************
     C* KEY LIST
     C********************************************************
     C           KEY1      KLIST
     C                     KFLD           J1SHN1
     C                     KFLD           J1SHN2
     C                     KFLD           J1SHN3
     C********************************************************
     C* MAIN
     C********************************************************
     C                     TIME           WTIME   60
     C                     MOVEL*BLANK    W@KANB  1
      *
     C                     DO   *HIVAL
     C                     READ AJSPL01                  91
     C         91          LEAVE
      *
     C           J1SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C*
     C                     MOVEL*BLANK    W@KANB  1
      * PLATING KANBAN
     C           J1KDAI    IFEQ 'C'
     C                     EXSR $SB900
     C           W@KANB    IFEQ '1'
     C                     ITER
     C                     END
     C                     ENDIF
      * INSRUCTION KANBAN
     C           J1KDAI    IFEQ 'F'
     C                     EXSR $SB910
     C           W@KANB    IFEQ '1'
     C                     ITER
     C                     END
     C                     ENDIF
      *
      *かんばんに該当なし
     C                     EXCPTDAT
      *
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C********************************************************
     C*メッキかんばんからＦＡマスターの未使用品番をチェック*
     C********************************************************
     C           $SB900    BEGSR
     C*
     C           KEY1      SETLLAAFTL061
     C                     SETOF                     10
     C                     DO   *HIVAL
     C           KEY1      READEAAFTL061                 10
     C   10                LEAVE
     C*
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
TCHK1C*
TCHK1C           A3KCD1    IFEQ 'C'
TCHK1C           A3KCD2    ANDEQ'A'
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     ENDIF
     C*
     C*有効日・失効日のチェック*
     C           A3UKHZ    IFLE *DATE
     C           A3STHZ    ANDGT*DATE
     C                     MOVEL'1'       W@KANB
     C                     LEAVE
     C                     ELSE
     C                     ITER
     C                     ENDIF
     C*
     C                     ENDDO
      *
     C           $S900E    ENDSR
     C******************************************************
     C*指示かんばんからＦＡマスターの未使用品番をチェック*
     C******************************************************
     C           $SB910    BEGSR
      *
     C           KEY1      SETLLCADTL041
     C                     SETOF                     10
     C                     DO   *HIVAL
     C           KEY1      READECADTL041                 10
     C         10          LEAVE
     C*削除                  *
     C           C2SKJY    IFEQ 'D'
     C           C2SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C* ST PROC EXIST?
     C           C2MEKI    IFEQ *BLANK
     C           C2MEKI    OREQ '.......'
     C           C2BARA    OREQ 0
     C                     ITER
     C                     ENDIF
     C*
     C*有効日・失効日のチェック*
     C           C2UKHZ    IFLE *DATE
     C           C2STHZ    ANDGT*DATE
     C                     MOVEL'1'       W@KANB
     C                     LEAVE
     C                     ELSE
     C                     ITER
     C                     ENDIF
     C*
     C                     ENDDO
      *
     C           $S910E    ENDSR
     C******************************************************
     OAJSWP42 EADD             DAT
     O                         J1SHN1     5
     O                         J1SHN2    10
     O                         J1SHN3    12
     O                                   13 '*'
     O                         J1KDAI    14
