     H            Y.                                                      DAD000
     FFCEPL07 IP  E           K        DISK
     FOUTPUTS O   F     256            DISK
     C                     CALL 'AJSRS1'
     C                     PARM           A2ZETI  4
     C                     PARM           P@RTNC  1
      *
     C  N77                EXCPTOHED
     C                     SETON                     77
      *
     C                     EXCPTODAT
      *
     OOUTPUTS E                OHED
A    O*
     O                                      ','
B    O                                      'PART NO.'
     O                                      ','
C    O                                      'MEKI CD.'
     O                                      ','
D    O                                      'SIZE'
     O                                      ','
E    O                                      'DAI'
     O                                      ','
F    O                                      'CHU'
     O                                      ','
G    O                                      'SHO'
     O                                      ','
H    O                                      'DAI'
     O                                      ','
I    O                                      'CHU'
     O                                      ','
J    O                                      'SHO'
     O                                      ','
K    O                                      'KUBI'
     O                                      ','
L    O                                      'K1'
     O                                      ','
M    O                                      'K2'
     O                                      ','
N    O                                      'K3'
     O                                      ','
O    O                                      'K4'
     O                                      ','
O    O                                      'KUBUN'
     OOUTPUTS E                ODAT
A    O                         A2GSKD
     O                                      ','
B    O                                      '="'
     O                         A2BHB1
     O                         A2BHB2
     O                         A2BHB3
     O                                      '"'
     O                                      ','
C    O                         A2MEK1
     O                         A2MEK2
     O                         A2MEK3
     O                                      ','
D    O                         A2TUSZ       '  . '
     O                                      ','
E    O                         A2BDAI
     O                                      ','
F    O                         A2BTIU
     O                                      ','
G    O                         A2BHIN
     O                                      ','
H    O                         A2SMEI
     O                                      ','
I    O                         A2TMEI
     O                                      ','
J    O                         A2DMEI
     O                                      ','
K    O                         A2KUBI       '   .  '
     O                                      ','
     O                         A21HB5
     O                         A22HB5
     O                         A23HB2
     O                                      ','
     O                         A24HB5
     O                         A25HB5
     O                         A26HB2
     O                                      ','
     O                         A27HB5
     O                         A28HB5
     O                         A29HB2
     O                                      ','
     O                         A210H5
     O                         A211H5
     O                         A212H2
     O                                      ','
     O                         P@RTNC
