     H            Y.
      ** AJSR64 **********************************
      * INQUIRY OF PLATING PLATING ADMITTED ORDER RESULT DATA S
      * PROGRAM ID.  : AJSR64. <RPG>             *
      * CREATE DATE. : DEC.07,'90.               *
      * AUTHOR.      : KOHHY.                    *
      ********************************** AJSR64 **
     FAJSPW64 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FAJSPL34 IF  E           K        DISK
      *****************************************************************
     E                    MSG     1  12 60               d[ｰxｮﾈｰﾆﾞ
      *****************************************************************
     I            DS
     I                                        1  14 @HIN
     I                                        1   5 @HIN1
     I                                        6   6 @HINA
     I                                        7  11 @HIN2
     I                                       12  12 @HINB
     I                                       13  14 @HIN3
     I            DS
     I                                        1  14 #HIN
     I                                        1   5 #HIN1
     I                                        6   6 #HINA
     I                                        7  11 #HIN2
     I                                       12  12 #HINB
     I                                       13  14 #HIN3
     I            DS
     I                                        1   80J4SKHZ
     I                                        1   40J4SKYY
     I                                        5   60J4SKMM
     I                                        7   80J4SKDD
     I            DS
     I                                        1   80J4WKHZ
     I                                        1   40J4WINY
     I                                        5   60J4WINM
     I                                        7   80J4WIND
     I            DS
     I                                        1   40J4WKTM
     I                                        1   20J4WINJ
     I                                        3   40J4WINF
     I            DS
     I                                        1   80J4KEHZ
     I                                        1   40J4KEIY
     I                                        5   60J4KEIM
     I                                        7   80J4KEID
     I            DS
     I                                        1   40J4KETM
     I                                        1   20J4KEIJ
     I                                        3   40J4KEIF
     I            DS
     I                                        1   80SHIZ
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I            DS
     I                                        1   80EHIZ
     I                                        1   40EYY
     I                                        5   60EMM
     I                                        7   80EDD
     I            DS
     I                                        1   80STHZ
     I                                        1   40STYY
     I                                        5   60STMM
     I                                        7   80STDD
     I            DS
     I                                        1   80ENHZ
     I                                        1   40ENYY
     I                                        5   60ENMM
     I                                        7   80ENDD
     I            DS
     I                                        1   40STJI
     I                                        1   20STFF
     I                                        3   40STSS
     I            DS
     I                                        1   40ENJI
     I                                        1   20ENFF
     I                                        3   40ENSS
     I            DS
     I                                        1  100$1
     I                                        1   60$1YMD
     I                                        7  100$1JI
     I            DS
     I                                        1  100$2
     I                                        1   60$2YMD
     I                                        7  100$2JI
     I            DS
     I                                        1  100@1
     I                                        1   60@1YMD
     I                                        7  100@1JI
     I            DS
     I                                        1  100@2
     I                                        1   60@2YMD
     I                                        7  100@2JI
      *****************************************************************
      *  START  PROGRAM <AJSR64>
      *****************************************************************
     C           KEY1      KLIST
     C                     KFLD           GOKI
     C                     KFLD           STYY
     C                     KFLD           STMM
     C                     KFLD           STDD
     C                     KFLD           STFF
     C                     KFLD           STSS
      *
     C           STP0      TAG
     C                     Z-ADD*ZERO     GOKI
     C                     Z-ADD*ZERO     STHZ
     C                     Z-ADD99999999  ENHZ
     C                     Z-ADD*ZERO     STJI
     C                     Z-ADD9999      ENJI
      ******************************************************
      *  EXFMT  <fﾞx] 1>                                   *
      ******************************************************
     C           STP1      TAG
     C                     Z-ADD*ZERO     RRN     50
     C                     EXFMTAJSPW641
     C                     MOVEA'00000'   *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      * SFLCLR
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
B001 C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
      ******************************************************
      *  <fﾞx] 1 ﾉ kｩｮh>                                   *
      ******************************************************
B001 C           GOKI      IFEQ *ZERO
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
E001 C                     END
      *
     C           STHZ      IFEQ *ZERO
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     GOTO STP1
     C                     END
      *
     C           STMM      IFGT 12
     C           STMM      ORLT 01
     C           STDD      ORGT 31
     C           STDD      ORLT 01
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,3     ERR
     C                     GOTO STP1
     C                     END
      *
     C           ENHZ      IFEQ *ZERO
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,6     ERR
     C                     GOTO STP1
     C                     END
      *
     C           ENHZ      IFNE 99999999
     C           ENMM      IFGT 12
     C           ENMM      ORLT 01
     C           ENDD      ORGT 31
     C           ENDD      ORLT 01
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,7     ERR
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C           STHZ      IFGT ENHZ
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,04
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,10    ERR
     C                     GOTO STP1
     C                     END
      *
     C           STHZ      IFEQ ENHZ
     C           STJI      ANDGTENJI
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,05
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,11    ERR
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADDSTHZ      $1YMD
     C                     Z-ADDSTJI      $1JI
     C                     Z-ADDENHZ      $2YMD
     C                     Z-ADDENJI      $2JI
      *
     C                     Z-ADDSTHZ      SHIZ
     C                     Z-ADDENHZ      EHIZ
      *
     C           @LOOP     TAG
     C                     Z-ADD*ZERO     CNTR    50
     C                     EXSR #SET
      *
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      ******************************************************
      *  EXFMT  (fﾞx] 2)                                   *
      ******************************************************
     C           STP2      TAG
     C                     MOVEA'0'       *IN,81
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
      *
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
B001 C           *INKC     IFEQ '1'
     C                     GOTO STP0
E001 C                     END
      *  ﾜｰﾓ aｮﾎﾟ
     C           *IN,81    IFEQ '1'
     C                     Z-ADD*ZERO     CNTR
     C                     EXSR ROLLUP
     C                     Z-ADDRRN       RCDNBR
     C   44                MOVEA'1'       *IN,99
     C                     GOTO STP2
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      *
     C                     Z-ADDRRN       XXRRN   50
B001 C                     DO   *HIVAL    RRN@@   50
     C           RRN@@     CHAINDSP2R                42
B002 C           *IN,42    IFEQ '0'
B003 C           OP        IFEQ 'M'
      *  ﾅﾎﾞﾎｦbﾓ ﾍﾍｭcﾆﾞ ---> fﾞx]2 ﾉ ﾎｧｰﾓnﾞ
     C                     MOVEL#KNKB     XXKNKB
     C                     MOVEL#ZNO      XXZNO
     C                     MOVEL#TNO      XXTNO
     C                     MOVEL#PNO1     XXPNO1
     C                     MOVEL#PNO2     XXPNO2
     C                     MOVEL#PNO3     XXPNO3
     C                     MOVEL#2JIK     XX2JIK
     C                     MOVEL#TISG     XXTISG
     C                     MOVEL#SYKB     XXSYKB
     C                     MOVEL#HAKO     XXHAKO
     C                     Z-ADD#KEIS     XXKEIS
     C                     MOVEL#IRO      XXIRO
     C                     MOVEL#MHKO     XXMHKO
     C                     Z-ADD#TANJ     XXTANJ
     C                     Z-ADD#THIZ     XXTHIZ
     C                     Z-ADD#TTIM     XXTTIM
     C                     Z-ADD#TNMJ     XXTNMJ
     C                     Z-ADD#KIBN     XXKIBN
     C                     Z-ADD#KHIZ     XXKHIZ
     C                     Z-ADD#KTIM     XXKTIM
     C                     Z-ADD#KEIJ     XXKEIJ
     C                     MOVEL#TNSS     XXTNSS
     C                     Z-ADD#TNHK     XXTNHK
     C                     Z-ADD#TNKO     XXTNKO
     C                     MOVEL#HIN      HIN
      *  EXFMT fﾞx] 2
     C                     EXSR #SET2
     C                     MOVE *BLANK    OP
     C                     UPDATDSP2R
E003 C                     END
E002 C                     END
E001 C  N42                END
      *
     C                     Z-ADD*ZERO     RRN
     C                     GOTO @LOOP
      ******************************************************
     C           #SET      BEGSR                           *
      ******************************************************
      *  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ CLR
     C                     MOVE *BLANK    OP
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @THI
     C                     MOVE *BLANK    @PNO1
     C                     MOVE *BLANK    @PNO2
     C                     MOVE *BLANK    @PNO3
     C                     Z-ADD*ZERO     @KEIS
     C                     MOVE *BLANK    @IRO
     C                     Z-ADD*ZERO     @THIZ
     C                     Z-ADD*ZERO     @TTIM
     C                     Z-ADD*ZERO     @GRYO
     C                     MOVE *BLANK    #KNKB
     C                     MOVE *BLANK    #ZNO
     C                     MOVE *BLANK    #TNO
     C                     MOVE *BLANK    #PNO1
     C                     MOVE *BLANK    #PNO2
     C                     MOVE *BLANK    #PNO3
     C                     MOVE *BLANK    #2JIK
     C                     MOVE *BLANK    #TISG
     C                     MOVE *BLANK    #SYKB
     C                     MOVE *BLANK    #HAKO
     C                     Z-ADD*ZERO     #KEIS
     C                     MOVE *BLANK    #IRO
     C                     MOVE *BLANK    #MHKO
     C                     Z-ADD*ZERO     #TANJ
     C                     Z-ADD*ZERO     #THIZ
     C                     Z-ADD*ZERO     #TTIM
     C                     Z-ADD*ZERO     #TNMJ
     C                     Z-ADD*ZERO     #KIBN
     C                     Z-ADD*ZERO     #KHIZ
     C                     Z-ADD*ZERO     #KTIM
     C                     Z-ADD*ZERO     #KEIJ
     C                     MOVE *BLANK    #TNSS
     C                     Z-ADD*ZERO     #TNHK
     C                     Z-ADD*ZERO     #TNKO
     C                     MOVE *BLANK    #HIN
      *
     C           KEY1      SETLLAJSPL341
B001 C                     DO   *HIVAL
     C           MORE1     TAG
     C           GOKI      READEAJSPL341                 40
     C   40                GOTO @@@
      *
     C           J4SKJY    IFEQ 'D'
     C           J4SKHZ    IFLE *DATE
     C                     GOTO MORE1
     C                     END
     C                     END
      *
B002 C           *IN,40    IFEQ '0'
     C                     Z-ADDJ4WKHZ    @1YMD
     C                     Z-ADDJ4WKTM    @1JI
     C                     Z-ADDJ4WKHZ    @2YMD
     C                     Z-ADDJ4WKTM    @2JI
      *
     C           @2        CABGT$2        @@@
     C                     MOVELJ4HIN1    @HIN1
     C                     MOVELJ4HIN2    @HIN2
     C                     MOVELJ4HIN3    @HIN3
     C           @HIN2     IFNE *BLANK
     C                     MOVEL'-'       @HINA
     C                     END
      *
     C           @HIN3     IFNE *BLANK
     C                     MOVEL'-'       @HINB
     C                     END
      *
     C                     MOVELJ4THAI    @THI
     C                     MOVELJ4PAG1    @PNO1
     C                     MOVELJ4PAG2    @PNO2
     C                     MOVELJ4PAG3    @PNO3
     C                     Z-ADDJ4MKSU    @KEIS
     C                     MOVELJ4IROK    @IRO
     C                     Z-ADDJ4WKHZ    @THIZ
     C                     Z-ADDJ4WKTM    @TTIM
     C                     Z-ADDJ4WMJY    @GRYO
     C                     Z-ADDJ4MKSU    @KEIS
     C                     MOVELJ4IROK    @IRO
     C                     Z-ADDJ4WKHZ    @THIZ
     C                     Z-ADDJ4WKTM    @TTIM
     C                     MOVELJ4KANK    #KNKB
     C                     MOVELJ4ZETI    #ZNO
     C                     MOVELJ4THAI    #TNO
     C                     MOVELJ4PAG1    #PNO1
     C                     MOVELJ4PAG2    #PNO2
     C                     MOVELJ4PAG3    #PNO3
     C                     MOVELJ42JKA    #2JIK
     C                     MOVELJ4TASY    #TISG
     C                     MOVELJ4SYKO    #SYKB
     C                     MOVELJ4HKBR    #HAKO
     C                     Z-ADDJ4MKSU    #KEIS
     C                     MOVELJ4IROK    #IRO
     C                     MOVELJ4HKFA    #MHKO
     C                     Z-ADDJ4TANJ    #TANJ
     C                     Z-ADDJ4WKHZ    #THIZ
     C                     Z-ADDJ4WKTM    #TTIM
     C                     Z-ADDJ4WMJY    #TNMJ
     C                     Z-ADDJ4MKKB    #KIBN
     C                     Z-ADDJ4KEHZ    #KHIZ
     C                     Z-ADDJ4KETM    #KTIM
     C                     Z-ADDJ4WAIT    #KEIJ
     C                     MOVELJ4HSUK    #TNSS
     C                     Z-ADDJ4KBUH    #TNHK
     C                     Z-ADDJ4KBUK    #TNKO
     C                     MOVELJ4HIN1    #HIN1
     C                     MOVELJ4HIN2    #HIN2
     C                     MOVELJ4HIN3    #HIN3
      *
     C           #HIN2     IFNE *BLANK
     C                     MOVEL'-'       #HINA
     C                     END
      *
     C           #HIN3     IFNE *BLANK
     C                     MOVEL'-'       #HINB
     C                     END
      *
     C           J4HNTE    IFNE '0'
     C           J4HNTE    ANDNE'1'
     C                     MOVEA'1'       *IN,21
     C                     ELSE
     C                     MOVEA'0'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
      * MAX mﾞｰj <16>
     C           CNTR      CABEQ16        @@@
E002 C                     END
     C           @END      TAG
E001 C  N40                END
      *
     C           @@@       TAG
      *  fﾞbnc mﾞｰj oﾆ
B001 C           RRN       IFEQ 0
     C                     MOVEA'11111'   *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,12    ERR
     C                     END
      *
     C                     ENDSR
      ******************************************************
     C           #SET2     BEGSR                           *
      ******************************************************
     C           STP3      TAG
     C                     EXFMTAJSPW642
      *
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      *
B001 C           *INKC     IFEQ '1'
     C                     MOVEA'1'       *IN,42
     C                     GOTO #SET2E
E001 C                     END
      *
     C           #SET2E    ENDSR
      ******************************************************
     C           ROLLUP    BEGSR                           *
      ******************************************************
     C                     MOVE *BLANK    SW      1
      *
B001 C                     DO   *HIVAL
     C           MORE2     TAG
     C           GOKI      READEAJSPL341                 40
     C   40                GOTO @ROLE
      *
     C           J4SKJY    IFEQ 'D'
     C           J4SKHZ    IFLE *DATE
     C                     GOTO MORE2
     C                     END
     C                     END
      *
     C                     MOVEL'*'       SW
     C                     Z-ADDJ4WKHZ    @1YMD
     C                     Z-ADDJ4WKTM    @1JI
     C                     Z-ADDJ4WKHZ    @2YMD
     C                     Z-ADDJ4WKTM    @2JI
      *
     C           @2        CABGT$2        @ROLE
     C                     MOVELJ4HIN1    @HIN1
     C                     MOVELJ4HIN2    @HIN2
     C                     MOVELJ4HIN3    @HIN3
      *
     C           @HIN2     IFNE *BLANK
     C                     MOVEL'-'       @HINA
     C                     END
      *
     C           @HIN3     IFNE *BLANK
     C                     MOVEL'-'       @HINB
     C                     END
      *
     C                     MOVELJ4THAI    @THI
     C                     MOVELJ4PAG1    @PNO1
     C                     MOVELJ4PAG2    @PNO2
     C                     MOVELJ4PAG3    @PNO3
     C                     Z-ADDJ4MKSU    @KEIS
     C                     MOVELJ4IROK    @IRO
     C                     Z-ADDJ4WKHZ    @THIZ
     C                     Z-ADDJ4WKTM    @TTIM
     C                     Z-ADDJ4WMJY    @GRYO
     C                     Z-ADDJ4MKSU    @KEIS
     C                     MOVELJ4IROK    @IRO
     C                     Z-ADDJ4WKHZ    @THIZ
     C                     Z-ADDJ4WKTM    @TTIM
     C                     MOVELJ4KANK    #KNKB
     C                     MOVELJ4ZETI    #ZNO
     C                     MOVELJ4THAI    #TNO
     C                     MOVELJ4PAG1    #PNO1
     C                     MOVELJ4PAG2    #PNO2
     C                     MOVELJ4PAG3    #PNO3
     C                     MOVELJ42JKA    #2JIK
     C                     MOVELJ4TASY    #TISG
     C                     MOVELJ4SYKO    #SYKB
     C                     MOVELJ4HKBR    #HAKO
     C                     Z-ADDJ4MKSU    #KEIS
     C                     MOVELJ4IROK    #IRO
     C                     MOVELJ4HKFA    #MHKO
     C                     Z-ADDJ4TANJ    #TANJ
     C                     Z-ADDJ4WKHZ    #THIZ
     C                     Z-ADDJ4WKTM    #TTIM
     C                     Z-ADDJ4WMJY    #TNMJ
     C                     Z-ADDJ4MKKB    #KIBN
     C                     Z-ADDJ4KEHZ    #KHIZ
     C                     Z-ADDJ4KETM    #KTIM
     C                     Z-ADDJ4WAIT    #KEIJ
     C                     MOVELJ4HSUK    #TNSS
     C                     Z-ADDJ4KBUH    #TNHK
     C                     Z-ADDJ4KBUK    #TNKO
     C                     MOVELJ4HIN1    #HIN1
     C                     MOVELJ4HIN2    #HIN2
     C                     MOVELJ4HIN3    #HIN3
      *
     C           #HIN2     IFNE *BLANK
     C                     MOVEL'-'       #HINA
     C                     END
      *
     C           #HIN3     IFNE *BLANK
     C                     MOVEL'-'       #HINB
     C                     END
      *
     C           J4HNTE    IFNE '0'
     C           J4HNTE    ANDNE'1'
     C                     MOVEA'1'       *IN,21
     C                     ELSE
     C                     MOVEA'0'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
     C           CNTR      CABEQ16        @ROLE
      *
     C           @END1     TAG
E001 C  N40                END
      *
     C           @ROLE     TAG
      *  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
B001 C           SW        IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
E001 C                     END
      *
     C                     ENDSR
      *****************************************************************
**  MSG (ERROR MESSAGE )
E-01 INPUT MACHINE
E-02 INPUT ADMITTED DAY START
E-03 ADMITTED DAY START ISN'T RIGHT
E-04 INPUT START ADMITTED TIME
E-05 START ADMITTED TIME ISN'T RIGHT
E-06 INPUT ADMITTED DAY EXIT
E-07 EXIT ADMITTED TIME ISN'T RIGHT
E-08 INPUT EXIT ADMITTED TIME
E-09 EXIT ADMITTED TIME ISN'T RIGHT
E-10 ADMITTED DAY START IS BIGGER THAN EXIT DAY
E-11 START ADMITTED TIME IS BIGGER THAN EXIT TIME
E-12 THERE ISN'T APPLICABLE DATA.
