     H            Y.
      ** AJSR74 **************************************
      * DELETE  OF PLATING BREAKDOWN FILE            *
      * PROGRAM ID.  : AJSR74. <RPG>                 *
      * CREATE DATE. : 1997/MAR/19.                  *
      * AUTHOR.      : S.OHTAKE.                     *
      ************************************************
     FAJSPP30 IP  E                    DISK
     FAJSWP78 O   F      87            DISK                      A
     FAJSWP79 O   F      87            DISK                      A
     FQPRINT  O   F     133     OF     PRINTER
     I            DS
     I                                        1  87 DATA
     I                                        1   1 J3SKJY
     I                                        2   50J3SKYY
     I                                        6   70J3SKMM
     I                                        8   90J3SKDD
     I                                       10  130J3KOYY
     I                                       14  150J3KOMM
     I                                       16  170J3KODD
     I                                       18  190J3KOHH
     I                                       20  210J3KOSS
     I                                       22  31 J3KOME
     I                                       32  390J3BRHZ
     I                                       32  350J3BRYY
     I                                       36  370J3BRMM
     I                                       38  390J3BRDD
     I                                       40  410J3BRJI
     I                                       42  430J3BRFN
     I                                       44  450J3BRBY
     I                                       46  490J3REYY
     I                                       50  510J3REMM
     I                                       52  530J3REDD
     I                                       54  550J3REJI
     I                                       56  570J3REFN
     I                                       58  590J3REBY
     I                                       60  630J3BTIM
     I                                       64  670J3BRCD
     I                                       68  87 J3BRNA
     C           *ENTRY    PLIST
     C                     PARM           PDELHZ  8
     C                     PARM           USRSW   1
     C                     MOVE PDELHZ    DELHZ   80
     C*
     C           *IN01     IFEQ '0'
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     SETON                     01
     C                     END
     C*
     C           RRN       ADD  1         RRN     60
     C*
     C********   DELHZ     IFLE J3TOHZ
     C           J3BRHZ    IFGT DELHZ
     C                     EXCPTOUT1
     C                     ELSE
     C                     EXCPTOUT2
     C           DEL       ADD  1         DEL     60
     C                     EXCPTME
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTHD
     C                     END
     C                     END
     C*
     CLR                   EXCPTTO
     OAJSWP78 EADD             OUT1
     O                         J3SKJY     1
     O                         J3SKYY     5
     O                         J3SKMM     7
     O                         J3SKDD     9
     O                         J3KOYY    13
     O                         J3KOMM    15
     O                         J3KODD    17
     O                         J3KOHH    19
     O                         J3KOSS    21
     O                         J3KOME    31
     O                         J3BRYY    35
     O                         J3BRMM    37
     O                         J3BRDD    39
     O                         J3BRJI    41
     O                         J3BRFN    43
     O                         J3BRBY    45
     O                         J3REYY    49
     O                         J3REMM    51
     O                         J3REDD    53
     O                         J3REJI    55
     O                         J3REFN    57
     O                         J3REBY    59
     O                         J3BTIM    63
     O                         J3BRCD    67
     O                         J3BRNA    87
     OAJSWP79 EADD             OUT2
     O                         J3SKJY     1
     O                         J3SKYY     5
     O                         J3SKMM     7
     O                         J3SKDD     9
     O                         J3KOYY    13
     O                         J3KOMM    15
     O                         J3KODD    17
     O                         J3KOHH    19
     O                         J3KOSS    21
     O                         J3KOME    31
     O                         J3BRYY    35
     O                         J3BRMM    37
     O                         J3BRDD    39
     O                         J3BRJI    41
     O                         J3BRFN    43
     O                         J3BRBY    45
     O                         J3REYY    49
     O                         J3REMM    51
     O                         J3REDD    53
     O                         J3REJI    55
     O                         J3REFN    57
     O                         J3REBY    59
     O                         J3BTIM    63
     O                         J3BRCD    67
     O                         J3BRNA    87
     OQPRINT  E  102           HD
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                                   10 'AJSR74'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O                                   52 'PLATING BREAKDOWN DATA'
     O                                   66 'DELETE RECORD'
     O                                   79 'DETAILS LIST'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  1             HD
     O                                    6 'REC NO'
     O                                   16 '*...+... '
     O                                   26 '1 ...+... '
     O                                   36 '2 ...+... '
     O                                   46 '3 ...+... '
     O                                   56 '4 ...+... '
     O                                   66 '5 ...+... '
     O                                   76 '6 ...+... '
     O                                   86 '7 ...+... '
     O                                   96 '8 ...+... '
     O                                  106 '9 ...+... '
     O        E  1             ME
     O                         RRN   3    6
     O                         DATA      93
     O        E 11             TO
     O                                   20 'TOTAL DELETE COUNT'
     O                         RRN   3   30
     O                                   38 '/'
     O                         DEL   3   48
