     H            Y.
      ** AJSRF2 *******************************************************
      * ジオメット投入実績ＥＸＣＥＬへ転送
      *  改善シート№:18-565
      *  実施日　　　:2019.02.12
      *  実施者　　　:Y.NAKANO
      *****************************************************************
     FAJSPWF2 CF  E                    WORKSTN
     F                                              KINFDS INFDS
      *
      *  PLATING  ADMIT RESULTS FILES.     *
     FAJSPL67 IF  E           K        DISK
      *
      *  WORK FILE
     FAJSWPF3 UF  E           K        DISK                      A
      *
      * CSV DATA
     FAJSWPF4 O   F     128            DISK
      *===============================================================
     E                    ER      1  10 60
      *===============================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
      *プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      * 投入年月　から
     I            DS
     I                                        1   60@STYM
     I                                        1   40@STYY
     I                                        5   60@STMM
      * 投入年月　まで
     I            DS
     I                                        1   60@EDYM
     I                                        1   40@EDYY
     I                                        5   60@EDMM
      * 投入年月
     I            DS
     I                                        1   60J6KEYM
     I                                        1   40J6KEIY
     I                                        5   60J6KEIM
     C*===============================================================
     C*
     C           *ENTRY    PLIST
     C                     PARM           @PARM6  1
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVE '#INIT   '@STEP   8
      *
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#CHK1 F5'#CHK1
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * 初期ﾈｮmb
      *===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           @TIME
     C                     MOVE ' '       @@UMU   1
     C                     MOVE *BLANK    @PARM6
      *
     C                     CLEARDSP01
     C                     MOVE 'I'       @AI
     C                     MOVE '#DSP1   '@STEP
      *
     C                     ENDSR
      *===============================================================
      *  指示画面
      *===============================================================
     C           #DSP1     BEGSR
      *
     C                     EXFMTDSP01
     C                     SETOF                     99
     C                     MOVEA'00000000'*IN,11           11-18
     C                     MOVE *BLANK    @ERR
      *
     C                     SELEC
     C* < F1 >
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C* < F5 >
     C           *INKE     WHEQ *ON
     C                     MOVE '#CHK1 F5'@STEP
     C* <    >
     C                     OTHER
     C                     MOVE '#CHK1   '@STEP
     C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
      *  指示画面チェック
      *===============================================================
     C           #CHK1     BEGSR
      *
      * YYMM (11,12,13,14)
      *
     C           @STYM     IFEQ 0
     C                     SETON                     111299
     C                     MOVELER,1      @ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
     C*
     C           @EDYM     IFEQ 0
     C                     Z-ADD@STYM     @EDYM
     C                     ENDIF
      *
     C           @AI       IFEQ *BLANK
     C                     SETON                     1599
     C                     MOVELER,5      @ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
      *
     C           @AI       IFEQ 'A'
     C           @AI       OREQ 'I'
     C                     MOVE @AI       @PARM6
     C                     ELSE
     C                     MOVELER,6      @ERR
     C                     SETON                     1599
     C                     GOTO $CHK1Z
     C                     ENDIF
      *
     C           KEY01     KLIST
     C                     KFLD           @STYY
     C                     KFLD           @STMM
      *                             データの有無チェック
     C                     MOVE ' '       @@UMU   1
     C                     EXSR ##WORK
      *
     C           @@UMU     IFEQ ' '
     C                     SETON                     111213
     C                     SETON                     14  99
     C                     MOVELER,4      @ERR
     C                     GOTO $CHK1Z
     C                     ENDIF
      *
      *-------------------------*
     C           $CHK1Z    TAG
      *-------------------------*
     C           *IN99     IFEQ *OFF
     C           @STEP     ANDEQ'#CHK1 F5'
     C*                             集計処理
     C                     EXSR ##WORK
     C                     EXSR ##CSV
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
     C                     ENDSR
      *===============================================================
      *===============================================================
     C           ##WORK    BEGSR
      *
     C           KEY02     KLIST
     C                     KFLD           J6MKKB
     C                     KFLD           J6KEIY
     C                     KFLD           J6KEIM
      *
     C           KEY01     SETLLAJSPL67
      *-------------------------
     C                     DO   *HIVAL
     C                     READ AJSPL67                  90
     C   90                LEAVE
     C           J6SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C* 投入年月
     C           J6KEYM    IFGT @EDYM
     C                     LEAVE
     C                     ENDIF
     C*                             データの有無チェック
     C           @@UMU     IFEQ ' '
     C*          *IN90     ANDEQ*OFF
     C                     MOVE '*'       @@UMU   1
     C                     LEAVE
     C                     ENDIF
     C*                             集計処理
     C           KEY02     CHAINAJSWPF3              91
     C           *IN91     IFEQ *OFF
     C                     ADD  J6WAIT    W1WMJY
     C                     UPDATAJSWPF31
     C                     ELSE
     C                     MOVELJ6MKKB    W1MKKB           PLATING MACHINE NO
     C                     Z-ADDJ6KEIY    W1WINY           WORK ADMITTABLE YEAR
     C                     Z-ADDJ6KEIM    W1WINM           WORK ADMITTABLE MONTH
     C                     Z-ADDJ6WAIT    W1WMJY
     C                     WRITEAJSWPF31
     C                     ENDIF
     C*
     C                     ENDDO
      *-------------------------
     C                     ENDSR
      *===============================================================
      *===============================================================
     C           ##CSV     BEGSR
     C*
     C           *LOVAL    SETLLAJSWPF3
     C                     EXCPT$HED
     C*-------------------------
      * SHIPPING SHORTAGE FILE                         *
     C*-------------------------
     C                     DO   *HIVAL
     C                     READ AJSWPF3                  90
     C   90                LEAVE
      *
     C                     EXCPT$DATA
     C                     ENDDO
     C*-------------------------
     C*-------------------------
     C                     ENDSR
      *===============================================================
      *===============================================================
     OAJSWPF4 E                $HED
     O                                      'MACHINE NO,'
     O                                      'WORK DATE YYYY,'
     O                                      'WORK DATE MM,'
     O                                      'WEIGHT,'
      *********
     O        E                $DATA
     O                         W1MKKB
     O                                      ','
     O                         W1WINY
     O                                      ','
     O                         W1WINM
     O                                      ','
     O                         W1WMJY       '        0 .  '
     O                                      ','
      *===============================================================
**  ERROR
E-01 INPUT YEAR MONTH
E-02
E-03
E-04 NO DATA.
E-05 INPUT CHOICES
E-06 CHOICES IS A OR I
