     H            Y/
     FAJSPP10 IF  E                    DISK
     FAJSPL28 IF  E           K        DISK
     FAJSWPX1 O   F    2048            DISK
     I            DS
     I                                        1  120W@WIDT
     I                                        1   40W@WINY
     I                                        5   60W@WINM
     I                                        7   80W@WIND
     I                                        9  100W@WINJ
     I                                       11  120W@WINF
     I            DS
     I                                        1  120J1WIDT
     I                                        1   40J1WINY
     I                                        5   60J1WINM
     I                                        7   80J1WIND
     I                                        9  100J1WINJ
     I                                       11  120J1WINF
     I            DS
     I                                        1  120J2KEDT
     I                                        1   40J2KEIY
     I                                        5   60J2KEIM
     I                                        7   80J2KEID
     I                                        9  100J2KEIJ
     I                                       11  120J2KEIF
      *
     C                     Z-ADD0         W@WIDT
      *
     C           1510000   SETLLAJSPP10
      *
     C                     DO   *HIVAL
     C                     READ AJSPP10                  77
     C   77                LEAVE
     C           J1MKKB    IFNE '11'
     C                     ITER
     C                     END
      *
     C           W@WIDT    IFEQ 0
     C                     Z-ADDJ1WIDT    W@WIDT
     C                     END
      *
     C           J1WIDT    IFLT W@WIDT
     C                     ADD  1         SAKA    80
     C                     END
      *
     C                     Z-ADDJ1WINY    W@WINY
     C                     Z-ADDJ1WINM    W@WINM
     C                     Z-ADDJ1WIND    W@WIND
     C                     Z-ADDJ1WINJ    W@WINJ
     C                     Z-ADDJ1WINF    W@WINF
      *
     C                     EXSR #AJS
      *
     C                     EXCPTODAT
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C           #AJS      BEGSR
     C                     Z-ADD0         @CNT    40
     C           J1ZBR1    SETLLAJSPL28
     C                     DO   *HIVAL
     C           J1ZBR1    READEAJSPL28                  88
     C   88                LEAVE
     C           J2KEDT    IFLT J1WIDT
     C                     ITER
     C                     END
     C                     ADD  1         @CNT    40
     C                     ENDDO
     C                     ENDSR
      *
     OAJSWPX1 E                ODAT
     O                         J1WINY
     O                         J1WINM
     O                         J1WIND
     O                                      ','
     O                         J1WINJ
     O                         J1WINF
     O                                      ','
     O                         J1HIN1
     O                         J1HIN2
     O                         J1HIN3
     O                                      ','
     O                         J1ZETI
     O                                      ','
     O                         J1THAI
     O                                      ','
     O                         J1PAG1
     O                                      ','
     O                         J1PAG2
     O                                      ','
     O                         J1PAG3
     O                                      ','
     O                         J1PAG4
     O                                      ','
     O                         J1ZBR1
     O                                      ','
     O                         J1ZBR2
     O                                      ','
     O                         @CNT
