     H            Y.
      *
     E                    OKT        15  3               工程
     E                    OTK        15  6               所番地
     E                    OSY        15  1               か種
     E                    OBM        15  4               部門
      *
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@RTN   1
      * W503292S439R
     C* * *                MOVE 'W5032'   P@HIN1  5
     C* * *                MOVE '92S43'   P@HIN2  5
     C* * *                MOVE '9R'      P@HIN3  2
      * W500222S450
     C* * *                MOVE 'W5002'   P@HIN1  5
     C* * *                MOVE '22S45'   P@HIN2  5
     C* * *                MOVE '0 '      P@HIN3  2
      * NOTFOUND
     C* * *                MOVE 'NOTFO'   P@HIN1  5
     C* * *                MOVE 'UND  '   P@HIN2  5
     C* * *                MOVE '  '      P@HIN3  2
      *
     C                     MOVE *BLANK    P@RTN   1
      *
     C                     MOVE P@HIN1    CBSHN1  5
     C                     MOVE P@HIN2    CBSHN2  5
     C                     MOVE P@HIN3    CBSHN3  2
      *
     C                     MOVEL*DATE     INYMDB
     C                     MOVE '01'      INYMDB
      *
     C                     MOVEL'0'       OPNCLS
      *
     C                     CALL 'AAMRS0'
      *入力パラメータ
     C                     PARM           CBSHN1
     C                     PARM           CBSHN2
     C                     PARM           CBSHN3
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
      *
     C                     MOVEL'0'       OPNCLS
     C           STATUS    IFEQ '9'
     C                     GOTO @END
     C                     ENDIF
      *
     C                     MOVEAPKOT      OKT
     C                     MOVEAPTKR      OTK
     C                     MOVEAPSHR      OSY
     C                     MOVEAPBMN      OBM
      *
     C                     MOVE *BLANK    FLG1    1
     C                     MOVE *BLANK    FLG2    1
      *
     C           1         DO   15        @X      30
      *
     C           OKT,@X    IFEQ *BLANK
     C                     LEAVE
     C                     END
      *
     C           FLG1      IFEQ *BLANK
     C           OBM,@X    IFEQ '0111'
     C           OKT,@X    IFEQ 'BZ '
     C           OKT,@X    OREQ 'DS '
     C           OKT,@X    OREQ 'DSM'
     C                     MOVE '*'       FLG1
     C                     ITER
     C                     END
     C                     END
     C                     END
      *
     C           FLG1      IFEQ '*'
     C           OBM,@X    IFNE '0111'
     C                     GOTO @END
     C                     END
     C           OKT,@X    IFNE 'TSL'
     C                     GOTO @END
     C                     END
     C                     END
      *
     C                     ENDDO
      *
     C           FLG1      IFNE '*'
     C                     GOTO @END
     C                     END
      *
     C                     MOVE '*'       P@RTN
      *
     C                     GOTO @END
      *
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRS0'
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           INYMDB 10
     C                     PARM           OPNCLS  1
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C           @END      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *
