     H            Y.                                                      DAD000
     F** AJSR41 **********************************
     F*FA M/F FOR CHUBU RIKA
     F* TUNNEL KANBAN M/F                      *
     F* C:N.HAYAKAWA           1990.03.05        *
     F********************************************
     FAAGTL06 IF  E           K        DISK
     FAJSPL01 IF  E           K        DISK
     FAJSWP41 O   F     298            DISK                      A
     C************************************
     C*トンネルかんばんマスターの読込み*
     C************************************
     C           *LOVAL    SETLLAAGTL061
     C                     SETOF                     10
     C           TOLOOP    TAG
     C                     READ AAGTL061                 10
     C           *IN10     IFEQ '1'
     C                     GOTO TONEND
     C                     ELSE
     C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    IFLE *DATE
     C                     GOTO TOLOOP
     C                     END
     C                     END
     C                     END
     C*有効日・失効日のチェック*
     C           O4UKHZ    IFLE *DATE
     C           O4STHZ    ANDGT*DATE
     C                     ELSE
     C                     GOTO TOLOOP
     C                     END
     C**********************************
     C*    ＦＡマスターにチェイン    *
     C**********************************
     C                     SETOF                     99
     C           KEY1      KLIST
     C                     KFLD           O4SHN1
     C                     KFLD           O4SHN2
     C                     KFLD           O4SHN3
     C           KEY1      SETLLAJSPL011
     C                     SETOF                     20
     C           LOOP1     TAG
     C           KEY1      READEAJSPL011                 20
     C           *IN20     IFEQ '0'
     C*引ける*
     C           J1SKJY    IFEQ 'D'
     C           J1SKHZ    IFLE *DATE
     C                     GOTO LOOP1
     C                     END
     C                     END
     C*引けない*
     C                     ELSE
     C                     SETON                     99
     C                     END
     C**********************************
     C*         更新区分入力         *
     C**********************************
     C           *IN99     IFEQ '1'
     C                     MOVE '0'       UPKBN   1
     C                     MOVE ' '       SYKBN   1
     C                     Z-ADD0         JISEN   31
     C                     ELSE
     C                     MOVE '1'       UPKBN
     C                     MOVE J1MKSK    SYKBN
     C                     Z-ADDJ1MKJI    JISEN
     C                     END
     C*
     C                     EXCPTDTA
     C                     GOTO TOLOOP
     C**************************
     C*         終了         *
     C**************************
     C           TONEND    TAG
     C                     SETON                     LR
     C                     RETRN
     OAJSWP41 EADD             DTA
     O                         O4SKJY     1
     O                         O4SKYY     5
     O                         O4SKMM     7
     O                         O4SKDD     9
     O                         O4KOYY    13
     O                         O4KOMM    15
     O                         O4KODD    17
     O                         O4KOHH    19
     O                         O4KOSS    21
     O                         O4KOME    31
     O                         O4SHN1    36
     O                         O4SHN2    41
     O                         O4SHN3    43
     O                         O4TKYY    47
     O                         O4TKMM    49
     O                         O4TKDD    51
     O                         O4TBIN    53
     O                         O4UKYY    57
     O                         O4UKMM    59
     O                         O4UKDD    61
     O                         O4UBIN    63
     O                         O4STYY    67
     O                         O4STMM    69
     O                         O4STDD    71
     O                         O4SBIN    73
     O                         O4KTEI    76
     O                         O4BMON    80
     O                         O4ATYP    81
     O                         O4BAN1    82
     O                         O4BAN2    84
     O                         O4BAN3    86
     O                         O4BAN4    87
     O                         O4ATOH    89
     O                         O4MAEK    92
     O                         O4MAKB    96
     O                         O4MTYP    97
     O                         O4MTK1    98
     O                         O4MTK2   100
     O                         O4MTK3   102
     O                         O4MTK4   103
     O                         O4MAEH   105
     O                         O4KOA1   108
     O                         O4KOA2   111
     O                         O4KOA3   114
     O                         O4KOB1   117
     O                         O4KOB2   120
     O                         O4KOB3   123
     O                         O4KOCD   127
     O                         O4KTYP   128
     O                         O4KAEH   129
     O                         O4RAIN   130
     O                         O4CBKO   132
     O                         O4BARA   134
     O                         O4BARB   136
     O                         O4JOK1   138
     O                         O4JOK2   140
     O                         O4JOK3   142
     O                         O4JOK4   144
     O                         O4JOK5   146
     O                         O4JOK6   148
     O                         O4KAK1   150
     O                         O4KAK2   152
     O                         O4KAK3   154
     O                         O4SYOS   159
     O                         O4SYOT   160
     O                         O4LTIM   164
     O                         O4KEIS   168
     O                         O4STI1   170
     O                         O4RIBH   184
     O                         O4LOTO   187
     O                         O4MAXH   190
     O                         O4YOUS   194
     O                         O4KCD1   195
     O                         O4KCD2   196
     O                         O4MEKI   203
     O                         O4ZETI   207
     O                         O4KSKB   208
     O                         O4KALL   211
     O                         O4MAIS   214
     O                         O4KMIN   217
     O                         O4KMAX   220
     O                         O4SRMS   223
     O                         O4ALHK   226
     O                         O4MXHK   229
     O                         O4KSHK   230
     O                         O4KTSU   239
     O                         O4KSSU   248
     O                         O4KOUT   249
     O                         O4DOUT   250
     O                         O4TISU   253
     O                         O4DTKO   254
     O                         O4DTHE   255
     O                         O4JDMS   258
     O                         O4NHH1   260
     O                         O4NMM1   262
     O                         O4NHH2   264
     O                         O4NMM2   266
     O                         O4SK11   268
     O                         O4SK21   270
     O                         O4SK31   272
     O                         O4SK12   274
     O                         O4SK22   276
     O                         O4SK32   278
     O                         O4SHIY   280
     O                         O4HINM   285
     O                         O4KASI   292
     O                         O4ZMEN   293
     O                         UPKBN    294
     O                         SYKBN    295
     O                         JISEN    298
