     H            Y.
      ** AJSR51 *******************************************************
      * INQUIRY OF DACRODIZING PLATING ADMIT RESULT DATA. (MACHINE NO)*
      * PROGRAM ID.  : AJSR51. <RPG>                                  *
      * CREATE DATE. : 1997/MAR/17.                                   *
      * AUTHOR.      : S.OHTAKE.                                      *
      *                                                               *
JW1   * JW     20161130 DISPLAY LOGIACL WGT IN WINDOW                 *
      *****************************************************************
     FAJSPW51 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FAJSPL55 IF  E           K        DISK
     FAJSPLCD IF  E           K        DISK
JW1  FFCEPL01 IF  E           K        DISK
      *****************************************************************
     E                    MSG     1   6 60
      *****************************************************************
     I            DS
     I                                        1  14 HIN
     I                                        1   5 J5HIN1
     I                                        6   6 HINA
     I                                        7  11 J5HIN2
     I                                       12  12 HINB
     I                                       13  14 J5HIN3
     I            DS
     I                                        1   80J5SKHZ
     I                                        1   40J5SKYY
     I                                        5   60J5SKMM
     I                                        7   80J5SKDD
     I            DS
     I                                        1  120J5WKHT
     I                                        1   80J5WKHZ
     I                                        1   40J5WINY
     I                                        5   60J5WINM
     I                                        7   80J5WIND
     I                                        9  120J5WKTM
     I                                        9  100J5WINJ
     I                                       11  120J5WINF
     I            DS
     I                                        1  120J5KEHT
     I                                        1   80J5KEHZ
     I                                        1   40J5KEIY
     I                                        5   60J5KEIM
     I                                        7   80J5KEID
     I                                        9  120J5KETM
     I                                        9  100J5KEIJ
     I                                       11  120J5KEIF
     I            DS
     I                                        1  120SHIZT
     I                                        1   80SHIZ
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I                                        9  120STIM
     I                                        9  100STIMH
     I                                       11  120STIMM
     I            DS
     I                                        1  120EHIZT
     I                                        1   80EHIZ
     I                                        1   40EYY
     I                                        5   60EMM
     I                                        7   80EDD
     I                                        9  120ETIM
     I                                        9  100ETIMH
     I                                       11  120ETIMM
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *****************************************************************
      *  START  PROGRAM <AJSR51>
      *****************************************************************
     C           STP0      TAG
     C                     MOVE *BLANK    MACH
     C                     Z-ADD*ZERO     SHIZ
     C                     Z-ADD*ZERO     EHIZ
     C                     Z-ADD*ZERO     SHIZT
     C                     Z-ADD*ZERO     EHIZT
     C                     Z-ADD99        ETIMH
     C                     Z-ADD99        ETIMM
      ******************************************************
      *  EXFMT  <JSPW511>                                  *
      ******************************************************
     C           STP1      TAG
     C                     Z-ADD*ZERO     RRN     50
     C                     EXFMTAJSPW511
     C                     MOVEA'000'     *IN,01
     C                     SETOF                     0405
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      * F1: END
B001 C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
E001 C                     END
      ******************************************************
      *  <fﾞx] 1 ﾉ kｩｮh>                                   *
      ******************************************************
B001 C           MACH      IFEQ *BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,1     ERR
     C                     GOTO STP1
E001 C                     END
      *
B001 C           SHIZT     IFNE *ZERO
B002 C           SMM       IFGT 12
     C           SMM       ORLT 01
     C           SDD       ORGT 31
     C           SDD       ORLT 01
     C                     MOVEA'1'       *IN,02
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,4     ERR
     C                     GOTO STP1
E002 C                     END
E001 C                     END
      *
B001 C           EHIZ      IFEQ *ZERO
     C                     Z-ADD99999999  EHIZ
     C                     END
B001 C           EHIZT     IFEQ *ZERO
     C                     Z-ADD99999999  EHIZ
     C                     Z-ADD9999      ETIM
     C                     END
B001 C           EHIZ      IFNE 99999999
B002 C           EMM       IFGT 12
     C           EMM       ORLT 01
     C           EDD       ORGT 31
     C           EDD       ORLT 01
     C                     MOVEA'1'       *IN,03
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,6     ERR
     C                     GOTO STP1
E002 C                     END
E001 C                     END
      *
     C           KEY1      KLIST
     C                     KFLD           MACH
     C                     KFLD           SYY
     C                     KFLD           SMM
     C                     KFLD           SDD
      *
     C           KEY2      KLIST
     C                     KFLD           MACH
      *
JW1  C           KEY3      KLIST
 |   C                     KFLD           MACH
 |   C                     KFLD           SYY
 |   C                     KFLD           SMM
 |   C                     KFLD           SDD
 |   C                     KFLD           STIMH
JW1  C                     KFLD           STIMM
      *
     C                     EXSR #SB777
     C           @LOOP     TAG
     C                     Z-ADD*ZERO     CNTR    50
     C                     EXSR #SET
      *
     C           ERR       IFNE *BLANK
     C                     MOVEA'1'       *IN,99
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      ******************************************************
      *  EXFMT  (fﾞx] 2)                                   *
      ******************************************************
     C           STP2      TAG
     C                     MOVEA'0'       *IN,81
     C                     WRITEDSP2X
     C                     MOVEA'1'       *IN,91
     C                     EXFMTDSP2C
     C                     MOVEA'0'       *IN,91
      *
     C                     MOVEA'0'       *IN,44
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      * F3: BACK
B001 C           *INKC     IFEQ '1'
     C                     GOTO STP0
E001 C                     END
      * F9: COLOR
     C           *INKI     IFEQ '1'
     C                     EXSR #SB778
     C                     GOTO STP2
     C                     ENDIF
      * F12:
     C           *INKL     IFEQ '1'
     C                     WRITEW2
     C                     EXFMTAJSPW51Y
     C                     GOTO STP2
     C                     ENDIF
      *  ﾜｰﾓ aｮﾎﾟ
     C           *IN,81    IFEQ '1'
     C                     Z-ADD*ZERO     CNTR
     C                     EXSR ROLLUP
     C                     Z-ADDRRN       RCDNBR
     C   44                MOVEA'1'       *IN,99
     C                     GOTO STP2
     C                     END
      *
     C                     Z-ADD1         RCDNBR
      *
     C                     Z-ADDRRN       XXRRN   50
B001 C                     DO   *HIVAL    RRN@@   50
     C           RRN@@     CHAINDSP2R                42
B002 C           *IN,42    IFEQ '0'
B003 C           OP        IFEQ 'M'
      *  ﾅﾎﾞﾎｦbﾓ ﾍﾍｭcﾆﾞ ---> fﾞx]2 ﾉ ﾎｧｰﾓnﾞ
     C                     MOVEL#KNKB     XXKNKB
     C                     MOVEL#ZNO      XXZNO
     C                     MOVEL#TNO      XXTNO
     C                     MOVEL#PNO1     XXPNO1
     C                     MOVEL#PNO2     XXPNO2
     C                     MOVEL#PNO3     XXPNO3
     C                     MOVEL#PNO4     XXPNO4
     C                     MOVEL#2JIK     XX2JIK
     C                     MOVEL#TISG     XXTISG
     C                     MOVEL#SYKB     XXSYKB
     C                     MOVEL#HAKO     XXHAKO
     C                     Z-ADD#KEIS     XXKEIS
     C                     MOVEL#IRO      XXIRO
     C                     Z-ADD#SYOS     XXSYOS
     C                     MOVEL#MHKO     XXMHKO
     C                     Z-ADD#TANJ     XXTANJ
     C                     Z-ADD#THIZ     XXTHIZ
     C                     Z-ADD#TTIM     XXTTIM
     C                     Z-ADD#TNMJ     XXTNMJ
     C                     MOVE #KIBN     XXKIBN
     C                     Z-ADD#KHIZ     XXKHIZ
     C                     Z-ADD#KTIM     XXKTIM
     C                     Z-ADD#KEIJ     XXKEIJ
     C                     MOVE #TOCD     XXTOCD
     C                     MOVE #ZAI1     XXZAI1
     C                     MOVE #ZAI2     XXZAI2
     C                     MOVE #TOCM     XXTOCM
     C                     MOVE #CTRK     XXCTRK
     C                     MOVE #CTRD     XXCTRD
     C                     MOVE #SPNK     XXSPNK
     C                     MOVE #SPND     XXSPND
      *  EXFMT fﾞx] 2
     C                     EXSR #SET2
     C                     MOVE *BLANK    OP
     C                     UPDATDSP2R
E003 C                     END
E002 C                     END
E001 C  N42                END
      *
     C                     Z-ADD*ZERO     RRN
     C                     GOTO @LOOP
      ******************************************************
     C           #SET      BEGSR                           *
      ******************************************************
      *  ﾅﾎﾞﾎｦbﾓ ﾈｮn
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
      *
     C           KEY1      SETLLAJSPL551
      *  ﾅﾎﾞﾎｦbﾓ ﾛﾃｰnﾞ CLR
     C                     MOVE *BLANK    OP
     C                     MOVE *BLANK    @HIN
     C                     MOVE *BLANK    @THI
     C                     MOVE *BLANK    @PNO1
     C                     MOVE *BLANK    @PNO2
     C                     MOVE *BLANK    @PNO3
     C                     MOVE *BLANK    @PNO4
     C                     Z-ADD*ZERO     @KEIS
     C                     MOVE *BLANK    @IRO
     C                     Z-ADD*ZERO     @THIZ
     C                     Z-ADD*ZERO     @TTIM
     C                     Z-ADD*ZERO     @GRYO
     C                     MOVE *BLANK    #KNKB
     C                     MOVE *BLANK    #ZNO
     C                     MOVE *BLANK    #TNO
     C                     MOVE *BLANK    #PNO1
     C                     MOVE *BLANK    #PNO2
     C                     MOVE *BLANK    #PNO3
     C                     MOVE *BLANK    #PNO4
     C                     MOVE *BLANK    #2JIK
     C                     MOVE *BLANK    #TISG
     C                     MOVE *BLANK    #SYKB
     C                     MOVE *BLANK    #HAKO
     C                     Z-ADD*ZERO     #KEIS
     C                     MOVE *BLANK    #IRO
     C                     Z-ADD*ZERO     #SYOS
     C                     MOVE *BLANK    #MHKO
     C                     Z-ADD*ZERO     #TANJ
     C                     Z-ADD*ZERO     #THIZ
     C                     Z-ADD*ZERO     #TTIM
     C                     Z-ADD*ZERO     #TNMJ
     C                     MOVE *ZERO     #KIBN
     C                     Z-ADD*ZERO     #KHIZ
     C                     Z-ADD*ZERO     #KTIM
     C                     Z-ADD*ZERO     #KEIJ
     C                     MOVE *BLANK    #TOCD
     C                     MOVE *BLANK    #ZAI1
     C                     MOVE *BLANK    #ZAI2
     C                     MOVE *BLANK    #TOCM
     C                     MOVE *BLANK    #CTRK
     C                     MOVE *BLANK    #CTRD
     C                     MOVE *BLANK    #SPNK
     C                     MOVE *BLANK    #SPND
      *
B001 C                     DO   *HIVAL
     C           MORE1     TAG
     C           KEY2      READEAJSPL551                 40
     C   40                GOTO @@@
      *
     C           J5SKJY    IFEQ 'D'
     C           J5SKHZ    IFLE *DATE
     C                     GOTO MORE1
     C                     END
     C                     END
      *
B002 C           *IN,40    IFEQ '0'
     C                     MOVEA'0'       *IN,21
     C           J5WKHT    CABLTSHIZT     @END
     C           J5WKHT    CABGTEHIZT     @@@
      *
     C           J5HIN2    IFNE *BLANK
     C                     MOVEL'-'       HINA
     C                     END
      *
     C           J5HIN3    IFNE *BLANK
     C                     MOVEL'-'       HINB
     C                     END
     C                     MOVE HIN       @HIN
     C                     MOVELJ5THAI    @THI
     C                     MOVELJ5PAG1    @PNO1
     C                     MOVELJ5PAG2    @PNO2
     C                     MOVELJ5PAG3    @PNO3
     C                     MOVELJ5PAG4    @PNO4
     C                     Z-ADDJ5MKSU    @KEIS
     C                     MOVELJ5IROK    @IRO
     C                     Z-ADDJ5WKHZ    @THIZ
     C                     Z-ADDJ5WKTM    @TTIM
     C                     Z-ADDJ5WMJY    @GRYO
     C                     MOVELJ5KANK    #KNKB
     C                     MOVELJ5ZETI    #ZNO
     C                     MOVELJ5THAI    #TNO
     C                     MOVELJ5PAG1    #PNO1
     C                     MOVELJ5PAG2    #PNO2
     C                     MOVELJ5PAG3    #PNO3
     C                     MOVELJ5PAG4    #PNO4
     C                     MOVELJ52JKA    #2JIK
     C                     MOVELJ5TASY    #TISG
     C                     MOVELJ5SYKO    #SYKB
     C                     MOVELJ5HKBR    #HAKO
     C                     Z-ADDJ5MKSU    #KEIS
     C                     MOVELJ5IROK    #IRO
     C                     Z-ADDJ5SYUY    #SYOS
     C                     MOVELJ5HKFA    #MHKO
     C                     Z-ADDJ5TANJ    #TANJ
     C                     Z-ADDJ5WKHZ    #THIZ
     C                     Z-ADDJ5WKTM    #TTIM
     C                     Z-ADDJ5WMJY    #TNMJ
     C                     MOVE J5MKKB    #KIBN
     C                     Z-ADDJ5KEHZ    #KHIZ
     C                     Z-ADDJ5KETM    #KTIM
     C                     Z-ADDJ5WAIT    #KEIJ
     C                     MOVE J5TOCD    #TOCD
     C                     SETOF                     90
     C           J5TOCD    CHAINAJSPLCD1             90
     C           JASKJY    IFEQ ' '
     C           *IN90     ANDEQ*OFF
     C                     MOVE JAWKNM    #TOCM
     C                     END
     C                     MOVE J5ZBR1    #ZAI1
     C                     MOVE J5ZBR2    #ZAI2
     C                     MOVE J5CTRK    #CTRK
     C                     MOVE J5CTRD    #CTRD
     C                     MOVE J5SPNK    #SPNK
     C                     MOVE J5SPND    #SPND
      *
     C                     MOVEA'0'       *IN,21
     C           J5SAIK    IFEQ '1'
     C                     MOVEA'1'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
      * MAX mﾞｰj <15>
     C           CNTR      CABEQ15        @@@
E002 C                     END
     C           @END      TAG
E001 C  N40                END
      *
     C           @@@       TAG
      *  fﾞbnc mﾞｰj oﾆ
B001 C           RRN       IFEQ 0
     C                     MOVEA'111'     *IN,01
     C                     MOVEA'1'       *IN,99
     C                     MOVELMSG,2     ERR
     C                     END
      *
     C                     ENDSR
      ******************************************************
     C           #SET2     BEGSR                           *
      ******************************************************
     C           STP3      TAG
     C                     EXFMTAJSPW512
      *
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C                     MOVE *BLANK    ERR
      * F3:
B001 C           *INKC     IFEQ '1'
     C                     MOVEA'1'       *IN,42
     C                     GOTO #SET2E
E001 C                     END
      *
     C           #SET2E    ENDSR
      ******************************************************
     C           ROLLUP    BEGSR                           *
      ******************************************************
     C                     MOVE *BLANK    SW      1
B001 C                     DO   *HIVAL
     C           MORE2     TAG
     C           KEY2      READEAJSPL551                 40
     C   40                GOTO @ROLE
      *
     C           J5SKJY    IFEQ 'D'
     C           J5SKHZ    IFLE *DATE
     C                     GOTO MORE2
     C                     END
     C                     END
      *
B002 C           *IN,40    IFEQ '0'
     C           J5WKHT    CABLTSHIZT     @END1
     C           J5WKHT    CABGTEHIZT     @ROLE
     C                     MOVEL'*'       SW
     C                     MOVE HIN       @HIN
     C                     MOVELJ5THAI    @THI
     C                     MOVELJ5PAG1    @PNO1
     C                     MOVELJ5PAG2    @PNO2
     C                     MOVELJ5PAG3    @PNO3
     C                     MOVELJ5PAG4    @PNO4
     C                     Z-ADDJ5MKSU    @KEIS
     C                     MOVELJ5IROK    @IRO
     C                     Z-ADDJ5WKHZ    @THIZ
     C                     Z-ADDJ5WKTM    @TTIM
     C                     Z-ADDJ5WMJY    @GRYO
     C                     MOVELJ5KANK    #KNKB
     C                     MOVELJ5ZETI    #ZNO
     C                     MOVELJ5THAI    #TNO
     C                     MOVELJ5PAG1    #PNO1
     C                     MOVELJ5PAG2    #PNO2
     C                     MOVELJ5PAG3    #PNO3
     C                     MOVELJ5PAG4    #PNO4
     C                     MOVELJ52JKA    #2JIK
     C                     MOVELJ5TASY    #TISG
     C                     MOVELJ5SYKO    #SYKB
     C                     MOVELJ5HKBR    #HAKO
     C                     Z-ADDJ5MKSU    #KEIS
     C                     MOVELJ5IROK    #IRO
     C                     Z-ADDJ5SYUY    #SYOS
     C                     MOVELJ5HKFA    #MHKO
     C                     Z-ADDJ5TANJ    #TANJ
     C                     Z-ADDJ5WKHZ    #THIZ
     C                     Z-ADDJ5WKTM    #TTIM
     C                     Z-ADDJ5WMJY    #TNMJ
     C                     MOVE J5MKKB    #KIBN
     C                     Z-ADDJ5KEHZ    #KHIZ
     C                     Z-ADDJ5KETM    #KTIM
     C                     Z-ADDJ5WAIT    #KEIJ
     C                     MOVE J5TOCD    #TOCD
     C                     SETOF                     90
     C           J5TOCD    CHAINAJSPLCD1             90
     C           JASKJY    IFEQ ' '
     C           *IN90     ANDEQ*OFF
     C                     MOVE JAWKNM    #TOCM
     C                     END
     C                     MOVE J5ZBR1    #ZAI1
     C                     MOVE J5ZBR2    #ZAI2
     C                     MOVE J5CTRK    #CTRK
     C                     MOVE J5CTRD    #CTRD
     C                     MOVE J5SPNK    #SPNK
     C                     MOVE J5SPND    #SPND
      *
     C                     MOVEA'0'       *IN,21
     C           J5SAIK    IFEQ '1'
     C                     MOVEA'1'       *IN,21
     C                     END
      *
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
     C                     WRITEDSP2R
     C           CNTR      CABEQ15        @ROLE
E002 C                     END
     C           @END1     TAG
E001 C  N40                END
      *
     C           @ROLE     TAG
      *  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
B001 C           SW        IFEQ *BLANK
     C                     MOVEA'1'       *IN,44
E001 C                     END
      *
     C                     ENDSR
      *------------------------------*
      * COLOR INFO                   *
      *------------------------------*
     CSR         #SB777    BEGSR
      *
     C                     Z-ADD0         DZCL01
     C                     Z-ADD0         DZCL02
     C                     Z-ADD0         DZCL03
     C                     Z-ADD0         DZCL04
     C                     Z-ADD0         DZCL05
     C                     Z-ADD0         DZCL06
     C                     Z-ADD0         DZCL07
     C                     Z-ADD0         DZCLOT
     C                     Z-ADD0         DZCLT
     C                     Z-ADD0         DZWE01
     C                     Z-ADD0         DZWE02
     C                     Z-ADD0         DZWE03
     C                     Z-ADD0         DZWE04
     C                     Z-ADD0         DZWE05
     C                     Z-ADD0         DZWE06
     C                     Z-ADD0         DZWE07
     C                     Z-ADD0         DZWEOT
     C                     Z-ADD0         DZWET
     C                     MOVEL'0'       GET     1
     C*JW1       KEY1      SETLLAJSPL551
JW1  C           KEY3      SETLLAJSPL551
     C           KEY2      READEAJSPL551                 40
     C           *IN40     DOWEQ'0'
     C*JW1       J5WKHZ    ANDLEEHIZ
JW1  C           J5WKHT    ANDLEEHIZT
     C           J5SKJY    IFEQ 'D'
     C           J5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET     1
      * GET LOGICAL WEIGHT (-->@WGT)
JW1  C                     EXSR #WGT
      *
     C                     SELEC
     C           J5IROK    WHEQ '1'
     C                     ADD  1         DZCL01
     C*                    ADD  J5WMJY    DZWE01
JW1  C                     ADD  @WGT      DZWE01
     C           J5IROK    WHEQ '2'
     C                     ADD  1         DZCL02
     C*                    ADD  J5WMJY    DZWE02
JW1  C                     ADD  @WGT      DZWE02
     C           J5IROK    WHEQ '3'
     C                     ADD  1         DZCL03
     C*                    ADD  J5WMJY    DZWE03
JW1  C                     ADD  @WGT      DZWE03
     C           J5IROK    WHEQ '4'
     C                     ADD  1         DZCL04
     C*                    ADD  J5WMJY    DZWE04
JW1  C                     ADD  @WGT      DZWE04
     C           J5IROK    WHEQ '5'
     C                     ADD  1         DZCL05
     C*                    ADD  J5WMJY    DZWE05
JW1  C                     ADD  @WGT      DZWE05
     C           J5IROK    WHEQ '6'
     C                     ADD  1         DZCL06
     C*                    ADD  J5WMJY    DZWE06
JW1  C                     ADD  @WGT      DZWE06
     C           J5IROK    WHEQ '7'
     C                     ADD  1         DZCL07
     C*                    ADD  J5WMJY    DZWE07
JW1  C                     ADD  @WGT      DZWE07
     C                     OTHER
     C                     ADD  1         DZCLOT
     C*                    ADD  J5WMJY    DZWEOT
JW1  C                     ADD  @WGT      DZWEOT
     C                     ENDSL
     C                     ENDIF
     C           KEY2      READEAJSPL551                 40
     C                     ENDDO
     C                     Z-ADDDZCL01    DZCLT
     C                     ADD  DZCL02    DZCLT
     C                     ADD  DZCL03    DZCLT
     C                     ADD  DZCL04    DZCLT
     C                     ADD  DZCL05    DZCLT
     C                     ADD  DZCL06    DZCLT
     C                     ADD  DZCL07    DZCLT
     C                     ADD  DZCLOT    DZCLT
     C                     Z-ADDDZWE01    DZWET
     C                     ADD  DZWE02    DZWET
     C                     ADD  DZWE03    DZWET
     C                     ADD  DZWE04    DZWET
     C                     ADD  DZWE05    DZWET
     C                     ADD  DZWE06    DZWET
     C                     ADD  DZWE07    DZWET
     C                     ADD  DZWEOT    DZWET
      *
     CSR         ESB777    ENDSR
      *------------------------------*
      * COLOR INFO                   *
      *------------------------------*
     CSR         #SB778    BEGSR
      *
     C                     WRITEW1
     C                     EXFMTAJSPW51Z
      *
     CSR         ESB778    ENDSR
JW1   *------------------------------*
      * GET WEIGHT                   *
      *------------------------------*
     CSR         #WGT      BEGSR
      *
     C                     Z-ADD0         @WGT    92
     C                     Z-ADD0         @QTY    30
     C           J5PAG1    IFNE *BLANK
     C                     ADD  1         @QTY
     C                     ENDIF
     C           J5PAG2    IFNE *BLANK
     C                     ADD  1         @QTY
     C                     ENDIF
     C           J5PAG3    IFNE *BLANK
     C                     ADD  1         @QTY
     C                     ENDIF
     C           J5PAG4    IFNE *BLANK
     C                     ADD  1         @QTY
     C                     ENDIF
      * GET QPC
     C           KEY@FC    KLIST
     C                     KFLD           J5HIN1
     C                     KFLD           J5HIN2
     C                     KFLD           J5HIN3
     C           KEY@FC    CHAINFCEPL01              98
     C           *IN98     IFEQ *OFF
     C           A2SYHZ    IFGT *DATE
     C                     Z-ADDA2KSYS    QPC     50
     C                     ELSE
     C                     Z-ADDA2SSYS    QPC
     C                     ENDIF
      *
     C           A2KASI    MULT @QTY      WWGT   113
     C                     MULT QPC       WWGT
     C                     DIV  1000      WWGT      H
     C                     Z-ADDWWGT      @WGT      H
     C                     ENDIF
      *
     CSR                   ENDSR
      *****************************************************************
**  MSG (ERROR MESSAGE )
E-01 INPUT
E-02 THERE ISN'T APPLICABLE DATA.
E-03 INPUT ADMITTED DAY START
E-04 ADMITTED DAY START ISN'T RIGHT
E-05 INPUT ADMITTED DAY EXIT
E-06 ADMITTED DAY EXIT ISN'T RIGHT
