     H            Y.
      ** AJSR5F *******************************************************
      * INQUIRY OF DACRODIZING 2ND PLATING ADMIT RESULTS  (MACHINE NO)
      * PROGRAM ID.  : AJSR5F. <RPG>
      * CREATE DATE. : 2015/07/07
      * AUTHOR.      : KIRI
      ******************************************************* AJSR5F **
      *  DACRODIZING 2ND PLATING ADMIT RESULTS FILES. *
     FAJSPL95 IF  E           K        DISK
      *
      *  WORKER CD MASTER FILES.           *
     FAJSPLCD IF  E           K        DISK
      *
     FAJSWP5F O   F    1024            DISK
      *================================================================
      *================================================================
      * 'ADMIT DATE START'
     I            DS
     I                                        1  120SHIZT
     I                                        1   80SHIZ
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I                                        9  120STIM
     I                                        9  100STIMH
     I                                       11  120STIMM
      * 'ADMIT DATE EXIT'
     I            DS
     I                                        1  120EHIZT
     I                                        1   80EHIZ
     I                                        1   40EYY
     I                                        5   60EMM
     I                                        7   80EDD
     I                                        9  120ETIM
     I                                        9  100ETIMH
     I                                       11  120ETIMM
     I            DS
     I                                        1  14 HIN
     I                                        1   5 J5HIN1
     I                                        6   6 HINA
     I                                        7  11 J5HIN2
     I                                       12  12 HINB
     I                                       13  14 J5HIN3
     I            DS
     I                                        1   80J5SKHZ
     I                                        1   40J5SKYY
     I                                        5   60J5SKMM
     I                                        7   80J5SKDD
     I            DS
     I                                        1  120J5WKHT
     I                                        1   80J5WKHZ
     I                                        1   40J5WINY
     I                                        5   60J5WINM
     I                                        7   80J5WIND
     I                                        9  120J5WKTM
     I                                        9  100J5WINJ
     I                                       11  120J5WINF
     I            DS
     I                                        1  120J5KEHT
     I                                        1   80J5KEHZ
     I                                        1   40J5KEIY
     I                                        5   60J5KEIM
     I                                        7   80J5KEID
     I                                        9  120J5KETM
     I                                        9  100J5KEIJ
     I                                       11  120J5KEIF
      *================================================================
     C           *ENTRY    PLIST
     C                     PARM           P@MACH  2        機番
     C                     PARM           P@SHZ   80       開始日付
     C                     PARM           P@STM   40           時刻
     C                     PARM           P@EHZ   80       終了日付
     C                     PARM           P@ETM   40           時刻
     C*
     C                     EXSR #MAIN
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      *===============================================================
     C           #MAIN     BEGSR
     C                     MOVEA*ALL'0'   *IN
      *
     C                     MOVELP@MACH    MACH    2
     C                     Z-ADDP@SHZ     SHIZ
     C                     Z-ADDP@STM     STIM
     C                     Z-ADDP@EHZ     EHIZ
     C                     Z-ADDP@ETM     ETIM
      *
     C           KEY1      KLIST
     C                     KFLD           MACH
     C                     KFLD           SYY
     C                     KFLD           SMM
     C                     KFLD           SDD
     C                     KFLD           STIMH
     C                     KFLD           STIMM
      *
      *
     C           KEY1      SETLLAJSPL95
      *-------------------------
     C                     DO   *HIVAL
     C           MACH      READEAJSPL95                  90
     C   90                LEAVE
      *
     C           J5SKJY    IFEQ 'D'
     C           J5SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C*
     C           J5WKHT    IFGT EHIZT
     C                     LEAVE
     C                     ENDIF
     C*
     C                     MOVEL'-'       HINA
     C                     MOVEL'-'       HINB
     C           J5HIN3    IFEQ *BLANK
     C                     MOVEL' '       HINB
     C           J5HIN2    IFEQ *BLANK
     C                     MOVEL' '       HINA
     C                     ENDIF
     C                     ENDIF
     C*
     C                     MOVE *BLANK    #TOCM  20
     C           J5TOCD    CHAINAJSPLCD1             91
     C           JASKJY    IFEQ ' '
     C           *IN91     ANDEQ*OFF
     C                     MOVE JAWKNM    #TOCM
     C                     ENDIF
      *
     C  N10                EXCPT$HED
     C                     EXCPT$DATA
     C                     SETON                     10
     C                     ENDDO
      *-------------------------
      *
     C                     ENDSR
      *===============================================================
     OAJSWP5F E                $HED
     O                                      'MACHINE NO,'
     O                                      'ADMIT DATE FROM,'
     O                                      'ADMIT TIME FROM,'
     O                                      'ADMIT DATE TO,'
     O                                      'ADMIT TIME TO,'
      *
     O                                      'PART NO,'
     O                                      'MGT INST,'
     O                                      'ID NUMBER,'
     O                                      'SHIP ORDER NO,'
     O                                      'PAGE NO 1,2,3,4,'
     O                                      '2 PROCESSING,'
     O                                      'BESIDES OBJECT,'
     O                                      'OUTGOING EFFECTIVE,'
     O                                      'BAR CODE BOX TYPE,'
      *
     O                                      'PLATING COEFFICIENT,'
     O                                      'COLOR,'
     O                                      'ACCOM QTY,'
     O                                      'M/F BOX TYPE,'
     O                                      'COMPLETION UNIT WEIGHT,'
     O                                      'ADMIT DATE,'
     O                                      'ADMIT TIME,'
     O                                      'BEFORE ADMIT WEIGHT,'
      *
     O                                      'PLATING MCH NO,'
     O                                      'WEIGHING DATE,'
     O                                      'WEIGHING TIME,'
     O                                      'WEIGHING WEIGHT,'
     O                                      'MATERIAL BARCODE 1,'
     O                                      'MATERIAL BARCODE 2,'
     O                                      'LOADING WORKER CD,'
     O                                      'LOADING WORKER NAME,'
      *
     O                                      'COTER INPUT,'
     O                                      'COTER DATA,'
     O                                      'SPIN INPUT,'
     O                                      'SPIN DATA,'
      *************************
     O        E                $DATA
     O                         MACH
     O                                      ','
     O                         SHIZ
     O                                      ','
     O                         STIM
     O                                      ','
     O                         EHIZ
     O                                      ','
     O                         ETIM
     O                                      ','
      *
     O                         HIN
     O                                      ','
     O                         J5KANK
     O                                      ','
     O                         J5ZETI
     O                                      ','
     O                         J5THAI
     O                                      ','
     O                         J5PAG1
     O                                      ','
     O                         J5PAG2
     O                                      ','
     O                         J5PAG3
     O                                      ','
     O                         J5PAG4
     O                                      ','
     O                         J52JKA
     O                                      ','
     O                         J5TASY
     O                                      ','
     O                         J5SYKO
     O                                      ','
     O                         J5HKBR
     O                                      ','
      *
     O                         J5MKSU       '0 . '
     O                                      ','
     O                         J5IROK
     O                                      ','
     O                         J5SYUY
     O                                      ','
     O                         J5HKFA
     O                                      ','
     O                         J5TANJ
     O                                      ','
     O                         J5WKHZ
     O                                      ','
     O                         J5WKTM
     O                                      ','
     O                         J5WMJY
     O                                      ','
     O                         J5MKKB
     O                                      ','
     O                         J5KEHZ
     O                                      ','
     O                         J5KETM       '  :  '
     O                                      ','
     O                         J5WAIT       ' 0 .  '
     O                                      ','
     O                         J5ZBR1
     O                                      ','
     O                         J5ZBR2
     O                                      ','
     O                         J5TOCD
     O                                      ','
     O                         #TOCM
     O                                      ','
      *
     O                         J5CTRK
     O                                      ','
     O                         J5CTRD
     O                                      ','
     O                         J5SPNK
     O                                      ','
     O                         J5SPND
     O                                      ','
      *===============================================================
