     H            Y.                                    1
      ** AJSR2B **********************************************
      * CREATE OF DACRODIZING PLATING DISCHARGE RESULTS FILE *
      *                           CREATE DATE : 1997/MAR/13. *
      *                           AUTHOR      : S.OHTAKE.    *
      * TCHK1 01/07/11 CHG SET UPDATE INF
      ********************************************** AJSR2B **
     FAJSWP94 IP  F     150            DISK
     FAJSPL63 IF  E           K        DISK
     FAJSPP60 O   E                    DISK                      A
     F***QPRINT4 O   F     156     OC     PRINTER                        UC
     F***QPRINT3 O   F     156     OD     PRINTER
     E                    CHK         8  1               CHECK
     E***                 S       1  14  1               SUUJI
     IAJSWP94 AA  01
     I                                        1 150 DATA
     I                                        1   8 CHK
     I*
     I                                        1   1 J6KANK
     I                                        2   5 J6ZETI
Q    I                                        6   8 J6THAI
     I                                        9  10 J6PAG1
     I                                       11  12 J6PAG2
     I                                       13  14 J6PAG3
     I                                       15  16 J6PAG4
     I                                       17  17 J62JKA
     I                                       18  18 J6TASY
     I                                       19  19 J6SYKO
     I                                       20  20 J6HKBR
     I                                       21  28 J6ZBR1
     I                                       29  36 J6ZBR2
     I                                       37  37 J6HNTE
     I                                       38  42 J6HIN1
     I                                       43  47 J6HIN2
     I                                       48  49 J6HIN3
     I                                       50  50 J6MKTE
     I                                       51  531J6MKSU
     I                                       54  54 J6IRTE
     I                                       55  55 J6IROK
     I                                       56  56 J6SYTE
     I                                       57  610SYUY
     I                                       62  62 J6HKFA
     I                                       63  63 J6TATE
     I                                       64  703TANJ
     I                                       71  740J6WINY
     I                                       73  740J@WINY
     I                                       75  760J6WINM
     I                                       77  780J6WIND
     I                                       79  800J6WINJ
     I                                       81  820J6WINF
     I                                       83  872J6WMJY
     I                                       88  89 J6MKKB
     I                                       90  930J6KEIY
     I                                       92  930J@KEIY
     I                                       94  950J6KEIM
     I                                       96  970J6KEID
     I                                       98  990J6KEIJ
     I                                      100 1010J6KEIF
     I                                      102 1062J6WAIT
     I                                      107 1080J6TMAI
     I                                      109 109 J6GAFR
     I                                      110 110 J6NGFR
     I                                      111 111 J6MKFR
     I                                      112 1141J6SOKK
     I                                      115 120 J6TOCD
     I                                      121 126 J6KECD
     I                                      127 127 J6SAIK
     I                                      128 1343J6MTAN
     I                                      135 1360J6KHAK
TCHK1I           SDS
TCHK1I                                        1   8 #PGM
TCHK1I                                      244 253 #WSID
TCHK1I                                      254 263 #USER
TCHK1I            DS
TCHK1I                                        1   60WTIME
TCHK1I                                        1   20WJJ
TCHK1I                                        3   40WFF
TCHK1I* ====================================================
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           WTIME   60
     C***                  EXCPTHD3
     C                     Z-ADD0         J6SKYY
     C                     Z-ADD0         J6SKMM
     C                     Z-ADD0         J6SKDD
TCHK1C*                    Z-ADD0         J6KOYY
TCHK1C*                    Z-ADD0         J6KOMM
TCHK1C*                    Z-ADD0         J6KODD
TCHK1C*                    Z-ADD0         J6KOHH
TCHK1C*                    Z-ADD0         J6KOSS
TCHK1C                     Z-ADD*YEAR     J6KOYY
TCHK1C                     Z-ADDUMONTH    J6KOMM
TCHK1C                     Z-ADDUDAY      J6KODD
TCHK1C                     Z-ADDWJJ       J6KOHH
TCHK1C                     Z-ADDWFF       J6KOSS
TCHK1C                     MOVE #USER     J6KOME
     C                     END
     C*
     C***        RRN       ADD  1         RRN     40
     C*排出実績と重複していないかチェック*
     C*排出ファイルを引く*
     C           KEY1      KLIST
     C                     KFLD           J6MKKB
     C                     KFLD           J6HIN1
     C                     KFLD           J6HIN2
     C                     KFLD           J6HIN3
     C                     KFLD           J6WINY
     C                     KFLD           J6WINM
     C                     KFLD           J6WIND
     C                     KFLD           J6WINJ
     C                     KFLD           J6WINF
     C                     KFLD           J6KEIY
     C                     KFLD           J6KEIM
     C                     KFLD           J6KEID
     C                     KFLD           J6KEIJ
     C                     KFLD           J6KEIF
     C                     KFLD           J6THAI
     C                     KFLD           J6PAG1
     C                     KFLD           J6PAG2
     C                     KFLD           J6PAG3
     C                     KFLD           J6PAG4
     C                     KFLD           J6WMJY
     C                     KFLD           J6WAIT
     C           KEY1      CHAINAJSPL631             12
     C           *IN12     IFEQ '0'
     C***        *IN20     IFEQ '0'
     C***                  SETON                     20
     C***                  OPEN QPRINT4
     C***                  EXCPTHD4
     C***                  END
     C***                  EXCPTME4
     C***        DBR       ADD  1         DBR     50
     C***        *INOC     IFEQ '1'
     C***                  SETOF                     OC
     C***                  EXCPTHD4
     C***                  END
     C                     GOTO END
     C                     END
     C*先頭部分が数字かチェック*
     C                     Z-ADD1         I       20
     C                     SETOF                     1113
     C*
     C***                  DO   8         I
     C***        CHK,I     LOKUPS                        11cﾇﾆﾞf kｩｮh
     C***        *IN11     IFEQ '0'
     C*
     C***        *IN13     IFEQ '0'                        1fb ﾉv b]ﾆﾞ
     C***        KEN       ADD  1         KEN     50
     C*16GOU NOT PRINT
     C*****      J6MKKB    IFNE 16
     C***                  EXCPTME3
     C***                  END
     C***                  SETON                     13
     C******               END
     C*
     C***        *INOD     IFEQ '1'
     C***                  SETOF                     OD
     C***                  EXCPTHD3
     C***                  END
     C**** NOT OMITTO **** GOTO END
     C***                  END
     C***                  END
     C*
     C                     Z-ADDSYUY      J6SYUY
     C                     Z-ADDTANJ      J6TANJ
     C*
     C                     WRITEAJSPP601
     C*
     C           END       TAG
     C***LR                   EXCPTTO3
     C***LR         *IN20     IFEQ '1'
     C***LR                   EXCPTTO4
     C***LR                   CLOSEQPRINT4
     C***LR                   END
      ***
     O***QPRINT3 E  102           HD3
     O***                               131 '......................'
     O***     E  1             HD3
     O***                               131 '.         .          .'
     O***     E  1             HD3
     O***                                12 'AJSR2B-1'
     O***                                89 'TIME'
     O***                      WTIME     98 '  :  :  '
     O***                               131 '.         .          .'
     O***     E  2             HD3
     O***                                25 'DACRODIZING'
     O***                                43 'PLATING DISCHARGE'
     O***                                62 'RESULTS DATA ERROR'
     O***                                70 'RECORDS'
     O***                                83 'DETAILS LIST'
     O***                                89 'DATE'
     O***                      UDATE Y   98
     O***                               104 'PAGE'
     O***                      PAGE2 Z  108
     O***                               131 '......................'
     O***     E  1             HD3
     O***                                 2 ' '
     O***     E  1             HD3
     O***                               132 'NON-CONF'
     O***                               119 'FRC'
     O***     E  1             HD3
     O***                                16 'PROD'
     O***                                35 'INP'
     O***                                57 'INP'
     O***                                62 'INP'
     O***                                51 'INP'
     O***                                70 'BOX'
     O***                                78 'CMPLET'
     O***                                85 'ADMIT'
     O***                                91 'ADMIT'
     O***                                97 'ADMIT'
     O***                               106 'WEIGH'
     O***                               113 'WEIGH'
     O***                               119 'WEIGH'
     O*******>>                         125 '+/-'
     O*******>>                         129 '+/-'
     O***     E  1             HD3
     O***                                 3 'REC'
     O***                                 7 'MGT'
     O***                                10 'ID'
     O***                                16 'ODR'
     O***                                54 'PLT'
     O***                                61 'COLOR'
     O***                                67 'ACCOM'
     O***                                72 'UNW'
     O***                               101 'PLT'
     O***                               121 'HNDL'
     O***                               140 'MATERIAL BARCODE'
     O***     E  2             HD3
     O***                                 3 'NO'
     O***                                 7 'NO'
     O***                                10 'NO'
     O***                                16 'NO'
     O***                                24 'PAGE NO'
     O***                                31 'INST'
     O***                                36 'INST'
     O***                                47 'INT CO P/N'
     O***                                55 'COEF'
     O***                                65 'QTY'
     O***                                70 'TYP'
     O***                                75 'UNW'
     O***                                85 'Y M D'
     O***                                90 'T M'
     O***                                97 'WEGHT'
     O***                               101 'M/N'
     O***                               107 'Y M D'
     O***                               112 'T M'
     O***                               119 'WEGHT'
     O***                               140 '   1        2    '
     O***     E  1             ME3
     O***                      RRN   1    5
     O***                      J6KANK     7
     O***                      J6ZETI    12
     O***                      J6THAI    16
     O***                      J6PAG1    19
     O***                      J6PAG2    21
     O***                      J6PAG3    23
     O***                      J6PAG4    25
     O***                      J62JKA    28
     O***                      J6TASY    29
     O***                      J6SYKO    30
     O***                      J6HKBR    31
     O***                      J6HNTE    34
     O***                      J6HIN1    42
     O***                      J6HIN2    47
     O***                      J6HIN3    49
     O***                      J6MKTE    51
     O***                      J6MKSU    55
     O***                      J6IRTE    57
     O***                      J6IROK    59
     O***                      J6SYTE    61
     O***                      SYUY      67
     O***                      J6HKFA    69
     O***                      J6TATE    71
     O***                      TANJ      79
     O***                      J@WINY    82
     O***                      J6WINM    84
     O***                      J6WIND    86
     O***                      J6WINJ    89
     O***                      J6WINF    91
     O***                      J6WMJY    96
     O***                      J6MKKB    99
     O***                      J@KEIY   103
     O***                      J6KEIM   105
     O***                      J6KEID   107
     O***                      J6KEIJ   110
     O***                      J6KEIF   112
     O***                      J6WAIT   117
     O***                      J6ZBR1   125
     O***                      J6ZBR2   134
     O***     E 11             TO3
     O***                                20 'TOTAL ERROR COUNT'
     O***                      RRN   1   30
     O***                                38 '/'
     O***                      KEN   1   48
     O***QPRINT4 E  102           HD4
     O***                               131 '......................'
     O***     E  1             HD4
     O***                               131 '.         .          .'
     O***     E  1             HD4
     O***                                12 'AJSR2B-2'
     O***                                89 'TIME'
     O***                      WTIME     98 '  :  :  '
     O***                               131 '.         .          .'
     O***     E  2             HD4
     O***                                25 'DACRODIZING'
     O***                                43 'PLATING DISCHARGE'
     O***                                62 'RESULTS DATA REPETITION'
     O***                                70 'RECORDS'
     O***                                84 'DETAILS LIST'
     O***                                89 'DATE'
     O***                      UDATE Y   98
     O***                               104 'PAGE'
     O***                      PAGE3 Z  108
     O***                               131 '......................'
     O***     E  1             HD4
     O***                                 2 ' '
     O***     E  1             HD4
     O***                               119 'FRC'
     O***                               132 'NON-CONF'
     O***     E  1             HD4
     O***                                16 'PROD'
     O***                                35 'INP'
     O***                                57 'INP'
     O***                                62 'INP'
     O***                                51 'INP'
     O***                                70 'BOX'
     O***                                78 'CMPLET'
     O***                                85 'ADMIT'
     O***                                91 'ADMIT'
     O***                                97 'ADMIT'
     O***                               106 'WEIGH'
     O***                               113 'WEIGH'
     O***                               119 'WEIGH'
     O***********>>                     125 '+/-'
     O***********>>                     129 '+/-'
     O***     E  1             HD4
     O***                                 3 'REC'
     O***                                 7 'MGT'
     O***                                10 'ID'
     O***                                16 'ODR'
     O***                                54 'PLT'
     O***                                61 'COLOR'
     O***                                67 'ACCOM'
     O***                                72 'UNW'
     O***                               101 'PLT'
     O***                               121 'HNDL'
     O***                               140 'MATERIAL BARCODE'
     O***     E  2             HD4
     O***                                 3 'NO'
     O***                                 7 'NO'
     O***                                10 'NO'
     O***                                16 'NO'
     O***                                24 'PAGE NO'
     O***                                31 'INST'
     O***                                36 'INST'
     O***                                47 'INT CO P/N'
     O***                                55 'COEF'
     O***                                65 'QTY'
     O***                                70 'TYP'
     O***                                75 'UNW'
     O***                                85 'Y M D'
     O***                                90 'T M'
     O***                                97 'WEGHT'
     O***                               101 'M/N'
     O***                               107 'Y M D'
     O***                               112 'T M'
     O***                               119 'WEGHT'
     O***                               140 '   1        2    '
     O***     E  1             ME4
     O***                      RRN   1    5
     O***                      J6KANK     7
     O***                      J6ZETI    12
     O***                      J6THAI    16
     O***                      J6PAG1    19
     O***                      J6PAG2    21
     O***                      J6PAG3    23
     O***                      J62JKA    28
     O***                      J6TASY    29
     O***                      J6SYKO    30
     O***                      J6HKBR    31
     O***                      J6HNTE    34
     O***                      J6HIN1    42
     O***                      J6HIN2    47
     O***                      J6HIN3    49
     O***                      J6MKTE    51
     O***                      J6MKSU    55
     O***                      J6IRTE    57
     O***                      J6IROK    59
     O***                      J6SYTE    61
     O***                      SYUY      67
     O***                      J6HKFA    69
     O***                      J6TATE    71
     O***                      TANJ      79
     O***                      J@WINY    82
     O***                      J6WINM    84
     O***                      J6WIND    86
     O***                      J6WINJ    89
     O***                      J6WINF    91
     O***                      J6WMJY    96
     O***                      J6MKKB    99
     O***                      J@KEIY   103
     O***                      J6KEIM   105
     O***                      J6KEID   107
     O***                      J6KEIJ   110
     O***                      J6KEIF   112
     O***                      J6WAIT   117
     O***                      J6ZBR1   127
     O***                      J6ZBR2   137
     O***     E 11             TO4
     O***                                23 'TOTAL REPETITION COUNT'
     O***                      RRN   1   30
     O**                                 38 '/'
