     H            Y
     F**AJSR2W ********************************************************
     F*<IN>品番＋手配番号＋発行日--> <OUT>投入日＋投入時刻 BZ     *
     F*  2019.09.17      SAKAKI                                       *
     F*****************************************************************
     FAJSPL26 IF  E           K        DISK
      *===============================================================
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     **かんばん発行日
     I            DS
     I                                        1   80W$HTHZ
     I                                        1   40W$HTYY
     I                                        5   60W$HTMM
     I                                        7   80W$HTDD
     **投入日
     I            DS
     I                                        1   80J2WIHZ
     I                                        1   40J2WINY
     I                                        5   60J2WINM
     I                                        7   80J2WIND
     **投入時刻
     I            DS
     I                                        1   60J2WITM
     I                                        1   20J2WINJ
     I                                        3   40J2WINF
     I                                        5   60J2WINB
     **
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *===============================================================
     C           *ENTRY    PLIST
     C*                                IN ------
     C                     PARM           P@HIN1  5        PART NUMBER 1
     C                     PARM           P@HIN2  5        PART NUMBER 2
     C                     PARM           P@HIN3  2        PART NUMBER 3
     C                     PARM           P@THAI  3        PRODUCTION ORDER
     C                     PARM           P@HTHZ  80       KANBAN PUBLICATION
     C*                               OUT ------
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
     C*------------------------*
     C*   KLIST の作成       *
     C*------------------------*
     C           #KEY1     KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
     C                     KFLD           W$HTYY  40       KANBAN PUBLICATION Y
     C                     KFLD           W$HTMM  20       KANBAN PUBLICATION M
     C                     KFLD           W$HTDD  20       KANBAN PUBLICATION D
     C           #KEY11    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
      *===============================================================
     C                     Z-ADDP@HTHZ    W$HTHZ           KANBAN PUBLICATION
     C                     Z-ADD0         P@WIHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADD0         P@WITM  60       WORK ADMITTABLE TIME
     C           #KEY11    SETLLAJSPL26
     C*
     C           #KEY11    READEAJSPL26                  90
     C*
     C           *IN90     IFEQ *OFF
     C           J2WIHZ    IFGE W$HTHZ
     C                     Z-ADDJ2WIHZ    P@WIHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADD0         J2WINB
     C                     Z-ADDJ2WITM    P@WITM  60       WORK ADMITTABLE TIME
     C                     ENDIF
     C                     ENDIF
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
