     H            Y.
      ** AJSR76 ***************************************
      * DELETE  OF DACRODIZING PLATING BREAKDOWN FILE *
      * PROGRAM ID.  : AJSR76. <RPG>                  *
      * CREATE DATE. : 1997/MAR/19.                   *
      * AUTHOR.      : S.OHTAKE.                      *
      *************************************************
     FAJSPP70 IP  E                    DISK
     FAJSWP80 O   F      87            DISK                      A
     FAJSWP81 O   F      87            DISK                      A
     FQPRINT  O   F     133     OF     PRINTER
     I            DS
     I                                        1  87 DATA
     I                                        1   1 J7SKJY
     I                                        2   50J7SKYY
     I                                        6   70J7SKMM
     I                                        8   90J7SKDD
     I                                       10  130J7KOYY
     I                                       14  150J7KOMM
     I                                       16  170J7KODD
     I                                       18  190J7KOHH
     I                                       20  210J7KOSS
     I                                       22  31 J7KOME
     I                                       32  390J7BRHZ
     I                                       32  350J7BRYY
     I                                       36  370J7BRMM
     I                                       38  390J7BRDD
     I                                       40  410J7BRJI
     I                                       42  430J7BRFN
     I                                       44  450J7BRBY
     I                                       46  490J7REYY
     I                                       50  510J7REMM
     I                                       52  530J7REDD
     I                                       54  550J7REJI
     I                                       56  570J7REFN
     I                                       58  590J7REBY
     I                                       60  630J7BTIM
     I                                       64  670J7BRCD
     I                                       68  87 J7BRNA
     C           *ENTRY    PLIST
     C                     PARM           PDELHZ  8
     C                     PARM           USRSW   1
     C                     MOVE PDELHZ    DELHZ   80
     C*
     C           *IN01     IFEQ '0'
     C                     TIME           WTIME   60
     C                     EXCPTHD
     C                     SETON                     01
     C                     END
     C*
     C           RRN       ADD  1         RRN     60
     C*
     C********   DELHZ     IFLE J3TOHZ
     C           J7BRHZ    IFGT DELHZ
     C                     EXCPTOUT1
     C                     ELSE
     C                     EXCPTOUT2
     C           DEL       ADD  1         DEL     60
     C                     EXCPTME
     C           *INOF     IFEQ '1'
     C                     SETOF                     OF
     C                     EXCPTHD
     C                     END
     C                     END
     C*
     CLR                   EXCPTTO
     OAJSWP80 EADD             OUT1
     O                         J7SKJY     1
     O                         J7SKYY     5
     O                         J7SKMM     7
     O                         J7SKDD     9
     O                         J7KOYY    13
     O                         J7KOMM    15
     O                         J7KODD    17
     O                         J7KOHH    19
     O                         J7KOSS    21
     O                         J7KOME    31
     O                         J7BRYY    35
     O                         J7BRMM    37
     O                         J7BRDD    39
     O                         J7BRJI    41
     O                         J7BRFN    43
     O                         J7BRBY    45
     O                         J7REYY    49
     O                         J7REMM    51
     O                         J7REDD    53
     O                         J7REJI    55
     O                         J7REFN    57
     O                         J7REBY    59
     O                         J7BTIM    63
     O                         J7BRCD    67
     O                         J7BRNA    87
     OAJSWP81 EADD             OUT2
     O                         J7SKJY     1
     O                         J7SKYY     5
     O                         J7SKMM     7
     O                         J7SKDD     9
     O                         J7KOYY    13
     O                         J7KOMM    15
     O                         J7KODD    17
     O                         J7KOHH    19
     O                         J7KOSS    21
     O                         J7KOME    31
     O                         J7BRYY    35
     O                         J7BRMM    37
     O                         J7BRDD    39
     O                         J7BRJI    41
     O                         J7BRFN    43
     O                         J7BRBY    45
     O                         J7REYY    49
     O                         J7REMM    51
     O                         J7REDD    53
     O                         J7REJI    55
     O                         J7REFN    57
     O                         J7REBY    59
     O                         J7BTIM    63
     O                         J7BRCD    67
     O                         J7BRNA    87
     OQPRINT  E  102           HD
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                                   10 'AJSR76'
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O                                   28 'DACRODIZING'
     O                                   52 'PLATING BREAKDOWN DATA'
     O                                   66 'DELETE RECORD'
     O                                   79 'DETAILS LIST'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  1             HD
     O                                    6 'REC NO'
     O                                   16 '*...+... '
     O                                   26 '1 ...+... '
     O                                   36 '2 ...+... '
     O                                   46 '3 ...+... '
     O                                   56 '4 ...+... '
     O                                   66 '5 ...+... '
     O                                   76 '6 ...+... '
     O                                   86 '7 ...+... '
     O                                   96 '8 ...+... '
     O                                  106 '9 ...+... '
     O        E  1             ME
     O                         RRN   3    6
     O                         DATA      93
     O        E 11             TO
     O                                   20 'TOTAL DELETE COUNT'
     O                         RRN   3   30
     O                                   38 '/'
     O                         DEL   3   48
