     H            Y.                                                      DAD000
     FFCEPL07 IF  E           K        DISK
     FAEBPL01 IF  E           K        DISK
     I            DS
     I                                        1   7 A2MEKA
     I                                        1   4 A2MEK1
     I                                        5   6 A2MEK2
     I                                        7   7 A2MEK3
      *
     C           *ENTRY    PLIST
     C                     PARM           P@ZETI  4
     C                     PARM           P@RTNC  1
      *
     C                     MOVE P@ZETI    K@ZETI  4
     C                     MOVE *BLANK    P@RTNC  1
      *
     C           K@ZETI    CHAINFCEPL07              88
     C           *IN88     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C                     SETON                     88
     C                     END
     C                     END
      *
     C           *IN88     IFEQ '1'
     C                     GOTO @END
     C                     END
     C           AEBKEY    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C                     Z-ADD0         @CNT    20
      *
     C           AEBKEY    SETLLAEBPL01
     C                     DO   *HIVAL
     C           AEBKEY    READEAEBPL01                  77
     C   77                LEAVE
     C           AFSKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     ADD  1         @CNT
     C                     ENDDO
      * DSM
     C           A2MEKA    IFEQ '.MA.SP.'
     C                     EXSR #DSM
     C                     END
     C           A2MEKA    IFEQ '.A.W.8.'
     C                     EXSR #DSM
     C                     END
      * DS
     C           A2MEKA    IFEQ '.GM.SP.'
     C                     EXSR #DS
     C                     END
      *
     C           @END      TAG
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------
      * DC1(MAGNI)
      *----------------------------------------------------
     C           #DSM      BEGSR
      * NUT
     C           A2KUBI    IFEQ 0
     C                     MOVE '5'       P@RTNC
     C                     GOTO EDSM
     C                     END
      * UNDER M6
     C           A2TUSZ    IFLE 6
      * WITH WASHER
     C           @CNT      IFNE 0
     C                     MOVE '2'       P@RTNC
     C                     GOTO EDSM
     C                     ELSE
      * WITHOUT WASHER
     C                     MOVE '1'       P@RTNC
     C                     GOTO EDSM
     C                     END
      *
     C                     END
      * M8
     C           A2TUSZ    IFEQ 8
      * WITH WASHER
     C           @CNT      IFNE 0
     C                     MOVE '3'       P@RTNC
     C                     GOTO EDSM
     C                     ELSE
      * WITHOUT WASHER
     C                     MOVE '1'       P@RTNC
     C                     GOTO EDSM
     C                     END
     C                     END
      * OVER M10
     C           A2TUSZ    IFGE 10
     C                     MOVE '4'       P@RTNC
     C                     GOTO EDSM
     C                     END
      *
     C           EDSM      ENDSR
      *----------------------------------------------------
      * DS3
      *----------------------------------------------------
     C           #DS       BEGSR
      * BOLT
     C* * *                MOVE '1'       P@RTNC
      * NUT
     C           A2KUBI    IFEQ 0
     C                     MOVE '1'       P@RTNC
     C                     GOTO EDS
     C                     END
      * UNDER M6
     C           A2TUSZ    IFLE 6
     C                     MOVE '2'       P@RTNC
     C                     GOTO EDS
     C                     END
      * OVER M17
     C           A2TUSZ    IFGE 17
     C                     MOVE '4'       P@RTNC
     C                     GOTO EDS
     C                     END
      * OVER M8
     C           A2TUSZ    IFGE 08
     C                     MOVE '3'       P@RTNC
     C                     GOTO EDS
     C                     END
      *
     C           EDS       ENDSR
