     H            Y.                                    1
      ** AJVR11 *******************************************************
      * GET CREATE SCHEDULE
      *  Y.MAEDA          2019/01/11
      *****************************************************************
     FAJVPP11 UF  E           K        DISK
     I            DS
     I                                        1  140WTIME
     I                                        1   40WJIKN
     I                                        8  140WDATE
      *
     C           *ENTRY    PLIST
     C                     PARM           PSTS    1
      *
     C                     TIME           WTIME
     C                     MOVEL' '       PSTS
     C                     SETOF                     71
     C           *LOVAL    SETLLAJVPP111
     C                     DO   *HIVAL
     C                     READ AJVPP111                 71
     C   71                LEAVE
     C           WDATE     IFLE V1EXHZ
     C                     ITER
     C                     END
     C           WJIKN     IFLT V1TIME
     C                     ITER
     C                     END
     C                     MOVE '*'       PSTS
     C                     Z-ADDWDATE     V1EXHZ
     C                     UPDATAJVPP111
     C                     LEAVE
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
