     H            Y.
     F** AJVRM3 **********************************
     F*    CREATE TRANSFER DATA                  *
     F*                                          *
     F*       CODING:A.MAMIYA      2003.06.15    *
     F********************************** AJVRM3 **
     FINPUT   IP  F     512            DISK
     FOUTPUT  O   F     512            DISK
     IINPUT   AA  01
     I                                        1 510 IDATA
     I            DS
     I                                        1  140WTIME
     I                                        1   20WKOTI
     I                                        3   40WKOMI
     I                                        5   60WKOSE
     I                                        7  100WKOYY
     I                                       11  120WKOMM
     I                                       13  140WKODD
     C           *ENTRY    PLIST
     C                     PARM           PREC   100
     C                     PARM           PLIBL  10
     C                     PARM           PFILE  10
      *----------*
      * WRITE HD *
      *----------*
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           WTIME  140
     C           PREC      ADD  2         HREC    50
     C                     Z-ADD1         TREC    50
     C                     EXCPTHD
     C                     ENDIF
      *----------*
      * WRITE DT *
      *----------*
     C                     EXCPTDT
     C                     ADD  1         TREC
      *----------*
      * WRITE TO *
      *----------*
     CLR                   ADD  1         TREC
     CLR                   EXCPTTO
      *
     OOUTPUT  E                HD
     O                                    1 'H'
     O                         PLIBL     11
     O                         PFILE     21
     O                         PFILE     31
     O                         WKOYY     35
     O                         WKOMM     37
     O                         WKODD     39
     O                         WKOTI     41
     O                         WKOMI     43
     O                         WKOSE     45
     O                         HREC      50
     O                                  512 '*'
     O        E                DT
     O                                    1 'D'
     O                         IDATA    511
     O                                  512 '*'
     O        E                TO
     O                                    1 'T'
     O                         TREC       6
     O                                  512 '*'
