     H            Y.
     F** AIAR57 ****************************************************
     F*  PROGRAM NAME : A-PICS通信プログラム稼動スケジュール取得 *
     F*  PROGRAM ID   : AIAR57                                     *
     F*  CREATE DATE  : 2004.08.29                                 *
     F*  AUTHOR       : A.MAMIYA                                   *
     F**************************************************** AIAR57 **
     FAGDPL12 IF  E           K        DISK
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I            DS
     I                                        1   80WYMD
     I                                        1   40WYY
     I                                        5   60WMM
     I                                        7   80WDD
     C           *ENTRY    PLIST
     C                     PARM           EDATE   8
     C                     PARM           ETIME   6
     C                     PARM           SDATE   8
     C                     PARM           STIME   6
      *
     C           KEY01     KLIST
     C                     KFLD           WYY
     C                     KFLD           WMM
     C                     KFLD           WDD
      *
     C                     Z-ADD*DATE     WYMD    80
     C                     TIME           WTIME   60
     C                     MOVEL*ALL'0'   EDATE
     C                     MOVEL*ALL'0'   ETIME
     C                     MOVEL*ALL'0'   SDATE
     C                     MOVEL*ALL'0'   STIME
      *-----------------------------------------------------*
      * 終了（当日）起動（翌日）の状態                    *
      *-----------------------------------------------------*
      * 昼勤 | 夜勤 |  終了日付    |   起動日付     *
      *  ﾎﾞ[]h |  ﾎﾞ[]h | (翌日04:30 ) |  (翌日04:40 )  *
      *  ﾎﾞ[]h |    *   | (翌日04:30 ) |  (翌日04:40 )  *
      *    *   |  ﾎﾞ[]h | (翌日04:30 ) |  (翌日04:40 )  *
      *    *   |    *   | (翌日04:30 ) |  (翌日04:40 )  *
      *-----------------------------------------------------*
     C                     SETOF                     01
     C           KEY01     SETLLAGDPL121
     C                     DO   2
     C                     READ AGDPL121                 01
     C           *IN01     IFEQ '0'
     C                     MOVE F8KAHZ    EDATE
     C                     MOVE '043000'  ETIME
     C                     MOVE F8KAHZ    SDATE
     C                     MOVE '044000'  STIME
     C                     END
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
