     H            Y.                                    1
      ** AJVR10 *******************************************************
      * MATERIAL BARCODE投入履歴集計
      *  KIRI 2018/12/19
      *****************************************************************
      *
      *  PLATING  ADMIT RESULTS FILES.     *
     FAJSPL14 IF  E           K        DISK
      *
      *  PLATING  ADMIT RESULTS FILES.     *
     FAJVPP10 UF  E           K        DISK                      A
      *
      * AOYAMA PRODUCTION PLACE CALENDAR FILE(INCLUDE HOLIDAY)
     FAGDPL12 IF  E           K        DISK
      *================================================================
     E                    X1D         9  8 0             DATE
     E                    X1T         9  4 0             TIME
      *================================================================
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *
      *
     I            DS
     I                                        1  72 X1D
     I                                        1   80X1WID1
     I                                        9  160X1WID2
     I                                       17  240X1WID3
     I                                       25  320X1WID4
     I                                       33  400X1WID5
     I                                       41  480X1WID6
     I                                       49  560X1WID7
     I                                       57  640X1WID8
     I                                       65  720X1WID9
     I            DS
     I                                        1  36 X1T
     I                                        1   40X1WIT1
     I                                        5   80X1WIT2
     I                                        9  120X1WIT3
     I                                       13  160X1WIT4
     I                                       17  200X1WIT5
     I                                       21  240X1WIT6
     I                                       25  280X1WIT7
     I                                       29  320X1WIT8
     I                                       33  360X1WIT9
      *削除日
     I            DS
     I                                        1   80J1SKHZ
     I                                        1   40J1SKYY
     I                                        5   60J1SKMM
     I                                        7   80J1SKDD
      *投入日・時刻
     I            DS
     I                                        1  120J1WIHT
     I                                        1   80J1WIHZ
     I                                        1   40J1WINY
     I                                        5   60J1WINM
     I                                        7   80J1WIND
     I                                        9  120J1WITM
     I                                        9  100J1WINJ
     I                                       11  120J1WINF
      *前回投入日・時刻＋２時間
     I            DS
     I                                        1  120WWM2T
     I                                        1   80WWMAE
     I                                        1   40W@MYY
     I                                        5   60W@MMM
     I                                        7   80W@MDD
     I                                        9  120WWMTM
     I                                        9  100W@MJ
     I                                       11  120W@MF
     I            DS
     I                                        1   80F8DATE
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      *================================================================
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           @TIME
      *
      *集計期間の算出（３０日前まで）
      *                      指定日からプラス・マイナスした日付を算出
      *
     C                     MOVEL@SYSHZ    PDATE
     C                     CALL 'DATR12'
     C                     PARM           PDATE   8
     C                     PARM '-'       PPORM   1        + OR -
     C                     PARM '0030'    PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C***
     C                     MOVE PRDAT     WWMADE  80
     C***
     C           *HIVAL    SETGTAJSPL14
      *-------------------------
     C                     DO   *HIVAL
     C                     READPAJSPL14                  90
     C  N90      J1WIHZ    IFLT WWMADE
     C                     SETON                     90
     C                     ENDIF
     C   90                LEAVE
     C*
     C           J1SKJY    IFEQ 'D'
     C           J1SKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C*中間実績はオミット
     C           J1MKKB    IFEQ '22'
     C                     ITER
     C                     ENDIF
     C*
     C           J1ZBR1    IFNE *BLANK
     C           J1ZBR1    ANDNE'00000000'
     C                     MOVELJ1ZBR1    K@ZBAR  8
     C                     EXSR #CHK
     C                     ELSE
     C           J1ZBR2    IFNE *BLANK
     C           J1ZBR2    ANDNE'00000000'
     C           J1ZBR2    ANDNEJ1ZBR1
     C                     MOVELJ1ZBR2    K@ZBAR
     C                     EXSR #CHK
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDDO
      *-------------------------
     C*
     C                     SETON                     LR
     C                     RETRN
      *================================================================
     C           #CHK      BEGSR
     C           K@ZBAR    CHAINAJVPP10              91
     C*
     C           *IN91     IFEQ *ON
     C                     CLEARAJVPP101
     C                     MOVELK@ZBAR    X1ZBAR
     C                     Z-ADD1         X1KAIS
     C                     Z-ADD1         X1KAIC
     C                     Z-ADDJ1WIHZ    X1D,1
     C                     Z-ADDJ1WITM    X1T,1
     C                     WRITEAJVPP101
     C                     ELSE
     C                     EXSR #CHK2
     C                     ENDIF
     C*
     C                     ENDSR
      *================================================================
      *================================================================
     C           #CHK2     BEGSR
     C*
     C           KEY01     KLIST
     C                     KFLD           W@MYY
     C                     KFLD           W@MMM
     C                     KFLD           W@MDD
     C*                        前回の投入日・時刻
     C                     Z-ADDX1KAIC    Z       20
     C           Z         IFGT 9
     C                     Z-ADD9         Z
     C                     ENDIF
     C                     Z-ADDX1D,Z     WWMAE   80       前回日付
     C                     Z-ADDX1T,Z     WWMTM   40       前回時刻
      *
      *前回投入日・時刻－２時間
      *
     C                     SUB  2         W@MJ
     C*******前日↓
     C           W@MJ      IFLT 0
     C                     ADD  24        W@MJ
     C           KEY01     SETLLAGDPL12
     C*-------------------------
     C                     DO   *HIVAL
     C                     READPAGDPL12                  92
     C   92                LEAVE
     C           F8HIRU    IFEQ '*'
     C                     ITER
     C                     ENDIF
     C                     Z-ADDF8DATE    WWMAE
     C                     LEAVE
     C*
     C                     ENDDO
     C                     ENDIF
     C*******前日↑
      *-------------------------
     C           J1WIHT    IFLT WWM2T
     C                     ADD  1         X1KAIS
     C                     ENDIF
     C                     ADD  1         X1KAIC
     C                     Z-ADDX1KAIC    Z
     C           Z         IFLE 9
     C                     Z-ADDJ1WIHZ    X1D,Z
     C                     Z-ADDJ1WITM    X1T,Z
     C                     ENDIF
     C                     UPDATAJVPP101
     C*
     C                     ENDSR
      *================================================================
