     H            Y/
     F******************************************************
     F* MATERIAL MASTER                                    *
     F* Y.SAMEJIMA  2015.06.04                             *
     F******************************************************
     FIZAPP01 IF  E                    DISK
     FAJXWP01 O   F     256            DISK
     I*
     C           1         SETLLIZAPP01
     C                     DO   *HIVAL
     C                     READ IZAPP01                  99
     C   99                LEAVE
     C                     EXSR #SB100
     C                     ENDDO
     C                     SETON                     LR
     C                     RETRN
     C*****************************************************************
     C           #SB100    BEGSR
     C           ZCSKJY    IFEQ 'D'
     C                     GOTO ESB100
     C                     ENDIF
     C           ZCSTYY    IFNE 9999
     C                     GOTO ESB100
     C                     ENDIF
     C*
     C                     EXCPTDT
     C*
     C           ESB100    ENDSR
     C*
      *
     OAJXWP01 E                DT
     O                         ZCKOJE
     O                         ZCKOJK
     O                         ZCZAIS
     O                         ZCZAIK
     O                         ZCKAKE
     O                         ZCKNO2
     O                         ZCKNO3
     O                         ZCTKJR
     O                         ZCNISG
     O                         ZCZIRO
     O                         ZCADR1
     O                         ZCADR2
     O                         ZCADR3
     O                         ZCADR4
     O                         ZCUKIR
     O                         ZCUKYY
     O                         ZCUKMM
     O                         ZCUKDD
     O                         ZCUBIN
     O                         ZCSTYY
     O                         ZCSTMM
     O                         ZCSTDD
     O                         ZCSBIN
