     H            Y/
     F******************************************************
     F*単重比較チェック
     F* KIRI        2019.06.17
     F******************************************************
      * PARTIAL COMBINE UNIT WEIGHT FILE   *
     FAJZPP50 IF  E           K        DISK
      *
      * .. PART INFORMATION M/F   *.
     FFCEPL01 IF  E           K        DISK
      *
      * FA(PLATING HANDLING)M/F LOGICAL
     FAJSPL01 IF  E           K        DISK
      ********
     FAJXWP03 O   F     512            DISK
      *================================================================
      *************
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80M@KEHZ
     I                                        1   40M@KEIY
     I                                        5   60M@KEIM
     I                                        7   80M@KEID
      *================================================================
      *
     C           *LOVAL    SETLLAJZPP50
     C                     Z-ADD0         M$TANJ  73
     C                     MOVE *BLANK    M$HIN1  5
     C                     MOVE *BLANK    M$HIN2  5
     C                     MOVE *BLANK    M$HIN3  2
     C                     EXCPT$HED
      *-------------------------
     C                     DO   *HIVAL
     C                     READ AJZPP50                  90
     C   90                LEAVE
     C           M@SKJY    IFEQ 'D'
     C           M@SKDT    ANDLE*DATE
     C                     ITER
     C                     ENDIF
      *
 S2  C           M@HIN1    IFEQ M$HIN1
     C           M@HIN2    ANDEQM$HIN2
     C           M@HIN3    ANDEQM$HIN3
 X2  C                     ELSE
  S3 C           M$HIN1    IFNE *BLANK
     C                     EXSR ##
  E3 C                     ENDIF
     C                     MOVELM@HIN1    M$HIN1  5
     C                     MOVELM@HIN2    M$HIN2  5
     C                     MOVELM@HIN3    M$HIN3  2
 E2  C                     ENDIF
      *単重
     C                     Z-ADDM@TAN1    M$TAN1  73
     C                     Z-ADDM@TAN2    M$TAN2  73
     C                     Z-ADDM@TAN3    M$TAN3  73
     C                     Z-ADDM@TANJ    M$TANJ  73
      *最終計量日
     C                     Z-ADDM@KEHZ    M$KEHZ  80
      *
E1   C                     ENDDO
      *-------------------------
S1   C           M$HIN1    IFNE *BLANK
     C                     EXSR ##
E1   C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *================================================================
      *
      *================================================================
     C           ##        BEGSR
      *
      * .. PART INFORMATION M/F   *.
      *
     C           KEY01     KLIST
     C                     KFLD           M$HIN1  5
     C                     KFLD           M$HIN2  5
     C                     KFLD           M$HIN3  2
      *
     C           KEY01     CHAINFCEPL01              91
     C  N91      A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     91
     C                     ENDIF
      *
     C   91                Z-ADD0         A2KASI
      *
      * FA(PLATING HANDLING)M/F LOGICAL
      *
     C           KEY01     SETLLAJSPL01
     C                     DO   *HIVAL
     C           KEY01     READEAJSPL01                  91
     C   91                LEAVE
     C           J1SKJY    IFEQ 'D'
     C           J1SKHZ    ANDLE*DATE
     C                     ITER
     C                     ENDIF
     C                     LEAVE
     C                     ENDDO
      *
     C   91                Z-ADD0         J1TANJ
      *
     C                     MOVE '-'       M$HF1   1
     C                     MOVE '-'       M$HF2   1
     C           M$HIN3    IFEQ *BLANK
     C                     MOVE ' '       M$HF2
     C           M$HIN2    IFEQ *BLANK
     C                     MOVE ' '       M$HF1
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXCPT$DATA
      *
     C                     ENDSR
      *================================================================
      *
      *================================================================
     OAJXWP03 E                $HED
     O                                      '品番,'
     O                                      'ＦＡマスタ,'
     O                                      '実績,'
     O                                      '計量１'
     O                                      '計量２'
     O                                      '計量３'
     O                                      '部品マスタ,'
     O                                      '実績最終計量日,'
     O        E                $DATA
     O                         M$HIN1
     O                         M$HF1
     O                         M$HIN2
     O                         M$HF2
     O                         M$HIN3
     O                                      ','
     O                         J1TANJ       '  0 .   '
     O                                      ','
     O                         M$TAN1       '  0 .   '
     O                                      ','
     O                         M$TAN2       '  0 .   '
     O                                      ','
     O                         M$TAN3       '  0 .   '
     O                                      ','
     O                         M$TANJ       '  0 .   '
     O                                      ','
     O                         A2KASI       '   0 .  '
     O                                      ','
     O                         M$KEHZ
     O                                      ','
