     H            Y.                                    1
      ** AJZR10 **********************************
      *端数統合実績ファイルの作成              *
      *               CREATE DATE : 2014.08.11   *
      *               AUTHOR      : T.SAKASHITA  *
      ********************************** AJSR1A **
     FAJSWP91 IP  F     256            DISK
     FAJZPL13 IF  E           K        DISK
     FAJZPP10 O   E                    DISK                      A
     FAJZPP50 O   E                    DISK                      A
     FAFAPP60 O   E                    DISK                      A
     F***QPRINT4 O   F     156     OC     PRINTER                        UC
     F***QPRINT3 O   F     156     OD     PRINTER
     E                    CHK         8  1               CHECK
     E                    S       1  14  1               SUUJI
     E                    AK          6 14
     E                    LT          6  7
     IAJSWP91 AA  01
     I                                        1 150 DATA
     I                                        1   8 CHK
     I*
     I                                        1   1 J1KANK
     I                                        2   5 J1ZETI
     I                                        6   8 J1THAI
     I                                        9  10 J1PAG1
     I                                       11  12 J1PAG2
     I                                       13  14 J1PAG3
     I                                       15  16 J1PAG4
     I                                       17  17 J12JKA
     I                                       18  18 J1TASY
     I                                       19  19 J1SYKO
     I                                       20  20 J1HKBR
     I                                       21  28 J1ZBR1
     I                                       29  36 J1ZBR2
     I                                       37  37 J1HNTE
     I                                       38  42 J1HIN1L1
     I                                       43  47 J1HIN2L1
     I                                       48  49 J1HIN3L1
     I                                       50  50 J1MKTE
     I                                       51  531J1MKSU
     I                                       54  54 J1IRTE
     I                                       55  55 J1IROK
     I                                       56  56 J1SYTE
     I                                       57  610SYUY
     I                                       62  62 J1HKFA
     I                                       63  63 J1TATE
     I                                       64  703TANJ
     I                                       71  740J1WINY
     I                                       73  740J@WINY
     I                                       75  760J1WINM
     I                                       77  780J1WIND
     I                                       79  800J1WINJ
     I                                       81  820J1WINF
     I                                       83  872J1WMJY
     I                                       88  89 J1MKKB
     I                                       90  930J1KEIY
     I                                       92  930J@KEIY
     I                                       94  950J1KEIM
     I                                       96  970J1KEID
     I                                       98  990J1KEIJ
     I                                      100 1010J1KEIF
     I                                      102 1062J1WAIT
     I                                      107 1080J1TMAI
     I                                      109 109 J1GAFR
     I                                      110 110 J1NGFR
     I                                      111 111 J1MKFR
     I                                      112 1141J1SOKK
     I                                      115 120 J1TOCD
     I                                      121 126 J1KECD
     I                                      127 127 J1SAIK
     I                                      128 1343J1MTAN
     I                                      135 1360J1KHAK
     I                                      137 151 J1KBAR
     I                                      152 152 J1APPLL1
      *
     I                                      137 137 B#1
     I                                      138 141 B#2
     I                                      142 144 B#3
     I                                      145 146 B#4
     I                                      147 147 B#5
     I                                      148 148 B#6
     I                                      149 149 B#7
     I                                      150 150 B#8
     I                                      151 151 B#9
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1   60WTIME
     I                                        1   20WJJ
     I                                        3   40WFF
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@THMS
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  140W@DYMD
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
     I            DS
     I                                        1  84 AK
     I                                        1  14 AAKAN1
     I                                       15  28 AAKAN2
     I                                       29  42 AAKAN3
     I                                       43  56 AAKAN4
     I                                       57  70 AAKAN5
     I                                       71  84 AAKAN6
     I            DS
     I                                        1  42 LT
     I                                        1   7 AALOT1
     I                                        8  14 AALOT2
     I                                       15  21 AALOT3
     I                                       22  28 AALOT4
     I                                       29  35 AALOT5
     I                                       36  42 AALOT6
     I            DS
     I                                        1  14 B@ALL
     I                                        1   1 B@KANK
     I                                        2   5 B@ZETI
     I                                        6   8 B@TEHI
     I                                        9  10 B@PAGE
     I                                       11  11 B@2JKA
     I                                       12  12 B@TASY
     I                                       13  13 B@SYKO
     I                                       14  14 B@HKBR
     I            DS
     I                                        1   80AASKHZ
     I                                        1   40AASKYY
     I                                        5   60AASKMM
     I                                        7   80AASKDD
     I            DS
     I                                        1   80AAKOHZ
     I                                        1   40AAKOYY
     I                                        5   60AAKOMM
     I                                        7   80AAKODD
     I            DS
     I                                        1   80AAYMD
     I                                        1   40AAYYYY
     I                                        5   60AAMMMM
     I                                        7   80AADDDD
     I            DS
     I                                        1  12 AAPART
     I                                        1   5 AAPRT1
     I                                        6  10 AAPRT2
     I                                       11  12 AAPRT3
     C           *IN10     IFEQ '0'
     C                     SETON                     10
     C                     TIME           WTIME   60
     C                     TIME           W@TIME
     C***                  EXCPTHD3
     C                     Z-ADD0         J1SKYY
     C                     Z-ADD0         J1SKMM
     C                     Z-ADD0         J1SKDD
     C                     Z-ADD*YEAR     J1KOYY
     C                     Z-ADDUMONTH    J1KOMM
     C                     Z-ADDUDAY      J1KODD
     C                     Z-ADDWJJ       J1KOHH
     C                     Z-ADDWFF       J1KOSS
     C                     MOVE #USER     J1KOME
     C                     END
     C*
     C           *INL1     IFEQ '1'
     C                     Z-ADD0         @X      20
     C                     Z-ADD0         @Y      20
     C                     MOVE *BLANK    AK
     C                     MOVE *BLANK    LT
     C                     END
     C*-----------------------------------------------------
     C*
     C***        RRN       ADD  1         RRN     40
     C*投入実績と重複していないかチェック*
     C*投入ファイルを引く*
     C           KEY1      KLIST
     C                     KFLD           J1MKKB
     C                     KFLD           J1HIN1
     C                     KFLD           J1HIN2
     C                     KFLD           J1HIN3
     C                     KFLD           J1WINY
     C                     KFLD           J1WINM
     C                     KFLD           J1WIND
     C                     KFLD           J1WINJ
     C                     KFLD           J1WINF
     C                     KFLD           J1KEIY
     C                     KFLD           J1KEIM
     C                     KFLD           J1KEID
     C                     KFLD           J1KEIJ
     C                     KFLD           J1KEIF
     C                     KFLD           J1THAI
     C                     KFLD           J1PAG1
     C                     KFLD           J1PAG2
     C                     KFLD           J1PAG3
     C                     KFLD           J1PAG4
     C                     KFLD           J1WMJY
     C                     KFLD           J1WAIT
     C           KEY1      CHAINAJZPL131             12
     C           *IN12     IFEQ '0'
     C***        *IN20     IFEQ '0'
     C***                  SETON                     20
     C***                  OPEN QPRINT4
     C***                  EXCPTHD4
     C***                  END
     C***                  EXCPTME4
     C***        DAB       ADD  1         DAB     50
     C***        *INOC     IFEQ '1'
     C***                  SETOF                     OC
     C***                  EXCPTHD4
     C***                  END
     C                     GOTO END
     C                     END
     C*先頭部分が数字かチェック*
     C                     Z-ADD1         I       20
     C                     SETOF                     1113
     C*
     C                     DO   8         I
     C           CHK,I     LOKUPS                        11cﾇﾆﾞf kｩｮh
     C           *IN11     IFEQ '0'
     C*
     C***        *IN13     IFEQ '0'
     C***        KEN       ADD  1         KEN     50
     C***                  EXCPTME3
     C***                  SETON                     13
     C***                  END
     C*
     C***        *INOD     IFEQ '1'
     C***                  SETOF                     OD
     C***                  EXCPTHD3
     C***                  END
     C**** NOT OMITTO **** GOTO END
     C                     END
     C                     END
     C*名古屋螺子分のデータ読み飛ばし*
     C*
     C                     Z-ADDSYUY      J1SYUY
     C                     Z-ADDTANJ      J1TANJ
     C*
     C                     EXSR #SETAD
     C*
     C                     WRITEAJZPP101
     C*
     C           J1TATE    IFEQ '1'
     C                     EXSR #TANJ
     C                     END
     C*
     C           END       TAG
     C***LR                   EXCPTTO3
     C***LR         *IN20     IFEQ '1'
     C***LR                   EXCPTTO4
     C***LR                   CLOSEQPRINT4
     C***LR                   END
      *
     CL1                   EXSR #AFA
      *
     C           #TANJ     BEGSR
      *
     C                     MOVE *BLANK    M@SKJY
     C                     Z-ADD0         M@SKDT
     C                     Z-ADDW@DYMD    M@KODT
     C                     Z-ADDW@THMS    M@KOTM
     C                     MOVEL#USER     M@KOUS
     C                     MOVEL#PGM      M@KOPG
      *
     C                     MOVELJ1HIN1    M@HIN1
     C                     MOVELJ1HIN2    M@HIN2
     C                     MOVELJ1HIN3    M@HIN3
     C                     Z-ADDJ1KEIY    M@KEIY
     C                     Z-ADDJ1KEIM    M@KEIM
     C                     Z-ADDJ1KEID    M@KEID
     C                     Z-ADDJ1KEIJ    M@KEIJ
     C                     Z-ADDJ1KEIF    M@KEIF
     C                     Z-ADDJ1TANJ    M@TANJ
      *
     C                     WRITEAJZPP501
      *
     C           ETANJ     ENDSR
      *-----------------------------------------------------
     C           #SETAD    BEGSR
     C*
     C                     ADD  1         @X
     C*
     C                     MOVE J1KANK    B@KANK
     C                     MOVE J1ZETI    B@ZETI
     C                     MOVE J1THAI    B@TEHI
     C                     MOVE J1PAG1    B@PAGE
     C                     MOVE J12JKA    B@2JKA
     C                     MOVE J1TASY    B@TASY
     C                     MOVE J1SYKO    B@SYKO
     C                     MOVE J1HKBR    B@HKBR
     C*
     C           @X        IFLE 6
     C                     MOVELB@ALL     AK,@X
     C                     END
     C*
     C           J1ZBR1    IFNE *BLANK
     C                     ADD  1         @Y
     C           @Y        IFLE 6
     C                     MOVELJ1ZBR1    LT,@Y
     C                     END
     C                     END
     C*
     C           J1ZBR2    IFNE *BLANK
     C                     ADD  1         @Y
     C           @Y        IFLE 6
     C                     MOVELJ1ZBR2    LT,@Y
     C                     END
     C                     END
     C*
     C           ESETAD    ENDSR
     C*-----------------------------------------------------
     C           #AFA      BEGSR
      *
     C* * *      B#2       IFNE J1ZETI
     C* * *                GOTO EAFA
     C* * *                END
      *
     C* * *      J1KBAR    IFEQ *BLANK
     C* * *                GOTO EAFA
     C* * *                END
      *
     C           @X        IFEQ 0
     C                     GOTO EAFA
     C                     END
      *
     C                     MOVE *BLANK    AASKJY
     C                     Z-ADD0         AASKHZ
     C                     Z-ADDW@DYMD    AAKOHZ
     C                     Z-ADDW@TH      AAKOHH
     C                     Z-ADDW@TM      AAKOSS
     C                     MOVEL#PGM      AAKOME
     C                     Z-ADDW@DYMD    AAYMD
     C                     MOVE *BLANK    AAKCD
     C                     MOVE J1HIN1    AAPRT1
     C                     MOVE J1HIN2    AAPRT2
     C                     MOVE J1HIN3    AAPRT3
     C                     MOVE J1ZETI    AAZETI
     C                     MOVE B#3       AANLOT
     C                     MOVE '1'       AAFLAG
     C                     MOVE *BLANK    AAAPFG
     C           J1APPL    IFEQ 'A'
     C                     MOVE '0'       AAAPFG           APICS
     C                     END
     C           J1APPL    IFEQ 'P'
     C                     MOVE '1'       AAAPFG           PLASTIC
     C                     END
     C                     Z-ADD1         AACOPY
     C                     MOVE *BLANK    AAUPFG
     C                     MOVE *BLANK    AAFILR
      *
     C                     WRITEAFAPP601
      *
     C           EAFA      ENDSR
      *
     O***QPRINT3 E  102           HD3
     O***                               131 '......................'
     O***     E  1             HD3
     O***                               131 '.         .          .'
     O***     E  1             HD3
     O***                                12 'AJSR1A-1'
     O***                                89 'TIME'
     O***                      WTIME     98 '  :  :  '
     O***                               131 '.         .          .'
     O***     E  2             HD3
     O***                                43 'PLATING'
     O***                                62 'LOADING DATA ERROR'
     O***                                70 'RECORDS'
     O***                                83 'DETAILS LIST'
     O***                                89 'DATE'
     O***                      UDATE Y   98
     O***                               104 'PAGE'
     O***                      PAGE2 Z  108
     O***                               131 '......................'
     O***     E  1             HD3
     O***                                 2 ' '
     O***     E  1             HD3
     O***                               132 'NON-CONF'
     O***                               119 'FRC'
     O***     E  1             HD3
     O***                                16 'PROD'
     O***                                35 'INP'
     O***                                57 'INP'
     O***                                62 'INP'
     O***                                51 'INP'
     O***                                70 'BOX'
     O***                                78 'CMPLET'
     O***                                85 'ADMIT'
     O***                                91 'ADMIT'
     O***                                97 'ADMIT'
     O***                               106 'WEIGH'
     O***                               113 'WEIGH'
     O***                               119 'WEIGH'
     O*******>>                         125 '+/-'
     O*******>>                         129 '+/-'
     O***     E  1             HD3
     O***                                 3 'REC'
     O***                                 7 'MGT'
     O***                                10 'ID'
     O***                                16 'ODR'
     O***                                54 'PLT'
     O***                                61 'COLOR'
     O***                                67 'ACCOM'
     O***                                72 'UNW'
     O***                               101 'PLT'
     O***                               121 'HNDL'
     O***                               140 'MATERIAL BARCODE'
     O***     E  2             HD3
     O***                                 3 'NO'
     O***                                 7 'NO'
     O***                                10 'NO'
     O***                                16 'NO'
     O***                                24 'PAGE NO'
     O***                                31 'INST'
     O***                                36 'INST'
     O***                                47 'INT CO P/N'
     O***                                55 'COEF'
     O***                                65 'QTY'
     O***                                70 'TYP'
     O***                                75 'UNW'
     O***                                85 'Y M D'
     O***                                90 'T M'
     O***                                97 'WEGHT'
     O***                               101 'M/N'
     O***                               107 'Y M D'
     O***                               112 'T M'
     O***                               119 'WEGHT'
     O***                               140 '   1        2    '
     O***     E  1             ME3
     O***                      RRN   1    5
     O***                      J1KANK     7
     O***                      J1ZETI    12
     O***                      J1THAI    16
     O***                      J1PAG1    19
     O***                      J1PAG2    21
     O***                      J1PAG3    23
     O***                      J1PAG4    25
     O***                      J12JKA    28
     O***                      J1TASY    29
     O***                      J1SYKO    30
     O***                      J1HKBR    31
     O***                      J1HNTE    34
     O***                      J1HIN1    42
     O***                      J1HIN2    47
     O***                      J1HIN3    49
     O***                      J1MKTE    51
     O***                      J1MKSU    55
     O***                      J1IRTE    57
     O***                      J1IROK    59
     O***                      J1SYTE    61
     O***                      SYUY      67
     O***                      J1HKFA    69
     O***                      J1TATE    71
     O***                      TANJ      79
     O***                      J@WINY    82
     O***                      J1WINM    84
     O***                      J1WIND    86
     O***                      J1WINJ    89
     O***                      J1WINF    91
     O***                      J1WMJY    96
     O***                      J1MKKB    99
     O***                      J@KEIY   103
     O***                      J1KEIM   105
     O***                      J1KEID   107
     O***                      J1KEIJ   110
     O***                      J1KEIF   112
     O***                      J1WAIT   117
     O***                      J1ZBR1   125
     O***                      J1ZBR2   134
     O***     E 11             TO3
     O***                                20 'TOTAL ERROR COUNT'
     O***                      RRN   1   30
     O***                                38 '/'
     O***                      KEN   1   48
     O***QPRINT4 E  102           HD4
      ***
     O***                               131 '.....................'
     O***     E  1             HD4
     O***                               131 '.         .         .'
     O***     E  1             HD4
     O***                                12 'AJSR1A-2'
     O***                                89 'TIME'
     O***                      WTIME     98 '  :  :  '
     O***                               131 '.         .          .'
     O***     E  2             HD4
     O***                                43 'PLATING'
     O***                                62 'LOADING DATA REPETITION'
     O***                                70 'RECORDS'
     O***                                84 'DETAILS LIST'
     O***                                89 'DATE'
     O***                      UDATE Y   98
     O***                               104 'PAGE'
     O***                      PAGE3 Z  108
     O***                               131 '......................'
     O***     E  1             HD4
     O***                                 2 ' '
     O***     E  1             HD4
     O***                               119 'FRC'
     O***                               132 'NON-CONF'
     O***     E  1             HD4
     O***                                16 'PROD'
     O***                                35 'INP'
     O***                                57 'INP'
     O***                                62 'INP'
     O***                                51 'INP'
     O***                                70 'BOX'
     O***                                78 'CMPLET'
     O***                                85 'ADMIT'
     O***                                91 'ADMIT'
     O***                                97 'ADMIT'
     O***                               106 'WEIGH'
     O***                               113 'WEIGH'
     O***                               119 'WEIGH'
     O***********>>                     125 '+/-'
     O***********>>                     129 '+/-'
     O***     E  1             HD4
     O***                                 3 'REC'
     O***                                 7 'MGT'
     O***                                10 'ID'
     O***                                16 'ODR'
     O***                                54 'PLT'
     O***                                61 'COLOR'
     O***                                67 'ACCOM'
     O***                                72 'UNW'
     O***                               101 'PLT'
     O***                               121 'HNDL'
     O***                               140 'MATERIAL BARCODE'
     O***     E  2             HD4
     O***                                 3 'NO'
     O***                                 7 'NO'
     O***                                10 'NO'
     O***                                16 'NO'
     O***                                24 'PAGE NO'
     O***                                31 'INST'
     O***                                36 'INST'
     O***                                47 'INT CO P/N'
     O***                                55 'COEF'
     O***                                65 'QTY'
     O***                                70 'TYP'
     O***                                75 'UNW'
     O***                                85 'Y M D'
     O***                                90 'T M'
     O***                                97 'WEGHT'
     O***                               101 'M/N'
     O***                               107 'Y M D'
     O***                               112 'T M'
     O***                               119 'WEGHT'
     O***                               140 '   1        2    '
     O***     E  1             ME4
     O***                      RRN   1    5
     O***                      J1KANK     7
     O***                      J1ZETI    12
     O***                      J1THAI    16
     O***                      J1PAG1    19
     O***                      J1PAG2    21
     O***                      J1PAG3    23
     O***                      J12JKA    28
     O***                      J1TASY    29
     O***                      J1SYKO    30
     O***                      J1HKBR    31
     O***                      J1HNTE    34
     O***                      J1HIN1    42
     O***                      J1HIN2    47
     O***                      J1HIN3    49
     O***                      J1MKTE    51
     O***                      J1MKSU    55
     O***                      J1IRTE    57
     O***                      J1IROK    59
     O***                      J1SYTE    61
     O***                      SYUY      67
     O***                      J1HKFA    69
     O***                      J1TATE    71
     O***                      TANJ      79
     O***                      J@WINY    82
     O***                      J1WINM    84
     O***                      J1WIND    86
     O***                      J1WINJ    89
     O***                      J1WINF    91
     O***                      J1WMJY    96
     O***                      J1MKKB    99
     O***                      J@KEIY   103
     O***                      J1KEIM   105
     O***                      J1KEID   107
     O***                      J1KEIJ   110
     O***                      J1KEIF   112
     O***                      J1WAIT   117
     O***                      J1ZBR1   127
     O***                      J1ZBR2   137
     O***     E 11             TO4
     O***                                23 'TOTAL REPETITION COUNT'
     O***                      RRN   1   30
     O***                                38 '/'
     O***                      DAB   1   48
**  THE TOP CHARACTER OF CHECK OK(NO OUTPUT)
1
2
3
4
5
6
7
8
9
0

A
N
#
