     H            Y.                                                      DAD000
     FAJZPP50 IF  E           K        DISK
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5
     C                     PARM           P@HIN2  5
     C                     PARM           P@HIN3  2
     C                     PARM           P@TANJ  73
      *
     C                     Z-ADD0         P@TANJ
      *
     C                     MOVE P@HIN1    K@HIN1  5
     C                     MOVE P@HIN2    K@HIN2  5
     C                     MOVE P@HIN3    K@HIN3  2
      *
     C           AJZKEY    KLIST
     C                     KFLD           K@HIN1
     C                     KFLD           K@HIN2
     C                     KFLD           K@HIN3
      *
     C           AJZKEY    SETGTAJZPP50
      *
     C                     DO   *HIVAL
     C           AJZKEY    REDPEAJZPP50                  88
     C   88                LEAVE
     C           M@SKJY    IFEQ 'D'
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
      *
     C           *IN88     IFEQ '0'
     C                     Z-ADDM@TANJ    P@TANJ
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
