     H            Y/
     F******************************************************
     F* T.SAKASHITA 2014.08.11
     F* %0001 T.SAKAKI 2016.07.28  CHANGE DATE FOR DATR
     F*----------+-----+----------+-----------------------------------*
     F*2021.03.10|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F*****************************************************************
     FAAFTL06 IP  E           K        DISK
     FAGAPL31 IF  E           K        DISK
      ********
     FFCEPL01 IF  E           K        DISK
     FOABPL01 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FMBDPL01 IF  E           K        DISK
      ********
     F*AJSPL01 IF  E           K        DISK
      ********
     FAJZWP01 O   F     512            DISK
     E                    TK         15  6               番地
     E                    TY         15  1               かんばん種類
      ********
     E                    A3JOK       8  2               ﾆﾞｭci] (2ij)
     E                    W3JK        6  2               ﾆﾞｭci](pﾇfﾞjkｩｮh)
     E                    WMNM        2 12
     E                    WNNM        4 20
     E                    #CHK    1  22  2               pﾇfﾞj kｩｮh
      ********
     I            DS
     I                                        1   80A3STDT
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     I            DS
     I                                        1   80A3UKDT
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
      *************
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  16 A3JOK
     I                                        1  12 A3JK
     I                                        1   2 A3JOK1
     I                                        3   4 A3JOK2
     I                                        5   6 A3JOK3
     I                                        7   8 A3JOK4
     I                                        9  10 A3JOK5
     I                                       11  12 A3JOK6
     I                                       13  14 A3JOK7
     I                                       15  16 A3JOK8
     I            DS
     I                                        1  24 WMNM
     I                                        1  12 WMNM1
     I                                       13  24 WMNM2
     I            DS
     I                                        1  80 WNNM
     I                                        1  20 WNNM1
     I                                       21  40 WNNM2
     I                                       41  60 WNNM3
     I                                       61  80 WNNM4
      *************
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20WTIJJ
     I                                        3   40WTIHH
     I                                        5   60WTIBB
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
     I            DS
     I                                        1   2 WCBKO
     I                                        1   1 WCBKO1
      *
     C           A31HB5    IFEQ 'U0819'
     C           A32HB5    ANDEQ'A8008'
     C           A33HB2    ANDEQ'  '
     C                     MOVE A33HB2    A33HB2
     C                     END
      *
     C           A3SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
      *失効日の拡大
     C           A3STYY    IFEQ 2031
     C                     Z-ADD2013      A3STYY
     C                     END
     C                     MOVE A3STDT    PRDAT
     C           A3STMM    IFNE 99
     C                     MOVE A3STDT    PDATE   8
     C                     MOVE '+'       PPORM   1        + OR -
%0001C***                  MOVE '0005'    PDAYS   4
     C                     MOVE '0001'    PDAYS   4
     C                     MOVE *BLANK    PRDAT   8
     C                     MOVE *BLANK    PRTN    1
     C                     CALL 'DATR1A'
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C                     END
     C                     MOVE PRDAT     W@STDT  80
      *有効日の拡大
     C           A3UKYY    IFEQ 2031
     C                     Z-ADD2013      A3UKYY
     C                     END
     C                     MOVE A3UKDT    PDATE   8
     C                     MOVE '-'       PPORM   1        + OR -
%0001C***                  MOVE '0005'    PDAYS   4
     C                     MOVE '0001'    PDAYS   4
     C                     MOVE *BLANK    PRDAT   8
     C                     MOVE *BLANK    PRTN    1
     C                     CALL 'DATR1A'
     C                     PARM           PDATE   8
     C                     PARM           PPORM   1        + OR -
     C                     PARM           PDAYS   4
     C                     PARM           PRDAT   8
     C                     PARM           PRTN    1
     C                     MOVE PRDAT     W@UKDT  80
      *
     C                     TIME           WTIME
      *
     C           WTIHZ     IFGE W@UKDT
     C           WTIHZ     ANDLEW@STDT
     C                     ELSE
     C                     GOTO @END
     C                     END
      *
     C           OPNFLG    IFEQ *BLANK
     C                     MOVE '1'       OPNFLG  1
     C                     MOVE '1'       OPNCLS  1
     C                     ELSE
     C                     MOVE '0'       OPNCLS
     C                     END
      *
     C           A31HB5    IFEQ 'U0819'
     C           A32HB5    ANDEQ'B1133'
     C           A33HB2    ANDEQ'  '
     C                     MOVE A33HB2    A33HB2
     C                     END
      *
     C           A31HB5    IFEQ '90913'
     C           A32HB5    ANDEQ'A1002'
     C           A33HB2    ANDEQ'  '
     C                     MOVE A33HB2    A33HB2
     C                     END
      *
     C                     MOVELA31HB5    PIHIN1
     C                     MOVELA32HB5    PIHIN2
     C                     MOVELA33HB2    PIHIN3
     C                     MOVELWTIHZ     PIYMDB
     C                     MOVE '01'      PIYMDB
     C                     MOVE *BLANK    POTBMN
     C                     MOVE *BLANK    POTKBN
     C                     MOVE *BLANK    POTTKR
     C                     MOVE *BLANK    POTSHR
     C                     MOVE *BLANK    POTKOT
     C                     MOVE *BLANK    POTHBN
      *
     C                     CALL 'AAMRS0'  AAMR96
     C           AAMR96    PLIST
      *入力パラメータ
     C                     PARM           PIHIN1  5
     C                     PARM           PIHIN2  5
     C                     PARM           PIHIN3  2
     C                     PARM           PIYMDB 10
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           POTBMN 60
     C                     PARM           POTKBN 45
     C                     PARM           POTTKR 90
     C                     PARM           POTSHR 15
     C                     PARM           POTKOT 45
     C                     PARM           POTHBN180
     C                     PARM           STATUS  1
      *
     C                     MOVEAPOTTKR    TK
     C                     MOVEAPOTSHR    TY
      *
     C                     MOVE *BLANK    W@TKR   6
     C           1         DO   15        @X      20
     C           16        SUB  @X        @Z      20
     C           TK,@Z     IFEQ *BLANK
     C                     ITER
     C                     END
     C                     MOVE TK,@Z     W@TKR
     C                     LEAVE
     C                     ENDDO
      *
     C           #KEY04    CHAINAGAPL31              88
     C           *IN88     IFEQ '0'
     C           CBSKJY    IFEQ 'D'
     C                     SETON                     88
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    D@KBN   1
     C           A3ATKR    IFEQ W@TKR
     C           *IN88     ANDEQ'0'
     C                     MOVE 'A'       D@KBN
     C                     ELSE
     C                     MOVE 'P'       D@KBN
     C                     END
      *
     C           D@KBN     IFEQ 'P'
     C                     END
      *
     C                     Z-ADD0         P@TANJ
      *
     C                     CALL 'AJSRQ1'
     C                     PARM           A31HB5
     C                     PARM           A32HB5
     C                     PARM           A33HB2
     C                     PARM           P@RTN   1
     C           P@RTN     IFEQ '*'
     C                     CALL 'AJSRS4'
     C                     PARM           A31HB5
     C                     PARM           A32HB5
     C                     PARM           A33HB2
     C                     PARM           P@TANJ  73
     C                     END
      *
     C           P@TANJ    IFEQ 0
     C                     CALL 'AJZR5Z'
     C                     PARM           A31HB5
     C                     PARM           A32HB5
     C                     PARM           A33HB2
     C                     PARM           P@TANJ  73
     C                     END
      *
     C                     Z-ADDP@TANJ    J1TANJ  73
      * ZERO
     C                     Z-ADD0         J1OSYU  50
     C                     Z-ADD0         J121CD  40
     C                     Z-ADD0         J122CD  40
     C                     Z-ADD0         J1BAB1  20
     C                     Z-ADD0         J1BAB2  31
     C                     Z-ADD0         J1MSKB  30
     C                     Z-ADD0         J1MSKE  20
     C                     Z-ADD0         J1MSWS  10
     C                     Z-ADD0         J1MSNT  10
     C                     Z-ADD0         J1MSMA  31
     C                     Z-ADD0         J1MKRI  31
     C                     Z-ADD0         J1MKJI  31
     C                     Z-ADD0         J1BKIY  40
     C                     Z-ADD0         J1BKIM  20
     C                     Z-ADD0         J1BKID  20
     C                     Z-ADD0         J1KANS  30
     C                     Z-ADD0         J1HHAK  30
      *
     C                     Z-ADDWTIYY     J1KOYY  40
     C                     Z-ADDWTIMM     J1KOMM  20
     C                     Z-ADDWTIDD     J1KODD  20
      **************************
      **************************
     C                     EXSR B#AR23
      **************************
      **************************
     C                     ADD  1         @KEN    50
     C                     EXCPTODAT
      *
     C           @KEN      IFEQ 514
     C                     SETON                     77
     C                     END
      *
     C           @END      TAG
      *
     CLR         *INLR     IFEQ '1'
      *----------------------------------------------------------------
      * 終了処理
      *----------------------------------------------------------------
     CLR         OPNFLG    IFEQ '1'
     CLR                   MOVE *BLANK    PIHIN1
     CLR                   MOVE *BLANK    PIHIN2
     CLR                   MOVE *BLANK    PIHIN3
     CLR                   MOVE '9'       OPNCLS
     CLR                   CALL 'AAMRS0'  AAMR96
     CLR                   END
     CLR                   ENDIF
      *================================================================
      *
      *================================================================
     C           B#AR23    BEGSR
     C           #ENTRY    PLIST
     C                     PARM           #PARM1  5        f]ﾌﾞ] ALL
     C                     PARM           #PARM2  5              MIN
     C                     PARM           #PARM3  5              MAX
     C                     PARM           #PARM4  5              ﾆｭﾒ
     C                     PARM           #PARM5  1        ﾌｮﾃchﾎﾞ]
     C                     PARM           #PARM6  5        ﾌｮﾃcNOﾆｭgk
     C                     PARM           #PARM7  5        ﾌｮﾃcubﾇc
     C                     PARM           #PARM8  5        b]ﾆﾞubﾇc
     C*
     C           #KEY04    KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C           #KEY05    KLIST
     C                     KFLD           A3MAKB
     C                     KFLD           A3MTYP
     C           #KEY06    KLIST
     C                     KFLD           A3ATOB
     C                     KFLD           A3ATYP
     C           #KEY07    KLIST
     C                     KFLD           WJOKEN
     C                     KFLD           A3KCD1
     C           K#MBD1    KLIST
     C                     KFLD           A31HB5
     C                     KFLD           A32HB5
     C                     KFLD           A33HB2
     C                     KFLD           K@NONY
      *
     C                     Z-ADD3931      K@NONY  40
     C                     Z-ADD0         @KALL   30
     C                     Z-ADD0         @KMIN   30
     C                     Z-ADDA3KMAX    @KMAX   30
     C                     Z-ADDA3SRMS    @SRMS   30
      *
     C                     MOVE 'MK'      WRENO   2        かんばん識別
     C                     MOVE *BLANK    @HKBN   1        ﾌｮﾃchﾎﾞ]
     C                     Z-ADD0         @SYOK   50       ﾌｮﾃcNOﾆｭgk
     C                     Z-ADD0         @MAIS   50       ﾌｮﾃcubﾇc
     C                     Z-ADD0         @INZI   50       b]ﾆﾞubﾇc
      *
     C                     MOVE A3KALL    #PARM1
     C                     MOVE A3KMIN    #PARM2
     C                     MOVE A3KMAX    #PARM3
     C                     MOVE A3SRMS    #PARM4
     C                     MOVE *BLANK    #PARM5
     C                     MOVE *BLANK    #PARM6
     C                     MOVE *BLANK    #PARM7
     C                     MOVE *BLANK    #PARM8
     C                     CALL 'AAOR04'  #ENTRY           ﾌｮﾃcubﾇc計算
     C                     MOVE #PARM5    @HKBN            ﾌｮﾃchﾎﾞ]
     C                     MOVE #PARM6    @SYOK            ﾌｮﾃcNOﾆｭgk
     C                     MOVE #PARM7    @MAIS            ﾌｮﾃcubﾇc
     C                     MOVE #PARM8    @INZI            b]ﾆﾞubﾇc
     C                     MOVE 'MK'      WRENO   2        かんばん識別
      * 絶対番号 *
     C                     MOVE *BLANK    WZETI   4
     C                     SETOF                     11
     C           #KEY04    CHAINFCEPL011             11
     C           *IN11     IFEQ '0'
     C           A2GSKD    IFEQ 'D'
     C           A2GSHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVE A2ZETI    WZETI
     C                     END
     C                     END
      * ページ番号 *
     C                     MOVE @SYOK     WPAGE   20
      * 二次加工区分 *
     C                     MOVE 'A'       WNIJI   1
     C                     MOVE A3JK      W3JK
      * ﾎﾞ[]h kｩｮh
     C                     Z-ADD1         E       20
     C                     SETOF                     11
     C                     DO   6         E
     C           W3JK,E    IFNE *BLANK
     C                     SETON                     11
     C                     END
     C                     END
     C  N11                MOVE '0'       WNIJI
      *
     C                     Z-ADD1         E
     C                     DO   22        E
     C                     SETOF                     11
     C           #CHK,E    LOKUPW3JK                     11
     C           *IN11     IFEQ '1'
     C                     MOVE '0'       WNIJI
     C                     END
     C  N11                END
      * 対象区分・出庫有効区分 *
     C                     MOVE '5'       WTAIKB  1
     C                     MOVE '0'       WYUKO   1
     C                     SETOF                     11
     C           #KEY04    CHAINOABPL011             11
     C           *IN11     IFEQ '0'
     C           OBSKJY    IFEQ 'D'
     C           OBSKHZ    ANDLE*DATE
     C                     ELSE
     C           OBJKBN    IFEQ 'C'
      *
     C                     MOVE '0'       WTAIKB
     C           OBKBHZ    IFLE *DATE
     C                     MOVE OBSKBN    WYUKO
     C                     ELSE
     C                     MOVE OBKKBN    WYUKO
     C                     END
     C                     END
     C                     END
     C                     END
      * 前工程工場名
     C                     MOVE *BLANK    WMKJNM 16
     C                     SETOF                     11
     C           #KEY05    CHAINAATPL011             11
     C           *IN11     IFEQ '0'
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELDCNAMN    WMKJNM
     C                     END
     C                     END
      * 自工程部門名
     C                     MOVE *BLANK    WJBUNM 16
     C                     SETOF                     11
     C           #KEY06    CHAINAATPL011             11
     C           *IN11     IFEQ '0'
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELDCNAMN    WJBUNM
     C                     END
     C                     END
      * Ｃ箱比率
     C                     MOVE *BLANK    WCBKO   2
     C           A3CBKO    IFNE 0
     C                     MOVE A3CBKO    WCBKO
     C                     END
     C           WCBKO1    IFEQ '0'
     C                     MOVE *BLANK    WCBKO1
     C                     END
      * 表面処理
     C           A3KCD1    IFEQ 'C'
     C           A3KCD2    ANDEQ'Z'
     C                     MOVE *BLANK    W3MEKI  7
     C*
     C                     ELSE
     C                     MOVE A3MEKI    W3MEKI
     C                     END
      * メッキ条件名
     C                     Z-ADD1         E
     C                     MOVE *BLANK    WMNM
     C                     DO   2         E
     C                     MOVE '  '      WMNM,E
     C                     MOVE A3JOK,E   WJOKEN  2
     C                     SETOF                     11
     C           #KEY07    CHAINAAAPL011             11
     C           *IN11     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELA5JOKM    WMNM,E
     C                     END
     C                     END
     C                     END
      * 荷姿条件名
     C                     Z-ADD1         E
     C                     Z-ADD0         Z       20
     C                     MOVE *BLANK    WNNM
     C           3         DO   6         E
     C                     ADD  1         Z
     C                     MOVE A3JOK,E   WJOKEN  2
     C                     SETOF                     11
     C           #KEY07    CHAINAAAPL011             11
     C           *IN11     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELA5JOKM    WNNM,Z
     C                     END
     C                     END
     C                     END
      ** TMMKWV
     C           K#MBD1    CHAINMBDPL01              91
     C           *IN91     IFEQ *OFF
     C                     MOVE '*****'   WNNM4
     C                     ENDIF
      *
     C                     ENDSR
      *================================================================
     C           #AJS      BEGSR
     C*                    READ AJSPL01                  66
     C                     ENDSR
      *================================================================
     OAJZWP01 E                ODAT
     O                         D@KBN      1
     O                         A3ZETI     5
     O                         A31HB5    10
     O                         A32HB5    15
     O                         A33HB2    17
     O                         A3SSYS    22
     O                         A3SSYT    23
     O                         J1OSYU    28
     O*                        J1OHKS    29
     O                         A3UKYY    33
     O                         A3UKMM    35
     O                         A3UKDD    37
     O                         J1TANJ    44
     O                         A3MEKI    51
     O*
     O*
     O                         J121CD    55
     O*                        J121M1    57
     O*                        J121M2    59
     O                         J122CD    63
     O*                        J122K1    65
     O*                        J122K2    67
     O*                        J122K3    69
     O*                        J1NS11    71
     O*                        J1NS21    73
     O*                        J1NS22    75
     O*                        J1NS23    77
     O                         A3KCD1    78
     O*                        J1KSYO    79
     O*                        J1MKBN    81
     O                         J1BAB1    83
     O                         J1BAB2    86
     O                         J1MSKB    89
     O                         J1MSKE    91
     O*                        J1MSKJ    93
     O                         J1MSWS    94
     O                         J1MSNT    95
     O*                        J1MSNS    96
     O*                        J1MSZK    98
     O                         J1MSMA   101
     O*                        J1MSCK   102
     O*                        J1MSAK   104
     O                         J1MKRI   107
     O                         J1MKJI   110
     O*                        J1MKSK   111
     O                         A3ATK1   112
     O                         A3ATK2   114
     O                         A3ATK3   116
     O                         A3ATK4   117
     O*                        J1OBN1   118
     O*                        J1OBN2   120
     O*                        J1OBN3   122
     O*                        J1OBN4   123
     O                         J1BKIY   127
     O                         J1BKIM   129
     O                         J1BKID   131
     O                         J1KANS   134
     O                         J1HHAK   137
     O                         J1KOYY   141
     O                         J1KOMM   143
     O                         J1KODD   145
      ** B#AR23
     O                                      '      '
     O                         WRENO
     O                                      '1'
     O                         A31HB5
     O                         A32HB5
     O                         A33HB2
     O                         A3ATK1
     O                         A3ATK2
     O                         A3ATK3
     O                         A3ATK4
     O                                      'A'
     O                         WZETI
     O                                      '999'
     O                         WPAGE
     O                         WNIJI
     O                         WTAIKB
     O                         WYUKO
     O                         A3SSYT
     O                         A3MTK1
     O                         A3MTK2
     O                         A3MTK3
     O                         A3MTK4
     O                         WMKJNM
     O                         A3ATK1
     O                         A3ATK2
     O                         A3ATK3
     O                         A3ATK4
     O                         WJBUNM
     O                         W3MEKI
     O                         A3RAIN
     O                         A3BARA
     O                         A3BARB
     O                         WCBKO
     O                         A3SSYS
     O                         A3SSYT
     O                         WMNM1
     O                         WMNM2
     O                         WNNM1
     O                         WNNM2
     O                         WNNM3
     O                         WNNM4
     O                         @KALL
     O                         @KMIN
     O                         @KMAX
     O***                      A3SRMS
     O                         @SRMS
     O                         A3YOSI
     O                         A3KCD1
     O                         A3ATOK
**  #CHK
AR
GJ
NV
00
01
02
03
04
05
06
07
08
09
10
11
12
S1
L1
L2
L3
L4
L5
