     H            Y.                                    1
      ** AJZR20 **********************************
      *端数統合エラー実績ファイルの作成        *
      *               CREATE DATE : 2014.08.11   *
      *               AUTHOR      : T.SAKASHITA  *
      ********************************** AJSR1A **
     FAJSWP91 IP  F     256            DISK
     FFCETL11 IF  E           K        DISK
     FAJZPP20 O   E                    DISK
     IAJSWP91 AA  01
     I                                        1  15 J1BAR1
     I                                       16  20 J1HIN1
     I                                       21  25 J1HIN2
     I                                       26  27 J1HIN3
     I                                       28  42 J1BAR2
     I                                       43  43 J1ERRK
     I                                       44  45 J1KIBN
     I                                       46  490J1ERYY
     I                                       50  510J1ERMM
     I                                       52  530J1ERDD
     I                                       54  550J1ERHH
     I                                       56  570J1ERMN
     I                                       58  63 J1SAGY
     I                                       64  69 J1PASS
      *
     I                                       29  32 J1ZET2
      *
     C                     MOVE *BLANK    J1HINA
     C                     MOVE *BLANK    J1HINB
     C                     MOVE *BLANK    J1HINC
     C           J1ZET2    CHAINFCETL11              88
     C           *IN88     IFEQ '0'
     C                     MOVE A2BHB1    J1HINA
     C                     MOVE A2BHB2    J1HINB
     C                     MOVE A2BHB3    J1HINC
     C                     END
      *
     C                     WRITEAJZPP201
