     H            Y.
     F** AK#R06 *************************************
     F*  PRIORITY LIST - SRT                        *
     F*  COPY FROM AK#R03  2018.02.21               *
     F*  J.WATANABE                                 *
     F***********************************************
     FAK#WP05 IF  E           K        DISK
     FAK#PR06 O   E             55     PRINTER
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   60W2THMS
     I                                        1   2 W2THH
     I                                        3   4 W2TMM
     I                                        3   4 W2TSS
      *
     I            DS
     I                                        1   40W2STIM
     I                                        1   2 W2SHH
     I                                        3   4 W2SMM
      *
     I*****       DS
     I*****                                   1   6 W2KEY
     I*****                                   1   3 W2KOTE
     I*****                                   4   6 W2KIBN
      *
     I            DS
     I                                        1  14 WKSHN
     I                                        1   5 WKSHN1
     I                                        6   6 WKSF1
     I                                        7  11 WKSHN2
     I                                       12  12 WKSF2
     I                                       13  14 WKSHN3
      *
     I            DS
     I                                        1   6 W2LOC
     I                                        1   1 W2LOC1
     I                                        2   3 W2LOC2
     I                                        4   5 W2LOC3
     I                                        6   6 W2LOC4
      *
     C                     TIME           WTIME
      *
     C                     READ AK#WP051                 80
     C                     EXSR #SB100
     C                     MOVELW2KEY     SVKEY   7
     C           *IN80     DOWEQ'0'
     C           *IN55     IFEQ '1'
     C           W2KEY     ORNE SVKEY
     C                     EXSR #SB100
     C                     MOVELW2KEY     SVKEY
     C                     ENDIF
     C                     EXSR #SB400
     C                     READ AK#WP051                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     C           #SB100    BEGSR
      *
     C                     MOVELWTIYY     P1DAYY
     C                     MOVELWTIMM     P1DAMM
     C                     MOVELWTIDD     P1DADD
     C                     MOVELTIMHH     P1TIHH
     C                     MOVELTIMMM     P1TIMM
     C                     MOVELTIMSS     P1TISS
     C                     MOVEL*ALL'-'   P1LIN
     C                     WRITEAK#PR061
     C                     SETOF                     55
      *
     C                     ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     C           #SB400    BEGSR
      *
     C                     MOVELW2KOTE    P2KOTE
     C                     MOVELW2KIBN    P2KIBN
     C                     MOVEL*BLANK    P2SHN
     C                     MOVEL*BLANK    WKSHN
     C                     MOVELW2SHN1    WKSHN1
     C                     MOVEL'-'       WKSF1
     C                     MOVELW2SHN2    WKSHN2
     C           W2SHN3    IFNE *BLANK
     C                     MOVEL'-'       WKSF2
     C                     MOVELW2SHN3    WKSHN3
     C                     ENDIF
     C                     MOVELWKSHN     P2SHN
     C                     Z-ADDW2SSYS    P2SSYS
     C                     MOVEL*BLANK    P2TK
     C           P2TK      CAT  W2LOC2:0  P2TK
     C           P2TK      CAT  '-':0     P2TK
     C           P2TK      CAT  W2LOC3:0  P2TK
     C                     Z-ADDW2PRE     P2PRE
      *
     C                     Z-ADD0         WKPRO1  50
     C                     Z-ADD0         WKSYO   50
     C                     Z-ADD0         WKAMR   50
     C           W2UNS     SUB  W2QTY     WKPRO1  50
     C           WKPRO1    DIV  W2BARL    WKSYO
     C                     MVR            WKAMR
     C           WKAMR     IFNE 0
     C                     ADD  1         WKSYO
     C                     ENDIF
     C           W2BARL    MULT WKSYO     P2PROD
      *
     C                     Z-ADDW2DYMD    P2DYMD
     C                     MOVEL*BLANK    P2THMS
     C           P2THMS    CAT  W2THH:0   P2THMS
     C           P2THMS    CAT  ':':0     P2THMS
     C           P2THMS    CAT  W2TMM:0   P2THMS
     C                     Z-ADDW2SDAT    P2SDAT
     C                     MOVEL*BLANK    P2STIM
     C           P2STIM    CAT  W2SHH:0   P2STIM
     C           P2STIM    CAT  ':':0     P2STIM
     C           P2STIM    CAT  W2SMM:0   P2STIM
     C                     MOVELW2MEK1    P2MEK1
     C                     MOVELW2MEK2    P2MEK2
     C                     MOVELW2MEK3    P2MEK3
     C                     MOVELW2JNAM    P2JNAM
     C**                   MOVELW2SRTN    P2SRTN
     C**                   MOVELW2SRT#    P2SRT#
      *
     C                     MOVELW2IDAT    P2IDAT
     C                     MOVELW2IBIN    P2IBIN
     C                     MOVELW2IORD    P2IORD
      *
     C                     WRITEAK#PR062
      *
     C                     ENDSR
