     H            Y.                                    1
     H** AK#R05 *************************************
     H*  PRIORITY LIST - SRT                        *
     H*  COPY FROM AK#R02  2018.02.21               *
     H*  J.WATANABE                                 *
     H*  READ BY PROCESS                            *
     H*  SET PRODUCTION TIME FOR SHORTAGE           *
     H*  --------------------------                 *
JW1  H*  JW  2018.03.26 CHG DUE DATE TO SCAN DATE
     H***********************************************
     FAK#WP04 IF  E                    DISK
     FAK#WP05 O   E                    DISK                      A
      *
     E                    TB1     1  16  4   TB2     2 0
      *
     I            DS
     I                                        1  140W@TIME
     I                                        1   60W@THMS
     I                                        1   20W@TH
     I                                        3   40W@TM
     I                                        5   60W@TS
     I                                        7  140W@DYMD
     I                                        7  100W@DY
     I                                       11  120W@DM
     I                                       13  140W@DD
      *
     I            DS
     I                                        1  140@@TIME
     I                                        1   60@@THMS
     I                                        1   20@@TH
     I                                        3   40@@TM
     I                                        5   60@@TS
     I                                        7  140@@DYMD
     I                                        7  100@@DY
     I                                       11  120@@DM
     I                                       13  140@@DD
     I            DS
     I                                        1  260WWDATE
     I                                        1   60WWDAT1
     I                                        7  200WWYMDT
     I                                        7  140WWYMD
     I                                       15  200WWTIM
     I                                       21  260WWDAT2
     I            DS
     I                                        1   7 W2KOKI
     I                                        1   3 W2KOTE
     I                                        4   7 W2KIBN
      *****************************************************
      * MAIN ROUTINE                                      *
      *****************************************************
     C                     EXSR #INIT
      *
     C                     READ AK#WP041                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB410
     C                     READ AK#WP041                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *--------------------------------------------------*
      * ALDRS1                                           *
      *--------------------------------------------------*
     C           #SB410    BEGSR
      *
     C                     Z-ADD0         @@TIME
      * LT
     C                     CALL 'INVRS3'
     C                     PARM           W1BMON
     C                     PARM           W1KOTE
     C                     PARM           W1KIBN
     C                     PARM           @DAY    20
     C                     PARM           @JJ     20
     C                     PARM           @MN     20
     C                     PARM           @SHTG   2
      *
     C           W1UNS     SUB  W1QTY     W@SHTQ  90
     C           W@SHTQ    IFNE 0
     C           @@TIME    IFEQ 0
     C                     Z-ADDW@TIME    @@TIME
     C                     END
     C                     EXSR #TIME
     C                     ELSE
     C                     Z-ADD0         @@TIME
     C                     END
      *
     C                     EXSR #SB500
      *
     C                     ENDSR
      *--------------------------------------------------*
      * WP02                                             *
      *--------------------------------------------------*
     C           #SB500    BEGSR
      *
     C                     CLEARAK#WP051
     C                     MOVELW1LOC     W2LOC
     C                     Z-ADDW1QTY     W2QTY
     C                     Z-ADDW1PRE     W2PRE
     C                     Z-ADDW1MINO    W2MINO
     C                     MOVELW1SHN1    W2SHN1
     C                     MOVELW1SHN2    W2SHN2
     C                     MOVELW1SHN3    W2SHN3
     C                     Z-ADDW1SSYS    W2SSYS
     C                     Z-ADDW1UNS     W2UNS
     C                     Z-ADDW1BARL    W2BARL
     C                     MOVELW1BMON    W2BMON
     C                     MOVELW1KOTE    W2KOTE
     C                     MOVELW1KIBN    W2KIBN
     C                     Z-ADDW1SDAT    W2SDAT
     C                     Z-ADDW1STIM    W2STIM
     C                     MOVELW1MEK1    W2MEK1
     C                     MOVELW1MEK2    W2MEK2
     C                     MOVELW1MEK3    W2MEK3
     C                     MOVELW1JNAM    W2JNAM
     C                     MOVELW1SRTN    W2SRTN
     C                     MOVELW1SRT#    W2SRT#
      *
JW1  C           W1DYMD    IFEQ 0
 |   C                     Z-ADD@@DYMD    W2DYMD
 |   C                     Z-ADD@@THMS    W2THMS
 |   C                     ELSE
 |   C                     Z-ADDW1DYMD    W2DYMD
 |   C                     Z-ADDW1THMS    W2THMS
JW1  C                     ENDIF
      *
     C                     Z-ADDW1IDAT    W2IDAT
     C                     Z-ADDW1IBIN    W2IBIN
     C                     MOVELW1IORD    W2IORD
      * ADJUST MACHINE NAME
     C                     SELEC
     C           W2KIBN    WHEQ '1   '
     C                     MOVEL'#01 '    W2KIBN
     C           W2KIBN    WHEQ '2   '
     C                     MOVEL'#02 '    W2KIBN
     C           W2KIBN    WHEQ '3   '
     C                     MOVEL'#03 '    W2KIBN
     C           W2KIBN    WHEQ '4   '
     C                     MOVEL'#04 '    W2KIBN
     C           W2KIBN    WHEQ '5   '
     C                     MOVEL'#05 '    W2KIBN
     C           W2KIBN    WHEQ '6   '
     C                     MOVEL'#06 '    W2KIBN
     C           W2KIBN    WHEQ '7   '
     C                     MOVEL'#07 '    W2KIBN
     C           W2KIBN    WHEQ '8   '
     C                     MOVEL'#08 '    W2KIBN
     C           W2KIBN    WHEQ '9   '
     C                     MOVEL'#09'     W2KIBN
     C                     ENDSL
      *
     C                     MOVELW2KOKI    W2KEY
     C                     MOVEL'SRT'     W2KEY
      *
     C                     WRITEAK#WP051
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #INIT     BEGSR
      *
     C                     TIME           W@TIME
      *
     C                     Z-ADDW@DYMD    A@IDAT  80
     C                     Z-ADDW@THMS    A@ITIM  60
     C                     MOVE 'F'       A@PF    1
     C                     Z-ADD60        A@PA    50
     C                     Z-ADD0         A@ODAT  80
     C                     Z-ADD0         A@OTIM  60
      *
     C                     CALL 'DATR49'
     C                     PARM           A@IDAT  80
     C                     PARM           A@ITIM  60
     C                     PARM           A@PF    1
     C                     PARM           A@PA    50
     C                     PARM           A@ODAT  80
     C                     PARM           A@OTIM  60
      *
     C                     Z-ADDA@ODAT    W@DYMD
     C                     Z-ADDA@OTIM    W@THMS
     C                     Z-ADD0         W@TM
     C                     Z-ADD0         W@TS
      *
     C                     ENDSR
      *-----------------------------------------------------
     C           #TIME     BEGSR
      *
     C                     MOVE *BLANK    KEY
     C                     MOVELW1KOTE    KEY     4
     C           W1BMON    IFEQ '0111'
     C           W1KOTE    ANDEQ'BZ '
     C                     MOVELW1KIBN    KIBN    1
     C                     MOVE KIBN      KEY
     C                     END
      *
     C                     Z-ADD1         @Z      20
     C           KEY       LOKUPTB1,@Z                   88
     C           *IN88     IFEQ '1'
     C                     Z-ADDTB2,@Z    TB2,@Z
     C                     END
      *
     C                     Z-ADD0         WWDAT1
     C                     Z-ADD@@DYMD    WWYMD
     C                     Z-ADD@@THMS    WWTIM
     C                     Z-ADD0         WWDAT2
      *
     C                     MOVE WWDATE    PIDATE 260
     C                     MOVE 'D'       PF      1
     C                     Z-ADD@DAY      PA      50
     C                     Z-ADD0         PODATE 260
     C                     CALL 'YX003G'
     C                     PARM           PIDATE 260
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           PODATE 260
      *
     C                     MOVE PODATE    PIDATE
     C                     MOVE 'J'       PF      1
     C                     Z-ADD@JJ       PA      50
     C                     Z-ADD0         PODATE 260
     C                     CALL 'YX003G'
     C                     PARM           PIDATE 260
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           PODATE 260
      *
     C                     MOVE PODATE    PIDATE
     C                     MOVE 'F'       PF      1
     C                     Z-ADD@MN       PA      50
     C                     Z-ADD0         PODATE 260
     C                     CALL 'YX003G'
     C                     PARM           PIDATE 260
     C                     PARM           PF      1
     C                     PARM           PA      50
     C                     PARM           PODATE 260
      *
     C                     MOVE PODATE    WWDATE
     C                     Z-ADDWWYMD     @@DYMD
     C                     Z-ADDWWTIM     @@THMS
      *
     C                     ENDSR
      *
** TB1/TB2
BM  04
HD  03
RL  03
OQ  05
LAN 02
AOQ 02
LOQ 06
BZ A08
BZ B08
BZ C03
BZ D06
DS  04
DSM 04
SB  01
KRO 01
JC  01
