     H            Y.
     F*** AKAR03 ********************************************
     F* ... USER PRODUCT DEMAND FORECAST NUMBER INQUIRY ... *
     F*  PROGRAM ID.    :  AKAR03.      <RPG>               *
     F*  CREATE DATE.   :  APR.09,'91.                      *
     F*  AUTHOR.        :  KOHHY.                           *
     F*                 :  MSK.KUNIEDA                      *
     F*                 :  K.YASUDA                         *
     F*------------------------------------------
JW1  F*  JW       2023.05.10 MINOR CHANGE
     F******************************************** AKAR03 ***
     FAKAPW03 CF  E                    WORKSTN
     F                                        RRN   KSFILE DSP2R
     FABBPL02 IF  E           K        DISK
     FGADPL30 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     E*                   MSG     1   2 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1  17 UHIN
     I                                        1   5 UHIN1
     I                                        6   6 UHINA
     I                                        7  11 UHIN2
     I                                       12  12 UHINB
     I                                       13  17 UHIN3
JW1  I            DS
 .   I                                        1  140SDATE
 .   I                                        1   60NOW
JW1  I                                        7  140TODAY
     I            DS
     I                                        1   80UYMD
     I                                        1   60UYM
     I                                        5   60UMM
JW1  I                                        7   80UDD
     I            DS
     I                                        1   60@@HIZ
     I                                        1   40@YY
     I                                        5   60@MM
     I            DS
     I                                        1  16 @TNKU
     I                                        1   40@TOKU
     I                                        5   5 @TH1
     I                                        6   90@NONY
     I                                       10  10 @TH2
     I                                       11  11 @KOJO
     I                                       12  12 @TH3
     I                                       13  16 @NUKE
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIZ    6
     C                     MOVELPHIZ      UHIZ    60
     C*
     C           KEYA      KLIST
     C                     KFLD           @YY
     C                     KFLD           @MM
     C*
     C**                   Z-ADD*DATE     UYMD
JW1  C                     TIME           SDATE
 .   C                     Z-ADDTODAY     UYMD
     C                     Z-ADDUMM       WHZ1
JW1   * ADJ DAY OF 20
 .   C           UDD       IFGE 20
 .   C                     ADD  1         WHZ1
 .   C           WHZ1      IFEQ 13
 .   C                     Z-ADD1         WHZ1
 .   C                     ENDIF
JW1  C                     ENDIF
      *
     C           WHZ1      IFEQ 12
     C                     Z-ADD01        WHZ2
     C                     ELSE
     C           WHZ1      ADD  1         WHZ2
     C                     ENDIF
      *
     C           WHZ2      IFEQ 12
     C                     Z-ADD01        WHZ3
     C                     ELSE
     C           WHZ2      ADD  1         WHZ3
     C                     ENDIF
      *
     C           WHZ3      IFEQ 12
     C                     Z-ADD01        WHZ4
     C                     ELSE
     C           WHZ3      ADD  1         WHZ4
     C                     END
     C*
     C           KEY1      KLIST
     C                     KFLD           HIN1
     C                     KFLD           HIN2
     C                     KFLD           HIN3
      * MSK.KUNIEDA 98.06.03
      *-------------------*
      *   KEY LIST        *
      *-------------------*
     C           KEYB31    KLIST
     C                     KFLD           #KTOKU  40
     C                     KFLD           #KNONY  40
     C                     KFLD           #KNKOJ  1
     C                     KFLD           #KNUKE  4
      *
     C                     Z-ADD*DATE     HYMD8   80
     C*
     C           STP0      TAG
     C                     MOVE *BLANK    HIN1
     C                     MOVE *BLANK    HIN2
     C                     MOVE *BLANK    HIN3
     C******************************************************
     C*  DISPLAY 1ST SCREEN
     C******************************************************
     C           STP1      TAG
     C                     Z-ADD0         RRN     30
     C                     EXFMTAKAPW031
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C*
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
     C* F1: EXIT
     C           *INKA     IFEQ '1'
JW1  C           *INKC     OREQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
     C*
     C******************************************************
     C*  <fﾞx] 1 ﾉ kｩｮh>                                   *
     C******************************************************
     C           HIN1      IFEQ *BLANK
     C           HIN2      ANDEQ*BLANK
     C           HIN3      ANDEQ*BLANK
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C*                    MOVELMSG,1     ERR
     C                     GOTO STP1
     C                     END
     C*
     C           @LOOP     TAG
     C                     Z-ADD0         CNTR    50
     C                     EXSR #SET
     C*
     C*          ERR       IFNE *BLANK
     C*                    MOVEA'1'       *IN,99
     C*                    GOTO STP1
     C*                    END
     C*
     C           RRN       IFEQ 0
     C                     GOTO STP1
     C                     END
     C*
     C                     Z-ADD1         RCDNBR
     C*
     C******************************************************
     C*  EXFMT  (fﾞx] 2)                                   *
     C******************************************************
     C           STP2      TAG
     C****                 MOVEA'0'       *IN,81
     C                     MOVEA'1'       *IN,91
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,91
     C                     EXFMTDSP2X
     C*
     C                     MOVEA'0'       *IN,14
     C                     MOVEA'0'       *IN,99
     C*                    MOVE *BLANK    ERR
     C* F1: EXIT
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
     C* F2: BACK
     C           *INKB     IFEQ '1'
JW1  C           *INKC     OREQ '1'
     C           *INKL     OREQ '1'
     C**                   GOTO STP0
JW1  C                     GOTO STP1
     C                     END
     C*  ﾜｰﾓ aｮﾎﾟ
     C           *IN,81    IFEQ '1'
     C                     Z-ADD0         CNTR
     C                     EXSR ROLLUP
     C                     Z-ADDRRN       RCDNBR
     C*
     C           *IN,14    IFEQ '1'
     C                     MOVEA'1'       *IN,99
     C                     END
     C                     GOTO STP2
     C                     END
     C                     Z-ADDRRN       WKRRN   30
     C*
     C           ##NO      IFNE 0
     C                     DO   *HIVAL    RRN
     C           ##NO      CHAINDSP2R                12
     C           *IN,12    IFEQ '0'
     C                     Z-ADD@@N01     #N01
     C                     Z-ADD@@N02     #N02
     C                     Z-ADD@@N03     #N03
     C                     Z-ADD@@N04     #N04
     C                     Z-ADD@@N05     #N05
     C                     Z-ADD@@N06     #N06
     C                     Z-ADD@@N07     #N07
     C                     Z-ADD@@N08     #N08
     C                     Z-ADD@@N09     #N09
     C                     Z-ADD@@N10     #N10
     C                     Z-ADD@@N11     #N11
     C                     Z-ADD@@N12     #N12
     C                     Z-ADD@@N13     #N13
     C                     Z-ADD@@N14     #N14
     C                     Z-ADD@@N15     #N15
     C                     Z-ADD@@N16     #N16
     C                     Z-ADD@@N17     #N17
     C                     Z-ADD@@N18     #N18
     C                     Z-ADD@@N19     #N19
     C                     Z-ADD@@N20     #N20
     C                     Z-ADD@@N21     #N21
     C                     Z-ADD@@N22     #N22
     C                     Z-ADD@@N23     #N23
     C                     Z-ADD@@N24     #N24
     C                     Z-ADD@@N25     #N25
     C                     Z-ADD@@N26     #N26
     C                     Z-ADD@@N27     #N27
     C                     Z-ADD@@N28     #N28
     C                     Z-ADD@@N29     #N29
     C                     Z-ADD@@N30     #N30
     C                     Z-ADD@@N31     #N31
     C* YAMAGAMI    ﾃﾃf[
     C                     SETOF                     414243
     C                     SETOF                     444546
     C                     SETOF                     474849
     C                     SETOF                     505152
     C                     SETOF                     535455
     C                     SETOF                     565758
     C                     SETOF                     596061
     C                     SETOF                     626364
     C                     SETOF                     656667
     C                     SETOF                     686970
     C                     SETOF                     71
     C                     Z-ADD0         X       20
     C           KEYA      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     ADD  1         X
     C                     SETOF                     22
     C           KEYA      READEAGDPL121                 22
     C   22                GOTO @@@END
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C           40        ADD  X         Z       20
     C                     MOVE '1'       *IN,Z
     C                     END
     C           @@@END    TAG
     C  N22                END
     C           WHZ1      COMP @MM                      75
     C           WHZ2      COMP @MM                      76
     C           WHZ3      COMP @MM                      77
     C           WHZ4      COMP @MM                      78
     C* YAMAGAMI    ﾃﾃumﾞ
     C                     EXSR #SET2
     C                     Z-ADD0         ##NO
      * FQA 標識再セット
     C           @@IN10    IFEQ '1'
     C                     MOVEA'1'       *IN,10
     C                     END
      *
     C                     UPDATDSP2R
     C                     SETOF                     10
     C                     END
     C  N12                END
     C                     END
     C*
      *
     C                     Z-ADDWKRRN     RRN
      *
     C                     GOTO STP2
     C******************************************************
     C           #SET      BEGSR                           *
     C******************************************************
     C                     MOVEA'1'       *IN,92
     C                     WRITEDSP2C
     C                     MOVEA'0'       *IN,92
     C*
     C                     Z-ADD0         @@N01
     C                     Z-ADD0         @@N02
     C                     Z-ADD0         @@N03
     C                     Z-ADD0         @@N04
     C                     Z-ADD0         @@N05
     C                     Z-ADD0         @@N06
     C                     Z-ADD0         @@N07
     C                     Z-ADD0         @@N08
     C                     Z-ADD0         @@N09
     C                     Z-ADD0         @@N10
     C                     Z-ADD0         @@N11
     C                     Z-ADD0         @@N12
     C                     Z-ADD0         @@N13
     C                     Z-ADD0         @@N14
     C                     Z-ADD0         @@N15
     C                     Z-ADD0         @@N16
     C                     Z-ADD0         @@N17
     C                     Z-ADD0         @@N18
     C                     Z-ADD0         @@N19
     C                     Z-ADD0         @@N20
     C                     Z-ADD0         @@N21
     C                     Z-ADD0         @@N22
     C                     Z-ADD0         @@N23
     C                     Z-ADD0         @@N24
     C                     Z-ADD0         @@N25
     C                     Z-ADD0         @@N26
     C                     Z-ADD0         @@N27
     C                     Z-ADD0         @@N28
     C                     Z-ADD0         @@N29
     C                     Z-ADD0         @@N30
     C                     Z-ADD0         @@N31
     C*
     C           KEY1      SETLLABBPL021
     C                     Z-ADD0         @TOKU
     C                     Z-ADD0         @NONY
     C                     MOVE *BLANK    @KOJO
     C                     MOVE *BLANK    @NUKE
     C                     MOVE *BLANK    @UHIN
     C                     Z-ADD0         @MM1
     C                     Z-ADD0         @MM2
     C                     Z-ADD0         @MM3
     C                     Z-ADD0         @MM4
     C                     DO   *HIVAL
     C           KEY1      READEABBPL021                 40
     C   40                GOTO @@@
     C*
     C           *IN,40    IFEQ '0'
     C                     MOVE '-'       @TH1
     C                     MOVE '-'       @TH2
     C                     MOVE '-'       @TH3
     C                     Z-ADDQ5TOKU    @TOKU
     C                     Z-ADDQ5NONY    @NONY
     C                     MOVELQ5GKOJ    @KOJO
     C                     MOVELQ5GUKE    @NUKE
     C                     MOVE *BLANK    UHIN
     C                     MOVELQ5MHN1    UHIN1
     C                     MOVELQ5MHN2    UHIN2
     C                     MOVELQ5MHN3    UHIN3
     C           UHIN2     IFNE *BLANK
     C                     MOVEL'-'       UHINA
     C                     END
     C*
     C           UHIN3     IFNE *BLANK
     C                     MOVEL'-'       UHINB
     C                     END
     C*
     C                     MOVELUHIN      @UHIN
     C*
     C           UHIZ      IFLE UYM
     C                     Z-ADDQ5NNNM    @MM1
     C                     Z-ADDQ51NNM    @MM2
     C                     Z-ADDQ52NNM    @MM3
     C                     Z-ADD0         @MM4
     C                     ELSE
     C                     Z-ADDQ5N1NM    @MM1
     C                     Z-ADDQ5NNNM    @MM2
     C                     Z-ADDQ51NNM    @MM3
     C                     Z-ADDQ52NNM    @MM4
     C                     END
     C*
     C           @MM1      IFEQ 0
     C           @MM2      ANDEQ0
     C           @MM3      ANDEQ0
     C           @MM4      ANDEQ0
     C                     GOTO @END
     C                     END
     C*
     C                     Z-ADDQ5NN01    @@N01
     C                     Z-ADDQ5NN02    @@N02
     C                     Z-ADDQ5NN03    @@N03
     C                     Z-ADDQ5NN04    @@N04
     C                     Z-ADDQ5NN05    @@N05
     C                     Z-ADDQ5NN06    @@N06
     C                     Z-ADDQ5NN07    @@N07
     C                     Z-ADDQ5NN08    @@N08
     C                     Z-ADDQ5NN09    @@N09
     C                     Z-ADDQ5NN10    @@N10
     C                     Z-ADDQ5NN11    @@N11
     C                     Z-ADDQ5NN12    @@N12
     C                     Z-ADDQ5NN13    @@N13
     C                     Z-ADDQ5NN14    @@N14
     C                     Z-ADDQ5NN15    @@N15
     C                     Z-ADDQ5NN16    @@N16
     C                     Z-ADDQ5NN17    @@N17
     C                     Z-ADDQ5NN18    @@N18
     C                     Z-ADDQ5NN19    @@N19
     C                     Z-ADDQ5NN20    @@N20
     C                     Z-ADDQ5NN21    @@N21
     C                     Z-ADDQ5NN22    @@N22
     C                     Z-ADDQ5NN23    @@N23
     C                     Z-ADDQ5NN24    @@N24
     C                     Z-ADDQ5NN25    @@N25
     C                     Z-ADDQ5NN26    @@N26
     C                     Z-ADDQ5NN27    @@N27
     C                     Z-ADDQ5NN28    @@N28
     C                     Z-ADDQ5NN29    @@N29
     C                     Z-ADDQ5NN30    @@N30
     C                     Z-ADDQ5NN31    @@N31
     C                     Z-ADDQ5NTYM    @@HIZ
     C*
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
      *--------------------------------------------------*
      *  MSK.KUNIEDA    98.06.03                         *
      *  ＦＱＡ対象区分チェック                        *
      *--------------------------------------------------*
     C                     SETOF                     10
     C                     MOVE *BLANK    @@IN10
     C                     MOVE @TOKU     #KTOKU
     C                     MOVE @NONY     #KNONY
     C                     MOVE @KOJO     #KNKOJ
     C                     MOVE @NUKE     #KNUKE
      *
     C                     SETOF                     2110
     C           KEYB31    CHAINGADPL301             21
     C           *IN21     IFEQ '0'
     C           B3SKJY    IFEQ 'D'
     C           B3SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C                     END
      *
     C           *IN21     IFEQ '0'
     C           B3FQAK    ANDEQ'1'
     C                     SETON                       10
     C                     MOVE '1'       @@IN10
     C                     END
      *
     C                     WRITEDSP2R
     C                     SETOF                       10
     C                     MOVE *BLANK    @@IN10
      *
     C*  fﾞx] MAX <16i]>
     C           CNTR      CABEQ16        @@@
     C                     END
     C           @END      TAG
     C  N40                END
     C*
     C           @@@       TAG
     C*  fﾞbnc mﾞｰj oﾆ
     C           RRN       IFEQ 0
     C                     MOVEA'1'       *IN,01
     C                     MOVEA'1'       *IN,99
     C*                    MOVELMSG,2     ERR
     C                     END
     C*
     C                     ENDSR
     C*
     C******************************************************
     C           ROLLUP    BEGSR
     C******************************************************
     C                     MOVE *BLANK    SW      1
     C                     DO   *HIVAL
     C           KEY1      READEABBPL021                 40
     C   40                GOTO @ROLE
     C           *IN,40    IFEQ '0'
     C                     MOVEL'*'       SW
     C                     MOVE '-'       @TH1
     C                     MOVE '-'       @TH2
     C                     MOVE '-'       @TH3
     C                     Z-ADDQ5TOKU    @TOKU
     C                     Z-ADDQ5NONY    @NONY
     C                     MOVELQ5GKOJ    @KOJO
     C                     MOVELQ5GUKE    @NUKE
     C                     MOVE *BLANK    UHIN
     C                     MOVELQ5MHN1    UHIN1
     C                     MOVELQ5MHN2    UHIN2
     C                     MOVELQ5MHN3    UHIN3
     C           UHIN2     IFNE *BLANK
     C                     MOVEL'-'       UHINA
     C                     END
     C*
     C           UHIN3     IFNE *BLANK
     C                     MOVEL'-'       UHINB
     C                     END
     C*
     C                     MOVELUHIN      @UHIN
     C           UHIZ      IFLE UYM
     C                     Z-ADDQ5NNNM    @MM1
     C                     Z-ADDQ51NNM    @MM2
     C                     Z-ADDQ52NNM    @MM3
     C                     Z-ADD0         @MM4
     C                     ELSE
     C                     Z-ADDQ5N1NM    @MM1
     C                     Z-ADDQ5NNNM    @MM2
     C                     Z-ADDQ51NNM    @MM3
     C                     Z-ADDQ52NNM    @MM4
     C                     END
     C*
     C           @MM1      IFEQ 0
     C           @MM2      ANDEQ0
     C           @MM3      ANDEQ0
     C           @MM4      ANDEQ0
     C                     GOTO @END1
     C                     END
     C*
     C                     Z-ADDQ5NN01    @@N01
     C                     Z-ADDQ5NN02    @@N02
     C                     Z-ADDQ5NN03    @@N03
     C                     Z-ADDQ5NN04    @@N04
     C                     Z-ADDQ5NN05    @@N05
     C                     Z-ADDQ5NN06    @@N06
     C                     Z-ADDQ5NN07    @@N07
     C                     Z-ADDQ5NN08    @@N08
     C                     Z-ADDQ5NN09    @@N09
     C                     Z-ADDQ5NN10    @@N10
     C                     Z-ADDQ5NN11    @@N11
     C                     Z-ADDQ5NN12    @@N12
     C                     Z-ADDQ5NN13    @@N13
     C                     Z-ADDQ5NN14    @@N14
     C                     Z-ADDQ5NN15    @@N15
     C                     Z-ADDQ5NN16    @@N16
     C                     Z-ADDQ5NN17    @@N17
     C                     Z-ADDQ5NN18    @@N18
     C                     Z-ADDQ5NN19    @@N19
     C                     Z-ADDQ5NN20    @@N20
     C                     Z-ADDQ5NN21    @@N21
     C                     Z-ADDQ5NN22    @@N22
     C                     Z-ADDQ5NN23    @@N23
     C                     Z-ADDQ5NN24    @@N24
     C                     Z-ADDQ5NN25    @@N25
     C                     Z-ADDQ5NN26    @@N26
     C                     Z-ADDQ5NN27    @@N27
     C                     Z-ADDQ5NN28    @@N28
     C                     Z-ADDQ5NN29    @@N29
     C                     Z-ADDQ5NN30    @@N30
     C                     Z-ADDQ5NN31    @@N31
     C*
     C                     ADD  1         RRN
     C                     ADD  1         CNTR
      *--------------------------------------------------*
      *  MSK.KUNIEDA    98.06.03                         *
      *  ＦＱＡ対象区分チェック                        *
      *--------------------------------------------------*
     C                     MOVE *BLANK    @@IN10
     C                     SETOF                     10
     C                     MOVE @TOKU     #KTOKU
     C                     MOVE @NONY     #KNONY
     C                     MOVE @KOJO     #KNKOJ
     C                     MOVE @NUKE     #KNUKE
      *
     C                     SETOF                     2110
     C           KEYB31    CHAINGADPL301             21
     C           *IN21     IFEQ '0'
     C           B3SKJY    IFEQ 'D'
     C           B3SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C                     END
      *
     C           *IN21     IFEQ '0'
     C           B3FQAK    ANDEQ'1'
     C                     SETON                       10
     C                     MOVE '1'       @@IN10
     C                     END
      *
     C                     WRITEDSP2R
     C                     SETOF                       10
     C                     MOVE *BLANK    @@IN10
      *
     C*
     C*  fﾞx] MAX <16i]>
     C           CNTR      CABEQ16        @ROLE
     C                     END
     C           @END1     TAG
     C  N40                END
     C*
     C           @ROLE     TAG
     C*  ﾃﾛbﾆﾞｭc mﾞｰj oﾆ
     C           SW        IFEQ *BLANK
     C                     MOVEA'1'       *IN,14
     C                     END
     C*
     C                     ENDSR
     C******************************************************
     C           #SET2     BEGSR                           *
     C******************************************************
     C           STP3      TAG
     C                     EXFMTAKAPW032
     C*
     C                     MOVEA'0'       *IN,01
     C                     MOVEA'0'       *IN,99
     C*                    MOVE *BLANK    ERR
     C* F1: EXIT
     C           *INKA     IFEQ '1'
     C                     MOVEL'1'       *INLR
     C                     RETRN
     C                     END
     C* F1: BACK
     C           *INKB     IFEQ '1'
 JW1 C           *INKC     OREQ '1'
     C           *INKL     OREQ '1'
     C                     MOVEA'1'       *IN,42
     C                     GOTO #SET2E
     C                     END
     C*
     C                     GOTO STP3
     C*
     C           #SET2E    ENDSR
