     H            Y.
     F** AKAR2A ********************************
     F* ... INQUIRY OF MANUFACTURING PROCESS INFORMATION ... *.
     F* I-HASADA                  87.01.16     *
     F* UPDATE:K.OKACHI    2002.05.23    %0001 *
     F*
     F* TCHK1 08/11/11 ADD AFTER AKAR28 LOOP AKAR27 NOT F3
     F******************************** AKAR2A **
     FAKAPW2A CF  E                    WORKSTN
     E                    ER      1   4 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1  12 CKHIN
     I                                        1   5 CKHIN1
     I                                        6  10 CKHIN2
     I                                       11  12 CKHIN3
     C           ACALL1    PLIST
     C                     PARM           PCMD3   1
     C                     PARM           PER     1
     C                     PARM           CKHIN
      *
     C           ACALL2    PLIST
     C                     PARM           PCMD3
     C                     PARM           SNNO
     C                     PARM           PER
     C                     PARM           CKHIN1
     C                     PARM           CKHIN2
     C                     PARM           CKHIN3
      *
     C           ACALL3    PLIST
     C                     PARM           @CMD3   1
      *
     C           ACALL4    PLIST
     C                     PARM           PCMD3   1
     C                     PARM           PER     1
     C                     PARM           CKHIN
     C                     PARM           PSNO    1
      *
     C           STP1      TAG
     C                     EXFMTAKAPW2A1
     C                     SETOF                     0199
     C                     MOVE *BLANK    CKHIN
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           SNNO      IFNE 'X'
     C           SNNO      ANDNE'Y'
     C           SNNO      ANDNE'0'
     C           SNNO      ANDNE'1'
     C           SNNO      ANDNE'2'
     C           SNNO      ANDNE'3'
     C           SNNO      ANDNE'4'
     C           SNNO      ANDNE'6'
     C           SNNO      ANDNE'7'
     C           SNNO      ANDNE'A'
     C           SNNO      ANDNE'B'
     C           SNNO      ANDNE'C'
     C           SNNO      ANDNE'D'
     C           SNNO      ANDNE'E'
     C           SNNO      ANDNE'F'
     C           SNNO      OREQ ' '
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           SNNO      IFEQ '3'
     C                     MOVE *BLANK    @CMD3
     C                     CALL 'AKHCA1'  ACALL3
     C           @CMD3     IFEQ '1'
     C                     MOVE *BLANK    SNNO
     C                     GOTO STP1
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           STP2      TAG
     C                     EXFMTAKAPW2A2
     C                     SETOF                     0199
     C                     MOVE *BLANK    PER
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    SNNO
     C                     GOTO STP1
     C                     END
      *
     C           CKHIN     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     MOVE *BLANK    PCMD3
     C           SNNO      IFEQ 'Y'
      *
%0001C                     MOVE SNNO      PSNO
%0001C                     CALL 'AKAR27'  ACALL4
     C           PCMD3     IFEQ '1'
     C                     GOTO XTP1
     C                     END
     C                     ELSE
      *
     C           SNNO      IFEQ 'X'
      *
TCHK1C           STP3      TAG
%0001C                     MOVE SNNO      PSNO
%0001C                     CALL 'AKAR27'  ACALL4
     C           PCMD3     IFEQ '1'
     C                     GOTO XTP1
     C                     END
      *
     C           PER       IFNE *BLANK
     C                     GOTO STPER
     C                     END
     C                     END
      *
     C                     CALL 'AKAR28'  ACALL2
     C           PCMD3     IFEQ '1'
     C                     GOTO XTP1
TCHK1C                     ELSE
TCHK1C                     GOTO STP3
     C                     END
     C                     END
     C           STPER     TAG
      *
     C           PER       IFEQ 'E'
     C                     SETON                     0199
     C                     MOVE ER,3      MSG
     C                     GOTO STP2
     C                     END
      *
     C           PER       IFEQ '9'
     C                     SETON                     0199
     C                     MOVE ER,4      MSG
     C                     GOTO STP2
     C                     END
      *
     C           XTP1      TAG
     C                     MOVE *BLANK    CKHIN
     C                     GOTO STP2
**  ER (ERROR-MESSAGE)
E-01 SELECT OPTION: A,B,C,D,E,F,X,Y,0,1,2,3,4,6 OR 7.
E-02 ENTER IAF PART NO.
E-03 IAF PART# NOT FOUND IN COMPONENT KANBAN MASTER
E-04 NO DATA FOR IAF PART NO.
