     H            Y/
     F*** AKAR55 *********************
     F* PART INFORMATION LIST
     F*
     F*                                           *
     F******************** AKAR27 ***
     FAKAPW55 CF  E                    WORKSTN
     FAAMPL11 IF  E           K        DISK
     FGHCPL21 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FAAHPL03 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAAFPL03 IF  E           K        DISK
     FAAPPL03 IF  E           K        DISK
     FAAXPL03 IF  E           K        DISK
     FAAGPL03 IF  E           K        DISK
     FABHPL03 IF  E           K        DISK
     FCADPL03 IF  E           K        DISK
     FAAOPL03 IF  E           K        DISK
     FAAYPL03 IF  E           K        DISK
     FAEAPL03 IF  E           K        DISK
     FAANPL03 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
      *
     FQPRINT  O   F     132     OF     PRINTER
      *-----------------------------------------------------------
     E                    SKO        15  3               PROCESS
     E                    SBM        15  4 0             DEPARTMENT
     E                    SBN        15  6               LOCATION
     E                    SKI        15  3               MACHINE
     E                    SDH        15 12               PARENT
     E                    SSU        15  9 0             # OF PROCESS
     E                    SKB        15  1               KANBAN ID
     E                    QKO        15  3               OLD PROCESS
     E                    QBM        15  4 0             OLD DEPARTMENT
     E                    QBN        15  6               OLD PROCESS
     E                    QKI        15  3               OLD MACHINE
     E                    QDH        15 12               OLD PARENT
     E                    QKB        15  1               OLD KANBAN ID
     E                    WME        15 11               DEPT NAME
     E                    WCH        15  8 0             DEPT NAME
     E                    WQN        15 12               QUENCHING
     E                    WWH        15 12               WITHDRWAL
     E                    WMQ        15  9 0
     E                    WCT        15  5 0
     E                    WDQ        15  7 0
     E                    WMC        15  9 2
     E                    WDC        15  7 2
     E                    CHG        15 10 0
     E                    ITM        50 12
     E                    WIT         4 14
     E                    CMD     1   1 78
     E                    ERR     1   1 78
      *-----------------------------------------------------------
     I            DS
     I                                        1  12 @@JHIN
     I                                        1   5 @@JHN1
     I                                        6  10 @@JHN2
     I                                       11  12 @@JHN3
     I            DS
     I                                        1  14 WWJHIN
     I                                        1   5 WWJHN1
     I I            '-'                       6   6 WW1
     I                                        7  11 WWJHN2
     I I            '-'                      12  12 WW2
     I                                       13  14 WWJHN3
     I            DS
     I                                        1  45 SKO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  600SBM
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 CKHB01
     I                                       13  24 CKHB02
     I                                       25  36 CKHB03
     I                                       37  48 CKHB04
     I                                       49  60 CKHB05
     I                                       61  72 CKHB06
     I                                       73  84 CKHB07
     I                                       85  96 CKHB08
     I                                       97 108 CKHB09
     I                                      109 120 CKHB10
     I                                      121 132 CKHB11
     I                                      133 144 CKHB12
     I                                      145 156 CKHB13
     I                                      157 168 CKHB14
     I                                      169 180 CKHB15
     I            DS
     I                                        1  45 SKI
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  90 SBN
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1 1350SSU
     I                                        1   90CKSU01
     I                                       10  180CKSU02
     I                                       19  270CKSU03
     I                                       28  360CKSU04
     I                                       37  450CKSU05
     I                                       46  540CKSU06
     I                                       55  630CKSU07
     I                                       64  720CKSU08
     I                                       73  810CKSU09
     I                                       82  900CKSU10
     I                                       91  990CKSU11
     I                                      100 1080CKSU12
     I                                      109 1170CKSU13
     I                                      118 1260CKSU14
     I                                      127 1350CKSU15
     I            DS
     I                                        1  15 SKB
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  45 QKO
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
     I            DS
     I                                        1  600QBM
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
     I            DS
     I                                        1 180 QDH
     I                                        1  12 CKQH01
     I                                       13  24 CKQH02
     I                                       25  36 CKQH03
     I                                       37  48 CKQH04
     I                                       49  60 CKQH05
     I                                       61  72 CKQH06
     I                                       73  84 CKQH07
     I                                       85  96 CKQH08
     I                                       97 108 CKQH09
     I                                      109 120 CKQH10
     I                                      121 132 CKQH11
     I                                      133 144 CKQH12
     I                                      145 156 CKQH13
     I                                      157 168 CKQH14
     I                                      169 180 CKQH15
     I            DS
     I                                        1  45 QKI
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN00
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
     I            DS
     I                                        1  90 QBN
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 QKB
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1 150 CHG
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  15 CH
     I                                        1   1 CKCG01
     I                                        2   2 CKCG02
     I                                        3   3 CKCG03
     I                                        4   4 CKCG04
     I                                        5   5 CKCG05
     I                                        6   6 CKCG06
     I                                        7   7 CKCG07
     I                                        8   8 CKCG08
     I                                        9   9 CKCG09
     I                                       10  10 CKCG10
     I                                       11  11 CKCG11
     I                                       12  12 CKCG12
     I                                       13  13 CKCG13
     I                                       14  14 CKCG14
     I                                       15  15 CKCG15
     I            DS
     I                                        1   6 K@LOC
     I                                        1   1 K@LOC1
     I                                        2   3 K@LOC2
     I                                        4   5 K@LOC3
     I                                        6   6 K@LOC4
     I            DS
     I                                        1  12 J6W
     I                                        1   3 J6RONO
     I I            '-'                       4   4 WJ1
     I                                        5   70J6ONDO
     I I            '-'                       8   8 WJ2
     I                                        9   9 WJ3
     I I            '.'                      10  10 WJ4
     I                                       11  12 WJ5
     I            DS
     I                                        1  120@TIME
     I                                        1   60@HMS
     I                                        7  120@YMD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-------------------------------------------------
      *  INITIALIZE
      *-------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVE '01'      W@ID    2
     C           K#KEY     KLIST
     C                     KFLD           D@PRT1
     C                     KFLD           D@PRT2
     C                     KFLD           D@PRT3
     C           K#ADH     KLIST
     C                     KFLD           K@LOC1
     C                     KFLD           K@LOC2
     C                     KFLD           K@LOC3
     C                     KFLD           K@LOC4
      *
     C           K#APL     KLIST
     C                     KFLD           K@JOKN  2
     C                     KFLD           K@KANB  1
      *
     C                     TIME           @TIME
     C                     MOVE *ALL'-'   @LINE  80
      *
     C                     ENDSR
      *-------------------------------------------------
      *  1ST SCREEN
      *-------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     MOVE *BLANK    D@PRT1
     C                     MOVE *BLANK    D@PRT2
     C                     MOVE *BLANK    D@PRT3
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *-------------------------------------------------
      *  CHECK 1ST SCREEN
      *-------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     6199
     C                     MOVE *BLANK    D@MSG
     C           K#KEY     CHAINAAMPL111             90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     MOVE ERR,1     D@MSG
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------
      *  OUTPUT
      *-------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     EXCPT@HED
      *
     C                     MOVE *BLANK    WME
     C                     MOVE *BLANK    WQN
     C                     Z-ADD*ZERO     WCH
     C                     Z-ADD*ZERO     WMQ
     C                     Z-ADD*ZERO     WCT
     C                     Z-ADD*ZERO     WMC
     C                     Z-ADD*ZERO     WDC
     C                     Z-ADD*ZERO     WDQ
     C           1         DO   15        I       20
     C                     Z-ADDCHG,I     WCH,I
     C                     MOVE SBN,I     K@LOC
      *
     C                     SELEC
     C           SKB,I     WHEQ 'A'
     C                     EXSR #A
      *
     C           SKB,I     WHEQ 'B'
     C                     EXSR #QUEN
      *
     C           SKB,I     WHEQ 'C'
     C                     EXSR #C
      *
     C           SKB,I     WHEQ 'E'
     C                     EXSR #WTHD
      *
     C           SKB,I     WHEQ 'F'
     C                     EXSR #F
      *
     C           SKB,I     WHEQ 'D'
     C                     EXSR #D
      *
     C           SKB,I     WHEQ '0'
     C                     EXSR #0
      *
     C           SKB,I     WHEQ '1'
     C                     EXSR #1
      *
     C           SKB,I     WHEQ '2'
     C                     EXSR #2
      *
     C           SKB,I     WHEQ '4'
     C                     EXSR #4
      *
     C           SKB,I     WHEQ '6'
     C                     EXSR #6
      *
     C           SKB,I     WHEQ '7'
     C                     EXSR #7
      *
     C                     ENDSL
      *
     C           SBM,I     IFNE 0
     C           SBM,I     CHAINFGBPL011             90
     C           *IN90     IFEQ *OFF
     C                     MOVELB2SMEI    WME,I
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           SKO,2     COMP *BLANK                   01
     C           SKO,3     COMP *BLANK                   02
     C           SKO,4     COMP *BLANK                   03
     C           SKO,5     COMP *BLANK                   04
     C                     EXCPT@AAM
     C           SKO,6     IFNE *BLANK
     C           SKO,7     COMP *BLANK                   01
     C           SKO,8     COMP *BLANK                   02
     C           SKO,9     COMP *BLANK                   03
     C           SKO,10    COMP *BLANK                   04
     C                     EXCPT@AAM2
     C                     ENDIF
     C           SKO,11    IFNE *BLANK
     C           SKO,12    COMP *BLANK                   01
     C           SKO,13    COMP *BLANK                   02
     C           SKO,14    COMP *BLANK                   03
     C           SKO,15    COMP *BLANK                   04
     C                     EXCPT@AAM3
     C                     ENDIF
      *
     C                     EXSR #CHLD
     C                     EXCPT@CHLD1
     C                     Z-ADD*ZERO     QQ
     C                     Z-ADD*ZERO     X       30
     C                     MOVE *BLANK    WIT
     C                     DO   *HIVAL
     C                     ADD  1         QQ
     C           ITM,QQ    IFEQ *BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ADD  1         X
     C                     MOVE ITM,QQ    @@JHIN
     C                     MOVE @@JHN1    WWJHN1
     C                     MOVE @@JHN2    WWJHN2
     C                     MOVE @@JHN3    WWJHN3
     C                     MOVE WWJHIN    WIT,X
     C           X         IFEQ 4
     C                     EXCPT@CHLD2
     C                     MOVE *BLANK    WIT
     C                     Z-ADD*ZERO     X
     C                     ENDIF
     C                     ENDDO
      *
     C           X         IFNE *ZERO
     C                     EXCPT@CHLD2
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #CHLD     BEGSR
      *-------------------------------------------------
     C                     MOVE *BLANK    ITM
     C                     Z-ADD*ZERO     QQ      30
     C           K#KEY     SETLLGHCPL21
     C           *IN95     DOUEQ*ON
     C           K#KEY     READEGHCPL21                  95
     C           *IN95     IFEQ *OFF
     C                     MOVE M7MHN1    @@JHN1
     C                     MOVE M7MHN2    @@JHN2
     C                     MOVE M7MHN3    @@JHN3
     C           @@JHIN    LOKUPITM                      96
     C           *IN96     IFEQ *ON
     C                     ITER
     C                     ENDIF
     C                     ADD  1         QQ
     C                     MOVE @@JHIN    ITM,QQ
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #A        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTABHPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEABHPL03                  90
     C           *IN90     IFEQ *OFF
     C           M6SKJY    ANDEQ*BLANK
     C                     Z-ADDM6SYUY    WCT,I
     C                     Z-ADDM6KTSU    WMQ,I
     C           M6KTSU    DIV  20        WDQ,I
     C           M6SYUY    IFNE 0
     C           WMQ,I     DIV  M6SYUY    WMC,I     H
     C           WDQ,I     DIV  M6SYUY    WDC,I     H
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #QUEN     BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTADHPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEADHPL03                  90
     C           *IN90     IFEQ *OFF
     C           J6SKJY    ANDEQ*BLANK
     C                     MOVELJ6CO2P    WJ3
     C                     MOVE J6CO2P    WJ5
     C                     MOVE J6W       WQN,I
     C                     Z-ADDJ6SYOS    WCT,I
     C                     Z-ADDJ6KTSU    WMQ,I
     C           J6KTSU    DIV  20        WDQ,I
     C           J6SYOS    IFNE 0
     C           WMQ,I     DIV  J6SYOS    WMC,I     H
     C           WDQ,I     DIV  J6SYOS    WDC,I     H
     C                     ENDIF
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #WTHD     BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAHPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAHPL03                  90
     C           *IN90     IFEQ *OFF
     C           L6SKJY    ANDEQ*BLANK
     C                     MOVELL6JOK1    K@JOKN
     C                     MOVE SKB,I     K@KANB
     C           K#APL     CHAINAAAPL01              26
     C  N26                MOVELA5JOKM    WQN,I
      *
     C                     Z-ADDL6SYOS    WCT,I
     C                     Z-ADDL6KTSU    WDQ,I
     C           L6KTSU    MULT 20        WMQ,I
     C           L6SYOS    IFNE 0
     C           WMQ,I     DIV  L6SYOS    WMC,I     H
     C           WDQ,I     DIV  L6SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #C        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAFPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAFPL03                  90
     C           *IN90     IFEQ *OFF
     C           A3SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDA3SSYS    WCT,I
     C                     Z-ADDA3KTSU    WDQ,I
     C           A3KTSU    MULT 20        WMQ,I
     C           A3SSYS    IFNE 0
     C           WMQ,I     DIV  A3SSYS    WMC,I     H
     C           WDQ,I     DIV  A3SSYS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #D        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAGPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAGPL03                  90
     C           *IN90     IFEQ *OFF
     C           O4SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDO4SYOS    WCT,I
     C                     Z-ADDO4KTSU    WDQ,I
     C           O4KTSU    MULT 20        WMQ,I
     C           O4SYOS    IFNE 0
     C           WMQ,I     DIV  O4SYOS    WMC,I     H
     C           WDQ,I     DIV  O4SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #F        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTCADPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPECADPL03                  90
     C           *IN90     IFEQ *OFF
     C           C2SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDC2SYOS    WCT,I
     C                     Z-ADDC2KTSU    WDQ,I
     C           C2KTSU    MULT 20        WMQ,I
     C           C2SYOS    IFNE 0
     C           WMQ,I     DIV  C2SYOS    WMC,I     H
     C           WDQ,I     DIV  C2SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #0        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAPPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAPPL03                  90
     C           *IN90     IFEQ *OFF
     C           L5SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDL5SYOS    WCT,I
     C                     Z-ADDL5KTSU    WDQ,I
     C           L5KTSU    MULT 20        WMQ,I
     C           L5SYOS    IFNE 0
     C           WMQ,I     DIV  L5SYOS    WMC,I     H
     C           WDQ,I     DIV  L5SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #1        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAOPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAOPL03                  90
     C           *IN90     IFEQ *OFF
     C           T1SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDT1SYOS    WCT,I
     C                     Z-ADDT1KTSU    WDQ,I
     C           T1KTSU    MULT 20        WMQ,I
     C           T1SYOS    IFNE 0
     C           WMQ,I     DIV  T1SYOS    WMC,I     H
     C           WDQ,I     DIV  T1SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #2        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAYPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAYPL03                  90
     C           *IN90     IFEQ *OFF
     C           L8SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDL8SYOS    WCT,I
     C                     Z-ADDL8KTSU    WDQ,I
     C           L8KTSU    MULT 20        WMQ,I
     C           L8SYOS    IFNE 0
     C           WMQ,I     DIV  L8SYOS    WMC,I     H
     C           WDQ,I     DIV  L8SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #4        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAEAPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAEAPL03                  90
     C           *IN90     IFEQ *OFF
     C           AESKJY    ANDEQ*BLANK
      *
     C                     Z-ADDAESYOS    WCT,I
     C                     Z-ADDAEKTSU    WMQ,I
     C           AEKTSU    DIV  20        WDQ,I
     C           AESYOS    IFNE 0
     C           WMQ,I     DIV  AESYOS    WMC,I     H
     C           WDQ,I     DIV  AESYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #6        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAANPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAANPL03                  90
     C           *IN90     IFEQ *OFF
     C           L7SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDL7SYOS    WCT,I
     C                     Z-ADDL7KTSU    WDQ,I
     C           L7KTSU    MULT 20        WMQ,I
     C           L7SYOS    IFNE 0
     C           WMQ,I     DIV  L7SYOS    WMC,I     H
     C           WDQ,I     DIV  L7SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     C           #7        BEGSR
      *-------------------------------------------------
     C           K#ADH     SETGTAAXPL03
     C           *IN90     DOUEQ*ON
     C           K#ADH     REDPEAAXPL03                  90
     C           *IN90     IFEQ *OFF
     C           L9SKJY    ANDEQ*BLANK
      *
     C                     Z-ADDL9SYOS    WCT,I
     C                     Z-ADDL9KTSU    WDQ,I
     C           L9KTSU    MULT 20        WMQ,I
     C           L9SYOS    IFNE 0
     C           WMQ,I     DIV  L9SYOS    WMC,I     H
     C           WDQ,I     DIV  L9SYOS    WDC,I     H
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         @YMD  Y   70
     O                         @HMS      79 '  :  :  '
     O        E   02           @HED
     O                                   50 'PART INFORMATION'
     O                                   75 'P.'
     O                         PAGE  Z   79
     O        E   03           @HED
     O                                    6 'PART#:'
     O                         D@PRT1    12
     O                         D@PRT2    18
     O                         D@PRT3    21
     O        E   04           @HED
     O                         @LINE     80
     O        E 1              @AAM
     O                                   22 '1ST PRC'
     O                                   36 '2ND PRC'
     O                                   50 '3RD PRC'
     O                                   64 '4TH PRC'
     O                                   78 '5TH PRC'
     O        E 1              @AAM
     O                         @LINE     80
     O        E 1              @AAM
     O                                    5 'PLANT'
     O                         WME,1     24
     O                         WME,2     38
     O                         WME,3     52
     O                         WME,4     66
     O                         WME,5     80
     O        E 1              @AAM
     O                                    7 'PROCESS'
     O                         SKO,1     18
     O                         SBM,1     24
     O                      N01SKO,2     32
     O                      N01SBM,2     38
     O                      N02SKO,3     46
     O                      N02SBM,3     52
     O                      N03SKO,4     60
     O                      N03SBM,4     66
     O                      N04SKO,5     74
     O                      N04SBM,5     80
     O        E 1              @AAM
     O                                    9 'PRC PART#'
     O                         SDH,1     24
     O                         SDH,2     38
     O                         SDH,3     52
     O                         SDH,4     66
     O                         SDH,5     80
     O        E 1              @AAM
     O                                    8 'LOCATION'
     O                         SBN,1     19
     O                         SKI,1     24
     O                         SBN,2     33
     O                         SKI,2     38
     O                         SBN,3     47
     O                         SKI,3     52
     O                         SBN,4     61
     O                         SKI,4     66
     O                         SBN,5     75
     O                         SKI,5     80
     O        E 1              @AAM
     O                                    8 'CHG DATE'
     O                         WCH,1     22 '  .  .  /  '
     O                         SKB,1     24
     O                      N01WCH,2     36 '  .  .  /  '
     O                      N01SKB,2     38
     O                      N02WCH,3     50 '  .  .  /  '
     O                      N02SKB,3     52
     O                      N03WCH,4     64 '  .  .  /  '
     O                      N03SKB,4     66
     O                      N04WCH,5     78 '  .  .  /  '
     O                      N04SKB,5     80
     O        E 1              @AAM
     O                                   10 'QUENCH INF'
     O                         WQN,1     24
     O                         WQN,2     38
     O                         WQN,3     52
     O                         WQN,4     66
     O                         WQN,5     80
     O        E 1              @AAM
     O                                      'MONTHLY VOL'
     O                         WMQ,1 1   24
     O                      N01WMQ,2 1   38
     O                      N02WMQ,3 1   52
     O                      N03WMQ,4 1   66
     O                      N04WMQ,5 1   80
     O        E 1              @AAM
     O                                      'DAILY VOL  '
     O                         WDQ,1 1   24
     O                      N01WDQ,2 1   38
     O                      N02WDQ,3 1   52
     O                      N03WDQ,4 1   66
     O                      N04WDQ,5 1   80
     O        E 1              @AAM
     O                                      'CONT.QTY   '
     O                         WCT,1 1   24
     O                      N01WCT,2 1   38
     O                      N02WCT,3 1   52
     O                      N03WCT,4 1   66
     O                      N04WCT,5 1   80
     O        E 1              @AAM
     O                                      'MONTHLY/CON'
     O                         WMC,1 1   24
     O                      N01WMC,2 1   38
     O                      N02WMC,3 1   52
     O                      N03WMC,4 1   66
     O                      N04WMC,5 1   80
     O        E 1              @AAM
     O                                      'DAILY/CONT.'
     O                         WDC,1 1   24
     O                      N01WDC,2 1   38
     O                      N02WDC,3 1   52
     O                      N03WDC,4 1   66
     O                      N04WDC,5 1   80
     O        E 1              @AAM2
     O                         @LINE     80
     O        E 1              @AAM2
     O                                   22 '6TH PRC'
     O                                   36 '7TH PRC'
     O                                   50 '8TH PRC'
     O                                   64 '9TH PRC'
     O                                   79 '10TH PRC'
     O        E 1              @AAM2
     O                         @LINE     80
     O        E 1              @AAM2
     O                                    5 'PLANT'
     O                         WME,6     24
     O                      N01WME,7     38
     O                      N02WME,8     52
     O                      N03WME,9     66
     O                      N04WME,10    80
     O        E 1              @AAM2
     O                                    7 'PROCESS'
     O                         SKO,6     18
     O                         SBM,6     24
     O                      N01SKO,7     32
     O                      N01SBM,7     38
     O                      N02SKO,8     46
     O                      N02SBM,8     52
     O                      N03SKO,9     60
     O                      N03SBM,9     66
     O                      N04SKO,10    74
     O                      N04SBM,10    80
     O        E 1              @AAM2
     O                                    9 'PRC PART#'
     O                         SDH,6     24
     O                         SDH,7     38
     O                         SDH,8     52
     O                         SDH,9     66
     O                         SDH,10    80
     O        E 1              @AAM2
     O                                    8 'LOCATION'
     O                         SBN,6     19
     O                         SKI,6     24
     O                         SBN,7     33
     O                         SKI,7     38
     O                         SBN,8     47
     O                         SKI,8     52
     O                         SBN,9     61
     O                         SKI,9     66
     O                         SBN,10    75
     O                         SKI,10    80
     O        E 1              @AAM2
     O                                    8 'CHG DATE'
     O                         WCH,6     22 '  .  .  /  '
     O                         SKB,6     24
     O                      N01WCH,7     36 '  .  .  /  '
     O                      N01SKB,7     38
     O                      N02WCH,8     50 '  .  .  /  '
     O                      N02SKB,8     52
     O                      N03WCH,9     64 '  .  .  /  '
     O                      N03SKB,9     66
     O                      N04WCH,10    78 '  .  .  /  '
     O                      N04SKB,10    80
     O        E 1              @AAM2
     O                                   10 'QUENCH INF'
     O                         WQN,6     24
     O                         WQN,7     38
     O                         WQN,8     52
     O                         WQN,9     66
     O                         WQN,10    80
     O        E 1              @AAM2
     O                                      'MONTHLY VOL'
     O                         WMQ,6 1   24
     O                      N01WMQ,7 1   38
     O                      N02WMQ,8 1   52
     O                      N03WMQ,9 1   66
     O                      N04WMQ,101   80
     O        E 1              @AAM2
     O                                      'DAILY VOL  '
     O                         WDQ,6 1   24
     O                      N01WDQ,7 1   38
     O                      N02WDQ,8 1   52
     O                      N03WDQ,9 1   66
     O                      N04WDQ,101   80
     O        E 1              @AAM2
     O                                      'CONT.QTY   '
     O                         WCT,6 1   24
     O                      N01WCT,7 1   38
     O                      N02WCT,8 1   52
     O                      N03WCT,9 1   66
     O                      N04WCT,101   80
     O        E 1              @AAM2
     O                                      'MONTHLY/CON'
     O                         WMC,6 1   24
     O                      N01WMC,7 1   38
     O                      N02WMC,8 1   52
     O                      N03WMC,9 1   66
     O                      N04WMC,101   80
     O        E 1              @AAM2
     O                                      'DAILY/CONT.'
     O                         WDC,6 1   24
     O                      N01WDC,7 1   38
     O                      N02WDC,8 1   52
     O                      N03WDC,9 1   66
     O                      N04WDC,101   80
     O        E 1              @AAM3
     O                         @LINE     80
     O        E 1              @AAM3
     O                                   23 '11TH PRC'
     O                                   37 '12TH PRC'
     O                                   51 '13TH PRC'
     O                                   65 '14TH PRC'
     O                                   79 '10TH PRC'
     O        E 1              @AAM3
     O                         @LINE     80
     O        E 1              @AAM3
     O                                    5 'PLANT'
     O                         WME,11    24
     O                      N01WME,12    38
     O                      N02WME,13    52
     O                      N03WME,14    66
     O                      N04WME,15    80
     O        E 1              @AAM3
     O                                    7 'PROCESS'
     O                         SKO,11    18
     O                         SBM,11    24
     O                      N01SKO,12    32
     O                      N01SBM,12    38
     O                      N02SKO,13    46
     O                      N02SBM,13    52
     O                      N03SKO,14    60
     O                      N03SBM,14    66
     O                      N04SKO,15    74
     O                      N04SBM,15    80
     O        E 1              @AAM3
     O                                    9 'PRC PART#'
     O                         SDH,11    24
     O                         SDH,12    38
     O                         SDH,13    52
     O                         SDH,14    66
     O                         SDH,15    80
     O        E 1              @AAM3
     O                                    8 'LOCATION'
     O                         SBN,11    19
     O                         SKI,11    24
     O                         SBN,12    33
     O                         SKI,12    38
     O                         SBN,13    47
     O                         SKI,13    52
     O                         SBN,14    61
     O                         SKI,14    66
     O                         SBN,15    75
     O                         SKI,15    80
     O        E 1              @AAM3
     O                                    8 'CHG DATE'
     O                         WCH,11    22 '  .  .  /  '
     O                         SKB,11    24
     O                      N01WCH,12    36 '  .  .  /  '
     O                      N01SKB,12    38
     O                      N02WCH,13    50 '  .  .  /  '
     O                      N02SKB,13    52
     O                      N03WCH,14    64 '  .  .  /  '
     O                      N03SKB,14    66
     O                      N04WCH,15    78 '  .  .  /  '
     O                      N04SKB,15    80
     O        E 1              @AAM3
     O                                   10 'QUENCH INF'
     O                         WQN,11    24
     O                         WQN,12    38
     O                         WQN,13    52
     O                         WQN,14    66
     O                         WQN,15    80
     O        E 1              @AAM3
     O                                      'MONTHLY VOL'
     O                         WMQ,111   24
     O                      N01WMQ,121   38
     O                      N02WMQ,131   52
     O                      N03WMQ,141   66
     O                      N04WMQ,151   80
     O        E 1              @AAM3
     O                                      'DAILY VOL  '
     O                         WDQ,111   24
     O                      N01WDQ,121   38
     O                      N02WDQ,131   52
     O                      N03WDQ,141   66
     O                      N04WDQ,151   80
     O        E 1              @AAM3
     O                                      'CONT.QTY   '
     O                         WCT,111   24
     O                      N01WCT,121   38
     O                      N02WCT,131   52
     O                      N03WCT,141   66
     O                      N04WCT,151   80
     O        E 1              @AAM3
     O                                      'MONTHLY/CON'
     O                         WMC,111   24
     O                      N01WMC,121   38
     O                      N02WMC,131   52
     O                      N03WMC,141   66
     O                      N04WMC,151   80
     O        E 1              @AAM3
     O                                      'DAILY/CONT.'
     O                         WDC,111   24
     O                      N01WDC,121   38
     O                      N02WDC,131   52
     O                      N03WDC,141   66
     O                      N04WDC,151   80
     O        E 1              @CHLD1
     O                         @LINE     80
     O        E 1              @CHLD1
     O                                   10 'CHILD P/N:'
     O        E 01             @CHLD2
     O                         WIT,1     25
     O                         WIT,2     40
     O                         WIT,3     55
     O                         WIT,4     70
      *-------------------------------------------------
**  CMD
F1:END     F5:PRINT(LANPRT02)
**  ER (ERROR-MESSAGE)
E-01 PART# ERROR
