     H            Y.
     F** AKAR37 **************************
     F* QUENCHING KANBAN M/F INQUIRY *
     F* A.IDOTA 1995.05.17 *
     F*
     F* TCHK1 04/28/09 ADD BOX COLOR
     F* TCHK2 08/05/09 CHG BOX COLOR 'GY-GREN' TO 'GLIME'
     F* TCHK3 08/11/11 ADD F2(PREVIOUS) IN 1ST SCREEN
     F* 2021.01.20 DCS. T.MITSUI
     F*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     F************************** AKAR37 **
     FAKAPW37 CF  E                    WORKSTN
     FADHPL03 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FFCETL06 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
      *COLOR BOX M/F
     FABHPP40 IF  E           K        DISK
     E                    JNM         5 16               条件名
     E                    JOK         5  2               条件
     E                    CMT3    1   2  1   CMT4   10   硬さ規格
TCHK1E*                   CMT5    1  10  1   CMT6    6   箱色名称
TCHK1E****                CMT5    1  11  1   CMT6    6   箱色名称
     E                    CMT7    1   2  1   CMT8   10   素材単重
     E                    CMT9    1   2  1   CMTA   10   図面必要区分
      *社内かんばん切替マスター
     E                    OKOT       15  3               旧工程
     E                    OBMN       15  4 0             旧部門
     E                    OKBN       15  3               旧機番
     E                    NKOT       15  3               新工程
     E                    NBMN       15  4 0             新部門
     E                    NKBN       15  3               新機番
     E                    NUKH       15 10 0             かんばん切替日
     E                    AKT        15  3               決定工程
     E                    ABM        15  4 0             決定部門
     E                    AKB        15  3               決定機番
      *旧工程*
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 CKQK01
     I                                        4   6 CKQK02
     I                                        7   9 CKQK03
     I                                       10  12 CKQK04
     I                                       13  15 CKQK05
     I                                       16  18 CKQK06
     I                                       19  21 CKQK07
     I                                       22  24 CKQK08
     I                                       25  27 CKQK09
     I                                       28  30 CKQK10
     I                                       31  33 CKQK11
     I                                       34  36 CKQK12
     I                                       37  39 CKQK13
     I                                       40  42 CKQK14
     I                                       43  45 CKQK15
      *旧部門*
     I            DS
     I                                        1  600OBMN
     I                                        1   40CKQB01
     I                                        5   80CKQB02
     I                                        9  120CKQB03
     I                                       13  160CKQB04
     I                                       17  200CKQB05
     I                                       21  240CKQB06
     I                                       25  280CKQB07
     I                                       29  320CKQB08
     I                                       33  360CKQB09
     I                                       37  400CKQB10
     I                                       41  440CKQB11
     I                                       45  480CKQB12
     I                                       49  520CKQB13
     I                                       53  560CKQB14
     I                                       57  600CKQB15
      *旧機番*
     I            DS
     I                                        1  45 OKBN
     I                                        1   3 CKQN01
     I                                        4   6 CKQN02
     I                                        7   9 CKQN03
     I                                       10  12 CKQN04
     I                                       13  15 CKQN05
     I                                       16  18 CKQN06
     I                                       19  21 CKQN07
     I                                       22  24 CKQN08
     I                                       25  27 CKQN09
     I                                       28  30 CKQN10
     I                                       31  33 CKQN11
     I                                       34  36 CKQN12
     I                                       37  39 CKQN13
     I                                       40  42 CKQN14
     I                                       43  45 CKQN15
      *新工程*
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
      *新部門*
     I            DS
     I                                        1  600NBMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
      *新機番*
     I            DS
     I                                        1  45 NKBN
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
      *かんばん切替日*
     I            DS
     I                                        1 1500NUKH
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  80 JNM
     I                                        1  16 JNM1
     I                                       17  32 JNM2
     I                                       33  48 JNM3
     I                                       49  64 JNM4
     I                                       65  80 JNM5
     I            DS
     I                                        1  10 JOK
     I                                        1   2 J6JOK1
     I                                        3   4 J6JOK2
     I                                        5   6 J6JOK3
     I                                        7   8 J6JOK4
     I                                        9  10 J6JOK5
     I            DS
     I                                        1  14 SHIN
     I                                        1   5 SHIN1
     I                                        6   6 SHIN2
     I                                        7  11 SHIN3
     I                                       12  12 SHIN4
     I                                       13  14 SHIN5
     I            DS
     I                                        1   8 MAEK2
     I                                        1   3 J6MAEK
     I                                        4   4 AAAAAA
     I                                        5   80J6MAKB
     I            DS
     I                                        1   8 ATOK2
     I                                        1   3 J6ATOK
     I                                        4   4 BBBBBB
     I                                        5   80J6ATOB
     I            DS
     I                                        1   9 MTKR
     I                                        1   1 J6MTK1
     I                                        2   2 MM1
     I                                        3   4 J6MTK2
     I                                        5   5 MM2
     I                                        6   7 J6MTK3
     I                                        8   8 MM3
     I                                        9   9 J6MTK4
     I            DS
     I                                        1   9 ATKR
     I                                        1   1 J6ATK1
     I                                        2   2 AM1
     I                                        3   4 J6ATK2
     I                                        5   5 AM2
     I                                        6   7 J6ATK3
     I                                        8   8 AM3
     I                                        9   9 J6ATK4
     I            DS
     I                                        1  22 A4SETK
     I                                        1   1 A401
     I                                        2  11 A402
     I                                       22  22 A403
     I            DS
     I                                        1  12 SETNM
     I                                        1   1 SET01
     I                                        2  11 SET02
     I                                       12  12 SET03
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1  20 DCNAMK
     I                                        1   1 DC01
     I                                        2  15 DC02
     I                                       20  20 DC03
     I            DS
     I                                        1  16 NMB
     I                                        1   1 NMB01
     I                                        2  15 NMB02
     I                                       16  16 NMB03
     I            DS
     I                                        1  16 NMA
     I                                        1   1 NMA01
     I                                        2  15 NMA02
     I                                       16  16 NMA03
     I            DS
     I                                        1  15 A2ZANM
     I                                        1   1 ZA01
     I                                        2   9 ZA02
     I                                       15  15 ZA03
     I            DS
     I                                        1  10 ZANM
     I                                        1   1 ZNM01
     I                                        2   9 ZNM02
     I                                       10  10 ZNM03
     I            DS
     I                                        1  10 KCDNM
     I                                        1   1 KCD01
     I                                        2   9 KCD02
     I                                       10  10 KCD03
     I            DS
     I                                        1  20 T3NAMK
     I                                        1   1 T301
     I                                        2   9 T302
     I                                       20  20 T303
     C           KEYA      KLIST
     C                     KFLD           ATK1
     C                     KFLD           ATK2
     C                     KFLD           ATK3
     C                     KFLD           ATK4
      *
     C           KEYB      KLIST
     C                     KFLD           J6KCD1
     C                     KFLD           J6KCD2
      *
     C           KEYD      KLIST
     C                     KFLD           WJKN
     C                     KFLD           WJKB
      *
     C           KEYE      KLIST
     C                     KFLD           J6MAKB
     C                     KFLD           J6MTYP
      *
     C           KEYF      KLIST
     C                     KFLD           J6ATOB
     C                     KFLD           J6ATYP
      *
     C           KEYG      KLIST
     C                     KFLD           J6SHN1
     C                     KFLD           J6SHN2
     C                     KFLD           J6SHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PCMD3   1
     C                     PARM           ATK1    1
     C                     PARM           ATK2    2
     C                     PARM           ATK3    2
     C                     PARM           ATK4    1
     C                     PARM           UKY1    4
     C                     PARM           UKM1    2
     C                     PARM           UKD1    2
     C                     PARM           UBI1    2
     C                     PARM           ERCD    1
     C                     MOVE UKY1      UKYY    40
     C                     MOVE UKM1      UKMM    20
     C                     MOVE UKD1      UKDD    20
     C                     MOVE UBI1      UBIN    20
     C                     MOVE *BLANK    ERCD
      *
     C                     MOVE *BLANK    WDTKB   1
     C           KEYA      SETGTADHPL031
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEYA      REDPEADHPL031                 10
     C           *IN10     IFEQ '0'
     C           J6SKJY    IFEQ 'D'
     C           J6SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     SETON                     10
     C                     MOVE '*'       WDTKB
     C                     END
     C                     END
     C  N10                END
      *
     C           WDTKB     IFEQ *BLANK
     C                     MOVE '9'       ERCD
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     MOVE J6SHN1    SHIN1
     C                     MOVE '-'       SHIN2
     C                     MOVE J6SHN2    SHIN3
     C                     MOVE '-'       SHIN4
     C                     MOVE J6SHN3    SHIN5
      *
     C                     MOVE *BLANK    SETNM
     C           J6STI1    CHAINAABPL011             20
     C           *IN,20    IFEQ '0'
     C           A4SKJY    ANDEQ'D'
     C           A4SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C           *IN,20    IFEQ '0'
     C                     MOVELA4SETN    SETNM
     C                     END
      *
     C                     MOVE *BLANK    KCDNM
     C           KEYB      CHAINGCMPL311             20
     C           *IN,20    IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C           *IN,20    IFEQ '0'
     C                     MOVELT3NAMN    KCDNM
     C                     END
      **計算日当箱数
     C                     Z-ADD0         WHIAT
     C                     Z-ADD0         DMY1   103
     C           J6KSSU    DIV  20        DMY1
     C           J6SYOS    IFNE 0
     C           DMY1      DIV  J6SYOS    WHIAT     H
     C                     END
      **  ﾆﾞｭci]xb ﾉ ﾈｮn  **
     C                     Z-ADD1         I       50
     C           1         DO   5         I
     C                     MOVE 'B'       WJKB    1
     C           JOK,I     IFNE *BLANK
     C                     MOVE JOK,I     WJKN    2
     C                     MOVEA'0'       *IN,20
     C           KEYD      CHAINAAAPL011             20
     C           *IN20     IFEQ '0'
     C           A5SKJY    ANDEQ'D'
     C           A5SKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C           *IN,20    IFEQ '0'
     C                     MOVELA5JOKM    JNM,I
     C                     END
     C                     END
     C                     END
      *
     C                     MOVE '-'       AAAAAA
     C                     MOVE '-'       BBBBBB
      **  ﾎﾞy]xbﾆｭcuﾇjｰ ﾉ kｩｮh  **
     C                     MOVE *BLANK    NMB
     C                     MOVEA'0'       *IN,20
     C                     MOVE *BLANK    NMB
     C           KEYE      CHAINAATPL011             20
     C           *IN20     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C           *IN,20    IFEQ '0'
     C                     MOVELDCNAMN    NMB
     C                     END
      *
     C                     MOVEA'0'       *IN,20
     C                     MOVE *BLANK    NMA
     C           KEYF      CHAINAATPL011             20
     C           *IN,20    IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     MOVEA'1'       *IN,20
     C                     END
      *
     C           *IN,20    IFEQ '0'
     C                     MOVELDCNAMN    NMA
     C                     END
      *
     C                     MOVE '-'       MM1
     C                     MOVE '-'       MM2
     C                     MOVE '-'       MM3
     C                     MOVE '-'       AM1
     C                     MOVE '-'       AM2
     C                     MOVE '-'       AM3
      *
     C                     MOVEA'0'       *IN,20
     C                     MOVE *BLANK    ZANM
     C           J6ZACD    CHAINFCETL061             20
     C           *IN20     IFEQ '0'
     C                     MOVELZA01      ZNM01
     C                     MOVELZA02      ZNM02
     C                     MOVELZA03      ZNM03
     C                     END
      **　箱色　**
     C                     SETOF                     60
     C                     MOVE *BLANK    IRO1
     C                     Z-ADD1         Z       20
     C           J6HIR1    CHAINABHPP401             60
     C           *IN60     IFEQ '0'
     C                     MOVELA4NAME    IRO1
     C                     END
      *
     C                     SETOF                     60
     C                     MOVE *BLANK    IRO2
     C                     Z-ADD1         Z       20
     C           J6HIR2    CHAINABHPP401             60
     C           *IN60     IFEQ '0'
     C                     MOVELA4NAME    IRO2
     C                     END
      **硬さ規格**
     C                     MOVE *BLANK    KINM
     C                     SETOF                     30
     C                     Z-ADD1         Z       20
     C           J6KIK3    LOKUPCMT3,Z                   30
     C           *IN30     IFEQ '1'
     C                     MOVE CMT4,Z    KINM
     C                     END
      **素材単重**
     C                     MOVE *BLANK    SZNM
     C                     SETOF                     30
     C                     Z-ADD1         Z       20
     C           J6HKKB    LOKUPCMT7,Z                   30
     C           *IN30     IFEQ '1'
     C                     MOVE CMT8,Z    SZNM
     C                     END
      **図面必要区分**
     C                     MOVE *BLANK    ZMNM
     C                     SETOF                     30
     C                     Z-ADD1         Z       20
     C           J6ZMEN    LOKUPCMT9,Z                   30
     C           *IN30     IFEQ '1'
     C                     MOVE CMTA,Z    ZMNM
     C                     END
     C*
     C                     MOVE *BLANK    J6SSNM
     C                     SELEC
     C           J6SSKB    WHEQ '1'
     C                     MOVEL'REG'     J6SSNM
     C           J6SSKB    WHEQ '2'
     C                     MOVEL'SS'      J6SSNM
     C           J6SSKB    WHEQ '3'
     C                     MOVEL'KEEP 120'J6SSNM
     C           J6SSKB    WHEQ '4'
     C                     MOVEL'WSHR SET'J6SSNM
     C           J6SSKB    WHEQ '5'
     C                     MOVEL'1 / 4W  'J6SSNM
     C                     ENDSL
      **　焼入れ部門決定　**
     C                     MOVE *BLANK    AKT
     C                     Z-ADD0         ABM
     C                     MOVE *BLANK    AKB
     C                     MOVE *BLANK    GATOK
      *
     C                     SETOF                     30
     C           KEYG      CHAINAAMPL111             30
      *
     C           *IN30     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     Z-ADD1         X       20
     C                     Z-ADD0         L       20
     C           1         DO   15        X
     C                     MOVELNUKH,X    WUKH    80
     C           WUKH      IFGT J6UKHZ
     C                     ADD  1         L
     C                     MOVE OKOT,X    AKT,L
     C                     Z-ADDOBMN,X    ABM,L
     C                     MOVE OKBN,X    AKB,L
     C                     ELSE
     C                     ADD  1         L
     C                     MOVE NKOT,X    AKT,L
     C                     Z-ADDNBMN,X    ABM,L
     C                     MOVE NKBN,X    AKB,L
     C                     END
     C                     END
      *
     C                     END
     C                     END
      *
     C                     SETOF                     30
     C                     Z-ADD1         X       20
     C           J6RONO    LOKUPAKB,X                    30
     C           *IN30     IFEQ '1'
     C           ABM,X     ANDEQJ6ATOB
     C                     MOVE AKT,X     GATOK
     C                     END
      *
     C           @DSP      TAG
     C                     EXFMTAKAPW371
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '1'       PCMD3
     C                     END
      *
TCHK1C           *INKB     IFEQ '1'
TCHK1C                     MOVE '2'       PCMD3
TCHK1C                     END
      *調整分理由
     C           *INKD     IFEQ '1'
     C                     MOVELJ6ATK1    P@JBN1  1
     C                     MOVELJ6ATK2    P@JBN2  2
     C                     MOVELJ6ATK3    P@JBN3  2
     C                     MOVELJ6ATK4    P@JBN4  1
     C                     MOVELJ6UKYY    P@UKYY  40
     C                     MOVELJ6UKMM    P@UKMM  20
     C                     MOVELJ6UKDD    P@UKDD  20
     C                     MOVELJ6UBIN    P@UBIN  20
     C                     MOVEL'AKAR37'  P@FPGM
     C                     Z-ADDJ6TSEI    P@MAIS
     C                     MOVE 'M'       PSTS    1
     C                     CALL 'ACHR01'
     C                     PARM           P@JBN1  1
     C                     PARM           P@JBN2  2
     C                     PARM           P@JBN3  2
     C                     PARM           P@JBN4  1
     C                     PARM           P@UKYY  40
     C                     PARM           P@UKMM  20
     C                     PARM           P@UKDD  20
     C                     PARM           P@UBIN  20
     C                     PARM           P@FPGM 10
     C                     PARM           P@MAIS  50       調整枚数
     C                     PARM           PSTS    1        *ステータス
     C                     GOTO @DSP
     C                     ENDIF
TCHK1 *
     C                     SETON                     LR
     C                     RETRN
**  CMT3/CMT4 ( HARDNESS STANDARD)
1HARD STD
2MANAG STD
**  CMT7/CMT8 ( MATERIAL UNIT WEIGHT)
KCMPLET UNW
SMTRAL UNW
**  CMT9/CMTA ( DRAWING NEED INSTRUCTION)
 NO DRAWING
*DRAWING
