     H            Y.
     F** AKBR17 ********************************************
     F*  WASHER TEMPORARY KANBAN ISSUE FOR FREEWAY         *
     F*                                                    *
     F* TCHK  10/13/11 CREATE(COPY FROM AKBR16)            *
     F* TCHK1 03/01/13 ADD RK-METAL(2525)                  *
     F******************************************************
     FAKBPW17 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAKBPL01 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAKBPP17 UF  E           K        DISK                      A
     FAKBWP11AO   F     110            DISK
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   1 78
     E                    LT1    26  26  1
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      *
     I            DS
     I                                        1  16 WKNAME
     I            DS
     I                                        1  15 WKBARC
     I                                        1   1 STRBAR
     I                                        2  14 BARSET
     I                                       15  15 ENDBAR
     I            DS
     I                                        1  13 WKEDIT
     I                                        1   10WKKSKB
     I                                        2   5 L1ZETI
     I                                        6   90L1BMON
     I                                       10  10 L1KCD1
     I                                       11  13 WKLOT#
      *
     I            DS
     I                                        1   80HYMD8
     I                                        1   40HY
     I                                        5   60HM
     I                                        7   80HD
      *
     I            DS
     I                                        1   60@TIME
     I                                        1   20TIMEH
     I                                        3   40TIMES
      *
     I            DS
     I                                        1  14 @SHIN
     I                                        1   5 L1SHN1
     I                                        6   6 WKF1
     I                                        7  11 L1SHN2
     I                                       12  12 WKF2
     I                                       13  14 L1SHN3
     I            DS
     I                                        1   9 D@LOC
     I                                        1   1 D@LOC1
     I I            '-'                       2   2 D@1
     I                                        3   4 D@LOC2
     I I            '-'                       5   5 D@2
     I                                        6   7 D@LOC3
     I I            '-'                       8   8 D@3
     I                                        9   9 D@LOC4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I*
     I            DS
     I                                        1   3 W@LT#
     I                                        1   1 W@LT#1
     I                                        2   30W@LT#2
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C           W@ID      CASEQ'02'      #DSP02
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      *   INITIAL  SET                                     *
      *----------------------------------------------------*
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
      *
     C                     MOVE '1'       P@END
      *
     C           KEYT21    KLIST
     C                     KFLD           #KBMON  40
     C                     KFLD           #KTAIP  1
     C           K#AAP     KLIST
     C                     KFLD           L1JOK6
     C                     KFLD           L1KCD1
      *----------------------------------------------------*
     C                     TIME           @TIME   60
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    HYMD8   80
      *----------------------------------------------------*
     C           K#KEY     KLIST
     C                     KFLD           D@LOC1
     C                     KFLD           D@LOC2
     C                     KFLD           D@LOC3
     C                     KFLD           D@LOC4
     C           K#KEYX    KLIST
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
     C                     KFLD           S@LOC3
     C                     KFLD           S@LOC4
      *
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------------
      *   1ST SCREEN
      *--------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     MOVE '02'      W@ID
     C                     EXSR #SET
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------------
      *   CHECK
      *--------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVEA'00'      *IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SET DATA FOR 2ND SCREEN
      *--------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
     C           K#KEY     SETLLAKBPL01
     C           *IN90     DOUEQ*ON
     C                     READ AKBPL01                  90
TCHK1C*          *IN90     IFEQ *OFF
TCHK1C*          L1SKJY    ANDEQ*BLANK
TCHK1C*          L1STHZ    ANDEQ99999999
TCHK1C*          L1BMON    ANDEQ2323
TCHK1C   90                LEAVE
TCHK1C           L1SKJY    IFNE *BLANK
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           L1STHZ    IFNE 99999999
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           L1BMON    IFEQ 2323
TCHK1C           L1BMON    OREQ 2525
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     END
     C                     MOVE L1TKR1    S@LOC1
     C                     MOVE L1TKR2    S@LOC2
     C                     MOVE L1TKR3    S@LOC3
     C                     MOVE L1TKR4    S@LOC4
     C                     MOVE L1SHN1    S@PRT1
     C                     MOVE L1SHN2    S@PRT2
     C                     MOVE L1SHN3    S@PRT3
     C                     Z-ADDL1BMON    S@PLNT
     C                     Z-ADDL1SYOS    S@SYOS
     C           L1KTSU    DIV  L1SYOS    S@SETQ
     C                     Z-ADDL1KMAX    S@MAX
     C           K#AKB     KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           K#AKB     CHAINAKBPP17             N91
     C           *IN91     IFEQ *OFF
     C           A7SKJY    ANDEQ*BLANK
     C                     MOVELA7LOT1    W@LT#1
     C                     Z-ADDA7LOT2    W@LT#2
     C                     MOVELW@LT#     S@LAST
     C                     ELSE
     C                     MOVEL*BLANK    S@LAST
     C                     END
     C                     ADD  1         RRN1
     C                     WRITESFL01
TCHK1C*                    ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *--------------------------------------------------------
      *   2NC SCREEN
      *--------------------------------------------------------
     C           #DSP02    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD@@REC     #RCNO
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     MOVE '01'      W@ID
     C                     EXSR #WRT
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #CHK2     BEGSR
      *--------------------------------------------------------
     C                     MOVEA'00'      *IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #WRT      BEGSR
      *--------------------------------------------------------
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@MAIS    ANDGT*ZERO
      *
     C           K#KEYX    SETLLAKBPL01
TCHK1C*          *IN90     DOUEQ*ON
TCHK1C*          K#KEYX    READEAKBPL01                  90
TCHK1C*          *IN90     IFEQ *OFF
TCHK1C*          L1SKJY    ANDEQ*BLANK
TCHK1C*          L1STHZ    ANDEQ99999999
TCHK1C*          L1BMON    ANDEQ2323
TCHK1C                     DO   *HIVAL
TCHK1C           K#KEYX    READEAKBPL01                  89
TCHK1C   89                LEAVE
TCHK1C           L1SKJY    IFNE *BLANK
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           L1STHZ    IFNE 99999999
TCHK1C                     ITER
TCHK1C                     END
TCHK1C           L1BMON    IFEQ 2323
TCHK1C           L1BMON    OREQ 2525
TCHK1C                     ELSE
TCHK1C                     ITER
TCHK1C                     END
     C                     EXSR #OUT
     C                     LEAVE
TCHK1C*                    ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #OUT      BEGSR
      *--------------------------------------------------------
      *
     C                     SETOF                     21
     C                     Z-ADDL1BMON    #KBMON
     C                     MOVE L1TAIP    #KTAIP
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVELT2NAMN    WKNAME
     C                     END
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           L1SHN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
     C                     Z-ADDS@SYOS    WKSYOS  60
     C                     Z-ADDL1LTIM    WKLTIM  31
     C                     MOVE L1SYOT    WKSYOT  1
     C                     MOVE L1TKRO    WKTKRO  6
     C                     Z-ADDL1ROTO    WKROTO  20
     C           WKROTO    IFEQ *ZERO
     C                     Z-ADD1         WKROTO
     C                     END
      * A CIRCULATION
     C           WKHMAS    IFNE *ZERO
     C                     MOVE '1'       WKCON   1
     C                     MOVE *BLANK    NAME   16
     C                     Z-ADD1         WKSTNO  30
     C                     Z-ADD1         WKEDNO  30
     C                     MOVE *BLANK    WKBARC
     C                     EXCPTFILE
     C                     MOVE *BLANK    WKCON
     C                     SETON                       U1
     C                     END
      *
     C                     Z-ADD1         WKHKNO  30
     C                     Z-ADDS@MAIS    WKHMAS  30
      *
     C           K#AKB     CHAINAKBPP17              91
     C           *IN91     IFEQ *OFF
     C           A7SKJY    ANDEQ*BLANK
     C                     MOVELA7LOT1    W@LT#1
     C                     Z-ADDA7LOT2    W@LT#2
     C                     ELSE
     C                     MOVEL'A'       W@LT#1
     C                     Z-ADD*ZERO     W@LT#2
     C                     END
      *DIVIDE BY KANBAN SHEETS
     C                     SETOF                       22
     C*
     C                     DO   *HIVAL
     C*
     C                     MOVE WKNAME    NAME   16
     C                     MOVE '2'       WKCON   1
     C                     SUB  1         WKHMAS         22
     C                     Z-ADDWKHKNO    WKSTNO
     C                     Z-ADDS@MAIS    WKEDNO
      *
     C                     MOVE *BLANK    BARSET
      *
     C                     Z-ADDL1KSKB    WKKSKB
      *
     C           W@LT#2    IFEQ 99
     C                     Z-ADD*ZERO     W@LT#2
     C                     Z-ADD1         X       20
     C           W@LT#1    LOKUPLT1,X                    92
     C           *IN92     IFEQ *ON
     C                     ADD  1         X
     C           X         IFGT 26
     C                     MOVELLT1,1     W@LT#1
     C                     ELSE
     C                     MOVELLT1,X     W@LT#1
     C                     END
     C                     END
     C                     END
     C                     ADD  1         W@LT#2
     C                     MOVELW@LT#     WKLOT#
      *
     C                     MOVE WKEDIT    BARSET
     C                     MOVE '*'       STRBAR
     C                     MOVE '*'       ENDBAR
      *
     C                     MOVE *BLANK    W22    22
     C           L1JOK6    IFNE *BLANK
     C           K#AAP     CHAINAAAPL01              90
     C           *IN90     IFEQ *OFF
     C           '('       CAT  A5JOKM:1  W22       P
     C           W22       CAT  ')':1     W22       P
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXCPTFILE
     C*
     C                     MOVE *BLANK    P@END
     C                     ADD  1         WKHKNO
     C*
     C  N22                ENDDO
      *
     C                     MOVE *BLANK    WKCON
     C*
     C                     TIME           WSDT
     C           *IN91     IFEQ *ON
     C                     CLEARAKBPP171
     C                     MOVELL1SHN1    A7PRT1
     C                     MOVELL1SHN2    A7PRT2
     C                     MOVELL1SHN3    A7PRT3
     C                     END
     C           A7SKJY    IFNE *BLANK
     C                     MOVEL*BLANK    A7SKJY
     C                     Z-ADD*ZERO     A7SKDT
     C                     Z-ADD*ZERO     A7SKTM
     C                     MOVEL*BLANK    A7SKID
     C                     MOVEL*BLANK    A7SKWS
     C                     MOVEL*BLANK    A7SKPG
     C                     END
     C                     Z-ADDWSSDAT    A7KODT
     C                     Z-ADDWSSTM4    A7KOTM
     C                     MOVEL#USER     A7KOID
     C                     MOVEL#WSID     A7KOWS
     C                     MOVEL#PGM      A7KOPG
     C*
     C                     MOVELW@LT#1    A7LOT1
     C                     Z-ADDW@LT#2    A7LOT2
     C*
     C  N91                UPDATAKBPP171
     C   91                WRITEAKBPP171
      *
     C                     ENDSR
      *----------------------------------------------------*
     OAKBWP11AE                FILE
     O                         WKCON      1
     O                         WKSTNO     4
     O                         WKEDNO     7
     O                         NAME      23
     O                         @SHIN     37
     O                         WKBARC    52
     O                         WKLTIM    55
     O                         WKSYOS    61
     O                         WKSYOT    62
     O                         WKTKRO    68
     O                         HYMD8     76
     O                         W22       98
     O                         S@MAIS   101
TCHK2O                         WKROTO   103
** CMD
   F1:END
   F1:END      F5:ISSUE       F12:GO BACK
** MSG
DATA IS READY FOR KANBAN. CLOSE THE PROGRAM GO TO PC FOR PRINTING.
** LT1
ABCDEFGHIJKLMNOPQRSTUVWXYZ
