     H            Y/
     F***************************************************
     F*   ROLLING WASHER RETRIEVAL KANBAN
     F*         NOV/15/2004                            *
     F*                                                 *
     F*                                                 *
     F* TCHK1 01/06/06 CHG SELECT 'RL ' PROCESS         *
     F* TCHK2 01/09/06 ADD LOW-VOLUME LOCATION CHECK    *
     F* TCHK3 04/28/06 ADD M6KMAX=0 SKIP                *
     F* TCHK4 06/15/11 RMV M6AKT5                       *
     F***************************************************
     FAKBPW25 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FFCEPL01 IF  E           K        DISK
     FABHPL02 IF  E           K        DISK
     FAKBPL04 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
TCHK2FAKBPP26 IF  E           K        DISK
     FAKBWP25 O   E                    DISK
      *------------------------------------------------------------
     E                    CMD     1   1 78
     E                    KB         15  3               MACHINE
     E                    KO         15  3               PROCESS
     E                    MC         20  3
     E                    @MC         8  3
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1  45 KB
     I                                        1   3 CKKB01
     I                                        4   6 CKKB02
     I                                        7   9 CKKB03
     I                                       10  12 CKKB04
     I                                       13  15 CKKB05
     I                                       16  18 CKKB06
     I                                       19  21 CKKB07
     I                                       22  24 CKKB08
     I                                       25  27 CKKB09
     I                                       28  30 CKKB10
     I                                       31  33 CKKB11
     I                                       34  36 CKKB12
     I                                       37  39 CKKB13
     I                                       40  42 CKKB14
     I                                       43  45 CKKB15
     I            DS
     I                                        1  45 KO
     I                                        1   3 CKKO01
     I                                        4   6 CKKO02
     I                                        7   9 CKKO03
     I                                       10  12 CKKO04
     I                                       13  15 CKKO05
     I                                       16  18 CKKO06
     I                                       19  21 CKKO07
     I                                       22  24 CKKO08
     I                                       25  27 CKKO09
     I                                       28  30 CKKO10
     I                                       31  33 CKKO11
     I                                       34  36 CKKO12
     I                                       37  39 CKKO13
     I                                       40  42 CKKO14
     I                                       43  45 CKKO15
     I            DS
     I                                        1  12 MCPRT
     I                                        1   5 MCSHN1
     I                                        6  10 MCSHN2
     I                                       11  12 MCSHN3
     I            DS
     I                                        1  60 MC
     I                                        1   3 H@MC01
     I                                        4   6 H@MC02
     I                                        7   9 H@MC03
     I                                       10  12 H@MC04
     I                                       13  15 H@MC05
     I                                       16  18 H@MC06
     I                                       19  21 H@MC07
     I                                       22  24 H@MC08
     I                                       25  27 H@MC09
     I                                       28  30 H@MC10
     I                                       31  33 H@MC11
     I                                       34  36 H@MC12
     I                                       37  39 H@MC13
     I                                       40  42 H@MC14
     I                                       43  45 H@MC15
     I                                       46  48 H@MC16
     I                                       49  51 H@MC17
     I                                       52  54 H@MC18
     I                                       55  57 H@MC19
     I                                       58  60 H@MC20
     I            DS
     I                                        1  24 @MC
     I                                        1   3 S@MCN1
     I                                        4   6 S@MCN2
     I                                        7   9 S@MCN3
     I                                       10  12 S@MCN4
     I                                       13  15 S@MCN5
     I                                       16  18 S@MCN6
     I                                       19  21 S@MCN7
     I                                       22  24 S@MCN8
     I            DS
     I                                        1  12 S@PART
     I                                        1   5 S@PRT1
     I                                        6  10 S@PRT2
     I                                       11  12 S@PRT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *------------------------------------------------------
      *  INITIALIZE
      *------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#FCEP    KLIST
     C                     KFLD           L1SHN1
     C                     KFLD           L1SHN2
     C                     KFLD           L1SHN3
     C           K#KEY     KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C           K#KEYX    KLIST
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
     C           K#AH      KLIST
     C                     KFLD           K@PLNT  40
     C                     KFLD           S@PRT1
     C                     KFLD           S@PRT2
     C                     KFLD           S@PRT3
      *
     C                     Z-ADD0111      K@PLNT
     C                     Z-ADD*ZERO     RRN1    40
     C                     MOVEL'01'      W@ID    2
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
      *
     C                     DO   100
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDDO
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   1ST SCREEN
      *------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVELCMD,1     D@CMD
      *
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     Z-ADD@@REC     #RCNO
     C                     SELEC
      * F1
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      W@ID
      *
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #WRT
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CHECK
      *------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN80     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                80
     C           *IN80     IFEQ *OFF
     C                     MOVE *BLANK    S@WP11
     C                     MOVE *BLANK    S@WP12
     C                     MOVE *BLANK    S@WP13
     C                     MOVE *BLANK    S@WP21
     C                     MOVE *BLANK    S@WP22
     C                     MOVE *BLANK    S@WP23
     C                     MOVE *BLANK    S@WP31
     C                     MOVE *BLANK    S@WP32
     C                     MOVE *BLANK    S@WP33
     C                     MOVE *OFF      *IN61
     C           S@PART    IFNE *BLANK
     C           K#KEYX    CHAINFCEPL01              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     Z-ADDW@RRN     #RCNO
     C                     ELSE
     C                     MOVE A21HB5    S@WP11
     C                     MOVE A22HB5    S@WP12
     C                     MOVE A23HB2    S@WP13
     C                     MOVE A24HB5    S@WP21
     C                     MOVE A25HB5    S@WP22
     C                     MOVE A26HB2    S@WP23
     C                     MOVE A27HB5    S@WP31
     C                     MOVE A28HB5    S@WP32
     C                     MOVE A29HB2    S@WP33
     C                     ENDIF
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   CELAR
      *------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,60
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *------------------------------------------------------
      *   WRITE RECORDS
      *------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     Z-ADD*ZERO     W@RRN   40
     C           *IN80     DOUEQ*ON
     C                     ADD  1         W@RRN
     C           W@RRN     CHAINSFL01                80
     C           *IN80     IFEQ *OFF
     C           S@PART    ANDNE*BLANK
     C                     CLEARAKBWP251
     C                     MOVELS@PRT1    W1SHIN
     C           S@PRT2    IFNE *BLANK
     C           W1SHIN    CAT  '-':0     W1SHIN    P
     C           W1SHIN    CAT  S@PRT2:0  W1SHIN    P
     C                     ENDIF
     C           S@PRT3    IFNE *BLANK
     C           W1SHIN    CAT  '-':0     W1SHIN    P
     C           W1SHIN    CAT  S@PRT3:0  W1SHIN    P
     C                     ENDIF
      *
     C                     MOVE *DATE     W1DATE
     C                     EXSR #MCN
      * # OF KAN
     C                     Z-ADD1         @NBR    50
     C           K#AH      SETLLABHPL02
     C           *IN90     DOUEQ*ON
     C           K#AH      READEABHPL02                  90
     C           *IN90     IFEQ *OFF
     C           M6SKJY    ANDEQ*BLANK
TCHK4C*          M6UKHZ    ANDLE*DATE
TCHK4C*          M6STHZ    ANDGT*DATE
TCHK4C           M6STYY    ANDEQ9999
TCHK1C           M6AKT1    IFEQ 'RL '
TCHK1C           M6AKT2    OREQ 'RL '
TCHK1C           M6AKT3    OREQ 'RL '
TCHK1C           M6AKT4    OREQ 'RL '
TCHK1C           M6AKT1    OREQ 'AK '
TCHK1C           M6AKT2    OREQ 'AK '
TCHK1C           M6AKT3    OREQ 'AK '
TCHK1C           M6AKT4    OREQ 'AK '
TCHK1C           M6AKT1    OREQ 'FRL'
TCHK1C           M6AKT2    OREQ 'FRL'
TCHK1C           M6AKT3    OREQ 'FRL'
TCHK1C           M6AKT4    OREQ 'FRL'
TCHK1C           M6AKT1    OREQ 'RRT'
TCHK1C           M6AKT2    OREQ 'RRT'
TCHK1C           M6AKT3    OREQ 'RRT'
TCHK1C           M6AKT4    OREQ 'RRT'
TCHK4C*TCHK1     M6AKT5    OREQ 'RL '
TCHK4C****       M6YOBI    IFGT 0
TCHK3C           M6KMAX    IFNE *ZERO
     C                     Z-ADDM6KMAX    @NBR    50
     C                     LEAVE
TCHK3C                     END
TCHK1C                     END
     C                     ENDIF
     C                     ENDDO
      *
     C           S@WP11    IFNE *BLANK
     C                     MOVE S@WP11    K@SHN1
     C                     MOVE S@WP12    K@SHN2
     C                     MOVE S@WP13    K@SHN3
     C                     EXSR #WASH
     C                     ENDIF
     C           S@WP21    IFNE *BLANK
     C                     MOVE S@WP21    K@SHN1
     C                     MOVE S@WP22    K@SHN2
     C                     MOVE S@WP23    K@SHN3
     C                     EXSR #WASH
     C                     ENDIF
     C           S@WP31    IFNE *BLANK
     C                     MOVE S@WP31    K@SHN1
     C                     MOVE S@WP32    K@SHN2
     C                     MOVE S@WP33    K@SHN3
     C                     EXSR #WASH
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *------------------------------------------------------
      *   WASHER DATA
      *------------------------------------------------------
     C           #WASH     BEGSR
      *
     C           K#KEY     SETLLAKBPL04
     C           *IN90     DOUEQ*ON
     C           K#KEY     READEAKBPL04                  90
     C           *IN90     IFEQ *OFF
     C           L1SKJY    ANDNE'D'
     C           L1STYY    ANDEQ9999
      *
     C                     MOVELK@SHN1    W1WSHR    P
     C           K@SHN2    IFNE *BLANK
     C           W1WSHR    CAT  '-':0     W1WSHR    P
     C           W1WSHR    CAT  K@SHN2:0  W1WSHR    P
     C                     ENDIF
     C           K@SHN3    IFNE *BLANK
     C           W1WSHR    CAT  '-':0     W1WSHR    P
     C           W1WSHR    CAT  K@SHN3:0  W1WSHR    P
     C                     ENDIF
     C                     MOVELL1TKR1    W1LOC1
     C                     MOVELL1TKR2    W1LOC2
     C                     MOVELL1TKR3    W1LOC3
     C                     MOVELL1TKR4    W1LOC4
TCHK2C           K#BP26    KLIST
TCHK2C                     KFLD           W1LOC1
TCHK2C                     KFLD           W1LOC2
TCHK2C                     KFLD           W1LOC3
TCHK2C                     KFLD           W1LOC4
TCHK2C           K#BP26    CHAINAKBPP26              92
TCHK2C           *IN92     IFEQ *OFF
TCHK2C           RWSKJY    ANDEQ*BLANK
TCHK2C                     MOVEL'*'       W1ASTR
TCHK2C                     ELSE
TCHK2C                     MOVEL*BLANK    W1ASTR
TCHK2C                     END
      *
     C****                 Z-ADDL1KMAX    @NBR    30
     C*          @NBR      IFEQ *ZERO
     C*                    ADD  1         @NBR
     C*****                ENDIF
     C                     Z-ADD@NBR      W1TPAG
      *
     C           1         DO   @NBR      Y
     C                     Z-ADDY         W1PAGE
     C                     WRITEAKBWP251
     C                     ENDDO
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C           K#KEY     CHAINFCEPL01              90
     C           *IN90     IFEQ *OFF
     C                     MOVELK@SHN1    W1WSHR    P
     C           K@SHN2    IFNE *BLANK
     C           W1WSHR    CAT  '-':0     W1WSHR    P
     C           W1WSHR    CAT  K@SHN2:0  W1WSHR    P
     C                     ENDIF
     C           K@SHN3    IFNE *BLANK
     C           W1WSHR    CAT  '-':0     W1WSHR    P
     C           W1WSHR    CAT  K@SHN3:0  W1WSHR    P
     C                     ENDIF
     C                     MOVELA2STRK    W1LOC1
     C                     MOVELA2STRT    W1LOC2
     C                     MOVELA2STRR    W1LOC3
     C                     MOVELA2STRD    W1LOC4
     C                     Z-ADD@NBR      W1TPAG
TCHK2C           K#BP26    CHAINAKBPP26              92
TCHK2C           *IN92     IFEQ *OFF
TCHK2C           RWSKJY    ANDEQ*BLANK
TCHK2C                     MOVEL'*'       W1ASTR
TCHK2C                     ELSE
TCHK2C                     MOVEL*BLANK    W1ASTR
TCHK2C                     END
      *
     C           1         DO   @NBR      Y
     C                     Z-ADDY         W1PAGE
     C                     WRITEAKBWP251
     C                     ENDDO
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *   MACHINE NUMBER
      *------------------------------------------------------
     C           #MCN      BEGSR
      *
     C           K#KEYX    CHAINAAMPL11              91
     C           *IN91     IFEQ *OFF
     C           CKSKJY    ANDEQ*BLANK
      *
     C                     Z-ADD1         Y       50
     C           'RL '     LOKUPKO,Y                     10
     C           *IN10     IFEQ *ON
     C                     MOVE KB,Y      W1MCHN
     C                     ENDIF
      *
     C           W1MCHN    IFEQ *BLANK
     C                     Z-ADD1         Y1      30
     C           'FRL'     LOKUPKO,Y1                    11
     C           *IN11     IFEQ *ON
     C                     MOVE KB,Y1     W1MCHN
     C                     ENDIF
     C                     ENDIF
      *
     C           W1MCHN    IFEQ *BLANK
     C                     Z-ADD1         Y2      30
     C           'AK '     LOKUPKO,Y2                    12
     C           *IN12     IFEQ *ON
     C                     MOVE KB,Y2     W1MCHN
     C                     ENDIF
     C                     ENDIF
      *
     C           W1MCHN    IFEQ *BLANK
     C                     Z-ADD1         Y3      30
     C           'RRT'     LOKUPKO,Y3                    13
     C           *IN13     IFEQ *ON
     C                     MOVE KB,Y3     W1MCHN
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
**  CMD
F1:END      F5:CREATE KANBAN DATA
