     H            Y.
     F** AKBR20 *************************************
     F* NUMBER OF COMPONENTS  KANBAN ADJUTING LIST  *
     F* CODING:K.OKACHI      2000.12.11             *
     F*----------+-----+----------+-----------------------------------*
     F*2021.02.23|DCS. |T.MITSUI  | CHANGE WITH THE NUMBER OF FIGURES *
     F*          |     |          |          EXPANSION OF THE "KANBAN"*
     F******************************************************* AKBR20 **
     FAKBPW20 CF  E                    WORKSTN
     FAKBPP01 IF  E                    DISK
     FAEBPL02 IF  E           K        DISK
     FMBEPL02 IF  E           K        DISK
     FABBPL21 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAKBWP201O   F     128            DISK
     E                    WCD         3  3 1             fnﾞcpｮﾇc
     E                    ER      1   2 60
      *
     I            DS
     I                                        1   80L1SKHZ
     I                                        1   40L1SKYY
     I                                        5   60L1SKMM
     I                                        7   80L1SKDD
     I            DS
     I                                        1   80L1UKHZ
     I                                        1   40L1UKYY
     I                                        5   60L1UKMM
     I                                        7   80L1UKDD
     I            DS
     I                                        1   80L1STHZ
     I                                        1   40L1STYY
     I                                        5   60L1STMM
     I                                        7   80L1STDD
     I            DS
     I                                        1   60WKYM
     I                                        1   40WKYY
     I                                        5   60WKMM
     I            DS
     I                                        1   60WWYM
     I                                        1   40WWYY
     I                                        5   60WWMM
     I            DS
     I                                        1   60@WYM
     I                                        1   40@WYY
     I                                        5   60@WMM
     I            DS
     I                                        1   60GWYM
     I                                        1   40GWYY
     I                                        5   60GWMM
     C           *ENTRY    PLIST
     C                     PARM           PKYM    6
     C                     PARM           PGYM    6
      *
     C                     MOVE PKYM      WWYM
     C                     MOVE PKYM      @WYM
     C                     MOVE PGYM      GWYM
      *
     C           STP1      TAG
     C                     EXFMTAKBPW201
     C                     SETOF                     0199
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           IPAS      IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C                     EXSR #KAD
     C                     EXSR #GKAD
      *
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ AKBPP011                 10
I0001C           *IN10     IFEQ '0'
I0002C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
I0002C                     ELSE
I0003C           *DATE     IFGE L1UKHZ
     C           *DATE     ANDLTL1STHZ
      *
     C                     MOVE *BLANK    KKHN1   5
     C                     MOVE *BLANK    KKHN2   5
     C                     MOVE *BLANK    KKHN3   2
     C                     Z-ADD0         KUKOJ   40
     C                     MOVE *BLANK    KUKER   4
     C                     MOVE L1SHN1    KKHN1
     C                     MOVE L1SHN2    KKHN2
     C                     MOVE L1SHN3    KKHN3
     C                     Z-ADDL1UKOJ    KUKOJ
     C                     MOVE L1UKER    KUKER
     C                     MOVE *BLANK    CFLG    1
     C                     EXSR #SHN
      *
     C                     Z-ADD0         WKTSU   90
     C                     Z-ADD0         WKTS1   90
     C           WGEKN     DIV  WCD,1     WKTS1     H
     C                     Z-ADDWKTS1     WKTSU
      *
     C                     EXSR #MAI
     C                     Z-ADD0         WMAI1   50
     C                     Z-ADDWMAIS     WMAI1
      *
     C                     Z-ADD0         WPASW   51
     C           L1KMAX    IFNE 0
     C           WMAI1     DIV  L1KMAX    WKNO    63H
     C           WKNO      MULT 100       WPASW
     C                     END
     C           100       SUB  IPAS      WPAS1   41
     C           100       ADD  IPAS      WPAS2   41
      *
     C                     MOVE *BLANK    WPASKW  1
I0004C           WPASW     IFGE WPAS1
     C           WPASW     ANDLEWPAS2
I0004C                     ELSE
      *
     C                     MOVE '+'       WPASKW
     C           WPASW     IFLT WPAS1
     C                     MOVE '-'       WPASKW
     C                     END
      *
     C                     MOVE '*'       CFLG
     C                     EXSR #SHN
      *
     C                     DIV  WCD,2     WNAJ1     H
     C                     Z-ADDWNAJ1     WKTSU
     C                     EXSR #MAI
     C                     Z-ADD0         WMAI2   50
     C                     Z-ADDWMAIS     WMAI2
      *
     C                     DIV  WCD,3     WNAJ2     H
     C                     Z-ADDWNAJ2     WKTSU
     C                     EXSR #MAI
     C                     Z-ADD0         WMAI3   50
     C                     Z-ADDWMAIS     WMAI3
      *
     C                     DIV  GCD       WJISE     H
     C                     Z-ADDWJISE     WKTSU
     C                     EXSR #MAI
     C                     Z-ADD0         WMAI4   50
     C                     Z-ADDWMAIS     WMAI4
      *
     C                     EXCPTDAT
      *
I0004C                     END
      *
I0003C                     END
I0002C                     END
I0001C                     END
     C  N10                ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------*
      *          月間設定数                               *
      *-----------------------------------------------------*
     C           #SHN      BEGSR
     C                     Z-ADD0         WGESU  110
     C                     Z-ADD0         WGEKN  150
     C                     Z-ADD0         WJISE   90
     C                     Z-ADD0         WNAJ1   90
     C                     Z-ADD0         WNAJ2   90
     C           KEY1      KLIST
     C                     KFLD           KKHN1
     C                     KFLD           KKHN2
     C                     KFLD           KKHN3
     C                     KFLD           KUKOJ
     C                     KFLD           KUKER
     C           KEY1      SETLLAEBPL021
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEAEBPL021                 11
     C           *IN11     IFEQ '0'
     C           AFSKJY    IFEQ 'D'
     C           AFSKHZ    ANDLE*DATE
     C                     ELSE
     C           AFSKSU    MULT AFGEKN    WGESU
     C                     ADD  WGESU     WGEKN
     C                     MOVE *BLANK    KSHN1   5
     C                     MOVE *BLANK    KSHN2   5
     C                     MOVE *BLANK    KSHN3   2
     C                     MOVE AFSHN1    KSHN1
     C                     MOVE AFSHN2    KSHN2
     C                     MOVE AFSHN3    KSHN3
     C           CFLG      IFEQ '*'
     C                     EXSR #JIS
     C                     END
     C                     END
     C                     END
     C  N11                ENDDO
     C           ESHN      ENDSR
      *-----------------------------------------------------*
      *               実績・内示数                        *
      *-----------------------------------------------------*
     C           #JIS      BEGSR
     C                     Z-ADD0         WGOKE   70
     C           KEY2      KLIST
     C                     KFLD           KSHN1
     C                     KFLD           KSHN2
     C                     KFLD           KSHN3
     C           KEY2      SETLLMBEPL021
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY2      READEMBEPL021                 12
     C           *IN12     IFEQ '0'
     C           F2SKJY    IFEQ *BLANK
     C                     ADD  F2GOKE    WGOKE
     C                     END
     C                     END
     C  N12                END
     C                     MULT AFSKSU    WGOKE
     C                     ADD  WGOKE     WJISE
      *
     C                     Z-ADD0         WN1SU   90
     C                     Z-ADD0         WN2SU   90
     C           KEY3      KLIST
     C                     KFLD           KSHN1
     C                     KFLD           KSHN2
     C                     KFLD           KSHN3
     C                     KFLD           @WYM
     C                     SETOF                     12
     C           KEY3      CHAINABBPL211             12
     C           *IN12     IFEQ '1'
     C                     Z-ADDAFGEKN    WN1SU
     C                     Z-ADDAFGEKN    WN2SU
     C                     ELSE
      *
     C           U1NGKB    IFEQ 'N'
     C                     Z-ADDU1N1NM    WN1SU
     C                     Z-ADDU1N2NM    WN2SU
     C                     ELSE
     C                     Z-ADDU1S1NM    WN1SU
     C                     Z-ADDU1S2NM    WN2SU
     C                     END
     C                     END
      *
     C                     MULT AFSKSU    WN1SU
     C                     ADD  WN1SU     WNAJ1
     C                     MULT AFSKSU    WN2SU
     C                     ADD  WN2SU     WNAJ2
     C           EJIS      ENDSR
      *-----------------------------------------------------*
      *                   稼動日                          *
      *-----------------------------------------------------*
     C           #KAD      BEGSR
     C                     Z-ADD0         WCD
     C                     Z-ADD1         @X      10
     C           KEY4      KLIST
     C                     KFLD           WKYY
     C                     KFLD           WKMM
     C                     Z-ADDWWYM      WKYM
     C                     MOVE *BLANK    WNN     1
     C           1         DO   3         @X
      *
     C           @X        IFGE 2
     C                     ADD  1         WWMM
     C           WWMM      IFGT 12
     C           WNN       IFEQ *BLANK
     C                     MOVE '*'       WNN
     C           WWYY      ADD  1         WKYY
     C                     END
     C           WWMM      SUB  12        WKMM
     C                     END
     C                     END
      *
     C           KEY4      SETLLAGDPL121
      *
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY4      READEAGDPL121                 12
     C           *IN12     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         WCD,@X
     C                     ELSE
      *
     C                     ADD  0.5       WCD,@X
     C                     END
      *
     C                     END
     C                     END
     C  N12                ENDDO
     C                     ENDDO
      *
     C           EKAD      ENDSR
      *-----------------------------------------------------*
      *                   月報稼動                        *
      *-----------------------------------------------------*
     C           #GKAD     BEGSR
      *
     C                     Z-ADDGWYM      WKYM
      *
     C                     Z-ADD0         GCD     31
     C           KEY4      SETLLAGDPL121
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY4      READEAGDPL121                 12
     C           *IN12     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         GCD
     C                     ELSE
      *
     C                     ADD  0.5       GCD
     C                     END
      *
     C                     END
     C                     END
     C  N12                ENDDO
      *
     C           EGKAD     ENDSR
      *-----------------------------------------------------*
      *              かんばん枚数                         *
      *-----------------------------------------------------*
     C           #MAI      BEGSR
     C                     MOVE *BLANK    ASTLR   2
     C                     Z-ADD0         WMAIS   50
     C           ACALL     PLIST
     C                     PARM           ASTLR            SETON LR ﾍｭcﾆg
     C                     PARM           WMAIS            f]ﾌﾞ]ubﾇc
     C                     PARM           WKTSU            fhmbﾍajﾒﾇc
     C                     PARM           L1SYOS           ﾆｬcﾑcﾇc
     C                     PARM           L1LTIM           ﾒｰnﾞjbw
     C                     PARM           L1ROTO           ﾜｮn
     C                     PARM           L1KISU           ﾌﾞ[lgibﾇc
     C                     PARM           L1UZAR           kｭcﾈbubﾇc
     C                     PARM           L1HITO           anﾃcmbﾍgnﾒ
     C                     CALL 'ABCR16'  ACALL
     C           EMAI      ENDSR
      *-----------------------------------------------------*
     OAKBWP201E                DAT
     O                         L1UKOJ     4
     O                         L1BMON     8
     O                         WPASKW     9
     O                         WPASW     14
     O                         L1TKR1    15
     O                         L1TKR2    17
     O                         L1TKR3    19
     O                         L1TKR4    20
     O                         WMAI1     25
     O                         L1KMAX    30
     O                         WNAJ1     39
     O                         WNAJ2     48
     O                         L1SYOS    54
     O                         WJISE     63
     O                         L1SHN1    68
     O                         L1SHN2    73
     O                         L1SHN3    75
     O                         WKTS1     84
     O                         L1KTSU    93
     O                         WMAI2     98
     O                         WMAI3    103
     O                         WMAI4    108
** ER
ER-01 +- IS NOT INPUT.
