     H            Y.
     F** AKBR16 ************************************
     F*   COMPONETS KANBAN                         *
     F*       RE-ISSUE                             *
      *
      *   23/02/04   TCH
      * TCHK1 02/11/11 ADD LOT MANAGEMENT MASTER
      * TCHK2 09/15/11 ADD LOT SIZE FOR WORK-FILE
      * TCHK3 09/19/12 CHG LOT SIZE FOR WORK-FILE FOR RKMETAL
      * TCHK4 02/19/14 CHG L1SYOS=ZERO
     F************************************ KABR14 **
     FAKBPW16 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FAKBPL01 IF  E           K        DISK
     FADHPL03 IF  E           K        DISK
     FGCKPL21 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
TCHK1FGDMPL10 IF  E           K        DISK
     FAKBWP11AO   F     110            DISK
      *------------------------------------------------------------
     E                    CMD     1   2 78
     E                    MSG     1   1 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      *
     I            DS
     I                                        1  16 WKNAME
     I            DS
     I                                        1  15 WKBARC
     I                                        1   1 STRBAR
     I                                        2  14 BARSET
     I                                       15  15 ENDBAR
     I            DS
     I                                        1  13 WKEDIT
     I                                        1   10WKKSKB
     I                                        2   5 WKZETI
     I                                        6   90WKBMON
     I                                       10  10 WKKCD1
     I                                       11  130WKSTNO
      *
     I            DS
     I                                        1   80HYMD8
     I                                        1   40HY
     I                                        5   60HM
     I                                        7   80HD
      *
     I            DS
     I                                        1   60@TIME
     I                                        1   20TIMEH
     I                                        3   40TIMES
      *
     I            DS
     I                                        1  14 @SHIN
     I                                        1   5 W1SHN1
     I                                        6   6 WKF1
     I                                        7  11 W1SHN2
     I                                       12  12 WKF2
     I                                       13  14 W1SHN3
     I            DS
     I                                        1   9 D@LOC
     I                                        1   1 D@LOC1
     I I            '-'                       2   2 D@1
     I                                        3   4 D@LOC2
     I I            '-'                       5   5 D@2
     I                                        6   7 D@LOC3
     I I            '-'                       8   8 D@3
     I                                        9   9 D@LOC4
     I*
     I            DS
     I                                        1   2 J6ATK2
     I                                        1   1 J6ATKX
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *------------------------------------------------------
      *  ENTRY LIST
      *------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
      *------------------------------------------------------
      *  MAIN ROUTINE
      *------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #DSP01
     C           W@ID      CASEQ'02'      #DSP02
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *----------------------------------------------------*
      *   INITIAL  SET                                     *
      *----------------------------------------------------*
     C           *INZSR    BEGSR
      *
     C                     MOVE '1'       P@END
      *
     C           KEYT21    KLIST
     C                     KFLD           #KBMON  40
     C                     KFLD           #KTAIP  1
     C           K#AAP     KLIST
     C                     KFLD           L1JOK6
     C                     KFLD           L1KCD1
      *----------------------------------------------------*
     C                     TIME           @TIME   60
TCHK1C                     TIME           WSDT
TCHK1C                     Z-ADDWSSDAT    HYMD8   80
      *----------------------------------------------------*
     C           K#KEY     KLIST
     C                     KFLD           D@LOC1
     C                     KFLD           D@LOC2
     C                     KFLD           D@LOC3
     C                     KFLD           D@LOC4
     C           K#KEYX    KLIST
     C                     KFLD           S@LOC1
     C                     KFLD           S@LOC2
     C                     KFLD           S@LOC3
     C                     KFLD           S@LOC4
      *
     C                     MOVEL'01'      W@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------------
      *   1ST SCREEN
      *--------------------------------------------------------
     C           #DSP01    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     MOVE '02'      W@ID
     C                     EXSR #SET
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------------
      *   CHECK
      *--------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     MOVEA'00'      *IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
      *
     C                     ENDSR
      *----------------------------------------------------*
      *   SET DATA FOR 2ND SCREEN
      *--------------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
      *
      * AKBPP01
     C           K#KEY     SETLLAKBPL01
     C           *IN90     DOUEQ*ON
     C                     READ AKBPL01                  90
     C           *IN90     IFEQ *OFF
     C           L1SKJY    ANDEQ*BLANK
     C           L1STHZ    ANDEQ99999999
     C                     ADD  1         RRN1
     C                     MOVE L1TKR1    S@LOC1
     C                     MOVE L1TKR2    S@LOC2
     C                     MOVE L1TKR3    S@LOC3
     C                     MOVE L1TKR4    S@LOC4
     C                     MOVE L1SHN1    S@PRT1
     C                     MOVE L1SHN2    S@PRT2
     C                     MOVE L1SHN3    S@PRT3
     C                     Z-ADDL1BMON    S@PLNT
     C                     Z-ADDL1SYOS    S@SYOS
     C           L1SYOS    IFEQ *ZERO
     C                     Z-ADD*ZERO     S@SETQ
     C                     ELSE
     C           L1KTSU    DIV  L1SYOS    S@SETQ
     C                     EXSR #SUB01
     C                     END
     C                     Z-ADDL1KMAX    S@MAX
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      * ADHPP01
     C           K#KEY     SETLLADHPL03
     C           *IN90     DOUEQ*ON
     C                     READ ADHPL03                  90
     C           *IN90     IFEQ *OFF
     C           J6SKJY    ANDEQ*BLANK
     C           J6STHZ    ANDEQ99999999
     C           J6ATKX    ANDEQ'R'
     C                     ADD  1         RRN1
     C                     MOVE J6ATK1    S@LOC1
     C                     MOVE J6ATK2    S@LOC2
     C                     MOVE J6ATK3    S@LOC3
     C                     MOVE J6ATK4    S@LOC4
     C                     MOVE J6SHN1    S@PRT1
     C                     MOVE J6SHN2    S@PRT2
     C                     MOVE J6SHN3    S@PRT3
     C                     Z-ADDJ6ATOB    S@PLNT
     C                     Z-ADDJ6SYOS    S@SYOS
     C           J6SYOS    IFEQ *ZERO
     C                     Z-ADD*ZERO     S@SETQ
     C                     ELSE
     C           J6KTSU    DIV  20        W@KTSU  90
     C           W@KTSU    DIV  J6SYOS    S@SETQ
     C                     ENDIF
     C                     Z-ADDJ6KMAX    S@MAX
     C                     WRITESFL01
     C                     ENDIF
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     CLEARSFL01
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     Z-ADD1         #RCNO
      *
     C                     ENDSR
TCHK1C*--------------------------------------------------------
TCHK1C*   QPC,SETQ
TCHK1C*--------------------------------------------------------
TCHK1C           #SUB01    BEGSR
TCHK1C*
TCHK1C                     DO
TCHK1C*
TCHK1C           K#GDM     KLIST
TCHK1C                     KFLD           L1SHN1
TCHK1C                     KFLD           L1SHN2
TCHK1C                     KFLD           L1SHN3
TCHK1C           K#GDM     CHAINGDMPL10              91
TCHK1C           *IN91     IFEQ *ON
TCHK1C           M1SKJY    ORNE *BLANK
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C*
TCHK1C           M1LOTN    IFEQ *ZERO
TCHK1C                     LEAVE
TCHK1C                     END
TCHK1C*
TCHK3C           L1BMON    IFEQ 8990
TCHK3C           L1SYOS    MULT M1LOTN    S@SYOS
TCHK3C                     ELSE
TCHK3C                     Z-ADDL1SYOS    S@SYOS
TCHK3C                     END
TCHK1C           L1KTSU    DIV  S@SYOS    S@SETQ
TCHK1C*
TCHK1C                     ENDDO
TCHK1C*
TCHK1C                     ENDSR
      *--------------------------------------------------------
      *   2NC SCREEN
      *--------------------------------------------------------
     C           #DSP02    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
     C                     Z-ADD@@REC     #RCNO
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     MOVE '01'      W@ID
     C                     EXSR #WRT
     C                     MOVE MSG,1     D@MSG
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #CHK2     BEGSR
      *--------------------------------------------------------
     C                     MOVEA'00'      *IN,61
     C                     MOVE *OFF      *IN99
     C                     MOVE *BLANK    D@MSG
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C                     MOVEA'00'      *IN,61
     C           S@FROM    IFGT S@MAIS
     C                     SETON                     616299
     C                     Z-ADD@@RRN     #RCNO
     C                     ENDIF
     C                     UPDATSFL01
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #WRT      BEGSR
      *--------------------------------------------------------
     C                     Z-ADD*ZERO     @@RRN   40
     C           *IN90     DOUEQ*ON
     C                     ADD  1         @@RRN
     C           @@RRN     CHAINSFL01                90
     C           *IN90     IFEQ *OFF
     C           S@MAIS    ANDGT*ZERO
      *
     C                     MOVEL*BLANK    @SHIN
     C                     MOVELS@PRT1    W1SHN1
     C                     MOVELS@PRT2    W1SHN2
     C                     MOVELS@PRT3    W1SHN3
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           W1SHN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
      *
     C           K#KEYX    SETLLAKBPL01
     C           *IN90     DOUEQ*ON
     C           K#KEYX    READEAKBPL01                  90
     C           *IN90     IFEQ *OFF
     C           L1SKJY    ANDEQ*BLANK
     C           L1STHZ    ANDEQ99999999
     C                     EXSR #OUT
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C           K#KEYX    SETLLADHPL03
     C           *IN90     DOUEQ*ON
     C           K#KEYX    READEADHPL03                  90
     C           *IN90     IFEQ *OFF
     C           J6SKJY    ANDEQ*BLANK
     C           J6STHZ    ANDEQ99999999
     C           J6ATKX    ANDEQ'R'
     C                     EXSR #OUT2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #OUT      BEGSR
      *--------------------------------------------------------
      *
     C                     SETOF                     21
     C                     Z-ADDL1BMON    #KBMON
     C                     MOVE L1TAIP    #KTAIP
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVELT2NAMN    WKNAME
     C                     END
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           L1SHN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
TCHK1C                     Z-ADDS@SYOS    WKSYOS  60
     C                     Z-ADDL1LTIM    WKLTIM  31
     C                     MOVE L1SYOT    WKSYOT  1
     C                     MOVE L1TKRO    WKTKRO  6
TCHK2C                     Z-ADDL1ROTO    WKROTO  20
TCHK2C           WKROTO    IFEQ *ZERO
TCHK2C                     Z-ADD1         WKROTO
TCHK2C                     END
      * A CIRCULATION
     C                     Z-ADDS@FROM    WKHKNO  30
     C           S@FROM    IFEQ 0
     C                     Z-ADD1         WKHKNO
     C                     END
      *
     C                     Z-ADDS@MAIS    WKHMAS  30
      *
     C           WKHMAS    IFNE *ZERO
     C                     MOVE '1'       WKCON   1
     C                     MOVE *BLANK    NAME   16
     C                     Z-ADD1         WKSTNO  30
     C                     Z-ADD1         WKEDNO  30
     C                     MOVE *BLANK    WKBARC
     C                     EXCPTFILE
     C                     MOVE *BLANK    WKCON
     C                     SETON                       U1
     C                     END
      *
      *DIVIDE BY KANBAN SHEETS
     C                     SETOF                       22
     C                     DO   *HIVAL
     C                     MOVE WKNAME    NAME   16
     C                     MOVE '2'       WKCON   1
     C                     SUB  1         WKHMAS         22
     C                     Z-ADDWKHKNO    WKSTNO
     C                     Z-ADDL1KMAX    WKEDNO
      *
     C                     MOVE *BLANK    BARSET
      *
     C                     Z-ADDL1KSKB    WKKSKB
     C                     MOVE L1ZETI    WKZETI
     C                     Z-ADDL1BMON    WKBMON
     C                     MOVE L1KCD1    WKKCD1
      *
     C                     MOVE WKEDIT    BARSET
     C                     MOVE '*'       STRBAR
     C                     MOVE '*'       ENDBAR
      *
     C                     MOVE *BLANK    W22    22
     C           L1JOK6    IFNE *BLANK
     C           K#AAP     CHAINAAAPL01              90
     C           *IN90     IFEQ *OFF
     C           '('       CAT  A5JOKM:1  W22       P
     C           W22       CAT  ')':1     W22       P
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXCPTFILE
     C                     MOVE *BLANK    P@END
     C                     ADD  1         WKHKNO
     C  N22                END
      *
     C                     MOVE *BLANK    WKCON
      *
     C                     ENDSR
      *----------------------------------------------------*
     C           #OUT2     BEGSR
      *--------------------------------------------------------
     C                     SETOF                     21
     C                     Z-ADDJ6ATOB    #KBMON
     C                     MOVE J6ATYP    #KTAIP
     C           KEYT21    CHAINGCKPL211             21
     C           *IN21     IFEQ '0'
     C           T2SKJY    ANDEQ'D'
     C           T2SKHZ    ANDLEHYMD8
     C                     SETON                     21
     C                     END
     C           *IN21     IFEQ '0'
     C                     MOVELT2NAMN    WKNAME
     C                     END
      *
     C                     MOVE '-'       WKF1
     C                     MOVE '-'       WKF2
     C           J6SHN3    IFEQ *BLANK
     C                     MOVE *BLANK    WKF2
     C                     END
TCHK1C                     Z-ADDS@SYOS    WKSYOS  60
     C                     Z-ADDJ6TOLT    WKLTIM  31
     C                     MOVE J6SYOT    WKSYOT  1
     C                     MOVE J6ATKR    WKTKRO  6
TCHK2C                     Z-ADDJ6LOTO    WKROTO  20
TCHK2C           WKROTO    IFEQ *ZERO
TCHK2C                     Z-ADD1         WKROTO
TCHK2C                     END
      * A CIRCULATION
     C                     Z-ADDS@FROM    WKHKNO  30
     C           S@FROM    IFEQ 0
     C                     Z-ADD1         WKHKNO
     C                     END
      *
     C                     Z-ADDS@MAIS    WKHMAS  30
      *
     C           WKHMAS    IFNE *ZERO
     C                     MOVE '1'       WKCON   1
     C                     MOVE *BLANK    NAME   16
     C                     Z-ADD1         WKSTNO  30
     C                     Z-ADD1         WKEDNO  30
     C                     MOVE *BLANK    WKBARC
     C                     EXCPTFILE
     C                     MOVE *BLANK    WKCON
     C                     SETON                       U1
     C                     END
      *
      *DIVIDE BY KANBAN SHEETS
     C                     SETOF                       22
     C                     DO   *HIVAL
     C                     MOVE WKNAME    NAME   16
     C                     MOVE '2'       WKCON   1
     C                     SUB  1         WKHMAS         22
     C                     Z-ADDWKHKNO    WKSTNO
     C                     Z-ADDJ6KMAX    WKEDNO
      *
     C                     MOVE *BLANK    BARSET
      *
     C                     Z-ADDJ6KSNK    WKKSKB
     C                     MOVE J6ZETI    WKZETI
     C                     Z-ADDJ6ATOB    WKBMON
     C                     MOVE J6KCD1    WKKCD1
      *
     C                     MOVE WKEDIT    BARSET
      *
     C                     MOVE '*'       STRBAR
     C                     MOVE '*'       ENDBAR
      *
     C                     MOVE *BLANK    W22    22
      *
     C                     EXCPTFILE
     C                     MOVE *BLANK    P@END
     C                     ADD  1         WKHKNO
     C  N22                END
      *
     C                     MOVE *BLANK    WKCON
      *
     C                     ENDSR
      *----------------------------------------------------*
     OAKBWP11AE                FILE
     O                         WKCON      1
     O                         WKSTNO     4
     O                         WKEDNO     7
     O                         NAME      23
     O                         @SHIN     37
     O                         WKBARC    52
     O                         WKLTIM    55
     O                         WKSYOS    61
     O                         WKSYOT    62
     O                         WKTKRO    68
     O                         HYMD8     76
     O                         W22       98
     O                         S@MAIS   101
TCHK2O                         WKROTO   103
** CMD
   F1:END
   F1:END      F5:ISSUE       F12:GO BACK
** MSG
DATA IS READY FOR KANBAN. CLOSE THE PROGRAM GO TO PC FOR PRINTING.
