     H            Y.
     F** AKCR03 ************************************
     F* ..WHEN COMPONENT CONNECTION M/F CANCEL, IT DELETE *.
     F* I-HASADA                    95.09.11       *
     F************************************ AKCR03 **
     FAKEPL01 IF  E           K        DISK
     FAKDPL02 IF  E           K        DISK
     FAKHPL06 UF  E           K        DISK
     FAAJPL11 UF  E           K        DISK
     FAKBPL01 UF  E           K        DISK
     FAKGPL01 UF  E           K        DISK
     FAKIPL01 UF  E           K        DISK
     E                    SKO        15  3               新工程
     E                    SBM        15  4 0             新部門
     E                    SBN        15  6               新番地
     E                    SDH        15 12               新代表品番
     E                    SKB        15  1               新かんばん種類
     I            DS
     I                                        1  45 SKO
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600SBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I            DS
     I                                        1  90 SBN
     I                                        1   6 M3NB01
     I                                        7  12 M3NB02
     I                                       13  18 M3NB03
     I                                       19  24 M3NB04
     I                                       25  30 M3NB05
     I                                       31  36 M3NB06
     I                                       37  42 M3NB07
     I                                       43  48 M3NB08
     I                                       49  54 M3NB09
     I                                       55  60 M3NB10
     I                                       61  66 M3NB11
     I                                       67  72 M3NB12
     I                                       73  78 M3NB13
     I                                       79  84 M3NB14
     I                                       85  90 M3NB15
     I            DS
     I                                        1  15 SKB
     I                                        1   1 M3TY01
     I                                        2   2 M3TY02
     I                                        3   3 M3TY03
     I                                        4   4 M3TY04
     I                                        5   5 M3TY05
     I                                        6   6 M3TY06
     I                                        7   7 M3TY07
     I                                        8   8 M3TY08
     I                                        9   9 M3TY09
     I                                       10  10 M3TY10
     I                                       11  11 M3TY11
     I                                       12  12 M3TY12
     I                                       13  13 M3TY13
     I                                       14  14 M3TY14
     I                                       15  15 M3TY15
     I            DS
     I                                        1  12 WKHIN
     I                                        1   5 WKHN1
     I                                        6  10 WKHN2
     I                                       11  12 WKHN3
     I            DS
     I                                        1  12 WDHIN
     I                                        1   5 WDHN1
     I                                        6  10 WDHN2
     I                                       11  12 WDHN3
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1  12 M2JHIN
     I                                        1   5 M2JHN1
     I                                        6  10 M2JHN2
     I                                       11  12 M2JHN3
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1   80M5SKHZ
     I                                        1   40M5SKYY
     I                                        5   60M5SKMM
     I                                        7   80M5SKDD
     I            DS
     I                                        1   80M5KOHZ
     I                                        1   40M5KOYY
     I                                        5   60M5KOMM
     I                                        7   80M5KODD
     I            DS
     I                                        1   60M5TIME
     I                                        1   20M5KOHH
     I                                        3   40M5KOSS
     I            DS
     I                                        1   80L1SKHZ
     I                                        1   40L1SKYY
     I                                        5   60L1SKMM
     I                                        7   80L1SKDD
     I            DS
     I                                        1   80L1KOHZ
     I                                        1   40L1KOYY
     I                                        5   60L1KOMM
     I                                        7   80L1KODD
     I            DS
     I                                        1   60L1TIME
     I                                        1   20L1KOHH
     I                                        3   40L1KOSS
     I            DS
     I                                        1   80E1SKHZ
     I                                        1   40E1SKYY
     I                                        5   60E1SKMM
     I                                        7   80E1SKDD
     I            DS
     I                                        1   80E1KOHZ
     I                                        1   40E1KOYY
     I                                        5   60E1KOMM
     I                                        7   80E1KODD
     I            DS
     I                                        1   60E1TIME
     I                                        1   20E1KOHH
     I                                        3   40E1KOSS
     I            DS
     I                                        1   80E2SKHZ
     I                                        1   40E2SKYY
     I                                        5   60E2SKMM
     I                                        7   80E2SKDD
     I            DS
     I                                        1   80E2KOHZ
     I                                        1   40E2KOYY
     I                                        5   60E2KOMM
     I                                        7   80E2KODD
     I            DS
     I                                        1   60E2TIME
     I                                        1   20E2KOHH
     I                                        3   40E2KOSS
      *
     C           KEY1      KLIST
     C                     KFLD           WKHN1
     C                     KFLD           WKHN2
     C                     KFLD           WKHN3
      *
     C           KEY2      KLIST
     C                     KFLD           WDHN1
     C                     KFLD           WDHN2
     C                     KFLD           WDHN3
     C                     KFLD           WKOTI
     C                     KFLD           WBMON
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEY3      KLIST
     C                     KFLD           WDHN1
     C                     KFLD           WDHN2
     C                     KFLD           WDHN3
     C                     KFLD           WKDAI
      *
     C           KEY4      KLIST
     C                     KFLD           M5NTK1
     C                     KFLD           M5NTK2
     C                     KFLD           M5NTK3
     C                     KFLD           M5NTK4
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PKHIN  12
     C                     MOVE PKHIN     WKHIN
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C                     SETOF                     10
     C           KEY1      CHAINAKEPL011             10
     C           *IN10     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     Z-ADD1         A       20
     C           1         DO   15        A
     C           SKB,A     IFEQ '3'
     C           SKB,A     OREQ 'P'
     C           SKB,A     OREQ 'Q'
      *
     C                     MOVE SDH,A     WDHIN
     C                     MOVE SKO,A     WKOTI   3
     C                     Z-ADDSBM,A     WBMON   40
     C                     MOVE SBN,A     WTKRO
     C                     MOVE SKB,A     WKDAI   1
      *
     C*--------------------------------*
     C*  ..構成品番　工程マスター..  *
     C*--------------------------------*
     C                     SETOF                     10
     C           KEY2      SETLLAKDPL021
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY2      READEAKDPL021                 11
     C           *IN11     IFEQ '0'
     C           M2JHIN    IFNE WKHIN
     C                     SETON                     10
     C                     END
     C                     END
     C  N11                END
      *
     C           *IN10     IFEQ '0'
      *
     C*------------------------------------------*
     C*  ..構成品番工程　所番地登録マスター..  *
     C*------------------------------------------*
     C           KEY3      SETLLAKHPL061
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY3      READEAKHPL061                 11
     C           *IN11     IFEQ '0'
     C           M5SKJY    IFEQ 'D'
     C           M5SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     MOVE 'D'       M5SKJY
     C                     Z-ADD*DATE     M5SKHZ
     C                     Z-ADD*DATE     M5KOHZ
     C                     TIME           M5TIME
     C                     MOVELPUS       M5KOME
     C                     UPDATAKHPL061
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C           KEY4      SETGTAAJPL111
     C                     SETOF                     12
     C           KEY4      REDPEAAJPL111                 12
     C           *IN12     IFEQ '0'
     C                     MOVE *BLANK    CJHIN1
     C                     MOVE *BLANK    CJHIN2
     C                     MOVE *BLANK    CJHIN3
     C                     Z-ADD0         CJSYUY
     C                     MOVE *BLANK    CJMBN1
     C                     MOVE *BLANK    CJMBN2
     C                     MOVE *BLANK    CJMBN3
     C                     MOVE *BLANK    CJMBN4
     C                     Z-ADD0         CJSLOT
     C                     Z-ADD*DATE     CJAKHZ
     C                     UPDATAAJPL111
     C                     END
      *
     C           M5KDAI    IFEQ '3'
     C                     EXSR SUBR3
     C                     END
      *
     C           M5KDAI    IFEQ 'P'
     C                     EXSR SUBRP
     C                     END
      *
     C           M5KDAI    IFEQ 'Q'
     C                     EXSR SUBRQ
     C                     END
      *
     C                     END
     C                     END
     C  N11                END
      *
     C                     END
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*--------------------------------*
     C*  ..サブルーチン..            *
     C*  ..構成品かんばんマスター    *
     C*--------------------------------*
     C           SUBR3     BEGSR
      *
     C           KEY4      SETLLAKBPL011
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY4      READEAKBPL011                 12
      *
     C           *IN12     IFEQ '0'
     C           L1SKJY    IFEQ 'D'
     C           L1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     MOVE 'D'       L1SKJY
     C                     Z-ADD*DATE     L1SKHZ
     C                     Z-ADD*DATE     L1KOHZ
     C                     TIME           L1TIME
     C                     MOVE PUS       L1KOME
     C                     MOVE '0'       L1DTKO
     C                     UPDATAKBPL011
      *
     C                     END
     C                     END
     C  N12                END
      *
     C                     ENDSR
      *
      *
     C*--------------------------------------*
     C*  ..サブルーチン..                  *
     C*  ..構成品メッキかんばんマスター    *
     C*--------------------------------------*
     C           SUBRP     BEGSR
      *
     C           KEY4      SETLLAKGPL011
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY4      READEAKGPL011                 12
      *
     C           *IN12     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     MOVE 'D'       E1SKJY
     C                     Z-ADD*DATE     E1SKHZ
     C                     Z-ADD*DATE     E1KOHZ
     C                     TIME           E1TIME
     C                     MOVE PUS       E1KOME
     C                     MOVE '0'       E1DTKO
     C                     UPDATAKGPL011
      *
     C                     END
     C                     END
     C  N12                END
      *
     C                     ENDSR
      *
      *
     C*----------------------------------------*
     C*  ..サブルーチン..                    *
     C*  ..構成品トンネルかんばんマスター    *
     C*----------------------------------------*
     C           SUBRQ     BEGSR
      *
     C           KEY4      SETLLAKIPL011
     C                     DO   *HIVAL
     C                     SETOF                     12
     C           KEY4      READEAKIPL011                 12
      *
     C           *IN12     IFEQ '0'
     C           E2SKJY    IFEQ 'D'
     C           E2SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     MOVE 'D'       E2SKJY
     C                     Z-ADD*DATE     E2SKHZ
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     MOVE '0'       E2DTKO
     C                     UPDATAKIPL011
      *
     C                     END
     C                     END
     C  N12                END
      *
     C                     ENDSR
