     H            Y.
     F** AKCR01 ***************************************************
     F* .. COMPONENT INFORMATION M/F UPDATE                       *
     F* I-HASADA               92.07.23                           *
     F* -------------------------------------                     *
JW2  F* JW        2022.01.03 CHG ERROR MSG                        *
     F*************************************************************
     FAKCPW01 CF  E                    WORKSTN
     FAKCPL01 UF  E           K        DISK         KCOMIT       A
     FAKCPPN1 UF  E                    DISK         KCOMIT
     FAKFPL01 UF  E           K        DISK         KCOMIT
     FAKCPL03 IF  E           K        DISK
     FAKDTP02 IF  E           K        DISK                           UC
     FAKEPL01 IF  E           K        DISK
     FAEBPL11 IF  E           K        DISK
     E                    OKOT       15  3               旧工程
     E                    OKBM       15  4 0             旧部門
     E                    NKOT       15  3               新工程
     E                    NKBM       15  4 0             新部門
     E                    NKMN       15  8 0             更新日
     E                    ER      1  26 60                d[ｰ xｮﾈｰﾆﾞ
     E                    KTD     1   2  1   KTN    20   項目名
     E                    TZN     1  26  1               絶対番号
     I            DS
     I                                        1  45 OKOT
     I                                        1   3 M3QK01
     I                                        4   6 M3QK02
     I                                        7   9 M3QK03
     I                                       10  12 M3QK04
     I                                       13  15 M3QK05
     I                                       16  18 M3QK06
     I                                       19  21 M3QK07
     I                                       22  24 M3QK08
     I                                       25  27 M3QK09
     I                                       28  30 M3QK10
     I                                       31  33 M3QK11
     I                                       34  36 M3QK12
     I                                       37  39 M3QK13
     I                                       40  42 M3QK14
     I                                       43  45 M3QK15
     I            DS
     I                                        1  600OKBM
     I                                        1   40M3QB01
     I                                        5   80M3QB02
     I                                        9  120M3QB03
     I                                       13  160M3QB04
     I                                       17  200M3QB05
     I                                       21  240M3QB06
     I                                       25  280M3QB07
     I                                       29  320M3QB08
     I                                       33  360M3QB09
     I                                       37  400M3QB10
     I                                       41  440M3QB11
     I                                       45  480M3QB12
     I                                       49  520M3QB13
     I                                       53  560M3QB14
     I                                       57  600M3QB15
     I            DS
     I                                        1  45 NKOT
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600NKBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1 1200NKMN
     I                                        1   80M3MN01
     I                                        9  160M3MN02
     I                                       17  240M3MN03
     I                                       25  320M3MN04
     I                                       33  400M3MN05
     I                                       41  480M3MN06
     I                                       49  560M3MN07
     I                                       57  640M3MN08
     I                                       65  720M3MN09
     I                                       73  800M3MN10
     I                                       81  880M3MN11
     I                                       89  960M3MN12
     I                                       97 1040M3MN13
     I                                      105 1120M3MN14
     I                                      113 1200M3MN15
     I            DS
     I                                        1   80M4KOHZ
     I                                        1   40M4KOYY
     I                                        5   60M4KOMM
     I                                        7   80M4KODD
     I            DS
     I                                        1   60M4TIME
     I                                        1   20M4KOHH
     I                                        3   40M4KOSS
     I            DS
     I                                        1   80M1SKHZ
     I                                        1   40M1SKYY
     I                                        5   60M1SKMM
     I                                        7   80M1SKDD
     I            DS
     I                                        1   80M1KOHZ
     I                                        1   40M1KOYY
     I                                        5   60M1KOMM
     I                                        7   80M1KODD
     I            DS
     I                                        1   60M1TIME
     I                                        1   40M1KOHS
     I                                        1   20M1KOHH
     I                                        3   40M1KOSS
     I            DS
     I                                        1  12 M1KHIN
     I                                        1   5 M1KHN1
     I                                        6  10 M1KHN2
     I                                       11  12 M1KHN3
     I            DS
     I                                        1   80M1TAHZ
     I                                        1   40M1TAYY
     I                                        5   60M1TAMM
     I                                        7   80M1TADD
     I            DS
     I                                        1   80M1SYHZ
     I                                        1   40M1SYYY
     I                                        5   60M1SYMM
     I                                        7   80M1SYDD
     I            DS
     I                                        1  14 WKHIN
     I                                        1   5 WKHN1
     I                                        6   6 H1
     I                                        7  11 WKHN2
     I                                       12  12 H2
     I                                       13  14 WKHN3
     I            DS
     I                                        1   4 K7ZENO
     I                                        1   1 K7ZN01
     I                                        2   40K7ZN24
     I            DS
     I                                        1  12 N9SHIN
     I                                        1   5 N9SHN1
     I                                        6  10 N9SHN2
     I                                       11  12 N9SHN3
     C           KEY1      KLIST
     C                     KFLD           M1KHN1
     C                     KFLD           M1KHN2
     C                     KFLD           M1KHN3
      *
     C           KEY2      KLIST
     C                     KFLD           N9SHN1
     C                     KFLD           N9SHN2
     C                     KFLD           N9SHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10
      *
     C           AAAV2     PLIST
     C                     PARM           N9SHN1
     C                     PARM           N9SHN2
     C                     PARM           N9SHN3
      *
     C           AAAG1     PLIST
     C                     PARM           XKOSN   1
     C                     PARM           US
     C                     PARM           M1KHIN
     C                     PARM           POSRY   9
     C                     PARM           PNSRY   9
     C                     PARM           POUT    1
     C                     PARM           PCMD    1
     C                     PARM           WUTHZ   8
     C                     PARM           PPHIN  12
      *
     C           AAAG2     PLIST
     C                     PARM           XKOSN
     C                     PARM           US
     C                     PARM           M1KHIN
     C                     PARM           POSRY   9
     C                     PARM           PNSRY   9
     C                     PARM           POUT
      *
     C           AAAG3     PLIST
     C                     PARM           US
     C                     PARM           WKOSN
     C                     PARM           M1KHIN
      *
     C           AAAG4     PLIST
     C                     PARM           US
     C                     PARM           M1KHIN
      *
     C                     Z-ADD0         M1SKHZ
     C                     Z-ADD0         M1KOHZ
     C                     Z-ADD0         M1KOHS
      *
     C*------------------*
     C*  ..画面－１..  *
     C*------------------*
     C           SG11      TAG
     C                     EXFMTAKCPW011
     C                     SETOF                     0599
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     MOVE *BLANK    WKOSN
     C                     MOVE *BLANK    M1KHIN
      *
     C*--------------*
     C*  ..項目..  *
     C*--------------*
     C                     SETOF                     50
     C                     Z-ADD1         A       10
     C           WKOUM     LOKUPKTD,A                    50
     C           *IN50     IFEQ '0'
     C                     SETON                     0599
     C                     MOVE ER,1      MSG
     C                     GOTO SG11
     C                     END
     C                     MOVE KTN,A     WKONM
      *
     C*------------------*
     C*  ..画面－２..  *
     C*------------------*
     C           SG21      TAG
     C                     EXFMTAKCPW012
     C                     SETOF                     060713
     C                     SETOF                     159099
      *
     C                     MOVE *BLANK    WMEKI   7
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    WKOUM
     C                     GOTO SG11
     C                     END
      *
     C*------------------*
     C*  ..更新区分..  *
     C*------------------*
     C           WKOSN     IFNE '0'
     C           WKOSN     ANDNE'1'
     C           WKOSN     ANDNE'2'
     C                     SETON                     0699
     C                     MOVE ER,2      MSG
     C                     GOTO SG21
     C                     END
      *
     C           WKOSN     IFEQ '2'
     C           WKOUM     ANDNE'2'
     C                     SETON                     99
     C                     MOVE ER,3      MSG
     C                     GOTO SG21
     C                     END
      *
     C           WKOSN     IFEQ '0'
     C           WKOUM     ANDNE'2'
     C                     SETON                     99
     C                     MOVE ER,4      MSG
     C                     GOTO SG21
     C                     END
      *
     C           WKOSN     IFEQ '0'
     C                     SETON                     90
     C                     MOVE 'CANCEL'  WNAME
     C                     END
     C           WKOSN     IFEQ '1'
     C                     MOVE 'CHANGE'  WNAME
     C                     END
     C           WKOSN     IFEQ '2'
     C                     MOVE 'ADD   '  WNAME
     C                     END
      *
     C*--------------*
     C*  ..品番..  *
     C*--------------*
     C           M1KHIN    IFEQ *BLANK
     C                     SETON                     0799
     C                     MOVE ER,5      MSG
     C                     GOTO SG21
     C                     END
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     60
     C           KEY1      CHAINAKCPL011             60
     C           WKOSN     IFEQ '2'
     C           *IN60     IFEQ '0'
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     GOTO SG22
     C                     END
     C                     SETON                     060799
     C                     MOVE ER,6      MSG
     C                     GOTO SG21
     C                     END
     C                     END
      *
     C           WKOSN     IFEQ '1'
     C           *IN60     IFEQ '1'
     C                     SETON                     060799
     C                     MOVE ER,7      MSG
     C                     GOTO SG21
     C                     END
      *
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     060799
     C                     MOVE ER,8      MSG
     C                     GOTO SG21
     C                     END
     C                     END
      *
     C           WKOSN     IFEQ '0'
     C           *IN60     IFEQ '1'
     C                     SETON                     060799
     C                     MOVE ER,9      MSG
     C                     GOTO SG21
     C                     END
      *
     C           M1SKJY    IFEQ 'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     060799
     C                     MOVE ER,10     MSG
     C                     GOTO SG21
     C                     END
     C                     END
     C           SG22      TAG
      *
     C           WKOSN     IFEQ '2'
     C                     MOVE *BLANK    M1SKJY
     C                     Z-ADD0         M1SKHZ
     C                     Z-ADD0         M1TAHZ
     C                     Z-ADD0         M1KASI
     C                     MOVE *BLANK    M1KAST
     C                     MOVE *BLANK    M1MEKI
     C                     MOVE *BLANK    M1MMEI
     C                     Z-ADD0         M1KSYS
     C                     MOVE *BLANK    M1KSYT
     C                     Z-ADD0         M1SSYS
     C                     MOVE *BLANK    M1SSYT
     C                     Z-ADD0         M1SYHZ
     C                     Z-ADD0         M1GEKN
     C                     MOVE *BLANK    M1ZENO
     C                     MOVE *BLANK    M1TEHI
     C                     MOVE *ZERO     POSRY
     C                     ELSE
      *
     C                     Z-ADDM1SSYS    WSSYS   50
     C                     MOVE M1SSYT    WSSYT   1
     C                     Z-ADDM1KSYS    WKSYS   50
     C                     MOVE M1KSYT    WKSYT   1
     C                     MOVE M1MEKI    WMEKI   7
     C                     MOVE M1GEKN    POSRY
     C                     END
      *
     C*------------------------------*
     C*  ..品番  XXXXX-XXXXX-XX..  *
     C*------------------------------*
     C                     MOVE *BLANK    WKHIN
     C                     MOVE M1KHN1    WKHN1
     C                     MOVE M1KHN2    WKHN2
     C                     MOVE M1KHN3    WKHN3
     C           M1KHN2    IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           M1KHN3    IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
      *
     C           WKOUM     IFEQ '1'
     C                     UPDATAKCPL011
     C                     EXSR #SBRT
      *
     C           *IN96     IFEQ '1'
     C                     ROLBK
     C                     ELSE
     C                     COMIT
     C                     END
      *
     C                     MOVE *BLANK    WKOSN
     C                     MOVE *BLANK    M1KHIN
     C                     CALL 'AKCC01'
     C                     GOTO SG21
     C                     END
      *
     C*------------------*
     C*  ..画面－３..  *
     C*------------------*
     C           SG31      TAG
     C**JW1                ENDIF
     C                     EXFMTAKCPW013
     C                     SETOF                     080910
     C                     SETOF                     111214
     C                     SETOF                     161718
     C                     SETOF                     192021
     C                     SETOF                     99
      * F3:
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    WKOSN
     C                     MOVE *BLANK    M1KHIN
     C                     GOTO SG21
     C                     END
      * F6:
     C           *INKF     IFEQ '1'
     C                     SETON                     1315
     C                     GOTO SG31
     C                     END
      *
     C*--------------------*
     C*  ..削除予定日..  *
     C*--------------------*
     C           WKOSN     IFEQ '0'
     C           M1SKHZ    IFEQ 0
     C                     Z-ADD*DATE     M1SKHZ
     C                     END
     C           M1SKYY    IFGE 92
     C           M1SKMM    ANDLE12
     C           M1SKMM    ANDGE01
     C           M1SKDD    ANDLE31
     C           M1SKDD    ANDGE01
     C                     ELSE
     C                     SETON                     2199
     C                     MOVE ER,11     MSG
     C                     GOTO SG31
     C                     END
      *
     C           M1SKHZ    IFGT *DATE
     C                     SETON                     2199
     C                     MOVE ER,12     MSG
     C                     GOTO SG31
     C                     END
     C                     END
      *
     C*----------------*
     C*  ..立上日..  *
     C*----------------*
     C           WKOSN     IFNE '0'
     C           M1TAHZ    IFEQ 0
     C                     Z-ADD*DATE     M1TAHZ
     C                     END
     C           M1TAYY    IFGE 1992
     C           M1TAMM    ANDLE12
     C           M1TAMM    ANDGE01
     C           M1TADD    ANDLE31
     C           M1TADD    ANDGE01
     C                     ELSE
     C                     SETON                     0899
     C                     MOVE ER,13     MSG
     C                     GOTO SG31
     C                     END
      *
     C*------------------*
     C*  ..手配区分..  *
     C*------------------*
     C           M1TEHI    IFNE 'G'
     C           M1TEHI    ANDNE'S'
     C                     SETON                     0999
     C                     MOVE ER,14     MSG
     C                     GOTO SG31
     C                     END
      *
     C*------------------------*
     C*  ..完成単重・単位..  *
     C*------------------------*
     C           M1KASI    IFEQ 0
     C           M1KAST    IFNE *BLANK
     C                     SETON                     1099
     C                     MOVE ER,15     MSG
     C                     GOTO SG31
     C                     END
     C                     ELSE
     C           M1KAST    IFEQ *BLANK
     C                     SETON                     1199
     C                     MOVE ER,16     MSG
     C                     GOTO SG31
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..メッキ処理マスター..  *
     C*----------------------------*
     C           M1MEKI    IFNE *BLANK
     C           M1MEKI    IFNE WMEKI
     C                     MOVE M1MEKI    WMEKI
     C                     ELSE
      *
     C           *IN13     IFEQ '1'
     C                     GOTO SM1
     C                     END
     C                     END
      *
     C                     SETOF                     50
     C           M1MEKI    CHAINAKCPL031             50
     C           *IN50     IFEQ '1'
     C                     SETON                     13
     C                     MOVE *BLANK    M1MMEI
     C                     ELSE
     C                     SETOF                     13
     C                     END
     C           SM1       TAG
      *
     C           M1MMEI    IFEQ *BLANK
     C                     SETON                     1499
     C                     MOVE ER,17     MSG
     C                     GOTO SG31
     C                     END
     C                     END
      *
     C*----------------------*
     C*  ..旧・新収容数..  *
     C*----------------------*
     C           M1SSYS    IFEQ 0
     C                     SETON                     1899
     C                     MOVE ER,18     MSG
     C                     GOTO SG31
     C                     END
     C           M1SSYT    IFNE 'C'
     C           M1SSYT    ANDNE'B'
     C           M1SSYT    ANDNE'K'
     C           M1SSYT    ANDNE'P'
     C           M1SSYT    ANDNE'D'
     C           M1SSYT    ANDNE'E'
     C           M1SSYT    ANDNE'F'
     C           M1SSYT    ANDNE'G'
     C                     SETON                     1999
     C                     MOVE ER,19     MSG
     C                     GOTO SG31
     C                     END
      *
     C           WKOSN     IFEQ '2'
     C                     Z-ADD*DATE     M1SYHZ
     C                     END
     C           M1SYHZ    IFEQ 0
     C                     SETON                     2099
     C                     MOVE ER,20     MSG
     C                     GOTO SG31
     C                     END
      *
     C           M1SYYY    IFGE 1992
     C           M1SYMM    ANDLE12
     C           M1SYMM    ANDGE01
     C           M1SYDD    ANDLE31
     C           M1SYDD    ANDGE01
     C                     ELSE
     C                     SETON                     2099
     C                     MOVE ER,21     MSG
     C                     GOTO SG31
     C                     END
      *
     C           WKOSN     IFEQ '1'
     C           *IN15     IFEQ '0'
     C           M1SSYS    IFEQ WSSYS
     C           M1SSYT    ANDEQWSSYT
     C                     Z-ADDWKSYS     M1KSYS
     C                     MOVE WKSYT     M1KSYT
     C                     ELSE
      *
     C           M1SYHZ    IFLE *DATE
     C                     SETON                     2099
     C                     MOVE ER,22     MSG
     C                     GOTO SG31
     C                     END
     C                     Z-ADDWSSYS     M1KSYS
     C                     MOVE WSSYT     M1KSYT
     C                     END
     C                     ELSE
      *
     C           M1KSYS    IFEQ 0
     C           M1KSYT    IFNE *BLANK
     C                     SETON                     151699
     C                     MOVE ER,23     MSG
     C                     GOTO SG31
     C                     END
     C                     ELSE
      *
     C           M1KSYT    IFEQ *BLANK
     C                     SETON                     151799
     C                     MOVE ER,24     MSG
     C                     GOTO SG31
     C                     END
     C                     END
      *
     C           M1KSYT    IFNE *BLANK
     C           M1KSYT    ANDNE'C'
     C           M1KSYT    ANDNE'B'
     C           M1KSYT    ANDNE'K'
     C           M1KSYT    ANDNE'P'
     C           M1KSYT    ANDNE'D'
     C           M1KSYT    ANDNE'E'
     C           M1KSYT    ANDNE'F'
     C           M1KSYT    ANDNE'G'
     C                     SETON                     151799
     C                     MOVE ER,25     MSG
     C                     GOTO SG31
     C                     END
     C                     END
     C                     END
      *
     C           M1SYHZ    IFGT *DATE
     C           M1KSYS    IFEQ 0
     C                     SETON                     151699
     C                     MOVE ER,24     MSG
     C                     GOTO SG31
     C                     END
     C           M1KSYT    IFNE 'C'
     C           M1KSYT    ANDNE'B'
     C           M1KSYT    ANDNE'K'
     C           M1KSYT    ANDNE'P'
     C           M1KSYT    ANDNE'D'
     C           M1KSYT    ANDNE'E'
     C           M1KSYT    ANDNE'F'
     C           M1KSYT    ANDNE'G'
     C                     SETON                     151799
     C                     MOVE ER,25     MSG
     C                     GOTO SG31
     C                     END
     C                     END
      *
     C                     END
      * F5:
     C           *INKE     IFEQ '0'
     C                     GOTO SG31
     C                     END
      *
     C*------------------*
     C*  ..絶対番号..  *
     C*------------------*
     C           WKOSN     IFEQ '2'
      *
     C                     SETOF                     50
     C           1         CHAINAKCPPN11             50
     C           *IN50     IFEQ '0'
     C           K7ZN24    IFNE 999
     C                     ADD  1         K7ZN24
     C                     ELSE
      *
     C                     SETOF                     51
     C                     Z-ADD1         B       20
     C           K7ZN01    LOKUPTZN,B                    51
     C           *IN51     IFEQ '1'
     C                     ADD  1         B
     C                     MOVE TZN,B     K7ZN01
     C                     Z-ADD1         K7ZN24
     C                     END
     C                     END
     C                     UPDATAKCPPN11
     C                     END
     C                     MOVE K7ZENO    M1ZENO
     C                     END
      *
     C*----------------------*
     C*  ..新月間必要数..  *
     C*----------------------*
     C                     Z-ADD0         M1GEKN
     C           KEY1      SETLLAEBPL111
     C                     DO   *HIVAL
     C                     SETOF                     50
     C           KEY1      READEAEBPL111                 50
     C           *IN50     IFEQ '0'
     C                     ADD  AGNGEK    M1GEKN
     C                     END
     C  N50                END
      *
     C           WKOSN     IFEQ '0'
     C                     MOVE 'D'       M1SKJY
     C                     MOVE M1SKHZ    WUTHZ
     C                     END
      *
     C                     Z-ADD*DATE     M1KOHZ
     C                     TIME           M1TIME
     C                     MOVELUS        M1KOME
      *
     C           *IN60     IFEQ '1'
     C                     WRITEAKCPL011
     C                     ELSE
     C                     END
      *
     C                     EXSR #SBRT
      *
     C           WKOSN     IFEQ '0'
     C                     CALL 'AKCR03'  AAAG4
     C                     END
      *
     C           *IN96     IFEQ '1'
     C                     ROLBK
     C                     ELSE
     C                     COMIT
     C                     END
      *
     C                     MOVE *BLANK    WKOSN
     C                     MOVE *BLANK    M1KHIN
     C                     CALL 'AKCC01'
     C                     GOTO SG21
      *
     C*----------------------*
     C*  ..サブルーチン..  *
     C*----------------------*
     C           #SBRT     BEGSR
     C                     OPEN AKDTP02
     C                     SETOF                     96
     C                     MOVE *BLANK    PCMD
     C                     MOVE *BLANK    POUT
     C                     MOVE M1GEKN    PNSRY
      *
     C           WKOSN     IFEQ '0'
     C                     MOVE *ZERO     PNSRY
     C                     END
     C                     MOVE M1KHIN    PXHIN  12
     C                     MOVE *BLANK    PPHIN
     C                     MOVE WKOSN     XKOSN
      *
     C           WKOUM     IFEQ '2'
     C                     CALL 'AKFR01'  AAAG3
     C                     END
      *
     C           WKOUM     IFEQ '1'
     C           WKOUM     OREQ '2'
     C                     CALL 'AKDR01'  AAAG1
     C           PCMD      IFEQ '3'
     C                     SETON                     96
     C                     GOTO SSB1
     C                     END
      *
     C                     CALL 'AKDR02'  AAAG2
     C                     CALL 'AKFR02'  AAAG4
     C                     END
      *
     C                     MOVE PXHIN     PPHIN
     C                     DO   *HIVAL
     C                     SETOF                     50
     C                     READ AKDTP021                 50
     C           *IN50     IFEQ '1'
     C                     GOTO SSB1
     C                     END
     C           M1KHIN    IFNE N9SHIN
      *
     C                     SETOF                     50
     C           KEY2      CHAINAKCPL011             50
     C           *IN50     IFEQ '0'
     C                     MOVE M1GEKN    POSRY
     C                     MOVE M1GEKN    PNSRY
     C                     END
     C                     MOVE '1'       POUT
     C                     MOVE '1'       WKOSN
     C                     MOVE '1'       XKOSN
      *
     C           N9KKBN    IFEQ 'S'
     C                     CALL 'AKCR02'  AAAV2
     C                     ELSE
      *
     C                     CALL 'AKDR01'  AAAG1
     C                     CALL 'AKDR02'  AAAG2
      *
     C*------------------------------------*
     C*  ..構成品番計画通知書マスター..  *
     C*------------------------------------*
     C                     SETOF                     50
     C           KEY2      CHAINAKFPL011             50
     C           *IN50     IFEQ '0'
     C           M4SKJY    ANDEQ'D'
     C           M4SKHZ    ANDLE*DATE
     C                     SETON                     50
     C                     END
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C           *IN50     IFEQ '0'
     C                     SETOF                     50
     C           KEY2      CHAINAKEPL011             50
     C           *IN50     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     50
     C                     END
      *
     C           *IN50     IFEQ '0'
      *
     C*----------------------*
     C*  ..工程チェック..  *
     C*----------------------*
     C                     SETOF                     50
     C                     Z-ADD1         C       20
     C           1         DO   15        C
     C           NKMN,C    IFGE M4KOHZ
     C           OKOT,C    IFEQ NKOT,C
     C           OKBM,C    ANDEQNKBM,C
     C                     ELSE
     C                     SETON                     50
     C                     END
     C                     END
     C  N50                END
      *
     C           *IN50     IFEQ '1'
      *
     C           M4IKOU    IFEQ '#'
     C                     MOVE *BLANK    M4TAHH
     C                     MOVE *BLANK    M4KATH
     C                     MOVE *BLANK    M4SYSH
     C                     MOVE *BLANK    M4SYHH
     C                     MOVE *BLANK    M4GEKH
     C                     MOVE *BLANK    M4KOTH
     C                     MOVE *BLANK    M4IKOU
     C                     Z-ADD1         M4KOSN
     C                     END
      *
     C           M4KOSN    IFNE 2
     C                     MOVE '*'       M4KOTH
     C                     MOVE *BLANK    M4LIST
     C                     END
      *
     C                     Z-ADD*DATE     M4KOHZ
     C                     TIME           M4TIME
     C                     MOVELUS        M4KOME
     C                     UPDATAKFPL011
     C                     END
     C                     END
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C           SSB1      TAG
     C                     CLOSEAKDTP02
     C                     ENDSR
      *
** ER(60A) ........2.........3.........4.........5.........6
ER-01 ENTER 1 OR 2!
ER-02 ENTER 0, 1 OR 2!
ER-03 USE <ALL> TO ADD                                        JW2
ER-04 USE <ALL> TO CANCEL                                     JW2
ER-05 ENTER COMPONENTS PART NO.!
ER-06 COMPONENTS PART ALREADY EXISTS!
ER-07 COMPONENTS PART NOT FOUND IN MASTER!
ER-08 COMPONENTS PART ALREADY CANCELLED!
ER-09 COMPONENTS PART NOT FOUND IN MASTER!
ER-10 COMPONENTS PART ALREADY CANCELLED!
ER-11 DELETE DUE DATE IS INCORRECT!
ER-12 DELETE DUE DATE IS GREATER THAN SYSTEM DATE!
ER-13 DATE OF START PRODUCTION IS INCORRECT!
ER-14 ENTER PRODUCTION ORDER INSTRUCTION (G OR S)
ER-15 ENTER FINISHED UNIT WEIGHT!
ER-16 ENTER FINISHED UNIT WEIGHT / UNIT!
ER-17 ENTER HANDLE NAME!                                      JW2
ER-18 ENTER QPC!                                              JW2
ER-19 ENTER NEW QPC QTY UNIT <C.B.K.P.D.E.F.G>
ER-20 ENTER QPC QUANTITY CHANGE DATE!
ER-21 QPC QTY CHANGE DATE IS INCORRECT!
ER-22 QPC QTY CHANGE DATE SHOULD BE GREATER THAN TODAY!
ER-23 ENTER OLD QPC QTY!
ER-24 ENTER OLD QPC QTY/UNIT!
ER-25 ENTER OLD QPC QTY UNIT <C.B.K.P.D.E.F.G>
ER-26
** KTD KTN
1 PROCESS INFO M/F
2 ALL -- ALL --
** TZN
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
