     H            Y.
     F** AKDR02 ************************************
     F* PROCESS M/F UPDATE BY AKDR01 UPDATE INFORMATION
     F* I-HASADA                       92.06.23    *
     F*--------------------------------------------*
     F* PROCESS M/F UPDATE FROM THE FIRST PROCESS SUCCESSIVELY
     F* KEY CHANGE IS DONE FROM NEXT PROCESS SUCCESSIVELY
     F************************************ AKDR02 **
     FAKDWP01 IF  F     500            DISK
     FAKEPL01 UF  E           K        DISK         KCOMIT
     FAKDPL02 UF  E           K        DISK         KCOMIT       A
     FAKDTP02 UF  E           K        DISK                      A
     E                    KO         15  3               ﾃcmb
     E                    BM         15  4 0             ﾎﾞy]
     E                    BN         15  6               ﾌﾞ]k
     E                    DH         15 12               jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    HZ         15 10 0             f]ﾌﾞ]gﾒfdﾍﾞ
     E                    TP         15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    CH         15  1               CHGhﾎﾞ]
     E                    CZ         15  8 0             ﾃcmbﾃcﾆ]ﾍﾞ
     E                    SU         15  9 0             ﾃcmbﾈｮmbﾇc
     E                    QKO        15  3               gﾏcﾃcmb
     E                    QBM        15  4 0             gﾏcﾎﾞy]
     E                    QBN        15  6               gﾏcﾌﾞ]k
     E                    QDH        15 12               gﾏ-jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    QTP        15  1               Qf]ﾌﾞ]ﾆｬﾓb
     E                    WKO        15  3               ﾃcmb
     E                    WBM        15  4 0             ﾎﾞy]
     E                    WBN        15  6               ﾌﾞ]k
     E                    WDH        15 12               jﾞbﾍﾑcﾍ]ﾌﾞ]
     E                    WHZ        15 10 0             f]ﾌﾞ]gﾒfdﾍﾞ
     E                    WTP        15  1               f]ﾌﾞ]ﾆｬﾓb
     E                    WCH        15  1               CHGhﾎﾞ]
     E                    SE         15  2 0             NSEQ-NO
     E                    QS         15  2 0             QSEQ-NO
     IAKDWP01 AA  05
     I                                        4  15 WHBAN
     I                                        4   8 WHIN1
     I                                        9  13 WHIN2
     I                                       14  15 WHIN3
     I                                       16  16 WDIHY
     I                                       17  61 WKO
     I                                       62 121 WBM
     I                                      167 346 WDH
     I                                      347 436 WBN
     I                                      437 4450WSETI
     I            DS
     I******************************************************
     I*   （　新　）  工程コード                       *
     I******************************************************
     I                                        1  45 KO
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I******************************************************
     I*   （　新　）  工程内所番地　　　　             *
     I******************************************************
     I            DS
     I                                        1  90 BN
     I                                        1   6 M3NB01
     I                                        7  12 M3NB02
     I                                       13  18 M3NB03
     I                                       19  24 M3NB04
     I                                       25  30 M3NB05
     I                                       31  36 M3NB06
     I                                       37  42 M3NB07
     I                                       43  48 M3NB08
     I                                       49  54 M3NB09
     I                                       55  60 M3NB10
     I                                       61  66 M3NB11
     I                                       67  72 M3NB12
     I                                       73  78 M3NB13
     I                                       79  84 M3NB14
     I                                       85  90 M3NB15
     I******************************************************
     I*   （　新　）  部門コード                       *
     I******************************************************
     I            DS
     I                                        1  60 BM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I******************************************************
     I*   （　新　）  工程代表品番　　　　             *
     I******************************************************
     I            DS
     I                                        1 180 DH
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I******************************************************
     I*   （　新　）  かんばん種類コード               *
     I******************************************************
     I            DS
     I                                        1  15 TP
     I                                        1   1 M3TY01
     I                                        2   2 M3TY02
     I                                        3   3 M3TY03
     I                                        4   4 M3TY04
     I                                        5   5 M3TY05
     I                                        6   6 M3TY06
     I                                        7   7 M3TY07
     I                                        8   8 M3TY08
     I                                        9   9 M3TY09
     I                                       10  10 M3TY10
     I                                       11  11 M3TY11
     I                                       12  12 M3TY12
     I                                       13  13 M3TY13
     I                                       14  14 M3TY14
     I                                       15  15 M3TY15
     I******************************************************
     I*   　　　　　  かんばん切替日                   *
     I******************************************************
     I            DS
     I                                        1 150 HZ
     I                                        1  100M3HZ01
     I                                       11  200M3HZ02
     I                                       21  300M3HZ03
     I                                       31  400M3HZ04
     I                                       41  500M3HZ05
     I                                       51  600M3HZ06
     I                                       61  700M3HZ07
     I                                       71  800M3HZ08
     I                                       81  900M3HZ09
     I                                       91 1000M3HZ10
     I                                      101 1100M3HZ11
     I                                      111 1200M3HZ12
     I                                      121 1300M3HZ13
     I                                      131 1400M3HZ14
     I                                      141 1500M3HZ15
     I******************************************************
     I*   （　旧　）  工程コード                       *
     I******************************************************
     I            DS
     I                                        1  45 QKO
     I                                        1   3 M3QK01
     I                                        4   6 M3QK02
     I                                        7   9 M3QK03
     I                                       10  12 M3QK04
     I                                       13  15 M3QK05
     I                                       16  18 M3QK06
     I                                       19  21 M3QK07
     I                                       22  24 M3QK08
     I                                       25  27 M3QK09
     I                                       28  30 M3QK10
     I                                       31  33 M3QK11
     I                                       34  36 M3QK12
     I                                       37  39 M3QK13
     I                                       40  42 M3QK14
     I                                       43  45 M3QK15
     I******************************************************
     I*   （　旧　）  部門コード                       *
     I******************************************************
     I            DS
     I                                        1  60 QBM
     I                                        1   40M3QB01
     I                                        5   80M3QB02
     I                                        9  120M3QB03
     I                                       13  160M3QB04
     I                                       17  200M3QB05
     I                                       21  240M3QB06
     I                                       25  280M3QB07
     I                                       29  320M3QB08
     I                                       33  360M3QB09
     I                                       37  400M3QB10
     I                                       41  440M3QB11
     I                                       45  480M3QB12
     I                                       49  520M3QB13
     I                                       53  560M3QB14
     I                                       57  600M3QB15
     I******************************************************
     I*   （　旧　）  工程代表品番　　　　             *
     I******************************************************
     I            DS
     I                                        1 180 QDH
     I                                        1  12 M3QH01
     I                                       13  24 M3QH02
     I                                       25  36 M3QH03
     I                                       37  48 M3QH04
     I                                       49  60 M3QH05
     I                                       61  72 M3QH06
     I                                       73  84 M3QH07
     I                                       85  96 M3QH08
     I                                       97 108 M3QH09
     I                                      109 120 M3QH10
     I                                      121 132 M3QH11
     I                                      133 144 M3QH12
     I                                      145 156 M3QH13
     I                                      157 168 M3QH14
     I                                      169 180 M3QH15
     I******************************************************
     I*   （　旧　）  工程内所番地　　　　             *
     I******************************************************
     I            DS
     I                                        1  90 QBN
     I                                        1   6 M3QT01
     I                                        7  12 M3QT02
     I                                       13  18 M3QT03
     I                                       19  24 M3QT04
     I                                       25  30 M3QT05
     I                                       31  36 M3QT06
     I                                       37  42 M3QT07
     I                                       43  48 M3QT08
     I                                       49  54 M3QT09
     I                                       55  60 M3QT10
     I                                       61  66 M3QT11
     I                                       67  72 M3QT12
     I                                       73  78 M3QT13
     I                                       79  84 M3QT14
     I                                       85  90 M3QT15
     I******************************************************
     I*   （　旧　）  かんばん種類コード               *
     I******************************************************
     I            DS
     I                                        1  15 QTP
     I                                        1   1 M3QS01
     I                                        2   2 M3QS02
     I                                        3   3 M3QS03
     I                                        4   4 M3QS04
     I                                        5   5 M3QS05
     I                                        6   6 M3QS06
     I                                        7   7 M3QS07
     I                                        8   8 M3QS08
     I                                        9   9 M3QS09
     I                                       10  10 M3QS10
     I                                       11  11 M3QS11
     I                                       12  12 M3QS12
     I                                       13  13 M3QS13
     I                                       14  14 M3QS14
     I                                       15  15 M3QS15
     I******************************************************
     I*                 更新日（工程単位）               *
     I******************************************************
     I            DS
     I                                        1 120 CZ
     I                                        1   80M3MN01
     I                                        9  160M3MN02
     I                                       17  240M3MN03
     I                                       25  320M3MN04
     I                                       33  400M3MN05
     I                                       41  480M3MN06
     I                                       49  560M3MN07
     I                                       57  640M3MN08
     I                                       65  720M3MN09
     I                                       73  800M3MN10
     I                                       81  880M3MN11
     I                                       89  960M3MN12
     I                                       97 1040M3MN13
     I                                      105 1120M3MN14
     I                                      113 1200M3MN15
     I******************************************************
     I*             工程代表品番　設定数                 *
     I******************************************************
     I            DS
     I                                        1 135 SU
     I                                        1   90M3SU01
     I                                       10  180M3SU02
     I                                       19  270M3SU03
     I                                       28  360M3SU04
     I                                       37  450M3SU05
     I                                       46  540M3SU06
     I                                       55  630M3SU07
     I                                       64  720M3SU08
     I                                       73  810M3SU09
     I                                       82  900M3SU10
     I                                       91  990M3SU11
     I                                      100 1080M3SU12
     I                                      109 1170M3SU13
     I                                      118 1260M3SU14
     I                                      127 1350M3SU15
     I******************************************************
     I*                 入力ミス　データ修正マーク（＊） *
     I******************************************************
     I            DS
     I                                        1  15 CH
     I                                        1   1 M3CG01
     I                                        2   2 M3CG02
     I                                        3   3 M3CG03
     I                                        4   4 M3CG04
     I                                        5   5 M3CG05
     I                                        6   6 M3CG06
     I                                        7   7 M3CG07
     I                                        8   8 M3CG08
     I                                        9   9 M3CG09
     I                                       10  10 M3CG10
     I                                       11  11 M3CG11
     I                                       12  12 M3CG12
     I                                       13  13 M3CG13
     I                                       14  14 M3CG14
     I                                       15  15 M3CG15
     I            DS
     I                                        1  12 UHBAN
     I                                        1   5 UHIN1
     I                                        6  10 UHIN2
     I                                       11  12 UHIN3
     I            DS
     I                                        1  12 KHBAN
     I                                        1   5 KHIN1
     I                                        6  10 KHIN2
     I                                       11  12 KHIN3
     I            DS
     I                                        1   6 KBANC
     I                                        1   1 KBAN1
     I                                        2   3 KBAN2
     I                                        4   5 KBAN3
     I                                        6   6 KBAN4
     I            DS
     I                                        1  12 NHBAN
     I                                        1   5 NHIN1
     I                                        6  10 NHIN2
     I                                       11  12 NHIN3
     I            DS
     I                                        1   6 NBANC
     I                                        1   1 NBAN1
     I                                        2   3 NBAN2
     I                                        4   5 NBAN3
     I                                        6   6 NBAN4
     I            DS
     I                                        1  12 KHBANM
     I                                        1   5 MNMHN1
     I                                        6  10 MNMHN2
     I                                       11  12 MNMHN3
     I            DS
     I                                        1  12 KHBANJ
     I                                        1   5 MNJHN1
     I                                        6  10 MNJHN2
     I                                       11  12 MNJHN3
     I                                        1   2 HCHK
     I            DS
     I                                        1   6 MBAND
     I                                        1   1 MNMBN1
     I                                        2   3 MNMBN2
     I                                        4   5 MNMBN3
     I                                        6   6 MNMBN4
     I            DS
     I                                        1  12 YHBAN
     I                                        1   5 YHIN1
     I                                        6  10 YHIN2
     I                                       11  12 YHIN3
     I            DS
     I                                        1   6 MTKR
     I                                        1   1 MBN1
     I                                        2   3 MBN2
     I                                        4   5 MBN3
     I                                        6   6 MBN4
     I            DS
     I                                        1  12 OCHBAN
     I                                        1   5 OCHIN1
     I                                        6  10 OCHIN2
     I                                       11  12 OCHIN3
     I            DS
     I                                        1   6 OCBANH
     I                                        1   1 OCBAN1
     I                                        2   3 OCBAN2
     I                                        4   5 OCBAN3
     I                                        6   6 OCBAN4
     C           AMKEY     KLIST
     C                     KFLD           UHIN1
     C                     KFLD           UHIN2
     C                     KFLD           UHIN3
      *
     C           KKEY      KLIST
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
     C                     KFLD           KKOTE
     C                     KFLD           KBMON
     C                     KFLD           KBAN1
     C                     KFLD           KBAN2
     C                     KFLD           KBAN3
     C                     KFLD           KBAN4
      *
     C           OYKEY     KLIST
     C                     KFLD           OCHIN1
     C                     KFLD           OCHIN2
     C                     KFLD           OCHIN3
     C                     KFLD           OCKOTE
     C                     KFLD           OCBMON
     C                     KFLD           OCBAN1
     C                     KFLD           OCBAN2
     C                     KFLD           OCBAN3
     C                     KFLD           OCBAN4
      *
     C           CHGH      KLIST
     C                     KFLD           MNJHN1
     C                     KFLD           MNJHN2
     C                     KFLD           MNJHN3
      *
     C******************************************************
     C*   ﾃcmbuﾇj- ﾃcﾆ]mﾞ-j  AKDWP01 ･ ﾑvnﾓ                *
     C*      udﾃcmbuﾇj- . ﾃcmbobuﾇj- ･ ﾃcﾆ]ﾇﾓ              *
     C******************************************************
     C           *ENTRY    PLIST
     C                     PARM           PMENT   1
     C                     PARM           PUSER  10
     C                     PARM           PHBAN  12
     C                     PARM           POSRY   9
     C                     PARM           PNSRY   9
     C                     PARM           PU7IN   1
     C                     MOVE POSRY     WSRYOO  90
     C                     MOVE PNSRY     WSRYON  90
     C                     MOVE *DATE     KTHIZ   60
     C                     MOVE PHBAN     UHBAN
     C           WSRYON    SUB  WSRYOO    WSRYO   90
     C                     MOVE UHIN1     M3HIN1  5
     C                     MOVE UHIN2     M3HIN2  5
     C                     MOVE UHIN3     M3HIN3  2
     C                     Z-ADD1         SSEQ    20
     C                     MOVE *BLANK    SHKBN   1
     C                     MOVE *BLANK    PSKJY   1
     C                     Z-ADD1         CQ      20
      *
     C                     SETOF                     01
     C           AMKEY     CHAINAKEPL011             01
     C           *IN01     IFEQ '1'
     C                     MOVE *BLANK    KO               ﾃcmb
     C                     Z-ADD0         BM               ﾎﾞy]
     C                     MOVE *BLANK    BN               ﾌﾞ]k
     C                     MOVE *BLANK    DH               ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    TP               ﾆｬﾓb
     C                     MOVE *BLANK    CH               CHG
     C                     Z-ADD0         HZ               gﾒfdﾍﾞ
     C                     Z-ADD0         SU               ﾇcﾒｭc
     C                     Z-ADD0         CZ               ﾃcﾆ]ﾍﾞ
     C                     MOVE *BLANK    QKO              Qﾃcmb
     C                     Z-ADD0         QBM              Qﾎﾞy]
     C                     MOVE *BLANK    QBN              Qﾌﾞ]k
     C                     MOVE *BLANK    QDH              Qﾍ]ﾌﾞ]
     C                     MOVE *BLANK    QTP              Qﾆｬﾓb
     C                     GOTO STEP83
     C                     END
      *
     C           PU7IN     CABEQ'1'       STEP80
      *
     C******************************************************
     C*  取消指定の時子品番をＷＯＲＫファイルへ書き込む  *
     C******************************************************
     C           PMENT     CABNE'0'       STEPX5
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           DH,A      IFEQ UHBAN
     C                     GOTO STEPX1
     C                     END
     C                     END
     C                     GOTO STEPX2
     C           STEPX1    TAG
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
     C           OYKEY     SETLLAKDPL021
     C           STEPX3    TAG
     C                     READ AKDPL02                  17
     C           *IN17     CABEQ'1'       STEPX2
     C           OCHBAN    CABNEKHBANM    STEPX2
     C           OCBMON    CABNEMNMBMN    STEPX2
     C           OCKOTE    CABNEMNMKTE    STEPX2
     C           OCBANH    CABNEMBAND     STEPX2
     C           UHBAN     CABEQKHBANJ    STEPX3
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEPX3
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE '*'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEPX3
     C           STEPX2    TAG
     C           POSRY     IFNE PNSRY
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C                     GOTO STEPX4
     C                     END
     C                     END
     C                     GOTO STEPX5
     C           STEPX4    TAG
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
     C           OYKEY     SETLLAKDPL021
     C           STEPX6    TAG
     C                     READ AKDPL021                 17
     C           *IN17     CABEQ'1'       STEPX5
     C           OCHBAN    CABNEKHBANM    STEPX5
     C           OCBMON    CABNEMNMBMN    STEPX5
     C           OCKOTE    CABNEMNMKTE    STEPX5
     C           OCBANH    CABNEMBAND     STEPX5
     C           UHBAN     CABEQKHBANJ    STEPX6
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEPX6
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE 'S'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEPX6
     C                     END
     C           STEPX5    TAG
     C                     MOVE *BLANK    MMENT   1
     C                     SETOF                     101112
     C           PMENT     IFEQ '0'
     C                     SETON                     10
     C                     MOVE '1'       MMENT   1
     C                     ELSE
     C           PMENT     IFEQ '1'
     C                     SETON                     11    s]ﾃc
     C                     Z-ADD1         A       20
     C           1         DO   15        A
     C           CZ,A      IFGT 0
     C                     MOVE '1'       MMENT
     C                     GOTO STEP19
     C                     END
     C                     END
     C           POSRY     IFNE PNSRY
     C                     MOVE '1'       MMENT
     C                     GOTO STEP19
     C                     END
     C                     ELSE
     C           PMENT     IFEQ '2'
     C                     SETON                     12    lbf
     C                     MOVE '1'       MMENT
     C                     END
     C                     END
     C                     END
     C           STEP19    TAG
     C   01                GOTO STEP01
     C   10                GOTO STEP87
      *
     C******************************************************
     C*   更新品番の　親子品番グループを　追加する       *
     C******************************************************
     C           STEP89    TAG
     C                     Z-ADD1         X       20
     C                     Z-ADD1         I
     C                     SETOF                     25
     C                     READ AKDWP01                  25
     C   25                GOTO STEP87
     C           MMENT     CABEQ*BLANK    STEP87
     C           STEP88    TAG
     C           I         CABGE15        STEP89
     C           WKO,I     CABNE*BLANK    STEP90
     C           I         ADD  1         I
     C                     GOTO STEP88
     C           STEP90    TAG
     C                     Z-ADDWSETI     NMSRYO  90
     C                     MOVE WDH,I     KHBAN
     C                     MOVE WBM,I     KBMON
     C                     MOVE WKO,I     KKOTE
     C                     MOVE WBN,I     KBANC
     C           KKEY      SETLLAKDPL021
     C           STEP93    TAG
     C                     SETOF                     16
     C                     READ AKDPL021                 16
     C   16                GOTO STEP92
     C           KHBAN     CABNEKHBANM    STEP92
     C           KKOTE     CABNEMNMKTE    STEP92
     C           KBMON     CABNEMNMBMN    STEP92
     C           KBANC     CABNEMBAND     STEP92
     C           MNSRYO    ADD  WSETI     NMSRYO
     C                     Z-ADDNMSRYO    MNSRYO
     C                     UPDATAKDPL021
     C                     GOTO STEP93
     C           STEP92    TAG
     C                     MOVE WHBAN     KHBANJ
     C                     Z-ADDX         MNKSEQ
     C                     Z-ADDWSETI     MNSETI
     C                     MOVE WDH,I     KHBANM
     C                     MOVE WKO,I     MNMKTE
     C                     MOVE WBM,I     MNMBMN
     C                     MOVE WBN,I     MBAND
     C                     Z-ADDNMSRYO    MNSRYO
     C                     WRITEAKDPL021
     C           I         ADD  1         I
     C           X         ADD  1         X
     C                     GOTO STEP88
     C           STEP87    TAG
     C                     Z-ADD1         I       20
     C   12                GOTO STEP02                     lbf
     C           MMENT     CABEQ*BLANK    STEP01
     C   11                GOTO STEP03                     s]ﾃc
      *
     C******************************************************
     C*  完成品番が取消の時工程マスターを　削除する    *
     C******************************************************
     C                     SETOF                     5152
     C                     MOVE *BLANK    WHKEY  12
     C                     Z-ADD0         SETSU   90
     C                     Z-ADD0         CQ               ﾃcmbSEQ
     C           STEP05    TAG
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP09
     C           STEP35    TAG
     C           I         ADD  1         I
     C                     GOTO STEP05
     C           STEP09    TAG
     C                     SETOF                     14
     C                     MOVE *BLANK    WHKEY
     C                     Z-ADD0         SETSU   90
     C                     MOVE DH,I      KHBAN
     C                     MOVE KO,I      KKOTE   3
     C                     MOVE BM,I      KBMON   40
     C                     MOVE BN,I      KBANC
     C           UHBAN     CABNEDH,I      STEP04
     C           KKEY      SETLLAKDPL021
     C           STEP06    TAG
     C                     SETOF                     13
     C                     READ AKDPL021                 13
     C   13                GOTO STEP04
     C           KHBAN     CABNEKHBANM    STEP04
     C           KKOTE     CABNEMNMKTE    STEP04
     C           KBMON     CABNEMNMBMN    STEP04
     C           KBANC     CABNEMBAND     STEP04
     C           UHBAN     CABEQKHBANJ    STEP06
      *
     C******************************************************
     C*  次期工程代表品番を設定する  WHKEY fﾞ NOT BLANK  *
     C******************************************************
     C           HCHK      CABEQ'91'      STEP07
     C           HCHK      CABEQ'92'      STEP07
     C           HCHK      CABEQ'93'      STEP07
     C           HCHK      CABEQ'94'      STEP07
     C           HCHK      CABEQ'95'      STEP07
     C*          WHKEY     CABNE*BLANK    STEP06
     C*                    MOVE KHBANJ    WHKEY
     C           *IN14     IFEQ '0'
     C           MNSETI    IFGT SETSU
     C                     Z-ADDMNSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     GOTO STEP23
     C                     END
     C                     END
     C                     GOTO STEP06
     C           STEP23    TAG
      *
     C******************************************************
     C*  次期工程代表品番の設定された工程をＷＯＲＫに移す*
     C******************************************************
     C                     MOVE WHKEY     CHHBAN 12
     C                     MOVE MNMKTE    CHKOTE  3
     C                     Z-ADDMNMBMN    CHBMON  40
     C                     MOVE MBAND     CHBANC  6
     C                     Z-ADDI         P       20
     C                     GOTO STEP06
     C           STEP07    TAG
     C*  14      KHBANJ    CABGTWHKEY     STEP06
     C*                    MOVE KHBANJ    WHKEY
     C*                    SETON                     14
     C           *IN14     IFEQ '0'
     C                     Z-ADDMNSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     SETON                     14
     C                     GOTO STEP24
     C                     ELSE
     C           MNSETI    IFGT SETSU
     C                     Z-ADDMNSETI    SETSU
     C                     MOVE KHBANJ    WHKEY
     C                     GOTO STEP24
     C                     END
     C                     END
     C                     GOTO STEP06
     C           STEP24    TAG
      *
     C******************************************************
     C*  次期工程代表品番の設定された工程をＷＯＲＫに移す*
     C******************************************************
     C                     MOVE WHKEY     CHHBAN 12
     C                     MOVE MNMKTE    CHKOTE  3
     C                     Z-ADDMNMBMN    CHBMON  40
     C                     MOVE MBAND     CHBANC  6
     C                     Z-ADDI         P       20
     C                     GOTO STEP06
     C           STEP04    TAG
     C           KKEY      SETLLAKDPL021
     C           STEP08    TAG
     C                     SETOF                     13
     C                     READ AKDPL021                 13
     C   13                GOTO STEP35
     C           KHBAN     CABNEKHBANM    STEP35
     C           KKOTE     CABNEMNMKTE    STEP35
     C           KBMON     CABNEMNMBMN    STEP35
     C           KBANC     CABNEMBAND     STEP35
     C           UHBAN     CABEQKHBANJ    STEP10
     C           MNSRYO    SUB  WSRYOO    MNSRYO
     C           UHBAN     CABNEDH,I      STEP33
     C           WHKEY     CABEQ*BLANK    STEP33
     C                     MOVE WHKEY     KHBANM
     C           STEP33    TAG
     C                     UPDATAKDPL021
     C                     GOTO STEP08
     C           STEP10    TAG
     C                     DELETAKDPL021
     C                     GOTO STEP08
      *
     C******************************************************
     C*  新完成品番　追加の時　工程マスターを作成する    *
     C*  専用工程は追加　；　共通工程は設定数の変更する  *
     C******************************************************
     C           STEP02    TAG
     C                     Z-ADD1         C       20
     C           STEP17    TAG
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP11
     C           I         ADD  1         I
     C                     GOTO STEP17
     C           STEP11    TAG
     C                     Z-ADDWSRYON    NMSRYO  90
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
     C           KKEY      SETLLAKDPL021
     C           STEP12    TAG
     C                     SETOF                     16
     C                     READ AKDPL021                 16
     C   16                GOTO STEP13
     C           KHBAN     CABNEKHBANM    STEP13
     C           KKOTE     CABNEMNMKTE    STEP13
     C           KBMON     CABNEMNMBMN    STEP13
     C           KBANC     CABNEMBAND     STEP13
     C           MNSRYO    ADD  WSRYON    NMSRYO
     C                     Z-ADDNMSRYO    MNSRYO
     C                     UPDATAKDPL021
     C                     GOTO STEP12
     C           STEP13    TAG
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MNKSEQ
     C                     Z-ADDWSRYON    MNSETI
     C                     MOVE DH,I      KHBANM
     C                     MOVE KO,I      MNMKTE
     C                     MOVE BM,I      MNMBMN
     C                     MOVE BN,I      MBAND
     C                     Z-ADDNMSRYO    MNSRYO
     C                     WRITEAKDPL021
     C           C         ADD  1         C
     C           I         ADD  1         I
     C                     GOTO STEP17
      *
     C******************************************************
     C*  完成品番変更の時　工程マスターを変更する        *
     C******************************************************
     C           STEP03    TAG
     C                     Z-ADD1         C
     C           STEP18    TAG
     C           I         CABGE15        STEP01
     C           KO,I      CABNE*BLANK    STEP14
     C           I         ADD  1         I
     C                     GOTO STEP18
     C           STEP14    TAG
     C                     Z-ADDWSRYON    NMSRYO  90
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
     C           KKEY      SETLLAKDPL021
     C           STEP15    TAG
     C                     SETOF                     16
     C                     READ AKDPL021                 16
     C   16                GOTO STEP16
     C           KHBAN     CABNEKHBANM    STEP16
     C           KKOTE     CABNEMNMKTE    STEP16
     C           KBMON     CABNEMNMBMN    STEP16
     C           KBANC     CABNEMBAND     STEP16
     C           MNSRYO    ADD  WSRYON    NMSRYO
     C                     Z-ADDNMSRYO    MNSRYO
     C                     UPDATAKDPL021
     C                     GOTO STEP15
     C           STEP16    TAG
     C                     MOVE UHBAN     KHBANJ
     C                     Z-ADDC         MNKSEQ
     C                     Z-ADDWSRYON    MNSETI
     C                     MOVE DH,I      KHBANM
     C                     MOVE KO,I      MNMKTE
     C                     MOVE BM,I      MNMBMN
     C                     MOVE BN,I      MBAND
     C                     Z-ADDNMSRYO    MNSRYO
     C                     WRITEAKDPL021
     C           C         ADD  1         C
     C           I         ADD  1         I
     C                     GOTO STEP18
      *
     C******************************************************
     C*  工程マスター全更新後変更される工程の内で一番若い*
     C*  工程順位の工程に関連する子品番又は親品番を      *
     C*  ＧＨＣＴＬ２２へ書き出す。                      *
     C******************************************************
     C           STEP01    TAG
     C           PMENT     CABEQ'0'       STEP83
      *
     C******************************************************
     C*  更新が必要な子品番をＷＯＲＫファイルへ書き込む  *
     C******************************************************
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           PMENT     IFEQ '0'
     C           DH,A      IFEQ UHBAN
     C                     GOTO STEP82
     C                     END
     C                     ELSE
     C           CZ,A      IFGT 0
     C           KO,A      IFNE *BLANK
     C                     GOTO STEP82
     C                     END
     C                     END
     C                     END
     C                     END
     C                     GOTO STEP20
     C           STEP82    TAG
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
     C           OYKEY     SETLLAKDPL021
     C                     SETOF                     17
     C           STEP81    TAG
     C                     READ AKDPL02                  17
     C           *IN17     CABEQ'1'       STEP20
     C           OCHBAN    CABNEKHBANM    STEP20
     C           OCBMON    CABNEMNMBMN    STEP20
     C           OCKOTE    CABNEMNMKTE    STEP20
     C           OCBANH    CABNEMBAND     STEP20
     C           UHBAN     CABEQKHBANJ    STEP81
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEP81
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE '*'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEP81
     C           STEP20    TAG
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           PMENT     IFEQ '0'
     C           QDH,A     IFEQ UHBAN
     C                     GOTO STEP51
     C                     END
     C                     ELSE
     C           CZ,A      IFGT 0
     C           QKO,A     IFNE *BLANK
     C                     GOTO STEP51
     C                     END
     C                     END
     C                     END
     C                     END
     C                     GOTO STEP52
     C           STEP51    TAG
     C                     MOVE QDH,A     OCHBAN
     C                     MOVE QBM,A     OCBMON
     C                     MOVE QKO,A     OCKOTE
     C                     MOVE QBN,A     OCBANH
     C           OYKEY     SETLLAKDPL021
     C                     SETOF                     17
     C           STEP53    TAG
     C                     READ AKDPL02                  17
     C           *IN17     CABEQ'1'       STEP52
     C           OCHBAN    CABNEKHBANM    STEP52
     C           OCBMON    CABNEMNMBMN    STEP52
     C           OCKOTE    CABNEMNMKTE    STEP52
     C           OCBANH    CABNEMBAND     STEP52
     C           UHBAN     CABEQKHBANJ    STEP53
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEP53
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE 'S'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEP53
     C           STEP52    TAG
     C           POSRY     IFNE PNSRY
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C                     GOTO STEP21
     C                     END
     C                     END
     C                     GOTO STEP80
     C           STEP21    TAG
     C                     MOVE DH,A      OCHBAN
     C                     MOVE BM,A      OCBMON  40
     C                     MOVE KO,A      OCKOTE  3
     C                     MOVE BN,A      OCBANH  6
     C           OYKEY     SETLLAKDPL021
     C                     SETOF                     17
     C           STEP22    TAG
     C                     READ AKDPL021                 17
     C           *IN17     CABEQ'1'       STEP80
     C           OCHBAN    CABNEKHBANM    STEP80
     C           OCBMON    CABNEMNMBMN    STEP80
     C           OCKOTE    CABNEMNMKTE    STEP80
     C           OCBANH    CABNEMBAND     STEP80
     C           UHBAN     CABEQKHBANJ    STEP22
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEP22
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE 'S'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEP22
     C                     END
     C           STEP80    TAG
     C                     Z-ADD1         A
     C           1         DO   15        A
     C           KO,A      IFNE *BLANK
     C           DH,A      IFNE QDH,A
     C                     GOTO STEP54
     C                     END
     C                     END
     C                     GOTO STEP55
     C           STEP54    TAG
     C                     MOVE QDH,A     OCHBAN
     C                     MOVE QBM,A     OCBMON
     C                     MOVE QKO,A     OCKOTE
     C                     MOVE QBN,A     OCBANH
     C           OYKEY     SETLLAKDPL021
     C                     SETOF                     17
     C           STEP56    TAG
     C                     READ AKDPL021                 17
     C           *IN17     CABEQ'1'       STEP55
     C           OCHBAN    CABNEKHBANM    STEP55
     C           OCBMON    CABNEMNMBMN    STEP55
     C           OCKOTE    CABNEMNMKTE    STEP55
     C           OCBANH    CABNEMBAND     STEP55
     C           UHBAN     CABEQKHBANJ    STEP56
     C                     SETOF                     15
     C           CHGH      CHAINAKDTP021             15
     C  N15                GOTO STEP56
     C                     MOVE MNJHN1    N9SHN1
     C                     MOVE MNJHN2    N9SHN2
     C                     MOVE MNJHN3    N9SHN3
     C                     MOVE 'S'       N9KKBN
     C                     WRITEAKDTP021
     C                     GOTO STEP56
     C                     END
     C           STEP55    TAG
     C                     Z-ADD0         SU
     C                     Z-ADD1         I
     C           1         DO   15        I
     C           KO,I      IFNE *BLANK
     C                     MOVE DH,I      KHBAN
     C                     MOVE BM,I      KBMON
     C                     MOVE KO,I      KKOTE
     C                     MOVE BN,I      KBANC
     C           KKEY      SETLLAKDPL021
     C                     SETOF                     16
     C                     READ AKDPL021                 16
     C   16                GOTO STEP84
     C           KHBAN     CABNEKHBANM    STEP84
     C           KKOTE     CABNEMNMKTE    STEP84
     C           KBMON     CABNEMNMBMN    STEP84
     C           KBANC     CABNEMBAND     STEP84
     C                     Z-ADDMNSRYO    SU,I
     C           STEP84    TAG
     C                     END
     C                     END
     C                     UPDATAKEPL011
     C           STEP83    TAG
     C                     SETON                     LR
