     H            Y.
     F** AKFR11 **************************
     F* .. COMPONENTS P/N  PLAN NOTICE PUBLICATION || *.
     F* I-HASADA             92.09.26    *
     F************************** AKFR11 **
     FAKFWP11 IP  F     100            DISK
     FAKFPL01 IF  E           K        DISK
     FAKEPL01 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FQPRINT  O   F      80     OF    LPRINTER
     LQPRINT   36FL 34OL
     E                    ZKOT       15  3               新工程uﾇjｰ
     E                    ZKBM       15  4 0             新部門uﾇjｰ
     E                    ZHIN       15 12               新品番uﾇjｰ
     E                    ZKMN       15  8 0             更新日uﾇjｰ
     E                    YKOT       15  3               旧工程uﾇjｰ
     E                    YKBM       15  4 0             旧部門uﾇjｰ
     E                    NKOT       15  3               新工程
     E                    NKBM       15  4 0             新部門
     E                    NHIN       15 12               新品番
     E                    NKMN       15  8 0             更新日
     E                    OKOT       15  3               旧工程
     E                    OKBM       15  4 0             旧部門
     E                    HKT        15  8               加工工程
     E                    HSM        15 11               細目名
     E                    NAM         4 24               変更理由名前
     E                    HIZ         4  8 0             変更理由切替日
     E                    CMT     1   6 24               変更理由テーブル
     E                    TSK     1   2 54               削除理由名
     E                    TKI     1   1 28               記号＝
     E                    TB1     1   2 16               量産Ｔ
     IAKFWP11 AA  01
     I                                        1   10IKOSN
     I                                        2   50IKBMN
     I                                        6   9 IUKER
     I                                       10  21 IKHIN
     I                                       10  14 IKHN1
     I                                       15  19 IKHN2
     I                                       20  21 IKHN3           22
     I                                       22  300IOGEK
     I                                       31  390INGEK
     I                                       40  40 IGEKH
     I            DS
     I                                        1  45 ZKOT
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600ZKBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1 180 ZHIN
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I            DS
     I                                        1 1200ZKMN
     I                                        1   80M3MN01
     I                                        9  160M3MN02
     I                                       17  240M3MN03
     I                                       25  320M3MN04
     I                                       33  400M3MN05
     I                                       41  480M3MN06
     I                                       49  560M3MN07
     I                                       57  640M3MN08
     I                                       65  720M3MN09
     I                                       73  800M3MN10
     I                                       81  880M3MN11
     I                                       89  960M3MN12
     I                                       97 1040M3MN13
     I                                      105 1120M3MN14
     I                                      113 1200M3MN15
     I            DS
     I                                        1  45 YKOT
     I                                        1   3 M3QK01
     I                                        4   6 M3QK02
     I                                        7   9 M3QK03
     I                                       10  12 M3QK04
     I                                       13  15 M3QK05
     I                                       16  18 M3QK06
     I                                       19  21 M3QK07
     I                                       22  24 M3QK08
     I                                       25  27 M3QK09
     I                                       28  30 M3QK10
     I                                       31  33 M3QK11
     I                                       34  36 M3QK12
     I                                       37  39 M3QK13
     I                                       40  42 M3QK14
     I                                       43  45 M3QK15
     I            DS
     I                                        1  600YKBM
     I                                        1   40M3QB01
     I                                        5   80M3QB02
     I                                        9  120M3QB03
     I                                       13  160M3QB04
     I                                       17  200M3QB05
     I                                       21  240M3QB06
     I                                       25  280M3QB07
     I                                       29  320M3QB08
     I                                       33  360M3QB09
     I                                       37  400M3QB10
     I                                       41  440M3QB11
     I                                       45  480M3QB12
     I                                       49  520M3QB13
     I                                       53  560M3QB14
     I                                       57  600M3QB15
     I            DS
     I                                        1   60B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
     I            DS
     I                                        1   8 WKOBM
     I                                        1   3 WKOTI
     I                                        4   4 H1
     I                                        5   80WKBMN
      *
     C           KEY1      KLIST
     C                     KFLD           IKHN1
     C                     KFLD           IKHN2
     C                     KFLD           IKHN3
      *
     C                     SETOF                     202130
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     606163
     C                     SETOF                     11
      *
     C                     MOVE *BLANK    NAM
     C                     Z-ADD0         HIZ
     C                     MOVE *BLANK    WKBM1   8
     C                     MOVE *BLANK    WKBM2   8
     C                     Z-ADD0         WHHK1
     C                     Z-ADD0         WHHK2
     C                     Z-ADD0         I       10
      *
     C*--------------------------------------*
     C*  ..構成品番計画通知書　マスター..  *
     C*--------------------------------------*
     C                     SETOF                     10
     C           KEY1      CHAINAKFPL011             10
     C           *IN10     IFEQ '1'
     C                     GOTO END
     C                     END
     C           IKOSN     IFEQ 0
     C                     SETON                     61
     C                     END
      *
     C                     SETON                     30
      *
     C           IUKER     IFNE *BLANK
     C                     SETON                     11
     C                     END
      *
     C*--------------------*
     C*  ..受入工場名..  *
     C*--------------------*
     C                     MOVE *BLANK    WSAMK  16
     C           IKBMN     IFEQ 8907
     C           IKBMN     OREQ 8888
      *
     C           IKBMN     IFEQ 8907
     C                     MOVE TB1,1     WSAMK
     C                     END
     C           IKBMN     IFEQ 8888
     C                     MOVE TB1,2     WSAMK
     C                     END
     C                     ELSE
      *
     C                     SETOF                     10
     C           IKBMN     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    WSAMK
     C                     END
     C                     END
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C                     SETOF                     10
     C                     MOVE *BLANK    ZKOT
     C                     Z-ADD0         ZKBM
     C                     MOVE *BLANK    ZHIN
     C                     Z-ADD0         ZKMN
     C                     MOVE *BLANK    YKOT
     C                     Z-ADD0         YKBM
     C           KEY1      CHAINAKEPL011             10
      *
     C                     Z-ADD1         A       20
     C                     Z-ADD0         B       20
     C                     MOVE *BLANK    NKOT
     C                     Z-ADD0         NKBM
     C                     MOVE *BLANK    NHIN
     C                     Z-ADD0         NKMN
     C                     MOVE *BLANK    OKOT
     C                     Z-ADD0         OKBM
     C           1         DO   15        A
     C           ZKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE ZKOT,A    NKOT,B
     C                     Z-ADDZKBM,A    NKBM,B
     C                     MOVE ZHIN,A    NHIN,B
     C                     Z-ADDZKMN,A    NKMN,B
     C                     END
     C                     END
      *
     C                     Z-ADD1         A
     C                     Z-ADD0         B
     C           1         DO   15        A
     C           YKOT,A    IFNE *BLANK
     C                     ADD  1         B
     C                     MOVE YKOT,A    OKOT,B
     C                     Z-ADDYKBM,A    OKBM,B
     C                     END
     C                     END
      *
     C*------------------------------------*
     C*  ..工程　部門　所番地　細目名..  *
     C*------------------------------------*
     C                     Z-ADD1         A
     C                     MOVE *BLANK    HKT
     C                     MOVE *BLANK    HSM
     C           1         DO   15        A
     C           NKOT,A    IFNE *BLANK
      *
     C                     MOVE NKOT,A    WKOTI
     C                     MOVE '-'       H1
     C                     Z-ADDNKBM,A    WKBMN
     C                     MOVE WKOBM     HKT,A
      *
     C                     SETOF                     10
     C                     Z-ADDNKBM,A    WKBMN   40
     C           WKBMN     CHAINFGBPL011             10
     C           *IN10     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVELB2SMEI    HSM,A
     C                     END
      *
     C                     END
     C                     END
      *
     C*--------------------------------------*
     C*  ..工程　部門　所番地　チェック..  *
     C*--------------------------------------*
     C           *IN61     IFEQ '0'
     C                     Z-ADD1         A
     C                     Z-ADD50        B
     C           1         DO   10        A
     C                     ADD  1         B
     C           NKMN,A    IFGE M4KOHZ
     C           NKOT,A    IFEQ OKOT,A
     C           NKBM,A    ANDEQOKBM,A
     C                     ELSE
     C                     MOVE '1'       *IN,B
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..更新区分　チェック..  *
     C*----------------------------*
     C           IKOSN     IFEQ 2
     C                     ADD  1         I
     C                     MOVEL'NEW-PD'  NAM,I
     C                     MOVEL'NEW-PD'  WKBM2
     C           INGEK     DIV  M4NSYS    WHHK2
     C                     GOTO STP1
     C                     ELSE
     C           IOGEK     IFEQ INGEK
     C                     MOVE 'AFT CHG 'WKBM2
     C                     ELSE
     C                     MOVE 'BEF CHG 'WKBM1
     C                     MOVE 'AFT CHG 'WKBM2
     C                     END
     C                     END
     C                     END
      *
     C*------------------*
     C*  ..全面廃止..  *
     C*------------------*
     C           *IN61     IFEQ '1'
     C                     Z-ADD1         F       20
     C           1         DO   15        F
     C                     SETOF                     62
     C           NHIN,F    IFNE *BLANK
     C           IKHIN     IFNE NHIN,F
     C                     SETON                     6263
     C                     END
     C                     END
     C  N62                END
     C                     ELSE
      *
     C*------------------------------*
     C*  ..月間必要数　チェック..  *
     C*------------------------------*
     C           M4GEKH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,1     NAM,I
     C                     Z-ADD0         HIZ,I
     C                     END
      *
     C*--------------------------*
     C*  ..収容数　チェック..  *
     C*--------------------------*
     C           M4SYSH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,2     NAM,I
     C                     Z-ADDM4SYHZ    HIZ,I
     C                     END
      *
     C*--------------------------------*
     C*  ..収容数切替日　チェック..  *
     C*--------------------------------*
     C           M4SYHH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,3     NAM,I
     C                     Z-ADDM4SYHZ    HIZ,I
     C                     END
      *
     C*------------------------*
     C*  ..工程　チェック..  *
     C*------------------------*
     C           M4KOTH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,4     NAM,I
     C                     Z-ADD0         HIZ,I
     C                     END
      *
     C*----------------------------*
     C*  ..完成単重　チェック..  *
     C*----------------------------*
     C           I         IFNE 4
     C           M4KATH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,5     NAM,I
     C                     Z-ADD0         HIZ,I
     C                     END
      *
     C*--------------------------*
     C*  ..立上日　チェック..  *
     C*--------------------------*
     C           I         IFNE 4
     C           M4TAHH    IFEQ '*'
     C                     ADD  1         I
     C                     MOVELCMT,6     NAM,I
     C                     Z-ADDM4TAHZ    HIZ,I
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------------------------*
     C*  ..日当必要数　日当箱数　比率　チェック..  *
     C*----------------------------------------------*
     C           *IN61     IFEQ '0'
     C           M4OSYS    IFEQ 0
     C                     Z-ADDM4NSYS    ZSYS    50
     C                     ELSE
     C                     Z-ADDM4OSYS    ZSYS
     C                     END
     C           IOGEK     DIV  ZSYS      WHHK1   62H
     C           INGEK     DIV  M4NSYS    WHHK2   62H
     C                     END
      *
     C           STP1      TAG
     C           WHHK1     COMP 0                    2020
     C           WHHK2     COMP 0                    2121
      *
     C           END       TAG
      *
     OQPRINT  H   0234 1P
     O                                   16 'PLAN NOTICE'
     O        D  101   30
     O                 11                13 'RECEIVING'
     O                         IUKER     18
     O                                   47 'COMPONENTS PART NUMBER'
     O        D  2     30
     O                         WSAMK     20
     O                         PAGE  Z   72
     O        D  1     30
     O                                   70 '========='
     O        D  2     30
     O                         UDATE Y   18
     O                N61      M4TAHZ    37 '    .  .  '
     O                N61      M4SYHZ    55 '    .  .  '
     O        D  1     30
     O                 61      TSK,1     61
     O                N61      NAM,1     31
     O                N61      HIZ,1     41 '    .  .  '
     O                N61      NAM,2     67
     O                N61      HIZ,2     77 '    .  .  '
     O        D  3     30
     O                 61 63   TSK,2     61
     O                N61      NAM,3     31
     O                N61      HIZ,3     41 '    .  .  '
     O                N61      NAM,4     67
     O                N61      HIZ,4     77 '    .  .  '
     O        D  2     30
     O                         TKI,1     65
     O        D  2     30
     O                N61      WKBM1     13
     O                N61      IOGEK 2   24
     O                 20N61   WHHK1     35 ' , 0 .  '
     O                N61      M4OSYS    71 '  ,   '
     O                N61      M4OSYT    74
     O        D  3     30
     O                N61      WKBM2     13
     O                N61      INGEK 2   24
     O                 21N61   WHHK2     35 ' , 0 .  '
     O                N61      M4NSYS    71 '  ,   '
     O                N61      M4NSYT    74
     O        D  1     30
     O                 51N61             16 '**'
     O                 52N61             29 '**'
     O                 53N61             42 '**'
     O                 54N61             55 '**'
     O                 55N61             68 '**'
     O        D  1     30
     O                         HKT,1     22
     O                         HKT,2     35
     O                         HKT,3     48
     O                         HKT,4     61
     O                         HKT,5     74
     O        D  1     30
     O                         HSM,1     24
     O                         HSM,2     37
     O                         HSM,3     50
     O                         HSM,4     63
     O                         HSM,5     76
     O        D  1     30
     O                                   12 '====='
     O        D  1     30
     O                 56N61             16 '**'
     O                 57N61             29 '**'
     O                 58N61             42 '**'
     O                 59N61             55 '**'
     O                 60N61             68 '**'
     O        D  1     30
     O                         HKT,6     22
     O                         HKT,7     35
     O                         HKT,8     48
     O                         HKT,9     61
     O                         HKT,10    74
     O        D  1     30
     O                         HSM,6     24
     O                         HSM,7     37
     O                         HSM,8     50
     O                         HSM,9     63
     O                         HSM,10    76
     O        D  1     30
     O                                   11 '======'
     O        D  1     30
     O                         HKT,11    22
     O                         HKT,12    35
     O                         HKT,13    48
     O                         HKT,14    61
     O                         HKT,15    74
     O        D  2     30
     O                         HSM,11    24
     O                         HSM,12    37
     O                         HSM,13    50
     O                         HSM,14    63
     O                         HSM,15    76
     O        D  1     30
     O                                   11 '======'
     O                                   25 '=='
     O                                   48 '====='
     O                                   71 '==='
     O        D  1     30
     O                                   50 '====='
     O                                   69 '='
     O        D  2     30
     O                N61      M4KATA2   58
     O                                   69 '='
     O        D  1     30
     O                         IKHN1     58
     O                                   59 '-'
     O                         IKHN2     64
     O                N22                65 '-'
     O                         IKHN3     67
      *
** CMT
MONTHLY QTY CHANGE
ACCOM QTY CHANGE
ACCOM QTY CHG DATE CHG
PROCESS CHANGE *
FINISHED UNIT WEIGHT CHG
DATE OF START PROD CHG
** TSK
CLIP ABOLISHED OLD PART STOCK AT EACH PROC
(THERE ARE COMMON PARTS)
** TKI
=========================
** TB1
MASS PROD T
PURCHASE
