     H            Y.
     F*** AKGR01 ***********************************
     F* IAF COMPONENTS PLATING KANBAN M/F INQUIRY *
     F*         S.YAMAGAMI 93.03.17                *
     F*********************************** AKGR01 ***
     FAKGPW01 CF  E                    WORKSTN
     FAKGPP01 IF  E                    DISK
     FAKGTL02 IF  E           K        DISK
     FAKGPL01 IF  E           K        DISK
     E                    ER      1  10 60               d[ｰ.xｮﾈｰﾆﾞ
     E                    CMT1    1  15  1   CMT2    8   ﾃx]n xb
     E                    ANO         7  4 0             SEQ-NO
     E                    ACM         7  8               ﾃx]n
     E                    ADI         7 14               ﾍ]ﾌﾞ]
     E                    APL         7  9               nﾃﾜ ﾌﾞ]k
     E                    AUK         7  4 0             cibﾛﾃcﾆﾞｭc
     E                    AUI         7  4               cibﾛ
     E                    AFR         7  9               ﾏcﾃcﾍﾞ.ﾍﾞ]
     E                    ATO         7  9               ﾆｮﾃcﾍﾞ.ﾍﾞ]
     E                    KEY         7 28               KEY jbﾍ
     E                    KCD         7  1               KEY f]ﾌﾞ]ﾆｬﾓb
     E                    HRT      1500 48
     I            DS
     I                                        1  280ANO
     I                                        1   40ANO1
     I                                        5   80ANO2
     I                                        9  120ANO3
     I                                       13  160ANO4
     I                                       17  200ANO5
     I                                       21  240ANO6
     I                                       25  280ANO7
     I            DS
     I                                        1  56 ACM
     I                                        1   8 ACM1
     I                                        9  16 ACM2
     I                                       17  24 ACM3
     I                                       25  32 ACM4
     I                                       33  40 ACM5
     I                                       41  48 ACM6
     I                                       49  56 ACM7
     I            DS
     I                                        1  98 ADI
     I                                        1  14 ADI1
     I                                       15  28 ADI2
     I                                       29  42 ADI3
     I                                       43  56 ADI4
     I                                       57  70 ADI5
     I                                       71  84 ADI6
     I                                       85  98 ADI7
     I            DS
     I                                        1  63 APL
     I                                        1   9 APL1
     I                                       10  18 APL2
     I                                       19  27 APL3
     I                                       28  36 APL4
     I                                       37  45 APL5
     I                                       46  54 APL6
     I                                       55  63 APL7
      *
     I            DS
     I                                        1  280AUK
     I                                        1   40AUK1
     I                                        5   80AUK2
     I                                        9  120AUK3
     I                                       13  160AUK4
     I                                       17  200AUK5
     I                                       21  240AUK6
     I                                       25  280AUK7
     I            DS
     I                                        1  28 AUI
     I                                        1   4 AUI1
     I                                        5   8 AUI2
     I                                        9  12 AUI3
     I                                       13  16 AUI4
     I                                       17  20 AUI5
     I                                       21  24 AUI6
     I                                       25  28 AUI7
      *
     I            DS
     I                                        1  63 AFR
     I                                        1   9 AFR1
     I                                       10  18 AFR2
     I                                       19  27 AFR3
     I                                       28  36 AFR4
     I                                       37  45 AFR5
     I                                       46  54 AFR6
     I                                       55  63 AFR7
     I            DS
     I                                        1  63 ATO
     I                                        1   9 ATO1
     I                                       10  18 ATO2
     I                                       19  27 ATO3
     I                                       28  36 ATO4
     I                                       37  45 ATO5
     I                                       46  54 ATO6
     I                                       55  63 ATO7
     I            DS
     I                                        1  48 AHRT
     I                                        1  12 AHIN
     I                                        1   5 AHIN1
     I                                        6  10 AHIN2
     I                                       11  12 AHIN3
     I                                       13  200AUKHZ
     I                                       21  220AUKBN
     I                                       23  23 ADTHE
     I                                       24  29 ATKR
     I                                       24  24 ATKR1
     I                                       25  26 ATKR2
     I                                       27  28 ATKR3
     I                                       29  29 ATKR4
     I                                       30  30 AKCD1
     I                                       31  380ASTHZ
     I                                       39  400ASTBN
     I                                       41  440AUKOJ
     I                                       45  48 AUKER
     I            DS
     I                                        1  48 XHRT
     I                                        1   6 XTKR
     I                                        1   1 XTKR1
     I                                        2   3 XTKR2
     I                                        4   5 XTKR3
     I                                        6   6 XTKR4
     I                                        7  140XUKHZ
     I                                       15  160XUKBN
     I                                       17  28 XHIN
     I                                       17  21 XHIN1
     I                                       22  26 XHIN2
     I                                       27  28 XHIN3
     I                                       29  29 XDTHE
     I                                       30  30 XKCD1
     I                                       31  380XSTHZ
     I                                       39  400XSTBN
     I                                       41  440XUKOJ
     I                                       45  48 XUKER
     I            DS
     I                                        1  14 DSDI
     I                                        1   5 BHIN1
     I                                        6   6 H1
     I                                        7  11 BHIN2
     I                                       12  12 H2
     I                                       13  14 BHIN3
     I            DS
     I                                        1   9 DSPL
     I                                        1   1 BTKR1
     I                                        2   2 T1
     I                                        3   4 BTKR2
     I                                        5   5 T2
     I                                        6   7 BTKR3
     I                                        8   8 T3
     I                                        9   9 BTKR4
     I            DS
     I                                        1   9 DSFR
     I                                        1   60BUKHZ
     I                                        7   7 U1
     I                                        8   90BUKBN
     I            DS
     I                                        1   9 DSTO
     I                                        1   60BSTHZ
     I                                        7   7 S1
     I                                        8   90BSTBN
     I            DS
     I                                        1  16 CKEY
     I                                        1   6 CTKR
     I                                        7  140CUKHZ
     I                                       15  160CUBIN
     I            DS
     I                                        1   80WSKHZ
     I                                        1   40WSKYY
     I                                        5   60WSKMM
     I                                        7   80WSKDD
      *
     C           KEY0      KLIST
     C                     KFLD           WDTHE
     C                     KFLD           WKCD1
      *
     C           KEY1      KLIST
     C                     KFLD           WDTHE
     C                     KFLD           WKCD1
     C                     KFLD           @UKOJ
     C                     KFLD           CHIN1
     C                     KFLD           WHIN2
     C                     KFLD           WHIN3
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
     C                     KFLD           WUKER
     C                     KFLD           WUKYY
     C                     KFLD           WUKMM
     C                     KFLD           WUKDD
     C                     KFLD           WUBIN
      *
     C           KEY2      KLIST
     C                     KFLD           ATKR1
     C                     KFLD           ATKR2
     C                     KFLD           ATKR3
     C                     KFLD           ATKR4
     C                     KFLD           AUKOJ
     C                     KFLD           AUKER
     C                     KFLD           VUKYY
     C                     KFLD           VUKMM
     C                     KFLD           VUKDD
     C                     KFLD           VUBIN
      *
     C           *ENTRY    PLIST
     C                     PARM           USER   10        ﾏｰﾅﾞｰ
      *
     C           ACALL     PLIST
     C                     PARM           USER             ﾏｰﾅﾞｰ
     C                     PARM           PLR              LR ﾆﾍｭc
     C                     PARM           PCD              ﾆｬcﾒｭcﾃｰnﾞ
     C                     PARM           PTKRO            ﾆﾞ nﾃﾜﾌﾞ]k
     C                     PARM           PUHZ             ﾏcﾃcﾍﾞ
     C                     PARM           PUBN                 ﾍﾞ]
     C                     PARM           PCM              ﾃcﾆ]obﾑc
     C                     PARM           PUKOJ            cibﾛﾃcﾆﾞｭc
     C                     PARM           PUKER            cibﾛ
      *
     C                     MOVE '-'       H1
     C                     MOVE '-'       H2
     C                     MOVE '-'       T1
     C                     MOVE '-'       T2
     C                     MOVE '-'       T3
     C                     MOVE '-'       U1
     C                     MOVE '-'       S1
      *
     C*****************************************************
     C* MO-NO0   fﾞx]-0    cibﾛﾃcﾆﾞｭc ﾆmb
     C*****************************************************
     C           STP0      TAG
     C                     Z-ADD0         @UKOJ
     C           STEP0     TAG
     C                     EXFMTAKGPW010
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'                        ﾃcﾈbﾍ]
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* ﾎﾞy] ﾆmb kｩｮh
     C*
     C           @UKOJ     IFNE 0111
     C           @UKOJ     ANDNE9999
     C                     SETON                     0199
     C                     MOVELER,1      MSG
     C                     GOTO STEP0
     C                     END
      *
     C                     MOVE *BLANK    SW1     1
     C           1         SETLLAKGPP011
     C                     DO   *HIVAL
     C                     SETOF                     10
     C                     READ AKGPP011                 10
     C           *IN10     IFEQ '0'
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    ANDLE*DATE
     C                     ELSE
     C           @UKOJ     IFEQ 9999
     C                     MOVE '*'       SW1
     C                     ELSE
     C           E1UKOJ    IFEQ @UKOJ
     C                     MOVE '*'       SW1
     C                     END
     C                     END
     C                     END
     C                     END
     C  N10                END
      *
     C           SW1       IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STEP0
     C                     END
      *
     C*****************************************************
     C* MO-NO2   fﾞx]-1
     C*****************************************************
     C           STEP1     TAG
     C                     EXFMTAKGPW011
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'                        ﾃcﾈbﾍ]
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO STP0
     C                     END
     C*
     C* ﾍ]ﾌﾞ]ﾆmb OR nﾃﾜﾌﾞ]kﾆmb ?
     C*
     C           NO        IFNE '1'
     C           NO        ANDNE'2'
     C                     SETON                     0199
     C                     MOVELER,3      MSG
     C                     GOTO STEP1
     C                     END
     C*
     C* nﾃﾜﾌﾞ]kﾆmb
     C*
     C           NO        IFEQ '2'
     C                     MOVE *BLANK    ATKR
     C                     GOTO STEP4
     C                     END
      *
     C*****************************************************
     C* MO-NO3   fﾞx]-2    ﾍ]ﾌﾞ]ﾆmb
     C*****************************************************
     C                     MOVE *BLANK    WHIN1
     C           STEP2     TAG
     C                     EXFMTAKGPW012
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO STEP1
     C                     END
     C*
     C*
     C* mﾞｰj qgjﾞﾆ
     C*
     C                     EXSR #SET1
     C           *IN99     IFEQ '1'
     C                     MOVELER,5      MSG
     C                     GOTO STEP2
     C                     END
      *
     C*****************************************************
     C* MO-NO4   fﾞx]-3    ﾍ]ﾌﾞ]ﾆmb
     C*****************************************************
     C           STEP3     TAG
     C                     EXFMTAKGPW013
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     Z-ADD0         ABNGO
     C                     MOVE *BLANK    WHIN1
     C                     GOTO STEP2
     C                     END
     C*
     C* CMD-7 ﾃcmbobnﾃﾜﾌﾞ]kuﾇjｰ ﾃcﾆ]
     C*
     C           *INKG     IFEQ '1'
     C                     CALL 'AAJR11'
     C                     PARM           USER
     C                     GOTO STEP3
     C                     END
     C*
     C* RULL-UP
     C*
     C           *IN91     IFEQ '1'
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,6      MSG
     C                     END
     C                     GOTO STEP3
     C                     END
     C*
     C* RULL-DOWN
     C*
     C           *IN92     IFEQ '1'
     C                     EXSR #RLDN
     C           *IN99     IFEQ '1'
     C                     MOVELER,7      MSG
     C                     END
     C                     GOTO STEP3
     C                     END
     C*
     C* ENTER = ROLL-UP
     C*
     C           ABNGO     IFEQ 0
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,6      MSG
     C                     END
     C                     GOTO STEP3
     C                     ELSE
     C                     SETOF                     30
     C                     Z-ADD1         I       40
     C           ABNGO     LOKUPANO,I                    30
     C           *IN30     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,8      MSG
     C                     GOTO STEP3
     C                     END
     C                     END
     C*
     C* ﾃcﾆ]ﾎﾟﾜhﾞ[w ﾑﾍﾞjﾞﾆ
     C*
     C                     Z-ADDABNGO     J       40
     C                     MOVE HRT,J     AHRT
     C                     MOVE *BLANK    PLR     2
     C                     MOVE *BLANK    PCD     1
     C                     MOVE ATKR      PTKRO   6
     C                     MOVE AUKHZ     PUHZ    8
     C                     MOVE AUKBN     PUBN    2
     C                     Z-ADDAUKOJ     PUKOJ   40
     C                     MOVE AUKER     PUKER   4
     C                     MOVE ACM,I     PCM     8
     C           AKCD1     IFEQ 'P'                        ﾃcﾈbﾍ]xｮg
     C                     SETON                     U1
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C           PCD       IFEQ '1'
     C                     EXSR #SET1
     C                     END
     C           *IN99     IFEQ '1'
     C                     MOVELER,5      MSG
     C                     GOTO STEP2
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     Z-ADD0         ANO
     C                     MOVE *BLANK    ACM
     C                     MOVE *BLANK    ADI
     C                     MOVE *BLANK    APL
     C                     Z-ADD0         AUK
     C                     MOVE *BLANK    AUI
     C                     MOVE *BLANK    AFR
     C                     MOVE *BLANK    ATO
     C                     MOVE ER,5      MSG
     C                     END
     C*
     C* ﾃcﾆ]ﾇﾞv
     C*
     C                     Z-ADD0         ABNGO
     C                     GOTO STEP3
      *
     C*****************************************************
     C* MO-NO5   fﾞx]-4    nﾃﾜﾌﾞ]kﾆmb
     C*****************************************************
     C           STEP4     TAG
     C                     EXFMTAKGPW014
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    NO
     C                     GOTO STEP1
     C                     END
     C*
     C* nﾃﾜﾌﾞ]k
     C*
     C           ATKR      IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVELER,9      MSG
     C                     GOTO STEP4
     C                     END
     C*
     C* mﾞｰj qgjﾞﾆ
     C*
     C                     EXSR #SET2
     C           *IN99     IFEQ '1'
     C                     MOVELER,6      MSG
     C                     GOTO STEP4
     C                     END
      *
     C*****************************************************
     C* MO-NO6   fﾞx]-5    nﾃﾜﾌﾞ]kﾆmb
     C*****************************************************
     C           STEP5     TAG
     C                     EXFMTAKGPW015
     C                     SETOF                     0199
     C           *INKA     IFEQ '1'
     C                     MOVE 'LR'      PLR
     C           *INU1     IFEQ '1'
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C*
     C* CMD-2 udﾉfﾞx]
     C*
     C           *INKB     IFEQ '1'
     C                     MOVE *BLANK    ABNGO
     C                     MOVE *BLANK    ATKR
     C                     GOTO STEP4
     C                     END
     C*
     C* CMD-7 ﾃcmbobnﾃﾜﾌﾞ]kuﾇjｰ ﾃcﾆ]
     C*
     C           *INKG     IFEQ '1'
     C                     CALL 'AAJR11'
     C                     PARM           USER
     C                     GOTO STEP5
     C                     END
     C*
     C* ROLL-UP
     C*
     C           *IN91     IFEQ '1'
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,6      MSG
     C                     END
     C                     GOTO STEP5
     C                     END
     C*
     C* ROLL-DOWN
     C*
     C           *IN92     IFEQ '1'
     C                     EXSR #RLDN
     C           *IN99     IFEQ '1'
     C                     MOVELER,7      MSG
     C                     END
     C                     GOTO STEP5
     C                     END
     C*
     C* ENTER = ROLL-UP
     C*
     C           ABNGO     IFEQ 0
     C                     EXSR #RLUP
     C           *IN99     IFEQ '1'
     C                     MOVELER,6      MSG
     C                     END
     C                     GOTO STEP5
     C                     ELSE
     C                     SETOF                     30
     C                     Z-ADD1         I
     C           ABNGO     LOKUPANO,I                    30
     C           *IN30     IFEQ '0'
     C                     SETON                     0199
     C                     MOVELER,8      MSG
     C                     GOTO STEP5
     C                     END
     C                     END
     C*
     C*****************************************************
     C* MO-NO7   ﾃcﾆ]ﾎﾟﾜhﾞ[w ﾑﾍﾞjﾞﾆ
     C*****************************************************
     C                     Z-ADDABNGO     J
     C                     MOVE HRT,J     XHRT
     C                     MOVE *BLANK    PLR
     C                     MOVE *BLANK    PCD
     C                     MOVE XTKR      PTKRO
     C                     MOVE XUKHZ     PUHZ
     C                     MOVE XUKBN     PUBN
     C                     Z-ADDXUKOJ     PUKOJ
     C                     MOVE XUKER     PUKER
     C                     MOVE ACM,I     PCM
     C           XKCD1     IFEQ 'P'                        ﾃcﾈbﾍ]xｮg
     C                     SETON                     U1
     C                     CALL 'AKGR02'  ACALL
     C                     END
     C           PCD       IFEQ '1'
     C                     EXSR #SET2
     C                     END
     C*
     C* ﾃcﾆ]ﾇﾞv
     C*
     C                     Z-ADD0         ABNGO
     C                     GOTO STEP5
      *
     C*****************************************************
     C* MO-NO8   mﾞｰjqgjﾞﾆ <ﾍ]ﾌﾞ]ﾆﾞｬ]>
     C*****************************************************
     C           #SET1     BEGSR
     C*
     C* mﾞｰji]ﾇc MAX=1500 p ﾆmb
     C*
     C                     Z-ADD0         A       40
     C                     Z-ADD1         E       40
     C                     MOVE *BLANK    HRT
     C           1         DO   1500      E
     C                     MOVEL''       HRT,E
     C                     END
     C                     MOVE *BLANK    WDTHE   1
     C                     MOVE *BLANK    CHIN1   5
     C                     MOVE *BLANK    WHIN2   5
     C                     MOVE *BLANK    WHIN3   2
     C                     MOVE *BLANK    WTKR1   1
     C                     MOVE *BLANK    WTKR2   2
     C                     MOVE *BLANK    WTKR3   2
     C                     MOVE *BLANK    WTKR4   1
     C                     MOVE *BLANK    WUKER   4
     C                     Z-ADD0         WUKYY   40
     C                     Z-ADD0         WUKMM   20
     C                     Z-ADD0         WUKDD   20
     C                     Z-ADD0         WUBIN   20
     C                     Z-ADD0         WNO
     C*
     C* ﾃcﾈbﾍ]xｮgf]ﾌﾞ]uﾇjｰ
     C*
     C                     MOVE 'P'       WKCD1   1
     C           KEY1      SETLLAKGTL021
     C*
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AKGTL021                 30
     C   30                GOTO ST1
     C           E1KCD1    CABNEWKCD1     ST1
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    CABLE*DATE     ST2
     C                     END
     C           E1DTHE    COMP *BLANK                   30
     C  N30                GOTO ST1
     C           E1UKOJ    CABNE@UKOJ     ST2
     C           E1SHN1    CABLTWHIN1     ST2
     C                     ADD  1         A
     C                     MOVE E1SHIN    AHIN
     C                     Z-ADDE1UKHZ    AUKHZ
     C                     Z-ADDE1UBIN    AUKBN
     C                     MOVE E1DTKO    ADTHE
     C                     MOVE E1ATKR    ATKR
     C                     MOVE E1KCD1    AKCD1
     C                     Z-ADDE1STHZ    ASTHZ
     C                     Z-ADDE1SBIN    ASTBN
     C                     Z-ADDE1UKOJ    AUKOJ
     C                     MOVE E1UKER    AUKER
     C                     MOVE AHRT      HRT,A
     C           ST2       TAG
     C                     END
     C           ST1       TAG
     C                     Z-ADDA         WNO     40
     C*
     C* mﾞｰj oﾆ
     C*
     C           A         CABEQ0         @00A           99
     C*
     C* SORT
     C*
     C                     SORTAHRT
     C                     Z-ADD0         B       40
     C                     EXSR #SUB1                      mﾞｰjﾈｮn
     C           @00A      ENDSR
      *
     C*****************************************************
     C* MO-NO9   mﾞｰjqgjﾞﾆ <nﾃﾜﾌﾞ]kﾆﾞｬ]>
     C*****************************************************
     C           #SET2     BEGSR
     C*
     C* mﾞｰji]ﾇc MAX=1500 p ﾆmb
     C*
     C                     Z-ADD0         A
     C                     Z-ADD1         E
     C                     MOVE *BLANK    HRT
     C           1         DO   1500      E
     C                     MOVEL''       HRT,E
     C                     END
     C                     Z-ADD0         AUKOJ   40
     C                     MOVE *BLANK    AUKER   4
     C                     Z-ADD0         VUKYY   40
     C                     Z-ADD0         VUKMM   20
     C                     Z-ADD0         VUKDD   20
     C                     Z-ADD0         VUBIN   20
     C                     Z-ADD0         WNO
     C*
     C* ﾃcﾈbﾍ]f]ﾌﾞ]uﾇjｰ
     C*
     C           KEY2      SETLLAKGPL011
     C                     DO   *HIVAL
     C                     SETOF                     30
     C                     READ AKGPL011                 30
     C   30                GOTO STP1
     C           ATKR      CABNEE1ATKR    STP1
     C           E1SKJY    IFEQ 'D'
     C           E1SKHZ    CABLE*DATE     STP2
     C                     END
     C                     ADD  1         A
     C                     MOVE E1SHIN    XHIN
     C                     Z-ADDE1UKHZ    XUKHZ
     C                     Z-ADDE1UBIN    XUKBN
     C                     MOVE E1ATKR    XTKR
     C                     MOVE E1DTKO    XDTHE
     C                     MOVE E1KCD1    XKCD1
     C                     Z-ADDE1STHZ    XSTHZ
     C                     Z-ADDE1SBIN    XSTBN
     C                     Z-ADDE1UKOJ    XUKOJ
     C                     MOVE E1UKER    XUKER
     C                     MOVE XHRT      HRT,A
     C           STP2      TAG
     C                     END
     C           STP1      TAG
     C                     Z-ADDA         WNO
     C*
     C* mﾞｰj oﾆ
     C*
     C           A         CABEQ0         @00B           99
     C*
     C* SORT
     C*
     C                     SORTAHRT
     C                     Z-ADD0         B
     C                     EXSR #SUB1                      mﾞｰjﾈｮn
     C           @00B      ENDSR
      *
     C*****************************************************
     C* MO-NO10  mﾞｰjﾈｮn
     C*****************************************************
     C           #SUB1     BEGSR
     C                     Z-ADD1         C       10
     C*
     C                     Z-ADD0         ANO              SEQ-NO
     C                     MOVE *BLANK    ACM              ﾃx]n
     C                     MOVE *BLANK    ADI              ﾍ]ﾌﾞ]
     C                     MOVE *BLANK    APL              nﾃﾜﾌﾞ]k
     C                     Z-ADD0         AUK              cibﾛﾃcﾆﾞｭc
     C                     MOVE *BLANK    AUI              cibﾛ
     C                     MOVE *BLANK    AFR              ﾏcﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    ATO              ﾆｮﾃcﾍﾞ.ﾍﾞ]
     C                     MOVE *BLANK    KEY              KEY.jbﾍ
     C                     MOVE *BLANK    KCD              KEYf]ﾌﾞ]ﾆｬﾓb
     C                     Z-ADD0         ABNGO
     C*
     C           1         DO   7         C
     C                     ADD  1         B
     C           B         CABGTWNO       @012
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C                     MOVE HRT,B     AHRT
     C                     Z-ADDB         ANO,C
     C                     SETOF                     30
     C                     Z-ADD1         D       20
     C           ADTHE     LOKUPCMT1,D                   30
     C   30                MOVE CMT2,D    ACM,C
     C                     MOVE AHIN1     BHIN1
     C                     MOVE AHIN2     BHIN2
     C                     MOVE AHIN3     BHIN3
     C                     MOVE DSDI      ADI,C
     C                     MOVE ATKR1     BTKR1
     C                     MOVE ATKR2     BTKR2
     C                     MOVE ATKR3     BTKR3
     C                     MOVE ATKR4     BTKR4
     C                     MOVE DSPL      APL,C
     C                     MOVE AKCD1     KCD,C
      ********
      ********
     C                     Z-ADDAUKOJ     AUK,C
     C                     MOVE AUKER     AUI,C
      ********
      ********
     C                     Z-ADDAUKHZ     BUKHZ
     C                     Z-ADDAUKBN     BUKBN
     C                     MOVE DSFR      AFR,C
     C                     Z-ADDASTHZ     BSTHZ
     C                     Z-ADDASTBN     BSTBN
     C                     MOVE DSTO      ATO,C
     C                     MOVE ATKR1     CTKR
     C                     Z-ADDAUKHZ     CUKHZ
     C                     Z-ADDAUKBN     CUBIN
     C                     MOVE CKEY      KEY,C
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C                     MOVE HRT,B     XHRT
     C                     Z-ADDB         ANO,C
     C                     SETOF                     30
     C                     Z-ADD1         D
     C           XDTHE     LOKUPCMT1,D                   30
     C   30                MOVE CMT2,D    ACM,C
     C                     MOVE XHIN1     BHIN1
     C                     MOVE XHIN2     BHIN2
     C                     MOVE XHIN3     BHIN3
     C                     MOVE DSDI      ADI,C
     C                     MOVE XKCD1     KCD,C
      ********
      ********
     C                     Z-ADDXUKOJ     AUK,C
     C                     MOVE XUKER     AUI,C
      ********
      ********
     C                     Z-ADDXUKHZ     BUKHZ
     C                     Z-ADDXUKBN     BUKBN
     C                     MOVE DSFR      AFR,C
     C                     Z-ADDXSTHZ     BSTHZ
     C                     Z-ADDXSTBN     BSTBN
     C                     MOVE DSTO      ATO,C
     C                     MOVE XTKR1     CTKR
     C                     Z-ADDXUKHZ     CUKHZ
     C                     Z-ADDXUKBN     CUBIN
     C                     MOVE CKEY      KEY,C
     C*
     C           C         CABEQ6         @012
     C                     END
     C                     END
     C           @012      TAG
     C                     ENDSR
      *
     C*****************************************************
     C* MO-NO11  ROLL-UP
     C*****************************************************
     C           #RLUP     BEGSR
     C                     Z-ADD0         ABNGO
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C           KEY,7     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,7     XXNO    40
     C                     ADD  1         XXNO
     C           XXNO      IFGT WNO
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,7     B
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C           KEY,6     IFEQ *BLANK
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,6     XXNO
     C                     ADD  1         XXNO
     C           XXNO      IFGT WNO
     C                     SETON                     99
     C                     GOTO @013
     C                     END
     C                     Z-ADDANO,6     B
     C                     END
     C                     EXSR #SUB1
     C           @013      ENDSR
      *
     C*****************************************************
     C* MO-NO12  ROLL-DOWN
     C*****************************************************
     C           #RLDN     BEGSR
     C                     Z-ADD0         ABNGO
     C           ANO,1     IFEQ 1
     C                     SETON                     99
     C                     GOTO @014
     C                     END
     C*
     C           NO        IFEQ '1'
     C*
     C* ﾍ]ﾌﾞ]ﾆmb mﾞｰjﾈｮn
     C*
     C                     Z-ADDANO,1     XXNO
     C                     SUB  8         XXNO
     C                     Z-ADDXXNO      B
     C*
     C                     ELSE
     C*
     C* nﾃﾜﾌﾞ]kﾆmb mﾞｰjﾈｮn
     C*
     C                     Z-ADDANO,1     XXNO
     C                     SUB  7         XXNO
     C                     Z-ADDXXNO      B
     C                     END
     C                     EXSR #SUB1
     C           @014      ENDSR
**  ER (ERROR-MESSAGE)
E-01 FACTORY IS WRONG
E-02 THERE ISN'T APPLICABLE DATA IN COMPONENTS PLATING K M/F
E-03 NO IS 1-2
E-04 WHEN FACTORY IS 9999, PART NO CAN NOT APPOINT
E-05 THERE IS NOT DATA INQUIRED TO
E-06 THERE IS NOT NEXT DATA
E-07 THERE IS NOT THE DATA WHICH GOES AHEAD OF
E-08 INPUT UPDATE NUMBER DISPLAYED
E-09 LOCATION ISN'T INPUT
**  CMT1/CMT2 (COMMENT NAME)
0 CANCEL                                                 1
1 UPDATED                                                2
2 ADD                                                    3
3 SET NBR                                                4
4 K KIND                                                 5
5 CHOP_D                                                 6
6 EFF DATE                                               7
7 LAPSE_D                                                8
8 KANBAN +                                               9
9 KANBAN -                                              10
A LOCATION                                              11
B MCH ALL                                               12
C REISSUE                                               13
D K ADD                                                 14
E K CHANGE                                              15
