     H            Y.
     F** AKHRA2 **************************************
     F* ..  MONTHLY AMOUNT WORK FILE BY COMPONENTS PROCESS  *.
     F* ..FOR KEY, IT IS MONTHLY CALCULATIONS      *
     F* .. INQUIRY                                 *
     F* ..WHEN UPDATE IT, YOU MUST UPDATE AKHR02, TOO
     F* ..WHEN UPDATE IT, YOU MUST UPDATE ABER05, TOO
     F* I-HASADA                      93.01.19       *
     F************************************** AKHRA2 **
     FAKDPL02 IF  E           K        DISK
     FAEBPL11 IF  E           K        DISK
     FAKHWPA2 UF  E           K        DISK                      A
     I            DS
     I                                        1  12 WSHIN
     I                                        1   5 WSHN1
     I                                        6  10 WSHN2
     I                                       11  12 WSHN3
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1  12 AGKHIN
     I                                        1   5 AGKHN1
     I                                        6  10 AGKHN2
     I                                       11  12 AGKHN3
     I            DS
     I                                        1  12 A@KHIN
     I                                        1   5 A@KHN1
     I                                        6  10 A@KHN2
     I                                       11  12 A@KHN3
      *
     C           KEY1      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           PKOTI
     C                     KFLD           WKBMN
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEY2      KLIST
     C                     KFLD           MNJHN1
     C                     KFLD           MNJHN2
     C                     KFLD           MNJHN3
      *
     C           KEY3      KLIST
     C                     KFLD           WSHN1
     C                     KFLD           WSHN2
     C                     KFLD           WSHN3
     C                     KFLD           @KBMN
     C                     KFLD           @UKER
      *
     C           *ENTRY    PLIST
     C                     PARM           PSHIN  12
     C                     PARM           PKOTI   3
     C                     PARM           PKBMN   4
     C                     PARM           PTKRO   6
     C                     PARM           PKBMK   1
     C                     MOVE PSHIN     WSHIN
     C                     MOVE PKBMN     WKBMN   40
     C                     MOVE PTKRO     WTKRO
      *
     C           KEY1      SETLLAKDPL021
     C                     DO   *HIVAL
     C                     SETOF                     10
     C           KEY1      READEAKDPL021                 10
     C           *IN10     IFEQ '0'
      *
     C           KEY2      SETLLAEBPL111
     C                     DO   *HIVAL
     C                     SETOF                     20
     C           KEY2      READEAEBPL111                 20
     C           *IN20     IFEQ '0'
      *
     C                     MOVE *BLANK    WBTKB   1
     C           AGNGEK    IFEQ 0
     C                     MOVE 'T'       WBTKB
     C                     END
      *
     C                     Z-ADDAGKBMN    @KBMN   40
     C                     MOVE AGUKER    @UKER   4
      *
     C                     SETOF                     30
     C           KEY3      CHAINAKHWPA21             30
     C           *IN30     IFEQ '1'
      *
     C                     MOVE WSHIN     A@KHIN
     C                     MOVE AGKOTI    A@KOTI
     C                     Z-ADD@KBMN     A@KBMN
     C                     MOVE @UKER     A@UKER
     C                     Z-ADDAGNGEK    A@GEKN
     C                     MOVE WBTKB     A@BTKB
     C                     WRITEAKHWPA21
     C                     ELSE
      *
     C                     ADD  AGNGEK    A@GEKN
     C                     UPDATAKHWPA21
     C                     END
      *
     C                     END
     C  N20                END
      *
     C                     END
     C  N10                END
      *
     C                     SETON                     LR
     C                     RETRN
