     H            Y.
     F** AKHRA5 ************************************
     F* .. COMPONENTS PLATING KANBAN M/F INQUIRY .. *.
     F* I-HASADA                    93.08.17       *
     F************************************ AKHRA5 **
     FAKHPWA5 CF  E                    WORKSTN
     FAKGPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     E                    JNM         6 16               条件名
     E                    JOK         6  2               条件
     I            DS
     I                                        1  96 JNM
     I                                        1  16 JNM1
     I                                       17  32 JNM2
     I                                       33  48 JNM3
     I                                       49  64 JNM4
     I                                       65  80 JNM5
     I                                       81  96 JNM6
     I            DS
     I                                        1  12 JOK
     I                                        1   2 E1JOK1
     I                                        3   4 E1JOK2
     I                                        5   6 E1JOK3
     I                                        7   8 E1JOK4
     I                                        9  10 E1JOK5
     I                                       11  12 E1JOK6
     I            DS
     I                                        1   6 PTKR
     I                                        1   1 PTKR1
     I                                        2   3 PTKR2
     I                                        4   5 PTKR3
     I                                        6   6 PTKR4
     I            DS
     I                                        1   80PUKHZ
     I                                        1   40PUKYY
     I                                        5   60PUKMM
     I                                        7   80PUKDD
     I            DS
     I                                        1  14 DSDI
     I                                        1   5 WSHN1
     I                                        6   6 D1
     I                                        7  11 WSHN2
     I                                       12  12 D2
     I                                       13  14 WSHN3
     I            DS
     I                                        1  16 SETNM
     I                                       16  16 BITC
     I            DS
     I                                        1   8 MAEK1
     I                                        1   3 E1MAEK
     I                                        4   4 M1
     I                                        5   80E1MAKB
     I            DS
     I                                        1   8 DSKT
     I                                        1   3 E1ATOK
     I                                        4   4 K1
     I                                        5   80E1ATOB
     I            DS
     I                                        1  16 NMB
     I                                       16  16 BITB
     I            DS
     I                                        1   9 MTKR
     I                                        1   1 E1MTK1
     I                                        2   2 MM1
     I                                        3   4 E1MTK2
     I                                        5   5 MM2
     I                                        6   7 E1MTK3
     I                                        8   8 MM3
     I                                        9   9 E1MTK4
     I            DS
     I                                        1  16 NMA
     I                                       16  16 BITA
     I            DS
     I                                        1   9 DSPL
     I                                        1   1 WATK1
     I                                        2   2 P1
     I                                        3   4 WATK2
     I                                        5   5 P2
     I                                        6   7 WATK3
     I                                        8   8 P3
     I                                        9   9 WATK4
      *
     C           AKEY      KLIST
     C                     KFLD           PTKR1
     C                     KFLD           PTKR2
     C                     KFLD           PTKR3
     C                     KFLD           PTKR4
     C                     KFLD           WUKOJ
     C                     KFLD           PUKER
     C                     KFLD           PUKYY
     C                     KFLD           PUKMM
     C                     KFLD           PUKDD
     C                     KFLD           PUBIN
      *
     C           BKY       KLIST
     C                     KFLD           E1SHN1
     C                     KFLD           E1SHN2
     C                     KFLD           E1SHN3
      *
     C           GCKEY1    KLIST
     C                     KFLD           E1KCD1
     C                     KFLD           E1KCD2
      *
     C           GCKEY2    KLIST
     C                     KFLD           E1ATOB
     C                     KFLD           E1ATYP
      *
     C           GCKEY3    KLIST
     C                     KFLD           E1MAKB
     C                     KFLD           E1MTYP
      *
     C           AAKEY     KLIST
     C                     KFLD           WJKN
     C                     KFLD           WJKB
      *
     C           *ENTRY    PLIST
     C                     PARM           PCMD3   1        CMD-3.9
     C                     PARM           PTKRO   6        nﾃﾜﾌﾞ]k
     C                     PARM           PUKOJ   4        cibﾛﾃcﾆﾞｭc
     C                     PARM           PUKER   4        cibﾛ
     C                     PARM           PUHZ    8        ﾏcﾃcﾍﾞ
     C                     PARM           PUBN    2            ﾍﾞ]
     C                     MOVE PTKRO     PTKR
     C                     MOVE PUKOJ     WUKOJ   40
     C                     MOVE PUHZ      PUKHZ
     C                     MOVE PUBN      PUBIN   20
      *
     C*--------------------------------------*
     C*  ..構成品メッキかんばんマスター..  *
     C*--------------------------------------*
     C                     SETOF                     10
     C           AKEY      CHAINAKGPL011             10
     C           *IN10     IFEQ '0'
     C           E1SKJY    ANDEQ'D'
     C           E1SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
     C                     MOVE '9'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     MOVE '-'       MM1
     C                     MOVE '-'       MM2
     C                     MOVE '-'       MM3
      *
     C                     Z-ADDE1KMAX    WKMAX
     C                     MOVE MAEK1     MAEK2
     C                     MOVE DSKT      ATOK2
      *
     C                     MOVE E1SHN1    WSHN1
     C                     MOVE E1SHN2    WSHN2
     C                     MOVE E1SHN3    WSHN3
     C                     MOVE '-'       D1
     C                     MOVE '-'       D2
     C                     MOVE DSDI      SHIN
      *
     C                     MOVE E1ATK1    WATK1
     C                     MOVE E1ATK2    WATK2
     C                     MOVE E1ATK3    WATK3
     C                     MOVE E1ATK4    WATK4
     C                     MOVE '-'       P1
     C                     MOVE '-'       P2
     C                     MOVE '-'       P3
     C                     MOVE DSPL      ATKR
      *
     C                     SETOF                     81
     C           E1KCD2    IFEQ 'Z'
     C                     SETON                     81
     C                     END
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     30
     C                     Z-ADD0         KASI
     C                     MOVE *BLANK    M1MEKI
     C           BKY       CHAINAKCPL011             30
     C           *IN30     IFEQ '0'
     C           M1SKJY    ANDEQ'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     Z-ADDM1KASI    KASI
     C                     END
      *
     C*----------------------*
     C*  ..設定マスター..  *
     C*----------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    SETNM
     C           E1STI1    CHAINAABPL011             30
     C           *IN30     IFEQ '0'
     C           A4SKJY    ANDEQ'D'
     C           A4SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELA4SETN    SETNM
     C*                    BITOF'01234567'BITC
     C*                    BITON'4567'    BITC
     C                     END
      *
     C*------------------------------*
     C*  ..かんばん種類マスター..  *
     C*------------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    KCDNM
     C           GCKEY1    CHAINGCMPL311             30
     C           *IN30     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELT3NAMN    KCDNM
     C                     END
      *
     C*----------------------*
     C*  ..条件マスター..  *
     C*----------------------*
     C                     Z-ADD1         I       20
     C                     MOVE *BLANK    JNM
     C           1         DO   6         I
     C                     MOVE 'P'       WJKB    1
     C           JOK,I     IFNE *BLANK
     C                     MOVE JOK,I     WJKN    2
      *
     C                     SETOF                     30
     C           AAKEY     CHAINAAAPL011             30
     C           *IN30     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C  N30                MOVELA5JOKM    JNM,I
     C                     END
     C                     END
     C                     END
      *
     C*--------------------------*
     C*  ..部門名称マスター..  *
     C*--------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    NMB
     C           GCKEY3    CHAINAATPL011             30
     C           *IN30     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELDCNAMN    NMB
     C                     END
      *
     C*--------------------------*
     C*  ..部門名称マスター..  *
     C*--------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    NMA
     C           GCKEY2    CHAINAATPL011             30
     C           *IN30     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELDCNAMN    NMA
     C                     END
      *
     C           @SCR1     TAG
     C                     EXFMTAKHPWA51
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '1'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*------------------------*
     C*  ..引取ロット照会..  *
     C*------------------------*
     C                     MOVE E1UKYY    PUYY    4
     C                     MOVE E1UKMM    PUMM    2
     C                     MOVE E1UKDD    PUDD    2
     C                     MOVE E1UBIN    PUBN    2
      *
     C           *INKB     IFEQ '1'
     C                     CALL 'AAJR16'
     C                     PARM           E1ATK1
     C                     PARM           E1ATK2
     C                     PARM           E1ATK3
     C                     PARM           E1ATK4
     C                     PARM           PUYY
     C                     PARM           PUMM
     C                     PARM           PUDD
     C                     PARM           PUBN
     C                     GOTO @SCR1
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
