     H            Y.
     F** AKHR06 ******************************************
     F* .. COMPONENTS TUNNEL KANBAN M/F KEY CHANGE  *
     F* I-HASADA                          93.04.14       *
     F****************************************** AKHR06 **
     FAKCPL01 IF  E           K        DISK
     FAKEPL01 IF  E           K        DISK
     FAKIPL01 UF  E           K        DISK                      A
     FAAJPL11 UF  E           K        DISK
     E                    HKO        15  3               新工程
     E                    HBM        15  4 0             新部門
     E                    HBN        15  6               新所番地
     E                    HHN        15 12               新代表品番
     E                    HNKA        3  3               fﾃcobﾑc-A  WORK
     E                    HNKB        3  3               fﾃcobﾑc-B  WORK
     E                    KNKA        3  3               fﾃcmbﾑc-A
     E                    KNKB        3  3               fﾃcmbﾑc-B
     I            DS
     I                                        1  45 HKO
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600HBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1  90 HBN
     I                                        1   6 M3NB01
     I                                        7  12 M3NB02
     I                                       13  18 M3NB03
     I                                       19  24 M3NB04
     I                                       25  30 M3NB05
     I                                       31  36 M3NB06
     I                                       37  42 M3NB07
     I                                       43  48 M3NB08
     I                                       49  54 M3NB09
     I                                       55  60 M3NB10
     I                                       61  66 M3NB11
     I                                       67  72 M3NB12
     I                                       73  78 M3NB13
     I                                       79  84 M3NB14
     I                                       85  90 M3NB15
     I            DS
     I                                        1 180 HHN
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I            DS
     I                                        1   80E2SKHZ
     I                                        1   40E2SKYY
     I                                        5   60E2SKMM
     I                                        7   80E2SKDD
     I            DS
     I                                        1   80E2KOHZ
     I                                        1   40E2KOYY
     I                                        5   60E2KOMM
     I                                        7   80E2KODD
     I            DS
     I                                        1   60E2TIME
     I                                        1   40E2KOHS
     I                                        1   20E2KOHH
     I                                        3   40E2KOSS
     I            DS
     I                                        1  12 E2SHIN
     I                                        1   5 E2SHN1
     I                                        6  10 E2SHN2
     I                                       11  12 E2SHN3
     I            DS
     I                                        1  100E2TKBI
     I                                        1   80E2TKHZ
     I                                        1   40E2TKYY
     I                                        5   60E2TKMM
     I                                        7   80E2TKDD
     I                                        9  100E2TBIN
     I            DS
     I                                        1  100E2UKBI
     I                                        1   80E2UKHZ
     I                                        1   40E2UKYY
     I                                        5   60E2UKMM
     I                                        7   80E2UKDD
     I                                        9  100E2UBIN
     I            DS
     I                                        1  100E2STBI
     I                                        1   80E2STHZ
     I                                        1   40E2STYY
     I                                        5   60E2STMM
     I                                        7   80E2STDD
     I                                        9  100E2SBIN
     I            DS
     I                                        1   6 E2AKRO
     I                                        1   1 E2BAN1
     I                                        2   3 E2BAN2
     I                                        4   5 E2BAN3
     I                                        6   6 E2BAN4
     I            DS
     I                                        1   6 E2MTKR
     I                                        1   1 E2MTK1
     I                                        2   3 E2MTK2
     I                                        4   5 E2MTK3
     I                                        6   6 E2MTK4
     I            DS
     I                                        1   40E2NTI1
     I                                        1   20E2NHH1
     I                                        3   40E2NMM1
     I            DS
     I                                        1   40E2NTI2
     I                                        1   20E2NHH2
     I                                        3   40E2NMM2
     I            DS
     I                                        1   60E2SKR1
     I                                        1   20E2SK11
     I                                        3   40E2SK21
     I                                        5   60E2SK31
     I            DS
     I                                        1   60E2SKR2
     I                                        1   20E2SK12
     I                                        3   40E2SK22
     I                                        5   60E2SK32
     I            DS
     I                                        1   9 KNKA
     I                                        1   3 E2KOA1
     I                                        4   6 E2KOA2
     I                                        7   9 E2KOA3
     I            DS
     I                                        1   9 KNKB
     I                                        1   3 E2KOB1
     I                                        4   6 E2KOB2
     I                                        7   9 E2KOB3
     I            DS
     I                                        1   80CJAKHZ
     I                                        1   40CJAKYY
     I                                        5   60CJAKMM
     I                                        7   80CJAKDD
     I            DS
     I                                        1  100@UKHB
     I                                        1   80@UKHZ
     I                                        1   40@UKYY
     I                                        5   60@UKMM
     I                                        7   80@UKDD
     I                                        9  100@UBIN
     I            DS
     I                                        1  12 @KHIN
     I                                        1   5 @KHN1
     I                                        6  10 @KHN2
     I                                       11  12 @KHN3
     I            DS
     I                                        1   6 WTKRO
     I                                        1   1 WTKR1
     I                                        2   3 WTKR2
     I                                        4   5 WTKR3
     I                                        6   6 WTKR4
     I            DS
     I                                        1   6 WMTKR
     I                                        1   1 WMTK1
     I                                        2   3 WMTK2
     I                                        4   5 WMTK3
     I                                        6   6 WMTK4
      *
     C           KEY1      KLIST
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
     C                     KFLD           @KBMN
     C                     KFLD           PUKER
      *
     C           KEY2      KLIST
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
      *
     C           KEY3      KLIST
     C                     KFLD           WTKR1
     C                     KFLD           WTKR2
     C                     KFLD           WTKR3
     C                     KFLD           WTKR4
     C                     KFLD           @KBMN
     C                     KFLD           PUKER
     C                     KFLD           @UKYY
     C                     KFLD           @UKMM
     C                     KFLD           @UKDD
     C                     KFLD           @UBIN
      *
     C           KEY4      KLIST
     C                     KFLD           @KHN1
     C                     KFLD           @KHN2
     C                     KFLD           @KHN3
      *
     C           KEY5      KLIST
     C                     KFLD           E2SHN1
     C                     KFLD           E2SHN2
     C                     KFLD           E2SHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PUS    10         ﾏｰﾅﾞｰﾎﾟﾜﾎｧｰ
     C                     PARM           PKUBN   1        更新区分
     C                     PARM           PKHIN  12        構成品番
     C                     PARM           PKOTI   3        組付工程
     C                     PARM           PKBMN   4        受入工場
     C                     PARM           PUKER   4        受入
     C                     PARM           POTKR   6        旧所番地
     C                     PARM           PNTKR   6        新所番地
     C                     PARM           PUKHZ   8        有効日
     C                     PARM           PUBIN   2        便
     C                     PARM           PGEKN   9        月間必要数
     C                     PARM           PRECD   2        工程№
     C                     PARM           PTKBI  10        前失効日
      *
     C                     MOVE PKHIN     @KHIN
     C                     MOVE PKBMN     @KBMN   40
     C                     MOVE PUKHZ     @UKHZ
     C                     MOVE PUBIN     @UBIN
     C                     MOVE PGEKN     @GEKN   90
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 1->更新区分が＇０＇の時は、取消処理                         *
     C* 2->　　　　　＇１＇の時は、追加処理                         *
     C* 3->新所番地と有効日－便が変わらない時、月間必要数変更       *
     C* 4->新所番地が変わらず有効日－便が変わった時、有効日－便変更 *
     C* 5->新所番地が変わった時、旧所番地が失効日・新所番地が追加   *
     C*---------------------------------------------------------------*
     C           PKUBN     CASEQ'1'       #SBR1
     C           PKUBN     CASEQ'2'       #SBR2
     C           PKUBN     CASEQ'3'       #SBR3
     C           PKUBN     CASEQ'4'       #SBR4
     C           PKUBN     CASEQ'5'       #SBR5
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 1->更新区分が＇０＇の時は、取消処理                         *
     C*---------------------------------------------------------------*
     C           #SBR1     BEGSR
      *
     C                     Z-ADD1         X       10
     C           1         DO   2         X
      *
     C           X         IFEQ 1
     C           POTKR     IFEQ *BLANK
     C                     GOTO #STP1
     C                     END
     C                     MOVE POTKR     WTKRO
     C                     ELSE
     C           PNTKR     IFEQ *BLANK
     C                     GOTO #STP1
     C                     END
     C                     MOVE PNTKR     WTKRO
     C                     END
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C           KEY1      SETLLAKIPL011
     C                     DO   *HIVAL
     C                     SETOF                     11
     C           KEY1      READEAKIPL011                 11
      *
     C           *IN11     IFEQ '0'
     C           E2SKJY    IFEQ 'D'
     C           E2SKHZ    ANDLE*DATE
     C                     ELSE
      *
     C                     MOVE 'D'       E2SKJY
     C                     Z-ADD*DATE     E2SKHZ
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     MOVE '0'       E2DTKO
      *
     C           E2STHZ    IFNE 99999999
     C                     MOVE '*'       E2DTHE
     C                     ELSE
     C                     MOVE *BLANK    E2DTHE
     C                     Z-ADD@UKHZ     E2STHZ
     C                     Z-ADD@UBIN     E2SBIN
     C                     END
     C                     UPDATAKIPL011
      *
     C                     END
     C                     END
     C  N11                END
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C           KEY2      SETGTAAJPL111
     C                     SETOF                     10
     C           KEY2      REDPEAAJPL111                 10
     C           *IN10     IFEQ '0'
      *
     C           @UKHZ     IFGT *DATE
     C                     Z-ADD@UKHZ     CJAKHZ
     C                     ELSE
     C                     Z-ADD*DATE     CJAKHZ
     C                     END
      *
     C                     MOVE *BLANK    CJHIN1
     C                     MOVE *BLANK    CJHIN2
     C                     MOVE *BLANK    CJHIN3
     C                     Z-ADD0         CJSYUY
     C                     MOVE *BLANK    CJMBN1
     C                     MOVE *BLANK    CJMBN2
     C                     MOVE *BLANK    CJMBN3
     C                     MOVE *BLANK    CJMBN4
     C                     Z-ADD0         CJSLOT
     C                     UPDATAAJPL111
     C                     END
      *
     C           #STP1     TAG
     C                     END
      *
     C                     ENDSR
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 2->更新区分が＇１＇の時は、追加処理                         *
     C*---------------------------------------------------------------*
     C           #SBR2     BEGSR
      *
     C                     MOVE PNTKR     WTKRO
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C                     SETOF                     12
     C           KEY3      CHAINAKIPL011             12
      *
     C                     MOVE *BLANK    E2SKJY
     C                     Z-ADD0         E2SKHZ
     C                     Z-ADD0         E2KOHZ
     C                     Z-ADD0         E2KOHS
     C                     MOVE *BLANK    E2KOME
     C                     MOVE *BLANK    E2SHIN
     C                     Z-ADD0         E2UKHZ
     C                     Z-ADD0         E2UBIN
     C                     Z-ADD0         E2STHZ
     C                     Z-ADD0         E2SBIN
     C                     MOVE *BLANK    E2KTEI
     C                     Z-ADD0         E2BMON
     C                     MOVE *BLANK    E2ATYP
     C                     MOVE *BLANK    E2AKRO
     C                     MOVE *BLANK    E2ATOH
     C                     MOVE *BLANK    E2MAEK
     C                     Z-ADD0         E2MAKB
     C                     MOVE *BLANK    E2MTYP
     C                     MOVE *BLANK    E2MTKR
     C                     MOVE *BLANK    E2MAEH
     C                     MOVE *BLANK    E2KOA1
     C                     MOVE *BLANK    E2KOA2
     C                     MOVE *BLANK    E2KOA3
     C                     MOVE *BLANK    E2KOB1
     C                     MOVE *BLANK    E2KOB2
     C                     MOVE *BLANK    E2KOB3
     C                     Z-ADD0         E2KOCD
     C                     MOVE *BLANK    E2KTYP
     C                     MOVE *BLANK    E2KAEH
     C                     MOVE *BLANK    E2RAIN
     C                     Z-ADD0         E2CBKO
     C                     Z-ADD0         E2BARA
     C                     Z-ADD0         E2BARB
     C                     MOVE *BLANK    E2JOK1
     C                     MOVE *BLANK    E2JOK2
     C                     MOVE *BLANK    E2JOK3
     C                     MOVE *BLANK    E2JOK4
     C                     MOVE *BLANK    E2JOK5
     C                     MOVE *BLANK    E2JOK6
     C                     MOVE *BLANK    E2KAK1
     C                     MOVE *BLANK    E2KAK2
     C                     MOVE *BLANK    E2KAK3
     C                     Z-ADD0         E2SYOS
     C                     MOVE *BLANK    E2SYOT
     C                     Z-ADD0         E2LTIM
     C                     Z-ADD0         E2KEIS
     C                     Z-ADD0         E2STI1
     C                     MOVE *BLANK    E2RIBH
     C                     Z-ADD0         E2LOTO
     C                     Z-ADD0         E2MAXH
     C                     MOVE *BLANK    E2YOUS
     C                     MOVE *BLANK    E2KCD1
     C                     MOVE *BLANK    E2KCD2
     C                     MOVE *BLANK    E2MEKI
     C                     MOVE *ZERO     E2ZETI
     C                     Z-ADD0         E2KSKB
     C                     Z-ADD0         E2KALL
     C                     Z-ADD0         E2MAIS
     C                     Z-ADD0         E2KMIN
     C                     Z-ADD0         E2KMAX
     C                     Z-ADD0         E2SRMS
     C                     Z-ADD0         E2ALHK
     C                     Z-ADD0         E2MXHK
     C                     MOVE *BLANK    E2KSHK
     C                     Z-ADD0         E2KTSU
     C                     Z-ADD0         E2KSSU
     C                     MOVE *BLANK    E2KOUT
     C                     MOVE *BLANK    E2DOUT
     C                     Z-ADD0         E2TISU
     C                     MOVE *BLANK    E2DTKO
     C                     MOVE *BLANK    E2DTHE
     C                     Z-ADD0         E2JDMS
     C                     Z-ADD0         E2NTI1
     C                     Z-ADD0         E2NTI2
     C                     Z-ADD0         E2SKR1
     C                     Z-ADD0         E2SKR2
     C                     Z-ADD0         E2SHIY
     C                     MOVE *BLANK    E2HINM
     C                     Z-ADD0         E2KASI
     C                     MOVE *BLANK    E2ZMEN
     C                     Z-ADD0         E2SRCD
     C                     MOVE *BLANK    E2SHKB
     C                     Z-ADD0         E2SEKU
     C                     MOVE *BLANK    E2KKTI
     C                     Z-ADD0         E2UKOJ
     C                     MOVE *BLANK    E2UKER
     C                     Z-ADD0         E2KUKJ
     C                     MOVE *BLANK    E2KUKE
      *
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     MOVE PTKBI     E2TKBI
     C                     Z-ADD@UKHZ     E2UKHZ
     C                     Z-ADD@UBIN     E2UBIN
     C                     Z-ADD99999999  E2STHZ
     C                     Z-ADD99        E2SBIN
     C                     MOVE WTKRO     E2AKRO
     C                     MOVE PKOTI     E2KKTI
     C                     Z-ADD@KBMN     E2UKOJ
     C                     MOVE PUKER     E2UKER
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C                     SETOF                     10
     C                     Z-ADD0         A       20
     C                     Z-ADD1         B       20
     C                     MOVE PRECD     I       20
     C           KEY4      CHAINAKEPL011             10
     C           *IN10     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVE HKO,I     E2KTEI
     C                     Z-ADDHBM,I     E2BMON
     C                     MOVE HHN,I     E2SHIN
     C                     MOVE HKO,I     HNKB,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
      *
     C           HBN,I     IFNE '------'
     C           HBN,I     ANDNE'++++++'
     C                     MOVE HKO,I     E2MAEK
     C                     Z-ADDHBM,I     E2MAKB
     C                     MOVE HBN,I     E2MTKR
     C                     SETON                     11
     C                     ELSE
      *
     C           E2BMON    IFEQ HBM,I
     C                     ADD  1         B
     C           B         IFLE 3
     C                     MOVE HKO,I     HNKB,B
     C                     END
     C                     ELSE
      *
     C                     ADD  1         A
     C           A         IFLE 3
     C                     Z-ADDHBM,I     E2KOCD
     C                     MOVE HKO,I     HNKA,A
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N11                END
     C                     END
      *
     C*------------------*
     C*  ..加工内容..  *
     C*------------------*
     C                     Z-ADD1         A
     C                     Z-ADD4         B
     C                     Z-ADD0         C       20
     C                     Z-ADD0         D       20
     C           1         DO   3         A
     C                     SUB  1         B
     C           HNKA,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HNKA,B    KNKA,C
     C                     END
     C           HNKB,B    IFNE *BLANK
     C                     ADD  1         D
     C                     MOVE HNKB,B    KNKB,D
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     10
     C           KEY5      CHAINAKCPL011             10
     C           *IN10     IFEQ '0'
     C                     Z-ADDM1KASI    E2KASI
     C                     MOVE M1MEKI    E2MEKI
     C                     MOVE M1ZENO    E2ZETI
      *
     C           M1SYHZ    IFGT E2UKHZ
     C                     Z-ADDM1KSYS    E2SYOS
     C                     MOVE M1KSYT    E2SYOT
     C                     ELSE
     C                     Z-ADDM1SSYS    E2SYOS
     C                     MOVE M1SSYT    E2SYOT
     C                     END
     C                     END
      *
     C                     Z-ADD@GEKN     E2KSSU
     C                     Z-ADD@GEKN     E2KTSU
     C                     MOVE '2'       E2DTKO
     C                     MOVE *BLANK    E2DTHE
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C                     MOVE *BLANK    WKCD1   1
     C                     MOVE *BLANK    WKCD2   1
     C           KEY2      SETGTAAJPL111
     C                     SETOF                     10
     C           KEY2      REDPEAAJPL111                 10
      *
     C           *IN10     IFEQ '0'
     C                     MOVE CJKDAI    WKCD1
     C                     MOVE CJKSYO    WKCD2
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     MOVE E2SHN1    CJHIN1
     C                     MOVE E2SHN2    CJHIN2
     C                     MOVE E2SHN3    CJHIN3
     C                     Z-ADD0         CJSYUY
     C                     MOVE E2MTK1    CJMBN1
     C                     MOVE E2MTK2    CJMBN2
     C                     MOVE E2MTK3    CJMBN3
     C                     MOVE E2MTK4    CJMBN4
     C                     Z-ADD0         CJSLOT
     C                     UPDATAAJPL111
     C                     END
      *
     C                     MOVE WKCD1     E2KCD1
     C                     MOVE WKCD2     E2KCD2
      *
     C           *IN12     IFEQ '1'
     C                     WRITEAKIPL011
     C                     ELSE
     C                     UPDATAKIPL011
     C                     END
      *
     C                     ENDSR
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 3->新所番地と有効日－便が変わらない時、月間必要数変更       *
     C*---------------------------------------------------------------*
     C           #SBR3     BEGSR
      *
     C                     MOVE PNTKR     WTKRO
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C                     SETOF                     13
     C           KEY3      CHAINAKIPL011             13
     C           *IN13     IFEQ '0'
     C           E2SKJY    ANDEQ'D'
     C           E2SKHZ    ANDLE*DATE
     C                     SETON                     13
     C                     END
      *
     C           *IN13     IFEQ '1'
     C                     EXSR #SBR2
     C                     ELSE
      *
     C                     MOVE *BLANK    E2DTHE
     C           @GEKN     IFNE E2KTSU
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C                     SETOF                     10
     C                     Z-ADD0         A
     C                     Z-ADD1         B
     C                     MOVE PRECD     I
     C                     MOVE *BLANK    HNKA
     C                     MOVE *BLANK    HNKB
     C                     MOVE *BLANK    KNKA
     C                     MOVE *BLANK    KNKB
     C                     MOVE *BLANK    E2KTEI
     C                     Z-ADD0         E2BMON
     C                     MOVE *BLANK    E2SHIN
     C                     MOVE *BLANK    E2MAEK
     C                     Z-ADD0         E2MAKB
     C                     MOVE *BLANK    E2MTKR
     C                     Z-ADD0         E2KOCD
      *
     C           KEY4      CHAINAKEPL011             10
     C           *IN10     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVE HKO,I     E2KTEI
     C                     Z-ADDHBM,I     E2BMON
     C                     MOVE HHN,I     E2SHIN
     C                     MOVE HKO,I     HNKB,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
      *
     C           HBN,I     IFNE '------'
     C           HBN,I     ANDNE'++++++'
     C                     MOVE HKO,I     E2MAEK
     C                     Z-ADDHBM,I     E2MAKB
     C                     MOVE HBN,I     E2MTKR
     C                     SETON                     11
     C                     ELSE
      *
     C           E2BMON    IFEQ HBM,I
     C                     ADD  1         B
     C           B         IFLE 3
     C                     MOVE HKO,I     HNKB,B
     C                     END
     C                     ELSE
      *
     C                     ADD  1         A
     C           A         IFLE 3
     C                     Z-ADDHBM,I     E2KOCD
     C                     MOVE HKO,I     HNKA,A
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N11                END
     C                     END
      *
     C*------------------*
     C*  ..加工内容..  *
     C*------------------*
     C                     Z-ADD1         A
     C                     Z-ADD4         B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C           1         DO   3         A
     C                     SUB  1         B
     C           HNKA,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HNKA,B    KNKA,C
     C                     END
     C           HNKB,B    IFNE *BLANK
     C                     ADD  1         D
     C                     MOVE HNKB,B    KNKB,D
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     10
     C                     MOVE *ZERO     E2ZETI
     C                     Z-ADD0         E2KASI
     C                     MOVE *BLANK    E2MEKI
      *
     C           KEY5      CHAINAKCPL011             10
     C           *IN10     IFEQ '0'
     C                     Z-ADDM1KASI    E2KASI
     C                     MOVE M1MEKI    E2MEKI
     C                     MOVE M1ZENO    E2ZETI
     C                     END
      *
     C                     Z-ADD@GEKN     E2KSSU
     C                     MOVE '3'       E2DTKO
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     UPDATAKIPL011
     C                     END
     C                     END
      *
     C                     ENDSR
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 4->新所番地が変わらず有効日－便が変わった時、有効日－便変更 *
     C*---------------------------------------------------------------*
     C           #SBR4     BEGSR
      *
     C                     MOVE PNTKR     WTKRO
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C           KEY1      SETGTAKIPL011
      *
     C                     SETOF                     14
     C           KEY1      REDPEAKIPL011                 14
      *
     C           *IN14     IFEQ '1'
     C                     EXSR #SBR2
     C                     ELSE
      *
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     MOVE '7'       E2DTKO
     C                     MOVE '*'       E2DTHE
     C                     Z-ADDE2UKBI    E2TKBI
     C                     MOVE E2TKBI    PTKBI
     C                     Z-ADD@UKHZ     E2STHZ
     C                     Z-ADD@UBIN     E2SBIN
     C                     UPDATAKIPL011
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C                     SETOF                     15
     C           KEY3      CHAINAKIPL011             15
      *
     C                     MOVE *BLANK    E2SKJY
     C                     Z-ADD0         E2SKHZ
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     MOVE PTKBI     E2TKBI
     C                     Z-ADD@UKHZ     E2UKHZ
     C                     Z-ADD@UBIN     E2UBIN
     C                     Z-ADD99999999  E2STHZ
     C                     Z-ADD99        E2SBIN
     C                     MOVE WTKR1     E2BAN1
     C                     MOVE WTKR2     E2BAN2
     C                     MOVE WTKR3     E2BAN3
     C                     MOVE WTKR4     E2BAN4
     C                     MOVE PKOTI     E2KKTI
     C                     Z-ADD@KBMN     E2UKOJ
     C                     MOVE PUKER     E2UKER
      *
     C*------------------------------------*
     C*  ..構成品かんばん切替マスター..  *
     C*------------------------------------*
     C                     SETOF                     10
     C                     Z-ADD0         A
     C                     Z-ADD1         B
     C                     MOVE PRECD     I
     C                     MOVE *BLANK    HNKA
     C                     MOVE *BLANK    HNKB
     C                     MOVE *BLANK    KNKA
     C                     MOVE *BLANK    KNKB
     C                     MOVE *BLANK    E2KTEI
     C                     Z-ADD0         E2BMON
     C                     MOVE *BLANK    E2SHIN
     C                     MOVE *BLANK    E2MAEK
     C                     Z-ADD0         E2MAKB
     C                     MOVE *BLANK    E2MTKR
     C                     Z-ADD0         E2KOCD
      *
     C           KEY4      CHAINAKEPL011             10
     C           *IN10     IFEQ '0'
     C           M3SKJY    ANDEQ'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '0'
     C                     MOVE HKO,I     E2KTEI
     C                     Z-ADDHBM,I     E2BMON
     C                     MOVE HHN,I     E2SHIN
     C                     MOVE HKO,I     HNKB,1
      *
     C                     SETOF                     11
     C                     DO   *HIVAL
     C           I         SUB  1         I
     C           I         IFEQ 0
     C                     SETON                     11
     C                     ELSE
      *
     C           HBN,I     IFNE '------'
     C           HBN,I     ANDNE'++++++'
     C                     MOVE HKO,I     E2MAEK
     C                     Z-ADDHBM,I     E2MAKB
     C                     MOVE HBN,I     E2MTKR
     C                     SETON                     11
     C                     ELSE
      *
     C           E2BMON    IFEQ HBM,I
     C                     ADD  1         B
     C           B         IFLE 3
     C                     MOVE HKO,I     HNKB,B
     C                     END
     C                     ELSE
      *
     C                     ADD  1         A
     C           A         IFLE 3
     C                     Z-ADDHBM,I     E2KOCD
     C                     MOVE HKO,I     HNKA,A
     C                     END
      *
     C                     END
     C                     END
     C                     END
     C  N11                END
     C                     END
      *
     C*------------------*
     C*  ..加工内容..  *
     C*------------------*
     C                     Z-ADD1         A
     C                     Z-ADD4         B
     C                     Z-ADD0         C
     C                     Z-ADD0         D
     C           1         DO   3         A
     C                     SUB  1         B
     C           HNKA,B    IFNE *BLANK
     C                     ADD  1         C
     C                     MOVE HNKA,B    KNKA,C
     C                     END
     C           HNKB,B    IFNE *BLANK
     C                     ADD  1         D
     C                     MOVE HNKB,B    KNKB,D
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     10
     C                     MOVE *ZERO     E2ZETI
     C                     Z-ADD0         E2KASI
     C                     MOVE *BLANK    E2MEKI
      *
     C           KEY5      CHAINAKCPL011             10
     C           *IN10     IFEQ '0'
     C                     Z-ADDM1KASI    E2KASI
     C                     MOVE M1MEKI    E2MEKI
     C                     MOVE M1ZENO    E2ZETI
     C                     END
      *
     C                     Z-ADD@GEKN     E2KSSU
     C                     MOVE '6'       E2DTKO
     C                     MOVE *BLANK    E2DTHE
     C                     MOVE *BLANK    E2KCD1
     C                     MOVE *BLANK    E2KCD2
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C                     MOVE *BLANK    WKCD1
     C                     MOVE *BLANK    WKCD2
     C           KEY2      SETGTAAJPL111
     C                     SETOF                     10
     C           KEY2      REDPEAAJPL111                 10
      *
     C           *IN10     IFEQ '0'
     C                     MOVE CJKDAI    WKCD1
     C                     MOVE CJKSYO    WKCD2
     C                     Z-ADD0         CJAKYY
     C                     Z-ADD0         CJAKMM
     C                     Z-ADD0         CJAKDD
     C                     MOVE E2SHN1    CJHIN1
     C                     MOVE E2SHN2    CJHIN2
     C                     MOVE E2SHN3    CJHIN3
     C                     MOVE E2MTK1    CJMBN1
     C                     MOVE E2MTK2    CJMBN2
     C                     MOVE E2MTK3    CJMBN3
     C                     MOVE E2MTK4    CJMBN4
     C                     UPDATAAJPL111
     C                     END
      *
     C                     MOVE WKCD1     E2KCD1
     C                     MOVE WKCD2     E2KCD2
      *
     C           *IN15     IFEQ '0'
     C                     UPDATAKIPL011
     C                     ELSE
     C                     WRITEAKIPL011
     C                     END
      *
     C                     END
     C                     ENDSR
      *
     C*---------------------------------------------------------------*
     C* #KUBN -->処理区分                                           *
     C* 5->新所番地が変わった時、旧所番地が失効日・新所番地が追加   *
     C*---------------------------------------------------------------*
     C           #SBR5     BEGSR
      *
     C*------------------*
     C*  ..旧所番地..  *
     C*------------------*
     C           POTKR     IFNE *BLANK
     C                     MOVE POTKR     WTKRO
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C           KEY1      SETGTAKIPL011
      *
     C                     SETOF                     16
     C           KEY1      REDPEAKIPL011                 16
     C           *IN16     IFEQ '0'
     C           E2SKJY    ANDEQ'D'
     C           E2SKHZ    ANDLE*DATE
     C                     SETON                     16
     C                     END
      *
     C           *IN16     IFEQ '0'
     C                     Z-ADDE2UKBI    E2TKBI
     C                     MOVE E2TKBI    PTKBI
     C                     Z-ADD@UKHZ     E2STHZ
     C                     Z-ADD@UBIN     E2SBIN
     C                     MOVE '7'       E2DTKO
     C                     MOVE *BLANK    E2DTHE
     C                     Z-ADD*DATE     E2KOHZ
     C                     TIME           E2TIME
     C                     MOVE PUS       E2KOME
     C                     UPDATAKIPL011
     C                     END
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C           KEY2      SETGTAAJPL111
     C                     SETOF                     10
     C           KEY2      REDPEAAJPL111                 10
      *
     C           *IN10     IFEQ '0'
     C                     Z-ADD@UKHZ     CJAKHZ
     C                     UPDATAAJPL111
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..新所番地　追加処理..  *
     C*----------------------------*
     C           PNTKR     IFNE *BLANK
     C                     EXSR #SBR2
     C                     END
      *
     C                     ENDSR
