     H            Y.
     F** AKHRA6 **************************************
     F* .. COMPONENTS TUNNEL KANBAN M/F INQUIRY .. *.
     F* I-HASADA                      93.08.17       *
     F************************************** AKHRA6 **
     FAKHPWA6 CF  E                    WORKSTN
     FAKIPL01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAABPL01 IF  E           K        DISK
     FAATPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FGCMPL31 IF  E           K        DISK
     E                    JOK         9  2               条件
     E                    JNM         9 16               条件名
     I            DS
     I                                        1  18 JOK
     I                                        1   2 E2JOK1
     I                                        3   4 E2JOK2
     I                                        5   6 E2JOK3
     I                                        7   8 E2JOK4
     I                                        9  10 E2JOK5
     I                                       11  12 E2JOK6
     I                                       13  14 E2KAK1
     I                                       15  16 E2KAK2
     I                                       17  18 E2KAK3
     I            DS
     I                                        1 144 JNM
     I                                        1  16 JNM1
     I                                       17  32 JNM2
     I                                       33  48 JNM3
     I                                       49  64 JNM4
     I                                       65  80 JNM5
     I                                       81  96 JNM6
     I                                       97 112 JNM7
     I                                      113 128 JNM8
     I                                      129 144 JNM9
     I            DS
     I                                        1   6 PTKR
     I                                        1   1 PTKR1
     I                                        2   3 PTKR2
     I                                        4   5 PTKR3
     I                                        6   6 PTKR4
     I            DS
     I                                        1   80PUKHZ
     I                                        1   40PUKYY
     I                                        5   60PUKMM
     I                                        7   80PUKDD
     I            DS
     I                                        1  14 DSDI
     I                                        1   5 WSHN1
     I                                        6   6 D1
     I                                        7  11 WSHN2
     I                                       12  12 D2
     I                                       13  14 WSHN3
     I            DS
     I                                        1  16 SETNM
     I                                       16  16 BITD
     I            DS
     I                                        1   8 DSKT
     I                                        1   3 E2KTEI
     I                                        4   4 K1
     I                                        5   80E2BMON
     I            DS
     I                                        1   8 MAEK1
     I                                        1   3 E2MAEK
     I                                        4   4 M1
     I                                        5   80E2MAKB
     I            DS
     I                                        1  16 NMA
     I                                       16  16 BITA
     I            DS
     I                                        1  16 NMB
     I                                       16  16 BITB
     I            DS
     I                                        1  16 NMC
     I                                       16  16 BITC
     I            DS
     I                                        1   9 DSPL
     I                                        1   1 WATK1
     I                                        2   2 P1
     I                                        3   4 WATK2
     I                                        5   5 P2
     I                                        6   7 WATK3
     I                                        8   8 P3
     I                                        9   9 WATK4
     I            DS
     I                                        1   9 DSPLM
     I                                        1   1 WMTK1
     I                                        2   2 P4
     I                                        3   4 WMTK2
     I                                        5   5 P5
     I                                        6   7 WMTK3
     I                                        8   8 P6
     I                                        9   9 WMTK4
      *
     C           AKEY      KLIST
     C                     KFLD           PTKR1
     C                     KFLD           PTKR2
     C                     KFLD           PTKR3
     C                     KFLD           PTKR4
     C                     KFLD           WUKOJ
     C                     KFLD           PUKER
     C                     KFLD           PUKYY
     C                     KFLD           PUKMM
     C                     KFLD           PUKDD
     C                     KFLD           PUBIN
      *
     C           BKY       KLIST
     C                     KFLD           E2SHN1
     C                     KFLD           E2SHN2
     C                     KFLD           E2SHN3
      *
     C           GCKEY1    KLIST
     C                     KFLD           E2KCD1
     C                     KFLD           E2KCD2
      *
     C           GCKEY2    KLIST
     C                     KFLD           E2BMON
     C                     KFLD           E2ATYP
      *
     C           GCKEY3    KLIST
     C                     KFLD           E2MAKB
     C                     KFLD           E2MTYP
      *
     C           GCKEY4    KLIST
     C                     KFLD           E2KOCD
     C                     KFLD           E2KTYP
      *
     C           AAKEY     KLIST
     C                     KFLD           WJKN
     C                     KFLD           WJKB
      *
     C           *ENTRY    PLIST
     C                     PARM           PCMD3   1        CMD-3.9
     C                     PARM           PTKRO   6        nﾃﾜﾌﾞ]k
     C                     PARM           PUKOJ   4        cibﾛﾃcﾆﾞｭc
     C                     PARM           PUKER   4        cibﾛ
     C                     PARM           PUHZ    8        ﾏcﾃcﾍﾞ
     C                     PARM           PUBN    2            ﾍﾞ]
     C                     MOVE PTKRO     PTKR
     C                     MOVE PUKOJ     WUKOJ   40
     C                     MOVE PUHZ      PUKHZ
     C                     MOVE PUBN      PUBIN   20
      *
     C*----------------------------------------*
     C*  ..構成品トンネルかんばんマスター..  *
     C*----------------------------------------*
     C                     SETOF                     10
     C           AKEY      CHAINAKIPL011             10
     C           *IN10     IFEQ '0'
     C           E2SKJY    ANDEQ'D'
     C           E2SKHZ    ANDLE*DATE
     C                     SETON                     10
     C                     END
     C           *IN10     IFEQ '1'
     C                     MOVE '9'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C                     Z-ADDE2KMAX    WKMAX
     C                     MOVE DSKT      ATOK2
     C                     MOVE MAEK1     MAEK2
      *
     C                     MOVE '-'       D1
     C                     MOVE '-'       D2
     C                     MOVE E2SHN1    WSHN1
     C                     MOVE E2SHN2    WSHN2
     C                     MOVE E2SHN3    WSHN3
     C                     MOVE DSDI      SHIN
      *
     C                     MOVE '-'       P1
     C                     MOVE '-'       P2
     C                     MOVE '-'       P3
     C                     MOVE E2BAN1    WATK1
     C                     MOVE E2BAN2    WATK2
     C                     MOVE E2BAN3    WATK3
     C                     MOVE E2BAN4    WATK4
     C                     MOVE DSPL      ATKR
      *
     C                     MOVE '-'       P4
     C                     MOVE '-'       P5
     C                     MOVE '-'       P6
     C                     MOVE E2MTK1    WMTK1
     C                     MOVE E2MTK2    WMTK2
     C                     MOVE E2MTK3    WMTK3
     C                     MOVE E2MTK4    WMTK4
     C                     MOVE DSPLM     MTKR
      *
     C*------------------------------*
     C*  ..構成部品情報マスター..  *
     C*------------------------------*
     C                     SETOF                     30
     C                     Z-ADD0         KASI
     C                     MOVE *BLANK    M1MEKI
     C           BKY       CHAINAKCPL011             30
     C           *IN30     IFEQ '0'
     C           M1SKJY    ANDEQ'D'
     C           M1SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     Z-ADDM1KASI    KASI
     C                     END
      *
     C*----------------------*
     C*  ..設定マスター..  *
     C*----------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    SETNM
     C           E2STI1    CHAINAABPL011             30
     C           *IN30     IFEQ '0'
     C           A4SKJY    ANDEQ'D'
     C           A4SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELA4SETN    SETNM
     C*                    BITOF'01234567'BITD
     C*                    BITON'4567'    BITD
     C                     END
      *
     C*------------------------------*
     C*  ..かんばん種類マスター..  *
     C*------------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    KCDNM
     C           GCKEY1    CHAINGCMPL311             30
     C           *IN30     IFEQ '0'
     C           T3SKJY    ANDEQ'D'
     C           T3SKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELT3NAMN    KCDNM
     C                     END
      *
     C*----------------------*
     C*  ..条件マスター..  *
     C*----------------------*
     C                     Z-ADD1         I       20
     C                     MOVE *BLANK    JNM
     C           1         DO   9         I
     C                     MOVE 'Q'       WJKB    1
     C           JOK,I     IFNE *BLANK
     C                     MOVE JOK,I     WJKN    2
      *
     C                     SETOF                     30
     C           AAKEY     CHAINAAAPL011             30
     C           *IN30     IFEQ '0'
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    COMP *DATE                  3030
     C                     END
     C  N30                MOVELA5JOKM    JNM,I
     C                     END
     C                     END
     C                     END
      *
     C*--------------------------*
     C*  ..部門名称マスター..  *
     C*--------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    NMA
     C           GCKEY2    CHAINAATPL011             30
     C           *IN30     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELDCNAMN    NMA
     C                     END
      *
     C*--------------------------*
     C*  ..部門名称マスター..  *
     C*--------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    NMB
     C           GCKEY3    CHAINAATPL011             30
     C           *IN30     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELDCNAMN    NMB
     C                     END
      *
     C*--------------------------*
     C*  ..部門名称マスター..  *
     C*--------------------------*
     C                     SETOF                     30
     C                     MOVE *BLANK    NMC
     C           GCKEY4    CHAINAATPL011             30
     C           *IN30     IFEQ '0'
     C           DCSKJY    ANDEQ'D'
     C           DCSKHZ    ANDLE*DATE
     C                     SETON                     30
     C                     END
     C           *IN30     IFEQ '0'
     C                     MOVELDCNAMN    NMC
     C                     END
      *
     C           @SCR1     TAG
     C                     EXFMTAKHPWA61
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '1'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*------------------------*
     C*  ..引取ロット照会..  *
     C*------------------------*
     C                     MOVE E2UKYY    PUYY    4
     C                     MOVE E2UKMM    PUMM    2
     C                     MOVE E2UKDD    PUDD    2
     C                     MOVE E2UKDD    PUBN    2
      *
     C           *INKB     IFEQ '1'
     C                     CALL 'AAJR16'
     C                     PARM           E2BAN1
     C                     PARM           E2BAN2
     C                     PARM           E2BAN3
     C                     PARM           E2BAN4
     C                     PARM           PUYY
     C                     PARM           PUMM
     C                     PARM           PUDD
     C                     PARM           PUBN
     C                     GOTO @SCR1
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
