     H            Y.
     F** AKHRA1 **************************
     F* .. COMPONENTS KANBAN PROCESS INQUIRY .. *.
     F* I-HASADA 93.01.19 *
     F************************** AKHRA1 **
     FAKHPWA1 CF  E                    WORKSTN
     FAKEPL01 IF  E           K        DISK
     FAKCPL01 IF  E           K        DISK
     FAKDPL02 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    WKO        15  3               工程
     E                    WBM        15  4               部門
     E                    WBN        15  6               番地
     E                    WDH        15 12               代表品番
     E                    WME        15 11               部門名
     E                    TP         15  1               かんばん種類i
     E                    SKO        15  3               新工程
     E                    SBM        15  4 0             新部門
     E                    SBN        15  6               新番地
     E                    SDH        15 12               新代表品番
     E                    SSU        15  9 0             工程設定数
     E                    SKB        15  1               新かんばん種類i
     E                    QKO        15  3               旧工程
     E                    QBM        15  4 0             旧部門
     E                    QBN        15  6               旧番地
     E                    QDH        15 12               旧代表品番
     E                    QKB        15  1               旧かんばん種類i
     E                    HIN        30 14               子品番
     E                    SRY        30  9 0             子品番設定数
     E                    ABM        15  4 0             部門WORK
     E                    ER      1   9 60                d[ｰxｮﾈｰﾆﾞ
     E                    TB1     1   2  4 0 TB2    16   受入工場名
     E                    TB3     1   3  1               かんばん種類
     I            DS
     I                                        1 180 WDH
     I                                        1  12 KDHN1
     I                                       13  24 KDHN2
     I                                       25  36 KDHN3
     I                                       37  48 KDHN4
     I                                       49  60 KDHN5
     I                                       61  72 KDHN6
     I                                       73  84 KDHN7
     I                                       85  96 KDHN8
     I                                       97 108 KDHN9
     I                                      109 120 KDHNA
     I                                      121 132 KDHNB
     I                                      133 144 KDHNC
     I                                      145 156 KDHND
     I                                      157 168 KDHNE
     I                                      169 180 KDHNF
     I            DS
     I                                        1 165 WME
     I                                        1  11 KBNE1
     I                                       12  22 KBNE2
     I                                       23  33 KBNE3
     I                                       34  44 KBNE4
     I                                       45  55 KBNE5
     I                                       56  66 KBNE6
     I                                       67  77 KBNE7
     I                                       78  88 KBNE8
     I                                       89  99 KBNE9
     I                                      100 110 KBNEA
     I                                      111 121 KBNEB
     I                                      122 132 KBNEC
     I                                      133 143 KBNED
     I                                      144 154 KBNEE
     I                                      155 165 KBNEF
     I            DS
     I                                        1  45 WKO
     I                                        1   3 KKOT1
     I                                        4   6 KKOT2
     I                                        7   9 KKOT3
     I                                       10  12 KKOT4
     I                                       13  15 KKOT5
     I                                       16  18 KKOT6
     I                                       19  21 KKOT7
     I                                       22  24 KKOT8
     I                                       25  27 KKOT9
     I                                       28  30 KKOTA
     I                                       31  33 KKOTB
     I                                       34  36 KKOTC
     I                                       37  39 KKOTD
     I                                       40  42 KKOTE
     I                                       43  45 KKOTF
     I            DS
     I                                        1  60 WBM
     I                                        1   4 KBMN1
     I                                        5   8 KBMN2
     I                                        9  12 KBMN3
     I                                       13  16 KBMN4
     I                                       17  20 KBMN5
     I                                       21  24 KBMN6
     I                                       25  28 KBMN7
     I                                       29  32 KBMN8
     I                                       33  36 KBMN9
     I                                       37  40 KBMNA
     I                                       41  44 KBMNB
     I                                       45  48 KBMNC
     I                                       49  52 KBMND
     I                                       53  56 KBMNE
     I                                       57  60 KBMNF
     I            DS
     I                                        1  45 SKO
     I                                        1   3 M3KO01
     I                                        4   6 M3KO02
     I                                        7   9 M3KO03
     I                                       10  12 M3KO04
     I                                       13  15 M3KO05
     I                                       16  18 M3KO06
     I                                       19  21 M3KO07
     I                                       22  24 M3KO08
     I                                       25  27 M3KO09
     I                                       28  30 M3KO10
     I                                       31  33 M3KO11
     I                                       34  36 M3KO12
     I                                       37  39 M3KO13
     I                                       40  42 M3KO14
     I                                       43  45 M3KO15
     I            DS
     I                                        1  600SBM
     I                                        1   40M3BM01
     I                                        5   80M3BM02
     I                                        9  120M3BM03
     I                                       13  160M3BM04
     I                                       17  200M3BM05
     I                                       21  240M3BM06
     I                                       25  280M3BM07
     I                                       29  320M3BM08
     I                                       33  360M3BM09
     I                                       37  400M3BM10
     I                                       41  440M3BM11
     I                                       45  480M3BM12
     I                                       49  520M3BM13
     I                                       53  560M3BM14
     I                                       57  600M3BM15
     I            DS
     I                                        1 180 SDH
     I                                        1  12 M3HB01
     I                                       13  24 M3HB02
     I                                       25  36 M3HB03
     I                                       37  48 M3HB04
     I                                       49  60 M3HB05
     I                                       61  72 M3HB06
     I                                       73  84 M3HB07
     I                                       85  96 M3HB08
     I                                       97 108 M3HB09
     I                                      109 120 M3HB10
     I                                      121 132 M3HB11
     I                                      133 144 M3HB12
     I                                      145 156 M3HB13
     I                                      157 168 M3HB14
     I                                      169 180 M3HB15
     I            DS
     I                                        1  90 SBN
     I                                        1   6 M3NB01
     I                                        7  12 M3NB02
     I                                       13  18 M3NB03
     I                                       19  24 M3NB04
     I                                       25  30 M3NB05
     I                                       31  36 M3NB06
     I                                       37  42 M3NB07
     I                                       43  48 M3NB08
     I                                       49  54 M3NB09
     I                                       55  60 M3NB10
     I                                       61  66 M3NB11
     I                                       67  72 M3NB12
     I                                       73  78 M3NB13
     I                                       79  84 M3NB14
     I                                       85  90 M3NB15
     I            DS
     I                                        1 1350SSU
     I                                        1   90M3SU01
     I                                       10  180M3SU02
     I                                       19  270M3SU03
     I                                       28  360M3SU04
     I                                       37  450M3SU05
     I                                       46  540M3SU06
     I                                       55  630M3SU07
     I                                       64  720M3SU08
     I                                       73  810M3SU09
     I                                       82  900M3SU10
     I                                       91  990M3SU11
     I                                      100 1080M3SU12
     I                                      109 1170M3SU13
     I                                      118 1260M3SU14
     I                                      127 1350M3SU15
     I            DS
     I                                        1  15 SKB
     I                                        1   1 M3TY01
     I                                        2   2 M3TY02
     I                                        3   3 M3TY03
     I                                        4   4 M3TY04
     I                                        5   5 M3TY05
     I                                        6   6 M3TY06
     I                                        7   7 M3TY07
     I                                        8   8 M3TY08
     I                                        9   9 M3TY09
     I                                       10  10 M3TY10
     I                                       11  11 M3TY11
     I                                       12  12 M3TY12
     I                                       13  13 M3TY13
     I                                       14  14 M3TY14
     I                                       15  15 M3TY15
     I            DS
     I                                        1  45 QKO
     I                                        1   3 M3QK01
     I                                        4   6 M3QK02
     I                                        7   9 M3QK03
     I                                       10  12 M3QK04
     I                                       13  15 M3QK05
     I                                       16  18 M3QK06
     I                                       19  21 M3QK07
     I                                       22  24 M3QK08
     I                                       25  27 M3QK09
     I                                       28  30 M3QK10
     I                                       31  33 M3QK11
     I                                       34  36 M3QK12
     I                                       37  39 M3QK13
     I                                       40  42 M3QK14
     I                                       43  45 M3QK15
     I            DS
     I                                        1  600QBM
     I                                        1   40M3QB01
     I                                        5   80M3QB02
     I                                        9  120M3QB03
     I                                       13  160M3QB04
     I                                       17  200M3QB05
     I                                       21  240M3QB06
     I                                       25  280M3QB07
     I                                       29  320M3QB08
     I                                       33  360M3QB09
     I                                       37  400M3QB10
     I                                       41  440M3QB11
     I                                       45  480M3QB12
     I                                       49  520M3QB13
     I                                       53  560M3QB14
     I                                       57  600M3QB15
     I            DS
     I                                        1 180 QDH
     I                                        1  12 M3QH01
     I                                       13  24 M3QH02
     I                                       25  36 M3QH03
     I                                       37  48 M3QH04
     I                                       49  60 M3QH05
     I                                       61  72 M3QH06
     I                                       73  84 M3QH07
     I                                       85  96 M3QH08
     I                                       97 108 M3QH09
     I                                      109 120 M3QH10
     I                                      121 132 M3QH11
     I                                      133 144 M3QH12
     I                                      145 156 M3QH13
     I                                      157 168 M3QH14
     I                                      169 180 M3QH15
     I            DS
     I                                        1  90 QBN
     I                                        1   6 M3QT01
     I                                        7  12 M3QT02
     I                                       13  18 M3QT03
     I                                       19  24 M3QT04
     I                                       25  30 M3QT05
     I                                       31  36 M3QT06
     I                                       37  42 M3QT07
     I                                       43  48 M3QT08
     I                                       49  54 M3QT09
     I                                       55  60 M3QT10
     I                                       61  66 M3QT11
     I                                       67  72 M3QT12
     I                                       73  78 M3QT13
     I                                       79  84 M3QT14
     I                                       85  90 M3QT15
     I            DS
     I                                        1  15 QKB
     I                                        1   1 M3QS01
     I                                        2   2 M3QS02
     I                                        3   3 M3QS03
     I                                        4   4 M3QS04
     I                                        5   5 M3QS05
     I                                        6   6 M3QS06
     I                                        7   7 M3QS07
     I                                        8   8 M3QS08
     I                                        9   9 M3QS09
     I                                       10  10 M3QS10
     I                                       11  11 M3QS11
     I                                       12  12 M3QS12
     I                                       13  13 M3QS13
     I                                       14  14 M3QS14
     I                                       15  15 M3QS15
     I            DS
     I                                        3  100CHHZ1
     I                                       13  200CHHZ2
     I                                       23  300CHHZ3
     I                                       33  400CHHZ4
     I                                       43  500CHHZ5
     I                                       53  600CHHZ6
     I                                       63  700CHHZ7
     I                                       73  800CHHZ8
     I                                       83  900CHHZ9
     I                                       93 1000CHHZA
     I                                      103 1100CHHZB
     I                                      113 1200CHHZC
     I                                      123 1300CHHZD
     I                                      133 1400CHHZE
     I                                      143 1500CHHZF
     I                                        1  100M3HZ01
     I                                       11  200M3HZ02
     I                                       21  300M3HZ03
     I                                       31  400M3HZ04
     I                                       41  500M3HZ05
     I                                       51  600M3HZ06
     I                                       61  700M3HZ07
     I                                       71  800M3HZ08
     I                                       81  900M3HZ09
     I                                       91 1000M3HZ10
     I                                      101 1100M3HZ11
     I                                      111 1200M3HZ12
     I                                      121 1300M3HZ13
     I                                      131 1400M3HZ14
     I                                      141 1500M3HZ15
     I            DS
     I                                        1  15 TP
     I                                        1   1 CKTY1
     I                                        2   2 CKTY2
     I                                        3   3 CKTY3
     I                                        4   4 CKTY4
     I                                        5   5 CKTY5
     I                                        6   6 CKTY6
     I                                        7   7 CKTY7
     I                                        8   8 CKTY8
     I                                        9   9 CKTY9
     I                                       10  10 CKTYA
     I                                       11  11 CKTYB
     I                                       12  12 CKTYC
     I                                       13  13 CKTYD
     I                                       14  14 CKTYE
     I                                       15  15 CKTYF
     I            DS
     I                                        1 420 HIN
     I                                        1  14 H01
     I                                       15  28 H02
     I                                       29  42 H03
     I                                       43  56 H04
     I                                       57  70 H05
     I                                       71  84 H06
     I                                       85  98 H07
     I                                       99 112 H08
     I                                      113 126 H09
     I                                      127 140 H10
     I                                      141 154 H11
     I                                      155 168 H12
     I                                      169 182 H13
     I                                      183 196 H14
     I                                      197 210 H15
     I                                      211 224 H16
     I                                      225 238 H17
     I                                      239 252 H18
     I                                      253 266 H19
     I                                      267 280 H20
     I                                      281 294 H21
     I                                      295 308 H22
     I                                      309 322 H23
     I                                      323 336 H24
     I                                      337 350 H25
     I                                      351 364 H26
     I                                      365 378 H27
     I                                      379 392 H28
     I                                      393 406 H29
     I                                      407 420 H30
     I            DS
     I                                        1 2700SRY
     I                                        1   90S01
     I                                       10  180S02
     I                                       19  270S03
     I                                       28  360S04
     I                                       37  450S05
     I                                       46  540S06
     I                                       55  630S07
     I                                       64  720S08
     I                                       73  810S09
     I                                       82  900S10
     I                                       91  990S11
     I                                      100 1080S12
     I                                      109 1170S13
     I                                      118 1260S14
     I                                      127 1350S15
     I                                      136 1440S16
     I                                      145 1530S17
     I                                      154 1620S18
     I                                      163 1710S19
     I                                      172 1800S20
     I                                      181 1890S21
     I                                      190 1980S22
     I                                      199 2070S23
     I                                      208 2160S24
     I                                      217 2250S25
     I                                      226 2340S26
     I                                      235 2430S27
     I                                      244 2520S28
     I                                      253 2610S29
     I                                      262 2700S30
     I            DS
     I                                        1  12 IKHIN
     I                                        1   5 IKHN1
     I                                        6  10 IKHN2
     I                                       11  12 IKHN3
     I            DS
     I                                        1  14 WKHIN
     I                                        1   5 WKHN1
     I                                        6   6 H1
     I                                        7  11 WKHN2
     I                                       12  12 H2
     I                                       13  14 WKHN3
     I            DS
     I                                        1  12 @@DHIN
     I                                        1   5 @@DHN1
     I                                        6  10 @@DHN2
     I                                       11  12 @@DHN3
     I            DS
     I                                        1  14 @DHIN
     I                                        1   5 @DHN1
     I                                        6   6 @DH1
     I                                        7  11 @DHN2
     I                                       12  12 @DH2
     I                                       13  14 @DHN3
     I            DS
     I                                        1   6 @@TKRO
     I                                        1   1 @@TKR1
     I                                        2   3 @@TKR2
     I                                        4   5 @@TKR3
     I                                        6   6 @@TKR4
     I            DS
     I                                        1   9 @TKRO
     I                                        1   1 @TKR1
     I                                        2   2 @TK1
     I                                        3   4 @TKR2
     I                                        5   5 @TK2
     I                                        6   7 @TKR3
     I                                        8   8 @TK3
     I                                        9   9 @TKR4
     I            DS
     I                                        1  14 MNJHIN
     I                                        1   5 MNJHN1
     I                                        6   6 MNJH1
     I                                        7  11 MNJHN2
     I                                       12  12 MNJH2
     I                                       13  14 MNJHN3
      *
     C           KEY1      KLIST
     C                     KFLD           IKHN1
     C                     KFLD           IKHN2
     C                     KFLD           IKHN3
      *
     C           KEY2      KLIST
     C                     KFLD           @@DHN1
     C                     KFLD           @@DHN2
     C                     KFLD           @@DHN3
     C                     KFLD           @KOTI
     C                     KFLD           @@BMON
     C                     KFLD           @@TKR1
     C                     KFLD           @@TKR2
     C                     KFLD           @@TKR3
     C                     KFLD           @@TKR4
      *
     C           *ENTRY    PLIST
     C                     PARM           PCMD3   1
      *
     C           PCALL     PLIST
     C                     PARM           @CMD3   1
     C                     PARM           @KHIN  12
     C                     PARM           @KOTI   3
     C                     PARM           @KBMN   4
     C                     PARM           @NTKR   6
     C                     PARM           @RECD   2
     C                     PARM           @SBMN   4
     C                     PARM           @KBMK   1
     C                     PARM           @KANB   1
      *
     C*------------------*
     C*  ..画面－１..  *
     C*------------------*
     C           STP1      TAG
     C                     EXFMTAKHPWA11
     C                     SETOF                     010299
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '1'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*------------------*
     C*  ..構成品番..  *
     C*------------------*
     C           IKHIN     IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------*
     C*  ..受入工場..  *
     C*------------------*
     C           IKBMN     IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     SETOF                     80
     C                     Z-ADD1         A       20
     C                     MOVE *BLANK    WSMEI
     C           IKBMN     LOKUPTB1,A                    80
     C           *IN80     IFEQ '0'
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C                     Z-ADDIKBMN     WKBMN
     C                     MOVE TB2,A     WSMEI
      *
     C*------------------------------------------*
     C*  ..構成品かんばん　切り替えマスター..  *
     C*------------------------------------------*
     C                     SETOF                     80
     C           KEY1      CHAINAKEPL011             80
     C           *IN80     IFEQ '1'
     C                     SETON                     0199
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           M3SKJY    IFEQ 'D'
     C           M3SKHZ    ANDLE*DATE
     C                     SETON                     0199
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C                     Z-ADDM3KOHZ    WKOHZ
      *
     C                     MOVE *BLANK    WKHIN
     C                     MOVE IKHN1     WKHN1
     C                     MOVE IKHN2     WKHN2
     C                     MOVE IKHN3     WKHN3
     C           WKHN2     IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           WKHN3     IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
      *
     C*--------------------------------*
     C*  ..構成部品　情報マスター..  *
     C*--------------------------------*
     C                     SETOF                     80
     C                     MOVE *BLANK    WZETI
     C                     MOVE *BLANK    WTHAI
     C                     Z-ADD0         M1GEKN
     C           KEY1      CHAINAKCPL011             80
     C           *IN80     IFEQ '0'
     C                     MOVE M1ZENO    WZETI
     C           M1TEHI    IFEQ 'G'
     C                     MOVEL'G-V-PROD'WTHAI
     C                     ELSE
     C                     MOVEL'S-T-MFG 'WTHAI
     C                     END
     C                     END
      *
     C*----------------*
     C*  ..新工程..  *
     C*----------------*
     C                     Z-ADD0         WRECD
     C                     Z-ADD0         @KORD
     C                     MOVEASKO       WKO
     C                     Z-ADDSBM       ABM
     C                     MOVEASBN       WBN
     C                     MOVEASDH       WDH
     C                     MOVEASKB       TP
     C                     EXSR SUBRTN
      *
     C*------------------*
     C*  ..画面－２..  *
     C*------------------*
     C           STP2      TAG
     C                     EXFMTAKHPWA12
     C                     SETOF                     040599
      *
     C           *INKC     IFEQ '1'
     C                     MOVE *BLANK    IKHIN
     C                     GOTO STP1
     C                     END
      *
     C*------------------*
     C*  ..画面－３..  *
     C*  ..旧工程      *
     C*------------------*
     C           *INKI     IFEQ '1'
     C                     MOVEAQKO       WKO
     C                     Z-ADDQBM       ABM
     C                     MOVEAQBN       WBN
     C                     MOVEAQDH       WDH
     C                     MOVEAQKB       TP
     C                     EXSR SUBRTN
     C                     EXFMTAKHPWA13
      *
     C*----------------*
     C*  ..新工程..  *
     C*----------------*
     C                     Z-ADD0         WRECD
     C                     MOVEASKO       WKO
     C                     Z-ADDSBM       ABM
     C                     MOVEASBN       WBN
     C                     MOVEASDH       WDH
     C                     MOVEASKB       TP
     C                     EXSR SUBRTN
     C                     GOTO STP2
     C                     END
      *
     C*------------------------------------*
     C*  ..工程内共通ブランク品番照会..  *
     C*------------------------------------*
     C           @KORD     IFNE 0
     C           @KORD     IFGT 15
     C                     SETON                     0599
     C                     MOVE ER,9      MSG
     C                     GOTO STP2
     C                     ELSE
      *
     C                     Z-ADD0         C       20
     C                     MOVE *BLANK    HIN
     C                     Z-ADD0         SRY
     C                     Z-ADD0         GSTSU
     C                     MOVE '-'       @DH1
     C                     MOVE '-'       @DH2
     C                     MOVE '-'       @TK1
     C                     MOVE '-'       @TK2
     C                     MOVE '-'       @TK3
      *
     C                     Z-ADD@KORD     B       20
     C                     MOVE SDH,B     @@DHIN
     C                     MOVE @@DHN1    @DHN1
     C                     MOVE @@DHN2    @DHN2
     C                     MOVE @@DHN3    @DHN3
     C                     MOVE SKO,B     @KOTI
     C                     Z-ADDSBM,B     @@BMON  40
     C                     MOVE SBM,B     @BMON
     C                     MOVE SBN,B     @@TKRO
     C                     MOVE @@TKR1    @TKR1
     C                     MOVE @@TKR2    @TKR2
     C                     MOVE @@TKR3    @TKR3
     C                     MOVE @@TKR4    @TKR4
      *
     C           KEY2      SETLLAKDPL021
     C                     DO   *HIVAL
     C                     SETOF                     91
     C           KEY2      READEAKDPL021                 91
     C           *IN91     IFEQ '0'
      *
     C                     MOVE '-'       MNJH1
     C                     MOVE '-'       MNJH2
      *
     C                     SETOF                     92
     C                     Z-ADD1         A
     C           MNJHIN    LOKUPHIN,A                    92
     C           *IN92     IFEQ '0'
     C                     ADD  1         C
      *
     C           C         IFGT 30
     C                     SETON                     91
     C                     ELSE
     C                     MOVE MNJHIN    HIN,C
     C                     Z-ADDMNSETI    SRY,C
     C                     ADD  MNSETI    GSTSU
     C                     END
      *
     C                     END
     C                     END
     C  N91                END
      *
     C                     EXFMTAKHPWA14
     C                     Z-ADD0         @KORD
     C                     GOTO STP2
     C                     END
     C                     END
      *
     C*--------------------------*
     C*  ..かんばん照会番号..  *
     C*--------------------------*
     C           WRECD     IFEQ 0
     C                     SETON                     0499
     C                     MOVE ER,6      MSG
     C                     GOTO STP2
     C                     END
      *
     C           WRECD     IFGT 15
     C                     SETON                     0499
     C                     MOVE ER,7      MSG
     C                     GOTO STP2
     C                     END
      *
     C                     SETOF                     27
     C                     Z-ADDWRECD     B       20
     C                     MOVE TP,B      WKANB   1
     C           TP,B      LOKUPTB3                      27
     C           *IN27     IFEQ '0'
     C                     SETON                     0499
     C                     MOVE ER,8      MSG
     C                     GOTO STP2
     C                     END
      *
     C           B         ADD  1         C       20
      *
     C                     SETOF                     26
     C                     Z-ADD1         D       20
     C                     MOVE *BLANK    @KBMK
      *
     C           C         DO   15        D
     C           TP,D      IFNE *BLANK
     C                     SETON                     26
     C           TP,D      IFEQ 'P'
     C           TP,D      OREQ 'Q'
     C                     MOVE 'P'       @KBMK
     C                     END
     C                     END
     C  N26                END
      *
     C                     MOVE *BLANK    @CMD3
     C                     MOVE WDH,B     @KHIN
     C                     MOVE WKO,B     @KOTI
     C                     MOVE WBM,B     @KBMN
     C                     MOVE WBN,B     @NTKR
     C                     MOVE WRECD     @RECD
     C                     MOVE IKBMN     @SBMN
     C                     MOVE WKANB     @KANB
      *
     C                     CALL 'AKHCA2'  PCALL
      *
     C           @CMD3     IFEQ '1'
     C                     Z-ADD0         WRECD
     C                     GOTO STP2
     C                     ELSE
      *
     C                     MOVE *BLANK    IKHIN
     C                     GOTO STP1
     C                     END
      *
     C*--------------------------------*
     C*      ..サブルーチン..        *
     C*  ..部門名・代表品番検索..    *
     C*--------------------------------*
     C           SUBRTN    BEGSR
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     03
      *
     C                     Z-ADD1         I       20
     C                     MOVE *BLANK    WME
     C                     MOVE *BLANK    WBM
     C           1         DO   15        I
     C           ABM,I     IFNE 0
     C                     MOVE ABM,I     WBM,I
     C                     SETOF                     81
     C                     MOVE WBM,I     XBM     40
     C           XBM       CHAINFGBPL011             81
     C           *IN81     IFEQ '0'
     C                     MOVELB2SMEI    WME,I
     C                     END
     C                     END
     C                     END
      *
     C                     SETOF                     81
     C                     Z-ADD16        A       20
     C                     Z-ADD1         I
     C           1         DO   15        I
     C                     SUB  1         A
     C           A         ADD  10        K       20
     C           SSU,A     IFNE 0
     C           M1GEKN    IFNE SSU,A
     C                     MOVE '1'       *IN,K
     C           IKHIN     IFEQ WDH,A
     C                     SETON                     03
     C                     END
     C                     SETON                     81
     C                     END
     C                     END
     C  N81                END
      *
     C                     ENDSR
      *
**  ER
E-01 COMPONENTS NO ISN'T INPUT.
E-02 RECEIVING FACTORY ISN'T INPUT.
E-03 THIS RECEIVING FACTORY CAN'T INPUT.
E-04 THERE IS NOT IT IN COMPONENTS KANBAN CHANGE M/F.
E-05 COMPONENTS KANBAN CHANGE M/F IS CANCELLED ALREADY.
E-06 KANBAN INQUIRY NO ISN'T INPUT.
E-07 KANBAN INQUIRY NO IS 1-15.
E-08 THIS NO CAN'T INQUIRE KANBAN.
E-09 DISPLAY NO OF CHILD PART NUMBER IS 1-15
**  TB1.TB2
0111IAF
9999ALL
**  TB3
P
Q
3
