     H            Y.
     F** AKHR03 **************************************
     F* .. COMPONENTS PART NUMBER PROCESS LOCATION INPUT M/F UPDATE.. *
     F* I-HASADA                      92.09.09       *
     F************************************** AKHR03 **
     FAKHPW03 CF  E                    WORKSTN
     FAKHPL01 UF  E           K        DISK                      A
     FAKHPL05 IF  E           K        DISK
     FAAJPL11 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAKHWP02 IF  E           K        DISK
     E                    JST        26  1               選択区分
     E                    JBT        26  6               部品マスター取消
     E                    JKO        26  3               組付工程
     E                    JKJ        26  4               受入工場
     E                    JSM        26 16               受入工場名
     E                    JUR        26  4               受入
     E                    JSU        26  9 0             月間必要数
     E                    IKS        13  1               更新区分
     E                    IOT        13  6               旧所番地
     E                    INT        13  6               新所番地
     E                    IUK        13  8 0             有効日
     E                    IUB        13  2 0             有効日－便
     E                    IZU        13  8 0             前回有効日
     E                    IZB        13  2               前回有効日－便
     E                    HOT        13  6               旧所番地WORK
     E                    HNT        13  6               新所番地WORK
     E                    HUK        13 10 0             有効日－便WORK
     E                    HCK        13  1               更新区分kｩｮh
     E                    ER      1  14 60                d[ｰxｮﾈｰﾆﾞ
     E                    TB1     1  15  2   TB2    12   工程№
     E                    TB3     1   1  4 0             受入工場
     E                    TB4     1   3  1   TB5    24   かんばん種類名
     I            DS
     I                                        1  26 JST
     I                                        1   1 JST01
     I                                        2   2 JST02
     I                                        3   3 JST03
     I                                        4   4 JST04
     I                                        5   5 JST05
     I                                        6   6 JST06
     I                                        7   7 JST07
     I                                        8   8 JST08
     I                                        9   9 JST09
     I                                       10  10 JST10
     I                                       11  11 JST11
     I                                       12  12 JST12
     I                                       13  13 JST13
     I                                       14  14 JST14
     I                                       15  15 JST15
     I                                       16  16 JST16
     I                                       17  17 JST17
     I                                       18  18 JST18
     I                                       19  19 JST19
     I                                       20  20 JST20
     I                                       21  21 JST21
     I                                       22  22 JST22
     I                                       23  23 JST23
     I                                       24  24 JST24
     I                                       25  25 JST25
     I                                       26  26 JST26
     I            DS
     I                                        1 156 JBT
     I                                        1   6 JBT01
     I                                        7  12 JBT02
     I                                       13  18 JBT03
     I                                       19  24 JBT04
     I                                       25  30 JBT05
     I                                       31  36 JBT06
     I                                       37  42 JBT07
     I                                       43  48 JBT08
     I                                       49  54 JBT09
     I                                       55  60 JBT10
     I                                       61  66 JBT11
     I                                       67  72 JBT12
     I                                       73  78 JBT13
     I                                       79  84 JBT14
     I                                       85  90 JBT15
     I                                       91  96 JBT16
     I                                       97 102 JBT17
     I                                      103 108 JBT18
     I                                      109 114 JBT19
     I                                      115 120 JBT20
     I                                      121 126 JBT21
     I                                      127 132 JBT22
     I                                      133 138 JBT23
     I                                      139 144 JBT24
     I                                      145 150 JBT25
     I                                      151 156 JBT26
     I            DS
     I                                        1 104 JKJ
     I                                        1   4 JKJ01
     I                                        5   8 JKJ02
     I                                        9  12 JKJ03
     I                                       13  16 JKJ04
     I                                       17  20 JKJ05
     I                                       21  24 JKJ06
     I                                       25  28 JKJ07
     I                                       29  32 JKJ08
     I                                       33  36 JKJ09
     I                                       37  40 JKJ10
     I                                       41  44 JKJ11
     I                                       45  48 JKJ12
     I                                       49  52 JKJ13
     I                                       53  56 JKJ14
     I                                       57  60 JKJ15
     I                                       61  64 JKJ16
     I                                       65  68 JKJ17
     I                                       69  72 JKJ18
     I                                       73  76 JKJ19
     I                                       77  80 JKJ20
     I                                       81  84 JKJ21
     I                                       85  88 JKJ22
     I                                       89  92 JKJ23
     I                                       93  96 JKJ24
     I                                       97 100 JKJ25
     I                                      101 104 JKJ26
     I            DS
     I                                        1 416 JSM
     I                                        1  16 JSM01
     I                                       17  32 JSM02
     I                                       33  48 JSM03
     I                                       49  64 JSM04
     I                                       65  80 JSM05
     I                                       81  96 JSM06
     I                                       97 112 JSM07
     I                                      113 128 JSM08
     I                                      129 144 JSM09
     I                                      145 160 JSM10
     I                                      161 176 JSM11
     I                                      177 192 JSM12
     I                                      193 208 JSM13
     I                                      209 224 JSM14
     I                                      225 240 JSM15
     I                                      241 256 JSM16
     I                                      257 272 JSM17
     I                                      273 288 JSM18
     I                                      289 304 JSM19
     I                                      305 320 JSM20
     I                                      321 336 JSM21
     I                                      337 352 JSM22
     I                                      353 368 JSM23
     I                                      369 384 JSM24
     I                                      385 400 JSM25
     I                                      401 416 JSM26
     I            DS
     I                                        1 104 JUR
     I                                        1   4 JUR01
     I                                        5   8 JUR02
     I                                        9  12 JUR03
     I                                       13  16 JUR04
     I                                       17  20 JUR05
     I                                       21  24 JUR06
     I                                       25  28 JUR07
     I                                       29  32 JUR08
     I                                       33  36 JUR09
     I                                       37  40 JUR10
     I                                       41  44 JUR11
     I                                       45  48 JUR12
     I                                       49  52 JUR13
     I                                       53  56 JUR14
     I                                       57  60 JUR15
     I                                       61  64 JUR16
     I                                       65  68 JUR17
     I                                       69  72 JUR18
     I                                       73  76 JUR19
     I                                       77  80 JUR20
     I                                       81  84 JUR21
     I                                       85  88 JUR22
     I                                       89  92 JUR23
     I                                       93  96 JUR24
     I                                       97 100 JUR25
     I                                      101 104 JUR26
     I            DS
     I                                        1  13 IKS
     I                                        1   1 IKS01
     I                                        2   2 IKS02
     I                                        3   3 IKS03
     I                                        4   4 IKS04
     I                                        5   5 IKS05
     I                                        6   6 IKS06
     I                                        7   7 IKS07
     I                                        8   8 IKS08
     I                                        9   9 IKS09
     I                                       10  10 IKS10
     I                                       11  11 IKS11
     I                                       12  12 IKS12
     I                                       13  13 IKS13
     I            DS
     I                                        1  78 IOT
     I                                        1   6 IOT01
     I                                        7  12 IOT02
     I                                       13  18 IOT03
     I                                       19  24 IOT04
     I                                       25  30 IOT05
     I                                       31  36 IOT06
     I                                       37  42 IOT07
     I                                       43  48 IOT08
     I                                       49  54 IOT09
     I                                       55  60 IOT10
     I                                       61  66 IOT11
     I                                       67  72 IOT12
     I                                       73  78 IOT13
     I            DS
     I                                        1  78 INT
     I                                        1   6 INT01
     I                                        7  12 INT02
     I                                       13  18 INT03
     I                                       19  24 INT04
     I                                       25  30 INT05
     I                                       31  36 INT06
     I                                       37  42 INT07
     I                                       43  48 INT08
     I                                       49  54 INT09
     I                                       55  60 INT10
     I                                       61  66 INT11
     I                                       67  72 INT12
     I                                       73  78 INT13
     I            DS
     I                                        1 1040IUK
     I                                        1   80IUK01
     I                                        9  160IUK02
     I                                       17  240IUK03
     I                                       25  320IUK04
     I                                       33  400IUK05
     I                                       41  480IUK06
     I                                       49  560IUK07
     I                                       57  640IUK08
     I                                       65  720IUK09
     I                                       73  800IUK10
     I                                       81  880IUK11
     I                                       89  960IUK12
     I                                       97 1040IUK13
     I            DS
     I                                        1  260IUB
     I                                        1   20IUB01
     I                                        3   40IUB02
     I                                        5   60IUB03
     I                                        7   80IUB04
     I                                        9  100IUB05
     I                                       11  120IUB06
     I                                       13  140IUB07
     I                                       15  160IUB08
     I                                       17  180IUB09
     I                                       19  200IUB10
     I                                       21  220IUB11
     I                                       23  240IUB12
     I                                       25  260IUB13
     I            DS
     I                                        1 1040IZU
     I                                        1   80IZU01
     I                                        9  160IZU02
     I                                       17  240IZU03
     I                                       25  320IZU04
     I                                       33  400IZU05
     I                                       41  480IZU06
     I                                       49  560IZU07
     I                                       57  640IZU08
     I                                       65  720IZU09
     I                                       73  800IZU10
     I                                       81  880IZU11
     I                                       89  960IZU12
     I                                       97 1040IZU13
     I            DS
     I                                        1  26 IZB
     I                                        1   2 IZB01
     I                                        3   4 IZB02
     I                                        5   6 IZB03
     I                                        7   8 IZB04
     I                                        9  10 IZB05
     I                                       11  12 IZB06
     I                                       13  14 IZB07
     I                                       15  16 IZB08
     I                                       17  18 IZB09
     I                                       19  20 IZB10
     I                                       21  22 IZB11
     I                                       23  24 IZB12
     I                                       25  26 IZB13
     I            DS
     I                                        1  12 @KHIN
     I                                        1   5 @KHN1
     I                                        6  10 @KHN2
     I                                       11  12 @KHN3
     I            DS
     I                                        1   6 @NTKR
     I                                        1   1 @NTK1
     I                                        2   3 @NTK2
     I                                        4   5 @NTK3
     I                                        6   6 @NTK4
     I            DS
     I                                        1  100@UKHB
     I                                        1   80@UKHZ
     I                                        1   40@UKYY
     I                                        5   60@UKMM
     I                                        7   80@UKDD
     I                                        9  100@UBIN
     I            DS
     I                                        1  14 WKHIN
     I                                        1   5 WKHN1
     I                                        6   6 H1
     I                                        7  11 WKHN2
     I                                       12  12 H2
     I                                       13  14 WKHN3
     I            DS
     I                                        1   8 WKTBM
     I                                        1   3 WKOTI
     I                                        4   4 H3
     I                                        5   80WKBMN
     I            DS
     I                                        1  100WUKHB
     I                                        1   80WUKHZ
     I                                        1   40WUKYY
     I                                        5   60WUKMM
     I                                        7   80WUKDD
     I                                        9  100WUBIN
     I            DS
     I                                        1   80M5SKHZ
     I                                        1   40M5SKYY
     I                                        5   60M5SKMM
     I                                        7   80M5SKDD
     I            DS
     I                                        1   80M5KOHZ
     I                                        1   40M5KOYY
     I                                        5   60M5KOMM
     I                                        7   80M5KODD
     I            DS
     I                                        1   60M5TIME
     I                                        1   20M5KOHH
     I                                        3   40M5KOSS
     I            DS
     I                                        1  12 M5KHIN
     I                                        1   5 M5KHN1
     I                                        6  10 M5KHN2
     I                                       11  12 M5KHN3
     I            DS
     I                                        1   6 M5OTKR
     I                                        1   1 M5OTK1
     I                                        2   3 M5OTK2
     I                                        4   5 M5OTK3
     I                                        6   6 M5OTK4
     I            DS
     I                                        1   6 M5NTKR
     I                                        1   1 M5NTK1
     I                                        2   3 M5NTK2
     I                                        4   5 M5NTK3
     I                                        6   6 M5NTK4
     I            DS
     I                                        1  100M5UKHB
     I                                        1   80M5UKHZ
     I                                        1   40M5UKYY
     I                                        5   60M5UKMM
     I                                        7   80M5UKDD
     I                                        9  100M5UBIN
     I            DS
     I                                        1  100CJCHHB
     I                                        1   80CJCHHZ
     I                                        1   40CJCHYY
     I                                        5   60CJCHMM
     I                                        7   80CJCHDD
     I                                        9  100CJCHBI
     I            DS
     I                                        1   60$KYM
     I                                        1   40$KYY
     I                                        5   60$KMM
      *
     C           KEY1      KLIST
     C                     KFLD           @KHN1
     C                     KFLD           @KHN2
     C                     KFLD           @KHN3
     C                     KFLD           WKJ
     C                     KFLD           WUR
     C                     KFLD           PKANB
      *
     C           KEY2      KLIST
     C                     KFLD           @KBMN
     C                     KFLD           @UKER
     C                     KFLD           @NTK1
     C                     KFLD           @NTK2
     C                     KFLD           @NTK3
     C                     KFLD           @NTK4
      *
     C           KEY3      KLIST
     C                     KFLD           @NTK1
     C                     KFLD           @NTK2
     C                     KFLD           @NTK3
     C                     KFLD           @NTK4
     C                     KFLD           @UKYY
     C                     KFLD           @UKMM
     C                     KFLD           @UKDD
     C                     KFLD           @UBIN
      *
     C           KEY4      KLIST
     C                     KFLD           $KYY
     C                     KFLD           $KMM
      *
     C           *ENTRY    PLIST
     C                     PARM           PCMD3   1
     C                     PARM           PUS    10
     C                     PARM           PKHIN  12
     C                     PARM           PKOTI   3
     C                     PARM           PKBMN   4
     C                     PARM           PRECD   2
     C                     PARM           PSBMN   4
     C                     PARM           PKANB   1
     C                     PARM           PKYM    6
      *
     C           ACALL     PLIST
     C                     PARM           PUS
      *
     C           BCALL     PLIST
     C                     PARM           PUS
     C                     PARM           #KUBN
     C                     PARM           PKHIN
     C                     PARM           #KOTI
     C                     PARM           #KBMN
     C                     PARM           #UKER
     C                     PARM           #OTKR
     C                     PARM           #NTKR
     C                     PARM           #UKHZ
     C                     PARM           #UBIN
     C                     PARM           #SRYO
     C                     PARM           PRECD
     C                     PARM           #TKBI
      *
     C                     MOVE PSBMN     WSBMN   40
     C                     MOVE PKYM      $KYM
      *
     C*--------------------------*
     C*  ..設定月の稼動日数..  *
     C*--------------------------*
     C                     Z-ADD0         $KCD    31
     C           KEY4      SETLLAGDPL121
      *
     C                     DO   *HIVAL
     C                     SETOF                     01
     C           KEY4      READEAGDPL121                 01
     C           *IN01     IFEQ '0'
      *
     C           F8HIRU    IFEQ '*'
     C           F8YORU    ANDEQ'*'
     C                     ELSE
      *
     C           F8HIRU    IFEQ *BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     ADD  1         $KCD
     C                     ELSE
      *
     C                     ADD  0.5       $KCD
     C                     END
      *
     C                     END
     C                     END
     C  N01                END
      * MSK 2008.01.26
     C                     Z-ADD20        $KCD
     C*------------------*
     C*  ..構成品番..  *
     C*------------------*
     C                     MOVE PKHIN     @KHIN
     C                     MOVE @KHN1     WKHN1
     C                     MOVE @KHN2     WKHN2
     C                     MOVE @KHN3     WKHN3
     C           WKHN2     IFNE *BLANK
     C                     MOVE '-'       H1
     C                     END
     C           WKHN3     IFNE *BLANK
     C                     MOVE '-'       H2
     C                     END
      *
     C*--------------------*
     C*  ..工程－部門..  *
     C*--------------------*
     C                     MOVE PKOTI     WKOTI
     C                     MOVE PKBMN     WKBMN
     C                     MOVE '-'       H3
      *
     C*----------------*
     C*  ..部門名..  *
     C*----------------*
     C                     SETOF                     01
     C           WKBMN     CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C                     MOVELB2SMEI    WSMEI
     C                     END
      *
     C*----------------*
     C*  ..工程№..  *
     C*----------------*
     C                     SETOF                     01
     C                     Z-ADD1         X       20
     C           PRECD     LOKUPTB1,X                    01
     C           *IN01     IFEQ '1'
     C                     MOVE TB2,X     WRECD
     C                     END
      *
     C*------------------------*
     C*  ..かんばん種類名..  *
     C*------------------------*
     C                     SETOF                     01
     C                     Z-ADD1         X
     C                     MOVE *BLANK    WKBNM
     C           PKANB     LOKUPTB4,X                    01
     C           *IN01     IFEQ '1'
     C                     MOVE TB5,X     WKBNM
     C                     END
      *
     C                     MOVE *BLANK    JST
     C                     MOVE *BLANK    JBT
     C                     MOVE *BLANK    JKO
     C                     MOVE *BLANK    JKJ
     C                     MOVE *BLANK    JSM
     C                     MOVE *BLANK    JUR
     C                     Z-ADD0         JSU
      *
     C                     Z-ADD0         Y       20
      *
     C*------------------------------------------*
     C*  ..構成品工程別　月間必要数ファイル..  *
     C*  ..ＷＯＲＫファイル                    *
     C*------------------------------------------*
     C           *LOVAL    SETLLAKHWP021
     C                     DO   *HIVAL
     C                     SETOF                     02
     C                     READ AKHWP021                 02
     C           *IN02     IFEQ '0'
      *
     C*----------------------------------------*
     C*  ..画面受入工場よりデータセレクト..  *
     C*----------------------------------------*
     C           WSBMN     IFNE 9999
     C*          WSBMN     IFEQ 8907
     C*                    SETOF                     01
     C*          A@KBMN    LOKUPTB3                      01
     C*          *IN01     IFEQ '1'
     C*                    GOTO @STP0
     C*                    END
     C*                    ELSE
      *
     C           WSBMN     IFNE A@KBMN
     C                     GOTO @STP0
     C                     END
     C                     END
     C*                    END
      *
     C                     ADD  1         Y
      *
     C           Y         IFGT 26
     C                     SETON                     02
     C                     ELSE
      *
     C                     MOVE A@KOTI    JKO,Y
     C                     MOVE A@KBMN    JKJ,Y
     C                     MOVE A@UKER    JUR,Y
     C                     Z-ADDA@GEKN    JSU,Y
      *
     C           A@BTKB    IFEQ 'T'
     C                     MOVE 'D_CAN '  JBT,Y
     C                     END
      *
     C                     SETOF                     01
     C           A@KBMN    CHAINFGBPL011             01
     C           *IN01     IFEQ '0'
     C                     MOVELB2SMEI    JSM,Y
     C                     END
      *
     C           @STP0     TAG
     C                     END
     C                     END
     C  N02                END
      *
     C           @STPX     TAG
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     36
      *
     C*------------------*
     C*  ..画面－１..  *
     C*------------------*
     C           STP0      TAG
     C                     EXFMTAKHPW031
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     232425
     C                     SETOF                     262728
     C                     SETOF                     293031
     C                     SETOF                     323334
     C                     SETOF                     353699
      *
     C           *INKC     IFEQ '1'
     C                     MOVE '1'       PCMD3
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C*------------------*
     C*  ..選択区分..  *
     C*------------------*
     C                     Z-ADD10        A       20
     C                     Z-ADD1         X
     C           1         DO   26        X
     C                     ADD  1         A
     C           JST,X     IFNE *BLANK
     C           JKJ,X     IFEQ *BLANK
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,1      MSG
     C                     GOTO STP0
     C                     END
      *
     C*----------------------------*
     C*  ..選択区分　チェック..  *
     C*----------------------------*
     C                     Z-ADD10        A
     C                     Z-ADD1         X
     C           1         DO   26        X
     C                     ADD  1         A
     C           JST,X     IFNE *BLANK
     C           JST,X     IFNE '1'
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,2      MSG
     C                     GOTO STP0
     C                     END
      *
     C                     SETOF                     01
     C                     MOVE *BLANK    WKO     3
     C                     Z-ADD0         WKJ     40
     C                     MOVE *BLANK    WUR     4
     C                     Z-ADD0         WSU     90
     C                     Z-ADD1         X
     C           1         DO   26        X
     C           JST,X     IFNE *BLANK
     C                     SETON                     01
     C                     MOVE *BLANK    JST,X
     C                     MOVE JKO,X     WKO
     C                     MOVE JKJ,X     WKJ
     C                     MOVE JUR,X     WUR
     C                     Z-ADDJSU,X     WSU
     C                     END
     C  N01                END
      *
     C           *IN01     IFEQ '0'
     C                     GOTO STP0
     C                     END
      *
     C                     MOVE *BLANK    IKS
     C                     MOVE *BLANK    IOT
     C                     MOVE *BLANK    INT
     C                     Z-ADD0         IUK
     C                     Z-ADD0         IUB
     C                     Z-ADD0         IZU
     C                     MOVE *BLANK    IZB
     C                     MOVE *BLANK    HOT
     C                     MOVE *BLANK    HNT
     C                     Z-ADD0         HUK
     C                     MOVE *BLANK    HCK
      *
     C                     MOVE WKJ       IKJ01
     C                     MOVE WUR       IUR01
      *
     C                     SETOF                     242526
     C                     SETOF                     272829
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     367677
     C                     SETOF                     787980
     C                     SETOF                     818283
     C                     SETOF                     848586
     C                     SETOF                     8788
     C                     Z-ADD23        B       20
     C                     Z-ADD75        F       20
     C                     Z-ADD0         Y
      *
     C*------------------------------------------*
     C*  ..構成品番工程　所番地登録マスター..  *
     C*------------------------------------------*
     C           KEY1      SETLLAKHPL051
     C                     DO   *HIVAL
     C                     SETOF                     02
     C           KEY1      READEAKHPL051                 02
     C           *IN02     IFEQ '0'
      *
     C                     ADD  1         B
     C                     ADD  1         F
     C                     ADD  1         Y
      *
     C           Y         IFGT 13
     C                     SETON                     02
     C                     ELSE
      *
     C           M5SKJY    IFEQ 'D'
     C           M5SKHZ    ANDLE*DATE
     C                     MOVE '1'       *IN,B
     C                     MOVE '0'       HCK,Y
     C                     END
      *
     C                     MOVE M5OTKR    IOT,Y
     C                     MOVE M5NTKR    INT,Y
     C                     Z-ADDM5UKHZ    IUK,Y
     C                     Z-ADDM5UBIN    IUB,Y
     C                     MOVE M5OTKR    HOT,Y
     C                     MOVE M5NTKR    HNT,Y
     C                     Z-ADDM5UKHB    HUK,Y
      *
     C           M5UKHZ    IFNE 0
     C                     MOVE '1'       *IN,F
     C                     Z-ADDM5UKHZ    IZU,Y
     C                     MOVE M5UBIN    IZB,Y
     C                     END
      *
     C                     END
     C                     END
     C  N02                END
      *
     C*------------------*
     C*  ..画面－２..  *
     C*------------------*
     C           STP1      TAG
     C                     EXFMTAKHPW032
     C                     SETOF                     111213
     C                     SETOF                     141516
     C                     SETOF                     171819
     C                     SETOF                     202122
     C                     SETOF                     233738
     C                     SETOF                     394041
     C                     SETOF                     424344
     C                     SETOF                     454647
     C                     SETOF                     484950
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     606162
     C                     SETOF                     636465
     C                     SETOF                     666768
     C                     SETOF                     697071
     C                     SETOF                     727374
     C                     SETOF                     7599
      *
     C           *INKB     IFEQ '1'
     C                     CALL 'AAJR11'  ACALL
     C                     GOTO STP1
     C                     END
      *
     C           *INKC     IFEQ '1'
     C                     GOTO @STPX
     C                     END
      *
     C*------------------*
     C*  ..更新区分..  *
     C*------------------*
     C                     Z-ADD10        A       20
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         A
     C           IKS,X     IFNE *BLANK
     C           INT,X     IFEQ *BLANK
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------*
     C*  ..更新区分　チェック..  *
     C*----------------------------*
     C                     Z-ADD10        A
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         A
     C           IKS,X     IFNE *BLANK
     C           IKS,X     IFEQ '0'
     C           IKS,X     OREQ '1'
     C                     ELSE
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------*
     C*  ..更新区分　チェック..  *
     C*----------------------------*
     C                     Z-ADD10        A
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         A
     C           IKS,X     IFNE *BLANK
     C           IKS,X     IFEQ '0'
     C           HCK,X     IFEQ '0'
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
     C                     ELSE
      *
     C           IKS,X     IFEQ '1'
     C           HCK,X     IFEQ *BLANK
     C                     MOVE '1'       *IN,A
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..新所番地・有効日－便..  *
     C*------------------------------*
     C                     Z-ADD36        C       20
     C                     Z-ADD49        D       20
     C                     Z-ADD62        E       20
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         C
     C                     ADD  1         D
     C                     ADD  1         E
     C           INT,X     IFEQ *BLANK
     C           IUK,X     ANDEQ0
     C           IUB,X     ANDEQ0
     C                     ELSE
     C           INT,X     IFEQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     END
     C           IUK,X     IFEQ 0
     C                     MOVE '1'       *IN,D
     C                     SETON                     99
     C                     END
     C           IUB,X     IFEQ 0
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------*
     C*  ..有効日..  *
     C*----------------*
     C                     Z-ADD49        D
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         D
     C           IUK,X     IFNE 0
     C                     Z-ADDIUK,X     WUKHZ
     C           WUKYY     IFGE 1992
     C           WUKMM     ANDGE01
     C           WUKMM     ANDLE12
     C           WUKDD     ANDGE01
     C           WUKDD     ANDLE31
     C                     ELSE
     C                     MOVE '1'       *IN,D
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------------------*
     C*  ..有効日、システム日付とチェック..  *
     C*----------------------------------------*
     C                     Z-ADD49        D
     C                     Z-ADD62        E
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         D
     C                     ADD  1         E
     C           IUK,X     IFNE 0
     C           HUK,X     IFEQ 0
     C           IUK,X     IFLT *DATE
     C                     MOVE '1'       *IN,D
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     END
     C                     ELSE
     C                     Z-ADDIUK,X     WUKHZ
     C                     Z-ADDIUB,X     WUBIN
     C           WUKHB     IFLT HUK,X
     C                     MOVE '1'       *IN,D
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,9      MSG
     C                     GOTO STP1
     C                     END
      *
     C*----------------------------------------------------*
     C*  ..前回有効日で新所番地・有効日－便のチェック..  *
     C*----------------------------------------------------*
     C                     Z-ADD36        C
     C                     Z-ADD49        D
     C                     Z-ADD62        E
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         C
     C                     ADD  1         D
     C                     ADD  1         E
     C           IZU,X     IFNE 0
     C           INT,X     IFEQ *BLANK
     C                     MOVE '1'       *IN,C
     C                     MOVE '1'       *IN,D
     C                     MOVE '1'       *IN,E
     C                     SETON                     99
     C                     MOVE HNT,X     INT,X
     C                     Z-ADDIZU,X     IUK,X
     C                     MOVE IZB,X     IUB,X
     C                     END
     C                     END
     C                     END
      *
     C           *IN99     IFEQ '1'
     C                     MOVE ER,10     MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------------*
     C*  ..新所番地重複チェック..  *
     C*------------------------------*
     C                     Z-ADD36        C
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         C
     C           INT,X     IFNE *BLANK
     C           X         IFNE 13
     C                     SETOF                     01
     C           X         ADD  1         Z       20
     C           INT,X     LOKUPINT,Z                    01
     C           *IN01     IFEQ '1'
     C                     ADD  36        Z
     C                     MOVE '1'       *IN,C
     C                     MOVE '1'       *IN,Z
     C                     SETON                     99
     C                     MOVE ER,11     MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*------------------------------*
     C*  ..工程内所番地マスター..  *
     C*------------------------------*
     C                     Z-ADD36        C
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         C
     C           INT,X     IFNE *BLANK
     C                     MOVE INT,X     @NTKR
     C                     Z-ADDIUK,X     @UKHZ
     C                     Z-ADDIUB,X     @UBIN
      *
     C           KEY3      SETLLAAJPL111
     C                     SETOF                     01
     C                     READ AAJPL111                 01
     C           *IN01     IFEQ '0'
     C           CJBANC    IFNE @NTKR
     C                     SETON                     01
     C                     ELSE
     C           CJCHHB    IFLT @UKHB
     C                     SETON                     01
     C                     END
     C                     END
     C                     END
      *
     C           *IN01     IFEQ '1'
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,12     MSG
     C                     GOTO STP1
     C                     END
      *
     C           CJKDAI    IFNE PKANB
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,13     MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------------------*
     C*  ..構成品番工程所番地登録マスター..  *
     C*----------------------------------------*
     C                     Z-ADD36        C
     C                     Z-ADD1         X
     C           1         DO   13        X
     C                     ADD  1         C
     C           INT,X     IFNE *BLANK
     C                     MOVE WKJ       @KBMN
     C                     MOVE WUR       @UKER
     C                     MOVE INT,X     @NTKR
      *
     C                     MOVE WKJ       @@KBMN  40
     C                     MOVE WUR       @@UKER  4
      *
     C                     SETOF                     01
     C           @KBMN     LOKUPTB3                      01
     C           *IN01     IFEQ '0'
     C                     Z-ADD0111      @KBMN
     C                     MOVE '01  '    @UKER
     C                     END
      *
     C                     SETOF                     01
     C           KEY2      CHAINAKHPL011             01
     C           *IN01     IFEQ '0'
     C           M5SKJY    ANDEQ'D'
     C           M5SKHZ    ANDLE*DATE
     C                     SETON                     01
     C                     END
      *
     C           *IN01     IFEQ '0'
     C           @@KBMN    IFEQ M5KBMJ
     C           @@UKER    ANDEQM5UKRJ
     C                     ELSE
     C                     MOVE '1'       *IN,C
     C                     SETON                     99
     C                     MOVE ER,14     MSG
     C                     GOTO STP1
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------*
     C*  ..新所番地→旧所番地..  *
     C*----------------------------*
     C                     Z-ADD1         X
     C           1         DO   13        X
     C           INT,X     IFEQ HNT,X
     C                     MOVE HOT,X     IOT,X
     C                     ELSE
     C                     MOVE HNT,X     IOT,X
     C                     END
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C*---------------------------------------------------------------*
     C* #KUBN                                                         *
     C* 1->更新区分が＇０＇の時は、取消処理                         *
     C* 2->　　　　　＇１＇の時は、追加処理                         *
     C* 3->新所番地と有効日－便が変わらない時、月間必要数変更       *
     C* 4->新所番地が変わらず有効日－便が変わった時、有効日－便変更 *
     C* 5->新所番地が変わった時、旧所番地が失効日・新所番地が追加   *
     C*---------------------------------------------------------------*
     C                     Z-ADD1         X
     C           1         DO   13        X
     C           INT,X     IFNE *BLANK
     C           IKS,X     IFNE *BLANK
      *
     C           IKS,X     IFEQ '0'
     C                     MOVE '1'       #KUBN   1
     C                     EXSR SUBR
     C                     GOTO STP2
     C                     ELSE
      *
     C                     MOVE '2'       #KUBN
     C                     EXSR SUBR
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C           HNT,X     IFEQ INT,X
     C                     Z-ADDIUK,X     WUKHZ
     C                     Z-ADDIUB,X     WUBIN
      *
     C           HUK,X     IFEQ WUKHB
     C                     MOVE '3'       #KUBN
     C                     EXSR SUBR
     C                     GOTO STP2
     C                     ELSE
      *
     C                     MOVE '4'       #KUBN
     C                     EXSR SUBR
     C                     GOTO STP2
     C                     END
     C                     ELSE
      *
     C                     MOVE '5'       #KUBN
     C                     EXSR SUBR
      *
     C           STP2      TAG
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C*----------------------------------------------*
     C*  ..構成品番工程所番地登録マスター　更新..  *
     C*----------------------------------------------*
     C                     Z-ADD1         X
     C           1         DO   13        X
     C           INT,X     IFNE *BLANK
     C           HCK,X     IFEQ '0'
     C           IKS,X     ANDEQ*BLANK
     C                     ELSE
      *
     C                     MOVE WKJ       @KBMN   40
     C                     MOVE WUR       @UKER   4
      *
     C                     SETOF                     01
     C           @KBMN     LOKUPTB3                      01
     C           *IN01     IFEQ '0'
     C                     Z-ADD0111      @KBMN
     C                     MOVE '01  '    @UKER
     C                     END
      *
     C                     MOVE INT,X     @NTKR
      *
     C                     SETOF                     01
     C           KEY2      CHAINAKHPL011             01
     C           *IN01     IFEQ '0'
     C                     DELETAKHPL011
     C                     END
      *
     C           HNT,X     IFNE INT,X
     C           IOT,X     IFNE *BLANK
     C                     MOVE IOT,X     @NTKR
     C                     END
     C                     END
      *
     C                     SETOF                     01
     C           KEY2      CHAINAKHPL011             01
     C                     MOVE *BLANK    M5SKJY
     C                     Z-ADD0         M5SKHZ
      *
     C           IKS,X     IFEQ '0'
     C                     MOVE 'D'       M5SKJY
     C                     Z-ADD*DATE     M5SKHZ
     C                     END
      *
     C                     Z-ADD*DATE     M5KOHZ
     C                     TIME           M5TIME
     C                     MOVELPUS       M5KOME
     C                     MOVE @KHIN     M5KHIN
     C                     Z-ADD@KBMN     M5KBMN
     C                     MOVE @UKER     M5UKER
     C                     MOVE WKJ       M5KBMJ
     C                     MOVE WUR       M5UKRJ
     C                     MOVE PKANB     M5KDAI
     C                     MOVE IOT,X     M5OTKR
     C                     MOVE INT,X     M5NTKR
     C                     Z-ADDIUK,X     M5UKHZ
     C                     Z-ADDIUB,X     M5UBIN
      *
     C           *IN01     IFEQ '0'
     C                     UPDATAKHPL011
     C                     ELSE
     C                     WRITEAKHPL011
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     Z-ADD1         X
     C           1         DO   26        X
     C           JST,X     IFNE *BLANK
     C                     GOTO @STPX
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     C*---------------------------------------------------*
     C*             ..サブルーチン..                    *
     C*  ..構成品かんばんマスターキー変更処理..         *
     C*  ..構成品メッキかんばんマスターキー変更処理     *
     C*  ..構成品トンネルかんばんマスターキー変更処理   *
     C*---------------------------------------------------*
     C           SUBR      BEGSR
      *
     C                     MOVE WKO       #KOTI   3
     C                     MOVE WKJ       #KBMN   4
     C                     MOVE WUR       #UKER   4
     C                     MOVE IOT,X     #OTKR   6
     C                     MOVE INT,X     #NTKR   6
     C                     MOVE IUK,X     #UKHZ   8
     C                     MOVE IUB,X     #UBIN   2
     C           WSU       DIV  $KCD      WSRYO   90
     C                     MOVE WSRYO     #SRYO   9
     C                     MOVE *ZERO     #TKBI   8
      *
     C           PKANB     IFEQ '3'
     C                     CALL 'AKHR04'  BCALL
     C                     ELSE
      *
     C           PKANB     IFEQ 'P'
     C                     CALL 'AKHR05'  BCALL
     C                     ELSE
      *
     C           PKANB     IFEQ 'Q'
     C                     CALL 'AKHR06'  BCALL
     C                     END
     C                     END
     C                     END
      *
     C                     ENDSR
      *
** ER
E-01 REVERSING SELECT INSTRUCTION CAN NOT INPUT.
E-02 REVERSING SELECT INSTRUCTION IS 1
E-03 REVERSING UPDATE INSTRUCTION  CAN NOT INPUT.
E-04 REVERSING UPDATE INSTRUCTION IS  (0 1)
E-05 REVERSING DATA MAY NOT CANCEL.
E-06 REVERSING DATA NEED NOT REVIVE.
E-07 REVERSING NEW LOC OR EFFECTIVE DATE BIN ISN'T INPUT
E-08 REVERSING DATE OF EFFECTIVE DATE IS NOT RIGHT.
E-09 REVERSING EFFECTIVE DATE-BIN IS IT FROM SYSTEM DATE.
E-10 REVERSING DATAHAVE TO CANCEL BECAUSE KANBAN LIVES
E-11 REVERSING NEW LOCATION REPEAT.
E-12 CAN USE IT. INPUT IT IN INTRA-PROCESS LOCATION M/F
E-13 KANBAN KIND OF INTRA-PROCESS LOCATION M/F IS DIFFERENT.
E-14 REVERSING NEW LOCATION IS USED.
** TB1.TB2
01 THE 1ST PROC
02 THE 2ND PROC
03 THE 3RD PROC
04 THE 4TH PROC
05 THE 5TH PROC
06 THE 6TH PROC
07 THE 7TH PROC
08 THE 8TH PROC
09 THE 9TH PROC
10 10TH PROCESS
11 11TH PROCESS
12 12TH PROCESS
13 13TH PROCESS
14 14TH PROCESS
15 15TH PROCESS
** TB3
0111
** TB4.TB5
3 COMPONENTS KANBAN
P COMPONENTS PLATING K
Q COMPONENTS TUNNEL K
