     H            Y.
     F** AL#RD8 **************************************
     F*発行するデータを選択                        *
     F*     ITS.          2015.05.26                 *
%0001F*     T.SAKAKI      2016.07.14  ADD DOCK CODE  *
     F************************************************
     FAL#PWD8 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                              KINFDS INFDS
     FAL#WPD9 IF  E                    DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1 256 W9DATA
     I                                        1   1 W9KBN
      * TIK
     ITIK         DS
     I                                        2  10 W9SURT
     I                                       11  18 W9SHID
     I                                       19  24 W9SHIT
     I                                       25  39 W9SMEI
     I                                       40  41 W9DOCK
     I                                       42  53 W9ORD#
     I                                       54  55 W9PALT
     I                                       56  59 W9NONY
     I                                       60  60 W9NKOJ
     I                                       61  64 W9NUKE
     I                                       65  67 W9IAFB
     I                                       68  70 W9IAFP
     I                                       71  71 W9PPUL
     I                                       72  72 W9EXT
     I                                       73  73 W9SAT
     I                                       74  76 W9BOX
     I                                       77  79 W9EMPT
     I                                       80  82 W9PFTR
     I                                       83  84 W9PFBI
      * KANBAN
     IKAN         DS
%0001I                                       38  39 W9KDOC
     I                                       40  43 W9AAAA
     I                                       44  55 W9MHN
     I                                       44  48 W9MHN1
     I                                       49  53 W9MHN2
     I                                       54  55 W9MHN3
     I                                      141 150 W9BBBB
     I                                      153 156 W9BOX#
     I                                      157 160 W9BOXE
     I                                      211 215 W9SEQ#
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 ##USER
     I                                      264 269 W#JBNO
      *
     I              'SATURDAY'            C         CSAT
      *
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1IAFB  3
     C                     PARM           PCMD    2
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
     C                     MOVELP1IAFB    C1IAFB
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * INQ                                                *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           1         SETLLAL#WPD91
     C                     READ AL#WPD91                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AL#WPD91                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * SFL                                                *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEAL#PWD89
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F1
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     Z-ADD1         A       30
     C                     SETOF                     3199
     C           A         DOWLE15
     C           A         CHAINSFL                  24
     C           *IN24     IFEQ '0'
     C           *IN99     ANDEQ'0'
     C                     SELEC
     C           S1SEL     WHEQ ' '
     C           S1SEL     WHEQ '1'
     C                     OTHER
     C                     MOVELER,2      D9ERR
     C                     SETON                     3199
     C                     ENDSL
     C                     MOVELH139      *IN,39
     C                     UPDATSFL
     C                     ENDIF
     C                     ADD  1         A
     C                     ENDDO
     C           *IN99     IFEQ '1'
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     EXSR #SB221
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTAL#WPD91
     C                     READPAL#WPD91                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  15        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPAL#WPD91                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           1         SETLLAL#WPD91
     C                     READ AL#WPD91                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AL#WPD91                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AL#WPD91                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      * F5
     C           *IN05     IFEQ '1'
     C                     MOVEL'05'      PCMD
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB221    BEGSR
      *
     C                     Z-ADD1         A       30
     C           A         DOWLE15
     C           A         CHAINSFL                  24
     C           *IN24     IFEQ '0'
     C                     CALL 'AL#RD7'
     C                     PARM           H1SEQ
     C                     PARM           S1SEL
     C                     ENDIF
     C                     ADD  1         A
     C                     ENDDO
      *
     CSR         ESB221    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 15
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR                                              *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVELW9SEL     S1SEL
     C                     MOVEL*BLANK    S1TXT
     C                     SELEC
     C           W9KBN     WHEQ '1'
     C                     EXSR #EDIT1
     C           W9KBN     WHEQ '2'
     C                     EXSR #EDIT2
     C           W9KBN     WHEQ '3'
     C                     EXSR #EDIT3
     C                     ENDSL
     C                     Z-ADDW9SEQ     H1SEQ
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * PALLET TICKET                                      *
      *----------------------------------------------------*
     CSR         #EDIT1    BEGSR
      *
     C                     CLEARTIK
     C                     MOVELW9DATA    TIK
     C                     MOVEL*BLANK    S1TXT
     C           S1TXT     CAT  'PALLET':0S1TXT
     C           S1TXT     CAT  'TICKET':1S1TXT
     C           S1TXT     CAT  'PALLET':2S1TXT
     C           S1TXT     CAT  '# =':0   S1TXT
     C           S1TXT     CAT  W9IAFP:1  S1TXT
      *
     CSR         EEDIT1    ENDSR
      *----------------------------------------------------*
      * KANBAN                                             *
      *----------------------------------------------------*
     CSR         #EDIT2    BEGSR
      *
     C                     CLEARKAN
     C                     MOVELW9DATA    KAN
     C                     MOVEL*BLANK    S1TXT
     C           S1TXT     CAT  'KANBAN':0S1TXT
     C           S1TXT     CAT  'DATA':1  S1TXT
      *
     C                     MOVEL*BLANK    S1MHN  14
     C           S1MHN     CAT  W9MHN1:0  S1MHN
     C           S1MHN     CAT  '-':0     S1MHN
     C           S1MHN     CAT  W9MHN2:0  S1MHN
     C           W9MHN3    IFNE *BLANK
     C           S1MHN     CAT  '-':0     S1MHN
     C           S1MHN     CAT  W9MHN3:0  S1MHN
     C                     ENDIF
      *
     C           S1TXT     CAT  S1MHN:1   S1TXT
     C           S1TXT     CAT  'SEQ#=':1 S1TXT
     C           S1TXT     CAT  W9SEQ#:0  S1TXT
     C           S1TXT     CAT  'BOX#=':1 S1TXT
     C           S1TXT     CAT  W9BOX#:0  S1TXT
     C           S1TXT     CAT  '/':0     S1TXT
     C           S1TXT     CAT  W9BOXE:0  S1TXT
     C           S1TXT     CAT  W9BBBB:1  S1TXT
      * %0001
     C           S1TXT     CAT  W9KDOC:1  S1TXT
     C           S1TXT     CAT  W9AAAA:1  S1TXT
      *
     CSR         EEDIT2    ENDSR
      *----------------------------------------------------*
      * SHORTAGE MEMO                                      *
      *----------------------------------------------------*
     CSR         #EDIT3    BEGSR
      *
     C                     MOVEL*BLANK    S1TXT
     C           S1TXT     CAT  'SHORTA':0S1TXT
     C           S1TXT     CAT  'GE':0    S1TXT
     C           S1TXT     CAT  'MEMO':1  S1TXT
      *
     CSR         EEDIT3    ENDSR
      *----------------------------------------------------*
      * NEXT                                               *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ AL#WPD91                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV                                                *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPAL#WPD91                 81
      *
     CSR         ENEXTP    ENDSR
**
ER-1 NO DATA.
ER-2 INPUT 1.
SELECTED MORE 2 TRUCK BIN#.OK?

THERE SAME TRUCK BIN#,
THAT UNSELECTED. OK?
