     H            Y.
     F** AL#RB1  *******************************************
     F* CHECKING OF SH PROCESS                             *
     F*      ITS.        2015.06.02                        *
     F******************************************************
     FAL#PL07 IF  E           K        DISK
     FAL#WPB1 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SHME 20
     C                     PARM           P9CMD   2
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C           P1SHME    SETLLAL#PL071
     C           P1SHME    READEAL#PL071                 81
     C           *IN81     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C           P1SHME    READEAL#PL071                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#WPB1
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C                     MOVEL'1'       GET     1
     C           GET       IFEQ '1'
     C                     EXSR #SB500
     C                     EXSR #SB510
     C                     EXSR #SB550
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *-----------------------------------------------------
      *  AL#WPB1  0 : IAFB IAFP
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEYW0     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           CAIAFB
     C                     KFLD           CAIAFP
      *
     C                     MOVEL'0'       KKTYPE
     C           KEYW0     CHAINAL#WPB11             22
     C           *IN22     IFEQ '0'
     C                     ADD  1         W1BOX
     C           CAPLDT    IFNE 0
     C                     ADD  1         W1SUMI
     C                     ENDIF
     C                     UPDATAL#WPB11
     C                     ELSE
     C                     CLEARAL#WPB11
     C                     MOVEL'0'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCAIAFB    W1IAFB
     C                     MOVELCAIAFP    W1IAFP
     C                     Z-ADD1         W1BOX
     C                     MOVELCAPPUL    W1PPUL
     C                     MOVELCASAT     W1SAT
     C           CAPLDT    IFNE 0
     C                     Z-ADD1         W1SUMI
     C                     ENDIF
     C                     WRITEAL#WPB11
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      *  AL#WPB1  1 : IAFB
      *-----------------------------------------------------
     CSR         #SB510    BEGSR
      *
     C           KEYW1     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           CAIAFB
     C                     KFLD           KKIAFP  3
     C                     KFLD           CATKR1
     C                     KFLD           CATKR2
     C                     KFLD           CATKR3
     C                     KFLD           CATKR4
     C                     KFLD           CAKNB#
      *
     C                     MOVEL'1'       KKTYPE
     C                     MOVEL*BLANK    KKIAFP
     C           KEYW1     CHAINAL#WPB11             22
     C           *IN22     IFEQ '0'
     C                     ADD  1         W1BOX
     C           CAPLDT    IFNE 0
     C                     ADD  1         W1SUMI
     C                     ENDIF
     C                     UPDATAL#WPB11
     C                     ELSE
     C                     CLEARAL#WPB11
     C                     MOVEL'1'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCANONY    W1NONY
     C                     MOVELCANKOJ    W1NKOJ
     C                     MOVELCANUKE    W1NUKE
     C                     MOVELCAORD#    W1ORD#
     C                     MOVELCAPALT    W1PALT
     C                     Z-ADD1         W1BOX
     C           CAPLDT    IFNE 0
     C                     ADD  1         W1SUMI
     C                     ENDIF
     C                     MOVELCATOKU    W1TOKU
     C                     MOVELCACADT    W1CADT
     C                     MOVELCASUPI    W1SUPI
     C                     MOVELCASUPC    W1SUPC
     C                     MOVELCADOCK    W1DOCK
     C                     MOVELCAKNB#    W1KNB#
     C                     MOVELCAMHN     W1MHN
     C                     MOVELCALIAD    W1LIAD
     C                     MOVELCASTAD    W1STAD
     C                     MOVELCAQTBO    W1QTBO
     C                     MOVELCASUPN    W1SUPN
     C                     MOVELCAMART    W1MART
     C                     MOVELCAULDA    W1ULDA
     C                     MOVELCABOX#    W1BOX#
     C                     MOVELCABOXT    W1BOXT
     C                     MOVELCANAMC    W1NAMC
     C                     MOVELCAINKK    W1INKK
     C                     MOVELCALPOS    W1LPOS
     C                     MOVELCANAM2    W1NAM2
     C                     MOVELCANAM3    W1NAM3
     C                     MOVELCANAD5    W1NAD5
     C                     MOVELCANAD6    W1NAD6
     C                     MOVELCAFILL    W1FILL
     C                     MOVELCATERM    W1TERM
     C                     MOVELCAALL     W1ALL
     C                     MOVELCAEXTR    W1EXTR
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCAIAFB    W1IAFB
     C                     MOVEL*BLANK    W1IAFP
     C                     MOVELCAFIXD    W1FIXD
     C                     MOVELCAFIXT    W1FIXT
     C                     MOVELCATIMS    W1TIMS
     C                     MOVELCAPPUL    W1PPUL
     C                     MOVELCASAT     W1SAT
     C                     MOVELCASHN1    W1SHN1
     C                     MOVELCASHN2    W1SHN2
     C                     MOVELCASHN3    W1SHN3
     C                     MOVELCASYOT    W1SYOT
     C                     MOVELCATKR1    W1TKR1
     C                     MOVELCATKR2    W1TKR2
     C                     MOVELCATKR3    W1TKR3
     C                     MOVELCATKR4    W1TKR4
     C                     MOVELCAKADT    W1KADT
     C                     MOVELCAKATI    W1KATI
     C                     MOVELCASEQ#    W1SEQ#
     C                     MOVELCAPLDT    W1PLDT
     C                     MOVELCAPLTI    W1PLTI
     C                     MOVELCASHME    W1SHME
     C                     WRITEAL#WPB11
     C                     ENDIF
      *
     CSR         ESB510    ENDSR
      *-----------------------------------------------------
      *  AL#WPB1  5 : DETAIL
      *-----------------------------------------------------
     CSR         #SB550    BEGSR
      *
     C           KEYW5     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           CAIAFB
     C                     KFLD           CAIAFP
     C                     KFLD           CATKR1
     C                     KFLD           CATKR2
     C                     KFLD           CATKR3
     C                     KFLD           CATKR4
     C                     KFLD           CAKNB#
      *
     C                     MOVEL'5'       KKTYPE
     C           KEYW5     CHAINAL#WPB11             22
     C           *IN22     IFEQ '0'
     C                     ADD  1         W1BOX
     C           CAPLDT    IFNE 0
     C                     ADD  1         W1SUMI
     C                     ENDIF
     C                     UPDATAL#WPB11
     C                     ELSE
     C                     CLEARAL#WPB11
     C                     MOVEL'5'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCANONY    W1NONY
     C                     MOVELCANKOJ    W1NKOJ
     C                     MOVELCANUKE    W1NUKE
     C                     MOVELCAORD#    W1ORD#
     C                     MOVELCAPALT    W1PALT
     C                     Z-ADD1         W1BOX
     C           CAPLDT    IFNE 0
     C                     ADD  1         W1SUMI
     C                     ENDIF
     C                     MOVELCATOKU    W1TOKU
     C                     MOVELCACADT    W1CADT
     C                     MOVELCASUPI    W1SUPI
     C                     MOVELCASUPC    W1SUPC
     C                     MOVELCADOCK    W1DOCK
     C                     MOVELCAKNB#    W1KNB#
     C                     MOVELCAMHN     W1MHN
     C                     MOVELCALIAD    W1LIAD
     C                     MOVELCASTAD    W1STAD
     C                     MOVELCAQTBO    W1QTBO
     C                     MOVELCASUPN    W1SUPN
     C                     MOVELCAMART    W1MART
     C                     MOVELCAULDA    W1ULDA
     C                     MOVELCABOX#    W1BOX#
     C                     MOVELCABOXT    W1BOXT
     C                     MOVELCANAMC    W1NAMC
     C                     MOVELCAINKK    W1INKK
     C                     MOVELCALPOS    W1LPOS
     C                     MOVELCANAM2    W1NAM2
     C                     MOVELCANAM3    W1NAM3
     C                     MOVELCANAD5    W1NAD5
     C                     MOVELCANAD6    W1NAD6
     C                     MOVELCAFILL    W1FILL
     C                     MOVELCATERM    W1TERM
     C                     MOVELCAALL     W1ALL
     C                     MOVELCAEXTR    W1EXTR
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCAIAFB    W1IAFB
     C                     MOVELCAIAFP    W1IAFP
     C                     MOVELCAFIXD    W1FIXD
     C                     MOVELCAFIXT    W1FIXT
     C                     MOVELCATIMS    W1TIMS
     C                     MOVELCAPPUL    W1PPUL
     C                     MOVELCASAT     W1SAT
     C                     MOVELCASHN1    W1SHN1
     C                     MOVELCASHN2    W1SHN2
     C                     MOVELCASHN3    W1SHN3
     C                     MOVELCASYOT    W1SYOT
     C                     MOVELCATKR1    W1TKR1
     C                     MOVELCATKR2    W1TKR2
     C                     MOVELCATKR3    W1TKR3
     C                     MOVELCATKR4    W1TKR4
     C                     MOVELCAKADT    W1KADT
     C                     MOVELCAKATI    W1KATI
     C                     MOVELCASEQ#    W1SEQ#
     C                     MOVELCAPLDT    W1PLDT
     C                     MOVELCAPLTI    W1PLTI
     C                     MOVELCASHME    W1SHME
     C                     WRITEAL#WPB11
     C                     ENDIF
      *
     CSR         ESB550    ENDSR
