     H            Y.
     F** AL#R07  *******************************************
     F*  AL#PP11に品番種類セット                         *
     F*      ITS.        2015.05.20                        *
     F******************************************************
     FAL#PP11 UF  E           K        DISK
     FAL#PL03 IF  E           K        DISK
     FAL#PP00 IF  E           K        DISK
     E                    SH        999 12
      *
     I            DS
     I                                        1  12 C1SHN
     I                                        1   5 C1SHN1
     I                                        6  10 C1SHN2
     I                                       11  12 C1SHN3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      * PALLET PULLING ONE PART
     C                     Z-ADD22        PULONE  30
     C                     MOVEL'PULONE'  KEY    10
     C           KEY       CHAINAL#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDC0VALU    PULONE
     C                     ENDIF
      *
     C                     READ AL#PP111                 81
     C           *IN81     DOWEQ'0'
     C           C1SHN     IFEQ *BLANK
     C                     EXSR #SB400
     C                     UPDATAL#PP111
     C                     ENDIF
     C                     READ AL#PP111                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *-----------------------------------------------------
      * AL#PP11
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C           KEYCA     KLIST
     C                     KFLD           C1SHID
     C                     KFLD           C1SHIT
     C                     KFLD           C1SURT
     C                     KFLD           C1NONY
     C                     KFLD           C1NKOJ
     C                     KFLD           C1NUKE
     C                     KFLD           C1ORD#
     C                     KFLD           C1PALT
     C                     CLEARSH
     C                     Z-ADD0         X       40
     C           KEYCA     SETLLAL#PL031
     C           KEYCA     READEAL#PL031                 90
     C           *IN90     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C           CAFIXD    IFEQ 0
     C                     EXSR #SB410
     C                     ENDIF
     C                     ENDIF
     C           KEYCA     READEAL#PL031                 90
     C                     ENDDO
      *
     C                     Z-ADDX         C1PRT
      * 2016.02.18パレット集荷の条件破棄
     C           X         IFEQ 1
     C           C1BOX     ANDGEPULONE
     C******               MOVEL'1'       C1PPUL
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *-----------------------------------------------------
      * AL#PP11
      *-----------------------------------------------------
     CSR         #SB410    BEGSR
      *社内品番
     C                     MOVELCATOKU    PTOKU
     C                     MOVELCANONY    PNONY
     C                     MOVELCANKOJ    PNKOJ
     C                     MOVELCANUKE    PNUKE
     C                     MOVEL*BLANK    @MHIN
     C                     MOVELCAMHN     @MHIN
     C                     MOVEL*BLANK    @SHIN
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C           @SHIN     LOKUPSH                       29
     C           *IN29     IFEQ '0'
     C                     ADD  1         X
     C                     MOVEL@SHIN     SH,X
     C                     ENDIF
      *
     CSR         ESB410    ENDSR
