     H            Y.
     F** AL#R57 **************************************
     F* TRUCK BIN M/F                                *
     F*        ITS.         2015.05.20               *
     F************************************************
     FAL#WP51 IF  E           K        DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P9SURT  9
     C                     PARM           P9TRKB  2
     C                     PARM           P9KRKB  2
     C                     PARM           P9SEQ   3
     C                     PARM           P9STS   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     MOVEL'0'       P9STS
     C                     READ AL#WP511                 20
     C           *IN20     DOWEQ'0'
     C           P9STS     ANDEQ'0'
     C           W1SEQ     IFLT P9SEQ
     C           P9KRKB    IFEQ W1KRKB
     C                     MOVEL'3'       P9STS
     C                     ENDIF
     C           P9TRKB    IFEQ W1TRKB
     C                     MOVEL'2'       P9STS
     C                     ENDIF
     C           P9SURT    IFEQ W1SURT
     C                     MOVEL'1'       P9STS
     C                     ENDIF
     C                     ENDIF
     C                     READ AL#WP511                 20
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
