     H            Y.
     F** AL#RD1 **************************************
     F*発行制御ファイルからワーク作成（再発行）    *
     F*        ITS.         2015.05.26               *
     F************************************************
     FAL#PLD1 UF  E           K        DISK
     FAL#WPD1 O   F     256            DISK                      A
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WKST
     I                                        1   80WKSTHZ
     I                                        9  140WKSTTI
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     Z-ADD0         WKST
     C                     Z-ADDSDATE     WKSTHZ
     C                     Z-ADDSTIME     WKSTTI
     C           KEYC7     KLIST
     C                     KFLD           KKNKHZ  80
     C                     KFLD           KKNKTI  60
      *抜き出し前
     C                     Z-ADD0         KKNKHZ
     C                     Z-ADD0         KKNKTI
     C                     MOVEL'0'       GET     1
     C           KEYC7     SETLLAL#PLD11
     C           KEYC7     READEAL#PLD11                 81
     C           *IN81     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           CDSKJY    IFEQ 'D'
     C           CDSKHZ    ANDLESDATE
     C                     ELSE
     C                     MOVEL'1'       GET     1
     C                     Z-ADDCDCRHZ    WKCRHZ  80
     C                     Z-ADDCDCRTI    WKCRTI  60
     C                     EXSR #SB400
     C                     ENDIF
     C           KEYC7     READEAL#PLD11                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C           KEYC7     SETLLAL#PLD11
     C           KEYC7     READEAL#PLD11                 81
     C           *IN81     DOWEQ'0'
     C           CDSKJY    IFEQ 'D'
     C           CDSKHZ    ANDLESDATE
     C                     ELSE
     C           CDCRHZ    IFEQ WKCRHZ
     C           CDCRTI    ANDEQWKCRTI
     C                     Z-ADDSDATE     CDKOHZ
     C                     Z-ADDSTIME     CDKOTI
     C                     MOVELW#USER    CDKOME
     C                     Z-ADDSDATE     CDNKHZ
     C                     Z-ADDSTIME     CDNKTI
     C                     UPDATAL#PLD11
     C                     EXCPTDT
     C                     ENDIF
     C                     ENDIF
     C           KEYC7     READEAL#PLD11                 81
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
     OAL#WPD1 EADD             DT
     O                         CDDATA
