     H            Y.
     F** AL#RC2 **************************************
     F* TRUCK BIN M/F                                *
     F*        ITS.         2015.05.20               *
     F************************************************
     FAL#WPC1 UF  E           K        DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P9TRKB  2
     C                     PARM           P9SURT  9
     C                     PARM           P9STTN  40
     C                     PARM           P9EDTN  40
     C                     PARM           P9SEQ   3
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           P9TRKB    CHAINAL#WPC11             20
     C           *IN20     IFEQ '0'
     C                     MOVELP9TRKB    W1TRKB
     C                     MOVELP9SURT    W1SURT
     C                     Z-ADDP9STTN    W1STTN
     C                     Z-ADDP9EDTN    W1EDTN
     C                     UPDATAL#WPC11
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
