     H            Y.
     F** AL#R06  *******************************************
     F*  AL#WP13にＩＡＦパレット＃をセット               *
     F*      ITS.        2015.05.20                        *
     F******************************************************
     FAL#WP13 UF  E           K        DISK
     FAL#PP95 IF  E           K        DISK
     FAL#PP96 IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     MOVEL*BLANK    SVSHID  8
     C                     MOVEL*BLANK    SVSHIT  6
     C                     MOVEL*BLANK    SVTRKB  2
     C                     MOVEL*BLANK    SVSURT  9
     C                     Z-ADD0         WKPSEQ  40
     C                     MOVEL*BLANK    WKIAFP  3
     C                     READ AL#WP131                 81
      *
     C           *IN81     DOWEQ'0'
     C****       W3SHID    IFNE SVSHID
     C****       W3SHIT    ORNE SVSHIT
     C****       W3TRKB    IFNE SVTRKB
     C****       W3SURT    ORNE SVSURT
     C****                 MOVELW3SHID    SVSHID
     C****                 MOVELW3SHIT    SVSHIT
     C****                 MOVELW3TRKB    SVTRKB
     C****                 MOVELW3SURT    SVSURT
     C****                 Z-ADD0         WKIAFP  30
     C           WKPSEQ    IFEQ 0
     C           W3EXTR    IFNE 0
     C                     EXSR #SB910
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         WKPSEQ
     C           WKPSEQ    IFLE 999
     C                     MOVE WKPSEQ    WKIAFP
     C                     ELSE
     C                     EXSR #SB920
     C                     ENDIF
     C                     Z-ADDWKPSEQ    W3PSEQ
     C                     MOVE WKIAFP    W3IAFP
     C                     UPDATAL#WP131
     C                     READ AL#WP131                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *-----------------------------------------------------
      *エクストラの場合のパレット＃
      *-----------------------------------------------------
     CSR         #SB910    BEGSR
      *
     C           KEYCA     KLIST
     C                     KFLD           W3FIXD
     C                     KFLD           W3FIXT
     C*******              KFLD           W3TRKB
      *
     C           KEYCA     SETLLAL#PP951
     C           KEYCA     READEAL#PP951                 89
     C           *IN89     DOWEQ'0'
     C           D9SKJY    IFEQ 'D'
     C           D9SKHZ    ANDLESDATE
     C                     ELSE
     C                     Z-ADDD9PSEQ    WKPSEQ
     C                     ENDIF
     C           KEYCA     READEAL#PP951                 89
     C                     ENDDO
      *
     CSR         ESB910    ENDSR
      *-----------------------------------------------------
      *パレット＃１０００超え
      *-----------------------------------------------------
     CSR         #SB920    BEGSR
      *
     C           WKPSEQ    CHAINAL#PP961             77
     C           *IN77     IFEQ '0'
     C                     MOVELQ6IAFP    WKIAFP
     C                     ENDIF
      *
     CSR         ESB920    ENDSR
