     H            Y.
     F** AL#R7K **************************************
     F*仕切りにパレットごとの箱数セット            *
     F*     SAKAKI.        2020.02.03                *
     F************************************************
     FAL#WP73 UF  F    0256            DISK
     E                    PL2        16  3               PALLET(KANBAN)
     E                    PL3        16  3               PALLET(MEMO)
     E                    BX2        16  3 0
     E                    BX3        16  3 0
     E                    PUL        16  1               PALLET PULL
     E                    ZON        16  1               ZONE
      *
     IAL#WP73 AA  01
     I                                        1 256 IALL
     I                                        1   1 IDTK
      * PALLET PULL
     I                                       32  32 IPULL1
     I                                       36  36 IPULL2
     I                                       40  40 IPULL3
     I                                       44  44 IPULL4
     I                                       48  48 IPULL5
     I                                       52  52 IPULL6
     I                                       56  56 IPULL7
     I                                       60  60 IPULL8
     I                                       64  64 IPULL9
     I                                       68  68 IPULLA
     I                                       72  72 IPULLB
     I                                       76  76 IPULLC
     I                                       80  80 IPULLD
     I                                       84  84 IPULLE
     I                                       88  88 IPULLF
     I                                       92  92 IPULLG
      * IAF PALLET#
     I                                       33  35 IIAFP1
     I                                       37  39 IIAFP2
     I                                       41  43 IIAFP3
     I                                       45  47 IIAFP4
     I                                       49  51 IIAFP5
     I                                       53  55 IIAFP6
     I                                       57  59 IIAFP7
     I                                       61  63 IIAFP8
     I                                       65  67 IIAFP9
     I                                       69  71 IIAFPA
     I                                       73  75 IIAFPB
     I                                       77  79 IIAFPC
     I                                       81  83 IIAFPD
     I                                       85  87 IIAFPE
     I                                       89  91 IIAFPF
     I                                       93  95 IIAFPG
      * ZONE
     I                                       96  96 IZONE1
     I                                       97  97 IZONE2
     I                                       98  98 IZONE3
     I                                       99  99 IZONE4
     I                                      100 100 IZONE5
     I                                      101 101 IZONE6
     I                                      102 102 IZONE7
     I                                      103 103 IZONE8
     I                                      104 104 IZONE9
     I                                      105 105 IZONEA
     I                                      106 106 IZONEB
     I                                      107 107 IZONEC
     I                                      108 108 IZONED
     I                                      109 109 IZONEE
     I                                      110 110 IZONEF
     I                                      111 111 IZONEG
      *
     I                                      219 221 IIAFP
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
      *
     C                     Z-ADD0         A       20
     C                     CLEARPL2
     C                     CLEARPL3
     C                     CLEARBX2
     C                     CLEARBX3
     C           *HIVAL    SETGTAL#WP73
     C                     READPAL#WP73                  22
     C           *IN22     DOWEQ'0'
     C                     SELEC
     C           IDTK      WHEQ '2'                        KANBAN
     C                     EXSR #SB010
     C           IDTK      WHEQ '3'                        SHORTAGE MEMO
     C                     EXSR #SB100
     C                     ENDSL
     C                     READPAL#WP73                  22
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *------------------------------------------*
      *KANBAN
      *------------------------------------------*
     CSR         #SB010    BEGSR
      *
     C                     Z-ADD1         X       20
     C           IIAFP     LOKUPPL2,X                    29
     C           *IN29     IFEQ '0'
     C                     ADD  1         A
     C                     MOVELIIAFP     PL2,A
     C                     Z-ADD1         BX2,A
     C                     ELSE
     C                     ADD  1         BX2,X
     C                     ENDIF
      *
     CSR         ESB010    ENDSR
      *------------------------------------------*
      * SHORTAGE MEMO
      *------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     CLEARPL3
     C                     CLEARBX3
     C                     CLEARPUL
     C                     CLEARZON
     C                     MOVELIIAFP1    PL3,1
     C                     MOVELIIAFP2    PL3,2
     C                     MOVELIIAFP3    PL3,3
     C                     MOVELIIAFP4    PL3,4
     C                     MOVELIIAFP5    PL3,5
     C                     MOVELIIAFP6    PL3,6
     C                     MOVELIIAFP7    PL3,7
     C                     MOVELIIAFP8    PL3,8
     C                     MOVELIIAFP9    PL3,9
     C                     MOVELIIAFPA    PL3,10
     C                     MOVELIIAFPB    PL3,11
     C                     MOVELIIAFPC    PL3,12
     C                     MOVELIIAFPD    PL3,13
     C                     MOVELIIAFPE    PL3,14
     C                     MOVELIIAFPF    PL3,15
     C                     MOVELIIAFPG    PL3,16
      *
     C                     MOVELIPULL1    PUL,1
     C                     MOVELIPULL2    PUL,2
     C                     MOVELIPULL3    PUL,3
     C                     MOVELIPULL4    PUL,4
     C                     MOVELIPULL5    PUL,5
     C                     MOVELIPULL6    PUL,6
     C                     MOVELIPULL7    PUL,7
     C                     MOVELIPULL8    PUL,8
     C                     MOVELIPULL9    PUL,9
     C                     MOVELIPULLA    PUL,10
     C                     MOVELIPULLB    PUL,11
     C                     MOVELIPULLC    PUL,12
     C                     MOVELIPULLD    PUL,13
     C                     MOVELIPULLE    PUL,14
     C                     MOVELIPULLF    PUL,15
     C                     MOVELIPULLG    PUL,16
      *
     C                     MOVELIZONE1    ZON,1
     C                     MOVELIZONE2    ZON,2
     C                     MOVELIZONE3    ZON,3
     C                     MOVELIZONE4    ZON,4
     C                     MOVELIZONE5    ZON,5
     C                     MOVELIZONE6    ZON,6
     C                     MOVELIZONE7    ZON,7
     C                     MOVELIZONE8    ZON,8
     C                     MOVELIZONE9    ZON,9
     C                     MOVELIZONEA    ZON,10
     C                     MOVELIZONEB    ZON,11
     C                     MOVELIZONEC    ZON,12
     C                     MOVELIZONED    ZON,13
     C                     MOVELIZONEE    ZON,14
     C                     MOVELIZONEF    ZON,15
     C                     MOVELIZONEG    ZON,16
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE16
     C                     Z-ADD1         A
     C                     MOVELPL2,X     WPLT    3
     C           WPLT      LOKUPPL3,A                    29
     C           *IN29     IFEQ '1'
     C                     Z-ADDBX2,X     BX3,A
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     EXSR #SB101
      *
     C                     EXCPTDT
     C                     Z-ADD0         A       20
     C                     CLEARPL2
     C                     CLEARPL3
     C                     CLEARBX2
     C                     CLEARBX3
      *
     CSR         ESB100    ENDSR
      *------------------------------------------*
      *箱数がゼロのパレットは詰める
      *------------------------------------------*
     CSR         #SB101    BEGSR
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE16
     C           BX3,X     IFEQ 0
     C                     MOVEL*BLANK    PL3,X
     C                     MOVEL*BLANK    ZON,X
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     Z-ADD1         X       20
     C           X         DOWLE16
     C           BX3,X     IFEQ 0
     C                     EXSR #SB102
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB101    ENDSR
      *------------------------------------------*
      *以降の配列を詰める
      *------------------------------------------*
     CSR         #SB102    BEGSR
      * X : 01-04 --> ZONE A
      * X : 05-08 --> ZONE B
      * X : 09-12 --> ZONE C
      * X : 13-16 --> ZONE D
      *
     C                     Z-ADD1         W@LOOP  20
     C                     SELEC
     C           X         WHLE 4
     C                     Z-ADD4         W@LOOP
     C           X         WHLE 8
     C                     Z-ADD8         W@LOOP
     C           X         WHLE 12
     C                     Z-ADD12        W@LOOP
     C           X         WHLE 16
     C                     Z-ADD16        W@LOOP
     C                     ENDSL
      *
     C                     Z-ADDX         Y       20
     C           X         ADD  1         Z       20
     C           Y         DOWLEW@LOOP
     C           Z         IFLE W@LOOP
     C                     MOVELPUL,Z     PUL,Y            １つ後ろを詰める
     C                     MOVELPL3,Z     PL3,Y            １つ後ろを詰める
     C                     MOVELZON,Z     ZON,Y            １つ後ろを詰める
     C                     Z-ADDBX3,Z     BX3,Y            １つ後ろを詰める
      *ブランク以外で詰めたら最初から
     C           PL3,Z     IFNE *BLANK
     C                     Z-ADD0         X
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*BLANK    PUL,Y            １つ後ろを詰める
     C                     MOVEL*BLANK    PL3,Y            １つ後ろを詰める
     C                     MOVEL*BLANK    ZON,Y            １つ後ろを詰める
     C                     Z-ADD0         BX3,Y            １つ後ろを詰める
     C                     ENDIF
     C                     ADD  1         Y
     C                     ADD  1         Z
     C                     ENDDO
      *
     CSR         ESB102    ENDSR
      *
     OAL#WP73 E                DT
      * PALLET PULL
     O                         PUL,1     32
     O                         PUL,2     36
     O                         PUL,3     40
     O                         PUL,4     44
     O                         PUL,5     48
     O                         PUL,6     52
     O                         PUL,7     56
     O                         PUL,8     60
     O                         PUL,9     64
     O                         PUL,10    68
     O                         PUL,11    72
     O                         PUL,12    76
     O                         PUL,13    80
     O                         PUL,14    84
     O                         PUL,15    88
     O                         PUL,16    92
      * IAF PALLET#
     O                         PL3,1     35
     O                         PL3,2     39
     O                         PL3,3     43
     O                         PL3,4     47
     O                         PL3,5     51
     O                         PL3,6     55
     O                         PL3,7     59
     O                         PL3,8     63
     O                         PL3,9     67
     O                         PL3,10    71
     O                         PL3,11    75
     O                         PL3,12    79
     O                         PL3,13    83
     O                         PL3,14    87
     O                         PL3,15    91
     O                         PL3,16    95
      * ZONE
     O                         ZON,1     96
     O                         ZON,2     97
     O                         ZON,3     98
     O                         ZON,4     99
     O                         ZON,5    100
     O                         ZON,6    101
     O                         ZON,7    102
     O                         ZON,8    103
     O                         ZON,9    104
     O                         ZON,10   105
     O                         ZON,11   106
     O                         ZON,12   107
     O                         ZON,13   108
     O                         ZON,14   109
     O                         ZON,15   110
     O                         ZON,16   111
      *
     O                         BX3,1    114
     O                         BX3,2    117
     O                         BX3,3    120
     O                         BX3,4    123
     O                         BX3,5    126
     O                         BX3,6    129
     O                         BX3,7    132
     O                         BX3,8    135
     O                         BX3,9    138
     O                         BX3,10   141
     O                         BX3,11   144
     O                         BX3,12   147
     O                         BX3,13   150
     O                         BX3,14   153
     O                         BX3,15   156
     O                         BX3,16   159
