     H            Y.
     F** AL#RF3  *******************************************
     F*LIST OF COMPLETE PALLETS                            *
     F*      ITS.        2015.06.15                        *
     F******************************************************
     FAL#WPF0 IF  E           K        DISK
     FAL#PL01 IF  E           K        DISK
     FAL#WPF3 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1DATE  80
     C                     PARM           P9CMD   2
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     READ AL#WPF01                 80
     C           *IN80     DOWEQ'0'
     C           W0SEL     IFEQ '1'
     C                     EXSR #SB390
     C                     ENDIF
     C                     READ AL#WPF01                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#PP01
      *-----------------------------------------------------
     CSR         #SB390    BEGSR
      *
     C           KEYC1     KLIST
     C                     KFLD           KKKADT  8
      *
     C                     MOVE P1DATE    KKKADT
     C           KEYC1     SETLLAL#PL011
     C           KEYC1     READEAL#PL011                 81
     C           *IN81     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C           CASURT    IFEQ W0SURT
     C                     EXSR #SB500
     C                     ENDIF
     C                     ENDIF
     C           KEYC1     READEAL#PL011                 81
     C                     ENDDO
      *
     CSR         ESB390    ENDSR
      *-----------------------------------------------------
      *  AL#WPF3
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY33     KLIST
     C                     KFLD           CATRKB
     C                     KFLD           CANAMC
     C                     KFLD           CASHID
     C                     KFLD           CADOCK
     C                     KFLD           CAORD#
     C                     KFLD           CAIAFP
      *
     C           KEY33     CHAINAL#WPF31             24
     C           *IN24     IFEQ '0'
     C                     ADD  1         W3BOX
     C           CAPLDT    IFEQ 0
     C                     ELSE
     C                     ADD  1         W3SUMI
     C                     ENDIF
     C                     UPDATAL#WPF31
     C                     ELSE
     C                     CLEARAL#WPF31
     C                     MOVELCANAMC    W3NAMC
     C                     MOVELCASHID    W3SHID
     C                     MOVELCATRKB    W3TRKB
     C                     MOVELCADOCK    W3DOCK
     C                     MOVELCAORD#    W3ORD#
     C                     MOVELCAIAFP    W3IAFP
     C                     MOVELCAPALT    W3PALT
     C                     MOVELCASURT    W3SURT
     C                     Z-ADD1         W3BOX
     C           CAPLDT    IFEQ 0
     C                     Z-ADD0         W3SUMI
     C                     ELSE
     C                     Z-ADD1         W3SUMI
     C                     ENDIF
     C                     WRITEAL#WPF31
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
