     H            Y.
     F** AL#R63 **************************************
     F* CUSTOMER LABEL SORT LOCATION M/F             *
     F*        ITS.         2015.05.21               *
     F************************************************
     FAL#PL61 IF  E           K        DISK
     FAL#WP61 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     Z-ADD1         WKSORT  50
     C           WKSORT    DOWLE99
     C                     MOVELWKSORT    W1SORT
     C                     WRITEAL#WP611
     C                     ADD  1         WKSORT
     C                     ENDDO
      *
     C                     READ AL#PL611                 80
     C           *IN80     DOWEQ'0'
     C           C6SKJY    IFEQ 'D'
     C           C6SKHZ    ANDLE*DATE
     C                     ELSE
     C           C6SORT    CHAINAL#WP611             20
     C           *IN20     IFEQ '0'
     C                     MOVELC6SORT    W1SORT
     C                     MOVELC6BLK     W1BLK
     C                     MOVELC6BLK2    W1BLK2
     C                     MOVELC6SITE    W1SITE
     C                     MOVELC6SECT    W1SECT
     C                     UPDATAL#WP611
     C                     ENDIF
     C                     ENDIF
     C                     READ AL#PL611                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
