     H            Y.
     F** AL#RE0 *********************************************
     F* CHECKING TOYOTA EDI DATA
     F*             ITS.           2015.06.15               *
     F*  LEC 2024.05.22  CHECK MASTER FOR TOYOTA DELV CODE
     F*******************************************************
     FAL#PWE0 CF  E                    WORKSTN
     FAB#PL1A IF  E           K        DISK
     FAL#PL09 IF  E           K        DISK
     FAL#PL21 IF  E           K        DISK
     FAL#WPE0 O   E                    DISK                      A
     E                    ER      1  20 60
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SHID  80
     C                     PARM           P9CMD   2
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    P9CMD
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAL#PWE01
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1ERR
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      P9CMD
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1SHID    IFEQ 0
     C                     MOVELER,1      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     Z-ADDD1SHID    P1SHID
     C                     EXSR #SB500
     C                     MOVEL'99'      DSPSW
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           D1SHID    SETLLAB#PL1A
     C           D1SHID    READEAB#PL1A                  83
     C           *IN83     DOWEQ'0'
     C           BASKJY    IFEQ 'D'
     C                     ELSE
      *
     C           BANONY    CHAINAL#PL21              51
     C           *IN51     IFEQ *OFF
     C                     EXSR #SB510
     C                     ENDIF
     C                     ENDIF
     C           D1SHID    READEAB#PL1A                  83
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           KEYAL     KLIST
     C                     KFLD           KKNOHZ  8
     C                     KFLD           BATOKU
     C                     KFLD           BANONY
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           KKMHIN 12
     C                     MOVELBANOHZ    KKNOHZ
     C                     MOVELBAMHIN    KKMHIN
     C                     Z-ADD0         WKSRYO 100
     C           KEYAL     SETLLAL#PL09
     C           KEYAL     READEAL#PL09                  89
     C           *IN89     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLE*DATE
     C                     ELSE
     C           CAORD#    IFEQ BAODRN
     C           CAORD#    OREQ BAINVN
     C                     MOVE CAQTBO    WKQTBO  50
     C                     ADD  WKQTBO    WKSRYO
     C                     ENDIF
     C                     ENDIF
     C           KEYAL     READEAL#PL09                  89
     C                     ENDDO
      *
     C           WKSRYO    IFNE BASRYO
     C                     EXSR #SB520
     C                     ENDIF
      *
     CSR         ESB510    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB520    BEGSR
      *
     C                     CLEARAL#WPE01
     C                     MOVELBAKOHZ    W0KOHZ
     C                     MOVELBAKOHH    W0KOHH
     C                     MOVELBAKOSS    W0KOSS
     C                     MOVELBAKOME    W0KOME
     C                     MOVELBASIRE    W0SIRE
     C                     MOVELBASIRK    W0SIRK
     C                     MOVELBATOKU    W0TOKU
     C                     MOVELBANONY    W0NONY
     C                     MOVELBANKOJ    W0NKOJ
     C                     MOVELBANUKE    W0NUKE
     C                     MOVELBASBAN    W0SBAN
     C                     MOVELBAMHN1    W0MHN1
     C                     MOVELBAMHN2    W0MHN2
     C                     MOVELBAMHN3    W0MHN3
     C                     MOVELBAMHN4    W0MHN4
     C                     MOVELBASHN1    W0SHN1
     C                     MOVELBASHN2    W0SHN2
     C                     MOVELBASHN3    W0SHN3
     C                     MOVELBANOYY    W0NOYY
     C                     MOVELBANOMM    W0NOMM
     C                     MOVELBANODD    W0NODD
     C                     MOVELBANOTM    W0NOTM
     C                     MOVELBAINVN    W0INVN
     C                     MOVELBAODRN    W0ODRN
     C                     MOVELBASRYO    W0SRYO
     C                     MOVELBASYOS    W0SYOS
     C                     MOVELBATANK    W0TANK
     C                     MOVELBAURYY    W0URYY
     C                     MOVELBAURMM    W0URMM
     C                     MOVELBAURDD    W0URDD
     C                     MOVELBACARD    W0CARD
     C                     MOVELBARCOD    W0RCOD
     C                     MOVELBAALFL    W0ALFL
     C                     MOVELBANOBN    W0NOBN
     C                     MOVELBAUSYS    W0USYS
     C                     MOVELBAODER    W0ODER
     C                     MOVELBAHENK    W0HENK
     C                     MOVELBAJYKB    W0JYKB
     C                     MOVELBAEDIK    W0EDIK
     C                     MOVELBARESE    W0RESE
     C                     MOVELBADEYY    W0DEYY
     C                     MOVELBADEMM    W0DEMM
     C                     MOVELBADEDD    W0DEDD
     C                     MOVELBAPGID    W0PGID
     C                     Z-ADDWKSRYO    W0WEBS
     C                     WRITEAL#WPE01
      *
     CSR         ESB520    ENDSR
** ER
E-01 INPUT SHIP DATE.
E-02
E-03
E-04
E-05
E-06
