     H            Y.
     F** AL#R73 **************************************
     F*チケットデータワークから転送データ作成      *
     F*        ITS.         2015.05.27               *
     F************************************************
     FAL#WP46 IF  E                    DISK
     FAL#WP73 O   F     256            DISK                      A
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AL#WP461                 22
     C           *IN22     DOWEQ'0'
     C                     EXSR #SB400
     C                     EXCPTDT
     C                     READ AL#WP461                 22
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *空箱を再セット
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C                     Z-ADD0         P9EMPT
     C                     CALL 'AL#R41'
     C                     PARM           W6IAFB  3
     C                     PARM           W6IAFP  3
     C                     PARM           P9EMPT  30
     C                     Z-ADDP9EMPT    WKEMPT  30
      *
     CSR         ESB400    ENDSR
     OAL#WP73 EADD             DT
     O                                      '1'
     O                         W6SURT
     O                         W6SHID
     O                         W6SHIT
     O                         W6SMEI
     O                         W6DOCK
     O                         W6ORD#
     O                         W6PALT
     O                         W6NONY
     O                         W6NKOJ
     O                         W6NUKE
     O                         W6IAFB
     O                         W6IAFP
     O                         W6PPUL
     O                         W6EXT
     O                         W6SAT
     O                         W6BOX
     O*********                W6EMPT
     O                         WKEMPT
     O                         W6PFTR
     O                         W6PFBI
     O                         W6ZONE
