     H            Y.
     F** AL#RB0 *********************************************
     F* CHECKING OF SH PROCESS                              *
     F*             ITS.           2015.06.02               *
     F*******************************************************
     FAL#PWB0 CF  E                    WORKSTN
     E                    ER      1  20 60
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SHME 20
     C                     PARM           P9CMD   2
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    P1SHME
     C                     MOVEL*BLANK    P9CMD
     C                     MOVEL*BLANK    D1SHME
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAL#PWB01
     C                     SETOF                     303132
     C                     SETOF                     333435
     C                     SETOF                     99
     C                     MOVEL*BLANK    D1ERR
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'01'      P9CMD
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     CALL 'AL#CB5'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1SHME    IFEQ *BLANK
     C                     MOVELER,1      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     MOVELD1SHME    WKCONT 16
     C                     MOVEL*BLANK    CD      1
     C           1         SUBSTD1SHME:17 CD
     C                     MOVELWKCONT    PMAREA
     C                     MOVEL'016'     PMBYTE
     C                     MOVEL*BLANK    PMCHK
     C                     MOVEL*BLANK    PMRTCD
     C                     CALL 'ALBRCC'
     C                     PARM           PMAREA100        *フィールド
     C                     PARM           PMBYTE  3        *有効桁数
     C                     PARM           PMCHK   1        * kｩｮhmﾞﾆﾞｮn
     C                     PARM           PMRTCD  1        * ﾒjｰ]ﾃｰnﾞ
     C           CD        IFNE PMCHK
     C                     MOVELER,2      D1ERR
     C                     SETON                     3199
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     MOVEL'99'      DSPSW
     C                     MOVELD1SHME    P1SHME
     C                     MOVEL'05'      P9CMD
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
** ER
E-01 INPUT BARCODE.
E-02 BARCODE ERR.
E-03
E-04
E-05
E-06
