     H            Y.
     F** AL#R21 *********************************************
     F* NAMC DESTINATION    M/F
     F*    ITS.             2015.06.15                      *
     F*******************************************************
     FAL#PW21 CF  E                    WORKSTN
     FAL#PP21 UF  E           K        DISK                      A
     FGADPL11 IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   80B2SKHZ
     I                                        1   40B2SKYY
     I                                        5   60B2SKMM
     I                                        7   80B2SKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAL#PW211
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     349930
      *
     C                     TIME           WTIME
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN08     IFEQ '1'
     C                     CALL 'AL#R22'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1UPD     IFEQ '0'
     C           D1UPD     OREQ '1'
     C           D1UPD     OREQ '2'
     C                     ELSE
     C                     SETON                     3099
     C                     MOVELER,1      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           D1NAMC    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           KEYCN     KLIST
     C                     KFLD           D1NAMC
      *
     C           KEYCN     CHAINAL#PP211             20
     C           *IN20     IFEQ '0'
     C           C2SKJY    ANDEQ'D'
     C           C2SKHZ    ANDLE*DATE
     C                     SETON                     20
     C                     ENDIF
      *
     C                     SELEC
     C           D1UPD     WHEQ '0'
     C           *IN20     IFEQ '1'
     C                     SETON                     303199
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
     C           D1UPD     WHEQ '2'
     C           *IN20     IFEQ '0'
     C                     SETON                     303199
     C                     MOVELER,4      D1ERR
     C                     GOTO ESB210
     C                     ENDIF
     C                     ENDSL
      *
     C                     MOVEL*BLANK    D2TONM
     C                     MOVEL*BLANK    D2NONM
     C                     MOVEL*BLANK    D2KJNM
     C                     SETOF                     19
     C                     SELEC
     C           D1UPD     WHEQ '0'
     C                     SETON                     19
     C                     Z-ADDC2TOKU    D2TOKU
     C                     Z-ADDC2TOKU    WKCODE  40
     C                     EXSR #SB211
     C                     MOVELWKSMEI    D2TONM
     C                     Z-ADDC2NONY    D2NONY
     C                     Z-ADDC2NONY    WKCODE  40
     C                     EXSR #SB211
     C                     MOVELWKSMEI    D2TONM
     C                     MOVELC2NKOJ    D2NKOJ
     C                     EXSR #SB212
     C                     MOVELWKKJNM    D2KJNM
     C           D1UPD     WHEQ '1'
     C                     Z-ADDC2TOKU    D2TOKU
     C                     Z-ADDC2TOKU    WKCODE  40
     C                     EXSR #SB211
     C                     MOVELWKSMEI    D2TONM
     C                     Z-ADDC2NONY    D2NONY
     C                     Z-ADDC2NONY    WKCODE  40
     C                     EXSR #SB211
     C                     MOVELWKSMEI    D2TONM
     C                     MOVELC2NKOJ    D2NKOJ
     C                     EXSR #SB212
     C                     MOVELWKKJNM    D2KJNM
     C           D1UPD     WHEQ '2'
     C                     Z-ADD0         D2TOKU
     C                     Z-ADD0         D2NONY
     C                     MOVEL*BLANK    D2NKOJ
     C                     ENDSL
      *
     C                     MOVEL'02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB211    BEGSR
      *
     C                     MOVEL*BLANK    WKSMEI 15
     C           WKCODE    CHAINFGBPL011             24
     C           *IN24     IFEQ '0'
     C           B2SKJY    ANDEQ'D'
     C           B2SKHZ    ANDLESDATE
     C                     SETON                     24
     C                     ENDIF
     C           *IN24     IFEQ '0'
     C                     MOVELB2SMEI    WKSMEI
     C                     ELSE
     C                     SETON                     99
     C                     ENDIF
      *
     CSR         ESB211    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB212    BEGSR
      *
     C           KEYB5     KLIST
     C                     KFLD           D2TOKU
     C                     KFLD           D2NONY
     C                     KFLD           D2NKOJ
     C                     MOVEL'0'       GET     1
     C                     MOVEL*BLANK    WKKJNM 15
     C           KEYB5     SETLLGADPL111
     C           KEYB5     READEGADPL111                 83
     C           *IN83     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           B5SKJY    IFEQ 'D'
     C           B5SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'1'       GET
     C                     MOVELB5KMEI    WKKJNM
     C                     ENDIF
     C           KEYB5     READEGADPL111                 83
     C                     ENDDO
      *
     CSR         ESB212    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTAL#PW212
     C                     MOVEL*BLANK    D1ERR
     C                     SETOF                     313233
     C                     SETOF                     349930
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     MOVEL*BLANK    D2TONM
     C                     Z-ADDD2TOKU    WKCODE
     C                     EXSR #SB211
     C           *IN99     IFEQ '1'
     C                     SETON                     3199
     C                     MOVELER,6      D2ERR
     C                     GOTO ESB220
     C                     ENDIF
     C                     MOVELWKSMEI    D2TONM
      *
     C                     MOVEL*BLANK    D2NONM
     C                     Z-ADDD2NONY    WKCODE
     C                     EXSR #SB211
     C           *IN99     IFEQ '1'
     C                     SETON                     3299
     C                     MOVELER,7      D2ERR
     C                     GOTO ESB220
     C                     ENDIF
     C                     MOVELWKSMEI    D2NONM
      *
     C                     MOVEL*BLANK    D2KJNM
     C           D2NKOJ    IFEQ ' '
     C                     SETON                     3399
     C                     MOVELER,8      D2ERR
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     EXSR #SB212
     C           GET       IFEQ '0'
     C                     SETON                     3399
     C                     MOVELER,9      D2ERR
     C                     GOTO ESB220
     C                     ENDIF
     C                     MOVELWKKJNM    D2KJNM
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB500
     C                     MOVEL*BLANK    D1UPD
     C                     MOVEL*BLANK    D1NAMC
     C                     MOVEL'01'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C           KEYCN     CHAINAL#PP211             20
      *
     C                     SELEC
      *
     C           D1UPD     WHEQ '0'
     C                     MOVEL'D'       C2SKJY
     C                     Z-ADD0         C2SKHZ
     C           *IN20     IFEQ '0'
     C                     UPDATAL#PP211
     C                     ENDIF
      *
     C           D1UPD     WHEQ '1'
     C                     Z-ADD*DATE     C2KOHZ
     C                     TIME           C2KOTI
     C                     Z-ADDD2TOKU    C2TOKU
     C                     Z-ADDD2NONY    C2NONY
     C                     MOVELD2NKOJ    C2NKOJ
     C           *IN20     IFEQ '0'
     C                     UPDATAL#PP211
     C                     ENDIF
      *
     C           D1UPD     WHEQ '2'
     C                     CLEARAL#PP211
     C                     Z-ADD*DATE     C2KOHZ
     C                     TIME           C2KOTI
     C                     MOVELD1NAMC    C2NAMC
     C                     Z-ADDD2TOKU    C2TOKU
     C                     Z-ADDD2NONY    C2NONY
     C                     MOVELD2NKOJ    C2NKOJ
     C           *IN20     IFEQ '0'
     C                     UPDATAL#PP211
     C                     ELSE
     C                     WRITEAL#PP211
     C                     ENDIF
      *
     C                     ENDSL
      *
     CSR         ESB500    ENDSR
**
ER-1 INPUT 1 OR 2.
ER-2 INPUT PART#.
ER-3 NO DATA.
ER-4 ALREADY EXIST.
ER-5 NO PART# M/F.
ER-6 CUSTOMER CODE ERR.
ER-7 DELIVERY CODE ERR.
ER-8 INPUT FACTORY CODE.
ER-9 NO SHIPMENT M/F.
