     H            Y.
     F** AL#RF4  *******************************************
     F*LIST OF COMPLETE PALLETS                            *
     F*      ITS.        2015.06.15                        *
     F******************************************************
     FAL#WPF3 IF  E           K        DISK
     FAL#WPF4 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     READ AL#WPF31                 81
     C           *IN81     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ AL#WPF31                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#WPF0
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY33     KLIST
     C                     KFLD           W3TRKB
     C                     KFLD           W3NAMC
     C                     KFLD           W3SHID
     C                     KFLD           W3DOCK
     C                     KFLD           W3ORD#
      *
     C           KEY33     CHAINAL#WPF41             24
     C           *IN24     IFEQ '0'
     C                     ADD  1         W4KPLT
     C           W3BOX     IFEQ W3SUMI
     C                     ADD  1         W4COMP
     C                     ELSE
     C                     ENDIF
     C                     UPDATAL#WPF41
     C                     ELSE
     C                     CLEARAL#WPF41
     C                     MOVELW3NAMC    W4NAMC
     C                     MOVELW3SHID    W4SHID
     C                     MOVELW3TRKB    W4TRKB
     C                     MOVELW3DOCK    W4DOCK
     C                     MOVELW3ORD#    W4ORD#
     C                     MOVELW3SURT    W4SURT
     C                     Z-ADD1         W4KPLT
     C           W3BOX     IFEQ W3SUMI
     C                     Z-ADD1         W4COMP
     C                     ELSE
     C                     ENDIF
     C                     WRITEAL#WPF41
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
