     H            Y.
     F** AL#RB3 **************************************
     F* CHECKING OF SH PROCESS                       *
     F*     ITS.          2015.05.29                 *
     F************************************************
     FAL#PWB3 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                              KINFDS INFDS
     FAL#WPB1 IF  E           K        DISK
      *
     E                    ER      1  11 65
      *
     I            DS
     I                                        1   6 P2SHIT
     I                                        1   2 P2SHIH
     I                                        3   4 P2SHIM
     I                                        5   6 P2SHIS
      *
     I            DS
     I                                        1   6 W1SHIT
     I                                        1   2 W1SHIH
     I                                        3   4 W1SHIM
     I                                        5   6 W1SHIS
      *
     I            DS
     I                                        1   60W1FIXT
     I                                        1   2 W1FIXH
     I                                        3   4 W1FIXM
     I                                        5   6 W1FIXS
      *
     I            DS
     I                                        1   60W1KATI
     I                                        1   2 W1KATH
     I                                        3   4 W1KATM
     I                                        5   6 W1KATS
      *
     I            DS
     I                                        1   60W1PLTI
     I                                        1   2 W1PLTH
     I                                        3   4 W1PLTM
     I                                        5   6 W1PLTS
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 ##USER
     I                                      264 269 W#JBNO
      *
     I              'SATURDAY'            C         CSAT
      *
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1IAFB  3
     C                     PARM           P1IAFP  3
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
     C           KKWRK     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           P1IAFB
     C                     KFLD           P1IAFP
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
     C                     MOVEL'5'       KKTYPE  1
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * INQ                                                *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           KKWRK     SETLLAL#WPB11
     C           KKWRK     READEAL#WPB11                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KKWRK     READEAL#WPB11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * SFL                                                *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEAL#PWB39
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      * F6
     C           *IN06     IFEQ '1'
     C                     MOVEL'LANPRT03'#@OUTQ
     C                     MOVELP1IAFB    P9IAFB
     C                     MOVELP1IAFP    P9IAFP
     C                     CALL 'AL#CB4'
     C                     PARM           #@OUTQ 10
     C                     PARM           P9IAFB  3
     C                     PARM           P9IAFP  3
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           KKWRK     SETGTAL#WPB11
     C           KKWRK     REDPEAL#WPB11                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  15        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C           KKWRK     REDPEAL#WPB11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           KKWRK     SETLLAL#WPB11
     C           KKWRK     READEAL#WPB11                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KKWRK     READEAL#WPB11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C           KKWRK     READEAL#WPB11                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 15
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR                                              *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVELW1ORD#    C1ORD#
     C                     MOVELW1IAFB    C1IAFB
     C                     MOVELW1IAFP    C1IAFP
     C                     MOVELW1SURT    C1SURT
     C                     MOVEL*BLANK    S1LOC
     C           S1LOC     CAT  W1TKR2:0  S1LOC
     C           S1LOC     CAT  '-':0     S1LOC
     C           S1LOC     CAT  W1TKR3:0  S1LOC
     C                     MOVELW1KNB#    S1KNB#
     C           5         SUBSTW1MHN:1   WKMHN1  5
     C           5         SUBSTW1MHN:6   WKMHN2  5
     C           2         SUBSTW1MHN:11  WKMHN3  2
     C                     MOVEL*BLANK    S1MHN
     C           S1MHN     CAT  WKMHN1:0  S1MHN
     C           S1MHN     CAT  '-':0     S1MHN
     C           S1MHN     CAT  WKMHN2:0  S1MHN
     C           WKMHN3    IFNE *BLANK
     C           S1MHN     CAT  '-':0     S1MHN
     C           S1MHN     CAT  WKMHN3:0  S1MHN
     C                     ENDIF
     C                     Z-ADDW1SUMI    S1SUMI
     C                     Z-ADDW1BOX     S1TOTL
     C                     SETOF                     39
     C                     MOVEL'0'       H139
     C           W1BOX     IFEQ W1SUMI
     C                     MOVEL'OK'      S1STS
     C                     ELSE
     C                     MOVEL'NG'      S1STS
     C                     SETON                     39
     C                     MOVEL'1'       H139
     C                     ENDIF
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT                                               *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C           KKWRK     READEAL#WPB11                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV                                                *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C           KKWRK     REDPEAL#WPB11                 81
      *
     CSR         ENEXTP    ENDSR
**
ER-1 NO DATA.
