     H            Y.
     F** AL#R7I *********************************************
     F* LOCATION ERROR
     F*              ITS.        2015.05.13                 *
     F*******************************************************
     FAL#WP77 IF  E           K        DISK
     FAL#PP77 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
      *
     C                     READ AL#WP771                 80
     C           *IN80     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ AL#WP771                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAL#PP771
     C                     Z-ADDSDATE     L7KOHZ
     C                     Z-ADDSTIME     L7KOTI
     C                     MOVELW#USER    L7KOME
     C                     MOVELW7CADT    L7CADT
     C                     MOVELW7SUPI    L7SUPI
     C                     MOVELW7LOC1    L7LOC1
     C                     MOVELW7LOC2    L7LOC2
     C                     MOVELW7LOC3    L7LOC3
     C                     MOVELW7LOC4    L7LOC4
     C                     MOVELW7SUPC    L7SUPC
     C                     MOVELW7DOCK    L7DOCK
     C                     MOVELW7KNB#    L7KNB#
     C                     MOVELW7MHN     L7MHN
     C                     MOVELW7LIAD    L7LIAD
     C                     MOVELW7STAD    L7STAD
     C                     MOVELW7QTBO    L7QTBO
     C                     MOVELW7SUPN    L7SUPN
     C                     MOVELW7MART    L7MART
     C                     MOVELW7SURT    L7SURT
     C                     MOVELW7ULDA    L7ULDA
     C                     MOVELW7SHID    L7SHID
     C                     MOVELW7SHIT    L7SHIT
     C                     MOVELW7ORD#    L7ORD#
     C                     MOVELW7BOX#    L7BOX#
     C                     MOVELW7BOXT    L7BOXT
     C                     MOVELW7NAMC    L7NAMC
     C                     MOVELW7INKK    L7INKK
     C                     MOVELW7LPOS    L7LPOS
     C                     MOVELW7NAM2    L7NAM2
     C                     MOVELW7NAM3    L7NAM3
     C                     MOVELW7PALT    L7PALT
     C                     MOVELW7NAD5    L7NAD5
     C                     MOVELW7NAD6    L7NAD6
     C                     MOVELW7FILL    L7FILL
     C                     MOVELW7TERM    L7TERM
     C                     MOVELW7SHN1    L7SHN1
     C                     MOVELW7SHN2    L7SHN2
     C                     MOVELW7SHN3    L7SHN3
     C                     MOVELW7TKR1    L7TKR1
     C                     MOVELW7TKR2    L7TKR2
     C                     MOVELW7TKR3    L7TKR3
     C                     MOVELW7TKR4    L7TKR4
     C                     Z-ADD0         L7NKHZ
     C                     Z-ADD0         L7NKTI
     C                     WRITEAL#PP771
      *
     CSR         ESB400    ENDSR
