     H            Y.
     F** AL#R7M **************************************
     F* AL#PP01にＳＥＱ＃をセット                  *
     F*        ITS.         2015.05.27               *
     F************************************************
     FAL#WP73 UF  F    0256            DISK
     FAL#PL03 UF  E           K        DISK
     FAL#PP21 IF  E           K        DISK
      *
     IAL#WP73 AA  01
     I                                        1 256 IALL
     I                                        1   1 IDTK
     I                                       38  39 IDOCK
     I                                       44  55 IMHN
     I                                      110 118 ISURT
     I                                      127 134 ISHID
     I                                      135 140 ISHIT
     I                                      141 152 IORD#
     I                                      161 165 INAMC
     I                                      197 198 IPALT
     I                                      216 218 IIAFB
     I                                      219 221 IIAFP
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     Z-ADD0         WKSEQ#  50
     C                     READ AL#WP73                  85
     C           *IN85     DOWEQ'0'
     C           IDTK      IFEQ '2'
     C                     ADD  1         WKSEQ#
     C                     EXCPTDT
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AL#WP73                  85
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#PP01
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C                     MOVELISHID     W1SHID  8
     C                     MOVELISHIT     W1SHIT  6
     C                     MOVELISURT     W1SURT  9
     C                     Z-ADD0         W1NONY  40
     C                     MOVEL*BLANK    W1NKOJ  1
     C                     MOVELIDOCK     W1NUKE  4
     C                     MOVELIORD#     W1ORD# 12
     C                     MOVELIPALT     W1PALT  2
     C                     MOVELIMHN      W1MHN  12
     C           INAMC     CHAINAL#PP21              80
     C           *IN80     IFEQ '0'
     C                     MOVELC2NONY    W1NONY
     C                     MOVELC2NKOJ    W1NKOJ
     C                     ENDIF
      *
     C           KEYC1     KLIST
     C                     KFLD           W1SHID
     C                     KFLD           W1SHIT
     C                     KFLD           W1SURT
     C                     KFLD           W1NONY
     C                     KFLD           W1NKOJ
     C                     KFLD           W1NUKE
     C                     KFLD           W1ORD#
     C                     KFLD           W1PALT
     C                     KFLD           W1MHN
      *
     C                     MOVEL'0'       GET     1
     C           KEYC1     SETLLAL#PL031
     C           KEYC1     READEAL#PL031                 81
     C           *IN81     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C           CASEQ#    IFEQ 0
     C           CAIAFB    ANDEQIIAFB
     C           CAIAFP    ANDEQIIAFP
     C***        CAFIXD    ANDEQW1FIXD
     C***        CAFIXT    ANDEQW1FIXT
     C***        CATIMS    ANDEQW1TIMS
     C                     MOVEL'1'       GET     1
     C                     Z-ADDSDATE     CAKOHZ
     C                     Z-ADDSTIME     CAKOTI
     C                     MOVELW#USER    CAKOME
     C                     Z-ADDWKSEQ#    CASEQ#
     C                     UPDATAL#PL031
     C                     ENDIF
     C                     ENDIF
     C           KEYC1     READEAL#PL031                 81
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
     OAL#WP73 E                DT
     O                         WKSEQ#   215
