     H            Y.
     F** AL#RGA  *******************************************
     F* CREATE WORK FILE FOR TRUCK SCHEDULE 1.5            *
     F*      T.SAKAKI    2016.08.17                        *
     F******************************************************
     FAL#WPG3 IF  E           K        DISK
     FAL#WPGA UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *-----------------------------------------------------
      *  KEY LIST
      *-----------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           W1SURT
     C                     KFLD           W1TOKU
     C                     KFLD           W1NONY
     C                     KFLD           W1NKOJ
     C                     KFLD           W1NUKE
     C                     KFLD           W1MHN1
     C                     KFLD           W1MHN2
     C                     KFLD           W1MHN3
     C                     KFLD           W1MHN4
     C                     KFLD           W1EGBC
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C           *LOVAL    SETLLAL#WPG3
     C           *IN80     DOUEQ*ON
     C                     READ AL#WPG3                  80
     C   80                LEAVE
      * WRITE
     C                     EXSR #SB500
     C                     ENDDO
      *
      * RE-CALCULATE BY SUB ROUTE
     C                     EXSR #SB510
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  WRITE AL#WPG4
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY1      CHAINAL#WPGA1             85
     C           *IN85     IFEQ '0'
     C                     ADD  W1QTY     WAQTY
     C                     UPDATAL#WPGA1
     C                     ELSE
     C                     CLEARAL#WPGA1
     C                     MOVELW1TOKU    WATOKU
     C                     MOVELW1NONY    WANONY
     C                     MOVELW1NKOJ    WANKOJ
     C                     MOVELW1NUKE    WANUKE
     C                     MOVELW1SURT    WASURT
     C                     MOVELW1TRKB    WATRKB
     C                     Z-ADDW1STTN    WASTTN
     C                     Z-ADDW1EDTN    WAEDTN
     C                     MOVELW1MHN1    WAMHN1
     C                     MOVELW1MHN2    WAMHN2
     C                     MOVELW1MHN3    WAMHN3
     C                     MOVELW1MHN4    WAMHN4
     C                     Z-ADDW1QPC     WAQPC
     C                     Z-ADDW1QTY     WAQTY
     C                     Z-ADD0         WABOX
     C                     MOVELW1EGBC    WAEGBC
     C                     Z-ADDW1DIVN    WADIVN
     C                     WRITEAL#WPGA1
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      * CALCULATE % BY EACH TRUCK
      *-----------------------------------------------------
     CSR         #SB510    BEGSR
      *
     C           *LOVAL    SETLLAL#WPGA
     C           *IN81     DOUEQ*ON
     C                     READ AL#WPGA                  81
     C   81                LEAVE
      * CALCULATE
     C           WAQTY     DIV  WAQPC     WK1BOX 100       PER BOX
     C                     MVR            WK2BOX 133       MVR
   S2C           WK2BOX    IFNE 0
     C                     ADD  1         WK1BOX
   E2C                     ENDIF
     C                     Z-ADDWK1BOX    WABOX
      * UPDATE
     C                     UPDATAL#WPGA1
      *
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
