     H            Y.
     F** AL#R91  *******************************************
     F*ＷＥＢデータ照会ワーク作成                        *
     F*      ITS.        2015.05.29                        *
     F******************************************************
     FAL#PL01 IF  E           K        DISK
     FAL#WP91 UF  E           K        DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SHI1  8
     C                     PARM           P1SHI2  8
     C                     PARM           P1SURT  9
     C                     PARM           P9CMD   2
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     MOVELP1SHI2    WKSHI2  8
     C           WKSHI2    IFEQ '00000000'
     C                     MOVEL*HIVAL    WKSHI2  8
     C                     ENDIF
      *
     C           P1SHI1    SETLLAL#PL011
     C                     READ AL#PL011                 81
     C           *IN81     DOWEQ'0'
     C           CASHID    ANDLEWKSHI2
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AL#PL011                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#WP91
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C           P1SURT    IFEQ *BLANK
     C                     MOVEL'1'       GET
     C                     ELSE
     C           CASURT    IFEQ P1SURT
     C                     MOVEL'1'       GET
     C                     ENDIF
     C                     ENDIF
     C           GET       IFEQ '1'
     C                     EXSR #SB500
     C                     EXSR #SB510
     C                     EXSR #SB550
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *-----------------------------------------------------
      *  AL#WP91  0 : SHID SHIT SURT
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEYW0     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           CASHID
     C                     KFLD           CASHIT
     C                     KFLD           CASURT
     C                     KFLD           KKTRKB  2
     C           CATRKB    IFEQ *BLANK
     C                     MOVEL*BLANK    P9TRKB
     C                     CALL 'AL#RC9'
     C                     PARM           CASURT
     C                     PARM           P9TRKB  2
     C                     MOVELP9TRKB    KKTRKB
     C                     ELSE
     C                     MOVELCATRKB    KKTRKB
     C                     ENDIF
      *
     C                     MOVEL'0'       KKTYPE
     C           KEYW0     CHAINAL#WP911             22
     C           *IN22     IFEQ '0'
     C                     ADD  1         W1BOX
     C                     UPDATAL#WP911
     C                     ELSE
     C                     CLEARAL#WP911
     C                     MOVEL'0'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELKKTRKB    W1TRKB
     C                     Z-ADD1         W1BOX
     C                     WRITEAL#WP911
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      *  AL#WP91  1 : SHID SHIT SURT NONY NKOJ NUKE ORD# PALT IAFB IAFP
      *-----------------------------------------------------
     CSR         #SB510    BEGSR
      *
     C           KEYW1     KLIST
     C                     KFLD           KKTYPE  1
     C                     KFLD           CASHID
     C                     KFLD           CASHIT
     C                     KFLD           CASURT
     C                     KFLD           KKTRKB  2
     C                     KFLD           CANONY
     C                     KFLD           CANKOJ
     C                     KFLD           CANUKE
     C                     KFLD           CAORD#
     C                     KFLD           CAPALT
     C                     KFLD           CAIAFB
     C                     KFLD           CAIAFP
      *
     C                     MOVEL'1'       KKTYPE
     C           KEYW1     CHAINAL#WP911             22
     C           *IN22     IFEQ '0'
     C                     ADD  1         W1BOX
     C                     UPDATAL#WP911
     C                     ELSE
     C                     CLEARAL#WP911
     C                     MOVEL'1'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELKKTRKB    W1TRKB
     C                     MOVELCANONY    W1NONY
     C                     MOVELCANKOJ    W1NKOJ
     C                     MOVELCANUKE    W1NUKE
     C                     MOVELCAORD#    W1ORD#
     C                     MOVELCAPALT    W1PALT
     C                     MOVELCAIAFB    W1IAFB
     C                     MOVELCAIAFP    W1IAFP
     C                     Z-ADD1         W1BOX
     C                     WRITEAL#WP911
     C                     ENDIF
      *
     CSR         ESB510    ENDSR
      *-----------------------------------------------------
      *  AL#WP91  5 : DETAIL
      *-----------------------------------------------------
     CSR         #SB550    BEGSR
      *
     C                     CLEARAL#WP911
     C                     MOVEL'5'       W1TYPE
     C                     MOVELCASHID    W1SHID
     C                     MOVELCASHIT    W1SHIT
     C                     MOVELCASURT    W1SURT
     C                     MOVELKKTRKB    W1TRKB
     C                     MOVELCANONY    W1NONY
     C                     MOVELCANKOJ    W1NKOJ
     C                     MOVELCANUKE    W1NUKE
     C                     MOVELCAORD#    W1ORD#
     C                     MOVELCAPALT    W1PALT
     C                     Z-ADD1         W1BOX
     C                     MOVELCATOKU    W1TOKU
     C                     MOVELCACADT    W1CADT
     C                     MOVELCASUPI    W1SUPI
     C                     MOVELCASUPC    W1SUPC
     C                     MOVELCADOCK    W1DOCK
     C                     MOVELCAKNB#    W1KNB#
     C                     MOVELCAMHN     W1MHN
     C                     MOVELCALIAD    W1LIAD
     C                     MOVELCASTAD    W1STAD
     C                     MOVELCAQTBO    W1QTBO
     C                     MOVELCASUPN    W1SUPN
     C                     MOVELCAMART    W1MART
     C                     MOVELCAULDA    W1ULDA
     C                     MOVELCABOX#    W1BOX#
     C                     MOVELCABOXT    W1BOXT
     C                     MOVELCANAMC    W1NAMC
     C                     MOVELCAINKK    W1INKK
     C                     MOVELCALPOS    W1LPOS
     C                     MOVELCANAM2    W1NAM2
     C                     MOVELCANAM3    W1NAM3
     C                     MOVELCANAD5    W1NAD5
     C                     MOVELCANAD6    W1NAD6
     C                     MOVELCAFILL    W1FILL
     C                     MOVELCATERM    W1TERM
     C                     MOVELCAALL     W1ALL
     C                     MOVELCAEXTR    W1EXTR
     C                     MOVELCATRKB    W1TRKB
     C                     MOVELCAIAFB    W1IAFB
     C                     MOVELCAIAFP    W1IAFP
     C                     MOVELCAFIXD    W1FIXD
     C                     MOVELCAFIXT    W1FIXT
     C                     MOVELCATIMS    W1TIMS
     C                     MOVELCAPPUL    W1PPUL
     C                     MOVELCASAT     W1SAT
     C                     MOVELCASHN1    W1SHN1
     C                     MOVELCASHN2    W1SHN2
     C                     MOVELCASHN3    W1SHN3
     C                     MOVELCASYOT    W1SYOT
     C                     MOVELCATKR1    W1TKR1
     C                     MOVELCATKR2    W1TKR2
     C                     MOVELCATKR3    W1TKR3
     C                     MOVELCATKR4    W1TKR4
     C                     MOVELCAKADT    W1KADT
     C                     MOVELCAKATI    W1KATI
     C                     MOVELCASEQ#    W1SEQ#
     C                     MOVELCAPLDT    W1PLDT
     C                     MOVELCAPLTI    W1PLTI
     C                     MOVELCASHME    W1SHME
     C                     WRITEAL#WP911
      *
     CSR         ESB550    ENDSR
