     H            Y.
     F** AL#RT9  *******************************************
     F*  AL#PP96                                           *
     F*      ITS.        2015.06.01                        *
     F******************************************************
     FAL#PP96 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     Z-ADD1         X       40
     C                     Z-ADD1000      WKPSEQ  40
     C           X         DOWLE2400
     C                     Z-ADDWKPSEQ    Q6PSEQ
     C                     WRITEAL#PP961
     C                     ADD  1         WKPSEQ
     C                     ADD  1         X
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
