     H            Y.
     F** AL#RD9 **************************************
     F*再発行明細ワーク作成                        *
     F*        ITS.         2015.05.26               *
     F************************************************
     FAL#PLA1 IF  E           K        DISK
     FAL#WPD9 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           H1FIXD  80
     C                     PARM           H1FIXT  60
     C                     PARM           H1TRKB  2
     C                     PARM           H1IAFB  3
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     EXSR #SB500
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#PPA1
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEYA      KLIST
     C                     KFLD           K9FIXD
     C                     KFLD           K9FIXT
     C                     KFLD           K9TRKB
     C                     KFLD           K9IAFB
     C                     Z-ADDH1FIXD    K9FIXD  80
     C                     Z-ADDH1FIXT    K9FIXT  60
     C                     MOVELH1TRKB    K9TRKB  2
     C                     MOVELH1IAFB    K9IAFB  3
     C                     Z-ADD0         WKSEQ#  50
     C           KEYA      SETLLAL#PLA11
     C           KEYA      READEAL#PLA11                 89
     C           *IN89     DOWEQ'0'
     C           CRSKJY    IFEQ 'D'
     C           CRSKHZ    ANDLESDATE
     C                     ELSE
     C                     CLEARAL#WPD91
     C                     MOVELCRDATA    W9DATA
     C                     Z-ADDCRFIXD    W9FIXD
     C                     Z-ADDCRFIXT    W9FIXT
     C                     Z-ADDCRTIMS    W9TIMS
     C                     MOVELCRTRKB    W9TRKB
     C                     MOVELCRIAFB    W9IAFB
     C                     ADD  1         WKSEQ#
     C                     Z-ADDWKSEQ#    W9SEQ
     C                     WRITEAL#WPD91
     C                     ENDIF
     C           KEYA      READEAL#PLA11                 89
     C                     ENDDO
      *
     CSR         ESB500    ENDSR
