     H            Y.
     F** AL#RF7 **************************************
     F*画面の選択をワークに反映                    *
     F*        ITS.         2015.05.26               *
     F************************************************
     FAL#WPF0 UF  E           K        DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1TRKB  2
     C                     PARM           P1SURT  9
     C                     PARM           P1SEL   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
     C           KEYW0     KLIST
     C                     KFLD           P1TRKB
     C                     KFLD           P1SURT
      *
     C           KEYW0     CHAINAL#WPF01             22
     C           *IN22     IFEQ '0'
     C                     MOVELP1SEL     W0SEL
     C                     UPDATAL#WPF01
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
