     H            Y.
     F** AL#RD7 **************************************
     F*画面の選択をワークに反映                    *
     F*        ITS.         2015.05.26               *
     F************************************************
     FAL#WPD9 UF  E                    DISK
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1SEQ   50
     C                     PARM           P1SEL   1
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C           1         SETLLAL#WPD91
     C                     READ AL#WPD91                 22
     C           *IN22     DOWEQ'0'
     C           W9SEQ     IFEQ P1SEQ
     C                     MOVELP1SEL     W9SEL
     C                     UPDATAL#WPD91
     C                     ENDIF
     C                     READ AL#WPD91                 22
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
