     H            Y.
     F** AL#RG5  *******************************************
     F* CREATE WORK FILE FOR TRUCK SCHEDULE 2              *
     F*      T.SAKAKI    2016.08.15                        *
     F******************************************************
     FAL#WPGA IF  E           K        DISK
     FAL#WPG4 UF  E           K        DISK                      A
     FAL#WPGB O   E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *-----------------------------------------------------
      *  ENTRY LIST
      *-----------------------------------------------------
      *-----------------------------------------------------
      *  KEY LIST
      *-----------------------------------------------------
     C           KEY1      KLIST
     C                     KFLD           WAEGBC
     C                     KFLD           WATRKB
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     Z-ADD*ZERO     TOTL1  150       REGULAR
     C                     Z-ADD*ZERO     TOTL2  150       E.G.BOLT
      *
     C           *LOVAL    SETLLAL#WPGA
     C           *IN80     DOUEQ*ON
     C                     READ AL#WPGA                  80
     C   80                LEAVE
      * WRITE
     C                     EXSR #SB500
      * TOTAL
     C           WAEGBC    IFEQ '1'
     C                     ADD  WABOX     TOTL2
     C                     ELSE
     C                     ADD  WABOX     TOTL1
     C                     ENDIF
      *
     C                     ENDDO
      *
      * CALCULATE % BY EACH TRUCK
     C                     EXSR #SB510
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  WRITE AL#WPG4
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY1      CHAINAL#WPG41             85
     C           *IN85     IFEQ '0'
     C                     ADD  WABOX     W2BOX
     C                     UPDATAL#WPG41
     C                     ELSE
     C                     CLEARAL#WPG41
     C                     MOVELWASURT    W2SURT
     C                     MOVELWATRKB    W2TRKB
     C                     Z-ADDWASTTN    W2STTN
     C                     Z-ADDWAEDTN    W2EDTN
     C                     Z-ADDWABOX     W2BOX
     C                     MOVELWAEGBC    W2EGBC
     C                     WRITEAL#WPG41
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      * CALCULATE % BY EACH TRUCK
      *-----------------------------------------------------
     CSR         #SB510    BEGSR
      *
     C           *LOVAL    SETLLAL#WPG4
     C           *IN81     DOUEQ*ON
     C                     READ AL#WPG4                  81
     C   81                LEAVE
      * CALCULATE
     C           W2EGBC    IFEQ '1'
     C           W2BOX     DIV  TOTL2     W2PERC           E.G.BOLT
     C                     ELSE
     C           W2BOX     DIV  TOTL1     W2PERC           REGULAR
     C                     ENDIF
      * UPDATE
     C                     UPDATAL#WPG41
      *
      * WRITE AL#WPGB
     C                     CLEARAL#WPGB1
     C                     MOVELW2EGBC    WBEGBC
     C                     Z-ADDW2PERC    WBPERC
     C                     MOVELW2TRKB    WBTRKB
     C                     MOVELW2SURT    WBSURT
     C                     WRITEAL#WPGB1
      *
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
