     H            Y.
     F** AL#R43 **************************************
     F*パレット集計ファイルに発行日セット          *
     F*        ITS.         2015.05.26               *
     F************************************************
     FAL#WP49 IF  E           K        DISK
     FAL#PL42 UF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *----------------------------------------------------*
      *   K  E  Y   L I  S  T                              *
      *----------------------------------------------------*
      *
     C                     TIME           WTIME
     C                     READ AL#WP491                 22
     C           *IN22     DOWEQ'0'
     C           W9SEL     IFEQ '1'
     C                     EXSR #SB400
     C                     ENDIF
     C                     READ AL#WP491                 22
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AL#PP41
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *
     C           KEYC1     KLIST
     C                     KFLD           W9FIXD
     C                     KFLD           W9FIXT
     C                     KFLD           W9TRKB
     C                     KFLD           W9IAFB
      *
     C           KEYC1     SETLLAL#PL421
     C           KEYC1     READEAL#PL421                 81
     C           *IN81     DOWEQ'0'
     C           C4SKJY    IFEQ 'D'
     C           C4SKHZ    ANDLESDATE
     C                     ELSE
     C                     Z-ADDSDATE     C4KOHZ
     C                     Z-ADDSTIME     C4KOTI
     C                     MOVELW#USER    C4KOME
     C                     Z-ADDSDATE     C4KADT
     C                     Z-ADDSTIME     C4KATI
     C                     UPDATAL#PL421
     C                     ENDIF
     C           KEYC1     READEAL#PL421                 81
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
