     H            Y.
     F** ALAR14 ************************************
     F*  ..ＴＯＰＩＣＳへのマスターデータ準備..  *
     F*  ..他社納品書作成機                      *
     F*  ..トヨタ納品書作成機                    *
     F*  ..かんばん仕分機                        *
     F*       I-HASADA              89.07.17       *
     F************************************ ALAR14 **
     FAAIPP21 UF  E           K        DISK
     FALAPW14 CF  E                    WORKSTN
     E                    ER      1   9 60               d[ｰ xｮﾈｰﾆﾞ
     C           STP1      TAG
     C                     EXFMTALAPW141
     C                     SETOF                     5099
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     END
      *
     C           INO       IFNE '1'
     C           INO       ANDNE'2'
     C           INO       ANDNE'3'
     C                     SETON                     5099
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     END
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     END
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　かんばんマスター..  *
     C*  ..　　　　　　　　　チェックマスター..  *
     C*--------------------------------------------*
     C           INO       IFEQ '1'
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　かんばんマスター..  *
     C*--------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPA5' WFILE   8
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     END
      *
     C           AIJUNB    IFEQ '*'
     C           AIKANR    ANDEQ'*'
     C                     UPDATAAIPP211
     C                     ELSE
     C                     UPDATAAIPP211
     C                     SETON                     99
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　チェックマスター..  *
     C*--------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPB5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     END
      *
     C           AIJUNB    IFEQ '*'
     C           AIKANR    ANDEQ'*'
     C                     UPDATAAIPP211
     C                     ELSE
     C                     UPDATAAIPP211
     C                     SETON                     99
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C*----------------------------------------------*
     C*  ..トヨタ納品書作成機　かんばんマスター..  *
     C*----------------------------------------------*
     C           INO       IFEQ '2'
     C                     SETOF                     01
     C                     MOVEL'ALBNPH5' WFILE   8
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     END
      *
     C           AIJUNB    IFEQ '*'
     C           AIKANR    ANDEQ'*'
     C                     MOVE 'H'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     ELSE
     C                     UPDATAAIPP211
     C                     SETON                     99
     C                     MOVE ER,9      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　かんばんマスター..  *
     C*  ..　　　　　　　　チェックマスター..  *
     C*------------------------------------------*
     C           INO       IFEQ '3'
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　かんばんマスター..  *
     C*------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPI5' WFILE   8
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     END
      *
     C           AIJUNB    IFEQ '*'
     C           AIKANR    ANDEQ'*'
     C                     UPDATAAIPP211
     C                     ELSE
     C                     UPDATAAIPP211
     C                     SETON                     99
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　チェックマスター..  *
     C*------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPJ5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '1'
     C                     SETON                     99
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     END
      *
     C           AIJUNB    IFEQ '*'
     C           AIKANR    ANDEQ'*'
     C                     UPDATAAIPP211
     C                     ELSE
     C                     UPDATAAIPP211
     C                     SETON                     99
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     END
     C                     END
      *
     C                     MOVE *BLANK    WCHK    1
     C                     CALL 'ALAC11'
     C                     PARM           INO
     C                     PARM           WCHK
     C           WCHK      IFEQ 'E'
     C                     SETON                     99
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C                     END
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　かんばんマスター..  *
     C*  ..　　　　　　　　　チェックマスター..  *
     C*--------------------------------------------*
     C           INO       IFEQ '1'
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　かんばんマスター..  *
     C*--------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPA5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     END
      *
     C*--------------------------------------------*
     C*  ..他社納品書作成機　チェックマスター..  *
     C*--------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPB5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     END
     C                     END
      *
     C*----------------------------------------------*
     C*  ..トヨタ納品書作成機　かんばんマスター..  *
     C*-----------------------------------------------*
     C           INO       IFEQ '2'
     C                     SETOF                     01
     C                     MOVEL'ALBNPH5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     END
     C                     END
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　かんばんマスター..  *
     C*  ..　　　　　　　　チェックマスター..  *
     C*------------------------------------------*
     C           INO       IFEQ '3'
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　かんばんマスター..  *
     C*------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPI5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     END
      *
     C*------------------------------------------*
     C*  ..かんばん仕分機　チェックマスター..  *
     C*------------------------------------------*
     C                     SETOF                     01
     C                     MOVEL'ALBNPJ5' WFILE
     C           WFILE     CHAINAAIPP211             01
     C           *IN01     IFEQ '0'
     C                     MOVE '*'       AIJUNB
     C                     MOVE *BLANK    AIKANR
     C                     UPDATAAIPP211
     C                     END
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
**
E-01№は、＜　１・２・３　＞
E-02 AAIPP21ファイルに、ＡＬＢＮＰＡ５が登録されていない
E-03前回のマスターが、受信されていない。
E-04 AAIPP21ファイルに、ＡＬＢＮＰＢ５が登録されていない
E-05 AAIPP21ファイルに、ＡＬＢＮＰＨ５が登録されていない
E-06 AAIPP21ファイルに、ＡＬＢＮＰＩ５が登録されていない
E-07 AAIPP21ファイルに、ＡＬＢＮＰＪ５が登録されていない
E-08端末で受信データが作成中なので、しばらくお待下さい。
E-09前回のマスターが、準備中か受信されていない。
