     H            Y.
     F** ALBR31 **********************************
     F* INQUIRY OF WORKER CD M/F                 *
     F* C:K.OKACHI                    1997.06.02 *
     F********************************************
     FALBPL30 IP  E           K        DISK
     FALBWP31 O   F       8            DISK
     E                    CD          6  1 0
     E                    WCD         6  1 0
     I            DS
     I                                        1   60CD
     I                                        1   60ALWKCD
     I            DS
     I                                        1   80ALSKHZ
     I                                        1   40ALSKYY
     I                                        5   60ALSKMM
     I                                        7   80ALSKDD
      *
      *
     C           ALSKJY    IFEQ 'D'
     C           ALSKHZ    ANDLE*DATE
     C                     ELSE
     C                     EXSR SUB
     C                     EXCPTDT
     C                     END
     C           SUB       BEGSR
      *
     C                     Z-ADD0         WCD
     C                     Z-ADD7         A       10
     C                     Z-ADD7         B       10
     C                     SETOF                     01
      *
     C                     DO   *HIVAL
     C                     SUB  1         A
     C           A         IFEQ 0
     C                     GOTO $END
     C                     END
     C  N01      CD,A      IFEQ 0
     C  N01                GOTO TOBI
     C                     END
     C                     SETON                     01
     C                     SUB  1         B
     C                     Z-ADDCD,A      WCD,B
     C           TOBI      TAG
     C                     ENDDO
      *
     C           $END      TAG
     C                     Z-ADDWCD       CD
     C                     ENDSR
     OALBWP31 E                DT
     O                         ALWKCD     6
