     H            Y.
     F** ALBRAA ***********************************
     F*                  S.YAMAGAMI   97.03.06    *
     F*********************************** ALBRAA **
     E                    #15        15  1               * MAX=15
     E                    #T1     1  16  1   #T2     2 0 * s]f]
     I            DS
     I                                        1  15 #15
     I                                        1  15 W15
     C           *ENTRY    PLIST
     C                     PARM           P15    15
     C                     PARM           P10    10
     C                     MOVE P15       W15
     C*
     C                     Z-ADD1         A       20
     C                     Z-ADD0         WDAT   100
     C                     DO   15        A
     C           #15,A     IFNE *BLANK
     C                     EXSR $CHK1
     C                     EXSR $CHK2
     C                     END
     C                     ENDDO
     C*
     C           P15       IFEQ *BLANK
     C                     MOVE *ALL'?'   P10
     C                     ELSE
     C                     MOVE WDAT      P10
     C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C*----------------------------------------------------------------
     C* ﾃｰnﾞ変換
     C           $CHK1     BEGSR
     C*----------------------------------------------------------------
     C                     Z-ADD0         WCOD    20
     C                     Z-ADD1         B       20
     C                     SETOF                     11
     C           #15,A     LOKUP#T1,B                    11
     C           *IN11     IFEQ '1'
     C                     MOVE #T2,B     WCOD
     C                     ELSE
     C                     MOVE *ALL'?'   P10
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ENDSR
     C*
     C*----------------------------------------------------------------
     C* ﾃｰnﾞ計算
     C           $CHK2     BEGSR
     C*----------------------------------------------------------------
     C           15        SUB  A         B
     C                     Z-ADD1         WBAI   150
     C*
     C           A         IFNE 10
     C                     DO   B
     C                     MULT 16        WBAI
     C                     ENDDO
     C                     END
     C*
     C           WCOD      MULT WBAI      WDT    150
     C                     ADD  WDT       WDAT
     C*
     C                     ENDSR
     C*
**  #T1/#T2
000
101
202
303
404
505
606
707
808
909
A10
B11
C12
D13
E14
F15
