     H            Y.
      ** ALBR30 ************************
      * UPDATE OF WORKER CD M/F        *
      *     CREATE DATE : 1997/JUN/02  *
      *     AUTHOR      : K.OKACHI     *
      * ADD DEPARTMENT  : LEC  12/4/15 *
JW1   * ADD WORKER (6A) : JW   02/11/20*
      ************************ ALBR30 **
     FALBPW30 CF  E                    WORKSTN
     FALBPL30 UF  E           K        DISK                      A
     FALBPL32 IF  E           K        DISK
     E                    KOS     1   3  1   KON     6   ﾃcﾆ]hﾎﾞ]
     E                    ER      1   8 60               d[ｰxｮﾈｰﾆﾞ
     I            DS
     I                                        1   80ALSKHZ
     I                                        1   40ALSKYY
     I                                        5   60ALSKMM
     I                                        7   80ALSKDD
     I            DS
     I                                        1   80ALKOHZ
     I                                        1   40ALKOYY
     I                                        5   60ALKOMM
     I                                        7   80ALKODD
     I            DS
     I                                        1   80ACSKHZ
     I                                        1   40ACSKYY
     I                                        5   60ACSKMM
     I                                        7   80ACSKDD
     I            DS
     I                                        1   60WTIME
     I                                        1   20ALKOHH
     I                                        3   40ALKOSS
     C           KEY       KLIST
     C                     KFLD           WKCD
      *
     C           *ENTRY    PLIST
     C                     PARM           US     10        ﾏｰﾅﾞｰ xb
      *
      *********************************************************
      *                 DISPLAY 1 SCREEN                      *
      *********************************************************
     C           STP0      TAG
     C                     MOVE *BLANK    KBN
     C                     Z-ADD0         WKCD
      *
     C           STP1      TAG
     C                     EXFMTALBPW301
     C                     SETOF                     010203
     C                     SETOF                     045099
      *
     C           *INKA     IFEQ '1'
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *
      *--------------------*
      *  CHECK OF KUBUN    *
      *--------------------*
     C           KBN       IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C           KBN       IFEQ '0'
     C           KBN       OREQ '1'
     C           KBN       OREQ '2'
     C                     ELSE
     C                     SETON                     0199
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C                     MOVE *BLANK    KBNNM
     C                     SETOF                     10
     C                     Z-ADD1         A       10
     C           KBN       LOKUPKOS,A                    10
     C                     MOVE KON,A     KBNNM
      *---------------------*
      *  CHECK OF WORKER CD *
      *---------------------*
     C           WKCD      IFEQ 0
     C                     SETON                     0299
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
      *--------*
      *FILE CHK*
      *--------*
     C                     SETOF                     90
     C           KEY       CHAINALBPL301             90
      *
     C                     MOVE ALDPCD    DEPART
      *
     C           DEPART    CHAINALBPL321             56
     C           *IN56     IFEQ *OFF
     C                     MOVE ACDPNM    DPTNAM
     C                     ELSE
     C                     MOVE *BLANK    DPTNAM
     C                     ENDIF
      *
      *******
      * ADD *
      *******
     C           KBN       IFEQ '2'
      *
     C                     MOVE *BLANK    NAME
     C           *IN90     IFEQ '0'
     C           ALSKJY    IFEQ 'D'
     C           ALSKHZ    ANDLE*DATE
     C                     ELSE
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      ********
      *CHANGE*
      ********
     C           KBN       IFEQ '1'
      *
     C                     MOVE ALWKNM    NAME
     C           *IN90     IFEQ '1'
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           *IN90     IFEQ '0'
     C           ALSKJY    IFEQ 'D'
     C           ALSKHZ    ANDLE*DATE
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      ********
      *DELETE*
      ********
     C           KBN       IFEQ '0'
      *
     C                     MOVE ALWKNM    NAME
     C           *IN90     IFEQ '1'
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           *IN90     IFEQ '0'
     C           ALSKJY    IFEQ 'D'
     C           ALSKHZ    ANDLE*DATE
     C                     SETON                     0102
     C                     SETON                     99
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     SETOF                     50
     C           KBN       IFEQ '0'
     C                     SETON                     50
     C                     ENDIF
      *********************************************************
      *                 DISPLAY 1 SCREEN                      *
      *********************************************************
     C           STP2      TAG
     C                     EXFMTALBPW302
     C                     SETOF                     030499
      *
     C           *INKC     IFEQ '1'
     C                     GOTO STP0
     C                     ENDIF
      *
     C           NAME      IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,7      MSG
     C                     GOTO STP2
     C                     ENDIF
      *
      * check validity of Department entered for Team Member.
     C                     MOVE *BLANKS   DPTNAM
     C           DEPART    IFNE *BLANK
     C           DEPART    CHAINALBPL32              56
     C           *IN56     IFEQ *ON
     C           *IN56     OREQ *OFF
     C           ACSKJY    ANDEQ'D'
     C           ACSKHZ    ANDLE*DATE
     C                     SETON                     0499
     C                     MOVE ER,8      MSG
     C                     GOTO STP2
     C                     ENDIF
     C                     ENDIF
      *
     C           DEPART    IFNE *BLANK
     C           *IN56     ANDEQ*OFF
     C                     MOVELACDPNM    DPTNAM
     C                     ENDIF
      *
     C           *INKJ     IFEQ *ON
     C                     CALL 'ALBR32'
     C                     PARM           DPTIN   3
     C           DPTIN     IFNE *BLANK
     C                     MOVE DPTIN     DEPART
     C           DEPART    CHAINALBPL32              56
     C                     MOVELACDPNM    DPTNAM
     C                     ENDIF
     C                     GOTO STP2
     C                     ENDIF
      *
      *
     C           *INKE     IFEQ *OFF
     C                     GOTO STP2
     C                     ENDIF
      *
     C           KBN       IFEQ '0'
     C                     MOVE 'D'       ALSKJY
     C                     Z-ADD*DATE     ALSKHZ
     C                     ELSE
     C                     MOVE ' '       ALSKJY
     C                     Z-ADD0         ALSKHZ
     C                     ENDIF
      *
     C                     Z-ADD*DATE     ALKOHZ
     C                     TIME           WTIME
     C                     MOVELUS        ALKOME
     C                     Z-ADDWKCD      ALWKCD
JW1  C                     MOVELWKCD      ALXFL2    P      WORKER WITH 6 CHAR.
     C                     MOVE NAME      ALWKNM
     C                     MOVE DEPART    ALDPCD
      *
     C           *IN90     IFEQ '0'
     C                     UPDATALBPL301
     C                     ELSE
     C                     WRITEALBPL301
     C                     END
      *
     C                     GOTO STP0
      *
**  KOS.KON
0CANCEL
1CHANGE
2ADD
**  ERR
E-01 INPUT INSTRUCTION
E-02 UPDATE INSTRUCTION IS <0 1 2>
E-03 INPUT WORKER CD
E-04 THE DATA EXISTS
E-05 THERE IS NO DATA
E-06 THE DATA IS DELETED
E-07 INPUT WORKER NAME
E-08 INVALID DEPT CODE
