     H            Y.
     F** ALBR80 ********************************************
     F*   ..  KANBAN READIGN DATA FILE REFORMATION  ..     *
     F*       K.OKACHI                    1997.10.23       *
     F******************************************** ALBR80 **
     FALBPP45 IP  E                    DISK
     FALBWP80 O   E                    DISK
     I            DS
     I                                        1   80A5SHZ
     I                                        1   40A5SYY
     I                                        5   60A5SMM
     I                                        7   80A5SDD
      *
     C           *ENTRY    PLIST
     C                     PARM           PHIZK   8
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
     C                     MOVE PHIZK     WHIZK   80
      *
     C                     ADD  1         WRECD   70
      *
     C           A5SHZ     IFGT WHIZK
     C                     ADD  1         WKENS   70
     C                     WRITEALBWP801
     C                     END
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
