     H            Y.
     F** ALCR071 *******************************************
     F*  THE NUMBER OF PROCESSED BOXES BY WORKER LIST      *
     F*                                                    *
     F* TCHK1 06/04/09 CREATE(COPY FROM ALDR07)            *
     F******************************************************
     FALCWL06 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F*************************************************************
     IALCWP061    01
     I                                              D6BOX L1
     I* SYSTEM DATE
     I            DS
     I                                        1  120WWTIME
     I                                        1   60WTIME
     I                                        9  100WPMM
     I****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PUSR   10
     C                     PARM           PYYYY   40
     C                     PARM           PMM     20
      *
     C                     SETOF                     50
      *
     C           *IN51     IFEQ '0'
     C                     SETON                     5051
     C                     TIME           WWTIME
     C                     END
      *
     C                     ADD  D6BOX     TBOX    60
      *
     O*****************************************************************
     OQPRINT  H  102   50
     O       OR        OF
     O                                    9 'ALCR071'
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O                                   12 'ISSUE DATE'
     O                                   14 ':'
     O                         PYYYY     19
     O                                   21 '/'
     O                         PMM       24
     O                                  131 '.         .         .'
     O        H  1     50
     O       OR        OF
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  111 '.'
     O                         PUSR     121
     O                                  131 '.         .'
     O        H  2     50
     O       OR        OF
     O                                   28 'OQ        '
     O                                   47 '** THE NUMBER OF'
     O                                   63 'PROCESSED BOXES'
     O                                   76 'BY WORKER **'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        H  1     50
     O       OR        OF
     O                                   43 'WORKER NAME'
     O                                   69 '# OF BOXES'
     O        D  1     01
     O                         D6OPER    38
     O                         D6NAME    59
     O                         D6BOX 1B  69
      *
     O************************************************************
     O        T  2     LR
     O                                    9 'ALCR071'
     O                                   59 'TOTAL'
     O                         TBOX  1B  69
