     H            Y.                                    1
     H** ALCR0Y ****************************************************************
     H* USER SIGN-ON ENTRY PROGRAM                                             *
     F*    LEC              2016.02.15                                         *
     H**************************************************************************
     FALCPW0Y CF  E                    WORKSTN
     FALBPL30 IF  E           K        DISK
     F**************************************************************************
     E                    ERR     1  15 15
     I**************************************************************************
     I            DS
     I                                        1   80WSDATE
     I                                        1   4 WSYYYY
     I                                        5   6 WSMM
     I                                        7   8 WSDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 USR
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           PUSR   10
     C                     PARM           VALID   1
      *
      **************************************************************************
      *   M  A  I  N  L  I  N  E
     C                     EXSR @INT
     C                     EXSR @MAIN
     C                     SETON                     LR
     C                     RETRN
      **************************************************************************
      * INITIALIZE
     C           @INT      BEGSR
      *
     C                     SETOF                     303132
     C                     MOVEL*BLANK    MSG
      *
     C                     Z-ADD*DATE     WSDATE
     C                     MOVE 'N'       VALID            VALID ID Y/N
      *
     C                     ENDSR
      **************************************************************************
      * MAIN ROUTINE
      *
     C           @MAIN     BEGSR
      *
     C           *IN03     DOWEQ*OFF
      *
     C                     EXFMTDSP01
     C                     SETOF                     303132
     C                     MOVEL*BLANK    MSG
      * F3=End
     C           *IN03     IFEQ *OFF
      *
      * validate worker code entry
     C           USRCD     CHAINALBPL301             90
     C           *IN90     IFEQ *OFF
     C           ALSKJY    ANDNE'D'
      *
     C                     MOVE ALWKCD    POPR             SET WORKER ID
     C                     MOVE USR       PUSR             USER ID
     C                     MOVE 'Y'       VALID            VALID ID Y/N
     C                     LEAVE
      *
      * not found in worker code master file
     C                     ELSE
     C                     SETON                     3031
     C                     MOVEAERR,1     MSG
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
** ERR
USER CODE ERROR
