     H            Y.                                    1
      ***ALCR60*****************************************************************
      *  STORE IN LOCATION INQ                                                 *
      *  J.WATANABE    2019.03.26                                              *
      *  LEC           2024.12.18   ADD LOGIC FOR HEAD/ROLL SECTION            *
      **************************************************************************
     FALCPW60 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                        RRN2  KSFILE SFL02
     F                                              KINFDS @INFDS
     FALDPL35AIF  E           K        DISK
     FALDPL35BIF  E           K        DISK
     F            ALDPP351                          KRENAMEALDP35B1
     FALDPL36AIF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FALCWP60 UF  E           K        DISK                      A    UC
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   1 70
     E                    MSG     1  16 40
     E                    LOT         4 10
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80XFDAT
     I                                        1   40XFYY
     I                                        5   60XFMM
     I                                        7   80XFDD
     I            DS
     I                                        1   80WFDAT
     I                                        1   40WFYY
     I                                        5   60WFMM
     I                                        7   80WFDD
      *         FROM DATE -1 DAYS
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      * SCANNED TO DATE
     I            DS
     I                                        1   80XTDAT
     I                                        1   40XTYY
     I                                        5   60XTMM
     I                                        7   80XTDD
     I            DS
     I                                        1   80WTDAT
     I                                        1   40WTYY
     I                                        5   60WTMM
     I                                        7   80WTDD
      * SCANNED RESULT DATE
     I            DS
     I                                        1   80A9CODT
     I                                        1   40A9DTYY
     I                                        5   80A9DTMD
      * SCANNED RESULT TIME
     I            DS
     I                                        1   60A9COTM
     I                                        1   20A9TIHH
     I                                        3   40A9TIMM
     I                                        5   60A9TISS
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * PART#
     I            DS
     I                                        1  15 W@PART
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
      * PART#
     I            DS
     I                                        1  14 A9LHIN
     I                                        1   5 A9LHN1
     I                                        6   6 A9H1
     I                                        7  11 A9LHN2
     I                                       12  12 A9H2
     I                                       13  14 A9LHN3
      * LOCATION
     I            DS
     I                                        1   9 A9LOC
     I                                        1   1 A9ABN1
     I                                        2   2 A9LH1
     I                                        3   4 A9ABN2
     I                                        5   5 A9LH2
     I                                        6   7 A9ABN3
     I                                        8   8 A9LH3
     I                                        9   9 A9ABN4
      *
      * LOT IDS
     I            DS
     I                                        1   8 ##LOT1
     I                                       11  18 ##LOT2
     I                                       21  28 ##LOT3
     I                                       31  38 ##LOT4
     I                                        1  40 LOTS
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
      *
     C                     EXSR #INIT
      *
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #DSP01
     C           @@ID      CASEQ'20'      #SFL01
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #DSP01    BEGSR
      *
     C                     SETOF                     4748
     C                     EXFMTDSP01
     C                     MOVE *BLANK    XMSG
     C                     SETOF                     313233
     C                     SETOF                     343536
      *
     C                     SELEC
      * <F1: END>
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
      * <ENTER>
     C                     EXSR #CHK1
      * <F5: DOWNLOAD>
     C           *IN85     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #DOWN
     C                     MOVEL'10'      @@ID
     C                     GOTO XDSP01
     C                     ENDIF
      * <ENTER>
     C           *IN85     IFEQ *OFF
     C                     EXSR #SET2
     C                     ENDIF
      *
     C           *IN85     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C           XDSP01    ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK1     BEGSR
      *
     C                     SETOF                     85
     C                     TIME           WSDT
      * FROM DATE
     C           XFDAT     IFEQ 0
     C           XFDAT     ORGT WSSDAT
     C  N85                MOVELERR,1     XMSG
     C                     SETON                     3185
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C                     Z-ADDXFDAT     WFDAT
      * TO DATE
     C           XTDAT     IFEQ *ZERO
     C                     Z-ADDWFDAT     WTDAT
     C                     ELSE
     C                     Z-ADDXTDAT     WTDAT
     C                     ENDIF
      *
     C           WFDD      IFEQ *ZERO
     C                     Z-ADD01        WFDD
     C                     ENDIF
      *
     C           WTDD      IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           WTYY
     C                     KFLD           WTMM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    WTDD
     C                     ELSE
     C                     Z-ADD31        WTDD
     C                     ENDIF
     C                     ENDIF
      *
     C           WFDAT     IFGT WTDAT
     C  N85                MOVELERR,2     XMSG
     C                     SETON                     313285
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XTDAT     IFEQ 0
     C           XFDAT     ANDNE0
     C                     Z-ADD99999999  XTDAT
     C                     Z-ADD99999999  WTDAT
     C                     ENDIF
      * PART
     C           XSHN1     IFNE *BLANK
     C           XSHN2     ORNE *BLANK
     C           XSHN3     ORNE *BLANK
     C           K#PL01    KLIST
     C                     KFLD           XSHN1
     C                     KFLD           XSHN2
     C                     KFLD           XSHN3
     C           K#PL01    CHAINFCEPL01              99
     C           *IN99     IFEQ *ON
     C  N85                MOVELERR,5     XMSG
     C                     SETON                     3385
     C                     GOTO XCHK1
     C                     ENDIF
     C                     ENDIF
      * LOCATION
     C**         XLOC1     IFEQ *BLANK
     C**         XLOC2     ORNE *BLANK
     C**         XLOC3     ORNE *BLANK
     C**         XLOC4     ORNE *BLANK
     C**                   GOTO XCHK1
     C**                   ENDIF
      * SECTION
     C           XSEC      IFNE 'CV'
     C           XSEC      ANDNE'OQ'
     C           XSEC      ANDNE'HR'
     C           XSEC      ANDNE*BLANK
     C  N85                MOVELERR,7     XMSG
     C                     SETON                     3585
     C                     GOTO XCHK1
     C                     ENDIF
      * OK/NG
     C           XOK       IFNE 'OK'
     C           XOK       ANDNE'NG'
     C           XOK       ANDNE*BLANK
     C  N85                MOVELERR,8     XMSG
     C                     SETON                     3685
     C                     GOTO XCHK1
     C                     ENDIF
      *
     C           XCHK1     ENDSR
      *************************************************************************
      *  <F5>  DOWNLOAD CSV
      **************************************************************************
     C           #DOWN     BEGSR
      *
     C                     MOVELERR,10    XMSG
     C                     MOVE *ON       *IN85
      *
     C**                   CALL 'ALCC62'
     C**                   PARM           X
     C**                   PARM           Y
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET2     BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL01
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         S1SCOK
     C                     Z-ADD0         S1SCNG
     C                     Z-ADD0         C1SCOK
     C                     Z-ADD0         C1SCNG
      *
      * CLEAR WORK FILE (ALCWP60)
     C                     CLOSEALCWP60
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALCWP60
      *
     C           K#L35A    KLIST
     C                     KFLD           K@DATE  80
     C                     Z-ADDXFDAT     K@DATE
      * READ ALDPL35A
     C           K#L35A    SETLLALDPL35A
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPL35A                 97
     C   97                LEAVE
      * END ?
     C           A9CODT    IFGT XTDAT
     C                     LEAVE
     C                     ENDIF
      *
     C           A9SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * PART
     C           XSHN1     IFNE *BLANK
     C           XSHN2     ORNE *BLANK
     C           XSHN3     ORNE *BLANK
      *
     C           XSHN1     IFNE A9LHN1
     C           XSHN2     ORNE A9LHN2
     C           XSHN3     ORNE A9LHN3
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * SECTION
     C           XSEC      IFNE *BLANK
      *
     C           XSEC      IFEQ 'CV'
     C           A9SECT    ANDNE'1'
     C           XSEC      OREQ 'OQ'
     C           A9SECT    ANDNE'2'
     C           XSEC      OREQ 'HR'
     C           A9SECT    ANDNE'8'
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * OK/NG
     C           XOK       IFNE *BLANK
     C           XOK       IFNE A9OKNG
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C                     SELEC
     C           A9SECT    WHEQ '1'
     C                     MOVEL'CV'      XXSECT  3
     C           A9SECT    WHEQ '2'
     C                     MOVEL'OQ'      XXSECT
     C           A9SECT    WHEQ '8'
     C                     MOVEL'HR'      XXSECT
     C                     ENDSL
      *
     C           K#60      KLIST
     C                     KFLD           A9WOKR
     C                     KFLD           XXSECT
      *
     C           K#60      CHAINALCWP60              96
     C           *IN96     IFEQ *ON
     C                     CLEARALCWP601
     C                     ENDIF
      *
     C                     MOVELA9WOKR    NUM60   60
     C           NUM60     CHAINALBPL30              95
     C           *IN95     IFEQ *ON
     C                     MOVE *BLANK    ALWKNM
     C                     ENDIF
      *
     C                     MOVELA9WOKR    W60TMC
     C                     MOVELALWKNM    W60TMN
     C                     MOVELXXSECT    W60SEC
      *
     C           A9OKNG    IFEQ 'OK'
     C                     ADD  1         W60SCO
     C                     ENDIF
      *
     C           A9OKNG    IFEQ 'NG'
     C                     ADD  1         W60SCN
     C                     ENDIF
      *
     C  N96                UPDATALCWP601
     C   96                WRITEALCWP601
      *
     C                     ENDDO
      *********************************************************
      *
     C           *LOVAL    SETLLALCWP60
      *
     C                     DO   *HIVAL
      *
     C                     READ ALCWP60                  94
     C   94                LEAVE
      *
     C                     CLEARSFL01
     C                     MOVELW60TMC    S1TMC
     C                     MOVELW60TMN    S1TMNM
     C                     MOVELW60TMC    H1TMC
     C                     MOVEL'0'       H1SEL
     C                     MOVELW60SEC    S1SECT
      *
     C                     Z-ADDW60SCO    S1SCOK
     C                     Z-ADDW60SCN    S1SCNG
      *
     C                     ADD  W60SCO    C1SCOK
     C                     ADD  W60SCN    C1SCNG
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C  N85                MOVELERR,3     XMSG
     C                     SETON                     313285
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #SFL01    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEDSP99
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL01
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    XMSG
     C                     MOVEL*OFF      *IN85
      * F1: END
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
      * F12: BACK
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
      * ENTR
     C                     OTHER
     C                     EXSR #CHK2
      * <F1:END>
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK2     BEGSR
      *
     C                     SETOF                     85
     C                     Z-ADD0         RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL01                93
     C   93                LEAVE
      *
     C           S1SEL     IFNE *BLANK
     C                     MOVEL*BLANK    S1SEL
     C                     MOVE *OFF      H1SEL
     C                     UPDATSFL01
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET3
     C                     EXSR #FMT3
      * F1: END
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
      *
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S1SEL
     C                     MOVEL*OFF      H1SEL
     C                     UPDATSFL01
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET3     BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL02
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD0         RRN2    40
      *
     C                     MOVEL*ON       *IN63
      *
     C                     MOVELS1TMC     C2TMC
     C                     MOVELS1TMNM    C2TMNM
     C                     Z-ADDS1SCOK    C2SCOK
     C                     Z-ADDS1SCNG    C2SCNG
     C                     MOVELS1SECT    C2SECT
      * READ ALDPL35B
     C           K#L35B    KLIST
     C                     KFLD           H1TMC
     C                     KFLD           WFDAT
      *
     C           K#L35B    SETLLALDPL35B
      *
     C                     DO   *HIVAL
      *
     C           H1TMC     READEALDPL35B                 97
     C   97                LEAVE
     C           A9CODT    IFGT WTDAT
     C                     LEAVE
     C                     ENDIF
      *
     C           A9SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      * PART
     C           XSHN1     IFNE *BLANK
     C           XSHN2     ORNE *BLANK
     C           XSHN3     ORNE *BLANK
      *
     C           XSHN1     IFNE A9LHN1
     C           XSHN2     ORNE A9LHN2
     C           XSHN3     ORNE A9LHN3
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
      * SECTION
     C           C2SECT    IFNE *BLANK
      *
     C           C2SECT    IFEQ 'CV'
     C           A9SECT    ANDNE'1'
     C           C2SECT    OREQ 'OQ'
     C           A9SECT    ANDNE'2'
     C           C2SECT    OREQ 'HR'
     C           A9SECT    ANDNE'8'
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      * OK/NG
     C           XOK       IFNE *BLANK
     C           XOK       IFNE A9OKNG
     C                     ITER
     C                     ENDIF
     C                     ENDIF
      *
     C                     CLEARSFL02
     C                     Z-ADDA9DTMD    S2DATE
     C                     MOVELA9TIHH    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVELA9TIMM    W8TIMM
     C                     MOVELW8TIME    S2TIME
     C                     Z-ADDA9CODT    H2DATE
     C                     Z-ADDA9COTM    H2TIME
      * SECTION
     C                     SELEC
     C           A9SECT    WHEQ '1'
     C                     MOVEL'CV'      S2SECT
     C           A9SECT    WHEQ '2'
     C                     MOVEL'OQ'      S2SECT
     C           A9SECT    WHEQ '8'
     C                     MOVEL'HR'      S2SECT
     C                     OTHER
     C                     MOVEL'  '      S2SECT
     C                     ENDSL
      * ON/KG
     C                     MOVELA9OKNG    S2OKNG
      * PART
     C           A9LHN2    IFNE *BLANK
     C                     MOVE '-'       A9H1
     C                     ELSE
     C                     MOVE *BLANK    A9H1
     C                     ENDIF
      *
     C           A9LHN3    IFNE *BLANK
     C                     MOVE '-'       A9H2
     C                     ELSE
     C                     MOVE *BLANK    A9H2
     C                     ENDIF
      *
     C                     MOVELA9LHIN    S2HIN1    P
     C                     MOVELA9LBAR    S2LBAR    P
     C                     MOVELA9ABAR    S2ABAR    P
      * LOCATION
     C                     MOVE '-'       A9LH1
     C                     MOVE '-'       A9LH2
     C                     MOVE '-'       A9LH3
     C                     MOVELA9LOC     S2LOC     P
      *
     C                     ADD  1         RRN2
      * INDICATE RED
     C           A9OKNG    IFEQ 'NG'
     C                     MOVE *ON       *IN55
     C                     MOVE *ON       IND55
     C                     ELSE
     C                     MOVE *OFF      *IN55
     C                     MOVE *OFF      IND55
     C                     ENDIF
      * SET ERROR MSG
     C                     MOVE *BLANK    S2EHED
     C                     MOVE *BLANK    S2EMSG
     C           A9OKNG    IFEQ 'NG'
     C                     MOVELMSG,11    S2EHED
     C                     SELEC
     C           A9ERCD    WHEQ '01'
     C                     MOVELMSG,1     S2EMSG
     C           A9ERCD    WHEQ '02'
     C                     MOVELMSG,2     S2EMSG
     C           A9ERCD    WHEQ '03'
     C                     MOVELMSG,3     S2EMSG
     C           A9ERCD    WHEQ '04'
     C                     MOVELMSG,4     S2EMSG
     C           A9ERCD    WHEQ '05'
     C                     MOVELMSG,5     S2EMSG
     C           A9ERCD    WHEQ '06'
     C                     MOVELMSG,6     S2EMSG
     C           A9ERCD    WHEQ '07'
     C                     MOVELMSG,7     S2EMSG
     C           A9ERCD    WHEQ '08'
     C                     MOVELMSG,8     S2EMSG
     C           A9ERCD    WHEQ '09'
     C                     MOVELMSG,9     S2EMSG
     C           A9ERCD    WHEQ '10'
     C                     MOVELMSG,10    S2EMSG
     C           A9ERCD    WHEQ '11'
     C                     MOVELMSG,11    S2EMSG
     C           A9ERCD    WHEQ '12'
     C                     MOVELMSG,12    S2EMSG
     C           A9ERCD    WHEQ '13'
     C                     MOVELMSG,13    S2EMSG
     C           A9ERCD    WHEQ '14'
     C                     MOVELMSG,14    S2EMSG
     C           A9ERCD    WHEQ '15'
     C                     MOVELMSG,15    S2EMSG
     C           A9ERCD    WHEQ '16'
     C                     MOVELMSG,16    S2EMSG
     C                     OTHER
     C           'Err Cde' CAT  A9ERCD:1  S2EMSG
     C                     ENDSL
     C                     ENDIF
      *
      * if no error, get lot ids for this kanban...
     C           *IN55     IFEQ *OFF
     C                     EXSR GETLOT
     C                     MOVEL'Lot IDs:'S2EHED
     C                     MOVEALOT       S2EMSG
     C                     ENDIF
      *
     C                     WRITESFL02
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT3     BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN85
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEDSP99
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL02
     C                     MOVE *OFF      *IN85
     C                     MOVE *BLANK    XMSG
      * <F1:END OR F12:BACK>
     C   KA
     COR KL                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     GET LOT IDS
      **************************************************************************
     C           GETLOT    BEGSR
      *
     C                     Z-ADD*ZERO     LX
     C                     MOVEA*BLANKS   LOT
      *
      * READ ALDPL36A
     C           K#L36A    KLIST
     C                     KFLD           A9ABAR
     C                     KFLD           A9CODT
     C                     KFLD           A9COTM
      *
     C           K#L36A    SETLLALDPL36A
      *
     C                     DO   *HIVAL
      *
     C           K#L36A    READEALDPL36A                 97
     C   97                LEAVE
      *
     C           B9SKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C                     ADD  1         LX      20
     C                     MOVELB9LOT     LOT,LX
      *
     C           LX        IFEQ 4
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           #INIT     BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     XFYY
     C                     Z-ADD*ZERO     XFMM
     C                     Z-ADD*ZERO     XFDD
     C                     Z-ADD*ZERO     XTYY
     C                     Z-ADD*ZERO     XTMM
     C                     Z-ADD*ZERO     XTDD
     C                     MOVEL*BLANK    XMSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN85
      *
     C                     ENDSR
      **************************************************************************
** ERR   +.........+.........+.........+.........+.........+.........> (70)
DATE IS INVALID !                                                      01
FROM DATE > TO DATE !                                                  02
NO DATA FOUND !                                                        03
ENTER X FOR SELECTION !                                                04
PART NOT FOUND IN MASTER !                                             05
LOCATION IS INVALID !                                                  06
SECTION SHOULD BE CV,OQ,HR OR BLANK !                                  07
ENTER OK, NG OR BLANK !                                                08
                                                                       09
F5 IS NOT AVAILABLE NOW...                                             10
** CMD
CLRPFM QTEMP/ALCWP60
** MSG   +.........+.........+.........> (40)
ENTER LOCATION BARCODE !                  01
CHECK DIGIT IS INCORRECT !                02
                                          03
ENTER STORE IN KANBAN !                   04
ABSOLUTE# IS NOT MATCHED !                05
                                          06
DUPLICATE KANBAN ERROR !                  07
                                          08
                                          09
STORE IN KANBAN IS NOT FOUND IN MASTER !  10
Error Msg:                                11
                                          12
                                          13
                                          14
                                          15
ALREADY SCANNED.                          16
