     H            Y.
     F** ALCR02 ********************************************
     F*  CONVEYANCE PULL SCAN ERROR LOG LIST               *
     F*                                                    *
     F* TCHK1 04/22/09 CREATE                              *
     F* TCHK2 06/29/09 ADD FOR MANUAL PRINT                *
     F* TCHK3 10/16/09 CHG PRINT FORMAT                    *
     F* TCHK4 01/08/10 CHG LOCATION NAME FOR BZ/JC/GM      *
     F* TCHK5 04/08/10 ADD LOCATION NAME FOR SB/MAGNI/OUTSOURCE
     F* TCHK6 06/14/10 ADD SELECT CONV TM ONLY
     F* TCHK  08/09/10 CREATE(COPY FROM ALCR02)            *
     F* TCHK7 11/08/10 ADD LOCATION FOR VN(BAG)
     F* TCHK8 12/17/10 ADD LOCATION FOR JL(JL BLACK)
     F* TCHK9 01/11/12 CHG READ SKIP A8EM03 NOT BLANK
     F******************************************************
     FALCPP01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F*
     E                    TBL     1   1 50
TCHK5E*TCHK4              LOC     1  11 15   LON    15
TCHK7E*TCHK5              LOC     1  16 15   LON    15
TCHK8E*TCHK7              LOC     1  17 15   LON    15
TCHK8E                    LOC     1  19 20   LON    15
TCHK6E                    TM      1  20  6
     I*
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1   80W@SCDT
     I                                        1   40W@SCYY
     I                                        5   60W@SCMM
     I                                        7   80W@SCDD
     I            DS
     I                                        1   80W@ECDT
     I                                        1   40W@ECYY
     I                                        5   60W@ECMM
     I                                        7   80W@ECDD
     I            DS
     I                                        1  14 W@PRT
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
     C*
     C           K#01      KLIST
     C                     KFLD           W@SCDT
     C                     KFLD           W@STTM
     C           K#01      SETLLALCPP01
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ALCPP01                  99
     C   99                LEAVE
     C*
     C           A8ERR     IFEQ *BLANK
     C                     ITER
     C                     END
TCHK9C           A8EM03    IFNE *BLANK
TCHK9C                     ITER
TCHK9C                     END
     C*
TCHK6C                     MOVELA8TMCD    W@TMCD  6
TCHK6C           W@TMCD    LOKUPTM                       96
TCHK6C           *IN96     IFEQ *OFF
TCHK6C                     ITER
TCHK6C                     END
TCHK6C*
     C           A8DATE    IFEQ W@ECDT
     C           A8TIME    ANDGTW@EDTM
     C                     LEAVE
     C                     END
     C*
     C           W@1STP    IFEQ *ON
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     MOVEL*OFF      W@1STP
     C                     END
     C*
     C                     MOVELA8TMCD    K@TMCD  60
     C           K@TMCD    CHAINALBPL30              97
     C  N97                MOVELALWKNM    P@WKNM 20
     C   97                MOVEL*BLANK    P@WKNM
     C*
TCHK4C                     Z-ADD1         X       20
TCHK4C           A8BRC2    LOKUPLOC,X                    96
TCHK4C           *IN96     IFEQ *ON
TCHK4C                     MOVELLON,X     W@BRC2 15
TCHK4C                     ELSE
TCHK4C                     MOVELA8BRC2    W@BRC2
TCHK4C                     END
TCHK4C*
     C                     MOVEL*BLANK    W@PRT
     C                     MOVELA8PR11    W@PRT1
     C                     MOVELA8PR12    W@PRT2
     C                     MOVELA8PR13    W@PRT3
     C           A8PR12    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C           A8PR13    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELW@PRT     P@PRT1 14
     C*
     C                     MOVEL*BLANK    W@PRT
     C                     MOVELA8PR21    W@PRT1
     C                     MOVELA8PR22    W@PRT2
     C                     MOVELA8PR23    W@PRT3
     C           A8PR22    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C           A8PR23    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELW@PRT     P@PRT2 14
     C*
     C                     MOVEL*BLANK    W@PRT
     C                     MOVELA8PR31    W@PRT1
     C                     MOVELA8PR32    W@PRT2
     C                     MOVELA8PR33    W@PRT3
     C           A8PR32    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C           A8PR33    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELW@PRT     P@PRT3 14
     C*
     C                     EXCPT@DTL
TCHK2C                     MOVEL*ON       PMRFLG
     C*
     C                     ENDDO
     C*
     C                     MOVEL*ON       *INLR
     C                     RETRN
     C*-----------------------------------------------------
     C* INITIAL SET
     C*-----------------------------------------------------
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           PMSHFT  1
     C                     PARM           PMSCDT  8
TCHK2C                     PARM           PMRFLG  1
TCHK2C                     MOVEL*OFF      PMRFLG
     C*
     C                     TIME           WSDT
     C*
     C           PMSCDT    IFNE *BLANK
     C                     MOVELPMSCDT    W@SCDT
     C                     MOVELPMSCDT    W@ECDT
     C                     ELSE
     C                     MOVELWSSDAT    W@SCDT
     C                     MOVELWSSDAT    W@ECDT
     C                     END
     C*
     C                     SELEC
     C           PMSHFT    WHEQ '1'
     C                     Z-ADD070000    W@STTM  60
     C                     Z-ADD145959    W@EDTM  60
     C           PMSHFT    WHEQ '2'
     C                     Z-ADD150000    W@STTM
     C                     Z-ADD225959    W@EDTM
     C           PMSHFT    WHEQ '3'
     C           K#AGDP    KLIST
     C                     KFLD           W@SCYY
     C                     KFLD           W@SCMM
     C                     KFLD           W@SCDD
     C           K#AGDP    CHAINAGDPL12              98
     C           *IN98     IFEQ *OFF
     C                     READPAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KAYY    W@SCYY
     C                     Z-ADDF8KAMM    W@SCMM
     C                     Z-ADDF8KADD    W@SCDD
     C                     END
     C                     END
     C                     Z-ADD230000    W@STTM
     C                     Z-ADD065959    W@EDTM
     C                     OTHER
     C                     Z-ADD000000    W@STTM
     C                     Z-ADD000000    W@EDTM
     C                     ENDSL
     C*
     C                     MOVEL*ON       W@1STP  1
     C*
     C                     ENDSR
      *
     OQPRINT  E   01           @HED
     O                         #PGM      10
     O                         TBL,1     72
     O                                   87 'DATE'
     O                         WSSDATY   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   02           @HED
     O                                   87 'TIME'
     O                         WSSTM6    98 '  :  :  '
     O        E   03           @HED
     O                                   15 'SCANNED DATE AT'
     O                         W@SCDTY   26
TCHK3O                                   36 'SHIFT#:'
TCHK3O                         PMSHFT    38
     O        E   05           @HED
     O                                    4 'TIME'
     O                                   20 'TEAM MEMBER'
TCHK3O*                                  44 'BARCODE#1'
TCHK3O*                                  78 'BARCODE#2'
TCHK3O*                                 110 'BARCODE#3'
TCHK3O*       E 1              @DTL
TCHK3O*                        A8TIME     8 ' 0:  :  '
TCHK3O*                        P@WKNM    29
TCHK3O*                        A8KIND    36
TCHK3O*                        A8BRC1    52
TCHK3O*                        P@PRT1    67
TCHK3O*                        A8BRC2    84
TCHK3O*                        P@PRT2    99
TCHK3O*                        A8BRC3   116
TCHK3O*                        P@PRT3   131
TCHK3O                                   45 'A/P KANBAN'
TCHK3O                                   62 'LOCATION'
TCHK3O                                   80 'MFG KANBAN'
TCHK3O                                   99 'ERROR MESSAGE'
TCHK3O        E 1              @DTL
TCHK3O                         A8TIME     8 ' 0:  :  '
TCHK3O                         P@WKNM    29
TCHK3O                         A8KIND    36
TCHK3O                         A8BRC1    52
TCHK4O*TCHK3                   A8BRC2    69
TCHK4O                         W@BRC2    69
TCHK3O                         A8BRC3    85
TCHK3O                         A8EM01   106
TCHK3O        E 1              @DTL
TCHK3O                         P@PRT1    51
TCHK3O                         P@PRT2    68
TCHK3O                         P@PRT3    84
TCHK3O                         A8EM02   106
** TBL
<<  ROLLING PULL 3 POINT SCAN ERROR LOG LIST  >>
** LOC
GMSP           GEOMET
BZA            BZ-01 A-LINE
BZB            BZ-02 B-LINE
BZC            BZ-03 C-LINE
LG             LUBE GREEN
D3             AR8133
DR             SAFETY DRAW 711                                         711
LC             LUBE CLEAR
KW             WASHING
RE             RED
M1             RED
SB             SHOT BLAST
MAGNI          MAGNI
OUTS           OUTSOURCE
TN             TNT15
SW             SW ULTRASONIC WASH
VN             BAG
JL             JL BLACK
SRT            SORTING
** TM
903815 DOUG MILLERT
116511 JEROME NEIL
081665 LANA TOMAS
020181 MARK BROWN
010883 BEN GIBSON
042975 DAVE NELSON
@07
@08
@09
@10
@11
@12
@13
@14
@15
@16
@17
@18
@19
@20
