     H            Y.                                    1
      ***ALCR22*****************************************************************
      *  PULLING ERRORS INQUIRY TM,DATE                                        *
      *
      * LEC     2019/12/19  CREATE
      **************************************************************************
     FALCPW22 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FALCPP01 IF  E           K        DISK
     FALCPL02 IF  E           K        DISK
     F            ALCPP011                          KRENAMEALCPL02R
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FALCWP22 UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   1 70
     E                    MSG        50 40
     E                    CNT        50  6 0
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I                                        9  120F1FRTM
     I                                        1  120F1FROM
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
      * CHECK DATE
     I            DS
     I                                        1   80CHKAHZ
     I                                        1   40CHKAYY
     I                                        5   60CHKAMM
     I                                        7   80CHKADD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I                                        9  120F1TOTM
     I                                        1  120F1TO
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
      * SCANNED RESULT DATE
     I            DS
     I                                        1   80A8DATE
     I                                        1   40A8DTYY
     I                                        5   80A8DTMD
      * SCANNED RESULT TIME
     I            DS
     I                                        1   60A8TIME
     I                                        1   20A8TIHH
     I                                        3   40A8TIMM
     I                                        5   60A8TISS
     I                                        1   40A8TIHM
      *
      * SCANNED RESULT DATE AND TIME COMBINED
     I            DS
     I                                        1  120WKDTTM
     I                                        1   80WKDATE
     I                                        9  120WKTIHM
      *
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * PART#
     I            DS
     I                                        1  15 W@PART
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    ERRMSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C           K#AGDA    KLIST
     C                     KFLD           CHKAYY
     C                     KFLD           CHKAMM
     C                     KFLD           CHKADD
      *
     C           KEY22     KLIST
     C                     KFLD           A8TMCD
     C                     KFLD           A8DATE
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    ERRMSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     DO
      *
     C                     SETOF                     313249
     C                     SETOF                     333435
     C                     TIME           WSDT
      *
      * DATE FROM
     C           F1SCFH    IFEQ *ZERO
     C           F1SCFH    ORGT WSSDAT
     C                     SETON                     3149
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,1     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C                     Z-ADDF1SCFH    W1SCFH
     C                     Z-ADDF1SCFH    CHKAHZ
      *
      *  check from date is valid
     C           K#AGDA    CHAINAGDPL12              50
     C           *IN50     IFEQ *ON
     C                     SETON                     3149
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,1     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
      *  check from time is valid
     C           F1FRTM    IFGT 2359
     C                     SETON                     3449
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,5     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      * DATE TO
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     ENDIF
      *
     C                     Z-ADDF1SCTH    CHKAHZ
      *
      *  check to date is valid
     C           K#AGDA    CHAINAGDPL12              50
     C           *IN50     IFEQ *ON
     C                     SETON                     3249
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,1     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
      *  check to time is valid
     C           F1TOTM    IFGT 2359
     C                     SETON                     3549
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,5     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
      *  DATE FROM > TO ?
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,2     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2359      F1TOTM
     C                     ENDIF
      *
      *  DATE/TIME FROM > TO DATE/TIME  ?
     C           F1FROM    IFGT F1TO
     C                     SETON                     313249
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,2     ERRMSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
      *
     C                     Z-ADD*ZERO     C2ECNT
      *
     C                     CLOSEALCWP22
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALCWP22
      *
     C                     DO
      *
     C           K#P01A    KLIST
     C                     KFLD           F1SCFH
     C                     KFLD           K@TIME  60
      *
     C                     Z-ADD0         K@TIME
     C                     MOVELF1FRTM    K@TIME
     C           K#P01A    SETLLALCPP01
      *
     C                     DO   *HIVAL
      *
     C                     READ ALCPP01                  97
     C   97                LEAVE
      *
      * ignore record if good...only count ERROR records...
     C           A8ERR     IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDA8DATE    WKDATE
     C                     Z-ADDA8TIHM    WKTIHM
      *
     C           WKDTTM    IFGE F1FROM
     C           WKDTTM    ANDLEF1TO
      *                   continue
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C           A8TMNM    IFEQ *BLANKS
     C                     MOVELA8TMCD    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    A8TMNM
     C                     ENDIF
     C                     ENDIF
      *
     C           KEY22     CHAINALCWP22              96
     C           *IN96     IFEQ *ON
     C                     CLEARALCWP221
     C                     MOVELA8TMCD    W22TMC
     C                     MOVELA8TMNM    W22TMN
     C                     Z-ADDA8DATE    W22DAT
     C                     ADD  1         W22ABX
     C                     WRITEALCWP221
     C                     ELSE
     C                     ADD  1         W22ABX
     C                     UPDATALCWP221
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           *LOVAL    SETLLALCWP22
      *
     C                     DO   *HIVAL
      *
     C                     READ ALCWP22                  94
     C   94                LEAVE
      *
     C                     CLEARSFL020
     C                     MOVELW22TMN    S2TMNM
     C                     Z-ADDW22DAT    S2SCDT
     C                     Z-ADDW22ABX    S2ECNT
     C                     MOVELW22TMC    H2TMCD
      *
     C                     ADD  W22ABX    C2ECNT
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
      *
     C                     ENDDO
      *
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313249
     C           ERRMSG    IFEQ *BLANK
     C                     MOVELERR,3     ERRMSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    ERRMSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C                     EXSR #FMT30
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     Z-ADD*ZERO     M
     C                     Z-ADD*ZERO     MX
     C                     Z-ADD*ZERO     CNT
     C                     MOVE *BLANKS   MSG
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELS2TMNM    C3TMNM
     C                     Z-ADDS2ECNT    C3ECNT
     C                     Z-ADDS2SCDT    C3SCDT
      *
     C           K#L02A    KLIST
     C                     KFLD           H2TMCD
     C                     KFLD           S2SCDT
     C                     KFLD           K@TIME
      *
     C           K#L02B    KLIST
     C                     KFLD           H2TMCD
     C                     KFLD           S2SCDT
      *
     C                     Z-ADD0         K@TIME
     C                     MOVELF1FRTM    K@TIME
      *
     C           K#L02A    SETLLALCPL02
      *
     C                     DO   *HIVAL
      *
     C           K#L02B    READEALCPL02                  97
     C   97                LEAVE
      *
      * ignore record if good...only count ERROR records...
     C           A8ERR     IFEQ *BLANK
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDA8DATE    WKDATE
     C                     Z-ADDA8TIHM    WKTIHM
      *
     C           WKDTTM    IFGE F1FROM
     C           WKDTTM    ANDLEF1TO
      *                   continue
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C           A8EM01    CAT  A8EM02    ERRM   40
     C                     Z-ADD1         MX      40
     C           ERRM      LOKUPMSG,MX                   10
     C           *IN10     IFEQ *ON
     C                     ADD  1         CNT,MX
     C                     ELSE
     C                     ADD  1         M       40
     C                     MOVELERRM      MSG,M
     C                     Z-ADD1         CNT,M
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      *
      * write to subfile...
     C                     DO   M         MX
      *
     C                     CLEARSFL030
     C                     MOVELMSG,MX    S3EMSG
     C                     Z-ADDCNT,MX    S3ECNT
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
     C                     ENDDO
      *
     C                     MOVEL*OFF      *IN71
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
** ERR    +.........+.........+.........+.........+.........+.........> (70)
DATE IS INVALID !                                                        01
FROM DATE  >  TO DATE !                                                  02
NO DATA FOUND !                                                          03
SECTION MUST BE CV, OQ OR BLANK !                                        04
TIME IS INVALID                                                          05
                                                                         06
                                                                         07
                                                                         08
                                                                         09
                                                                         10
** CMD
CLRPFM QTEMP/ALCWP22
