     H            Y.                                    1
      ***ALDRZ9*****************************************************************
      *  TM SCAN SIGN-ON/OFF LOCK/UNLOCK LOG                                   *
      *
      **************************************************************************
     FALDPWZ9 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FALDPLZ9 IF  E           K        DISK
     FALDPLZ6 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FALDWPZY UF  E           K        DISK                      A
     FALDWPZD UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   2 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
      *         FROM DATE
     I            DS
     I                                        1   80WRKDAT
     I                                        1   40WRKYY
     I                                        5   60WRKMM
     I                                        7   80WRKDD
     I                                        5   80WRKMD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
      * SIGN-ON DATE
     I            DS
     I                                        1   80A@ONDT
     I                                        1   40A@ONYY
     I                                        5   60A@ONMM
     I                                        7   80A@ONDD
      * SIGN-ON TIME
     I            DS
     I                                        1   60A@ONTM
     I                                        1   40A@ONHM
      * SIGN-OFF DATE
     I            DS
     I                                        1   80A@OFDT
     I                                        1   40A@OFYY
     I                                        5   60A@OFMM
     I                                        7   80A@OFDD
      * SIGN-OFF TIME
     I            DS
     I                                        1   60A@OFTM
     I                                        1   40A@OFHM
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  140FRTIME
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  140TOTIME
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'15'      #FMT15
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           IPGRP   20
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKH     WHEQ *ON
     C                     MOVE '15'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     3334
     C                     TIME           WSDT
      *
     C           F1SCFH    IFEQ *ZERO
     C           F1SCFH    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1SCFH    W1SCFH
      *
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     ENDIF
      *
     C           W1SCFD    IFEQ *ZERO
     C                     Z-ADD01        W1SCFD
     C                     ENDIF
     C           W1SCTD    IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           W1SCTY
     C                     KFLD           W1SCTM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    W1SCTD
     C                     ELSE
     C                     Z-ADD31        W1SCTD
     C                     ENDIF
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2400      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1SCFH    IFEQ F1SCTH
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1SCFH    FRDATE
     C           F1FRTM    MULT 100       FRTIME
     C                     Z-ADDF1SCTH    TODATE
     C           F1TOTM    MULT 100       TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
      *
      * close and clear workfile before recreating.
      *
     C                     CLOSEALDWPZY
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALDWPZY
      *
      * close and clear detail workfile before recreating.
      *
     C                     CLOSEALDWPZD
      *
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,2     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALDWPZD
      *
      * start with getting all TM codes within date/time range.
      *
     C           K#PZ9     KLIST
     C                     KFLD           F1SCFH
      *
     C           K#PZ9     SETLLALDPLZ9
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPLZ9                  97
     C   97                LEAVE
      *
     C           A@ONDT    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C           A@PGRP    IFNE IPGRP
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDA@ONDT    SCDATE
     C                     Z-ADDA@ONTM    SCTIME
      *
      * if scan date/time between from date/time and to date/time.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
      *  write to TM name workfile.
     C           A@WKCD    CHAINALDWPZY              96
     C           *IN96     IFEQ *ON
     C                     CLEARALDWPZY1
     C                     Z-ADDA@WKCD    WYWKCD
     C                     MOVELA@WKNM    WYWKNM
     C                     WRITEALDWPZY1
     C                     ENDIF
      *
      *  write to detail workfile too.
      *
     C                     CLEARALDWPZD1
     C                     MOVELA@WKCD    WDWKCD
     C                     MOVELA@WKNM    WDWKNM
     C                     MOVELA@WSNO    WDWSNO
     C                     Z-ADDA@ONDT    WDONDT
     C                     Z-ADDA@ONHM    WDONTM
      *
     C                     Z-ADDA@OFDT    WDOFDT
     C                     Z-ADDA@OFHM    WDOFTM
     C                     MOVELA@UPGM    WDUPGM
     C                     Z-ADDA@PGRP    WDPGRP
     C                     MOVELA@PGNM    WDPGNM
     C                     MOVELA@UNCD    WDUNCD
     C                     WRITEALDWPZD1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      * now read workfile and write to subfile to be displayed.
      *
     C           *LOVAL    SETLLALDWPZY
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDWPZY                  94
     C   94                LEAVE
      *
     C                     CLEARSFL020
     C                     MOVELWYWKNM    S2TMNM
     C                     MOVELWYWKCD    H2TMCD
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
      *
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C                     EXSR #FMT30
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELS2TMNM    C3TMNM
      *
     C                     MOVELH2TMCD    WKCD    60
     C           K#WD2A    KLIST
     C                     KFLD           WKCD
      *
     C           K#WD2A    SETLLALDWPZD
      *
     C                     DO   *HIVAL
      *
     C           K#WD2A    READEALDWPZD                  97
     C   97                LEAVE
      *
     C                     CLEARSFL030
     C                     Z-ADDWDONDT    WRKDAT
     C                     Z-ADDWRKMD     S3ONDT
     C                     Z-ADDWDOFDT    WRKDAT
     C                     Z-ADDWRKMD     S3OFDT
      *
     C                     MOVELWDONTM    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE WDONTM    W8TIMM
     C                     MOVELW8TIME    S3ONTM
      *
     C                     MOVELWDOFTM    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE WDOFTM    W8TIMM
     C                     MOVELW8TIME    S3OFTM
      *
     C                     MOVELWDWSNO    S3WSNO
     C                     MOVELWDPGNM    S3PGNM
      *
      * get team leader name that unlocked error
     C                     MOVELWDUNCD    TLCD    60
     C           TLCD      CHAINALBPL30              72
     C           *IN72     IFEQ *OFF
     C                     MOVELALWKNM    S3TLNM
     C                     ENDIF
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD3    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
      *     ACTIVE TEAM MEMBER SCREEN
      **************************************************************************
     C           #FMT15    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN1    40
      *
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVE *BLANKS   WKSTN  10
     C           K#WDZ6    KLIST
     C                     KFLD           WKSTN
      *
     C           K#WDZ6    SETLLALDPLZ6
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPLZ6                  97
     C   97                LEAVE
      *
     C           A@PGRP    IFEQ IPGRP
     C                     CLEARSFL010
     C                     Z-ADDA@ONDT    WRKDAT
     C                     Z-ADDWRKMD     S1ONDT
      *
     C                     MOVELA@ONHM    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE A@ONHM    W8TIMM
     C                     MOVELW8TIME    S1ONTM
      *
     C                     MOVELA@WKNM    S1WKNM
     C                     MOVELA@WSNO    S1WSNO
     C                     MOVELA@PGNM    S1PGNM
      *
     C                     ADD  1         RRN1
     C                     WRITESFL010
     C                     ENDIF
      *
     C                     ENDDO
      *
      ***************************
      *
     C           RRN1      IFEQ *ZERO
     C                     SETON                     313249
     C                     MOVELERR,3     MSG
     C                     GOTO #END15
     C                     ENDIF
      *
     C                     Z-ADD1         W#RNP1  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP1    #RCN01
     C                     EXFMTCTL010
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD1    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP1
     C                     END
      *
     C                     ENDDO
      *
     C           #END15    TAG
     C                     MOVEL'10'      @@ID
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR






** CMD
CLRPFM QTEMP/ALDWPZY
CLRPFM QTEMP/ALDWPZD
