     H            Y.
     FALDPL28 IF  E           K        DISK
     FAJHPPS1 IF  E           K        DISK
     FALDWPQ1 O   F     256            DISK
      *
     E                    OBM        15  4               部門
     E                    OKB        15  3               機番
     E                    OTK        15  6               所番地
     E                    OSH        15  1               かんばん種類
     E                    OKO        15  3               工程
     E                    OHB        15 12               品番
      *
     C                     Z-ADD20230126  K@DATE  80
      *
     C           K@DATE    SETLLALDPL28
     C                     DO   *HIVAL
     C                     READ ALDPL28                  77
     C   77                LEAVE
      *
     C           A9CODT    IFNE K@DATE
     C                     LEAVE
     C                     END
      *
     C                     CALL 'AAMRSC'
      * IN
     C                     PARM A9AHN1    INHIN1  5
     C                     PARM A9AHN2    INHIN2  5
     C                     PARM A9AHN3    INHIN3  2
      * OUT
     C                     PARM *BLANK    OUTBMN 60
     C                     PARM *BLANK    OUTKBN 45
     C                     PARM *BLANK    OUTTKR 90
     C                     PARM *BLANK    OUTSHR 15
     C                     PARM *BLANK    OUTKOT 45
     C                     PARM *BLANK    OUTHBN180
     C                     PARM *BLANK    STATUS  1
      *
     C           STATUS    IFNE '1'
     C                     ITER
     C                     END
      *
     C                     MOVEAOUTBMN    OBM
     C                     MOVEAOUTKBN    OKB
     C                     MOVEAOUTTKR    OTK
     C                     MOVEAOUTSHR    OSH
     C                     MOVEAOUTKOT    OKO
     C                     MOVEAOUTHBN    OHB
      *
     C           A9AHN1    IFEQ '90105'
     C           A9AHN2    ANDEQ'A0360'
     C                     Z-ADD1         AHO     40
     C                     END
      *
     C                     MOVE *BLANK    W@FLG   1
     C                     Z-ADD0         W@CNT   30
     C                     Z-ADD0         @Z      30
     C           1         DO   15        @X      30
     C           16        SUB  @X        @Z
     C           OKO,@Z    IFEQ *BLANK
     C                     ITER
     C                     END
     C           OSH,@Z    IFNE *BLANK
     C                     ADD  1         W@CNT
     C                     END
     C           W@CNT     IFGE 2
     C                     LEAVE
     C                     END
     C           OBM,@Z    IFEQ '0111'
     C           OKO,@Z    ANDEQ'JC '
     C                     MOVE '*'       W@FLG
     C                     END
     C                     ENDDO
      *
     C           W@FLG     IFNE '*'
     C                     ITER
     C                     END
      *
     C                     CALL 'AJHRS1'
     C                     PARM A9ABAR    P#BARC 20
     C                     PARM *BLANK    P#RTN   1
     C                     PARM 0         P#WINY  40
     C                     PARM 0         P#WINM  20
     C                     PARM 0         P#WIND  20
     C                     PARM 0         P#WINJ  20
     C                     PARM 0         P#WINF  20
     C                     PARM 0         P#WMJY  20
     C                     PARM *BLANK    P#MKKB  2
      *
     C           KEY       KLIST
     C                     KFLD           JDKOTE
     C                     KFLD           JDBARC
      *
     C                     MOVE *BLANK    W@OMIT  1
     C                     MOVE 'JC '     JDKOTE
     C                     MOVELA9ABAR    JDBARC
     C                     DO   *HIVAL
     C           KEY       SETGTAJHPPS1
     C                     REDPEAJHPPS1                  88
     C   88                LEAVE
     C                     MOVE '*'       W@OMIT
     C                     LEAVE
     C                     ENDDO
      *
     C                     EXCPTODAT
      *
     C                     ADD  1         SAKA    40
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OALDWPQ1 E                ODAT
     O                         A9AHN1
     O                         A9AHN2
     O                         A9AHN3
     O                                      ','
     O                         A9CODT       '    /  /  '
     O                                      ','
     O                         A9COTM       '  :  :  '
     O                                      ','
     O                         A9ABAR
     O                                      ','
     O                         P#RTN
     O                                      ','
     O                         W@OMIT
     O                                      ','
     O                         A9OKNG
     O                                      ','
     O                         A9ERCD
