     H            Y.
     F*******************************************************
     FALDPW26 CF  E                    WORKSTN
     FAB#PL69 IF  E           K        DISK
     E                    ER      1   3 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           NONY    4
     C                     PARM           SHID    8
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    PCMD    2
      *
     C           KEY       KLIST
     C                     KFLD           KKNONY  40
     C                     KFLD           KKSHID  80
      *
     C                     Z-ADD323       KKNONY
     C                     MOVELKKNONY    NONY
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *　⒳�痧���瘏�絗�猻▓　　　　　　　　　　　　�
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     MOVEL'03'      PCMD    2
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           SCSHID    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,1      MSG
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     MOVELSCSHID    KKSHID
      *
     C           KEY       CHAINAB#PL69              53
     C           *IN53     IFEQ *ON
     C                     SETON                     3199
     C                     MOVELER,2      MSG
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     MOVELKKNONY    NONY
     C                     MOVELKKSHID    SHID
      *
     C                     MOVEL'99'      DSPSW   2
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END PROGRAM.                                       *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
**
INPUT SHIP DATE.
NO DATA IN CASE LABEL
