     H            Y,
      *** ALDR22 *************************************
      *  INPUT OF OUT-GOING TRACK RECORD  <OUTPUT>   *
      *     CREATE DATE.     :  JUN/27/1997.         *
      *     AUTHOR.          :  SHINICHIRO.OHTAKE    *
      ************************************* ALDR22 ***
     FALDWP20 IP  F     200            DISK
     FALDPL20 IF  E           K        DISK
     FALDPP20 O   E                    DISK                      A
     FALDWP21 O   F     200            DISK
     IALDWP20 AA  01
     I                                        1 200 DATA
     I                                        1   1 KANS
     I                                        2   5 ZETI
     I                                        6  11 ORDR
     I                                       12  12 SEHI
     I                                       13  160LOTN
     I                                       17  17 CHEK
     I                                       18  45 BARC
      *   BOTTOM KANBAN ISSUE NO
     I                                       28  30 UPAG
      *
     I                                       46  530SYHZ
     I                                       46  490SYYY
     I                                       50  510SYMM
     I                                       52  530SYDD
     I                                       54  570SYTM
     I                                       54  550SYJI
     I                                       56  570SYFN
     I                                       58  63 OPER
     I                                       64  64 KUGI
     I                                       65  65 EFF
     I                                       66  690NONY
     I                                       70  70 NKOJ
     I                                       71  74 NUKE
     I                                       75  79 SHN1
     I                                       80  84 SHN2
     I                                       85  86 SHN3
     I                                       87  91 MHN1
     I                                       92  96 MHN2
     I                                       97 101 MHN3
     I                                      102 106 MHN4
     I                                      107 107 TKR1
     I                                      108 109 TKR2
     I                                      110 111 TKR3
     I                                      112 112 TKR4
     I                                      113 1170SSYS
     I                                      118 1240USYS
     I                                      125 130 TOPX
      *-------------*
      * SYSTEM TIME *
      *-------------*
     I            DS
     I                                        1  140WTIME
     I                                        1   20WJI
     I                                        3   40WFN
      *--------*
      *  KEYS  *
      *--------*
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PRTFLG  1
      *
     C           KEY1      KLIST
     C                     KFLD           ZETI
     C                     KFLD           ORDR
     C                     KFLD           SEHI
     C                     KFLD           LOTN
     C                     KFLD           SYYY
     C                     KFLD           SYMM
     C                     KFLD           SYDD
     C                     KFLD           SYJI
     C                     KFLD           SYFN
      *--------------------*
      *  ALDR22 EXECUSION  *
     C*--------------------*
     C           *IN80     IFEQ '0'
     C                     SETON                     80
     C                     MOVE PUS       US     10
     C                     ENDIF
      *
     C                     MOVE *BLANK    EROR    1
     C                     SETOF                     50
     C           KEY1      CHAINALDPL201             50
     C           *IN50     IFEQ '0'
     C                     MOVE '*'       PRTFLG  1
     C                     MOVE '1'       EROR
     C                     EXSR LSTSUB
     C                     GOTO EXT
     C                     ENDIF
     C                     EXSR OUTSUB
     C           EXT       TAG
     CLR                   RETRN
      *----------*
      *  OUTSUB  *
      *----------*
     C           OUTSUB    BEGSR
     C                     Z-ADD*YEAR     A1KSYY
     C                     Z-ADD*MONTH    A1KSMM
     C                     Z-ADD*DAY      A1KSDD
     C                     TIME           WTIME
     C                     Z-ADDWJI       A1KSJI
     C                     Z-ADDWFN       A1KSPN
     C                     MOVE US        A1KSNA
     C                     MOVE SHN1      A1SHN1
     C                     MOVE SHN2      A1SHN2
     C                     MOVE SHN3      A1SHN3
     C                     Z-ADDSYYY      A1SYYY
     C                     Z-ADDSYMM      A1SYMM
     C                     Z-ADDSYDD      A1SYDD
     C                     Z-ADDSYJI      A1SYJI
     C                     Z-ADDSYFN      A1SYFN
     C                     MOVE KANS      A1KANS
     C                     MOVE ZETI      A1ZETI
     C                     MOVE ORDR      A1ORDR
     C                     MOVE SEHI      A1SEHI
     C                     Z-ADDLOTN      A1LOTN
     C                     MOVE TKR1      A1TKR1
     C                     MOVE TKR2      A1TKR2
     C                     MOVE TKR3      A1TKR3
     C                     MOVE TKR4      A1TKR4
     C                     MOVE OPER      A1OPER
     C                     MOVE MHN1      A1MHN1
     C                     MOVE MHN2      A1MHN2
     C                     MOVE MHN3      A1MHN3
     C                     MOVE MHN4      A1MHN4
     C                     Z-ADDSSYS      A1SSYS
     C                     Z-ADDUSYS      A1USYS
     C                     Z-ADDNONY      A1NONY
     C                     MOVE NKOJ      A1NKOJ
     C                     MOVE NUKE      A1NUKE
     C                     MOVE TOPX      A1TOPX
     C                     MOVE EFF       A1SALE
     C                     MOVE UPAG      A1UPAG
     C                     WRITEALDPP201
     C                     ENDSR
      *----------*
      *  LSTSUB  *
      *----------*
     C           LSTSUB    BEGSR
     C                     EXCPTDAT
     C                     ENDSR
      **********************************************************
     OALDWP21 E                DAT
     O                         SHN1       5
     O                         SHN2      10
     O                         SHN3      12
     O                         SYYY      16
     O                         SYMM      18
     O                         SYDD      20
     O                         SYJI      22
     O                         SYFN      24
     O                         ZETI      28
     O                         ORDR      34
     O                         SEHI      35
     O                         LOTN      39
     O                         MHN1      44
     O                         MHN2      49
     O                         MHN3      54
     O                         MHN4      59
     O                         OPER      65
     O                         EFF       66
     O                         EROR      67
     O                         NONY      71
     O                         NKOJ      72
     O                         NUKE      76
     O                         USYS      83
