     H            Y/
      ** ALDR56 *************************************************
      * SCANNED PARTS LIST                                      *
      *               JUL/01/2003                               *
      *                                                         *
      *                                                         *
      * TCHK1 11/20/09 ADD INVENTORY SCAN DATE & TIME
      ************************************************* ALDR56 **
     FALDPW58 CF  E                    WORKSTN
     FAB#PL12 IF  E           K        DISK
     FALDWP56 O   E           K        DISK                      A
     FAB#PL70 IF  E           K        DISK
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK1I            DS
TCHK1I                                        1   80EKDEDT
TCHK1I                                        1   40EKDEYY
TCHK1I                                        5   60EKDEMM
TCHK1I                                        7   80EKDEDD
TCHK1I            DS
TCHK1I                                        1   60W@IVTM
TCHK1I                                        1   40W@IVHM
TCHK1I                                        5   60W@IVSS
      *--------------------------------------------------------
      *   MAIN ROUTINE
      *--------------------------------------------------------
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P@END   1
     C                     PARM           P@DATE  8
     C           K#KEY     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#70      KLIST
     C                     KFLD           BATOKU
     C                     KFLD           K@NONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C**                   KFLD           BAODRN
JW1  C                     KFLD           XXODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           K@NOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
      *
     C                     MOVE '01'      W@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  SCRN1
      *--------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXFMTDSP01
      *
     C           *INKA     IFEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '1'       P@END
     C                     ELSE
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     MOVE '99'      W@ID
     C                     MOVE *BLANK    P@END
     C                     MOVE D@YMD     P@DATE
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  CHECK
      *--------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     SETOF                     9961
TCHK1C                     SETOF                     6263
TCHK1C*
     C                     Z-ADDD@YMD     K@YMD
     C           K#KEY     SETLLAB#PL12
     C                     READ AB#PL12                  90
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     ENDIF
      *
TCHK1C           D@IVDT    IFEQ *ZERO
TCHK1C                     SETON                     9962
TCHK1C                     END
TCHK1C           D@IVTM    IFEQ *ZERO
TCHK1C                     SETON                     9963
TCHK1C                     END
TCHK1C*
     C                     ENDSR
      *--------------------------------------------------------
      *  OUTPUT
      *--------------------------------------------------------
     C           #OUT      BEGSR
TCHK1C*
TCHK1C                     Z-ADDD@IVTM    W@IVHM
TCHK1C                     Z-ADD*ZERO     W@IVSS
      *
     C           K#KEY     SETLLAB#PL12
     C           *IN80     DOUEQ*ON
     C                     READ AB#PL12                  80
     C           *IN80     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
      *
     C                     Z-ADD*ZERO     @@QTY  110
     C                     MOVE BANONY    K@NONY
     C                     MOVE BANOBN    K@NOBN
JW1  C                     MOVELBAODRN    XXODRN
     C           K#70      SETLLAB#PL70
     C           *IN85     DOUEQ*ON
     C           K#70      READEAB#PL70                  85
     C           *IN85     IFEQ *OFF
TCHK1C           EKDEDT    IFLT D@IVDT
TCHK1C                     ADD  EKSRYO    @@QTY
TCHK1C                     END
TCHK1C           EKDEDT    IFEQ D@IVDT
TCHK1C           EKDETM    ANDLTW@IVTM
     C                     ADD  EKSRYO    @@QTY
TCHK1C                     END
     C                     ENDIF
     C                     ENDDO
      *
JW1  C           @@QTY     IFEQ 0
 .   C                     MOVELBAINVN    XXODRN
 .   C           K#70      SETLLAB#PL70
 .   C           *IN85     DOUEQ*ON
 .   C           K#70      READEAB#PL70                  85
 .   C           *IN85     IFEQ *OFF
 .   C           EKDEDT    IFLT D@IVDT
 .   C                     ADD  EKSRYO    @@QTY
 .   C                     END
 .   C           EKDEDT    IFEQ D@IVDT
 .   C           EKDETM    ANDLTW@IVTM
 .   C                     ADD  EKSRYO    @@QTY
 .   C                     END
 .   C                     ENDIF
 .   C                     ENDDO
JW1  C                     ENDIF
      *
TCHK1C*          @@QTY     IFGE BASRYO
TCHK1C           @@QTY     IFEQ *ZERO
TCHK1C                     ITER
TCHK1C                     END
TCHK1C*
     C                     MOVE BASHN1    D5PRT1
     C                     MOVE BASHN2    D5PRT2
     C                     MOVE BASHN3    D5PRT3
     C                     Z-ADDBASRYO    D5QTY
     C           BAUSYS    IFNE *ZERO
     C           BASRYO    DIV  BAUSYS    D5BOX
     C                     MVR            @@MVR   90
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         D5BOX
     C                     ENDIF
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C           BASRYO    DIV  BASYOS    D5BOX
     C                     MVR            @@MVR   90
     C           @@MVR     IFGT *ZERO
     C                     ADD  1         D5BOX
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
TCHK1C*
     C                     WRITEALDWP561
TCHK1C*                    ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------
