     H            Y,
      *** ALDR10 *************************************
      *  INPUT OF OUT-GOING TRACK RECORD  <SELECT>   *
      *     CREATE DATE.     :  JUN/26/1997.         *
      *     AUTHOR.          :  SHINICHIRO.OHTAKE    *
      ************************************* ALDR10 ***
     FALDWP10 IP  F     100            DISK
     FALDWP20 O   F     200            DISK
     FALDWP30 O   F     200            DISK
     FALDWP40 O   F     200            DISK
     IALDWP10 AA  01
     I                                        1 100 DATA
     I                                        1   1 SYRUI
     C           *ENTRY    PLIST
     C                     PARM           IFLG
     C                     PARM           AFLG
     C                     PARM           KFLG
      *--------------------*
      *  ALDR10 EXECUSION  *
      *--------------------*
     C           *IN10     IFEQ '0'
     C                     MOVE *BLANK    IFLG    1
     C                     MOVE *BLANK    AFLG    1
     C                     MOVE *BLANK    KFLG    1
     C                     SETON                     10
     C                     ENDIF
      *
     C           SYRUI     IFEQ 'I'
     C                     EXCPTIAF
     C                     MOVE '*'       IFLG
     C                     GOTO EXT
     C                     ENDIF
      *
     C           SYRUI     IFEQ 'A'
     C           SYRUI     OREQ 'S'
     C           SYRUI     OREQ 'R'
     C           SYRUI     OREQ 'M'
     C           SYRUI     OREQ 'Y'
     C                     EXCPTAPICS
     C                     MOVE '*'       AFLG
     C                     GOTO EXT
     C                     ENDIF
      *
     C                     EXCPTKOTEI
     C                     MOVE '*'       KFLG
     C           EXT       TAG
     CLR                   RETRN
      **********************************************************
     OALDWP20 E                IAF
     O                         DATA
     OALDWP30 E                APICS
     O                         DATA
     OALDWP40 E                KOTEI
     O                         DATA
