     H            Y.                                    1
      ***ALDR9D*****************************************************************
      * FINAL STORAGE IN ERROR LOG LIST                                        *
      *                                                                        *
      *  LEC         2016.05.18                                                *
      **************************************************************************
     FALDPW9D CF  E                    WORKSTN
     FALDPL28 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FAM#PL32 IF  E           K        DISK
     FQPRINT  O   F     198     OF     PRINTER
      *------------------------------------------------------------
     E                    ERR     1  20 20
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8KDAT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     I            DS
     I                                        1   80K@NYMD
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1  20 @@MHIN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  15 @MHN3
     I                                       16  20 @MHN4
     I                                        1  10 @MHN10
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *--------------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C                     TIME           @@TIM   60
     C                     Z-ADD*DATE     K@YMD
      *
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADDF8KDAT    D@FROM
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     Z-ADDD@FROM    D@TO
      *
     C                     MOVE *ALL'-'   W@LINE190
     C                     MOVE '01'      W@ID    2
      *
     C                     MOVEL'ALDR98'  R4PGM
      *
     C           K#AMK1    KLIST
     C                     KFLD           R4PGM
     C                     KFLD           R4KOME
     C                     KFLD           A9KODT
     C                     KFLD           A9KOTM
      *
     C                     ENDSR
      **************************************************************************
     C           #SCRN1    BEGSR
      **************************************************************************
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ*ON
     C                     EXSR #OUT
     C                     MOVE '99'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      **************************************************************************
      *  CHECK SCREEN ONE DATES AND TIMES.
      **************************************************************************
     C           #CHK1     BEGSR
      *
     C                     SETOF                     616263
     C                     SETOF                     6465
     C                     SETOF                     99
     C           D@TO      IFEQ *ZERO
     C                     Z-ADDD@FROM    D@TO
     C                     ENDIF
     C           D@TO      IFLT D@FROM
     C                     MOVEA'11'      *IN,61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     Z-ADDD@FROM    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@TOTM    IFEQ *ZERO
     C                     Z-ADD2359      D@TOTM
     C                     ENDIF
      *
     C           D@FROM    IFEQ D@TO
     C           D@TOTM    IFLT D@FRTM
     C                     MOVEA'11'      *IN,64
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C           D@OTN     IFNE *BLANK
     C           D@OTN     ANDNE'1'
     C                     SETON                     6399
     C                     ENDIF
      *
     C           D@FRTM    MULT 100       W@FRTM  60
     C           D@TOTM    MULT 100       W@TOTM  60
     C                     ADD  59        W@TOTM
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  OUTPUT
      *--------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     MOVE *OFF      *IN98
     C           D@FROM    SETLLALDPL28
     C           *IN80     DOUEQ*ON
      *
     C                     READ ALDPL28                  80
     C           *IN80     IFEQ *OFF
      *
     C           A9CODT    IFEQ D@FROM
     C           A9COTM    ANDLTW@FRTM
     C                     ITER
     C                     ENDIF
      *
     C           A9CODT    IFEQ D@TO
     C           A9COTM    ANDGTW@TOTM
     C                     LEAVE
     C                     ENDIF
      *
     C           A9CODT    IFGT D@TO
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELA9WOKR    K@OPER  60
     C           K@OPER    CHAINALBPL30              90
      *
     C           D@OTN     IFEQ *BLANK
     C           A9OKNG    ANDEQ'OK'
     C                     ITER
     C                     ENDIF
      *
     C           A9ERCD    IFGT *BLANK
     C                     MOVE A9ERCD    @2      20
     C                     MOVELERR,@2    W@MSG  20
     C                     ELSE
     C                     MOVEL*BLANKS   W@MSG
     C                     ENDIF
      *
     C           *IN98     IFEQ *OFF
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     ENDIF
      *
     C  N98                MOVE *ON       *IN98
      *
     C                     EXCPT@DTL
     C           A9OKNG    IFEQ 'NG'
     C                     EXSR GETTL
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------
      *  GET TEAM LEADER NAME THAT UNLOCKED ERROR
      *--------------------------------------------------------
     C           GETTL     BEGSR
      *
     C                     MOVE *BLANKS   TLNAME 20
     C                     MOVE *BLANKS   KOME   10
     C                     Z-ADD*ZERO     ULDATE  80
     C                     Z-ADD*ZERO     ULTIME  60
      *
     C                     MOVELA9WOKR    R4KOME
     C           K#AMK1    CHAINAM#PL32              51
     C           *IN51     IFEQ *OFF
     C                     Z-ADDR4KOHU    ULDATE
     C                     Z-ADDR4KOTU    ULTIME
     C                     MOVELR4KOME    KOME
      *
      * get team leader name from worker code master file.
     C           R4WKCD    IFNE *ZERO
     C           R4WKCD    CHAINALBPL30              51
     C           *IN51     IFEQ *OFF
     C                     MOVELALWKNM    TLNAME
     C                     ENDIF
     C                     ENDIF
      *
     C                     EXCPT@DTL2
     C                     ENDIF
      *
     C                     ENDSR
      *-------------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM       8
     O                         UDATE Y  136
     O                         @@TIM    145 '  :  :  '
     O                                  148 'P.'
     O                         PAGE  Z  152
     O        E   02           @HED
     O                                   50 '2-POINT SCAN ERROR LOG'
     O        E   04           @HED
     O                                   82 '-------  LOCATION TAG'
     O                                   92 '--------'
     O                                  124 '--------------------'
     O                                  135 '    KANBAN'
     O                                  165 '------------------------'
     O        E   05           @HED
     O                                    8 'OPERATOR'
     O                                   31 'ERROR DATE'
     O                                   38 'TIME'
     O                                   68 'PART ID'
     O                                   79 'PART#'
     O                                   91 'LOC'
     O                                  111 'PART ID'
     O                                  122 'PART#'
     O                                  134 'LOC'
     O                                  160 'BAR CODE'
     O                                  190 'ERROR MESSAGE'
     O        E   06           @HED
     O                         W@LINE   190
     O        E 1              @DTL
     O                         ALWKNM    20
     O                         A9CODTY   31
     O                         A9COTM    40 '  :  :  '
      *
     O                         A9LZET    68
     O                         A9LHN1    76
     O                         A9LHN2    82
     O                         A9LHN3    85
     O                         A9TBN1    87
     O                         A9TBN2    89
     O                         A9TBN3    91
     O                         A9TBN4    92
      *
     O                         A9AZET   111
     O                         A9AHN1   119
     O                         A9AHN2   125
     O                         A9AHN3   128
     O                         A9ABN1   130
     O                         A9ABN2   132
     O                         A9ABN3   134
     O                         A9ABN4   135
     O                         A9ABAR   165
     O                         A9OKNG   175
      *
     O                         W@MSG    197
      *
     O        E 1              @DTL2
     O                                   20 '** Unlocked **'
     O                         ULDATEY   31
     O                         ULTIME    40 '  :  :  '
     O                         TLNAME    62
      *-------------------------------------------------------
** ERR
INPUT LOCATION BARCODE
CHECK DIGIT ERROR
PARTS MASTER ERROR
INPUT STORE IN KANBAN
NONMATCH ERROR
FNC KEY ERROR
DUPLICATE KANBAN
APICS STOP ALERT
PT STOP ALERT
CHR_STL NOT SCAN SORTING
CHR_STL ALREADY STORE IN
CHR_STL ALREADY OUT
PROC. JC  SKIPPED
14
15
16
17
18
19
20
