     H            Y.                                    1
      ***ALDR9E*****************************************************************
      *  SHIPPING SCAN RESULT INQUIRY BY TM, DATE                              *
      *
      **************************************************************************
     FALDPW9E CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FALDPL24 IF  E           K        DISK
     FALDPL34 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FALDPL69 IF  E           K        DISK
     FALDWP2Y UF  E           K        DISK                      A
     FALDWP2D UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   2 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
      *         FROM DATE
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
      * SCANNED RESULT DATE
     I            DS
     I                                        1   80A1DATE
     I                                        1   40A1KSYY
     I                                        5   60A1KSMM
     I                                        7   80A1KSDD
      * SCANNED RESULT TIME
     I            DS
     I                                        1   60A1TIME
     I                                        1   20A1KSJI
     I                                        3   40A1KSPN
     I I            0                         5   60A1SECS
      * SCANNED RESULT DATE
     I            DS
     I                                        1   80A3DATE
     I                                        1   40A3KSYY
     I                                        5   60A3KSMM
     I                                        7   80A3KSDD
      * SCANNED RESULT TIME
     I            DS
     I                                        1   60A3TIME
     I                                        1   20A3KSJI
     I                                        3   40A3KSPN
     I I            0                         5   60A3SECS
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  140FRTIME
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  140TOTIME
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      * PART#
     I            DS
     I                                        1  14 W@PART
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     3334
     C                     TIME           WSDT
      *
     C           F1SCFH    IFEQ *ZERO
     C           F1SCFH    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1SCFH    W1SCFH
      *
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     ENDIF
      *
     C           W1SCFD    IFEQ *ZERO
     C                     Z-ADD01        W1SCFD
     C                     ENDIF
     C           W1SCTD    IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           W1SCTY
     C                     KFLD           W1SCTM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    W1SCTD
     C                     ELSE
     C                     Z-ADD31        W1SCTD
     C                     ENDIF
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2359      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1SCFH    IFEQ F1SCTH
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1SCFH    FRDATE
     C           F1FRTM    MULT 100       FRTIME
     C                     Z-ADDF1SCTH    TODATE
     C           F1TOTM    MULT 100       TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
      *
     C                     Z-ADD*ZERO     C2ACNT
     C                     Z-ADD*ZERO     C2PCNT
      *
      * ｴｾﾁﾐｶ ｲﾀｵ ｴｾｶｲﾊ ﾗﾁﾊｽｷｻｾｶ ｳｶｷﾁﾊｶ ﾊｶｴﾊｶｲﾔｻﾀｸ.
      *
     C                     CLOSEALDWP2Y
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALDWP2Y
      *
      * ｴｾﾁﾐｶ ｲﾀｵ ｴｾｶｲﾊ ｵｶﾔｲｻｾ ﾗﾁﾊｽｷｻｾｶ ｳｶｷﾁﾊｶ ﾊｶｴﾊｶｲﾔｻﾀｸ.
      *
     C                     CLOSEALDWP2D
      *
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,2     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALDWP2D
      *
      * ﾐﾔｲﾊﾔ ﾗｻﾔｹ ﾊｶｲｵｻﾀｸ ｲﾀｵ ｲｴｴﾕｿﾕｾｲﾔｻﾀｸ ｲｾｾ PASSTHRU ｽｲﾀｳｲﾀﾐ ﾐｴｲﾀﾀｶｵ.
      *
     C           K#P20A    KLIST
     C                     KFLD           F1SCFY
     C                     KFLD           F1SCFM
     C                     KFLD           F1SCFD
      *
     C           K#P20A    SETLLALDPL24
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPL24                  97
     C   97                LEAVE
      *
     C           A1DATE    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDA1DATE    SCDATE
     C                     Z-ADDA1TIME    SCTIME
      *
      * ｻｷ ﾐｴｲﾀ ｵｲﾔｶ/ﾔｻｿｶ ｳｶﾔﾗｶｶﾀ ｷﾊﾁｿ ｵｲﾔｶ/ﾔｻｿｶ ｲﾀｵ ﾔﾁ ｵｲﾔｶ/ﾔｻｿｶ.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
     C           A1OPER    CHAINALDWP2Y              96
     C           *IN96     IFEQ *ON
     C                     CLEARALDWP2Y1
     C                     MOVELA1OPER    WYWKCD
     C                     MOVELA1OPER    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    WYWKNM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         WYA#BX
      *
     C  N96                UPDATALDWP2Y1
     C   96                WRITEALDWP2Y1
      *
      *
      *  ﾗﾊｻﾔｶ ﾔﾁ ｵｶﾔｲｻｾ ﾗﾁﾊｽｷｻｾｶ ﾔﾁﾁ.
      *
     C                     CLEARALDWP2D1
     C                     MOVELA1OPER    WDWKCD
     C                     MOVELA1DATE    WDDATE
     C                     MOVELA1TIME    WDTIME
     C                     MOVEL'P'       WDKIND
      *
     C                     MOVEL*BLANK    W@PART
     C                     MOVELA1SHN1    W@PRT1
     C           A1SHN2    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     ENDIF
     C                     MOVELA1SHN2    W@PRT2
     C           A1SHN3    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     ENDIF
     C                     MOVELA1SHN3    W@PRT3
     C                     MOVELW@PART    WDPART
      *
     C                     MOVELA1ZETI    WDZETI
     C                     MOVELA1ORDR    WDORDR
     C                     MOVELA1LOTN    WDLOTN
     C                     MOVELA1SERL    WDSERL
      *
     C                     WRITEALDWP2D1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      * ﾀﾁﾗ ﾊｶｲｵ ｲﾀｵ ｲｴｴﾕｿﾕｾｲﾔｶ ｲｾｾ APICS ｽｲﾀｳｲﾀﾐ ﾐｴｲﾀﾀｶｵ.
      *
     C           K#P20A    SETLLALDPL34
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPL34                  97
     C   97                LEAVE
      *
     C           A3DATE    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDA3DATE    SCDATE
     C                     Z-ADDA3TIME    SCTIME
      *
      * ｻｷ ﾐｴｲﾀ ｵｲﾔｶ/ﾔｻｿｶ ｳｶﾔﾗｶｶﾀ ｷﾊﾁｿ ｵｲﾔｶ/ﾔｻｿｶ ｲﾀｵ ﾔﾁ ｵｲﾔｶ/ﾔｻｿｶ.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
      * ﾗﾊｻﾔｶ/ﾕﾂｵｲﾔｶ ﾔﾁﾔｲｾﾐ ﾗﾁﾊｽｷｻｾｶ.
     C           A3OPER    CHAINALDWP2Y              96
     C           *IN96     IFEQ *ON
     C                     CLEARALDWP2Y1
     C                     MOVELA3OPER    WYWKCD
     C                     MOVELA3OPER    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    WYWKNM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         WYA#BX
      *
     C  N96                UPDATALDWP2Y1
     C   96                WRITEALDWP2Y1
      *
      *  ﾗﾊｻﾔｶ ﾔﾁ ｵｶﾔｲｻｾ ﾗﾁﾊｽｷｻｾｶ ﾔﾁﾁ.
      *
     C                     CLEARALDWP2D1
     C                     MOVELA3OPER    WDWKCD
     C                     MOVELA3DATE    WDDATE
     C                     MOVELA3TIME    WDTIME
     C                     MOVEL'A'       WDKIND
      *
     C                     MOVEL*BLANK    W@PART
     C                     MOVELA3SHN1    W@PRT1
     C           A3SHN2    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     ENDIF
     C                     MOVELA3SHN2    W@PRT2
     C           A3SHN3    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     ENDIF
     C                     MOVELA3SHN3    W@PRT3
     C                     MOVELW@PART    WDPART
      *
     C                     MOVELA3ZETI    WDZETI
     C                     MOVELA3TEHI    WDTEHI
     C                     MOVELA3PAGE    WDPAGE
     C                     MOVELA3SERL    WDSERL
      *
     C                     WRITEALDWP2D1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *  get number of short scans made by shipping scan pgm ...
     C           K#P69     KLIST
     C                     KFLD           W1SCFH
      *
     C           K#P69     SETLLALDPL69
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPL69                  97
     C   97                LEAVE
      *
     C           AFODAT    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDAFODAT    SCDATE
     C                     Z-ADDAFOTIM    SCTIME
      *
      *  if scan date/time is within selected date range...
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
     C                     MOVELAFOTMC    WKCD6   6
     C           WKCD6     CHAINALDWP2Y              96
     C           *IN96     IFEQ *ON
     C                     CLEARALDWP2Y1
     C                     MOVELAFOTMC    WYWKCD
     C                     MOVELAFOTMC    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    WYWKNM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         WYP#BX
      *
     C  N96                UPDATALDWP2Y1
     C   96                WRITEALDWP2Y1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      * ﾀﾁﾗ ﾊｶｲｵ ﾗﾁﾊｽｷｻｾｶ ｲﾀｵ ﾗﾊｻﾔｶ ﾔﾁ ﾐﾕｳｷｻｾｶ ﾔﾁ ｳｶ ｵｻﾐﾂｾｲﾙｶｵ.
      *
     C           *LOVAL    SETLLALDWP2Y
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDWP2Y                  94
     C   94                LEAVE
      *
     C                     CLEARSFL020
     C                     MOVELWYWKNM    S2TMNM
     C                     Z-ADDWYA#BX    S2ACNT
     C                     Z-ADDWYP#BX    S2PCNT
     C                     MOVELWYWKCD    H2TMCD
      *
     C                     ADD  WYA#BX    C2ACNT
     C                     ADD  WYP#BX    C2PCNT
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
      *
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C                     EXSR #FMT30
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELS2TMNM    C3TMNM
     C                     Z-ADDS2ACNT    C3ACNT
      *******              Z-ADDS2PCNT    C3PCNT
      *
     C                     MOVELH2TMCD    WKCD    6
     C           K#WD2A    KLIST
     C                     KFLD           WKCD
      *
     C           K#WD2A    SETLLALDWP2D
      *
     C                     DO   *HIVAL
      *
     C           K#WD2A    READEALDWP2D                  97
     C   97                LEAVE
      *
     C                     CLEARSFL030
     C                     Z-ADDWDDATE    S3DATE
      *
     C                     MOVELWDTIME    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE WDTIME    W8TIMM
     C                     MOVELW8TIME    S3TIME
      *
     C                     MOVELWDKIND    S3KIND
     C                     MOVELWDPART    S3HIN1
     C                     MOVELWDZETI    S3ZETI
     C                     MOVELWDTEHI    S3TEHI
     C                     MOVELWDPAGE    S3PAGE
     C                     MOVELWDORDR    S3ORDR
     C                     MOVELWDLOTN    S3LOTN
     C                     MOVELWDSERL    S3SERL
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD3    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR






** CMD
CLRPFM QTEMP/ALDWP2Y
CLRPFM QTEMP/ALDWP2D
