     H            Y,
      *** ALDR23 ****************************************
      * OUT-GOING TRACK RECORD  ERROR LIST <IAF KANBAN> *
      *     CREATE DATE.     :  JUN/26/1997.            *
      *     AUTHOR.          :  SHINICHIRO.OHTAKE       *
      **************************************** ALDR23 ***
     FALDWP21 IP  F     200            DISK
     FALDPR20 O   E             95     PRINTER
     E                    TAB1    1   2  1   TAB2    9   KANBAN TYPE
     E                    TAB3    1   1  1   TAB4   15   ERROR
     IALDWP21 AA  01
     I                                        1 200 DATA
     I                                        1   5 SHN1
     I                                        6  10 SHN2
     I                                       11  12 SHN3
     I                                       13  160SYYY
     I                                       17  180SYMM
     I                                       19  200SYDD
     I                                       21  220SYJI
     I                                       23  240SYFN
     I                                       25  28 ZETI
     I                                       29  34 ORDR
     I                                       35  35 SEHI
     I                                       36  390LOTN
     I                                       40  44 MHN1
     I                                       45  49 MHN2
     I                                       50  54 MHN3
     I                                       55  59 MHN4
     I                                       60  65 OPER
     I                                       66  66 EFF
     I                                       67  67 EROR
     I                                       68  710NONY
     I                                       72  72 NKOJ
     I                                       73  76 NUKE
     I                                       77  830USYS
      *--------*
      *  KEYS  *
      *--------*
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
      *
      *--------------------*
      *  ALDR23 EXECUSION  *
     C*--------------------*
     C           *IN80     IFEQ '0'
     C                     SETON                     80
     C                     MOVE PUS       US     10
     C                     TIME           WTIME  140
     C                     MOVE *BLANK    PUSNM  15
     C                     CALL 'APLR00'
     C                     PARM           US
     C                     PARM           PUSNM
     C                     MOVELPUSNM     TANNAM  8
     C                     WRITEALDPR201
     C                     Z-ADD0         CNT     50
     C                     GOTO JUMP
     C                     ENDIF
      *
     C           *IN95     IFEQ '1'
     C                     WRITEALDPR201
     C                     SETOF                     95
     C                     ENDIF
      *
     C           JUMP      TAG
     C                     MOVE SHN1      OSHN1
     C                     MOVE SHN2      OSHN2
     C                     MOVE SHN3      OSHN3
     C                     Z-ADDSYYY      OSYYY
     C                     Z-ADDSYMM      OSYMM
     C                     Z-ADDSYDD      OSYDD
     C                     Z-ADDSYJI      OSYJI
     C                     Z-ADDSYFN      OSYFN
     C                     MOVE ZETI      OZETI
     C                     MOVE ORDR      OORDR
     C                     MOVE SEHI      OSEHI
     C                     MOVE LOTN      OLOTN
     C                     MOVE MHN1      OMHN1
     C                     MOVE MHN2      OMHN2
     C                     MOVE MHN3      OMHN3
     C                     MOVE MHN4      OMHN4
     C                     Z-ADDNONY      ONONY
     C                     MOVE NKOJ      ONKOJ
     C                     MOVE NUKE      ONUKE
     C                     Z-ADDUSYS      OUSYS
     C                     SETOF                     30
     C                     MOVE *BLANK    OTYPE
     C           EFF       LOKUPTAB1      TAB2           30
     C   30                MOVELTAB2      OTYPE
     C                     SETOF                     30
     C                     MOVE *BLANK    OEROR
     C           EROR      LOKUPTAB3      TAB4           30
     C   30                MOVELTAB4      OEROR
     C                     WRITEALDPR202
     C           CNT       ADD  1         CNT
     CLR                   Z-ADDCNT       OCNT
     CLR                   WRITEALDPR203
** OUT-GOING TYPE
EDELV INFO
KKANBAN
** ERROR
1REGISTERED DATA
