     H            Y/
      *** ALDRS6 *************************************
      *   GET PT KANBAN STATUS BY PAGE A-PICS        *
      *   J WATANABE    2020.09.18                   *
      ************************************************
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
      *===================================================
      *           MAIN ROUTINE
      *===================================================
     C                     EXSR #INIT
      *
     C                     Z-ADD0         @@PLPD  80
     C                     Z-ADD0         @@PLPT  40
     C                     Z-ADD0         @@PLPS  40
     C                     MOVELPHCHYU    $KBN
     C                     MOVELPHZENO    $ZETI
     C                     MOVELPHTHNO    $TEHI
      *
     C           1         DO   99        PG#     20
     C                     MOVELPG#       $PAGE
     C                     CALL 'UEXR35'
     C                     PARM           $KBN    1
     C                     PARM           $ZETI   4
     C                     PARM           $TEHI   3
     C                     PARM           $PAGE   2
     C                     PARM           $STAT   1
     C                     PARM           $PLPD   80
     C                     PARM           $PLPT   40
     C                     PARM           $RTN    1
      *
     C           $RTN      IFEQ ' '
     C           $STAT     ANDEQ'B'
     C                     ADD  1         @@PLPS
     C           $PLPD     IFGT @@PLPD
     C                     Z-ADD$PLPD     @@PLPD
     C                     Z-ADD$PLPT     @@PLPT
     C                     ENDIF
     C                     ENDIF
      *
     C           PG#       IFEQ 99
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEL@@PLPD    PHPLPD
     C                     MOVEL@@PLPT    PHPLPT
     C                     MOVEL@@PLPS    PHPLPS
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *======================================================
      * INITIAL SET
      *======================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PHCHYU  1
     C                     PARM           PHZENO  4
     C                     PARM           PHTHNO  3
     C                     PARM           PHPLPD  80
     C                     PARM           PHPLPT  40
     C                     PARM           PHPLPS  40
      *
     C                     Z-ADD0         PHPLPD
     C                     Z-ADD0         PHPLPT
     C                     Z-ADD0         PHPLPS
     C                     TIME           SDATE
      *
     C                     ENDSR
