     H            Y.                                    1
     H***ALDR2V*****************************************************************
     H* MATCHING SHIPPING SYSTEM IN IAF(ENTRY)                                 *
     H*
     H* MODIFICATION                                                   *********
     H*     APR/26/02(TCH)  TOTAL QTY OF READING LABES IS EXCEED THE
     H*                     ORDER QTY -> ERROR
     H*     JUN/06/02(TCH)  ADD DENSO 4-POINT
     H*     AUG/01/02(TCH)  ADD 2021,2022 FOR 4-POINT
     H*     JAN/03/03(TCH)  CHECK APPROVAL FILE
     H*     JAN/21/03(TCH)  ADD MODULUS CHECK
     H*     FEB/12/03(TCH)  ADD ERROR LOG FILE
     H*     JUN/11/03(TCH)  ADD ORDER FILE TO ASJ
     H*     JUL/23/03(TCH)  ADD TMMC 4-POINT
     H*
     H* TCHK1 04/22/07 ADD FIELD TO ALDPP50
     H* TCHK2 04/23/08 BUG FIX
     H* TCHK3 04/24/08 ADD ALDPP2C,ALDPP3C FOR CANCEL KANBAN DATA
     H* TCHK4 05/23/11 ADD ALDPL46 FOR QSS(4044)
     H* TCHK5 02/10/12 ADD AU#PP11 UPDATE FUNCTION
     H* TCHK6 05/28/13 ADD GTAPL10 UPDATE FUNCTION
     H* TCHK7 08/27/13 ADD AU#PP11 UPDATE FUNCTION
     H* TCHK8 11/07/13 ADD GTAPP20 UPDATE FUNCTION
     H**************************************************************************
     FALDPW2V CF  E                    WORKSTN
     FALDPL25 UF  E           K        DISK
     FALDPL35 UF  E           K        DISK
     FALDPP50 O   E           K        DISK
     FAB#PL71 UF  E           K        DISK
     FAB#PL70 UF  E           K        DISK
     F            AB#PP701                          KRENAMEAB#70R
      *
     FAB#PP65 UF  E           K        DISK
TCHK3FALDPP2C O   E                    DISK
TCHK3FALDPP3C O   E                    DISK
TCHK4FALDPL46 UF  E           K        DISK
TCHK4FALDPP45CO   E                    DISK
TCHK5FALDPP98 IF  E           K        DISK
TCHK5FAU#NP11 UF  F       9            DISK                      A
TCHK5FKU#PP11 O   E                    DISK                      A
TCHK5FGADPL11 IF  E           K        DISK
TCHK5FFCEPL01 IF  E           K        DISK
TCHK6FGTAPL10 UF  E           K        DISK
TCHK8FGTAPP20 UF  E           K        DISK
     FAL#PL03 UF  E           K        DISK
      **FAM#PL01 UF  E           K        DISK
     FAM#PL0C UF  E           K        DISK
     FAL#PP21 IF  E           K        DISK
     F**************************************************************************
     E                    ERR     1  14 15
     I**************************************************************************
TCHK5IAU#NP11 AA  70
TCHK5I                                        1   20AHZMM
TCHK5I                                        3   90ARECD
      * 2D KANBAN
     I            DS
     I                                        1 250 B2D
     I                                        1  25 BAR01
     I                                       26  50 BAR02
     I                                       51  75 BAR03
     I                                       76 100 BAR04
     I                                      101 125 BAR05
     I                                      126 150 BAR06
     I                                      151 175 BAR07
     I                                      176 200 BAR08
     I                                      201 225 BAR09
     I                                      226 250 BAR10
      * 2D KANBAN
     I            DS
     I                                        1 250 W2D
     I                                        1  18 BARCD0
     I                                        1   1 CTYPE
     I                                        2  16 TXT1
     I                                       17  31 TXT2
     I                                       32  36 SUPP
     I                                       37  38 DCCOD
     I                                       39  42 SBAN
     I                                       43  54 PART
     I                                       55  64 LNAD
     I                                       65  74 STAD
     I                                       75  79 LOTS
     I                                       80  99 SUPNM
     I                                      100 108 MAINR
     I                                      109 117 SUBR
     I                                      118 125 UNDAT
     I                                      126 133 SHDT
     I                                      134 139 SHTM
     I                                      140 151 ORNO
     I                                      152 155 BXNBR
     I                                      156 159 BXTOT
     I                                      160 164 DEST
     I                                      196 197 PALT
     I                                       19 250 FILR
     I            DS
     I                                        1   9 @9
     I                                        1   4 XCUST
     I                                        5   5 XFACT
     I                                        6   9 XSHTO
     I            DS
     I                                        1   80EKDATE
     I                                        1   40EKKOYY
     I                                        5   60EKKOMM
     I                                        7   80EKKODD
     I            DS
     I                                        1 250 HKAN
     I                                        1  25 HAR01
     I                                       26  50 HAR02
     I                                       51  75 HAR03
     I                                       76 100 HAR04
     I                                      101 125 HAR05
     I                                      126 150 HAR06
     I                                      151 175 HAR07
     I                                      176 200 HAR08
     I                                      201 225 HAR09
     I                                      226 250 HAR10
     I                                        1  19 BARHON
     I            DS
     I                                        1 250 DKAN
     I                                        1  25 DAR01
     I                                       26  50 DAR02
     I                                       51  75 DAR03
     I                                       76 100 DAR04
     I                                      101 125 DAR05
     I                                      126 150 DAR06
     I                                      151 175 DAR07
     I                                      176 200 DAR08
     I                                      201 225 DAR09
     I                                      226 250 DAR10
     I                                        1  14 BARDEN
     I                                        2  11 NALP
     I* SYSTEM DATE(8 DIGITS) FOR FIRST SCREEN
     I            DS
     I                                        1   80WSDATE
     I                                        1   4 WSYYYY
     I                                        5   6 WSMM
     I                                        7   8 WSDD
     I                                        1   8 WSDAT
     I* SHIPPING DATE(8 DIGITS)
     I            DS
     I                                        1   80SHIPD
     I                                        1   20SYY12
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I                                        1   80SHIPDC
     I* ACCOMMODATED QTY. CHANGE DATE(8 DIGITS)
     I            DS
     I                                        1   80WQDATE
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I* LOCATION CHANGE DATE(8 DIGITS)
     I            DS
     I                                        1   80WLDATE
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
TCHK5I                                        7  140WSSDAT
     I                                        1   4 WSTIME
TCHK3I                                        1   60WSSTM6
     I* OUT-GOING TRACK DATA FILE(IAF) ALDPP20
     I* KANBAN TYPE,ABSOLUTE#,ORDER#,SEHIN KUBUN,LOT#
     I            DS
     I                                        1  16 WIAF
     I                                        1   1 A1KANS
     I                                        2   5 A1ZETI
     I                                        6  11 A1ORDR
     I                                       12  12 A1SEHI
     I                                       13  160A1LOTN
     I* OUT-GOING TRACK DATA FILE(A-PICS) ALDPP30
     I* KANBAN TYPE,ABSOLUTE#,TEHI#,PAGE#,2ND WORK TIME,OBJ TYPE,YUKO,BOX
     I            DS
     I                                        1  14 WAPICS
     I                                        1   1 A3KANS
     I                                        2   5 A3ZETI
     I                                        6   8 A3TEHI
     I                                        9  10 A3PAGE
     I                                       11  11 A32KAK
     I                                       12  12 A3TASY
     I                                       13  13 A3YUKO
     I                                       14  14 A3HASY
     I* FCEPL01 (KEY)
     I            DS
     I                                        1  12 WKPNO
     I                                        1   5 K11
     I                                        6  10 K12
     I                                       11  12 K13
     I            DS
     I                                        1  60 BMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  20 EKMHIN
     I                                        1   5 EKMHN1
     I                                        6  10 EKMHN2
     I                                       11  15 EKMHN3
     I                                       16  20 EKMHN4
     I            DS
     I                                        1   80K@NYMD
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
     I            DS
     I                                        1  20 @@MHIN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  15 @MHN3
     I                                       16  20 @MHN4
     I                                        1  10 @MHN10
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHL5I            DS
TCHL5I                                        1   80EKNODT
TCHL5I                                        1   40EKNOYY
TCHL5I                                        5   60EKNOMM
TCHL5I                                        7   80EKNODD
TCHL5I            DS
TCHL5I                                        1   80A2GSHZ
TCHL5I                                        1   40A2GSYY
TCHL5I                                        5   60A2GSMM
TCHL5I                                        7   80A2GSDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I              'AM#C29COA2'          C         OA2PGM
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      @SCRN1           AIAJ LABEL
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*                    @INT
     C**************************************************************************
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 20
      *
     C           K#AP70    KLIST
     C                     KFLD           A6TOKU
     C                     KFLD           WWNONY  4
     C                     KFLD           A6NKOJ
     C                     KFLD           A6NUKE
     C                     KFLD           A6MHN1
     C                     KFLD           A6MHN2
     C                     KFLD           A6MHN3
     C                     KFLD           A6MHN4
     C                     KFLD           WWODRN 10
     C                     KFLD           A6NOYY
     C                     KFLD           A6NOMM
     C                     KFLD           A6NODD
     C                     KFLD           WWNOBN  2
     C*                    KFLD           A6DEYY
     C*                    KFLD           A6DEMM
     C*                    KFLD           A6DEDD
     C           K#65      KLIST
     C                     KFLD           K@DEST  5
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@ORNO 12
     C                     KFLD           K@KANO  4
     C                     KFLD           K@BOXN  4
      *
     C           KEY0C     KLIST
     C                     KFLD           ORNO
     C                     KFLD           DEST
     C                     KFLD           DCCOD
     C                     KFLD           PALT
      *
     C                     MOVE '01'      @@ID    2
     C*
     C                     ENDSR
     C**************************************************************************
     C           @SCRN1    BEGSR
     C**************************************************************************
      * 2-D
     C                     EXFMTDSP01                      E-KANBAN
     C*
     C                     SELEC
      *
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR @CHK1
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    B2D
     C                     ELSE
     C                     EXSR @CAN
     C                     EXFMTDSP97
     C                     MOVE *BLANK    B2D
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *----------------------------------------------
     C           @CHK1     BEGSR
      *----------------------------------------------
     C                     SETOF                     3033
     C                     MOVE *BLANK    MSG
      *
     C           B2D       IFEQ *BLANK
     C                     SETON                     3033
     C                     MOVE ERR,14    MSG
     C                     MOVE '14'      A5ERID
     C                     SETON                     3033
     C                     GOTO #CHK1
     C                     ENDIF
      *
     C                     MOVELB2D       W2D
     C                     MOVELB2D       WWBRCD 18
      *
     C           FILR      IFEQ *BLANK
     C                     EXSR @CHK11
     C                     MOVE '1'       @D      1
     C                     ELSE
     C                     EXSR @CHK12
     C                     MOVE '2'       @D      1
     C                     ENDIF
      *
     C           *IN30     IFEQ *ON
     C                     MOVE '01'      A5ERPS
     C                     Z-ADD*DATE     A5KSDT
     C                     TIME           A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL*BLANK    A5FIL1
TCHKDC                     MOVEL*BLANK    A5FIL2
TCHKDC                     MOVEL*BLANK    A5FIL3
     C                     WRITEALDPP501
     C                     ENDIF
      *
     C           #CHK1     ENDSR
      *----------------------------------------------
     C           @CHK12    BEGSR
      *----------------------------------------------
     C                     MOVELDEST      K@DEST  5
     C                     MOVELDCCOD     K@NUKE  4
     C                     MOVELORNO      K@ORNO 12
     C                     MOVELSBAN      K@KANO  4
     C                     MOVELBXNBR     K@BOXN  4
     C           K#65      SETLLAB#PP65              90
     C           *IN90     DOUEQ*ON
     C           K#65      READEAB#PP65             N    90
     C           *IN90     IFEQ *OFF
     C           A6SKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN90     IFEQ *ON
     C                     SETON                     3033
     C                     MOVE ERR,8     MSG
     C                     MOVE '08'      A5ERID
     C                     GOTO #CHK12
     C                     ENDIF
      *
     C           #CHK12    ENDSR
      *----------------------------------------------
     C           @CHK11    BEGSR
      *----------------------------------------------
     C           BARCD0    SETLLAB#PL71
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEAB#PL71             N    90
     C           *IN90     IFEQ *OFF
     C           EKDEYY    ANDEQ*ZERO
     C                     SETON                     3033
     C                     MOVE ERR,8     MSG
     C                     MOVE '08'      A5ERID
     C                     GOTO #CHK11
     C                     ELSE
     C                     MOVE EKNONY    DELIVL  4
     C                     MOVE EKNONY    WELIVL  40
     C                     MOVE EKNUKE    DOCK    4
     C                     MOVE EKNKOJ    FACTRY  1
     C                     MOVE EKZETI    IDCD    4
     C                     MOVE EKSYOS    HQTY    50
     C                     MOVELEKMHIN    @@MHIN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVE ERR,6     MSG
     C                     SETON                     3330
     C                     MOVE '06'      A5ERID
     C                     ENDIF
      *
     C           #CHK11    ENDSR
     C**************************************************************************
     C*     WIRTE
     C**************************************************************************
     C           @CAN      BEGSR
      *
     C           @D        IFEQ '1'
     C                     EXSR @WRT
     C                     ELSE
     C                     EXSR @WRTX
     C                     ENDIF
      *
     C                     CLEARDSP01
      *
     C                     EXFMTDSP97
     C                     MOVE '01'      @@ID
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT
     C**************************************************************************
     C           @WRT      BEGSR
     C*
     C                     MOVE *BLANK    @@SERL 18
     C           BARCD0    SETLLAB#PL71
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEAB#PL71                  90
     C           *IN90     IFEQ *OFF
     C           EKDEYY    IFNE *ZERO
     C**JW                 Z-ADD*YEAR     EKKOYY
     C**                   Z-ADD*MONTH    EKKOMM
     C**                   Z-ADD*DAY      EKKODD
     C                     TIME           WSDT
     C**                   Z-ADDWSSHHH    EKKOHH
     C**                   Z-ADDWSSNNN    EKKOMN
     C                     MOVEL#USER     EKKOME
     C                     Z-ADD*ZERO     EKDEYY
     C                     Z-ADD*ZERO     EKDEMM
     C                     Z-ADD*ZERO     EKDEDD
     C                     Z-ADD*ZERO     EKDETM
     C                     Z-ADD*ZERO     EKSRYO
     C                     MOVE *BLANK    EKLTNO
     C                     MOVE *BLANK    EKISNO
     C                     UPDATAB#PP701
TCHK5C                     EXSR @AU#11
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
TCHK6C*
TCHK6C           EKNONY    IFEQ '0170'
TCHK6C           BARCD0    SETLLGTAPL10
TCHK6C           *IN90     DOUEQ*ON
TCHK6C           BARCD0    READEGTAPL10                  90
TCHK6C           *IN90     IFEQ *OFF
TCHK6C           G1SKJY    ANDEQ*BLANK
TCHK6C                     Z-ADD*YEAR     G1KOYY
TCHK6C                     Z-ADD*MONTH    G1KOMM
TCHK6C                     Z-ADD*DAY      G1KODD
TCHK6C                     TIME           WSDT
TCHK6C                     Z-ADDWSSHHH    G1KOHH
TCHK6C                     Z-ADDWSSNNN    G1KOSS
TCHK6C                     MOVEL#USER     G1KOME
TCHK6C                     Z-ADD*ZERO     G1SYHZ
TCHK6C                     Z-ADD*ZERO     G1SYTM
TCHK6C                     MOVEL*BLANK    G1SYTN
TCHK6C                     MOVEL*BLANK    G1LOT#
TCHK6C                     MOVEL*BLANK    G1PAG#
TCHK6C                     MOVEL*BLANK    G1SRL#
TCHK8C                     Z-ADD*ZERO     G1KNHZ
TCHK8C                     Z-ADD*ZERO     G1KNTM
TCHK8C                     MOVEL*BLANK    G1KNTN
TCHK8C                     MOVELG1CASE    W1CASE  4
TCHK8C                     MOVEL*BLANK    G1CASE
TCHK8C                     MOVELG1CANY    W1CANY  4
TCHK8C                     MOVEL*BLANK    G1CANY
TCHK8C                     MOVELG1CAHK    W1CAHK  8
TCHK8C                     MOVEL*BLANK    G1CAHK
TCHK8C                     MOVELG1CACK    W1CACK  1
TCHK8C                     MOVEL*BLANK    G1CACK
TCHK8C                     Z-ADD*ZERO     G1CASQ
TCHK6C                     UPDATGTAPP101
TCHK8C           K#G20     KLIST
TCHK8C                     KFLD           W1CASE
TCHK8C                     KFLD           W1CANY
TCHK8C                     KFLD           W1CAHK
TCHK8C                     KFLD           W1CACK
TCHK8C           K#G20     CHAINGTAPP20              91
TCHK8C           *IN91     IFEQ *OFF
TCHK8C                     SUB  1         G2LTS#
TCHK8C                     MOVEL*BLANK    G2CMPL
TCHK8C                     UPDATGTAPP201
TCHK8C                     END
TCHK6C                     LEAVE
TCHK6C                     END
TCHK6C                     ENDDO
TCHK6C                     END
      *
     C           BARCD0    SETLLALDPL25
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEALDPL25                  90
     C           *IN90     IFEQ *OFF
TCHK3C                     WRITEALDPP2C1
     C                     DELETALDPP201
     C                     ENDIF
     C                     ENDDO
      *
     C           BARCD0    SETLLALDPL35
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEALDPL35                  90
     C           *IN90     IFEQ *OFF
TCHK3C                     WRITEALDPP3C1
     C                     DELETALDPP301
     C                     ENDIF
     C                     ENDDO
TCHK4 *
TCHK4C           BARCD0    SETLLALDPL46
TCHK4C           *IN90     DOUEQ*ON
TCHK4C           BARCD0    READEALDPL46                  90
TCHK4C           *IN90     IFEQ *OFF
TCHK4C                     WRITEALDPP4C1
TCHK4C                     DELETALDPP451
TCHK4C                     ENDIF
TCHK4C                     ENDDO
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT (2-D BARCODE)
     C**************************************************************************
     C           @WRTX     BEGSR
      *
     C           K#65      SETLLAB#PP65              90
     C           *IN90     DOUEQ*ON
     C           K#65      READEAB#PP65                  90
     C           *IN90     IFEQ *OFF
     C           A6SKJY    ANDEQ*BLANK
     C                     MOVE 'D'       A6SKJY
     C                     Z-ADD*DATE     A6SDAT
     C                     UPDATAB#PP651
      *
     C                     MOVELA6ORNO    WWODRN
     C                     MOVE A6NOBN    WWNOBN
     C                     MOVE A6NONY    WWNONY
     C           K#AP70    SETLLAB#PL70
     C           *IN95     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  95
     C           *IN95     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           A6LTNO    ANDEQEKLTNO
     C           A6ISNO    ANDEQEKISNO
     C                     Z-ADD*ZERO     EKDEYY
     C                     Z-ADD*ZERO     EKDEMM
     C                     Z-ADD*ZERO     EKDEDD
     C                     Z-ADD*ZERO     EKDETM
     C                     Z-ADD*ZERO     EKSRYO
     C                     MOVE *BLANK    EKLTNO
     C                     MOVE *BLANK    EKISNO
     C                     UPDATAB#70R
TCHK5C                     EXSR @AU#11
     C           EKSERL    SETLLALDPL25
     C           *IN93     DOUEQ*ON
     C           EKSERL    READEALDPL25                  93
     C           *IN93     IFEQ *OFF
TCHK3C                     WRITEALDPP2C1
     C                     DELETALDPP201
     C                     ENDIF
     C                     ENDDO
      *
     C           EKSERL    SETLLALDPL35
     C           *IN93     DOUEQ*ON
TCHK2C*          BARCD0    READEALDPL35                  93
TCHK2C           EKSERL    READEALDPL35                  93
     C           *IN93     IFEQ *OFF
TCHK3C                     WRITEALDPP3C1
     C                     DELETALDPP301
     C                     ENDIF
     C                     ENDDO
      *
     C                     LEAVE
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     EXSR #SB520
     C                     EXSR #SB530
      *
     C                     ENDSR
      *----------------------------------------------------*
      *ＷＥＢデータ　パレット照合時間クリア              *
      *----------------------------------------------------*
     CSR         #SB520    BEGSR
      *
     C                     Z-ADD0         WKTOKU  40
     C                     Z-ADD0         WKNONY  40
     C                     MOVEL*BLANK    WKNKOJ  1
     C           DEST      CHAINAL#PP211             26
     C           *IN26     IFEQ '0'
     C           C2SKJY    ANDEQ'D'
     C           C2SKHZ    ANDLESDATE
     C                     SETON                     26
     C                     ENDIF
     C           *IN26     IFEQ '0'
     C                     MOVELC2TOKU    WKTOKU
     C                     MOVELC2NONY    WKNONY
     C                     MOVELC2NKOJ    WKNKOJ
     C                     ENDIF
      *
     C           KEY01     KLIST
     C                     KFLD           KKSHID  8
     C                     KFLD           KKSHIT  6
     C                     KFLD           KKSURT  9
     C                     KFLD           KKNONY  40
     C                     KFLD           KKNKOJ  1
     C                     KFLD           KKNUKE  4
     C                     KFLD           KKORD# 12
     C                     KFLD           KKPALT  2
      *
     C                     MOVELSHDT      KKSHID  8
     C                     MOVELSHTM      KKSHIT  6
     C                     MOVELSUBR      KKSURT  9
     C                     MOVE WKNONY    KKNONY  40
     C                     MOVE WKNKOJ    KKNKOJ  1
     C                     MOVELDCCOD     KKNUKE
     C                     MOVELORNO      KKORD# 12
     C                     MOVELPALT      KKPALT  2
      *
     C                     MOVEL'0'       GET     1
     C                     TIME           WTIME
     C           KEY01     SETLLAL#PL031
     C           KEY01     READEAL#PL031                 80
     C           *IN80     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C           CAMHN     IFEQ PART
     C           CABOX#    ANDEQBXNBR
     C                     MOVEL'1'       GET
     C                     Z-ADD0         CAPLDT
     C                     Z-ADD0         CAPLTI
     C                     UPDATAL#PL031
     C                     ENDIF
     C                     ENDIF
     C           KEY01     READEAL#PL031                 80
     C                     ENDDO
      *
     CSR         ESB520    ENDSR
      *----------------------------------------------------*
      *�猻▓�槑饛��胒�　　　　　　　　　　　　　　　�
      *----------------------------------------------------*
     CSR         #SB530    BEGSR
      *
     C           KEY0C     SETLLAM#PL0C1
     C           KEY0C     READEAM#PL0C1                 80
     C           *IN80     DOWEQ'0'
     C           R12HN     IFEQ PART
     C           R12OX#    ANDEQBXNBR
      *
     C           R1SKJY    IFEQ *BLANK
     C           R1HNTE    ANDEQ'OK'
      *
      * if it has been confirmed, then mark it to be cut and send to scs
     C           R1FLDC    IFNE *BLANK
     C           R1SHME    ANDEQ*BLANK
     C                     MOVELWORKER    R1KOME
     C                     MOVEL#PGM      R1KPGM
     C                     Z-ADDSDATE     R1SKHZ
     C                     Z-ADDSDATE     R1KOHZ
     C                     Z-ADDSTIME     R1KOTI
     C                     MOVEL'CUT'     R1SHME
     C                     UPDATAM#PL0C1
      *          send kanban cut json to scs...
     C                     CALL OA2PGM
     C                     PARM           R1MFBC
     C                     PARM           WORKER
      *
     C                     ELSE
      *
     C                     MOVELWORKER    R1KOME
     C                     MOVEL#PGM      R1KPGM
     C                     MOVEL'D'       R1SKJY
     C                     Z-ADDSDATE     R1SKHZ
     C                     Z-ADDSDATE     R1KOHZ
     C                     Z-ADDSTIME     R1KOTI
     C                     UPDATAM#PL0C1
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           KEY0C     READEAM#PL0C1                 80
     C                     ENDDO
      *
     CSR         ESB530    ENDSR
TCHK5C**************************************************************************
TCHK5C* KU#PP11 WRITE
TCHK5C**************************************************************************
TCHK5C           @AU#11    BEGSR
TCHK5C*
TCHK5C                     DO
TCHK5C*
TCHK7C           EKLOC2    IFEQ '52'
TCHK7C           EKLOC2    OREQ '53'
TCHK7C                     ELSE
TCHK5C                     MOVELEKNONY    K@NONY  40
TCHK5C           K@NONY    CHAINALDPP98              96
TCHK5C***96                LEAVE
TCHK5C***        EKNODT    IFLT AHNODT
TCHK5C***                  LEAVE
TCHK5C***                  END
TCHK7C                     END
TCHK5C*
TCHK5C                     TIME           WSDT
TCHK5C                     CLEARKU#PP111
TCHK5C                     Z-ADDWSSYYY    KQKOYY
TCHK5C                     Z-ADDWSSMMM    KQKOMM
TCHK5C                     Z-ADDWSSDDD    KQKODD
TCHK5C                     Z-ADDWSSHHH    KQKOHH
TCHK5C                     Z-ADDWSSNNN    KQKOSS
TCHK5C                     MOVELWUSRID    KQKOME
TCHK5C                     MOVE WORKER    KQKOME
TCHK5C*
TCHK5C                     Z-ADDEKTOKU    KQTOKU
TCHK5C           EKTOKU    IFEQ K@NONY
TCHK5C                     MOVELEKNKOJ    KQTKOJ
TCHK5C                     MOVELEKNUKE    KQTUKE
TCHK5C                     END
TCHK5C                     MOVELEKNONY    KQNONY
TCHK5C                     MOVELEKNKOJ    KQNKOJ
TCHK5C                     MOVELEKNUKE    KQNUKE
TCHK5C                     MOVELEKSHN1    KQSHN1
TCHK5C                     MOVELEKSHN2    KQSHN2
TCHK5C                     MOVELEKSHN3    KQSHN3
TCHK5C                     MOVELEKMHN1    KQMHN1
TCHK5C                     MOVELEKMHN2    KQMHN2
TCHK5C                     MOVELEKMHN3    KQMHN3
TCHK5C**                   MOVELBASBAN    KQSEBN
TCHK5C                     MOVE EKNOBN    KQKANR
TCHK5C                     MOVELEKODRN    KQNOCR
TCHK5C                     MOVELEKSYOS    W@SYOS  50
TCHK5C                     Z-SUBW@SYOS    KQSRYO
TCHK5C                     Z-ADDW@SYOS    KQSYUY
TCHK5C                     MOVEL'C'       KQTANI
TCHK5C                     MOVEL'C'       KQNSYK
TCHK5C*
TCHK5C                     Z-ADDEKNOYY    KQTHYY
TCHK5C                     Z-ADDEKNOMM    KQTHMM
TCHK5C                     Z-ADDEKNODD    KQTHDD
TCHK5C*
TCHK5C           NKEY      KLIST
TCHK5C                     KFLD           EKTOKU
TCHK5C                     KFLD           K@NONY
TCHK5C                     KFLD           EKNKOJ
TCHK5C                     KFLD           EKNUKE
TCHK5C           NKEY      CHAINGADPL111             96
TCHK5C           *IN96     IFEQ '0'
TCHK5C           B5SKJY    ANDEQ'D'
TCHK5C           B5SKHZ    ANDLEWSSDAT
TCHK5C                     SETON                     96
TCHK5C                     END
TCHK5C*
TCHK5C           *IN96     IFEQ '1'
TCHK5C                     Z-ADD1         KQCIC1
TCHK5C                     Z-ADD1         KQCIC2
TCHK5C                     Z-ADD1         KQCIC3
TCHK5C                     Z-ADDWSSHHH    KQTHJI
TCHK5C                     Z-ADDWSSNNN    KQTHPN
TCHK5C                     Z-ADDWSSHHH    KQURJI
TCHK5C                     Z-ADDWSSNNN    KQURPN
TCHK5C                     ELSE
TCHK5C                     Z-ADDB5HIZK    KQCIC1
TCHK5C                     Z-ADDB5KAIS    KQCIC2
TCHK5C                     Z-ADDB5NBIN    KQCIC3
TCHK5C                     Z-ADDB51SJI    KQTHJI
TCHK5C                     Z-ADDB51SFN    KQTHPN
TCHK5C                     Z-ADDB51UJI    KQURJI
TCHK5C                     Z-ADDB51UFN    KQURPN
TCHK5C                     END
TCHK5C           KQTHJI    IFEQ 0
TCHK5C                     Z-ADDWSSHHH    KQTHJI
TCHK5C                     END
TCHK5C           KQTHPN    IFEQ 0
TCHK5C                     Z-ADDWSSNNN    KQTHPN
TCHK5C                     END
TCHK5C           KQURJI    IFEQ 0
TCHK5C                     Z-ADDWSSHHH    KQURJI
TCHK5C                     END
TCHK5C           KQURPN    IFEQ 0
TCHK5C                     Z-ADDWSSNNN    KQURPN
TCHK5C                     END
TCHK5C*
TCHK5C                     MOVELEKLOC1    KQSBKJ
TCHK5C                     MOVELEKLOC2    KQSBRO
TCHK5C                     MOVELEKLOC3    KQSBRT
TCHK5C                     MOVELEKLOC4    KQSBDN
TCHK5C*
TCHK5C                     Z-ADDEKNOYY    KQNOYY
TCHK5C                     Z-ADDEKNOMM    KQNOMM
TCHK5C                     Z-ADDEKNODD    KQNODD
TCHK5C                     MOVELEKNOBN    KQNOBB
TCHK5C*
TCHK5C           BKEY      KLIST
TCHK5C                     KFLD           KQSHN1
TCHK5C                     KFLD           KQSHN2
TCHK5C                     KFLD           KQSHN3
TCHK5C           BKEY      CHAINFCEPL011             96
TCHK5C           *IN96     IFEQ '0'
TCHK5C           A2GSKD    ANDEQ'D'
TCHK5C           A2GSHZ    ANDLEWSSDAT
TCHK5C                     SETON                     96
TCHK5C                     END
TCHK5C           *IN96     IFEQ '1'
TCHK5C                     MOVE 'S'       KQTHAI
TCHK5C                     ELSE
TCHK5C                     MOVE A2TEHI    KQTHAI
TCHK5C                     END
TCHK5C*
TCHK5C                     MOVEL'K'       KQSKKB
TCHK5C                     Z-SUB1         KQHAKO
TCHK5C                     Z-ADDW@SYOS    KQSYUY
TCHK5C                     Z-ADDWSSYYY    KQURYY
TCHK5C                     Z-ADDWSSMMM    KQURMM
TCHK5C                     Z-ADDWSSDDD    KQURDD
TCHK5C*
TCHK5C                     MOVEL'S'       KQDTSY
TCHK5C                     MOVEL'4'       KQDTSO
TCHK7C           KQSBRO    IFEQ '52'
TCHK7C           KQSBRO    OREQ '53'
TCHK7C           KQNONY    OREQ 0170
TCHK5C                     MOVEL'51'      KQGYOM
TCHK7C                     ELSE
TCHK5C                     MOVEL'05'      KQGYOM
TCHK5C                     END
TCHK5 *
TCHK5C                     SETOF                     96
TCHK5C           1         CHAINAU#NP11              96
TCHK5C           *IN96     IFEQ '0'
TCHK5C           AHZMM     IFNE UMONTH
TCHK5C                     Z-ADDUMONTH    AHZMM
TCHK5C                     Z-ADD7000001   ARECD
TCHK5C                     ELSE
TCHK5C                     ADD  1         ARECD
TCHK5C                     END
TCHK5C                     EXCPTUP
TCHK5C                     ELSE
TCHK5C                     Z-ADDUMONTH    AHZMM
TCHK5C                     Z-ADD7000001   ARECD
TCHK5C                     EXCPTWT
TCHK5C                     END
TCHK5C*
TCHK5C                     Z-ADDARECD     KQJTNO
TCHK5C*
TCHL5C                     Z-ADDWSSDAT    KQSSHZ
TCHL5C                     Z-ADDWSSTM6    KQSSTI
TCHL5C                     Z-ADD0         KQNKHZ
TCHL5C                     Z-ADD0         KQNKTI
TCHL5C                     Z-ADD0         KQAPHZ
TCHL5C                     Z-ADD0         KQAPBN
TCHK5C                     WRITEKU#PP111
TCHK5C*
TCHK5C                     ENDDO
TCHK5C*
TCHK5C                     ENDSR
      *---------------------------------------------
TCHL5OAU#NP11 E                UP
TCHL5O                         AHZMM      2
TCHL5O                         ARECD      9
TCHL5O        EADD             WT
TCHL5O                         AHZMM      2
TCHL5O                         ARECD      9
** ERR
*KANBAN ERROR*
LOCATION ERROR
QTY. ERROR
PART NO. ERROR
DATE ERROR
ERROR(ID)
NOT 3-BOND
NOT SCANNED YET
SCANND TOO MANY
INVALID LABEL
NOT SCANNED YET
NOT APPROVED
NO ORDER DATA
ERROR(2D)
