     H            Y.                                    1
     H***ALDR2Z*****************************************************************
     H* NEW MATCHING SHIPPING SCAN (2 POINT)                                   *
     H*      ** ORIGINAL PGM IS ALDR2Y **                                      *
     H*          T.SAKAKI      06/27/2017                                      *
     H*                                                                        *
     H* MODIFICATION------------------------------                             *
%0001H*      01/19/2018  T.SAKAKI  HONDA LABEL OUTS SCAN                       *
JW1  H*      01/23/2018  J.W       ADD HONDA CUSTOMER 1602 (HONDA TRADING)     *
JW2  H*      04/27/2018  J.W       ADD SUB# FOR MESSAGE                        *
LC1  H*      10/15/2018  LEC       ADD SEQ# TO ERROR MESSAGES TO BE LOCKED     *
LC2  H*      07/31/2019  LEC       ADD NAMC TO TAB1 FOR GUANAJUATO PLNTKED     *
%0002H*      10/11/2019  T.SAKAKI  EXTEND ALDPP30                              *
LC3  H*      03.23.2020  LEC       EXTEND AB#PP65                              *
JW3  H*      09.04.2020  JW        ADD GDDPP06                                 *
JW3  H*      09.11.2020  JW        CHG CHAIN ALRPL05                           *
JW4  H*      09.28.2020  JW        CHK CHARTER STEEL(4640)                     *
JW5  H*      12.18.2020  JW        CHG LF ALRPL21 TO ALRPL21A                  *
.    H*                            CHG LF ALRPL22 TO ALRPL22A                  *
LC4  H*      04.09.2021  LEC       CHG FOR AIR EXPORT ORDERS...ORDER MATCHES   *
JW6  H*      04.29.2021  JW        CHK @@QTY=0 (SCANNED QTY)                   *
%0003H*      07.13.2021  T.SAKAKI  SCAN INSTORE KANBAN(APICS2)                 *
LC5  H*      07/29/2021  LEC       ADD NAMC TO TAB1 FOR MTMUS                  *
LC6  H*      05/23/2023  LEC       ADD LOGIC TO UPDATE SHP OVERFLOW FL         *
JW7  H*      08.28.2023  JW        ADD AB#PP70L (LOG FILE)                     *
LC7  H*      05.13.2024  LEC       ADD AL#PP21 TO REPLACE TAB1, TAB2           *
     H*      03.17.2025  LEC       ADD LOGIC FOR CHARTER STEEL MCH# S90        *
     H**************************************************************************
     FALDPW2Z CF  E                    WORKSTN
     FFCETL11 IF  E           K        DISK
     FGADPL15 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FALDPP20 O   E           K        DISK
TCHK7FALDPL20 IF  E           K        DISK
     FALDPP30 O   E           K        DISK
TCHKEFALDPL36 IF  E           K        DISK
TCHKEF            ALDPP301                          KRENAMEALDPL30R
TCHKEFAGDPL12 IF  E           K        DISK
     FALDPP50 O   E           K        DISK
TCHKLFALDPP96 IF  E           K        DISK
JW3  FGDGPP06 O   E           K        DISK
     FGDGPP05 O   E           K        DISK
TCHK FIICSD   IF  E           K        DISK                      A
     FAB#PL71 UF  E           K        DISK                      A
     FAB#PL70 IF  E           K        DISK
     F            AB#PP701                          KRENAMEAB#70R
      *
     FAFAPL82 IF  E           K        DISK
     FAAMPL11 IF  E           K        DISK
     FAB#PL15 IF  E           K        DISK
     FAB#PL13 IF  E           K        DISK
     FFCEPL60 IF  E           K        DISK
     FAB#PP65 UF  E           K        DISK                      A
     FAB#NP30 UF  E           K        DISK                      A
TCHKSFALDPL45 IF  E           K        DISK                      A
TCHKTFALDPP97 IF  E           K        DISK
TCHL5FAU#NP11 UF  F       9            DISK                      A
TCHL5FKU#PP11 O   E                    DISK                      A
TCHL5FGADPL11 IF  E           K        DISK
TCHLAFGTAPL11 UF  E           K        DISK
TCHLHFALDPP65 UF  E           K        DISK                      A
TCHLHF**AAPTL01 IF  E           K        DISK
     FAM#PP31 IF  E           K        DISK
     FGDGPL28 IF  E           K        DISK
     FNZUPL01 UF  E           K        DISK
     FNZUPL11 UF  E           K        DISK                      A
     FAB#PPDC IF  E           K        DISK
     FALDPP79 O   E           K        DISK                      A
     FALRPL05 IF  E           K        DISK
     FFCEPL07 IF  E           K        DISK
     F            FCEPP011                          KRENAMEFCEPL071
     FALDPP2X IF  E           K        DISK
JW4  F** ALRPL21 UF  E           K        DISK
"    F** ALRPL22 UF  E           K        DISK
JW5  FALRPL21AUF  E           K        DISK
"    FALRPL22AUF  E           K        DISK
     FCA#PL02 UF  E           K        DISK
     FCA#PP11 O   E           K        DISK
JW7  FAB#PP70LO   E           K        DISK
LC7  FAL#PP21 IF  E           K        DISK
     F**************************************************************************
TCHKTE**                  ERR     1  30 16
JW4  E                    ERR     1  40 25
     E                    SHP     1   2 12
TCHLIE**JW1               HND     1   7  4
JW1  E                    HND     1   8  4
     E                    WUSR        4  7               BACK KANBAN W/F
     E                    QTY         4  1               QTY
     E                    HON        20  1               HONDA BARCODE
     E                    HNO        20  1               HONDA PART
TCHLTE                    DEN        20  1               DENSO BARCODE
TCHLTE                    DNO        20  1               DENSO PART
     E                    BMN        15  4 0
     E                    AR11       10  1
     E                    AR12       10  1
TCHKSE                    QRA       120  1
TCHKSE                    Q20        20  1
     I**************************************************************************
     IFCEPL071
     I              A2GSKD                          A7GSKD
     I              A2GSYY                          A7GSYY
     I              A2GSMM                          A7GSMM
     I              A2GSDD                          A7GSDD
     I              A2GKYY                          A7GKYY
     I              A2GKMM                          A7GKMM
     I              A2GKDD                          A7GKDD
     I              A2GKJI                          A7GKJI
     I              A2GKHU                          A7GKHU
     I              A2GKNM                          A7GKNM
     I              A2BHB1                          A7BHB1
     I              A2BHB2                          A7BHB2
     I              A2BHB3                          A7BHB3
     I              A2MEK1                          A7MEK1
     I              A2MEK2                          A7MEK2
     I              A2MEK3                          A7MEK3
     I              A2MMEI                          A7MMEI
     I              A2SOZI                          A7SOZI
     I              A2SOZT                          A7SOZT
     I              A2KASI                          A7KASI
     I              A2KAST                          A7KAST
     I              A2AKI1                          A7AKI1
     I              A2SAIZ                          A7SAIZ
     I              A2ZATA                          A7ZATA
     I              A2KIKI                          A7KIKI
     I              A2ZAIR                          A7ZAIR
     I              A2ZAIC                          A7ZAIC
     I              A2ZANM                          A7ZANM
     I              A2KAZI                          A7KAZI
     I              A2KONU                          A7KONU
     I              A2SIRE                          A7SIRE
     I              A2UKER                          A7UKER
     I              A2TUSZ                          A7TUSZ
     I              A2AKI2                          A7AKI2
     I              A2BDAI                          A7BDAI
     I              A2BTIU                          A7BTIU
     I              A2BHIN                          A7BHIN
     I              A2SMEI                          A7SMEI
     I              A2TMEI                          A7TMEI
     I              A2DMEI                          A7DMEI
     I              A2KUBI                          A7KUBI
     I              A2KSYS                          A7KSYS
     I              A2KSYT                          A7KSYT
     I              A2SSYS                          A7SSYS
     I              A2SSYT                          A7SSYT
     I              A2SYYY                          A7SYYY
     I              A2SYMM                          A7SYMM
     I              A2SYDD                          A7SYDD
     I              A2KTRK                          A7KTRK
     I              A2KTRT                          A7KTRT
     I              A2KTRR                          A7KTRR
     I              A2KTRD                          A7KTRD
     I              A2STRK                          A7STRK
     I              A2STRT                          A7STRT
     I              A2STRR                          A7STRR
     I              A2STRD                          A7STRD
     I              A2TRYY                          A7TRYY
     I              A2TRMM                          A7TRMM
     I              A2TRDD                          A7TRDD
     I              A2GEKN                          A7GEKN
     I              A21HB5                          A71HB5
     I              A22HB5                          A72HB5
     I              A23HB2                          A73HB2
     I              A2SYK1                          A7SYK1
     I              A24HB5                          A74HB5
     I              A25HB5                          A75HB5
     I              A26HB2                          A76HB2
     I              A2SYK2                          A7SYK2
     I              A27HB5                          A77HB5
     I              A28HB5                          A78HB5
     I              A29HB2                          A79HB2
     I              A2SYK3                          A7SYK3
     I              A210H5                          A710H5
     I              A211H5                          A711H5
     I              A212H2                          A712H2
     I              A2SYK4                          A7SYK4
     I              A2YOUS                          A7YOUS
     I              A2TRHK                          A7TRHK
     I              A2TRHT                          A7TRHT
     I              A2TANA                          A7TANA
     I              A2YOUK                          A7YOUK
     I              A2MAZH                          A7MAZH
     I              A2KOT1                          A7KOT1
     I              A2KBM1                          A7KBM1
     I              A2KOT2                          A7KOT2
     I              A2KBM2                          A7KBM2
     I              A2KOT3                          A7KOT3
     I              A2KBM3                          A7KBM3
     I              A2KOT4                          A7KOT4
     I              A2KBM4                          A7KBM4
     I              A2KOT5                          A7KOT5
     I              A2KBM5                          A7KBM5
     I              A2KOT6                          A7KOT6
     I              A2KBM6                          A7KBM6
     I              A2KOT7                          A7KOT7
     I              A2KBM7                          A7KBM7
     I              A2KOT8                          A7KOT8
     I              A2KBM8                          A7KBM8
     I              A2KOT9                          A7KOT9
     I              A2KBM9                          A7KBM9
     I              A2KO10                          A7KO10
     I              A2KB10                          A7KB10
     I              A2KO11                          A7KO11
     I              A2KB11                          A7KB11
     I              A2KO12                          A7KO12
     I              A2KB12                          A7KB12
     I              A2KO13                          A7KO13
     I              A2KB13                          A7KB13
     I              A2KO14                          A7KO14
     I              A2KB14                          A7KB14
     I              A2KO15                          A7KO15
     I              A2KB15                          A7KB15
     I              A2ZETI                          A7ZETI
     I              A2TEHI                          A7TEHI
     I              A2SEHI                          A7SEHI
     I              A2TAYY                          A7TAYY
     I              A2TAMM                          A7TAMM
     I              A2TADD                          A7TADD
     I              A2UTYY                          A7UTYY
     I              A2UTMM                          A7UTMM
     I              A2UTDD                          A7UTDD
     I              A2SHYY                          A7SHYY
     I              A2SHMM                          A7SHMM
     I              A2SHDD                          A7SHDD
     I              A2KTYY                          A7KTYY
     I              A2KTMM                          A7KTMM
     I              A2KTDD                          A7KTDD
     I              A2BOYY                          A7BOYY
     I              A2BOMM                          A7BOMM
     I              A2BODD                          A7BODD
     I              A2GEYY                          A7GEYY
     I              A2GEMM                          A7GEMM
     I              A2GEDD                          A7GEDD
     I              A2ZAYY                          A7ZAYY
     I              A2ZAMM                          A7ZAMM
     I              A2ZADD                          A7ZADD
     I              A2KZYY                          A7KZYY
     I              A2KZMM                          A7KZMM
     I              A2KZDD                          A7KZDD
     I              A2KOYY                          A7KOYY
     I              A2KOMM                          A7KOMM
     I              A2KODD                          A7KODD
     I              A2BSYY                          A7BSYY
     I              A2BSMM                          A7BSMM
     I              A2BSDD                          A7BSDD
     I              A2SIYY                          A7SIYY
     I              A2SIMM                          A7SIMM
     I              A2SIDD                          A7SIDD
     I              A2RED1                          A7RED1
     I              A2RED2                          A7RED2
     I              A2RED3                          A7RED3
     I              A2RED4                          A7RED4
     I              A2RED5                          A7RED5
     I              A2RED6                          A7RED6
     I              A2RED7                          A7RED7
     I              A2RED8                          A7RED8
     I              A2AK11                          A7AK11
     I              A2AK21                          A7AK21
     I              A2AK31                          A7AK31
     I              A2AK12                          A7AK12
     I              A2AK22                          A7AK22
     I              A2AK32                          A7AK32
     I              A2AK13                          A7AK13
     I              A2AK23                          A7AK23
     I              A2AKI                           A7AKI
TCHL5IAU#NP11 AA  70
TCHL5I                                        1   20AHZMM
TCHL5I                                        3   90ARECD
      * 2D KANBAN
     I            DS
     I            DS
     I                                        1 250 B2D
     I                                        1  25 BAR01
     I                                       26  50 BAR02
     I                                       51  75 BAR03
     I                                       76 100 BAR04
     I                                      101 125 BAR05
     I                                      126 150 BAR06
     I                                      151 175 BAR07
     I                                      176 200 BAR08
     I                                      201 225 BAR09
     I                                      226 250 BAR10
      *
      * 2D KANBAN
     I            DS
     I                                        1 250 W2D
     I                                        1  18 BARCD0
     I                                        1   1 CTYPE
     I                                        2  16 TXT1
     I                                       17  31 TXT2
     I                                       32  36 SUPP
     I                                       37  38 DCCOD
     I                                       39  42 SBAN
     I                                       43  54 PART
     I                                       55  64 LNAD
     I                                       65  74 STAD
     I                                       75  79 LOTS
     I                                       80  99 SUPNM
     I                                      100 108 MAINR
     I                                      109 117 SUBR
     I                                      118 125 UNDAT
     I                                      126 133 SHDT
     I                                      134 139 SHTM
     I                                      140 151 ORNO
     I                                      152 155 BXNBR
     I                                      156 159 BXTOT
     I                                      160 164 DEST
     I                                      162 164 TOYEXP
     I                                       19 250 FILR
     I            DS
     I                                        1   9 @9
     I                                        1   4 XCUST
     I                                        5   5 XFACT
     I                                        6   9 XSHTO
     I            DS
     I                                        1   9 C2@9
     I                                        1   40C2TOKU
     I                                        5   5 C2NKOJ
     I                                        6   90C2NONY
     I* LOCATION
     I            DS
     I                                        1 250 LOC
     I                                        1  25 LAR01
     I                                       26  50 LAR02
     I                                       51  75 LAR03
     I                                       76 100 LAR04
     I                                      101 125 LAR05
     I                                      126 150 LAR06
     I                                      151 175 LAR07
     I                                      176 200 LAR08
     I                                      201 225 LAR09
     I                                      226 250 LAR10
     I                                        1   8 BARLOC
     I                                        1   7 BARCC6
     I                                        1   4 IDNO6
     I                                        8   8 CHKD6
     I                                        9 250 LOCX
     I                                        1   4 BBLOCZ
     I                                        5   5 BBLOC1
     I                                        6   7 BBLOC2
     I                                        8   9 BBLOC3
     I                                       10  10 BBLOC4
%0001I* SHORTAGE LABEL FOR SHORTAGE SCAN
     I            DS
     I                                        1 250 OUTS
     I                                        1  25 OSR01
%0001I                                        5   5 OSRHN
     I                                       26  50 OSR02
     I                                       51  75 OSR03
     I                                       76 100 OSR04
     I                                      101 125 OSR05
     I                                      126 150 OSR06
     I                                      151 175 OSR07
     I                                      176 200 OSR08
     I                                      201 225 OSR09
     I                                      226 250 OSR10
%0001I* SHORTAGE AIAG LABEL FOR HONDA CHECK
     I            DS
     I                                        1 250 HOUTS
%0001I                                        5   5 HSRHN
     I* A-PICS,KOUTEI,IAF
     I            DS
     I                                        1 250 AKAN
     I                                        1  25 AAR01
     I                                       26  50 AAR02
     I                                       51  75 AAR03
     I                                       76 100 AAR04
     I                                      101 125 AAR05
     I                                      126 150 AAR06
     I                                      151 175 AAR07
     I                                      176 200 AAR08
     I                                      201 225 AAR09
     I                                      226 250 AAR10
   T3I                                        1  17 BARKAX
     I                                        1  15 BARKAN
     I                                        1  16 IIAF
     I                                        1  14 IAPICS
     I                                        1   1 BARKBN
     I                                        2   5 IDNO7
     I                                        6   8 POS
     I                                       15  15 CHKD8
     I                                       17  17 CHKD7
     I                                       16  17 NODGT
%3   I                                        1   3 BARQR
JW4  I                                        7  10 QRZT
"    I                                        1 256 @@BAR1
     I            DS
     I                                        1   80EKDATE
     I                                        1   40EKKOYY
     I                                        5   60EKKOMM
     I                                        7   80EKKODD
     I            DS
     I                                        1 250 HKAN
     I                                        1  25 HAR01
     I                                       26  50 HAR02
     I                                       51  75 HAR03
     I                                       76 100 HAR04
     I                                      101 125 HAR05
     I                                      126 150 HAR06
     I                                      151 175 HAR07
     I                                      176 200 HAR08
     I                                      201 225 HAR09
     I                                      226 250 HAR10
     I                                        1  19 BARHON
     I            DS
     I                                        1 250 DKAN
     I                                        1  25 DAR01
     I                                       26  50 DAR02
     I                                       51  75 DAR03
     I                                       76 100 DAR04
     I                                      101 125 DAR05
     I                                      126 150 DAR06
     I                                      151 175 DAR07
     I                                      176 200 DAR08
     I                                      201 225 DAR09
     I                                      226 250 DAR10
TCHLTI*                                       1  14 BARDEN
TCHLTI                                        1  20 BARDEN
     I                                        2  11 NALP
     I* SYSTEM DATE(8 DIGITS) FOR FIRST SCREEN
     I            DS
     I                                        1   80WSDATE
     I                                        1   4 WSYYYY
     I                                        5   6 WSMM
     I                                        7   8 WSDD
     I                                        1   8 WSDAT
JW3  I            DS
 "   I                                        1  140SDATE
 "   I                                        1   60NOW
 "   I                                        7  140TODAY
     I* SHIPPING DATE(8 DIGITS)
     I            DS
     I                                        1   80SHIPD
     I                                        1   20SYY12
     I                                        1   40SYY
     I                                        5   60SMM
     I                                        7   80SDD
     I                                        1   80SHIPDC
     I* ACCOMMODATED QTY. CHANGE DATE(8 DIGITS)
     I            DS
     I                                        1   80WQDATE
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
     I            DS
     I                                        1   80W7DATE
     I                                        1   40A7SYYY
     I                                        5   60A7SYMM
     I                                        7   80A7SYDD
     I* LOCATION CHANGE DATE(8 DIGITS)
     I            DS
     I                                        1   80WLDATE
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
TCHK8I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
TCHK8I                                        1   40WSSTM4
TCHK8I                                        1   60WSSTM6
TCHK8I                                        7  140WSSDAT
     I* OUT-GOING TRACK DATA FILE(IAF) ALDPP20
     I* KANBAN TYPE,ABSOLUTE#,ORDER#,SEHIN KUBUN,LOT#
     I            DS
     I                                        1  16 WIAF
     I                                        1   1 A1KANS
     I                                        2   5 A1ZETI
     I                                        6  11 A1ORDR
     I                                       12  12 A1SEHI
     I                                       13  160A1LOTN
     I* OUT-GOING TRACK DATA FILE(A-PICS) ALDPP30
     I* KANBAN TYPE,ABSOLUTE#,TEHI#,PAGE#,2ND WORK TIME,OBJ TYPE,YUKO,BOX
     I            DS
     I                                        1  20 A3APBC
     I                                        1  14 WAPICS
     I                                        1   1 A3KANS
     I                                        2   5 A3ZETI
     I                                        6   8 A3TEHI
     I                                        9  10 A3PAGE
     I                                       11  11 A32KAK
     I                                       12  12 A3TASY
     I                                       13  13 A3YUKO
     I                                       14  14 A3HASY
     I                                       15  15 A3CHKD
     I* FCEPL01 (KEY)
     I            DS
     I                                        1  12 WKPNO
     I                                        1   5 K11
     I                                        6  10 K12
     I                                       11  12 K13
     I            DS
     I                                        1  60 BMN
     I                                        1   40CKBM01
     I                                        5   80CKBM02
     I                                        9  120CKBM03
     I                                       13  160CKBM04
     I                                       17  200CKBM05
     I                                       21  240CKBM06
     I                                       25  280CKBM07
     I                                       29  320CKBM08
     I                                       33  360CKBM09
     I                                       37  400CKBM10
     I                                       41  440CKBM11
     I                                       45  480CKBM12
     I                                       49  520CKBM13
     I                                       53  560CKBM14
     I                                       57  600CKBM15
     I            DS
     I                                        1  20 EKMHIN
     I                                        1   5 EKMHN1
     I                                        6  10 EKMHN2
     I                                       11  15 EKMHN3
     I                                       16  20 EKMHN4
     I            DS
     I                                        1   80K@NYMD
     I                                        1   40K@NOYY
     I                                        5   60K@NOMM
     I                                        7   80K@NODD
     I            DS
     I                                        1  20 K@MHIN
     I                                        1   5 K@MHN1
     I                                        6  10 K@MHN2
     I                                       11  15 K@MHN3
     I                                       16  20 K@MHN4
     I            DS
     I                                        1  20 @@MHIN
     I                                        1   5 @MHN1
     I                                        6  10 @MHN2
     I                                       11  15 @MHN3
     I                                       16  20 @MHN4
     I                                        1  10 @MHN10
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
TCHK I            DS
TCHK I                                        1  140DTTM
TCHK I                                        1   60DTIM
TCHK I                                        7  140DDAT
TCHK1I            DS
TCHK1I                                        1  18 W#BC1
TCHK1I                                        1   4 W#BC11
TCHK1I                                        5   5 W#BC12
TCHK1I                                        6  18 W#BC13
TCHK1I            DS
TCHK1I                                        1  18 W#BC2
TCHK1I                                        1   4 W#BC21
TCHK1I                                        5   5 W#BC22
TCHK1I                                        6  18 W#BC23
TCHKEI            DS
TCHKEI                                        1   80W@L7DT
TCHKEI                                        1   40W@L7YY
TCHKEI                                        5   60W@L7MM
TCHKEI                                        7   80W@L7DD
TCHKS * QSS QR CODE
TCHKSI            DS
TCHKSI                                        1 250 QRC
TCHKSI                                        1  25 QRC01
TCHKSI                                       26  50 QRC02
TCHKSI                                       51  75 QRC03
TCHKSI                                       76 100 QRC04
TCHKSI                                      101 125 QRC05
TCHKSI                                      126 150 QRC06
TCHKSI                                      151 175 QRC07
TCHKSI                                      176 200 QRC08
TCHKSI                                      201 225 QRC09
TCHKSI                                      226 250 QRC10
TCHKSI            DS
TCHKSI                                        1  10 W@NYMD
TCHKSI                                        1   2 W@NOMM
TCHKSI                                        3   3 W@NOS1
TCHKSI                                        4   5 W@NODD
TCHKSI                                        6   6 W@NOS2
TCHKSI                                        7  10 W@NOYY
TCHKSI            DS
TCHKSI                                        1  20 W@MHIN
TCHKSI                                        1   5 W@MHN1
TCHKSI                                        6  10 W@MHN2
TCHKSI                                       11  15 W@MHN3
TCHKSI                                       16  20 W@MHN4
TCHL5I            DS
TCHL5I                                        1   80EKNODT
TCHL5I                                        1   40EKNOYY
TCHL5I                                        5   60EKNOMM
TCHL5I                                        7   80EKNODD
%0001I            DS
     I                                        1   80BANODT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
TCHL5I            DS
TCHL5I                                        1   80A2GSHZ
TCHL5I                                        1   40A2GSYY
TCHL5I                                        5   60A2GSMM
TCHL5I                                        7   80A2GSDD
TCHLAI            DS
TCHLAI                                        1   9 ACZOD#
TCHLAI                                        1   3 ACZOD1
TCHLAI                                        4   50ACZOD2
TCHLAI                                        6   70ACZOD3
TCHLAI                                        8   9 ACZOD4
TCHLKI            DS
TCHLKI                                        1   7 ACZKAN
TCHLKI                                        1   4 ACZKA1
TCHLKI                                        5   7 ACZKA2
TCHLHI            DS
TCHLHI                                        1   6 W@LOC
TCHLHI                                        1   1 W@LOC1
TCHLHI                                        2   3 W@LOC2
TCHLHI                                        4   5 W@LOC3
TCHLHI                                        6   6 W@LOC4
      *
     I            DS
     I                                        1  100CKHZ01
     I                                        1   80CKHZ
     I            DS
     I                                        1   80IEYMD
     I                                        1   40IESKOY
     I                                        5   60IESKOM
     I                                        7   80IESKOD
      *
     C**************************************************************************
     C*  ENTRY LIST
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6        CODE
     C                     PARM           WUSRID 20        NAME
     C**************************************************************************
     C*  PARAMTER LIST
     C**************************************************************************
      * ALDR2V
     C           P#CALL    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 20
     C* BBHR50
     C           P1        PLIST
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           PMHIN  20
     C                     PARM           PSHIN  12
     C                     PARM           PFLG    1
      * ALBRCC
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
     C**************************************************************************
     C*  KEY LIST
     C**************************************************************************
     C           KEY1      KLIST
     C                     KFLD           K11
     C                     KFLD           K12
     C                     KFLD           K13
      * FOR 3-BOND CHECK
     C           K#KEY     KLIST
     C                     KFLD           A3KANS
     C                     KFLD           A3ZETI
     C                     KFLD           A3TEHI
     C                     KFLD           A3PAGE
      *
     C           K#KEY1    KLIST
     C                     KFLD           A7BHB1
     C                     KFLD           A7BHB2
     C                     KFLD           A7BHB3
      *
     C           K#AB15    KLIST
     C                     KFLD           EKTOKU
     C                     KFLD           @@NONY  40
     C                     KFLD           EKNKOJ
     C                     KFLD           EKNUKE
     C                     KFLD           EKMHN1
     C                     KFLD           EKMHN2
     C                     KFLD           EKMHN3
     C                     KFLD           EKMHN4
     C                     KFLD           EKODRN
     C                     KFLD           EKNOYY
     C                     KFLD           EKNOMM
     C                     KFLD           EKNODD
     C                     KFLD           @@NOBN  20
     C                     KFLD           EKRLYY
     C                     KFLD           EKRLMM
     C                     KFLD           EKRLDD
      *
     C           K#15      KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           @@NONY  40
     C                     KFLD           K@NKOJ
     C                     KFLD           K@NUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
     C                     KFLD           K@ODRN
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
      *
     C           K#13      KLIST
     C                     KFLD           @@NONY  40
     C                     KFLD           K@NOYY
     C                     KFLD           K@NOMM
     C                     KFLD           K@NODD
     C                     KFLD           K@NUKE
     C                     KFLD           K@MHN1
     C                     KFLD           K@MHN2
     C                     KFLD           K@MHN3
     C                     KFLD           K@MHN4
      *
     C           K#AP70    KLIST
     C                     KFLD           BATOKU
     C                     KFLD           WWNONY  4
     C                     KFLD           BANKOJ
     C                     KFLD           BANUKE
     C                     KFLD           BAMHN1
     C                     KFLD           BAMHN2
     C                     KFLD           BAMHN3
     C                     KFLD           BAMHN4
     C**                   KFLD           BAODRN
JW6  C                     KFLD           XXODRN 10
     C                     KFLD           BANOYY
     C                     KFLD           BANOMM
     C                     KFLD           BANODD
     C                     KFLD           WWNOBN  2
     C                     KFLD           BADEYY
     C                     KFLD           BADEMM
     C                     KFLD           BADEDD
      *
     C           K#FC6     KLIST
     C                     KFLD           EKSHN1
     C                     KFLD           EKSHN2
     C                     KFLD           EKSHN3
     C                     KFLD           EKTOKU
      *
     C           K#FC6X    KLIST
     C                     KFLD           K11
     C                     KFLD           K12
     C                     KFLD           K13
     C                     KFLD           K@TOKU
      *
     C           K#65      KLIST
     C                     KFLD           K@DEST  5
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@ORNO 12
     C                     KFLD           K@KANO  4
     C                     KFLD           K@BOXN  4
      *
     C           K#A7      KLIST
     C                     KFLD           K@ZETI  4
      *
     C           K#X1      KLIST
     C                     KFLD           K@SH11  5
     C                     KFLD           K@SH12  5
     C                     KFLD           K@SH13  2
     C                     KFLD           K@SH21  5
     C                     KFLD           K@SH22  5
     C                     KFLD           K@SH23  2
      *
%0003C           K#CA      KLIST
     C                     KFLD           K@ZETI  4
     C                     KFLD           K@THNO  3
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'01'      @SCRN1           AIAJ LABEL
     C           @@ID      CASEQ'02'      @SCRN2           LOCATION
     C           @@ID      CASEQ'03'      @SCRN3           APCS/ASJ
     C           @@ID      CASEQ'04'      @SCRN4           HONDA
     C           @@ID      CASEQ'05'      @SCRN5           DESNO
TCHKSC           @@ID      CASEQ'06'      @SCRN6           QSS QR
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*                    @INT
     C**************************************************************************
     C           *INZSR    BEGSR
      *
     C                     Z-ADD2255      K@SUPP  40
     C*  WORK FIELD
     C                     MOVEL*ALL'0'   WCLR   10        WORK FLG CLR
     C                     MOVEL*ALL'0'   WBBK2  12        WORK FLG CLR
     C                     MOVEAWCLR      *IN,30
     C                     MOVEL*BLANK    MSG
     C           120       SUB  TOTAL     EMPTY
     C                     Z-ADD120       GTOTL
     C                     MOVEL*BLANK    WUSR
     C                     Z-ADD*ZERO     I       20       KBN INDEX
     C                     Z-ADD*ZERO     M       20       CUL
     C                     Z-ADD*ZERO     L       20       TBL INDEX
     C                     Z-ADD*ZERO     X       20       TBL INDEX
     C                     Z-ADD*ZERO     WQTY2   40       FPR HEX CAL WORK
     C                     Z-ADD*ZERO     WQTY3   40       FPR HEX CAL WORK
     C                     Z-ADD*ZERO     WSISU   40       SISUU
     C*
     C                     Z-ADD*DATE     WSDATE
     C                     Z-ADD*DATE     SHIPD
     C                     MOVE '01'      @@ID    2
JW3  C                     TIME           SDATE
     C*
TCHKEC*
TCHKEC           K#GDPL    KLIST
TCHKEC                     KFLD           WSSYYY
TCHKEC                     KFLD           WSSMMM
TCHKEC                     KFLD           WSSDDD
TCHKEC                     TIME           WSDT
TCHKEC                     Z-ADDWSSDAT    W@L7DT
TCHKEC           K#GDPL    SETLLAGDPL12
TCHKEC                     DO   7
TCHKEC                     READPAGDPL12                  96
TCHKEC   96                LEAVE
TCHKEC                     Z-ADDF8KAYY    W@L7YY
TCHKEC                     Z-ADDF8KAMM    W@L7MM
TCHKEC                     Z-ADDF8KADD    W@L7DD
TCHKEC                     ENDDO
TCHKEC*
TCHKLC                     MOVEL*BLANK    MSG@2
TCHKLC*
     C                     ENDSR
     C**************************************************************************
     C           @SCRN1    BEGSR
     C**************************************************************************
      * 2-D
     C                     EXFMTDSP01                      E-KANBAN
     C*
     C                     SELEC
     C           *INKB     WHEQ *ON
     C                     CALL 'AB#RAM'
     C           *INKD     WHEQ *ON
     C                     EXSR #TOT
     C                     EXFMTDSP96
     C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@ID
     C                     ENDIF
      *
     C           *INKE     WHEQ *ON
     C                     CALL 'ALDR2V'  P#CALL
      *
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
TCHLHC           *INKG     WHEQ *ON
TCHLHC                     EXSR @OUTST
TCHLHC           *IN30     IFEQ *OFF
TCHLHC                     CLEARDSP01
TCHLHC                     CLEARDSP02
TCHLHC                     CLEARDSP03
TCHLHC                     MOVE '01'      @@ID
TCHLHC                     END
     C                     OTHER
TCH15C                     MOVE '1'       @HONF   1
     C                     EXSR @CHK1
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    B2D
     C                     ELSE
     C                     MOVE *BLANK    LOC
     C                     MOVE '03'      @@ID
     C                     ENDIF
     C                     ENDSL
      *  HONDA SECOND LABEL (B)
TCHLIC           W@HND     IFEQ *ON
     C*
     C                     MOVE '01'      @@ID
     C*
     C                     MOVE *BLANK    B2D
     C                     EXFMTDSP01                      E-KANBAN
     C*
     C                     SELEC
     C           *INKB     WHEQ *ON
     C                     CALL 'AB#RAM'
     C           *INKD     WHEQ *ON
     C                     EXSR #TOT
     C                     EXFMTDSP96
     C           *INKC     IFEQ *ON
     C                     MOVE '99'      @@ID
     C                     ENDIF
      *
     C           *INKE     WHEQ *ON
     C                     CALL 'ALDR2V'  P#CALL
      *
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     MOVE '2'       @HONF   1
     C                     EXSR @CHK1
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    B2D
     C                     ELSE
     C                     MOVE *BLANK    LOC
     C                     MOVE '03'      @@ID
     C                     ENDIF
  |  C                     ENDSL
TCH15C                     ENDIF
     C                     ENDSR
      *----------------------------------------------
     C           @CHK1     BEGSR
      *----------------------------------------------
     C                     SETOF                     3033
     C                     MOVE *BLANK    MSG
      *
B0   C           B2D       IFEQ *BLANK
     C                     SETON                     3033
     C**                   MOVELERR,14    MSG
JW4  C                     MOVELERR,31    MSG
JW2  C**                   MOVE '01'      MSG
     C                     MOVE '14'      A5ERID
     C                     SETON                     3033
     C                     GOTO #CHK1
E0   C                     ENDIF
      *
     C                     MOVELB2D       W2D
     C                     MOVELB2D       WWBRCD 18
      *
B0   C           FILR      IFEQ *BLANK
     C                     EXSR @CHK11
     C                     MOVE '1'       @D      1
     C                     ELSE
      *   toyota export label...
     C           TOYEXP    IFEQ 'EXP'
     C                     EXSR @CHK13
     C                     MOVE '2'       @D
     C                     ELSE
     C                     EXSR @CHK12
     C                     MOVE '2'       @D      1
     C                     ENDIF
E0   C                     ENDIF
      *
B0   C           *IN30     IFEQ *ON
     C                     MOVE '01'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
E0   C                     ENDIF
      * SAVE 1ST BARCD
     C           @HONF     IFEQ '1'
     C                     MOVE BARCD0    BARSAV 18
     C                     ENDIF
      *
TCH15C           @HONF     IFEQ '2'
   | C           BARSAV    IFEQ BAR01
     C                     SETON                     3033
     C                     MOVELERR,15    MSG
     C                     MOVE '15'      A5ERID
     C                     SETON                     3033
     C                     GOTO #CHK1
TCHK1C*
TCHK1C                     ELSE
TCHK1C                     MOVELBARSAV    W#BC1
TCHK1C                     MOVELBAR01     W#BC2
TCHK1C           W#BC11    IFNE W#BC21
TCHK1C           W#BC13    ORNE W#BC23
TCHK1C                     MOVELERR,16    MSG
TCHK1C                     MOVE '16'      A5ERID
TCHK1C                     SETON                     3033
TCHK1C                     GOTO #CHK1
TCHK1C                     END
TCHK1C*
   | C                     ENDIF
TCH15C                     ENDIF
      *
     C           #CHK1     ENDSR
      *----------------------------------------------
     C           @CHK13    BEGSR
      *----------------------------------------------
      *
      * take dock from 2D barcode and get cust, delv codes
     C                     MOVELDCCOD     ADDOCK    P
     C                     MOVE *BLANKS   WKPNO
     C           ADDOCK    CHAINAB#PPDC              91
     C           *IN91     IFEQ *OFF
      *
      * take user part id and get internal part id and location.
     C                     MOVELADTOKU    PTOKU
     C                     MOVELADNONY    PNONY
     C                     MOVEL' '       PNKOJ
     C                     MOVEL'    '    PNUKE
     C                     MOVELPART      PMHIN
     C                     CALL 'BBHR50'  P1
      *
     C                     MOVE PSHIN     WKPNO
      *
      * get invoice number from 2D barcode Order Number.
      *    for these toyota export labels the first 3 chars are ignored and the
      *    next 5 chars are the invoice number.
     C           5         SUBSTORNO:4    @@INVN    P
      *
     C                     MOVELADNONY    @@NONY
     C                     MOVE SHDT      K@NYMD
     C                     MOVELDCCOD     K@NUKE
     C                     MOVEL*BLANK    K@MHIN
     C                     MOVELPART      K@MHIN    P
      *
     C                     ENDIF
      *
      *    find the invoice number in the order file...to get the correct
      *     order number and bin number.
     C           K#13      SETLLAB#PL13
     C           *IN92     DOUEQ*ON
     C           K#13      READEAB#PL13                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           5         SUBSTBAINVN:1  @INV13  5
     C           @INV13    IFEQ @@INVN
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBAODRN    ORNO      P
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
      *     if order not found, check for full order# (for AIR exports)
     C           *IN92     IFEQ *ON
     C                     MOVE *OFF      *IN92
     C           K#13      SETLLAB#PL13
     C           *IN92     DOUEQ*ON
     C           K#13      READEAB#PL13                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           ORNO      IFEQ BAINVN
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBAODRN    ORNO      P
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN92     IFEQ *ON
     C                     MOVELERR,13    MSG
JW1  C                     MOVE '01'      MSG
      *
     C                     MOVE '13'      A5ERID
     C                     SETON                     3330
     C                     GOTO #CHK13
     C                     ENDIF
      *
     C           KEY1      CHAINFCEPL01              91
     C           *IN91     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     MOVEL*BLANK    W@LOC
     C                     MOVELERR,4     MSG
JW2  C                     MOVE '01'      MSG
     C                     MOVE '04'      A5ERID
     C                     GOTO #CHK13
     C                     ELSE
     C           WLDATE    IFGE *DATE
     C                     MOVE A2KTRK    W@LOC1
     C                     MOVE A2KTRT    W@LOC2
     C                     MOVE A2KTRR    W@LOC3
     C                     MOVE A2KTRD    W@LOC4
     C                     ELSE
     C                     MOVE A2STRK    W@LOC1
     C                     MOVE A2STRT    W@LOC2
     C                     MOVE A2STRR    W@LOC3
     C                     MOVE A2STRD    W@LOC4
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVE ADTOKU    K@TOKU
     C           K#FC6X    CHAINFCEPL60              91
     C           *IN91     IFEQ *OFF
     C           F6APDT    IFEQ *ZERO
     C           F6APDT    ORGT *DATE
     C                     MOVELERR,12    MSG
JW2  C                     MOVE '01'      MSG
      *
     C                     MOVE '12'      A5ERID
     C                     SETON                     3330
     C                     GOTO #CHK13
     C                     ENDIF
     C                     ENDIF
      *
     C                     MOVELDEST      K@DEST
     C                     MOVELDCCOD     K@NUKE
     C                     MOVELORNO      K@ORNO
     C                     MOVELSBAN      K@KANO
     C                     MOVELBXNBR     K@BOXN
     C                     MOVELADTOKU    K@TOKU
     C                     MOVELADNKOJ    K@NKOJ
     C                     MOVELADNONY    @@NONY
     C                     MOVELORNO      K@ODRN
     C                     MOVE SHDT      K@NYMD
     C                     MOVELSHTM      @SHTM
     C                     MOVEL*BLANK    K@MHIN
     C                     MOVELPART      K@MHIN
      *
     C           #CHK13    ENDSR
      *----------------------------------------------
     C           @CHK12    BEGSR
      *----------------------------------------------
TCHKDC                     MOVEL*BLANK    @9
     C                     MOVELDEST      K@DEST  5
     C                     MOVELDCCOD     K@NUKE  4
     C                     MOVELORNO      K@ORNO 12
     C                     MOVELSBAN      K@KANO  4
     C                     MOVELBXNBR     K@BOXN  4
     C           K#65      SETLLAB#PP65              90
     C           *IN90     DOUEQ*ON
     C           K#65      READEAB#PP65             N    90
     C           *IN90     IFEQ *OFF
     C           A6SKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN90     IFEQ *OFF
     C                     SETON                     3033
     C                     MOVELERR,8     MSG
JW2  C                     MOVE '01'      MSG
      *
     C                     MOVE '08'      A5ERID
     C                     GOTO #CHK12
     C                     ENDIF
      *
      ***********************************************************
      *  LOKUP TAB1 WAS HERE AND REPLACED WITH CODE BELOW
      ***********************************************************
     C           DEST      CHAINAL#PP21              10
     C           *IN10     IFEQ *ON
     C                     MOVELERR,10    MSG
     C                     MOVE '01'      MSG
      *
     C                     MOVE '10'      A5ERID
     C                     SETON                     3033
     C                     GOTO #CHK12
     C                     ENDIF
      *
     C                     MOVELC2@9      @9
     C                     MOVE XCUST     K@TOKU  40
     C                     MOVE XFACT     K@NKOJ  1
     C                     MOVE XSHTO     @@NONY
      *
      *
      ************************************************************
     C                     MOVELDCCOD     K@NUKE  4
     C                     MOVELORNO      K@ODRN 10
     C                     MOVELORNO      @@INVN 16
     C                     MOVE SHDT      K@NYMD
     C                     MOVELSHTM      @SHTM   40
     C                     MOVEL*BLANK    K@MHIN
     C                     MOVELPART      K@MHIN
      *
     C           K#15      SETLLAB#PL15
     C           *IN92     DOUEQ*ON
     C           K#15      READEAB#PL15                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBASHN1    K11
     C                     MOVELBASHN2    K12
     C                     MOVELBASHN3    K13
     C                     MOVELBAMHIN    @@MHIN 20
     C                     MOVELBAODRN    @@2     2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN92     IFEQ *ON
     C           K#13      SETLLAB#PL13
     C           *IN92     DOUEQ*ON
     C           K#13      READEAB#PL13                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    ANDEQ@@INVN
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBASHN1    K11
     C                     MOVELBASHN2    K12
     C                     MOVELBASHN3    K13
     C                     MOVELBAMHIN    @@MHIN 20
     C                     MOVELBAODRN    @@2     2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN92     IFEQ *ON
     C                     MOVELERR,13    MSG
JW1  C                     MOVE '02'      MSG
      *
     C                     MOVE '13'      A5ERID
     C                     SETON                     3330
     C                     GOTO #CHK12
     C                     ENDIF
      *
     C           KEY1      CHAINFCEPL01              91
TCHLLC           *IN91     IFEQ *ON
TCHLLC           A2GSKD    ORNE *BLANK
TCHLLC                     MOVEL*BLANK    W@LOC
TCHLLC                     ELSE
TCHLLC           K@NYMD    IFLT WLDATE
TCHLLC                     MOVE A2KTRK    W@LOC1
TCHLLC                     MOVE A2KTRT    W@LOC2
TCHLLC                     MOVE A2KTRR    W@LOC3
TCHLLC                     MOVE A2KTRD    W@LOC4
TCHLLC                     ELSE
TCHLLC                     MOVE A2STRK    W@LOC1
TCHLLC                     MOVE A2STRT    W@LOC2
TCHLLC                     MOVE A2STRR    W@LOC3
TCHLLC                     MOVE A2STRD    W@LOC4
TCHLLC                     END
TCHLLC                     END
      *
     C           K#FC6X    CHAINFCEPL60              91
     C           *IN91     IFEQ *OFF
     C           F6APDT    IFEQ *ZERO
     C           F6APDT    ORGT *DATE
     C                     MOVELERR,12    MSG
JW2  C                     MOVE '02'      MSG
      *
     C                     MOVE '12'      A5ERID
     C                     SETON                     3330
     C                     ENDIF
     C                     ENDIF
      *
      *
     C           #CHK12    ENDSR
      *----------------------------------------------
     C           @CHK11    BEGSR
      *----------------------------------------------
     C           BARCD0    SETLLAB#PL71
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEAB#PL71             N    90
     C           *IN90     IFEQ *OFF
     C           EKSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C           EKDEYY    IFNE *ZERO
     C                     SETON                     3033
     C                     MOVELERR,8     MSG
JW2  C                     MOVE '02'      MSG
      *
     C                     MOVE '08'      A5ERID
     C                     GOTO #CHK11
     C                     ELSE
TCHLIC                     MOVELEKTOKU    CUSTOM  4
TCHLIC                     MOVEL*OFF      W@HND   1
TCHLIC           CUSTOM    LOKUPHND                      93
TCHLIC           *IN93     IFEQ *ON
TCHLIC                     MOVEL*ON       W@HND
TCHLIC                     ELSE
TCHLIC                     MOVEL*OFF      W@HND
TCHLIC                     END
     C                     MOVE EKNONY    DELIVL  4
     C                     MOVE EKNONY    WELIVL  40
     C                     MOVE EKNUKE    DOCK    4
     C                     MOVE EKNKOJ    FACTRY  1
     C                     MOVE EKZETI    IDCD    4
     C                     MOVE EKSYOS    HQTY    50
     C                     MOVELEKMHIN    @@MHIN
TCHLHC                     Z-ADDEKNOYY    K@NOYY
TCHLHC                     Z-ADDEKNOMM    K@NOMM
TCHLHC                     Z-ADDEKNODD    K@NODD
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVELERR,6     MSG
JW   C                     MOVE '1'       MSG
     C                     SETON                     3330
     C                     MOVE '06'      A5ERID
      *
     C                     ELSE
      *
     C           EKZETI    CHAINFCETL11              90
TCHLLC           *IN90     IFEQ *ON
TCHLLC           A2GSKD    ORNE *BLANK
TCHLLC                     MOVEL*BLANK    W@LOC
TCHLLC                     ELSE
TCHLLC           K@NYMD    IFLT WLDATE
TCHLLC                     MOVE A2KTRK    W@LOC1
TCHLLC                     MOVE A2KTRT    W@LOC2
TCHLLC                     MOVE A2KTRR    W@LOC3
TCHLLC                     MOVE A2KTRD    W@LOC4
TCHLLC                     ELSE
TCHLLC                     MOVE A2STRK    W@LOC1
TCHLLC                     MOVE A2STRT    W@LOC2
TCHLLC                     MOVE A2STRR    W@LOC3
TCHLLC                     MOVE A2STRD    W@LOC4
TCHLLC                     END
TCHLLC                     END
      *
     C           K#FC6     CHAINFCEPL60              91
     C           *IN91     IFEQ *OFF
     C           F6APDT    IFEQ *ZERO
     C           F6APDT    ORGT *DATE
     C                     MOVELERR,12    MSG
JW2  C                     MOVE '03'      MSG
      *
     C                     MOVE '12'      A5ERID
     C                     SETON                     3330
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *  TOTAL QTY CHECK
     C           *IN30     IFEQ *OFF
     C                     EXSR @QTYCK
     C                     ENDIF
      *
     C           #CHK11    ENDSR
      *----------------------------------------------
     C           @QTYCK    BEGSR
      *----------------------------------------------
     C                     MOVE EKNONY    @@NONY
     C                     MOVE EKNOBN    @@NOBN
     C                     MOVE EKNONY    WWNONY
     C                     MOVE EKNOBN    WWNOBN
     C                     Z-ADD*ZERO     @@SRYO  90
     C           K#AB15    SETLLAB#PL15
     C           *IN91     DOUEQ*ON
     C           K#AB15    READEAB#PL15                  91
     C           *IN91     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     Z-ADDBASRYO    @@SRYO  90
     C                     MOVELBAODRN    @@2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           @@SRYO    IFEQ *ZERO
     C                     SETON                     3033
     C                     MOVELERR,10    MSG
JW2  C                     MOVE '02'      MSG
      *
     C                     MOVE '10'      A5ERID
     C                     ELSE
      *
     C                     Z-ADD*ZERO     @@QTY   70
JW1  C                     MOVELBAODRN    XXODRN
     C           K#AP70    SETLLAB#PL70
     C           *IN91     DOUEQ*ON
     C           K#AP70    READEAB#PL70                  91
     C           *IN91     IFEQ *OFF
     C           EKSKJY    ANDEQ*BLANK
     C           EKHENK    ANDEQ*BLANK
     C                     ADD  EKSRYO    @@QTY
     C                     ENDIF
     C                     ENDDO
      *
JW6  C           @@QTY     IFEQ 0
 .   C                     MOVELBAINVN    XXODRN
 .   C           K#AP70    SETLLAB#PL70
 .   C           *IN91     DOUEQ*ON
 .   C           K#AP70    READEAB#PL70                  91
 .   C           *IN91     IFEQ *OFF
 .   C           EKSKJY    ANDEQ*BLANK
 .   C           EKHENK    ANDEQ*BLANK
 .   C                     ADD  EKSRYO    @@QTY
 .   C                     ENDIF
 .   C                     ENDDO
JW6  C                     ENDIF
      *
     C           @@QTY     IFGE @@SRYO
     C                     SETON                     3033
     C                     MOVELERR,9     MSG
     C                     MOVE '09'      A5ERID
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C           @SCRN2    BEGSR
     C**************************************************************************
      * LOCATION
      *
     C                     MOVEL*BLANKS   SAVBC2250
     C                     Z-ADD*ZERO     BADSCN  50
     C                     EXFMTDSP02
      *
      **** save the location barcode that is scanned here
     C                     MOVELLOC       SAVBC2
     C*
      **** and get the date/time stamp of the scan for comparison on screen 3.
     C                     EXSR GETTM
     C                     MOVE @@TIME    TIME2  160
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKD     WHEQ *ON
     C                     CLEARDSP01
     C                     CLEARDSP02
     C                     MOVE '01'      @@ID
     C*DSP5 ENTER
     C                     OTHER                           DSP5 ENTER
     C                     EXSR @CHK2                      LOCATION CHK
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVEL*BLANK    MSG
     C                     CLEARDSP02
     C                     ELSE
     C                     MOVE '03'      @@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK2(LOCATION)
     C**************************************************************************
     C           @CHK2     BEGSR
      *
     C                     SETOF                     3038
     C                     MOVE *BLANK    MSG
     C*  PART MASTER = BARCODE
     C           IDNO6     IFEQ *BLANK
     C                     SETON                     3038
     C                     MOVELERR,2     MSG
      *
     C                     MOVE '02'      A5ERID
     C                     MOVE '02'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
     C                     ELSE
   B1C           A2ZETI    IFNE IDNO6
     C* ID NO ERROR
     C                     SETON                     3038
     C                     MOVELERR,4     MSG
JW2  C                     MOVE '02'      MSG
      *
     C                     MOVE '04'      A5ERID
     C                     MOVE '02'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
      *
   E2C                     END
   E2C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C           @SCRN3    BEGSR
     C**************************************************************************
      *
     C                     MOVE *BLANKS   SAVBC3250
     C                     EXFMTDSP03
      *
      **** save the barcode that is scanned here
     C                     MOVELAKAN      SAVBC3
      *
      **** get the date/time stamp of the apics/pt scan
     C                     EXSR GETTM
     C                     MOVE @@TIME    TIME3  160
      *
      **** calculate the elapsed time between scan 2 and scan 3.
     C           TIME3     SUB  TIME2     TMDIFF 160
      *
      **** if barcode from screen 3 is the same as the barcode from screen 2.
      ***  and the elapsed time is less than 2 seconds, then it was a miss scan
      ***  due to the trigger on the scanner itself....<known hardware issue>..
      ***  so, just clear and redisplay screen 3.
      *******    SAVBC3    IFEQ SAVBC2
      *******    TMDIFF    ANDLT2000
      *******              CLEARDSP03
      *******              GOTO #SCRN3
      *******              ENDIF
     C*
B0   C                     SELEC
TCHK7C           *INKA     WHEQ *ON
TCHK7C                     CLEARDSP03
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKD     WHEQ *ON
     C                     CLEARDSP01
     C                     CLEARDSP02
     C                     CLEARDSP03
     C                     Z-ADD*ZERO     BADSCN
     C                     MOVE '01'      @@ID
      *
     C                     OTHER
TCHK9C                     MOVEL*OFF      W@INKH  1
     C                     MOVEL*OFF      W@ERCK  1
     C                     EXSR @CHK3
      *
B1   C           *IN30     IFEQ *ON
     C           *IN29     OREQ *ON
     C           *INKE     ANDEQ*OFF
TCHK9C           W@INKH    IFEQ *OFF
     C           W@ERCK    IFEQ *OFF
     C                     EXFMTDSP98
     C                     ENDIF
     C                     MOVEL*BLANK    MSG
TCHKLC                     MOVEL*BLANK    MSG@2
     C                     MOVEL*OFF      W@ERCK
TCHK9C                     END
X1   C                     ELSE
      *
     C                     SELEC
TCHKSC           DELIVL    WHEQ '4044'
TCHKSC                     MOVE '06'      @@ID
      * DENSO
     C           DELIVL    WHEQ '3032'
JW   C           DELIVL    OREQ '3062'
JW   C           DELIVL    OREQ '3063'
JW   C           DELIVL    OREQ '3070'
JW   C           DELIVL    OREQ '3076'
JW   C           DELIVL    OREQ '3086'
     C           DELIVL    OREQ '3092'
     C                     MOVE '05'      @@ID
      *
     C* HONDA    DELIVL    WHEQ '0295'
     C           DELIVL    WHEQ '0296'
TCHK1C           DELIVL    OREQ '0295'
     C           DELIVL    OREQ '3128'
     C           DELIVL    OREQ '4126'
     C           DELIVL    OREQ '0402'
     C           DELIVL    OREQ '2020'
     C           DELIVL    OREQ '2021'
     C           DELIVL    OREQ '2022'
TCHK3C           DELIVL    OREQ '2023'
TCHKRC           DELIVL    OREQ '2024'
TCHKUC           DELIVL    OREQ '2025'
TCHKWC           DELIVL    OREQ '2026'
TCHKXC           DELIVL    OREQ '2027'
TCHL6C           DELIVL    OREQ '2028'
TCHL7C           DELIVL    OREQ '2029'
TCHLBC           DELIVL    OREQ '2030'
TCHKXC           DELIVL    OREQ '1348'
     C           DELIVL    OREQ '0294'
     C           DELIVL    OREQ '0293'
TCHKBC           DELIVL    OREQ '0411'
TCHKUC           DELIVL    OREQ '3134'
TCHKIC           DELIVL    OREQ '3135'
TCHKIC           DELIVL    OREQ '3136'
TCHKIC           DELIVL    OREQ '0391'
TCHKJC           DELIVL    OREQ '0412'
TCHKMC           DELIVL    OREQ '3126'
TCHKMC           DELIVL    OREQ '3127'
TCHKMC           DELIVL    OREQ '4127'
TCHKNC           DELIVL    OREQ '0290'
TCHKOC           DELIVL    OREQ '2019'
TCHKQC           DELIVL    OREQ '0289'
TCHL1C           DELIVL    OREQ '3125'
TCHL1C           DELIVL    OREQ '4128'
TCHL3C           DELIVL    OREQ '3124'
TCHL3C           DELIVL    OREQ '4155'
TCHL4C           DELIVL    OREQ '0390'
TCHL4C           DELIVL    OREQ '2418'
TCHL4C           DELIVL    OREQ '3129'
TCHL4C           DELIVL    OREQ '3130'
TCHL4C           DELIVL    OREQ '4133'
TCHL9C           DELIVL    OREQ '0298'
TCHLGC           DELIVL    OREQ '0299'
TCHL9C           DELIVL    OREQ '0392'
TCHL9C           DELIVL    OREQ '0393'
TCHL9C           DELIVL    OREQ '0394'
TCHLCC           DELIVL    OREQ '0395'
TCHLFC           DELIVL    OREQ '0287'
TCHLFC           DELIVL    OREQ '0288'
TCHLFC           DELIVL    OREQ '4129'
TCHLFC           DELIVL    OREQ '4130'
TCHLFC           DELIVL    OREQ '4131'
TCHLNC           DELIVL    OREQ '0286'
TCHLNC           DELIVL    OREQ '0284'
TCHLNC           DELIVL    OREQ '0403'
JW1  C           DELIVL    OREQ '1620'
JW2  C           DELIVL    OREQ '0332'
JW3  C           DELIVL    OREQ '1630'
JW3  C           DELIVL    OREQ '0396'
JW3  C           DELIVL    OREQ '0397'
     C           EKDATE    IFLE 20040604
     C                     MOVE '04'      @@ID
     C                     ELSE
TCH15C                     MOVE BARSAV    BARCD0
     C                     EXSR @OUT
     C                     ENDIF
      ** TMMC
     C                     OTHER
     C                     EXSR @OUT
      *
     C                     ENDSL
     C*
E1   C                     ENDIF
      *
E0   C                     ENDSL
      *
     C           #SCRN3    ENDSR
TCHLHC**************************************************************************
TCHLHC* SHORTAGE SCAN
TCHLHC**************************************************************************
TCHLHC           @OUTST    BEGSR
TCHLHC*
     C                     Z-ADD0         OREAD
TCHLHC*
TCHLHC                     DO   *HIVAL                     -DO01
TCHLHC*
TCHLHC                     MOVE *BLANK    OUTS
TCHLHC                     MOVEL*OFF      *IN30
TCHLHC                     MOVEL*OFF      W@HND
TCHLHC                     EXFMTDSP11
TCHLHC           *INKG     IFEQ *ON                        -IF01
TCHLHC                     MOVEL*OFF      *IN30
TCHLHC                     LEAVE
TCHLHC                     END                             -EIF01
TCHLHC*
TCHLHC                     MOVELOUTS      B2D
     C* CHECK
TCHLHC                     EXSR OCHK1
     C*
TCHLHC           *IN30     IFEQ *ON                        -IF01
TCHLHC                     EXFMTDSP98
TCHLHC                     MOVE *BLANK    MSG
TCHLHC                     ITER
TCHLHC                     END                             -EIF01
TCHLHC*
TCHLHC                     DO                              -DO02
TCHLHC*
TCHLHC           OUTS      SETLLALDPP65
TCHLHC                     DO   *HIVAL                     -DO03
TCHLHC           OUTS      READEALDPP65                  99
TCHLHC   99                LEAVE
TCHLHC           AFRDAT    IFEQ *ZERO                      -IF01
TCHLHC                     MOVEL*ON       *IN30
TCHLHC                     MOVELERR,08    MSG
TCHLHC                     MOVELERR,21    MSG@2
TCHLHC                     EXFMTDSP98
TCHLHC                     MOVEL*BLANK    MSG
TCHLHC                     MOVEL*BLANK    MSG@2
TCHLHC                     LEAVE
TCHLHC                     END                             -EIF01
TCHLHC                     ENDDO                           -EDO03
TCHLHC  N99                LEAVE
     C*
%0001C* FOR HONDA LABEL  DUPCICATE SCAN CHECK
     C           W@HND     IFEQ *ON                        -IF01
     C                     MOVEL*BLANK    HOUTS
     C                     MOVELOUTS      HOUTS
     C*
     C                     SELEC
     C           HSRHN     WHEQ 'A'                        -IF01
     C                     MOVEL'B'       HSRHN            -IF01
     C           HSRHN     WHEQ 'B'                        -IF01
     C                     MOVEL'A'       HSRHN            -IF01
     C                     ENDSL
     C*
     C           HOUTS     SETLLALDPP65
     C                     DO   *HIVAL                     -DO03
     C           HOUTS     READEALDPP65                  99
     C   99                LEAVE
     C           AFRDAT    IFEQ *ZERO                      -IF01
     C                     MOVEL*ON       *IN30
     C                     MOVELERR,08    MSG
     C                     MOVELERR,21    MSG@2
     C                     EXFMTDSP98
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*BLANK    MSG@2
     C                     LEAVE
     C                     END                             -EIF01
     C                     ENDDO                           -EDO03
     C  N99                LEAVE
     C                     ENDIF                           -EIF01
     C*
TCHLHC                     CLEARALDPP651
TCHLHC                     Z-ADDWSSDAT    AFDATE
TCHLHC                     Z-ADDWSSTM6    AFTIME
TCHLHC                     MOVELWUSRID    AFUSER
TCHLHC                     MOVEL#WSID     AFWSID
TCHLHC                     MOVEL#PGM      AFPGID    P
TCHLHC                     MOVELWORKER    AFTMCD
TCHLHC*
TCHLHC                     MOVELB2D       AFUKAN
TCHLHC*
TCHLHC                     MOVELA2ZETI    AFLZET
TCHLHC                     MOVELW@LOC1    AFLOC1
TCHLHC                     MOVELW@LOC2    AFLOC2
TCHLHC                     MOVELW@LOC3    AFLOC3
TCHLHC                     MOVELW@LOC4    AFLOC4
TCHLHC*
TCHLHC                     MOVELA2BHB1    AFLPR1
TCHLHC                     MOVELA2BHB2    AFLPR2
TCHLHC                     MOVELA2BHB3    AFLPR3
TCHLHC*
TCHLHC                     Z-ADDWSSDAT    AFODAT
TCHLHC                     Z-ADDWSSTM6    AFOTIM
TCHLHC                     MOVELWORKER    AFOTMC
     C* %0001
     C                     Z-ADD@FTOKU    AFTOKU
     C                     Z-ADD@FNONY    AFNONY
     C                     MOVEL@FNKOJ    AFNKOJ
     C                     MOVEL@FNUKE    AFNUKE
     C                     MOVEL@FMHN1    AFMHN1
     C                     MOVEL@FMHN2    AFMHN2
     C                     MOVEL@FMHN3    AFMHN3
     C                     MOVEL@FMHN4    AFMHN4
     C                     Z-ADD@FNODT    AFNODT
     C                     MOVEL@FNOBN    AFNOBN
     C                     MOVEL@FODRN    AFODRN
     C*
TCHLHC                     WRITEALDPP651
TCHLHC*
     C                     MOVEL*BLANK    W@SETF  1
     C*
     C* CHECK APICS1/2/3 TYPE
     C                     CALL 'UEXR32'
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           WSSDAT  80
     C                     PARM           P@TYPE  2
     C                     PARM           P@RTN   1
     C* A-PICS2
     C           P@TYPE    IFEQ 'A2'
%0003C                     EXSR @CA#11
     C* A-PICS1
     C                     ELSE
TCHLHC                     EXSR @AU#11
     C                     ENDIF
     C*
     C                     ADD  1         OREAD
     C*
TCHLHC                     ENDDO                           -EDO02
TCHLHC*
TCHLHC                     ENDDO                           -EDO01
TCHLHC*
TCHLHC                     ENDSR
      *----------------------------------------------
      * SHORTAGE SCAN CHECK
     C           OCHK1     BEGSR
      *----------------------------------------------
     C                     DO
     C*
     C                     SETOF                     3033
     C                     MOVE *BLANK    MSG
      *
B0   C           B2D       IFEQ *BLANK
     C                     MOVELERR,14    MSG
JW2  C                     MOVE '02'      MSG
     C                     MOVE '14'      A5ERID
     C                     SETON                     3033
E0   C                     ENDIF
      *
     C                     MOVELB2D       W2D
     C                     MOVELB2D       WWBRCD 18
     C* %0001
     C                     Z-ADD*ZERO     @FTOKU  40
     C                     Z-ADD*ZERO     @FNONY  40
     C                     MOVEL*BLANK    @FNKOJ  1
     C                     MOVEL*BLANK    @FNUKE  4
     C                     MOVEL*BLANK    @FMHN1  5
     C                     MOVEL*BLANK    @FMHN2  5
     C                     MOVEL*BLANK    @FMHN3  5
     C                     MOVEL*BLANK    @FMHN4  5
     C                     Z-ADD*ZERO     @FNODT  80
     C                     MOVEL*BLANK    @FNOBN  2
     C                     MOVEL*BLANK    @FODRN 10
     C* CHECK 2
B0   C           FILR      IFEQ *BLANK
     C                     EXSR OCHK11
     C                     MOVE '1'       @D      1        CODE39
     C                     ELSE
     C                     EXSR OCHK12
     C                     MOVE '2'       @D      1        2D BCD
E0   C                     ENDIF
     C*
TCHLLC***        W@LOC2    IFEQ '52'
TCHLLC***        W@LOC2    OREQ '53'
TCHLLC***                  ELSE
TCHLLC***                  MOVE ERR,26    MSG
TCHLLC***                  SETON                     3033
TCHLLC***                  END
     C* ERROR LOG
B0   C           *IN30     IFEQ *ON
     C                     MOVE '11'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC* CODE39
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC* 2D
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     ENDIF
TCHKDC*
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
E0   C                     ENDIF
      *
TEST C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------
      * SHORTAGE SCAN CHECK  FOR BARCODE
     C           OCHK11    BEGSR
      *----------------------------------------------
     C                     DO
     C*
     C           BARCD0    SETLLAB#PL71
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEAB#PL71             N    90
     C           *IN90     IFEQ *OFF
     C           EKSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C           EKDEYY    IFNE *ZERO
     C  N30                MOVELERR,8     MSG
JW2  C  N30                MOVE '03'      MSG
      *
     C  N30                MOVE '08'      A5ERID
     C                     SETON                     3033
     C                     LEAVE
     C                     ELSE
     C                     MOVELEKTOKU    CUSTOM  4
     C           CUSTOM    LOKUPHND                      93
     C           *IN93     IFEQ *ON
     C                     MOVEL*ON       W@HND   1
     C                     ELSE
     C                     MOVEL*OFF      W@HND
     C                     END
     C                     MOVE EKNONY    DELIVL  4
     C                     MOVE EKNONY    WELIVL  40
     C                     MOVE EKNUKE    DOCK    4
     C                     MOVE EKNKOJ    FACTRY  1
     C                     MOVE EKZETI    IDCD    4
     C                     MOVE EKSYOS    HQTY    50
     C                     MOVELEKMHIN    @@MHIN
     C                     Z-ADDEKNOYY    K@NOYY
     C                     Z-ADDEKNOMM    K@NOMM
     C                     Z-ADDEKNODD    K@NODD
      * %0001
     C                     Z-ADDEKTOKU    @FTOKU  40
     C                     MOVE EKNONY    @FNONY  40
     C                     MOVELEKNKOJ    @FNKOJ  1
     C                     MOVELEKNUKE    @FNUKE  4
     C                     MOVELEKMHN1    @FMHN1  5
     C                     MOVELEKMHN2    @FMHN2  5
     C                     MOVELEKMHN3    @FMHN3  5
     C                     MOVELEKMHN4    @FMHN4  5
     C                     Z-ADDEKNODT    @FNODT  80
     C                     MOVELEKNOBN    @FNOBN  2
     C                     MOVELEKODRN    @FODRN 10
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      * NO ERROR
     C           *IN30     IFEQ *OFF
      *
     C           *IN90     IFEQ *ON
     C  N30                MOVELERR,6     MSG
JW   C  N30                MOVE '2'       MSG
     C  N30                MOVE '06'      A5ERID
     C                     SETON                     3330
      *
     C                     ELSE
      *
     C           EKZETI    CHAINFCETL11              90
TCHLLC           *IN90     IFEQ *ON
TCHLLC           A2GSKD    ORNE *BLANK
TCHLLC                     MOVEL*BLANK    W@LOC
TCHLLC                     ELSE
TCHLLC           K@NYMD    IFLT WLDATE
TCHLLC                     MOVE A2KTRK    W@LOC1
TCHLLC                     MOVE A2KTRT    W@LOC2
TCHLLC                     MOVE A2KTRR    W@LOC3
TCHLLC                     MOVE A2KTRD    W@LOC4
TCHLLC                     ELSE
TCHLLC                     MOVE A2STRK    W@LOC1
TCHLLC                     MOVE A2STRT    W@LOC2
TCHLLC                     MOVE A2STRR    W@LOC3
TCHLLC                     MOVE A2STRD    W@LOC4
TCHLLC                     END
TCHLLC                     END
      *
     C           K#FC6     CHAINFCEPL60              91
     C           *IN91     IFEQ *OFF
     C           F6APDT    IFEQ *ZERO
     C           F6APDT    ORGT *DATE
     C  N30                MOVELERR,12    MSG
JW2  C  N30                MOVE '04'      MSG
      *
     C  N30                MOVE '12'      A5ERID
     C                     SETON                     3330
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *----------------------------------------------
      * SHORTAGE SCAN CHECK  FOR 2D BARCODE
     C           OCHK12    BEGSR
      *----------------------------------------------
TEST C                     DO
     C*
TCHKDC                     MOVEL*BLANK    @9
     C                     MOVELDEST      K@DEST  5
     C                     MOVELDCCOD     K@NUKE  4
     C                     MOVELORNO      K@ORNO 12
     C                     MOVELSBAN      K@KANO  4
     C                     MOVELBXNBR     K@BOXN  4
     C           K#65      SETLLAB#PP65              90
     C           *IN90     DOUEQ*ON
     C           K#65      READEAB#PP65             N    90
     C           *IN90     IFEQ *OFF
     C           A6SKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C           *IN90     IFEQ *OFF
     C  N30                MOVELERR,8     MSG
JW2  C  N30                MOVE '04'      MSG
      *
     C  N30                MOVE '08'      A5ERID
     C                     SETON                     3033
     C                     LEAVE
     C                     ENDIF
      *
      **************************************************************
      *  LOKUP TAB1 WAS HERE AND REPLACED WITH CODE BELOW
      **************************************************************
      *
      *
     C           DEST      CHAINAL#PP21              10
     C           *IN10     IFEQ *ON
     C  N30                MOVELERR,10    MSG
     C                     MOVE '03'      MSG
      *
     C  N30                MOVE '10'      A5ERID
     C                     SETON                     3033
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVE C2@9      @9
     C                     MOVE XCUST     K@TOKU  40
     C                     MOVE XFACT     K@NKOJ  1
     C                     MOVE XSHTO     @@NONY
      *
      *
      **************************************************************
     C                     MOVELDCCOD     K@NUKE  4
     C                     MOVELORNO      K@ODRN 10
     C                     MOVELORNO      @@INVN 16
     C                     MOVE SHDT      K@NYMD
     C                     MOVELSHTM      @SHTM   40
     C                     MOVEL*BLANK    K@MHIN
     C                     MOVELPART      K@MHIN
      *
     C           K#15      SETLLAB#PL15
     C           *IN92     DOUEQ*ON
     C           K#15      READEAB#PL15                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBASHN1    K11
     C                     MOVELBASHN2    K12
     C                     MOVELBASHN3    K13
     C                     MOVELBAMHIN    @@MHIN 20
     C                     MOVELBAODRN    @@2     2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN92     IFEQ *ON
     C           K#13      SETLLAB#PL13
     C           *IN92     DOUEQ*ON
     C           K#13      READEAB#PL13                  92
     C           *IN92     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAINVN    ANDEQ@@INVN
     C                     Z-ADDBANOBN    @@NBN   20
     C                     MOVELBASHN1    K11
     C                     MOVELBASHN2    K12
     C                     MOVELBASHN3    K13
     C                     MOVELBAMHIN    @@MHIN 20
     C                     MOVELBAODRN    @@2     2
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
     C                     ENDIF
      *
     C           *IN92     IFEQ *ON
     C  N30                MOVELERR,13    MSG
JW1  C  N30                MOVE '03'      MSG
      *
     C  N30                MOVE '13'      A5ERID
     C                     SETON                     3330
     C                     LEAVE
      * %0001
     C                     ELSE
     C                     Z-ADDBATOKU    @FTOKU  40
     C                     Z-ADDBANONY    @FNONY  40
     C                     MOVELBANKOJ    @FNKOJ  1
     C                     MOVELBANUKE    @FNUKE  4
     C                     MOVELBAMHN1    @FMHN1  5
     C                     MOVELBAMHN2    @FMHN2  5
     C                     MOVELBAMHN3    @FMHN3  5
     C                     MOVELBAMHN4    @FMHN4  5
     C                     Z-ADDBANODT    @FNODT  80
     C                     MOVELBANOBN    @FNOBN  2
     C                     MOVELBAODRN    @FODRN 10
      *
     C                     ENDIF
      *
     C           KEY1      CHAINFCEPL01              91
TCHLLC           *IN91     IFEQ *ON
TCHLLC           A2GSKD    ORNE *BLANK
TCHLLC                     MOVEL*BLANK    W@LOC
TCHLLC                     ELSE
TCHLLC           K@NYMD    IFLT WLDATE
TCHLLC                     MOVE A2KTRK    W@LOC1
TCHLLC                     MOVE A2KTRT    W@LOC2
TCHLLC                     MOVE A2KTRR    W@LOC3
TCHLLC                     MOVE A2KTRD    W@LOC4
TCHLLC                     ELSE
TCHLLC                     MOVE A2STRK    W@LOC1
TCHLLC                     MOVE A2STRT    W@LOC2
TCHLLC                     MOVE A2STRR    W@LOC3
TCHLLC                     MOVE A2STRD    W@LOC4
TCHLLC                     END
TCHLLC                     END
      *
     C           K#FC6X    CHAINFCEPL60              91
     C           *IN91     IFEQ *OFF
     C           F6APDT    IFEQ *ZERO
     C           F6APDT    ORGT *DATE
     C  N30                MOVELERR,12    MSG
JW2  C  N30                MOVE '05'      MSG
      *
     C  N30                MOVE '12'      A5ERID
     C                     SETON                     3330
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @CHK3
     C**************************************************************************
     C           @CHK3     BEGSR
      *
     C                     MOVELBARKAN    ##BC20 20 P
      *
     C                     SETOF                     303929
     C                     MOVE *BLANK    MSG
%3   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     EXSR @CHK33
 |   C                     MOVE '3'       @I
%3   C                     ELSE
TCHLSC           BARKBN    IFNE 'I'
TCHLSC           BARKBN    ANDNE'S'
     C                     EXSR @CHK31
     C                     MOVE '1'       @I      1
     C                     ELSE
     C                     EXSR @CHK32
     C                     MOVE '2'       @I      1
     C                     ENDIF
%3   C                     ENDIF
JW4   * CHECK CHARTER STEEL
 |   C                     EXSR #CHRTC
 |   C           CHRFLG    IFEQ 'Y'
 |   C           OKFLG     ANDEQ'N'
 |   C                     SETON                     99
 |   C                     MOVELERR,28    MSG              NOT IN SORT
 |   C                     Z-ADD28        IZ      20
 |   C                     EXSR #SB290                     PASSWORD LOCK
 |   C                     SETON                     30
 |   C                     GOTO #ECHK3
JW4  C                     ENDIF
      *
 |   C           CHRFLG    IFEQ 'Y'
 |   C           OKFLG     ANDEQ'1'
 |   C                     SETON                     99
 |   C                     MOVELERR,29    MSG              ALREADY OUT
 |   C                     Z-ADD29        IZ
 |   C                     EXSR #SB290                     PASSWORD LOCK
 |   C                     SETON                     30
 |   C                     GOTO #ECHK3
JW4  C                     ENDIF
      *
     C           #ECHK3    ENDSR
      *----------------------------------------------------*
JW4   * CHECK CHARTER STEEL EXIST IN ALRPP20
 .    *----------------------------------------------------*
 .   C           #CHRTC    BEGSR
 .    * GET SUPP CODE
     C                     MOVE 'N'       OKFLG   1
     C                     MOVE 'N'       CHRFLG  1
      *
     C           BARQR     IFEQ 'B01'
     C           BARQR     OREQ 'C01'
%0003C           BARQR     OREQ 'F01'
     C                     MOVELQRZT      $ZETI
     C                     MOVE 'Q'       BRFLG   1
     C                     ELSE
     C                     MOVELIDNO7     $ZETI
     C                     MOVE 'A'       BRFLG
     C                     ENDIF
      *
     C                     MOVE *BLANK    $SHIN
     C                     CALL 'UTLR21C'
     C                     PARM           $ZETI   4
     C                     PARM           $SHIN  12
     C                     PARM           $SUPP   4
     C                     PARM           $RTNX   1
      *
     C           $SUPP     IFNE '4540'
     C                     MOVE 'N'       CHRFLG
     C                     GOTO XCHART
     C                     ENDIF
      *
      * if the supplier is charter steel,
      * check for machine S90 in process master for this part#...
      * if not S90 turn off check flag...
     C           $SUPP     IFEQ '4540'
     C                     CALL 'UTLR21X'
     C                     PARM           $ZETI
     C                     PARM           $SHIN
     C                     PARM           $RTNYN  1
     C           $RTNYN    IFEQ 'N'
     C                     MOVE 'N'       CHRFLG
     C                     GOTO XCHART
     C                     ENDIF
      *
     C                     ENDIF
      * IF CHARTER STEEL..
     C                     MOVE 'Y'       CHRFLG
      *
     C           BRFLG     IFEQ 'A'
     C                     MOVELAKAN      LTR20  20
      **JW5      LTR20     SETLLALRPL21
JW5  C           LTR20     SETLLALRPL21A
     C                     ELSE
      **JW5      @@BAR1    SETLLALRPL22
JW5  C           @@BAR1    SETLLALRPL22A
     C                     ENDIF
      *
     C                     DO   *HIVAL
      *
     C           BRFLG     IFEQ 'A'
      **JW5      LTR20     READEALRPL21             N    98
JW5  C           LTR20     READEALRPL21A            N    98
     C                     ELSE
      **JW5      @@BAR1    READEALRPL22             N    98
JW5  C           @@BAR1    READEALRPL22A            N    98
     C                     ENDIF
      *
     C   98                LEAVE
      *
     C           L2SKJY    IFEQ ' '
     C           L2OKNG    ANDEQ'OK'
     C           L2ODAT    ANDNE0
     C                     MOVE '1'       OKFLG
     C                     LEAVE
 .   C                     ENDIF
      *
     C           L2SKJY    IFEQ ' '
     C           L2OKNG    ANDEQ'OK'
     C           L2ODAT    ANDEQ0
     C                     EXSR #CHKDT
     C           #DAYS     IFLE 40
     C                     MOVE 'Y'       OKFLG
     C                     LEAVE
 .   C                     ENDIF
 .   C                     ENDIF
      *
 .   C                     ENDDO
 .    *
JW4  C           XCHART    ENDSR
      *----------------------------------------------------*
JW4   * CHECK SCAN DATE IS NEW ENOUGH
 .    *----------------------------------------------------*
 .   C           #CHKDT    BEGSR
 .    *
     C                     Z-ADD0         #DAYS   40
     C                     MOVELTODAY     $DT81
     C                     MOVELL2CODT    $DT82
     C                     MOVEL'Y'       $IAF
     C                     MOVEL'N'       $INC
     C                     CALL 'UTLR24'
     C                     PARM           $DT81   8
     C                     PARM           $DT82   8
     C                     PARM           $IAF    1
     C                     PARM           $INC    1
     C                     PARM           $DAYS   4
     C                     PARM           $RTNX   1
      *
     C           $RTNX     IFEQ *BLANK
     C                     MOVEL$DAYS     #DAYS
     C                     ENDIF
      *
     C                     ENDSR
JW4   *----------------------------------------------------*
 .    * ERROR SCREEN - Display Error on Screen             *
 .    *----------------------------------------------------*
 .   C           #SB290    BEGSR
      *
     C           IZ        IFEQ 28
     C           IZ        OREQ 29
      *
     C*  PASSWORD LOCK
     C                     Z-ADD1         P1PGM
     C                     MOVELERR,IZ    P1ERR     P
     C                     MOVEL#PGM      P1PID     P
     C                     MOVELWORKER    P1KOME    P
     C                     Z-ADD*ZERO     P1DTTM
     C                     CALL 'AM#R09'
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM 140
     C                     MOVEL*ON       W@ERCK  1
 .   C                     ENDIF
 .    *
JW4  C                     ENDSR
      *----------------------------------------------------*
JW4   * UPDATE ALRPP20 (STORE OUT)
 .    *----------------------------------------------------*
 .   C           #CHRTU    BEGSR
 .    * GET SUPP CODE
     C           BRFLG     IFEQ 'A'
     C                     MOVELIDNO7     $ZETI
     C                     ELSE
     C                     MOVELQRZT      $ZETI
     C                     ENDIF
      *
     C                     MOVE *BLANK    $SHIN
     C                     CALL 'UTLR21C'
     C                     PARM           $ZETI   4
     C                     PARM           $SHIN  12
     C                     PARM           $SUPP   4
     C                     PARM           $RTNX   1
      * IF CHARTER STEEL..
     C           $SUPP     IFEQ '4540'
      *
     C           BRFLG     IFEQ 'A'
     C                     MOVELAKAN      LTR20  20
      *JW5       LTR20     SETLLALRPL21
JW5  C           LTR20     SETLLALRPL21A
     C                     ELSE
      *JW5       @@BAR1    SETLLALRPL22
JW5  C           @@BAR1    SETLLALRPL22A
     C                     ENDIF
      *
     C                     DO   *HIVAL
      *
     C           BRFLG     IFEQ 'A'
      *JW5       LTR20     READEALRPL21                  98
JW5  C           LTR20     READEALRPL21A                 98
     C                     ELSE
      *JW5       @@BAR1    READEALRPL22                  98
JW5  C           @@BAR1    READEALRPL22A                 98
     C                     ENDIF
      *
     C   98                LEAVE
      *
     C           L2SKJY    IFEQ ' '
     C           L2OKNG    ANDEQ'OK'
     C           L2ODAT    ANDEQ0
     C                     EXSR #CHKDT
     C           #DAYS     IFLE 40
     C                     Z-ADDTODAY     L2ODAT
     C                     Z-ADDNOW       L2OTIM
      *
     C           BRFLG     IFEQ 'A'
      *JW5                 UPDATALRPL211
JW5  C                     UPDATALRP21A1
     C                     ELSE
      *JW5                 UPDATALRPL221
JW5  C                     UPDATALRP22A1
     C                     ENDIF
      *
     C                     LEAVE
 .   C                     ENDIF
 .   C                     ENDIF
 .   C                     ENDDO
 .   C                     ENDIF
 .    *
JW4  C                     ENDSR
     C**************************************************************************
     C*  APICS KANBAN
     C**************************************************************************
     C           @CHK31    BEGSR
     C* ZETAI NO CHECK
   B1C           *IN30     IFEQ '0'
     C                     MOVELIDNO7     W@ZETI  4
     C                     EXSR @CHK34
   B2C           A2ZETI    IFEQ IDNO7
     C*
     C                     ELSE
     C           W@EFLG    IFEQ '1'
     C                     SETON                     3039
   B3C           MSG       IFEQ *BLANK
     C**                   MOVELERR,1     MSG
JW4  C                     MOVELERR,32    MSG
JW2  C**                   MOVE '01'      MSG
     C                     MOVE '01'      A5ERID
   E3C                     END
   E3C                     END
   E2C                     END
   E1C                     END
      *  3-BOND CHECK
B0   C           *IN30     IFEQ *OFF
     C           POS       ANDNE'POS'
     C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
     C           K#KEY1    CHAINAAMPL11              99
B1   C           *IN99     IFEQ *OFF
     C           A3ZETI    ANDNE'1164'
TCHKKC           A3ZETI    ANDNE'2569'
     C           K@SUPP    LOKUPBMN                      98
B2   C           *IN98     IFEQ *ON
      *
     C           K#KEY     CHAINAFAPL82              99
B3   C           *IN99     IFEQ *ON
     C                     EXSR #AM#31
     C           PASFLG    IFEQ '1'
     C                     MOVE *BLANKS   MSGX
     C           *INKH     IFEQ '1'
     C                     GOTO SKIP7
   | C                     ENDIF
TCH63C                     ENDIF
E3   C                     ENDIF
E2   C                     ENDIF
E1   C                     ENDIF
E0   C                     ENDIF
TCH63C           SKIP7     TAG
      * CHECK DIGIT
TCHKEC           *IN30     IFEQ *OFF
     C                     MOVEL*BLANK    W3CHKD  1
     C                     MOVELBARKAN    PMAREA    P
     C                     MOVE '014'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
      *
     C           PMRTCD    IFNE *BLANK
     C  N30                MOVELERR,1     MSG
JW2  C  N30                MOVE '02'      MSG
     C                     MOVE '01'      A5ERID
     C                     SETON                     3039
     C                     MOVE *BLANKS   AKAN
     C                     ELSE
     C           PMCHK     IFNE CHKD8
     C  N30                MOVELERR,1     MSG
JW2  C  N30                MOVE '03'      MSG
     C                     MOVE '01'      A5ERID
     C                     SETON                     3039
     C                     MOVE *BLANKS   AKAN
     C                     MOVEL*ON       W@ERCK
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
TCH85C*
TCHKEC           *IN30     IFEQ *OFF
TCHKEC*
TCHKEC                     MOVELIAPICS    WAPICS           A-PICS KANBAN
     C                     MOVELCHKD8     W3CHKD  1
      *
     C                     EXSR #DUPL
      *
TCHKEC                     END
TCHKEC*
      *  ERR
     C           *IN30     IFEQ *ON
     C           *IN29     OREQ *ON
      *
TCHKLC           A5ERID    IFNE '18'
TCHKLC           A5ERID    ANDNE'27'
     C                     MOVE '03'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
     C                     MOVE A5SERL    CHARS5
     C                     MOVE *BLANKS   SC1DTA
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
     C                     MOVE *BLANKS   CHARS5
     C                     MOVELA52DBC    SC1DTA    P
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
 LC1  *
  |   * call pgm to get sequence number from toyota labl for last 5 chars of msg
     C           SC1DTA    IFNE *BLANKS
     C                     CALL 'AM#R09B'
     C                     PARM           SC1DTA
     C                     PARM           CHARS5
  |  C                     ENDIF
 LC1  *
     C* ERR CHECK  PASSWORD LOCK
     C                     Z-ADD1         P1PGM
     C                     MOVELMSG       P1ERR     P
     C                     MOVE CHARS5    P1ERR
     C                     MOVEL#PGM      P1PID     P
     C                     MOVELWORKER    P1KOME    P
     C                     Z-ADDWSDT      P1DTTM
     C                     CALL 'AM#R09'
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM 140
     C                     MOVEL*ON       W@ERCK  1
     C*
TCHKEC                     END
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*    ASJ KANBAN
     C**************************************************************************
     C           @CHK32    BEGSR
      *
     C* KANBAN KUBUN OK?
   B1C           *IN30     IFEQ '0'
   B2C           BARKBN    IFEQ 'I'
TCHLSC           BARKBN    OREQ 'S'
     C* ERROR
     C                     ELSE
     C                     SETON                     3039
   B3C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
JW2  C                     MOVE '04'      MSG
     C                     MOVE '01'      A5ERID
   E3C                     END
   E2C                     END
   E1C                     END
     C* ZETAI NO CHECK
   B1C           *IN30     IFEQ '0'
     C                     MOVELIDNO7     W@ZETI
     C                     EXSR @CHK34
   B2C           A2ZETI    IFEQ IDNO7
     C*
     C                     ELSE
     C           W@EFLG    IFEQ '1'
     C                     SETON                     3039
   B3C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
JW2  C                     MOVE '05'      MSG
     C                     MOVE '01'      A5ERID
   E3C                     END
   E2C                     END
   E1C                     END
   E1C                     END
      * CHECK DIGIT
TCHK7C           *IN30     IFEQ *OFF
     C                     MOVELIIAF      PMAREA    P
     C                     MOVE '016'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
      *
     C           PMRTCD    IFNE *BLANK
     C  N30                MOVELERR,1     MSG
JW2  C  N30                MOVE '06'      MSG
     C                     MOVE '01'      A5ERID
     C                     SETON                     3039
     C                     ELSE
     C           PMCHK     IFNE CHKD7
     C  N30                MOVELERR,1     MSG
JW2  C  N30                MOVE '07'      MSG
     C                     MOVE '01'      A5ERID
     C                     SETON                     3039
     C                     MOVE *BLANKS   AKAN
     C                     ENDIF
     C                     ENDIF
TCHK7C                     END
TCHK7C*
TCHK7C           *IN30     IFEQ *OFF
TCHK7C*
TCHK7C                     MOVELIIAF      WIAF
TCHK7C*
TCHK7C           K#DL20    KLIST
TCHK7C                     KFLD           A1ZETI
TCHK7C                     KFLD           A1ORDR
TCHK7C                     KFLD           A1SEHI
TCHK7C                     KFLD           A1LOTN
TCHK7C           K#DL20    CHAINALDPL20              95
TCHK7C           *IN95     IFEQ *OFF
TCHK9C                     MOVE '17'      A5ERID
TCHK9C                     MOVE '03'      A5ERPS
TCHK9C                     TIME           WSDT
TCHK9C                     Z-ADDWSSDAT    A5KSDT
TCHK9C                     Z-ADDWSSTM6    A5KSTM
TCHK9C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
TCHK9C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
      *
      * this write has been taken out to avoid having error being logged twice
      ******************** WRITEALDPP501
      *
     C                     EXSR #AM#31
     C           PASFLG    IFEQ '1'
TCHK9C                     MOVELERR,17    MSGX
JW2  C                     MOVE '03'      MSGX
TCHK9C                     EXFMTDSP99
TCHK9C                     MOVE *BLANKS   MSGX
TCHK9C           *INKH     IFEQ *OFF
TCHK9C                     MOVEL*ON       W@INKH
TCHK9C                     SETON                     3039
TCHK9C                     END
TCHK9C                     ELSE
TCHK7C                     SETON                     3039
TCHK7C           MSG       IFEQ *BLANK
TCHK7C                     MOVELERR,17    MSG
JW2  C                     MOVE '04'      MSG
TCHK7C                     MOVE '17'      A5ERID
TCHK7C                     END
TCHK9C                     END
TCHK9C                     END
TCHK9C                     END
TCHK9C*
TCHKTC* - SEARCH ALERT MESSAGE -----------------------------
TCHKTC           *IN30     IFEQ *OFF
TCHKTC*
TCHKTC           K#L97A    KLIST
TCHKTC                     KFLD           K1ZETI  4
TCHKTC                     KFLD           K1ORDR  6
TCHKTC                     KFLD           K1LOTN  4
TCHKTC                     MOVELA1ZETI    K1ZETI
TCHKTC                     MOVELA1ORDR    K1ORDR
TCHK1C                     MOVELA1LOTN    K1LOTN
TCHKTC*
TCHKTC           K#L97A    SETGTALDPP97
TCHKTC                     DO   *HIVAL
TCHKTC           K#L97A    REDPEALDPP97                  95
TCHKTC   95                LEAVE
TCHKTC           AGSKJY    IFNE *BLANK
TCHKTC                     ITER
TCHKTC                     END
TCHKTC                     LEAVE
TCHKTC                     ENDDO
TCHKTC*
TCHKTC           *IN95     IFEQ *ON
TCHKTC                     MOVEL*BLANK    K1LOTN
TCHKTC           K#L97A    SETGTALDPP97
TCHKTC                     DO   *HIVAL
TCHKTC           K#L97A    REDPEALDPP97                  95
TCHKTC   95                LEAVE
TCHKTC           AGSKJY    IFNE *BLANK
TCHKTC                     ITER
TCHKTC                     END
TCHKTC                     LEAVE
TCHKTC                     ENDDO
TCHKTC                     END
TCHKTC*
TCHKTC           *IN95     IFEQ *ON
TCHKTC                     MOVEL*BLANK    K1ORDR
TCHKTC           K#L97A    SETGTALDPP97
TCHKTC                     DO   *HIVAL
TCHKTC           K#L97A    REDPEALDPP97                  95
TCHKTC   95                LEAVE
TCHKTC           AGSKJY    IFNE *BLANK
TCHKTC                     ITER
TCHKTC                     END
TCHKTC                     LEAVE
TCHKTC                     ENDDO
TCHKTC                     END
TCHKTC*
TCHKTC           *IN95     IFEQ *OFF
TCHKTC                     MOVE '19'      A5ERID
TCHKTC                     MOVE '03'      A5ERPS
TCHKTC                     TIME           WSDT
TCHKTC                     Z-ADDWSSDAT    A5KSDT
TCHKTC                     Z-ADDWSSTM6    A5KSTM
TCHKTC                     MOVELWORKER    A5OPER
TCHKTC           @D        IFEQ '1'
TCHKTC                     MOVELWWBRCD    A5SERL
TCHKTC                     MOVEL*BLANK    A52DBC
TCHKTC                     ELSE
TCHKTC                     MOVEL*BLANK    A5SERL
TCHKTC                     MOVELW2D       A52DBC
TCHKTC                     END
TCHKTC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
TCHKTC                     WRITEALDPP501
     C                     EXSR #AM#31
     C           PASFLG    IFEQ '1'
TCHKTC                     MOVELAGNC##    D95NC#
TCHKTC                     MOVELAGDEPT    D95DEP
TCHKTC                     EXFMTDSP95
TCHKTC                     MOVEL*BLANK    D95NC#
TCHKTC                     MOVEL*BLANK    D95DEP
TCHKTC           *INKH     IFEQ *OFF
TCHKTC                     MOVEL*ON       W@INKH
TCHKTC                     SETON                     3039
TCHKTC                     END
TCHKTC                     ELSE
TCHKTC                     SETON                     3039
TCHKTC           MSG@2     IFEQ *BLANK
TCHKTC                     MOVELERR,19    MSG@2
TCHKTC                     MOVE '19'      A5ERID
TCHKTC                     END
TCHKTC                     END
TCHKTC                     END
TCHKTC*
TCHKTC                     END
TCHKTC*
TCHKTC           *IN30     IFEQ *ON
      *
      *
TCHKTC           A5ERID    IFNE '19'
     C           A5ERID    ANDNE'27'
TCHKTC                     MOVE '03'      A5ERPS
TCHKTC                     TIME           WSDT
TCHKTC                     Z-ADDWSSDAT    A5KSDT
TCHKTC                     Z-ADDWSSTM6    A5KSTM
TCHKTC                     MOVELWORKER    A5OPER
TCHKTC           @D        IFEQ '1'
TCHKTC                     MOVELWWBRCD    A5SERL
TCHKTC                     MOVEL*BLANK    A52DBC
     C                     MOVE A5SERL    CHARS5  5
     C                     MOVE *BLANKS   SC1DTA250
TCHKTC                     ELSE
TCHKTC                     MOVEL*BLANK    A5SERL
TCHKTC                     MOVELW2D       A52DBC
     C                     MOVE *BLANKS   CHARS5
     C                     MOVELA52DBC    SC1DTA    P
TCHKTC                     END
TCHKTC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
TCHKTC                     WRITEALDPP501
 LC1  *
  |   * call pgm to get sequence number from toyota labl for last 5 chars of msg
     C           SC1DTA    IFNE *BLANKS
     C                     CALL 'AM#R09B'
     C                     PARM           SC1DTA
     C                     PARM           CHARS5
  |  C                     ENDIF
 LC1  *
     C* ERR CHECK  PASSWORD LOCK
     C                     Z-ADD1         P1PGM
     C                     MOVELMSG       P1ERR     P
     C                     MOVE CHARS5    P1ERR
     C                     MOVEL#PGM      P1PID     P
     C                     MOVELWORKER    P1KOME    P
     C                     Z-ADDWSDT      P1DTTM
     C                     CALL 'AM#R09'
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM
     C                     MOVEL*ON       W@ERCK  1
TCHKTC                     END
TCHKTC                     END
     C*
     C                     ENDSR
     C**************************************************************************
%3    **************************************************************************
 |    *  QR (APICS KANBAN)
 V    **************************************************************************
     C           @CHK33    BEGSR
      *
     C* ZETAI NO CHECK
     C           4         SUBSTAKAN:7    QRZETI  4 P
      *
     C                     MOVELQRZETI    W@ZETI
     C                     EXSR @CHK34
S1   C           A2ZETI    IFNE QRZETI
     C           W@EFLG    IFEQ '1'
     C                     SETON                     3039
 S2  C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     MOVE '01'      MSG
     C                     MOVE '01'      A5ERID
 E2  C                     ENDIF
E1   C                     ENDIF
E1   C                     ENDIF
      *
      *    QR --> CODE39
      *
     C                     MOVEL*BLANK    @@BARA
     C                     MOVEL*BLANK    @@BARB
     C                     MOVELAKAN      @@BARA
     C                     MOVEL*BLANK    P9BAR
     C                     MOVEL*BLANK    $$APBC 20
     C* CREATE CODE39
     C                     CALL 'UEXR13'
     C                     PARM           @@BARA256
     C                     PARM           @@BARB256
     C                     PARM           P9BAR  20
     C                     MOVELP9BAR     $$APBC 20
     C                     MOVELP9BAR     ##BC20
      *
      *
      *
S1   C           *IN30     IFEQ *OFF
     C                     MOVEL$$APBC    A3APBC
     C*
     C                     EXSR #DUPL
     C*
E1   C                     ENDIF
     C*
      *
      *  ERR
      *
S1   C           *IN30     IFEQ *ON
      *
     C                     MOVE '03'      A5ERPS
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KSDT
     C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
     C*
     C                     MOVEL*BLANK    A5SERL
     C                     MOVELAKAN      A52DBC
     C                     MOVE A5SERL    CHARS5
     C                     MOVELA52DBC    SC1DTA
     C*
     C                     MOVEL@9        A5FIL1
     C                     MOVELLAR01     A5FIL2
     C                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
      *
      * call pgm to get sequence number from toyota labl for last 5 chars of msg
  S3 C           SC1DTA    IFNE *BLANKS
     C                     CALL 'AM#R09B'
     C                     PARM           SC1DTA
     C                     PARM           CHARS5
  E3 C                     ENDIF
      *
     C* ERR CHECK  PASSWORD LOCK
     C                     Z-ADD1         P1PGM
     C                     MOVELMSG       P1ERR     P
     C                     MOVE CHARS5    P1ERR
     C                     MOVEL#PGM      P1PID     P
     C                     MOVELWORKER    P1KOME    P
     C                     Z-ADDWSDT      P1DTTM
     C                     CALL 'AM#R09'
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM 140
     C                     MOVEL*ON       W@ERCK  1
     C*
E1   C                     ENDIF
      *
     C                     ENDSR
%3    **************************************************************************
 |    *  QR (RE CHECK)
 V    **************************************************************************
     C           @CHK34    BEGSR
      *
     C                     MOVEL'1'       W@EFLG  1
      *
     C                     MOVELW@ZETI    K@ZETI
     C           K#A7      CHAINFCEPL071             98
     C           *IN98     IFEQ '0'
     C                     MOVELA7BHB1    K@SH11
     C                     MOVELA7BHB2    K@SH12
     C                     MOVELA7BHB3    K@SH13
     C                     MOVELA2BHB1    K@SH21
     C                     MOVELA2BHB2    K@SH22
     C                     MOVELA2BHB3    K@SH23
     C           K#X1      CHAINALDPP2X1             98
     C           *IN98     IFEQ '0'
     C                     MOVEL*BLANK    W@EFLG
     C                     ELSE
     C                     MOVELA2BHB1    K@SH11
     C                     MOVELA2BHB2    K@SH12
     C                     MOVELA2BHB3    K@SH13
     C                     MOVELA7BHB1    K@SH21
     C                     MOVELA7BHB2    K@SH22
     C                     MOVELA7BHB3    K@SH23
     C           K#X1      CHAINALDPP2X1             98
     C           *IN98     IFEQ '0'
     C                     MOVEL*BLANK    W@EFLG
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
%3    *----------------------------------------------------------------
↓  *  KANBAN DUPL   APICS STOP ALERT
      *----------------------------------------------------------------
     C           #DUPL     BEGSR
     C*
     C           K#DL3A    KLIST
     C                     KFLD           A@KANS  1
     C                     KFLD           A@ZETI  4
     C                     KFLD           A@TEHI  3
     C                     KFLD           A@PAGE  2
     C                     KFLD           A@2KAK  1
     C                     KFLD           A@TASY  1
     C                     KFLD           A@YUKO  1
     C                     KFLD           A@HASY  1
     C                     KFLD           W@L7YY
     C                     KFLD           W@L7MM
     C                     KFLD           W@L7DD
     C           K#DL3B    KLIST
     C                     KFLD           A@KANS
     C                     KFLD           A@ZETI
     C                     KFLD           A@TEHI
     C                     KFLD           A@PAGE
     C                     KFLD           A@2KAK
     C                     KFLD           A@TASY
     C                     KFLD           A@YUKO
     C                     KFLD           A@HASY
     C*
     C                     MOVELA3KANS    A@KANS
     C                     MOVELA3ZETI    A@ZETI
     C                     MOVELA3TEHI    A@TEHI
     C                     MOVELA3PAGE    A@PAGE
     C                     MOVELA32KAK    A@2KAK
     C                     MOVELA3TASY    A@TASY
     C                     MOVELA3YUKO    A@YUKO
     C                     MOVELA3HASY    A@HASY
      *
     C                     CALL 'BARR84'
     C                     PARM           A@KANS
     C                     PARM           A@ZETI
     C                     PARM           A@TEHI
     C                     PARM           A@PAGE
     C                     PARM           A@2KAK
     C                     PARM           A@TASY
     C                     PARM           A@YUKO
     C                     PARM           A@HASY
     C                     PARM           X#CHKD  1
     C                     PARM           X#BARC 20
      *
     C           K#DL3A    SETLLALDPL36
     C*
S1   C                     DO   *HIVAL
     C           K#DL3B    READEALDPL36                  95
     C   95                LEAVE
     C                     MOVE '17'      A5ERID
     C                     MOVE '03'      A5ERPS
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KSDT
     C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
 S2  C           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
     C                     MOVEL*BLANK    A52DBC
 X2  C                     ELSE
     C                     MOVEL*BLANK    A5SERL
     C                     MOVELW2D       A52DBC
 E2  C                     END
     C                     MOVEL@9        A5FIL1
     C                     MOVELLAR01     A5FIL2
     C                     MOVELBARKAX    A5FIL3
      *
      * this write has been taken out to avoid having error being logged twice
      *****************    WRITEALDPP501
      *
     C                     EXSR #AM#31
 S2  C           PASFLG    IFEQ '1'
     C                     MOVELERR,17    MSGX
     C                     MOVE '01'      MSGX
     C                     EXFMTDSP99
     C                     MOVE *BLANKS   MSGX
  S3 C           *INKH     IFEQ *OFF
     C                     MOVEL*ON       W@INKH
     C                     SETON                     3039
  E3 C                     END
 X2  C                     ELSE
     C                     SETON                     3039
  S3 C           MSG       IFEQ *BLANK
     C                     MOVELERR,17    MSG
     C                     MOVE '02'      MSG
     C                     MOVE '17'      A5ERID
  E3 C                     END
 E2  C                     END
E1   C                     LEAVE
     C                     ENDDO
     C*
     C* - JC SKIPPED ALERT ---------------------------------
     C*
     C* * *      #WSID     IFEQ 'HPIS1'
     C* * *      #USER     OREQ 'X'
     C* * *                ELSE
     C* * *                GOTO @JUMP
     C* * *                END
      *
     C* * *                CALL 'AAMRSK'
     C                     CALL 'AAMRSJ'
     C                     PARM X#BARC    E@BARC 20
     C                     PARM 'JC '     E@KOTE  3
     C                     PARM '0111'    E@BMON  4
     C                     PARM *BLANK    E@KIBN  3
     C                     PARM           E@RTN   1
     C*
     C           E@RTN     IFEQ '*'
     C                     CALL 'AJHRS1'
     C                     PARM X#BARC    E@BARC 20
     C                     PARM           E#RTN   1
     C                     PARM           E#WINY  40
     C                     PARM           E#WINM  20
     C                     PARM           E#WIND  20
     C                     PARM           E#WINJ  20
     C                     PARM           E#WINF  20
     C                     PARM           E#WMJY  20
     C                     PARM           E#MKKB  2
      *
     C           E#RTN     IFNE '*'
     C           MSG       IFEQ *BLANK
     C                     SETON                     30
     C                     MOVELERR,33    MSG
     C                     MOVE '33'      A5ERID
     C                     GOTO EDUPL
     C                     END
     C                     END
      *
     C                     END
     C*
     C           @JUMP     TAG
     C*
     C* - SEARCH ALERT MESSAGE -----------------------------
     C           K#DL9A    KLIST
     C                     KFLD           A@ZETI
     C                     KFLD           A@TEHI
     C                     MOVE ' '       @ALD96  1
     C           K#DL9A    SETGTALDPP96
     C*
S1   C                     DO   *HIVAL
     C*
     C           K#DL9A    REDPEALDPP96                  95
     C   95                LEAVE
 S2  C           AFSKJY    IFNE *BLANK
     C                     ITER
 E2  C                     END
     C           AFTYPE    IFEQ '1'                        1:STORE IN
     C                     ITER
     C                     ENDIF
     C                     MOVE '*'       @ALD96
     C                     MOVE '18'      A5ERID
     C                     MOVE '03'      A5ERPS
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KSDT
     C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
 S2  C           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
     C                     MOVEL*BLANK    A52DBC
 X2  C                     ELSE
     C                     MOVEL*BLANK    A5SERL
     C                     MOVELW2D       A52DBC
 E2  C                     END
     C                     MOVEL@9        A5FIL1
     C                     MOVELLAR01     A5FIL2
     C                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
     C                     EXSR #AM#31
 S2  C           PASFLG    IFEQ '1'
     C                     MOVELAFNC##    D95NC#
     C                     MOVELAFDEPT    D95DEP
     C                     EXFMTDSP95
     C                     MOVEL*BLANK    D95NC#
     C                     MOVEL*BLANK    D95DEP
  S3 C           *INKH     IFEQ *OFF
     C                     MOVEL*ON       W@INKH
     C                     SETON                     3039
  E3 C                     END
 X2  C                     ELSE
     C                     SETON                     3039
  S3 C           MSG@2     IFEQ *BLANK
     C                     MOVELERR,18    MSG@2
     C                     MOVE '18'      A5ERID
  E3 C                     END
 E2  C                     END
     C                     LEAVE
     C*
E1   C                     ENDDO
      *
      **** LOT# = BLANK ***
      *
     C           K#DL9B    KLIST
     C                     KFLD           A@ZETI
     C                     KFLD           K#TEHI
     C                     MOVE *BLANK    K#TEHI  3
S0   C           @ALD96    IFEQ ' '
     C           K#DL9B    SETGTALDPP96
     C*
S1   C                     DO   *HIVAL
     C*
     C           K#DL9B    REDPEALDPP96                  95
     C   95                LEAVE
 S2  C           AFSKJY    IFNE *BLANK
     C                     ITER
 E2  C                     END
     C           AFTYPE    IFEQ '1'                        1:STORE IN
     C                     ITER
     C                     ENDIF
     C                     MOVE '*'       @ALD96
     C                     MOVE '18'      A5ERID
     C                     MOVE '03'      A5ERPS
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KSDT
     C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
 S2  C           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
     C                     MOVEL*BLANK    A52DBC
 X2  C                     ELSE
     C                     MOVEL*BLANK    A5SERL
     C                     MOVELW2D       A52DBC
 E2  C                     END
     C                     MOVEL@9        A5FIL1
     C                     MOVELLAR01     A5FIL2
     C                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
     C                     EXSR #AM#31
 S2  C           PASFLG    IFEQ '1'
     C                     MOVELAFNC##    D95NC#
     C                     MOVELAFDEPT    D95DEP
     C                     EXFMTDSP95
     C                     MOVEL*BLANK    D95NC#
     C                     MOVEL*BLANK    D95DEP
  S3 C           *INKH     IFEQ *OFF
     C                     MOVEL*ON       W@INKH
     C                     SETON                     3039
  E3 C                     END
 X2  C                     ELSE
     C                     SETON                     3039
  S3 C           MSG@2     IFEQ *BLANK
     C                     MOVELERR,18    MSG@2
     C                     MOVE '18'      A5ERID
  E3 C                     END
 E2  C                     END
     C                     LEAVE
     C*
E1   C                     ENDDO
E0   C                     ENDIF
↑ C*
%3   C           EDUPL     ENDSR
     C**************************************************************************
     C*      SCREEN 4 (HONDA)
     C**************************************************************************
     C           @SCRN4    BEGSR
      *
     C                     EXFMTDSP04
     C*
   B1C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR @CHK4
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    HKAN
   B4C                     ELSE
     C                     EXSR @OUT
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------------
     C           @CHK4     BEGSR
      *--------------------------------------------------------
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C* EDIT PART NUMBER
     C                     Z-ADD2         K       20
     C                     Z-ADD0         L       20
     C                     MOVEABARHON    HON
     C                     MOVEA*BLANK    HNO
B03  C           2         DO   19        K
B04  C           HON,K     IFNE ' '
     C           HON,K     ANDNE'-'
     C                     ADD  1         L
     C                     MOVE HON,K     HNO,L
E04  C                     END
E03  C                     END
     C*
     C* GET CUTOMER CODE FROM DELIVERY CODE
     C*
     C                     MOVE *BLANK    PTOKU
     C                     MOVE *BLANK    PNONY
     C                     MOVE *BLANK    PNKOJ
     C                     MOVE *BLANK    PMHIN
     C                     MOVE *BLANK    PSHIN
     C                     MOVE *BLANK    PFLG
     C*
     C           WELIVL    SETLLGADPP111
     C           #READ1    TAG
     C           WELIVL    READEGADPP111                 92
B03  C           *IN92     IFEQ '0'
B04  C           B5SKJY    IFEQ 'D'
     C                     GOTO #READ1
E04  C                     END
     C*
     C                     MOVE B5TOKU    PTOKU
     C                     MOVE B5NONY    PNONY
     C                     MOVE B5NKOJ    PNKOJ
     C                     MOVE DOCK      PNUKE
     C                     MOVEAHNO       PMHIN
E03  C                     END
     C*
     C* EXCHANGE USER PART # TO IAF PART
     C                     CALL 'BBHR50'  P1
     C                     MOVE PSHIN     WKPNO
     C*
     C* GET ABSOLUTE NUMBER
     C                     SETOF                     89
     C           KEY1      SETLLFCEPL011
     C           #READ2    TAG
     C           KEY1      READEFCEPL011                 93
B03  C           *IN93     IFEQ '0'
B04  C           A2GSKD    IFNE 'D'
     C*
     C* CHECK ABSOLUTE #(HONDA LABEL & AIAG)
     C                     SETON                     89
B05  C           A2ZETI    IFEQ IDCD
     C                     SETON                     26
     C*
     C                     ELSE
     C                     SETON                     30
B06  C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
JW2  C                     MOVE '03'      MSG
     C                     MOVE '04'      A5ERID
     C                     END
     C                     END
     C*
     C                     ELSE
     C                     GOTO #READ2
     C                     END
E03  C                     END
     C*
     C           *IN89     IFEQ '0'
     C                     SETON                     30
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
JW2  C                     MOVE '04'      MSG
      *
     C                     MOVE '04'      A5ERID
     C*
     C                     END
     C                     END
     C*
     C           *IN30     IFEQ *ON
     C                     MOVE '04'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
     C                     MOVE *BLANK    BARHON
     C                     ENDIF
     C*
     C                     ENDSR
     C**************************************************************************
TCH12C*      DENSO  / TMI
     C**************************************************************************
     C           @SCRN5    BEGSR
      * DENSO
     C           DELIVL    IFEQ '3032'
JW   C           DELIVL    OREQ '3062'
JW   C           DELIVL    OREQ '3063'
JW   C           DELIVL    OREQ '3070'
JW   C           DELIVL    OREQ '3076'
JW   C           DELIVL    OREQ '3086'
     C           DELIVL    OREQ '3092'
     C                     MOVELSHP,1     D@SHTO
     C                     ELSE
     C                     MOVELSHP,2     D@SHTO
     C                     ENDIF
     C                     EXFMTDSP05
     C*
   B1C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR @CHK5
     C           *IN30     IFEQ *ON
     C                     EXFMTDSP98
     C                     MOVE *BLANK    MSG
     C                     MOVE *BLANK    DKAN
   B4C                     ELSE
     C                     EXSR @OUT
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------------
     C           @CHK5     BEGSR
      *--------------------------------------------------------
     C                     SETOF                     30
     C                     MOVE *BLANK    MSG
     C* EDIT PART NUMBER
      * DENSO
B0   C           DELIVL    IFEQ '3032'
JW   C           DELIVL    OREQ '3062'
JW   C           DELIVL    OREQ '3063'
JW   C           DELIVL    OREQ '3070'
JW   C           DELIVL    OREQ '3076'
JW   C           DELIVL    OREQ '3086'
     C           DELIVL    OREQ '3092'
     C                     Z-ADD2         K       20
     C                     Z-ADD0         L       20
     C                     MOVEABARDEN    DEN
     C                     MOVEA*BLANK    DNO
TCHLTC*B1        2         DO   14        K
TCHLTC           2         DO   20        K
B2   C           DEN,K     IFNE ' '
     C           DEN,K     ANDNE'-'
     C                     ADD  1         L
     C                     MOVE DEN,K     DNO,L
E2   C                     END
E1   C                     END
     C*
     C                     MOVEADNO       @@DMHN 20 P
B1   C           @@DMHN    IFNE @@MHIN
     C                     SETON                     30
     C                     MOVELERR,4     MSG
JW2  C                     MOVE '05'      MSG
      *
     C                     MOVE '04'      A5ERID
     C                     MOVE '04'      A5ERPS
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSDAT    A5KSDT
TCHK8C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
TCHKDC           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
TCHKDC                     MOVEL*BLANK    A52DBC
TCHKDC                     ELSE
TCHKDC                     MOVEL*BLANK    A5SERL
TCHKDC                     MOVELW2D       A52DBC
TCHKDC                     END
TCHKDC                     MOVEL@9        A5FIL1
TCHKDC                     MOVELLAR01     A5FIL2
TCHKDC                     MOVELBARKAX    A5FIL3
     C                     WRITEALDPP501
E1   C                     ENDIF
      *
E0   C                     ENDIF
      *
     C                     ENDSR
TCHKSC**************************************************************************
TCHKSC*      SCREEN 6 (QSS : QR CODE)
TCHKSC**************************************************************************
TCHKSC           @SCRN6    BEGSR
TCHKSC*
TCHKSC                     EXFMTDSP06
TCHKSC*
TCHKSC                     SELEC
TCHKSC           *INKC     WHEQ *ON
TCHKSC                     MOVE '99'      @@ID
TCHKSC           *INKD     WHEQ *ON
TCHKSC                     CLEARDSP01
TCHKSC                     CLEARDSP02
TCHKSC                     CLEARDSP03
TCHKSC                     CLEARDSP06
TCHKSC                     MOVE '01'      @@ID
TCHKSC                     OTHER
TCHKSC                     EXSR @CHK6
TCHKSC           *IN30     IFEQ *ON
TCHKSC                     EXFMTDSP98
TCHKSC                     MOVEL*BLANK    MSG
TCHKSC                     CLEARDSP06
TCHKSC                     ELSE
TCHKSC                     EXSR @OUT
TCHKSC                     END
TCHKSC                     ENDSL
TCHKSC*
TCHKSC                     ENDSR
TCHKSC*--------------------------------------------------------
TCHKSC           @CHK6     BEGSR
TCHKSC*--------------------------------------------------------
TCHKSC                     SETOF                     30
TCHKSC                     MOVE *BLANK    MSG
TCHKSC*
TCHKSC                     DO
TCHKSC*
TCHKSC                     Z-ADD*ZERO     II      30
TCHKSC                     Z-ADD*ZERO     XX      30
TCHKSC                     Z-ADD*ZERO     YY      30
TCHKSC                     Z-ADD*ZERO     ZZ      30
TCHKSC                     MOVEL*BLANK    W@MHIN
TCHKSC                     MOVEL*BLANK    W@NYMD
TCHKSC                     MOVEL*BLANK    W@SRL# 14
TCHKSC                     SETOF                     8889
TCHKSC                     MOVEAQRC       QRA
TCHKSC*
TCHKSC           QRC       IFEQ *BLANK
TCHKSC                     MOVELERR,20    MSG
JW2  C                     MOVE '01'      MSG
TCHKSC                     SETON                     3089
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC*
TCHKSC                     Z-ADD1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC                     ADD  1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC           II        ADD  1         XX
TCHKSC*PART#
TCHKSC           QRA,XX    IFNE 'P'
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC                     MOVEL*BLANK    Q20
TCHKSC                     Z-ADD*ZERO     YY
TCHKSC                     DO   *HIVAL
TCHKSC                     ADD  1         XX
TCHKSC           QRA,XX    IFEQ *BLANK
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC           QRA,XX    IFEQ '-'
TCHKSC                     ITER
TCHKSC                     END
TCHKSC                     ADD  1         YY
TCHKSC                     MOVELQRA,XX    Q20,YY
TCHKSC                     ENDDO
TCHKSC                     MOVEAQ20       W@MHIN
TCHKSC*
TCHKSC                     ADD  1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC                     ADD  1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC                     ADD  1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC* SHIP DATE
TCHKSC           II        ADD  1         YY
TCHKSC           II        ADD  2         ZZ
TCHKSC           QRA,YY    IFEQ '2'
TCHKSC           QRA,ZZ    ANDEQ'D'
TCHKSC                     ELSE
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC           ZZ        ADD  1         XX
TCHKSC                     MOVEAQRA,XX    W@NYMD
TCHKSC*
TCHKSC                     ADD  1         II
TCHKSC           ' '       LOKUPQRA,II                   88
TCHKSC  N88                LEAVE
TCHKSC* SERIAL#
TCHKSC           II        ADD  1         XX
TCHKSC           QRA,XX    IFNE 'S'
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC                     MOVEL*BLANK    Q20
TCHKSC                     Z-ADD*ZERO     YY
TCHKSC                     DO   *HIVAL
TCHKSC                     ADD  1         XX
TCHKSC           QRA,XX    IFEQ *BLANK
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC                     ADD  1         YY
TCHKSC                     MOVELQRA,XX    Q20,YY
TCHKSC                     ENDDO
TCHKSC                     MOVEAQ20       W@SRL# 14
TCHKSC*
TCHKSC                     MOVEL*ON       *IN89
TCHKSC*
TCHKSC                     ENDDO
TCHKSC*
TCHKSC                     DO
TCHKSC*
TCHKSC           *IN89     IFEQ *OFF
TCHKSC                     MOVELERR,20    MSG
JW2  C                     MOVE '02'      MSG
TCHKSC                     MOVEL*ON       *IN30
TCHKSC                     MOVEL'1'       W@ECOD  1
TCHKSC                     EXSR @QSSER
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC*
TCHKSC                     MOVELEKNOYY    W@A04A  4
TCHKSC                     MOVELEKNOMM    W@A02A  2
TCHKSC                     MOVELEKNODD    W@A02B  2
TCHKSC           W@A04A    IFEQ W@NOYY
TCHKSC           W@A02A    ANDEQW@NOMM
TCHKSC           W@A02B    ANDEQW@NODD
TCHKSC           EKMHN1    ANDEQW@MHN1
TCHKSC           EKMHN2    ANDEQW@MHN2
TCHKSC           EKMHN3    ANDEQW@MHN3
TCHKSC           EKMHN4    ANDEQW@MHN4
TCHKSC                     ELSE
TCHKSC                     MOVELERR,13    MSG
JW1  C                     MOVE '04'      MSG
TCHKSC                     MOVEL*ON       *IN30
TCHKSC                     MOVEL'2'       W@ECOD  1
TCHKSC                     EXSR @QSSER
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC*
TCHKSC           W@SRL#    SETLLALDPL45
TCHKSC                     DO   *HIVAL
TCHKSC           W@SRL#    READEALDPL45                  96
TCHKSC   96                LEAVE
TCHKSC           AEERR     IFEQ *BLANK
TCHKSC                     MOVELERR,8     MSG
JW2  C                     MOVE '05'      MSG
TCHKSC                     MOVEL*ON       *IN30
TCHKSC                     MOVEL'2'       W@ECOD  1
TCHKSC                     EXSR @QSSER
TCHKSC                     LEAVE
TCHKSC                     END
TCHKSC                     ENDDO
TCHKSC*
TCHKSC                     ENDDO
TCHKSC*
TCHKSC                     ENDSR
     C**************************************************************************
     C*    TOTAL
     C**************************************************************************
     C           #TOT      BEGSR
     C*
     C           120       SUB  TOTAL     EMPTY
     C                     Z-ADD120       GTOTL
     C*
     C                     ENDSR
     C**************************************************************************
     C*     WRITE
     C**************************************************************************
     C           @OUT      BEGSR
JW4   * CHARTER STEEL STORE OUT
JW4  C                     EXSR #CHRTU
      *
     C           @D        IFEQ '1'
     C                     EXSR @WRT
     C                     ELSE
     C                     EXSR @WRTX
     C                     ENDIF
      *
      * check last process.
     C                     EXSR @CHKLP
      *
      * remove from overflow area if scanned to it.
     C                     MOVEL#PGM      P#PGM  10 P
     C                     CALL 'ALDR9U'
     C                     PARM           WORKER
     C                     PARM           P#PGM
     C                     PARM           ##BC20
      *
     C                     ADD  1         TOTAL
     C                     CLEARDSP01
     C                     CLEARDSP02
     C                     CLEARDSP03
     C                     CLEARDSP04
     C                     CLEARDSP05
TCHKSC                     CLEARDSP06
      *
     C                     EXFMTDSP97
     C                     MOVE '01'      @@ID
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT
     C**************************************************************************
     C           @WRT      BEGSR
     C*
     C                     MOVE *BLANK    @@SERL 18
     C           BARCD0    SETLLAB#PL71
     C           *IN90     DOUEQ*ON
     C           BARCD0    READEAB#PL71                  90
     C           *IN90     IFEQ *OFF
     C           EKSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C           EKDEYY    IFNE *ZERO
     C                     ITER
     C                     ELSE
     C                     TIME           WSDT
      * DO NOT CAHNGE DATE AND TIME TO KEEP CREATE DATE AND TIME
JW1  C**                   Z-ADDWSSYYY    EKKOYY
 .   C**                   Z-ADDWSSMMM    EKKOMM
 .   C**                   Z-ADDWSSDDD    EKKODD
 .   C**                   Z-ADDWSSHHH    EKKOHH
JW1  C**                   Z-ADDWSSNNN    EKKOMN
      * SCAN DATE AND TIME
     C                     MOVEL#USER     EKKOME
TCHK8C                     Z-ADDWSSYYY    EKDEYY
TCHK8C                     Z-ADDWSSMMM    EKDEMM
TCHK8C                     Z-ADDWSSDDD    EKDEDD
TCHK8C                     Z-ADDWSSTM6    EKDETM
      *
     C                     MOVE EKSYOS    EKSRYO
     C*
     C           BARKBN    IFNE 'I'
TCHLSC           BARKBN    ANDNE'S'
     C*
     C           BARQR     IFNE 'C01'
%0003C           BARQR     ANDNE'F01'
     C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
     C                     ENDIF
     C                     MOVELA3TEHI    EKLTNO
     C                     MOVELA3PAGE    EKISNO
     C*
     C                     ELSE
     C                     MOVE IIAF      WIAF             IAF KANBAN
     C                     MOVE A1LOTN    EKLTNO
     C                     ENDIF
     C*
     C                     UPDATAB#PP701
JW7   * LOG FILE
 .   C                     MOVEL'CHG'     LOGFLG  1
 .   C                     EXSR @PP70L
      *
     C                     MOVE EKSERL    @@SERL 18
TCHKSC           EKNONY    IFEQ '4044'
TCHKSC                     EXSR @QSSOT
TCHK2C                     END
TCHLAC           EKNONY    IFEQ '0170'
TCHLAC                     EXSR @ACZ#1
TCHLAC                     END
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C           @I        IFEQ '2'
     C                     EXSR @WRTE1                     IAF FILE
     C                     ELSE
     C                     EXSR @WRTE2                     APICS FILE
     C                     END
     C*
     C                     ADD  1         TOTAL
     C*
     C                     CLEARDSP01
     C                     CLEARDSP02
     C                     CLEARDSP03
     C                     CLEARDSP04
     C                     CLEARDSP05
TCHKSC                     CLEARDSP06
      *
     C                     ENDSR
     C**************************************************************************
     C*   TOYOTA E-KANBAN  @WRT(IAF KANBAN FILE)
     C**************************************************************************
     C           @WRTE1    BEGSR
     C*
     C                     CLEARALDPP201
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A1KSYY
     C                     Z-ADDWSSMMM    A1KSMM                  MONTH
     C                     Z-ADDWSSDDD    A1KSDD                  DAY
     C                     Z-ADDWSSHHH    A1KSJI                  HOUR
     C                     Z-ADDWSSNNN    A1KSPN                  MINUTE
     C                     MOVELWUSRID    A1KSNA           AS USER-ID
     C                     MOVE 'ALDR2Z'  A1KSNA           AS USER-ID
     C                     MOVE EKSHN1    A1SHN1           INTERNAL PART
     C                     MOVE EKSHN2    A1SHN2           INTERNAL PART
     C                     MOVE EKSHN3    A1SHN3           INTERNAL PART
TCHK8C                     Z-ADDWSSYYY    A1SYYY
TCHK8C                     Z-ADDWSSMMM    A1SYMM
TCHK8C                     Z-ADDWSSDDD    A1SYDD
     C                     Z-ADDWSSHHH    A1SYJI
     C                     Z-ADDWSSNNN    A1SYFN
     C                     MOVE IIAF      WIAF             IAF KANBAN
     C* FINISHED STORAGE(PART MASTER LOCATION)
     C                     MOVE EKLOC1    A1TKR1           NEW
     C                     MOVE EKLOC2    A1TKR2
     C                     MOVE EKLOC3    A1TKR3
     C                     MOVE EKLOC4    A1TKR4
     C*
     C                     MOVE WORKER    A1OPER           WORKER
     C                     MOVE *BLANK    A1MHN1           USER PART
     C                     MOVE *BLANK    A1MHN2
     C                     MOVE *BLANK    A1MHN3
     C                     MOVE *BLANK    A1MHN4
      *
     C                     MOVE EKMHN1    A1MHN1           USER PART
     C                     MOVE EKMHN2    A1MHN2
     C                     MOVE EKMHN3    A1MHN3
     C                     MOVE EKMHN4    A1MHN4
     C                     MOVE EKSYOS    A1SSYS           UNIT QTY
     C                     MOVE EKSYOS    A1USYS           USER UNIT QTY
     C                     MOVE EKNONY    A1NONY           DELIVERY POINY
     C                     MOVE EKNKOJ    A1NKOJ                    FACTORY
     C                     MOVE EKNUKE    A1NUKE                    RECV
     C           EKNONY    CAT  EKNUKE:0  A1TOPX    P      TOPIX CODE
     C                     MOVE *BLANK    A1SALE           EFU/KANBAN
     C                     MOVE *BLANK    A1UPAG           BOTTOM KANBAN ISSU#
     C                     MOVE @@SERL    A1SERL
     C                     WRITEALDPP201
      *
     C                     EXSR #ASJ
     C                     EXSR UPDSHI
     C*
     C                     ENDSR
     C**************************************************************************
     C*   TOYOTA E-KANBAN  @WRT(A-PICS,KOTENAI KANBAN FILE)
     C**************************************************************************
     C           @WRTE2    BEGSR
     C*
     C                     CLEARALDPP301
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A3KSYY
     C                     Z-ADDWSSMMM    A3KSMM                  MONTH
     C                     Z-ADDWSSDDD    A3KSDD                  DAY
     C                     Z-ADDWSSHHH    A3KSJI                  HOUR
     C                     Z-ADDWSSNNN    A3KSPN                  MINUTE
TCHKGC                     MOVEL#PGM      A3UPGM    P      UPDATE PGM
     C                     MOVE WORKER    A3OPER           WORKER
     C                     MOVELWUSRID    A3OPNM           OPERATOR NAME
%3    *
 |   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     MOVELAKAN      A3APQR           QR
 |   C                     MOVEL$$APBC    A3APBC
 |   C                     ELSE
 |   C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
 |   C                     MOVELW3CHKD    A3CHKD           CHECK DIGIT
 |   C                     ENDIF
%3    *
     C                     MOVE EKSHN1    A3SHN1           INTERNAL PART
     C                     MOVE EKSHN2    A3SHN2           INTERNAL PART
     C                     MOVE EKSHN3    A3SHN3           INTERNAL PART
TCHK8C                     Z-ADDWSSYYY    A3SYYY
TCHK8C                     Z-ADDWSSMMM    A3SYMM
TCHK8C                     Z-ADDWSSDDD    A3SYDD
     C                     Z-ADDWSSHHH    A3SYJI           BIN
     C                     Z-ADDWSSNNN    A3SYFN
     C* FINISHED STORAGE(PART MASTER LOCATION)
     C                     MOVE EKLOC1    A3TKR1           NEW
     C                     MOVE EKLOC2    A3TKR2
     C                     MOVE EKLOC3    A3TKR3
     C                     MOVE EKLOC4    A3TKR4
     C*
     C                     MOVE *BLANK    A3MHN1           USER PART
     C                     MOVE *BLANK    A3MHN2
     C                     MOVE *BLANK    A3MHN3
     C                     MOVE *BLANK    A3MHN4
     C                     MOVE EKMHN1    A3MHN1           USER PART
     C                     MOVE EKMHN2    A3MHN2
     C                     MOVE EKMHN3    A3MHN3
     C                     MOVE EKMHN4    A3MHN4
     C                     MOVE EKSYOS    A3SSYS           UNIT QTY
     C                     MOVE EKSYOS    A3USYS           USER UNIT QTY
     C                     MOVE EKNONY    A3NONY           DELIVERY POINY
     C                     MOVE EKNKOJ    A3NKOJ                    FACTORY
     C                     MOVE EKNUKE    A3NUKE                    RECV
     C           EKNONY    CAT  EKNUKE:0  A3TOPX    P      TOPIX CODE
     C                     MOVE *BLANK    A3SALE           EFU/KANBAN
     C                     MOVE @@SERL    A3SERL
     C                     WRITEALDPP301
     C*
%0001C                     MOVEL*OFF      OUTJ    1
     C*
TCHLHC           B2D       SETLLALDPP65
TCHLHC                     DO   *HIVAL
TCHLHC           B2D       READEALDPP65                  99
TCHLHC   99                LEAVE
TCHLHC           AFRDAT    IFEQ *ZERO
TCHLHC                     Z-ADDWSSDAT    AFDATE
TCHLHC                     Z-ADDWSSTM6    AFTIME
TCHLHC                     MOVELWUSRID    AFUSER
TCHLHC                     MOVEL#WSID     AFWSID
TCHLHC                     MOVEL#PGM      AFPGID    P
TCHLHC                     MOVELWORKER    AFTMCD
TCHLHC*
TCHLHC                     MOVELWAPICS    AFAKAN
TCHLHC                     MOVELA3ZETI    AFAZET
TCHLHC                     MOVELA3TEHI    AFALOT
TCHLHC                     MOVELA3PAGE    AFAPAG
TCHLHC                     Z-ADDWSSDAT    AFRDAT
TCHLHC                     Z-ADDWSSTM6    AFRTIM
TCHLHC                     MOVELWORKER    AFRTMC
TCHLHC*
TCHLHC                     UPDATALDPP651
%0001C                     MOVEL*ON       OUTJ
      *
TCHLHC                     ENDIF
TCHLHC                     LEAVE
TCHLHC                     ENDDO
     C*
%0001C* FOR HONDA LABEL (1ST OR 2ND)
     C           W@HND     IFEQ *ON
     C                     MOVEL*BLANK    HOUTS
     C                     MOVELB2D       HOUTS
     C*
     C                     SELEC
     C           HSRHN     WHEQ 'A'                        -IF01
     C                     MOVEL'B'       HSRHN            -IF01
     C           HSRHN     WHEQ 'B'                        -IF01
     C                     MOVEL'A'       HSRHN            -IF01
     C                     ENDSL
     C*
     C           HOUTS     SETLLALDPP65
     C                     DO   *HIVAL
     C           HOUTS     READEALDPP65                  99
     C   99                LEAVE
     C           AFRDAT    IFEQ *ZERO
     C                     Z-ADDWSSDAT    AFDATE
     C                     Z-ADDWSSTM6    AFTIME
     C                     MOVELWUSRID    AFUSER
     C                     MOVEL#WSID     AFWSID
     C                     MOVEL#PGM      AFPGID    P
     C                     MOVELWORKER    AFTMCD
     C*
     C                     MOVELWAPICS    AFAKAN
     C                     MOVELA3ZETI    AFAZET
     C                     MOVELA3TEHI    AFALOT
     C                     MOVELA3PAGE    AFAPAG
     C                     Z-ADDWSSDAT    AFRDAT
     C                     Z-ADDWSSTM6    AFRTIM
     C                     MOVELWORKER    AFRTMC
     C*
     C                     UPDATALDPP651
%0001C                     MOVEL*ON       OUTJ
     C                     ENDIF
     C                     LEAVE
     C                     ENDDO
     C                     ENDIF
      *
     C* IF THERE IS NO SHORTAGE, ORDER ENTRY NEEDS TO BE WRITTEN
%0001C           OUTJ      IFEQ *OFF
     C                     MOVEL'1'       W@SETF
     C* A-PICS2
     C           A3YUKO    IFEQ '2'
%0003C                     EXSR @CA#11
     C* A-PICS1
     C                     ELSE
     C                     EXSR @AU#11
     C                     ENDIF
     C*
     C                     ENDIF
     C*
      *
     C                     EXSR #ASJ#2
      *
     C                     EXSR UPDSHP
%0003C* A-PICS2
     C           A3YUKO    IFEQ '2'
     C                     EXSR @CA#01
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*                    @WRT(IAF KANBAN FILE)
     C**************************************************************************
     C           @WRT2     BEGSR
      *
     C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
     C                     MOVELQRZETI    K@ZETI
     C                     ELSE
     C                     MOVELIDNO7     K@ZETI
     C                     ENDIF
     C           K#A7      CHAINFCEPL071             98
     C*
     C                     CLEARALDPP201
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A1KSYY
     C                     Z-ADDWSSMMM    A1KSMM                  MONTH
     C                     Z-ADDWSSDDD    A1KSDD                  DAY
     C                     Z-ADDWSSHHH    A1KSJI                  HOUR
     C                     Z-ADDWSSNNN    A1KSPN                  MINUTE
     C                     MOVELWUSRID    A1KSNA           AS USER-ID
     C                     MOVE 'ALDR2Z'  A1KSNA           AS USER-ID
     C                     MOVE A7BHB1    A1SHN1           INTERNAL PART
     C                     MOVE A7BHB2    A1SHN2           INTERNAL PART
     C                     MOVE A7BHB3    A1SHN3           INTERNAL PART
TCHK8C                     Z-ADDWSSYYY    A1SYYY
TCHK8C                     Z-ADDWSSMMM    A1SYMM
TCHK8C                     Z-ADDWSSDDD    A1SYDD
     C                     Z-ADDWSSHHH    A1SYJI
     C                     Z-ADDWSSNNN    A1SYFN
     C                     MOVE IIAF      WIAF             IAF KANBAN
     C* FINISHED STORAGE(PART MASTER LOCATION)
     C           WSDATE    IFGE W7DATE
     C                     MOVE A7STRK    A1TKR1           NEW
     C                     MOVE A7STRT    A1TKR2
     C                     MOVE A7STRR    A1TKR3
     C                     MOVE A7STRD    A1TKR4
     C*
     C                     ELSE
     C                     MOVE A7STRK    A1TKR1           OLD
     C                     MOVE A7STRT    A1TKR2
     C                     MOVE A7STRR    A1TKR3
     C                     MOVE A7STRD    A1TKR4
     C                     END
     C*
     C                     MOVE WORKER    A1OPER           WORKER
     C                     MOVE *BLANK    A1MHN1           USER PART
     C                     MOVE *BLANK    A1MHN2
     C                     MOVE *BLANK    A1MHN3
     C                     MOVE *BLANK    A1MHN4
     C                     Z-ADDHQTY      A1SSYS           UNIT QTY
     C                     Z-ADDHQTY      A1USYS           USER UNIT QTY
     C                     MOVE DELIVL    A1NONY           DELIVERY POINY
     C                     MOVE FACTRY    A1NKOJ                    FACTORY
     C                     MOVE DOCK      A1NUKE                    RECV
     C                     MOVE *BLANK    A1TOPX           TOPIX CODE
     C                     MOVE *BLANK    A1SALE           EFU/KANBAN
     C                     MOVE *BLANK    A1UPAG           BOTTOM KANBAN ISSU#
     C                     MOVE @@SERL    A1SERL
     C                     WRITEALDPP201
     C*
     C                     EXSR #ASJ
     C                     EXSR UPDSHI
     C*
     C                     ENDSR
     C**************************************************************************
     C* QR                 @WRT(A-PICS,KOTENAI KANBAN FILE)
     C**************************************************************************
     C           @WRT3     BEGSR
      *
     C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
     C                     MOVELQRZETI    K@ZETI
     C                     ELSE
     C                     MOVELIDNO7     K@ZETI
     C                     ENDIF
     C           K#A7      CHAINFCEPL071             98
     C*
     C                     CLEARALDPP301
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A3KSYY
     C                     Z-ADDWSSMMM    A3KSMM                  MONTH
     C                     Z-ADDWSSDDD    A3KSDD                  DAY
     C                     Z-ADDWSSHHH    A3KSJI                  HOUR
     C                     Z-ADDWSSNNN    A3KSPN                  MINUTE
TCHKGC                     MOVEL#PGM      A3UPGM    P      UPDATE PGM
     C                     MOVE WORKER    A3OPER           WORKER
     C                     MOVELWUSRID    A3OPNM           WORKER NAME
%3    *
 |   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     MOVELAKAN      A3APQR           QR
 |   C                     MOVEL$$APBC    A3APBC
 |   C                     ELSE
 |   C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
 |   C                     MOVELW3CHKD    A3CHKD           CHECK DIGIT
 |   C                     ENDIF
%3    *
     C                     MOVE A7BHB1    A3SHN1           INTERNAL PART
     C                     MOVE A7BHB2    A3SHN2           INTERNAL PART
     C                     MOVE A7BHB3    A3SHN3           INTERNAL PART
TCHK8C*                    Z-ADDSYY       A3SYYY
TCHK8C*                    Z-ADDSMM       A3SYMM
TCHK8C*                    Z-ADDSDD       A3SYDD
TCHK8C                     Z-ADDWSSYYY    A3SYYY
TCHK8C                     Z-ADDWSSMMM    A3SYMM
TCHK8C                     Z-ADDWSSDDD    A3SYDD
     C                     Z-ADDWSSHHH    A3SYJI           BIN
     C                     Z-ADDWSSNNN    A3SYFN
     C* FINISHED STORAGE(PART MASTER LOCATION)
     C           WSDATE    IFGE W7DATE
     C                     MOVE A7STRK    A3TKR1           NEW
     C                     MOVE A7STRT    A3TKR2
     C                     MOVE A7STRR    A3TKR3
     C                     MOVE A7STRD    A3TKR4
     C*
     C                     ELSE
     C                     MOVE A7STRK    A3TKR1           OLD
     C                     MOVE A7STRT    A3TKR2
     C                     MOVE A7STRR    A3TKR3
     C                     MOVE A7STRD    A3TKR4
     C                     END
     C*
     C                     MOVE *BLANK    A3MHN1           USER PART
     C                     MOVE *BLANK    A3MHN2
     C                     MOVE *BLANK    A3MHN3
     C                     MOVE *BLANK    A3MHN4
     C                     MOVELK@MHN1    A3MHN1           USER PART
     C                     MOVELK@MHN2    A3MHN2
     C                     MOVELK@MHN3    A3MHN3
     C                     MOVELK@MHN4    A3MHN4
     C                     Z-ADDHQTY      A3SSYS           UNIT QTY
     C                     Z-ADDHQTY      A3USYS           USER UNIT QTY
     C                     MOVE DELIVL    A3NONY           DELIVERY POINY
     C                     MOVE FACTRY    A3NKOJ                    FACTORY
     C                     MOVE DOCK      A3NUKE                    RECV
     C                     MOVE *BLANK    A3TOPX           TOPIX CODE
     C                     MOVE *BLANK    A3SALE           EFU/KANBAN
     C                     MOVE @@SERL    A3SERL
     C                     WRITEALDPP301
     C*
%0001C                     MOVEL*OFF      OUTJ    1
     C*
TCHLHC           B2D       SETLLALDPP65
TCHLHC                     DO   *HIVAL
TCHLHC           B2D       READEALDPP65                  99
TCHLHC   99                LEAVE
TCHLHC           AFRDAT    IFEQ *ZERO
TCHLHC                     Z-ADDWSSDAT    AFDATE
TCHLHC                     Z-ADDWSSTM6    AFTIME
TCHLHC                     MOVELWUSRID    AFUSER
TCHLHC                     MOVEL#WSID     AFWSID
TCHLHC                     MOVEL#PGM      AFPGID    P
TCHLHC                     MOVELWORKER    AFTMCD
TCHLHC*
TCHLHC                     MOVELWAPICS    AFAKAN
TCHLHC                     MOVELA3ZETI    AFAZET
TCHLHC                     MOVELA3TEHI    AFALOT
TCHLHC                     MOVELA3PAGE    AFAPAG
TCHLHC                     Z-ADDWSSDAT    AFRDAT
TCHLHC                     Z-ADDWSSTM6    AFRTIM
TCHLHC                     MOVELWORKER    AFRTMC
     C*
TCHLHC                     UPDATALDPP651
%0001C                     MOVEL*ON       OUTJ
     C*
TCHLHC                     ENDIF
TCHLHC                     LEAVE
TCHLHC                     ENDDO
     C*
     C* NO OUTSTANDING (NO SHORTAGE)
%0001C           OUTJ      IFEQ *OFF
     C                     MOVEL'1'       W@SETF
     C* A-PICS2
     C           A3YUKO    IFEQ '2'
%0003C                     EXSR @CA#11
     C*
     C                     ELSE
     C* A-PICS1
TCHL5C                     EXSR @AU#11
     C                     ENDIF
      *
TCHLHC                     ENDIF
      * WRITE PT ORDER
     C                     EXSR #ASJ#2
      * UPDATE NZUPP01
     C                     EXSR UPDSHP
%0003C* UPDATE A-PICS2 STATUS
     C           A3YUKO    IFEQ '2'
     C                     EXSR @CA#01
     C                     ENDIF
      *
     C                     ENDSR
      **************************************************************************
      *  Check to see if Last Process is not at IAF, if not write to Out-
      *       going file.
      *
     C           @CHKLP    BEGSR
      *
      * key list
     C           K@AAMP    KLIST
     C                     KFLD           EKSHN1
     C                     KFLD           EKSHN2
     C                     KFLD           EKSHN3
      *
      * get process codes for part number...
     C           K@AAMP    CHAINAAMPL11              51
     C           *IN51     IFEQ *OFF
      *
     C                     Z-ADD*ZERO     LASTPR  40
     C                     Z-ADD*ZERO     BX      40
      *
      * find last process code for part number...
     C                     DO   15        BX
      *
     C           BMN,BX    IFNE *ZERO
     C                     Z-ADDBMN,BX    LASTPR
     C                     ELSE
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
      * if last process is not done at IAF, then write to retrieval outgoing fil
     C           LASTPR    IFNE *ZERO
     C           LASTPR    ANDNE111
     C                     EXSR @WRTRV
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      **************************************************************************
      *   Write to Retrieval Out Going File.
      *
     C           @WRTRV    BEGSR
      *
     C                     CLEARALDPP791
      *
     C                     Z-ADDWSSDAT    ARKODT           update date
     C                     Z-ADDWSSTM6    ARKOTM           update time
     C                     MOVELWORKER    ARWKCD           worker code
     C                     MOVELWUSRID    ARWKNM           worker name
     C                     MOVEL#PGM      ARPGID    P      pgm id
     C                     Z-ADDWSSDAT    ARCODT           scan date
     C                     Z-ADDWSSTM6    ARCOTM           scan time
      *
     C                     MOVE EKSHN1    ARSHN1           internal part1
     C                     MOVE EKSHN2    ARSHN2           internal part2
     C                     MOVE EKSHN3    ARSHN3           internal part3
      *
     C                     MOVE EKMHN1    ARMHN1           user part 1
     C                     MOVE EKMHN2    ARMHN2           user part 2
     C                     MOVE EKMHN3    ARMHN3           user part 3
     C                     MOVE EKMHN4    ARMHN4           user part 4
      *
     C                     MOVE EKLOC1    ARTBN1           final loc 1
     C                     MOVE EKLOC2    ARTBN2           final loc 2
     C                     MOVE EKLOC3    ARTBN3           final loc 3
     C                     MOVE EKLOC4    ARTBN4           final loc 4
      *
     C                     Z-ADDLASTPR    ARCKBM           last process code
      *
     C                     Z-ADDEKTOKU    ARTOKU           customer code
     C                     MOVE EKNONY    ARNONY           delivery code
     C                     MOVE EKNKOJ    ARNKOJ           factory code
     C                     MOVE EKNUKE    ARNUKE           dock code
      *
     C                     Z-ADDEKSRYO    ARSRYO           quantity
     C                     MOVE EKODRN    ARORDN           order number
      *
     C                     WRITEALDPP791
      *
     C                     ENDSR
     C**************************************************************************
     C*      WRITE RECORDS IN ORDER FILE TO ASJ
     C**************************************************************************
     C           #ASJ      BEGSR
      *
     C                     CLEARGDGPP051
TCHK8C                     TIME           WSDT
TCHK8C                     Z-ADDWSSYYY    IAKOYY
TCHK8C                     Z-ADDWSSMMM    IAKOMM
TCHK8C                     Z-ADDWSSDDD    IAKODD
     C                     MOVELWORKER    IAKOME
     C                     Z-ADDWSSHHH    IAKOHH                  HOUR
     C                     Z-ADDWSSNNN    IAKOSS                  MINUTE
     C                     MOVE A1ORDR    IAODER
     C                     MOVE A1ZETI    IAZETI
     C                     MOVE A1SEHI    IASEIH
     C                     MOVE A1LOTN    IARENB
     C                     MOVE A1SHN1    IAHIN1
     C                     MOVE A1SHN2    IAHIN2
     C                     MOVE A1SHN3    IAHIN3
     C                     Z-ADDA1SSYS    IASYOS
     C                     ADD  1         IAMAIS
TCHK8C                     Z-ADDWSSYYY    IAHAYY
TCHK8C                     Z-ADDWSSMMM    IAHAMM
TCHK8C                     Z-ADDWSSDDD    IAHADD
     C                     WRITEGDGPP051
JW3   * OUT GDGPP06
     C                     MOVEL'1'       IAFLG1
     C                     EXSR #PP06
      *
TCHK C                     EXSR #IICSD
TCHK  *
     C                     ENDSR
TCHK C**************************************************************************
TCHK C*      WRITE RECORDS IICSD
TCHK C**************************************************************************
TCHK C           #IICSD    BEGSR
TCHK  *
TCHK C           *HIVAL    SETGTIICSD01
TCHK C                     READPIICSD01                  94
TCHK C           *IN94     IFEQ '0'
TCHK C                     Z-ADDIIIDNO    ID#     60
TCHK C                     ELSE
TCHK C                     Z-ADD0         ID#     60
TCHK C                     END
TCHK C*
TCHK C                     ADD  1         ID#
TCHK C                     Z-ADDID#       IIIDNO
TCHK C                     MOVELIAHIN1    IIPAR1
TCHK C                     MOVELIAHIN2    IIPAR2
TCHK C                     MOVELIAHIN3    IIPAR3
TCHK C           KEY11     KLIST
TCHK C                     KFLD           IAHIN1
TCHK C                     KFLD           IAHIN2
TCHK C                     KFLD           IAHIN3
TCHK C           KEY11     CHAINFCEPL01              94
TCHK C           *IN94     IFEQ *OFF
TCHK C                     MOVE A2STRK    IILOC1
TCHK C                     MOVE A2STRT    IILOC2
TCHK C                     MOVE A2STRR    IILOC3
TCHK C                     MOVE A2STRD    IILOC4
TCHK C                     ELSE
TCHK C                     MOVE *BLANK    IILOC1
TCHK C                     MOVE *BLANK    IILOC2
TCHK C                     MOVE *BLANK    IILOC3
TCHK C                     MOVE *BLANK    IILOC4
TCHK C                     END
TCHK C                     TIME           DTTM
TCHK C                     Z-ADDDDAT      IIDATE
TCHK C                     Z-ADDDTIM      IITIME
TCHK C                     MOVE 'P'       IITYPE
TCHK C                     WRITEIICSD01
TCHK C*
TCHK C                     ENDSR
     C**************************************************************************
     C*                    @WRT (2-D BARCODE)
     C**************************************************************************
     C           @WRTX     BEGSR
      *
TCHK8C                     TIME           WSDT
      *
     C                     CLEARAB#PP651
TCHK8C                     Z-ADDWSSDAT    A6KDAT
TCHK8C                     Z-ADDWSSTM6    A6TIME
     C                     MOVEL#USER     A6KOME
     C                     MOVELDEST      A6DEST
     C                     MOVE K@TOKU    A6TOKU
     C                     MOVE @@NONY    A6NONY
     C                     MOVE @@NONY    WWNONY
     C                     MOVE @@NONY    DELIVL
     C                     MOVE K@NKOJ    A6NKOJ
     C                     MOVE K@NUKE    A6NUKE
     C                     MOVE K@NUKE    DOCK
     C                     MOVE K@NKOJ    FACTRY  1
     C                     MOVE A2ZETI    A6ZETI
     C                     MOVE LOTS      A6SYOS
     C                     MOVE LOTS      A6SRYO
     C                     MOVE LOTS      HQTY
     C                     MOVELSBAN      A6KANO
     C                     MOVE BXNBR     A6BOXN
     C                     MOVELORNO      A6ORNO
     C                     MOVELA7BHB1    A6SHN1
     C                     MOVELA7BHB2    A6SHN2
     C                     MOVELA7BHB3    A6SHN3
     C                     MOVE SHDT      K@NYMD
     C                     Z-ADDK@NOYY    A6NOYY
     C                     Z-ADDK@NOMM    A6NOMM
     C                     Z-ADDK@NODD    A6NODD
     C                     Z-ADD@@NBN     A6NOBN
TCHK8C                     Z-ADDWSSYYY    A6DEYY
TCHK8C                     Z-ADDWSSMMM    A6DEMM
TCHK8C                     Z-ADDWSSDDD    A6DEDD
TCHK8C                     Z-ADDWSSTM6    A6DETM
     C                     MOVELK@MHN1    A6MHN1
     C                     MOVELK@MHN2    A6MHN2
     C                     MOVELK@MHN3    A6MHN3
     C                     MOVELK@MHN4    A6MHN4
      *
%3   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     MOVEL*BLANK    @@BARA
 |   C                     MOVEL*BLANK    @@BARB
 |   C                     MOVELAKAN      @@BARA
 |   C                     MOVEL*BLANK    P9BAR
 |   C* CREATE CODE39
 |   C                     CALL 'UEXR13'
 |   C                     PARM           @@BARA256
 |   C                     PARM           @@BARB256
 |   C                     PARM           P9BAR  20
 |   C                     MOVELP9BAR     A3APBC
 |   C                     MOVELA3TEHI    A6LTNO
 |   C                     MOVELA3PAGE    A6ISNO
%3   C                     ELSE
     C           BARKBN    IFNE 'I'
TCHLSC           BARKBN    ANDNE'S'
     C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
     C                     MOVELA3TEHI    A6LTNO
     C                     MOVELA3PAGE    A6ISNO
     C                     ELSE
     C                     MOVE IIAF      WIAF             IAF KANBAN
     C                     MOVE A1LOTN    A6LTNO
     C                     ENDIF
%3   C                     ENDIF
LC3  C                     Z-ADDWSSDAT    A6SCDT
 |   C                     Z-ADDWSSTM6    A6SCTM
LC3  C                     MOVELWORKER    A6WKCD
     C                     WRITEAB#PP651
      *
     C                     CLEARAB#PP701
     C                     MOVE *ALL'9'   @@14   140
     C           @@NONY    CHAINAB#NP30              97
TCHK8C                     Z-ADDWSSDAT    N3UDAT
TCHK8C                     Z-ADDWSSTM6    N3UTIM
     C                     MOVEL#PGM      N3UPGM    P
     C                     MOVEL#USER     N3UUSR
     C                     MOVEL#WSID     N3UWIS
     C                     MOVE WWNONY    N3NONY
     C           *IN97     IFEQ *ON
     C                     Z-ADD1         N3NMBR
     C                     WRITEAB#NP301
     C                     ELSE
     C                     ADD  1         N3NMBR
     C           N3NMBR    IFEQ @@14
     C                     Z-ADD1         N3NMBR
     C                     ENDIF
     C                     UPDATAB#NP301
     C                     ENDIF
     C                     MOVE N3NMBR    EKSERL
     C                     MOVELWWNONY    EKSERL
     C                     MOVEL#USER     EKKOME
     C                     MOVE A6NONY    EKNONY
     C                     MOVE A6NKOJ    EKNKOJ
     C                     MOVE A6NUKE    EKNUKE
     C                     MOVE A6ZETI    EKZETI
     C                     MOVE LOTS      EKSYOS
     C                     MOVELA6ORNO    EKODRN
     C                     MOVE A7BHB1    EKSHN1
     C                     MOVE A7BHB2    EKSHN2
     C                     MOVE A7BHB3    EKSHN3
     C                     MOVE A6NOYY    EKNOYY
     C                     MOVE A6NOMM    EKNOMM
     C                     MOVE A6NODD    EKNODD
     C                     Z-ADDA6TOKU    EKTOKU
     C                     MOVELA6MHN1    EKMHN1
     C                     MOVELA6MHN2    EKMHN2
     C                     MOVELA6MHN3    EKMHN3
     C                     MOVELA6MHN4    EKMHN4
     C                     MOVE A6NOBN    EKNOBN
     C                     MOVELA7STRK    EKLOC1
     C                     MOVELA7STRT    EKLOC2
     C                     MOVELA7STRR    EKLOC3
     C                     MOVELA7STRD    EKLOC4
      * DO NOT CAHNGE DATE AND TIME TO KEEP CREATE DATE AND TIME
JW   C**                   Z-ADDWSSYYY    EKKOYY
 .   C**                   Z-ADDWSSMMM    EKKOMM
 .   C**                   Z-ADDWSSDDD    EKKODD
 .   C**                   Z-ADDWSSHHH    EKKOHH
JW   C**                   Z-ADDWSSNNN    EKKOMN
      * SCAN DATE AND TIME
TCHK8C                     Z-ADDWSSYYY    EKDEYY
TCHK8C                     Z-ADDWSSMMM    EKDEMM
TCHK8C                     Z-ADDWSSDDD    EKDEDD
TCHK8C                     Z-ADDWSSTM6    EKDETM
     C                     MOVE EKSYOS    EKSRYO
%3   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     MOVELA3TEHI    EKLTNO
 |   C                     MOVELA3PAGE    EKISNO
%3   C                     ELSE
     C           BARKBN    IFNE 'I'
TCHLSC           BARKBN    ANDNE'S'
     C                     MOVE IAPICS    WAPICS           A-PICS KANBAN
     C                     MOVELA3TEHI    EKLTNO
     C                     MOVELA3PAGE    EKISNO
     C                     ELSE
     C                     MOVE IIAF      WIAF             IAF KANBAN
     C                     MOVE A1LOTN    EKLTNO
     C                     ENDIF
%3   C                     ENDIF
     C                     MOVE EKSERL    @@SERL 18
     C                     WRITEAB#PP701
JW7   * SAVE PP70
 .   C                     MOVEL'ADD'     LOGFLG
JW7  C                     EXSR @PP70L
      *
     C                     TIME           WSDT
     C           BARKBN    IFEQ 'I'
TCHLSC           BARKBN    OREQ 'S'
     C                     EXSR @WRT2                      IAF FILE
     C                     ELSE
     C                     EXSR @WRT3                      APICS FILE
     C                     END
      *
     C                     ENDSR
     C**************************************************************************
JW7  C* SAVE AB#PP70 TO AB#PP70L
 .   C**************************************************************************
 .   C           @PP70L    BEGSR
 .    *
     C                     TIME           WSDT
      *
     C                     SELEC
     C           LOGFLG    WHEQ 'ADD'
     C                     Z-ADDWSSDAT    EKCRHZ
     C                     Z-ADDWSSTM6    EKCRTM
     C                     MOVEL#USER     EKCRUS
     C                     MOVEL#PGM      EKCRPG
     C                     MOVEL#WSID     EKCRWS
     C           LOGFLG    WHEQ 'CHG'
     C                     Z-ADDWSSDAT    EKUPHZ
     C                     Z-ADDWSSTM6    EKUPTM
     C                     MOVEL#USER     EKUPUS
     C                     MOVEL#PGM      EKUPPG
     C                     MOVEL#WSID     EKUPWS
     C                     ENDSL
 .    *
 .   C                     WRITEAB#PP7L1
 .    *
JW7  C                     ENDSR
     C**************************************************************************
     C* KU#PP11 WRITE
     C**************************************************************************
     C           @AU#11    BEGSR
     C*
     C                     DO
     C*
     C*    CODE 39
1    C           @D        IFEQ '1'
|    C                     MOVELEKNONY    K@NONY  40
     C*    2D
1    C                     ELSE
|    C                     Z-ADDBANONY    K@NONY
1    C                     ENDIF
     C*
     C                     TIME           WSDT
     C                     CLEARKU#PP111
     C                     Z-ADDWSSYYY    KQKOYY
     C                     Z-ADDWSSMMM    KQKOMM
     C                     Z-ADDWSSDDD    KQKODD
     C                     Z-ADDWSSHHH    KQKOHH
     C                     Z-ADDWSSNNN    KQKOSS
     C                     MOVELWUSRID    KQKOME
     C                     MOVE WORKER    KQKOME
     C*    CODE 39
1    C           @D        IFEQ '1'
|    C                     Z-ADDEKTOKU    KQTOKU
|2   C           EKTOKU    IFEQ K@NONY
||   C                     MOVELEKNKOJ    KQTKOJ
||   C                     MOVELEKNUKE    KQTUKE
|2   C                     ENDIF
|    C                     MOVELEKNONY    KQNONY
|    C                     MOVELEKNKOJ    KQNKOJ
|    C                     MOVELEKNUKE    KQNUKE
|    C                     MOVELEKSHN1    KQSHN1
|    C                     MOVELEKSHN2    KQSHN2
|    C                     MOVELEKSHN3    KQSHN3
|2   C           W@SETF    IFEQ '1'
||   C                     MOVELA7BHB1    KQSHN1
||   C                     MOVELA7BHB2    KQSHN2
||   C                     MOVELA7BHB3    KQSHN3
|2   C                     ENDIF
|    C                     MOVELEKMHN1    KQMHN1
|    C                     MOVELEKMHN2    KQMHN2
|    C                     MOVELEKMHN3    KQMHN3
|    C                     MOVE EKNOBN    KQKANR
|    C                     MOVELEKODRN    KQNOCR
|    C                     MOVELEKSYOS    W@SYOS  50
|    C                     Z-ADDW@SYOS    KQSRYO
|    C                     Z-ADDW@SYOS    KQSYUY
|    C                     MOVEL'C'       KQTANI
|    C                     MOVEL'C'       KQNSYK
|    C                     Z-ADDEKNOYY    KQNOYY
|    C                     Z-ADDEKNOMM    KQNOMM
|    C                     Z-ADDEKNODD    KQNODD
|    C                     MOVELEKNOBN    KQNOBB
|    C*
     C*    2D
1    C                     ELSE
|    C                     Z-ADDBATOKU    KQTOKU
|2   C           BATOKU    IFEQ K@NONY
||   C                     MOVELBANKOJ    KQTKOJ
||   C                     MOVELBANUKE    KQTUKE
|2   C                     ENDIF
|    C                     MOVELBANONY    KQNONY
|    C                     MOVELBANKOJ    KQNKOJ
|    C                     MOVELBANUKE    KQNUKE
|    C                     MOVELBASHN1    KQSHN1
|    C                     MOVELBASHN2    KQSHN2
|    C                     MOVELBASHN3    KQSHN3
|2   C           W@SETF    IFEQ '1'
||   C                     MOVELA7BHB1    KQSHN1
||   C                     MOVELA7BHB2    KQSHN2
||   C                     MOVELA7BHB3    KQSHN3
|2   C                     ENDIF
|    C                     MOVELBAMHN1    KQMHN1
|    C                     MOVELBAMHN2    KQMHN2
|    C                     MOVELBAMHN3    KQMHN3
|    C                     MOVE BANOBN    KQKANR
|    C                     MOVELBAODRN    KQNOCR
|    C                     Z-ADDBASYOS    KQSRYO
|    C                     Z-ADDBASYOS    KQSYUY
|    C                     MOVEL'C'       KQTANI
|    C                     MOVEL'C'       KQNSYK
|    C                     Z-ADDBANOYY    KQNOYY
|    C                     Z-ADDBANOMM    KQNOMM
|    C                     Z-ADDBANODD    KQNODD
|    C                     MOVELBANOBN    KQNOBB
|    C                     MOVELBASBAN    KQSEBN
1    C                     ENDIF
     C*
     C                     Z-ADDWSSYYY    KQTHYY
     C                     Z-ADDWSSMMM    KQTHMM
     C                     Z-ADDWSSDDD    KQTHDD
     C*
     C           NKEY      KLIST
     C                     KFLD           KQTOKU
     C                     KFLD           K@NONY
     C                     KFLD           KQNKOJ
     C                     KFLD           KQNUKE
     C           NKEY      CHAINGADPL111             96
1    C           *IN96     IFEQ '0'
|    C           B5SKJY    ANDEQ'D'
|    C           B5SKHZ    ANDLEWSSDAT
|    C                     SETON                     96
1    C                     ENDIF
     C*
1    C           *IN96     IFEQ '1'
|    C                     Z-ADD1         KQCIC1
|    C                     Z-ADD1         KQCIC2
|    C                     Z-ADD1         KQCIC3
|    C                     Z-ADDWSSHHH    KQTHJI
|    C                     Z-ADDWSSNNN    KQTHPN
|    C                     Z-ADDWSSHHH    KQURJI
|    C                     Z-ADDWSSNNN    KQURPN
1    C                     ELSE
|    C                     Z-ADDB5HIZK    KQCIC1
|    C                     Z-ADDB5KAIS    KQCIC2
|    C                     Z-ADDB5NBIN    KQCIC3
|    C                     Z-ADDB51SJI    KQTHJI
|    C                     Z-ADDB51SFN    KQTHPN
|    C                     Z-ADDB51UJI    KQURJI
|    C                     Z-ADDB51UFN    KQURPN
1    C                     END
1    C           KQTHJI    IFEQ 0
|    C                     Z-ADDWSSHHH    KQTHJI
1    C                     ENDIF
1    C           KQTHPN    IFEQ 0
|    C                     Z-ADDWSSNNN    KQTHPN
1    C                     ENDIF
1    C           KQURJI    IFEQ 0
|    C                     Z-ADDWSSHHH    KQURJI
1    C                     ENDIF
1    C           KQURPN    IFEQ 0
|    C                     Z-ADDWSSNNN    KQURPN
1    C                     ENDIF
     C*
     C           BKEY      KLIST
     C                     KFLD           KQSHN1
     C                     KFLD           KQSHN2
     C                     KFLD           KQSHN3
     C           BKEY      CHAINFCEPL011             96
1    C           *IN96     IFEQ '0'
|    C           A2GSKD    ANDEQ'D'
|    C           A2GSHZ    ANDLEWSSDAT
|    C                     SETON                     96
1    C                     ENDIF
1    C           *IN96     IFEQ '1'
|    C                     MOVE 'S'       KQTHAI
1    C                     ELSE
|    C                     MOVE A2TEHI    KQTHAI
|2   C           K@NYMD    IFLT WLDATE
||   C                     MOVE A2KTRK    KQSBKJ
||   C                     MOVE A2KTRT    KQSBRO
||   C                     MOVE A2KTRR    KQSBRT
||   C                     MOVE A2KTRD    KQSBDN
|2   C                     ELSE
||   C                     MOVE A2STRK    KQSBKJ
||   C                     MOVE A2STRT    KQSBRO
||   C                     MOVE A2STRR    KQSBRT
||   C                     MOVE A2STRD    KQSBDN
|2   C                     ENDIF
1    C                     ENDIF
     C*
     C                     MOVEL'K'       KQSKKB
     C                     Z-ADD1         KQHAKO
     C                     Z-ADDWSSYYY    KQURYY
     C                     Z-ADDWSSMMM    KQURMM
     C                     Z-ADDWSSDDD    KQURDD
     C*
     C                     MOVEL'S'       KQDTSY
     C                     MOVEL'4'       KQDTSO
     C                     MOVEL'05'      KQGYOM
      *
     C                     SETOF                     96
     C           1         CHAINAU#NP11              96
1    C           *IN96     IFEQ '0'
|2   C           AHZMM     IFNE UMONTH
||   C                     Z-ADDUMONTH    AHZMM
||   C                     Z-ADD7000001   ARECD
|2   C                     ELSE
||   C                     ADD  1         ARECD
|2   C                     ENDIF
|    C                     EXCPTUP
1    C                     ELSE
|    C                     Z-ADDUMONTH    AHZMM
|    C                     Z-ADD7000001   ARECD
|    C                     EXCPTWT
1    C                     ENDIF
     C*
     C                     Z-ADDARECD     KQJTNO
     C*
     C                     Z-ADDWSSDAT    KQSSHZ
     C                     Z-ADDWSSTM6    KQSSTI
     C                     Z-ADD0         KQNKHZ
     C                     Z-ADD0         KQNKTI
     C                     Z-ADD0         KQAPHZ
     C                     Z-ADD0         KQAPBN
     C                     WRITEKU#PP111
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
%0003C* CA#PP11 WRITE       A-PIC2 ORDER FILE
     C**************************************************************************
     C           @CA#11    BEGSR
     C*
     C                     CLEARCA#PP111
     C                     Z-ADDWSSYYY    C7KOYY
     C                     Z-ADDWSSMMM    C7KOMM
     C                     Z-ADDWSSDDD    C7KODD
     C                     Z-ADDWSSHHH    C7KOHH
     C                     Z-ADDWSSNNN    C7KOSS
     C                     MOVELWORKER    C7KOME
     C                     MOVEL#PGM      C7KOPG    P
     C*  SHORTAGE SCAN
     C                     MOVELEKSHN1    C7SHN1
     C                     MOVELEKSHN2    C7SHN2
     C                     MOVELEKSHN3    C7SHN3
     C                     MOVEL*BLANK    C7THNO
     C*  NOT SHORTAGE SCAN
     C           W@SETF    IFEQ '1'
     C                     MOVELA7BHB1    C7SHN1
     C                     MOVELA7BHB2    C7SHN2
     C                     MOVELA7BHB3    C7SHN3
     C                     MOVELA3TEHI    C7THNO
     C                     ENDIF
     C                     MOVEL'F'       C7KDAI
     C                     MOVELEKZETI    C7ZETI
     C                     Z-ADD0111      C7MBMN
     C                     MOVELW@LOC1    C7TKR1
     C                     MOVELW@LOC2    C7TKR2
     C                     MOVELW@LOC3    C7TKR3
     C                     MOVELW@LOC4    C7TKR4
     C                     Z-ADD1         C7HKSU
     C                     MOVE EKSYOS    C7SYOS
     C                     Z-ADDWSSYYY    C7KEYY
     C                     Z-ADDWSSMMM    C7KEMM
     C                     Z-ADDWSSDDD    C7KEDD
     C                     Z-ADDWSSHHH    C7KEJI
     C                     Z-ADDWSSNNN    C7KEPN
     C                     MOVEL'05'      C7GYOM
     C                     Z-ADD0         C7DTYY
     C                     Z-ADD0         C7DTMM
     C                     Z-ADD0         C7DTDD
     C                     Z-ADD0         C7DTHH
     C                     Z-ADD0         C7DTSS
     C                     WRITECA#PP111
     C*
     C           ECA#11    ENDSR
     C**************************************************************************
%0003C* UPDATE CA#PP01        A-PICS2 STATUS FILE
     C**************************************************************************
     C           @CA#01    BEGSR
      *
     C                     MOVELA3TEHI    K@THNO
      *
     C           K#CA      SETGTCA#PL021
     C                     DO   *HIVAL
     C           K#CA      REDPECA#PL021                 30
     C   30                LEAVE
     C           C6SKJY    IFEQ 'D'
     C           C6SKDT    ANDLETODAY
     C                     ITER
     C                     ENDIF
     C* NON CONFORMANCE, ALREADY SHIPPED
     C           C6FRHZ    IFNE 0
     C           C6SFLG    ORNE *BLANK
     C                     ITER
     C                     ENDIF
     C*
     C                     ADD  1         C6SPBX
     C           C6SPBX    IFGE C6MAIS
     C                     MOVEL'1'       C6SFLG
     C                     ENDIF
     C*
     C                     Z-ADDWSSDAT    C6SPDT
     C                     Z-ADDWSSTM6    C6SPTM
     C*
     C                     UPDATCA#PL021
     C                     LEAVE
     C                     ENDDO
     C*
     C           ECA#01    ENDSR
TCHKSC**************************************************************************
TCHKSC* QSS QR WRITE
TCHKSC**************************************************************************
TCHKSC           @QSSOT    BEGSR
TCHKSC*
TCHKSC                     CLEARALDPP451
TCHKSC                     TIME           WSDT
TCHKSC                     Z-ADDWSSYYY    AEKSYY
TCHKSC                     Z-ADDWSSMMM    AEKSMM
TCHKSC                     Z-ADDWSSDDD    AEKSDD
TCHKSC                     Z-ADDWSSHHH    AEKSJI
TCHKSC                     Z-ADDWSSNNN    AEKSPN
TCHKSC                     Z-ADDWSSSSS    AEKSBY
TCHKSC                     MOVEL#USER     AEKSNA
TCHKSC                     MOVELEKTOKU    AETOKU
TCHKSC                     MOVELEKNONY    AENONY
TCHKSC                     MOVELEKNKOJ    AENKOJ
TCHKSC                     MOVELEKNUKE    AENUKE
TCHKSC                     MOVELEKMHN1    AEMHN1
TCHKSC                     MOVELEKMHN2    AEMHN2
TCHKSC                     MOVELEKMHN3    AEMHN3
TCHKSC                     MOVELEKMHN4    AEMHN4
TCHKSC                     MOVELEKSHN1    AESHN1
TCHKSC                     MOVELEKSHN2    AESHN2
TCHKSC                     MOVELEKSHN3    AESHN3
TCHKSC                     MOVELEKODRN    AEORDR
TCHKSC                     MOVE EKSYOS    AESSYS
TCHKSC                     Z-ADDEKSRYO    AESRYO
TCHKSC                     Z-ADDEKNOYY    AENOYY
TCHKSC                     Z-ADDEKNOMM    AENOMM
TCHKSC                     Z-ADDEKNODD    AENODD
TCHKSC                     MOVE EKNOBN    AENOBN
TCHKSC                     MOVELEKSERL    AESERL
TCHKSC                     Z-ADDWSSYYY    AESYYY
TCHKSC                     Z-ADDWSSMMM    AESYMM
TCHKSC                     Z-ADDWSSDDD    AESYDD
TCHKSC                     Z-ADDWSSHHH    AESYJI
TCHKSC                     Z-ADDWSSNNN    AESYFN
TCHKSC                     Z-ADDWSSSSS    AESYBY
TCHKSC                     MOVELWORKER    AEOPER
TCHKSC* LOCATION BARCODE
TCHKSC                     MOVELBBLOCZ    AELOCZ
TCHKSC                     MOVELBBLOC1    AELOC1
TCHKSC                     MOVELBBLOC2    AELOC2
TCHKSC                     MOVELBBLOC3    AELOC3
TCHKSC                     MOVELBBLOC4    AELOC4
TCHKSC* APICS
TCHKSC                     MOVELEKLTNO    AELOT#
TCHKSC                     MOVELEKISNO    AEPAG#
TCHKSC                     MOVELBARKAX    AEBAR3
TCHKSC* QSS QR CODE
TCHKSC                     MOVELW@SRL#    AESRL#
TCHKSC                     MOVELQRC       AEQRCD
TCHKSC*
TCHKSC                     WRITEALDPP451
TCHKSC*
TCHKSC                     MOVEL*BLANK    W@MHIN
TCHKSC                     MOVEL*BLANK    W@NYMD
TCHKSC                     MOVEL*BLANK    W@SRL#
TCHKSC*
TCHKSC                     ENDSR
TCHKSC**************************************************************************
TCHKSC*   ERROR WRITE
TCHKSC**************************************************************************
TCHKSC           @QSSER    BEGSR
TCHKSC*
TCHKSC                     CLEARALDPP451
TCHKSC                     TIME           WSDT
TCHKSC                     Z-ADDWSSYYY    AEKSYY
TCHKSC                     Z-ADDWSSMMM    AEKSMM
TCHKSC                     Z-ADDWSSDDD    AEKSDD
TCHKSC                     Z-ADDWSSHHH    AEKSJI
TCHKSC                     Z-ADDWSSNNN    AEKSPN
TCHKSC                     Z-ADDWSSSSS    AEKSBY
TCHKSC                     MOVEL#USER     AEKSNA
TCHKSC           W@ECOD    IFEQ '2'
TCHKSC                     MOVELEKTOKU    AETOKU
TCHKSC                     MOVELEKNONY    AENONY
TCHKSC                     MOVELEKNKOJ    AENKOJ
TCHKSC                     MOVELEKNUKE    AENUKE
TCHKSC                     MOVELEKMHN1    AEMHN1
TCHKSC                     MOVELEKMHN2    AEMHN2
TCHKSC                     MOVELEKMHN3    AEMHN3
TCHKSC                     MOVELEKMHN4    AEMHN4
TCHKSC                     MOVELEKSHN1    AESHN1
TCHKSC                     MOVELEKSHN2    AESHN2
TCHKSC                     MOVELEKSHN3    AESHN3
TCHKSC                     MOVELEKODRN    AEORDR
TCHKSC                     MOVE EKSYOS    AESSYS
TCHKSC                     Z-ADDEKSRYO    AESRYO
TCHKSC                     Z-ADDEKNOYY    AENOYY
TCHKSC                     Z-ADDEKNOMM    AENOMM
TCHKSC                     Z-ADDEKNODD    AENODD
TCHKSC                     MOVE EKNOBN    AENOBN
TCHKSC                     MOVELEKSERL    AESERL
TCHKSC                     MOVELEKLTNO    AELOT#
TCHKSC                     MOVELEKISNO    AEPAG#
TCHKSC                     END
TCHKSC                     Z-ADDWSSYYY    AESYYY
TCHKSC                     Z-ADDWSSMMM    AESYMM
TCHKSC                     Z-ADDWSSDDD    AESYDD
TCHKSC                     Z-ADDWSSHHH    AESYJI
TCHKSC                     Z-ADDWSSNNN    AESYFN
TCHKSC                     Z-ADDWSSSSS    AESYBY
TCHKSC                     MOVELWORKER    AEOPER
TCHKSC* LOCATION BARCODE
TCHKSC                     MOVELBBLOCZ    AELOCZ
TCHKSC                     MOVELBBLOC1    AELOC1
TCHKSC                     MOVELBBLOC2    AELOC2
TCHKSC                     MOVELBBLOC3    AELOC3
TCHKSC                     MOVELBBLOC4    AELOC4
TCHKSC* APICS
TCHKSC                     MOVELBARKAX    AEBAR3
TCHKSC* QSS QR CODE
TCHKSC                     MOVELW@SRL#    AESRL#
TCHKSC                     MOVELQRC       AEQRCD
TCHKSC*
TCHKSC                     MOVELW@ECOD    AEERR
TCHKSC                     MOVELMSG       AEEMSG
TCHKSC*
TCHKSC                     WRITEALDPP451
TCHKSC*
TCHKSC                     MOVEL*BLANK    W@MHIN
TCHKSC                     MOVEL*BLANK    W@NYMD
TCHKSC                     MOVEL*BLANK    W@SRL#
TCHKSC*
TCHKSC                     ENDSR
TCHLAC**************************************************************************
TCHLAC* ACZ SERIAL# UPDATE
TCHLAC**************************************************************************
TCHLAC           @ACZ#1    BEGSR
TCHLAC*
TCHLAC           K#ACZ1    KLIST
TCHLAC                     KFLD           ACZOD1
TCHLAC                     KFLD           ACZOD2
TCHLAC                     KFLD           ACZOD3
TCHLAC                     KFLD           ACZOD4
TCHLAC                     KFLD           EKMHN1
TCHLAC                     KFLD           EKMHN2
TCHLAC                     KFLD           EKMHN3
TCHLAC                     KFLD           EKMHN4
TCHLAC                     MOVELEKODRN    ACZOD#
TCHLAC           K#ACZ1    SETLLGTAPL11
TCHLAC                     DO   *HIVAL
TCHLAC*
TCHLAC           K#ACZ1    READEGTAPL11                  96
TCHLAC   96                LEAVE
TCHLAC           G1SRL#    IFNE *BLANK
TCHLAC                     ITER
TCHLAC                     END
TCHLAC*
TCHLAC                     TIME           WSDT
TCHLAC                     Z-ADDWSSYYY    G1KOYY
TCHLAC                     Z-ADDWSSMMM    G1KOMM
TCHLAC                     Z-ADDWSSDDD    G1KODD
TCHLAC                     Z-ADDWSSHHH    G1KOHH
TCHLAC                     Z-ADDWSSNNN    G1KOSS
TCHLAC                     MOVEL#USER     G1KOME
TCHLAC                     MOVEL#PGM      G1KPGM    P
TCHLAC*
TCHLAC                     MOVELEKLTNO    G1LOT#
TCHLAC                     MOVELEKISNO    G1PAG#
TCHLAC                     MOVELEKSERL    G1SRL#
TCHLAC                     Z-ADDWSSDAT    G1SYHZ
TCHLAC                     Z-ADDWSSTM6    G1SYTM
TCHLAC                     MOVELWORKER    G1SYTN
TCHLAC*
TCHLAC                     UPDATGTAPP101
TCHLAC                     LEAVE
TCHLAC*
TCHLAC                     ENDDO
TCHLAC*
TCHLAC                     ENDSR
      *----------------------------------------------------*
      * PASSWORD                                           *
      *----------------------------------------------------*
     CSR         #AM#31    BEGSR
      *
     C                     MOVE WORKER    WWWKCD  60
     C           WWWKCD    CHAINAM#PP311             49
     C           *IN49     IFEQ '0'
     C           R3SKJY    ANDEQ'D'
     C           R3SKHZ    ANDLE*DATE
     C                     SETON                     49
     C                     ENDIF
      *
     C                     MOVEL*BLANK    PASFLG  1
     C           *IN49     IFEQ '0'
     C                     MOVELR3PGM1    PASFLG
     C                     ENDIF
      *
     CSR         EAM#31    ENDSR
      *
      *----------------------------------------------------*
      * Update NZUPL01 with Shipment Date and Time         *
      *----------------------------------------------------*
      *
     C           UPDSHP    BEGSR
      *
      * update NZUPL01
      *
     C           N2KEY     KLIST
     C                     KFLD           A3ZETI
     C                     KFLD           A3TEHI
     C                     KFLD           A3PAGE
     C*
     C           N2KEY     SETGTNZUPL011
     C           N2KEY     REDPENZUPL011                 51
      *
      * if id/lot/page num is found, update record and leave.
     C           *IN51     DOWEQ*OFF
     C           N2SKJY    IFEQ *BLANK
     C           N2DEHZ    ANDEQ*ZERO
     C                     Z-ADDWSSDAT    N2KOHZ
     C                     Z-ADDWSSTM6    N2KOTI
     C                     MOVELWUSRID    N2KOME
     C                     MOVEL#PGM      N2KOPG    P
     C                     Z-ADDWSSDAT    N2DEHZ
     C                     Z-ADDWSSTM6    N2DETI
     C                     UPDATNZUPL011
     C                     LEAVE
     C                     ENDIF
     C           N2KEY     REDPENZUPL011                 51
     C                     ENDDO
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * update NZUPL11 with passthru kanban ship info
      *----------------------------------------------------*
     C           UPDSHI    BEGSR
     C*
     C           N3KEY     KLIST
     C                     KFLD           A1ZETI
     C                     KFLD           A1ORDR
     C                     KFLD           LOTN    4
      *
     C                     MOVE A1LOTN    LOTN
     C           N3KEY     CHAINNZUPL111             51
      *
      * if id/ord#/lot# is found update record, else add record.
     C           *IN51     IFEQ *OFF
      *
     C                     MOVELWSSDAT    N3KOHZ
     C                     MOVELWSSTM6    N3KOTI
     C                     MOVELWORKER    N3KOME
     C                     MOVEL#PGM      N3KOPG    P
     C                     MOVE '0'       N3ONOF
     C                     MOVELWSSDAT    N3DEHZ
     C                     MOVELWSSTM6    N3DETI
      *
     C                     MOVELA1SHN1    N3SHN1
     C                     MOVELA1SHN2    N3SHN2
     C                     MOVELA1SHN3    N3SHN3
     C                     MOVELA1TKR1    N3JTK1
     C                     MOVELA1TKR2    N3JTK2
     C                     MOVELA1TKR3    N3JTK3
     C                     MOVELA1TKR4    N3JTK4
      *
     C                     MOVE BARKBN    N3KANR
     C                     MOVELA1ZETI    N3SZET
     C                     MOVELA1ORDR    N3SORD
     C                     MOVE A1SEHI    N3STYP
     C                     MOVELA1LOTN    N3SLOT
     C                     MOVELCHKD7     N3CHKD
      *
     C                     EXSR GETINF
      *
     C                     UPDATNZUPL111
      *
     C                     ELSE
      *
     C                     CLEARNZUPL111
     C                     MOVELA1ZETI    N3ZETI
     C                     MOVELA1ORDR    N3ORDN
     C                     MOVELLOTN      N3LOTN
      *
     C                     MOVELWSSDAT    N3KOHZ
     C                     MOVELWSSTM6    N3KOTI
     C                     MOVELWORKER    N3KOME
     C                     MOVEL#PGM      N3KOPG    P
     C                     MOVE '0'       N3ONOF
     C                     MOVELWSSDAT    N3DEHZ
     C                     MOVELWSSTM6    N3DETI
      *
     C                     MOVELA1SHN1    N3SHN1
     C                     MOVELA1SHN2    N3SHN2
     C                     MOVELA1SHN3    N3SHN3
     C                     MOVELA1TKR1    N3JTK1
     C                     MOVELA1TKR2    N3JTK2
     C                     MOVELA1TKR3    N3JTK3
     C                     MOVELA1TKR4    N3JTK4
      *
     C                     MOVE BARKBN    N3KANR
     C                     MOVELA1ZETI    N3SZET
     C                     MOVELA1ORDR    N3SORD
     C                     MOVE A1SEHI    N3STYP
     C                     MOVELA1LOTN    N3SLOT
     C                     MOVELCHKD7     N3CHKD
      *
     C                     EXSR GETINF
      *
     C                     WRITENZUPL111
     C                     ENDIF
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * get order info from invoice management
      *----------------------------------------------------*
     C           GETINF    BEGSR
     C*
     C           GDKEY     KLIST
     C                     KFLD           A1SHN1
     C                     KFLD           A1SHN2
     C                     KFLD           A1SHN3
     C*
     C           GDKEY     SETGTGDGPP251
     C           GDKEY     REDPEGDGPP251                 51
      *
      *    read until order number is found.
     C           *IN51     DOWEQ*OFF
      *
     C                     MOVE IEODER    IEORCH  6
     C           IEORCH    IFEQ A1ORDR
     C                     Z-ADDIESYOS    N3KSYU           BOX QTY
     C                     MOVE 'C'       N3KSTI           BOX TYPE
     C                     MOVELIEYMD     N3DEJD           DEPART YMD
     C                     LEAVE
     C                     ENDIF
      *
     C           GDKEY     REDPEGDGPP251                 51
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
      *  if first process is KN then write to ASJ order file.
      *
     C           #ASJ#2    BEGSR
      *
      * get part number process information...
     C           K#KEY1    CHAINAAMPL11              51
     C           *IN51     IFEQ *OFF
     C           CKSKJY    ANDEQ'D'
     C           CKSKHZ    ANDLEWSSDAT
     C                     GOTO @ENDA2
     C                     ENDIF
      *
      * if first process is KN,  then an order entry needs to be written to ASJ
     C           *IN51     IFEQ *OFF
      *
     C           WSSDAT    IFGE CKHZ
     C           CKKO01    ANDEQ'KN'
     C           WSSDAT    ORLT CKHZ
     C           CKQK01    ANDEQ'KN'
      *
     C                     CLEARGDGPP051
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    IAKOYY
     C                     Z-ADDWSSMMM    IAKOMM
     C                     Z-ADDWSSDDD    IAKODD
     C                     MOVELWORKER    IAKOME
     C                     MOVE 'T'       IAKOME
     C                     Z-ADDWSSHHH    IAKOHH                  HOUR
     C                     Z-ADDWSSNNN    IAKOSS                  MINUTE
      *
     C                     MOVE A3ZETI    IAZETI
     C                     MOVE A3SHN1    IAHIN1
     C                     MOVE A3SHN2    IAHIN2
     C                     MOVE A3SHN3    IAHIN3
     C                     Z-ADDA3USYS    IASYOS
     C                     ADD  1         IAMAIS
     C                     Z-ADDWSSYYY    IAHAYY
     C                     Z-ADDWSSMMM    IAHAMM
     C                     Z-ADDWSSDDD    IAHADD
      *
      * get ASJ P/T order info...
%3    *
 |   C           BARQR     IFEQ 'C01'
%0003C           BARQR     OREQ 'F01'
 |   C                     MOVEL$$APBC    PTABAR
 |   C                     ELSE
 |   C                     MOVELAKAN      PTABAR
%3   C                     ENDIF
      *
     C**JW3      PTABAR    CHAINALRPP051             51
JW3   * GET LATEST KANBAN
"    C           PTABAR    SETGTALRPL05
"    C           PTABAR    REDPEALRPL05                  51
      *
      * if APICS is found, get P/T ord#, product code, lot#
     C           *IN51     IFEQ *OFF
JW3  C                     MOVE 'Y'       PTFLG   1
     C                     MOVE PTODER    IAODER
     C                     MOVE PTPRCD    IASEIH
     C                     MOVE PTLOTN    IARENB
     C                     ELSE
      *
JW3  C                     MOVE 'N'       PTFLG
     C                     MOVE *BLANKS   IAODER
     C                     MOVE '0'       IASEIH
     C                     MOVE *BLANKS   IARENB
      *
      * APICS not scanned, so write info to error log....
     C                     MOVE '30'      A5ERID
     C                     MOVE '03'      A5ERPS
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A5KSDT
     C                     Z-ADDWSSTM6    A5KSTM
     C                     MOVELWORKER    A5OPER
     C           @D        IFEQ '1'
     C                     MOVELWWBRCD    A5SERL
     C                     MOVEL*BLANK    A52DBC
     C                     ELSE
     C                     MOVEL*BLANK    A5SERL
     C                     MOVELW2D       A52DBC
     C                     ENDIF
     C                     MOVEL@9        A5FIL1
     C                     MOVELLAR01     A5FIL2
     C                     MOVELBARKAX    A5FIL3
      *
     C                     WRITEALDPP501
      *
     C                     ENDIF
      *
     C                     WRITEGDGPP051
JW3   * OUT GDGPP06
     C                     MOVEL'2'       IAFLG1
     C                     EXSR #PP06
      *
     C                     EXSR #IICSD
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           @ENDA2    ENDSR
      **************************************************************************
JW3   *  OUTPUT GDGPP06
      **************************************************************************
JW3  C           #PP06     BEGSR
      *
     C                     MOVELPTFLG     IAPFLG
     C                     MOVELPTABAR    IAABAR
     C           PTFLG     IFEQ 'Y'
     C                     MOVELPTODER    IAPDER
     C                     MOVELPTLOTN    IAPOTN
     C                     MOVELPTPBAR    IAPBAR
     C                     MOVELPTTBN1    IAPBN1
     C                     MOVELPTTBN2    IAPBN2
     C                     MOVELPTTBN3    IAPBN3
     C                     MOVELPTTBN4    IAPBN4
     C                     ELSE
     C                     MOVE *BLANK    IAPDER
     C                     MOVE *BLANK    IAPOTN
     C                     MOVE *BLANK    IAABAR
     C                     MOVE *BLANK    IAPBN1
     C                     MOVE *BLANK    IAPBN2
     C                     MOVE *BLANK    IAPBN3
     C                     MOVE *BLANK    IAPBN4
     C                     ENDIF
      *
     C                     Z-ADD0         IAODDT
     C                     Z-ADD0         IAODTM
     C                     MOVE *BLANK    IAFLG2
      *
     C                     Z-ADDTODAY     IACRDT
     C                     Z-ADDNOW       IACRTM
     C                     MOVEL#USER     IACRME
     C                     MOVEL#PGM      IACRPG    P
      *
     C                     WRITEGDGPP061
      *
JW3  C                     ENDSR
      **************************************************************************
      *  get current date/time stamp of last scan.
      *
     C           GETTM     BEGSR
      *
     C                     MOVEL'*CURRENT'INPUTF
     C                     MOVEL'*YMD'    OUTPUT
      *
     C                     CALL 'QWCCVTDT'
     C                     PARM           INPUTF 10
     C                     PARM           INPUTV  1
     C                     PARM           OUTPUT 10
     C                     PARM           @@TIME 16
     C                     PARM           XERRR  15
      *
     C                     ENDSR
      **************************************************************************
TCHL5OAU#NP11 E                UP
TCHL5O                         AHZMM      2
TCHL5O                         ARECD      9
TCHL5O        EADD             WT
TCHL5O                         AHZMM      2
TCHL5O                         ARECD      9
** ERR(25A) .......2....>
*KANBAN ERR*                  01
LOCATION ERR                  02
QTY. ERROR                    03
PART NO. ERR                  04
DATE ERROR                    05
ERROR(ID)                     06
NOT 3-BOND                    07
ALREADY SCAN                  08
SCANND TOO MANY               09
INVALID LABEL                 10
NOT SCANNED YET               11
NOT APPROVED                  12
NO ORDER DATA                 13
ERROR(2D)                     14
SCANNED TWICE                 15
UNMATCH LABEL                 16
KANBAN DUPL                   17
APICS STOP ALERT              18
PT STOP ALERT                 19
QSS QR CD ERR                 20
BY SHORTAGE SCAN              21
ASJ PARTS                     22
SCAN (A) LABEL                23
SCAN (B) LABEL                24
NOT 52,53 LOCATION            25
NO SHORTAGE CUST.             26
SCAN APICS QR CD              27
CHR_STL NOT SCAN IN SORT      28 JW4
CHR_STL ALREADY OUT           29 JW4
PASSTHRU NOT SCANNED          30
SCAN AIAG LABEL!              31 JW4
SCAN KANBAN!                  32 JW4
MISSING JC SCAN               33             LEC
** SHP
<< DENSO >>
 << TMI >>
** HND
0294
0295
0296
0390
0391
0400
3135
1602
