     H            Y.
      ** ALDR50 *************************************************
      * LIST OF OUT-GOING TRACK RECORD                          *
      *   PROGRAM-ID.  :  ALDR50                                *
      *   CREATE DATE. :  NOV/26/1997.                          *
      *   AUTHOR.      :  S.OHTAKE.                             *
      * MODIFICATION
      *      USE KEY2 (TCH APR/25/02)
      ************************************************* ALDR50 **
     FALDPW50 CF  E                    WORKSTN
     FALDPL22 IF  E           K        DISK
     FALDPL32 IF  E           K        DISK
     FALDPL42 IF  E           K        DISK
     FALDWP50 O   F     100            DISK
     E                    ER      1   9 60               ERROR MESSAGE
      *----------*
      * PARTS NO *
      *----------*
     I            DS
     I                                        1  12 HIN
     I                                        1   5 SHN1
     I                                        6  10 SHN2
     I                                       11  12 SHN3
      *----------*
      * PARTS NO *
      *----------*
     I            DS
     I                                        1  12 AHIN
     I                                        1   5 A1SHN1
     I                                        6  10 A1SHN2
     I                                       11  12 A1SHN3
      *----------*
      * PARTS NO *
      *----------*
     I            DS
     I                                        1  12 BHIN
     I                                        1   5 A3SHN1
     I                                        6  10 A3SHN2
     I                                       11  12 A3SHN3
      *----------*
      * PARTS NO *
      *----------*
     I            DS
     I                                        1  12 CHIN
     I                                        1   5 A5SHN1
     I                                        6  10 A5SHN2
     I                                       11  12 A5SHN3
      *------------*
      * START DATE *
      *------------*
     I            DS
     I                                        1   80SHIZK
     I                                        1   40SHZYY
     I                                        5   60SHZMM
     I                                        7   80SHZDD
      *----------*
      * END DATE *
      *----------*
     I            DS
     I                                        1   80EHIZK
     I                                        1   40EHZYY
     I                                        5   60EHZMM
     I                                        7   80EHZDD
      *
     C           *ENTRY    PLIST
     C                     PARM           NONY
     C                     PARM           KOJO
     C                     PARM           NUKE
     C                     PARM           FLG
      *------*
      * KEYS *
      *------*
     C           KEY1      KLIST
     C                     KFLD           NONY
     C                     KFLD           KOJO
     C                     KFLD           NUKE
     C                     KFLD           SHZYY
     C                     KFLD           SHZMM
     C                     KFLD           SHZDD
     C                     KFLD           SHN1
     C                     KFLD           SHN2
     C                     KFLD           SHN3
      *
     C           KEY2      KLIST
     C                     KFLD           NONY
     C                     KFLD           KOJO
     C                     KFLD           NUKE
     C                     KFLD           SHZYY
     C                     KFLD           SHZMM
     C                     KFLD           SHZDD
      *
     C           KEY3      KLIST
     C                     KFLD           NONY
     C                     KFLD           KOJO
     C                     KFLD           NUKE
      *****************************************
      *---------------------------------------*
      *<<<<<    ALDR50   EXECUSION       >>>>>*
      *---------------------------------------*
      *****************************************
     C           STP0      TAG
     C                     MOVE *BLANK    SHN1
     C                     MOVE *BLANK    SHN2
     C                     MOVE *BLANK    SHN3
     C                     Z-ADD0         NONY
     C                     MOVE *BLANK    KOJO
     C                     MOVE *BLANK    NUKE
     C                     Z-ADD0         SHIZK
     C                     Z-ADD0         EHIZK
      **********************
      *  DISPLAY 1 SCREEN  *
      **********************
     C           STP1      TAG
     C                     EXFMTALDPW501
     C                     SETOF                     010203
     C                     SETOF                     040506
     C                     SETOF                     99
      *
     C           *INKA     IFEQ '1'
     C                     MOVE '*'       FLG     1
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
      *---------------------*
      *  CHECK OF RCV CI.   *
      *---------------------*
     C           NONY      IFEQ 0
     C                     SETON                     0199
     C                     MOVE ER,1      MSG
     C                     GOTO STP1
     C                     ENDIF
      *---------------------*
      *  CHECK OF FACTORY   *
      *---------------------*
     C           KOJO      IFEQ *BLANK
     C                     SETON                     0299
     C                     MOVE ER,2      MSG
     C                     GOTO STP1
     C                     ENDIF
      *---------------------*
      *  CHECK OF RECEIVING *
      *---------------------*
     C           NUKE      IFEQ *BLANK
     C                     SETON                     0399
     C                     MOVE ER,3      MSG
     C                     GOTO STP1
     C                     ENDIF
      *---------------------*
      *  CHECK OF PARTS NO  *
      *---------------------*
     C           HIN       IFEQ *BLANK
     C                     SETON                     0499
     C                     MOVE ER,4      MSG
     C                     GOTO STP1
     C                     ENDIF
      *-----------------*
      *  CHECK OF DATE  *
      *-----------------*
     C           SHIZK     IFEQ 0
     C                     SETON                     0599
     C                     MOVE ER,5      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           SHZMM     IFGT 12
     C                     SETON                     0599
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           SHZDD     IFGT 31
     C                     SETON                     0599
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C           EHIZK     IFEQ 0
     C                     SETON                     0699
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           EHZMM     IFGT 12
     C                     SETON                     0699
     C                     MOVE ER,6      MSG
     C                     GOTO STP1
     C                     ENDIF
     C           EHZDD     IFGT 31
     C                     SETON                     0699
     C                     MOVE ER,7      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C           SHIZK     IFGT EHIZK
     C                     SETON                     0599
     C                     MOVE ER,8      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C           *INKE     IFEQ '0'
     C                     GOTO STP1
     C                     ENDIF
      *
      *--------------*
      *  FILE READ   *
      *--------------*
     C                     MOVE *BLANK    SW      1
     C           SHN1      IFEQ '99999'
     C           SHN2      ANDEQ'99999'
     C           SHN3      ANDEQ'99'
     C                     MOVE '*'       SW
     C                     ENDIF
      *
     C                     MOVE *BLANK    DAB     1
     C                     SETOF                     50
     C*******    KEY3      SETLLALDPL221
     C           KEY2      SETLLALDPL221
     C                     DO   *HIVAL
     C           KEY3      READEALDPL221                 50
     C           *IN50     IFEQ '1'
     C                     GOTO ESC1
     C                     ENDIF
     C*          A1SYHZ    IFLT SHIZK
     C*                    GOTO ESC1
     C*                    ENDIF
     C           A1SYHZ    IFGT EHIZK
     C                     MOVE *ON       *IN50
     C                     GOTO ESC1
     C                     ENDIF
     C           SW        IFEQ *BLANK
     C           AHIN      IFNE HIN
     C                     GOTO ESC1
     C                     ENDIF
     C                     ENDIF
     C                     EXSR OUT1
     C                     MOVE '*'       DAB
     C           ESC1      TAG
     C  N50                ENDDO
      *
     C                     SETOF                     50
     C******     KEY3      SETLLALDPL321
     C           KEY2      SETLLALDPL321
     C                     DO   *HIVAL
     C           KEY3      READEALDPL321                 50
     C           *IN50     IFEQ '1'
     C                     GOTO ESC2
     C                     ENDIF
     C*          A3SYHZ    IFLT SHIZK
     C*                    GOTO ESC2
     C*                    ENDIF
     C           A3SYHZ    IFGT EHIZK
     C                     MOVE *ON       *IN50
     C                     GOTO ESC2
     C                     ENDIF
     C           SW        IFEQ *BLANK
     C           BHIN      IFNE HIN
     C                     GOTO ESC2
     C                     ENDIF
     C                     ENDIF
     C                     EXSR OUT2
     C                     MOVE '*'       DAB
     C           ESC2      TAG
     C  N50                ENDDO
      *
     C                     SETOF                     50
     C*******    KEY3      SETLLALDPL421
     C           KEY2      SETLLALDPL421
     C                     DO   *HIVAL
     C           KEY3      READEALDPL421                 50
     C           *IN50     IFEQ '1'
     C                     GOTO ESC3
     C                     ENDIF
     C*          A5SYHZ    IFLT SHIZK
     C*                    GOTO ESC3
     C*                    ENDIF
     C           A5SYHZ    IFGT EHIZK
     C                     MOVE *ON       *IN50
     C                     GOTO ESC3
     C                     ENDIF
     C           SW        IFEQ *BLANK
     C           CHIN      IFNE HIN
     C                     GOTO ESC3
     C                     ENDIF
     C                     ENDIF
     C                     EXSR OUT3
     C                     MOVE '*'       DAB
     C           ESC3      TAG
     C  N50                ENDDO
      *
     C           DAB       IFEQ *BLANK
     C                     SETON                     0199
     C                     MOVE ER,9      MSG
     C                     GOTO STP1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------*
      *  OUT     *
      *----------*
     C           OUT1      BEGSR
     C                     MOVE '*'       OFLAG   1
     C                     Z-ADDA1SYYY    OSYYY   40
     C                     Z-ADDA1SYMM    OSYMM   20
     C                     Z-ADDA1SYDD    OSYDD   20
     C                     Z-ADDA1SYJI    OSYJI   20
     C                     Z-ADDA1SYFN    OSYFN   20
     C                     MOVE A1SHN1    OSHN1   5
     C                     MOVE A1SHN2    OSHN2   5
     C                     MOVE A1SHN3    OSHN3   2
     C                     MOVE A1MHN1    OUHN1   5
     C                     MOVE A1MHN2    OUHN2   5
     C                     MOVE A1MHN3    OUHN3   5
     C                     MOVE A1MHN4    OUHN4   5
     C                     MOVE A1ZETI    OZETI   4
     C                     MOVELA1ORDR    OLOTN   6
     C                     MOVE *BLANK    OPAGN   2
     C                     Z-ADDA1SSYS    OSSYS   50
     C                     Z-ADDA1USYS    OUSYS   70
     C                     MOVE A1TKR1    OTKR1   1
     C                     MOVE A1TKR2    OTKR2   2
     C                     MOVE A1TKR3    OTKR3   2
     C                     MOVE A1TKR4    OTKR4   1
     C                     MOVE A1SALE    OSALE   1
     C                     MOVE A1UPAG    OUPAG   3
     C                     MOVE A1LOTN    OLOT2   4
     C                     EXCPTDAT
     C                     ENDSR
      *
     C           OUT2      BEGSR
     C                     Z-ADDA3SYYY    OSYYY   40
     C                     Z-ADDA3SYMM    OSYMM   20
     C                     Z-ADDA3SYDD    OSYDD   20
     C                     Z-ADDA3SYJI    OSYJI   20
     C                     Z-ADDA3SYFN    OSYFN   20
     C                     MOVE A3SHN1    OSHN1   5
     C                     MOVE A3SHN2    OSHN2   5
     C                     MOVE A3SHN3    OSHN3   2
     C                     MOVE A3MHN1    OUHN1   5
     C                     MOVE A3MHN2    OUHN2   5
     C                     MOVE A3MHN3    OUHN3   5
     C                     MOVE A3MHN4    OUHN4   5
     C                     MOVE A3ZETI    OZETI   4
     C                     MOVE A3TEHI    OLOTN   6
     C                     MOVE A3PAGE    OPAGE   2
     C                     Z-ADDA3SSYS    OSSYS   50
     C                     Z-ADDA3USYS    OUSYS   70
     C                     MOVE A3TKR1    OTKR1   1
     C                     MOVE A3TKR2    OTKR2   2
     C                     MOVE A3TKR3    OTKR3   2
     C                     MOVE A3TKR4    OTKR4   1
     C                     MOVE A3SALE    OSALE   1
     C                     EXCPTDAT
     C                     ENDSR
      *
     C           OUT3      BEGSR
     C                     Z-ADDA5SYYY    OSYYY   40
     C                     Z-ADDA5SYMM    OSYMM   20
     C                     Z-ADDA5SYDD    OSYDD   20
     C                     Z-ADDA5SYJI    OSYJI   20
     C                     Z-ADDA5SYFN    OSYFN   20
     C                     MOVE A5SHN1    OSHN1   5
     C                     MOVE A5SHN2    OSHN2   5
     C                     MOVE A5SHN3    OSHN3   2
     C                     MOVE A5MHN1    OUHN1   5
     C                     MOVE A5MHN2    OUHN2   5
     C                     MOVE A5MHN3    OUHN3   5
     C                     MOVE A5MHN4    OUHN4   5
     C                     MOVE A5ZETI    OZETI   4
     C                     MOVE A5LOTN    OLOTN   6
     C                     MOVE *BLANK    OPAGE   2
     C                     Z-ADDA5SSYS    OSSYS   50
     C                     Z-ADDA5USYS    OUSYS   70
     C                     MOVE A5TKR1    OTKR1   1
     C                     MOVE A5TKR2    OTKR2   2
     C                     MOVE A5TKR3    OTKR3   2
     C                     MOVE A5TKR4    OTKR4   1
     C                     MOVE A5SALE    OSALE   1
     C                     EXCPTDAT
     C                     ENDSR
      *****************************************************************
     OALDWP50 E                DAT
     O                         OSYYY      4
     O                         OSYMM      6
     O                         OSYDD      8
     O                         OSHN1     13
     O                         OSHN2     18
     O                         OSHN3     20
     O                         OUHN1     25
     O                         OUHN2     30
     O                         OUHN3     35
     O                         OUHN4     40
     O                         OZETI     44
     O                         OLOTN     50
     O                         OPAGE     52
     O                         OSSYS     57
     O                         OUSYS     64
     O                         OTKR1     65
     O                         OTKR2     67
     O                         OTKR3     69
     O                         OTKR4     70
     O                         OSALE     71
     O                         OSYJI     73
     O                         OSYFN     75
     O                         OUPAG     78
     O                         OLOT2     82
     O                         OFLAG     83
**  ER
E-01 INPUT RCV CO.
E-02 INPUT FACTORY
E-03 INPUT RECEIVING
E-04 INPUT PARTS NO
E-05 INPUT START OUT-GOING DATE
E-06 THE MONTH IS LARGER THAN 12
E-07 THE DAY IS LARGER THAN 31
E-08 THE START DATE IS LARGER THAN THE END DATE
E-09 THERE IS NO PERTINENT DATA
