     H            Y/
      ** ALDR57 *************************************************
      * SCANNED PARTS LIST                                      *
      *               JUL/01/2003                               *
      *                                                         *
      *                                                         *
      *
      ************************************************* ALDR57 **
     FALDWP56 IP  E           K        DISK
     FALDWP2X O   E                    DISK
      *------------------------------------------------------------
     IALDWP561
     I                                              D5PRT1L1
     I                                              D5PRT2L1
     I                                              D5PRT3L1
     I            DS
     I                                        1  12 D5PART
     I                                        1   5 D5PRT1
     I                                        6  10 D5PRT2
     I                                       11  12 D5PRT3
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *   MAIN ROUTINE
      *--------------------------------------------------------
     C                     ADD  D5QTY     @@QTY  150
     C                     ADD  D5BOX     @@BOX  110
      *
     CL1                   EXSR #PRT
      *--------------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  OUTPUT
      *--------------------------------------------------------
     C           #PRT      BEGSR
      *
     C                     MOVE D5PART    A2PART
     C                     Z-ADD@@QTY     A2QTY
     C                     WRITEALDWP201
     C                     Z-ADD*ZERO     @@QTY
     C                     Z-ADD*ZERO     @@BOX
      *
     C                     ENDSR
      *-------------------------------------------------------
      *-------------------------------------------------------
