     H            Y.                                    1
     F**ALDRTC ********************************************************
     F* GET LOQ LOADING  ALHPP01
     F*  2019.09.24      SAKAKI                                       *
     F*****************************************************************
     FALHPL04 IF  E           K        DISK                           UC
     FAH#PL11 IF  E           K        DISK                           UC
      *
     I            DS
     I                                        1   80K@HTHZ
     I                                        1   40K@HTYY
     I                                        5   60K@HTMM
     I                                        7   80K@HTDD
      *
     I            DS
     I                                        1   80A1SCDT
     I                                        1   40A1SCYY
     I                                        5   60A1SCMM
     I                                        7   80A1SCDD
      *
     I            DS
     I                                        1  15 A1KAN
     I                                        9  10 A1PAGE
      *
     C           *ENTRY    PLIST
     C                     PARM           P@HIN1  5        PART NUMBER 1
     C                     PARM           P@HIN2  5        PART NUMBER 2
     C                     PARM           P@HIN3  2        PART NUMBER 3
     C                     PARM           P@ZENO  4
     C                     PARM           P@THNO  3
     C                     PARM           P@PAGE  2
     C                     PARM           P@HTHZ  80
     C                     PARM           P@WIHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@WITM  60       WORK ADMITTABLE TIME
     C                     PARM           P@MAIS  30
     C                     PARM           P#OPN   1
     C           P#OPN     IFEQ '9'
     C           OPNFL     IFEQ '1'
     C                     CLOSEALHPL04
     C                     CLOSEAH#PL11
     C                     ENDIF
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
     C           OPNFL     IFEQ *BLANK
     C                     MOVEL'1'       OPNFL   1
     C                     OPEN ALHPL04
     C                     OPEN AH#PL11
     C                     ENDIF
      *
     C                     Z-ADDP@HTHZ    K@HTHZ  80
      *
     C           AH#KEY    KLIST
     C                     KFLD           P@ZENO
     C                     KFLD           P@THNO
      *
     C                     Z-ADD0         @@BARL  31
     C           AH#KEY    CHAINAH#PL11              88
     C           *IN88     IFEQ '0'
     C                     Z-ADDCFBARL    @@BARL
     C                     ENDIF
     C                     Z-ADD0         W@MAIS  30
     C           @@BARL    IFGT 16
     C           @@BARL    DIV  2         W@MAIS
     C                     ELSE
     C                     Z-ADD@@BARL    W@MAIS
     C                     ENDIF
      *
     C           AFAKES    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THNO
     C                     KFLD           K@HTYY
     C                     KFLD           K@HTMM                       2
     C                     KFLD           K@HTDD                       3
      *
     C           AFAKEY    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THNO
      *
     C                     Z-ADD0         P@WIHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADD0         P@WITM  60       WORK ADMITTABLE TIME
     C                     Z-ADD0         P@MAIS
     C           AFAKES    SETLLALHPL04
     C           AFAKEY    READEALHPL04                  88
     C           *IN88     DOWEQ'0'
     C           P@WIHZ    ANDEQ0
     C           A1SKJY    IFEQ *BLANK
     C***        A1SCDT    ANDGEK@HTHZ
     C           A1PAGE    ANDEQP@PAGE
     C                     Z-ADDA1SCDT    P@WIHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADDA1SCTM    P@WITM  60       WORK ADMITTABLE TIME
     C                     Z-ADDW@MAIS    P@MAIS
     C                     ENDIF
     C           AFAKEY    READEALHPL04                  88
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
