     H            Y.
      ** ALDR6C *******************************************************
      * SHORTAGE SUMMARY DATA INQUIRY
      *  KIRI                                            2019.03.06
      *****************************************************************
     FALDPW6C CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFREC1
     F                                              KINFDS INFDS
      *
      * .. SHIPPING SHORTAGE FILE                         *
     FALDPL66 IF  E           K        DISK
      *
     FALDWP6C UF  E           K        DISK                      A
     FALDWL6C IF  E           K        DISK
      *
      *===============================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
      *プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
     C*===============================================================
     C           *ENTRY    PLIST
     C                     PARM           P@DATE  80
      *===============================================================
      *  START  PROGRAM
      *===============================================================
     C                     MOVE '#INIT   '@STEP   8
      *
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * 初期ﾈｮmb
      *===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C                     TIME           @TIME
     C                     Z-ADDP@DATE    D1ODAT
      *
     C           KEY01     KLIST
     C                     KFLD           AFLPR1           IAF PART#1
     C                     KFLD           AFLPR2           PART#2
     C                     KFLD           AFLPR3           PART#3
     C                     KFLD           AFLOC1           LOC1
     C                     KFLD           AFLOC2           LOC2
     C                     KFLD           AFLOC3           LOC3
     C                     KFLD           AFLOC4           LOC4
      *
      * .. SHIPPING SHORTAGE FILE                         *
     C           P@DATE    SETLLALDPL66
      **----------------------------------
     C                     DO   *HIVAL
     C           P@DATE    READEALDPL66                  90
     C   90                LEAVE
     C           AFSKJC    IFEQ 'D'
     C           AFDATE    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADD0         M$BOX1  60       :TOYOTA
     C                     Z-ADD0         M$BOX2  60       :HONDA
     C                     Z-ADD0         M$BOX3  60       :FORD
     C                     Z-ADD0         M$BOX4  60       :TIER1
     C                     EXSR ##NONY
      *
     C           KEY01     CHAINALDWP6C              91
     C           *IN91     IFEQ *ON
     C                     MOVELAFLPR1    W$LPR1           IAF PART#1
     C                     MOVELAFLPR2    W$LPR2           PART#2
     C                     MOVELAFLPR3    W$LPR3           PART#3
     C                     MOVELAFLOC1    W$LOC1           LOC1
     C                     MOVELAFLOC2    W$LOC2           LOC2
     C                     MOVELAFLOC3    W$LOC3           LOC3
     C                     MOVELAFLOC4    W$LOC4           LOC4
     C                     Z-ADD1         W$BOXS
     C                     Z-ADDM$BOX1    W$BOX1
     C                     Z-ADDM$BOX2    W$BOX2
     C                     Z-ADDM$BOX3    W$BOX3
     C                     Z-ADDM$BOX4    W$BOX4
     C                     WRITEALDWP6C1
     C                     ELSE
     C                     ADD  1         W$BOXS
     C                     ADD  M$BOX1    W$BOX1
     C                     ADD  M$BOX2    W$BOX2
     C                     ADD  M$BOX3    W$BOX3
     C                     ADD  M$BOX4    W$BOX4
     C                     UPDATALDWP6C1
     C                     ENDIF
     C                     ENDDO
      **----------------------------------
      *
     C*
     C                     SETON                     73    SFLCLR
     C                     WRITESFCTL1
     C                     SETOF                     73
     C*
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
     C*
     C*
      **----------------------------------
     C                     DO   *HIVAL
     C                     READ ALDWL6C                  90
     C   90                LEAVE
     C                     CALL 'APLR30'
     C                     PARM           W$LPR1  5
     C                     PARM           W$LPR2  5
     C                     PARM           W$LPR3  2
     C                     PARM           S1LPR  14
     C                     CALL 'APLR40'
     C                     PARM           W$LOC1  1
     C                     PARM           W$LOC2  2
     C                     PARM           W$LOC3  2
     C                     PARM           W$LOC4  1
     C                     PARM           S1LOC   9
     C                     Z-ADDW$BOXS    S1BOXS
     C                     Z-ADDW$BOX1    S1BOX1
     C                     Z-ADDW$BOX2    S1BOX2
     C                     Z-ADDW$BOX3    S1BOX3
     C                     Z-ADDW$BOX4    S1BOX4
     C                     ADD  1         RRN1
     C                     WRITESFREC1
     C                     ENDDO
      **--------------------------------
     C*
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSR
      *===============================================================
      *
      *===============================================================
     C           #DSP1     BEGSR
     C*
     C                     WRITEDSP01
     C                     SETON                     7172
     C                     EXFMTSFCTL1
     C                     SETOF                     717299
     C                     MOVE *BLANK    D1ERR
     C                     Z-ADD$$RRN     RRN1
     C                     Z-ADD$$RRN     TOPRRN  40
     C*
      *
S1   C                     SELEC
     C*
     C*  < F3 > BACK
     C           *INKC     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C*
     C*  < F7 > DOWNLOAD
     C           *INKG     WHEQ *ON
     C                     CALL 'ALDC6C2 '
     C                     MOVE '#END    '@STEP
     C*
     C*  < ROLL/UP >
-1   C           *IN75     WHEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C*
     C*  < ROLL/DOWN >
-1   C           *IN76     WHEQ *ON
     C                     MOVE '#DSP1   '@STEP
     C*
     C*  <           >
-1   C                     OTHER
     C                     MOVE '#DSP1   '@STEP
E1   C                     ENDSL
      *
     C                     ENDSR
      *===============================================================
      **----------------------------------------------------
      ** ---- TOYOTA.FORD,HONDA,TIER1 ----
      **----------------------------------------------------
     C           ##NONY    BEGSR
      *
     C                     MOVE AFNONY    $DLV
      *
     C                     CALL 'UTLR62B'
     C                     PARM           $DLV    4
     C                     PARM           $GRP    3
     C                     PARM           $NAME1 15
     C                     PARM           $NAME2 50
     C                     PARM           $RTN    1
     C*
     C                     SELEC
     C           $GRP      WHEQ 'TYT'
     C                     ADD  1         M$BOX1           :TOYOTA
     C           $GRP      WHEQ 'HND'
     C                     ADD  1         M$BOX2           :HONDA
     C           $GRP      WHEQ 'FRD'
     C                     ADD  1         M$BOX3           :FORD
     C                     OTHER
     C                     ADD  1         M$BOX4           :TIER1
     C                     ENDSL
      *
      *
     C           @SKIP     ENDSR
      *===============================================================
