     H            Y/
     H*
     H* TCHK  02/21/11 CREATE
     H*
     FALDPW97 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                              KINFDS @INFDS
     FALDPL97 UF  E           K        DISK                      A
     FFCEPL01 IF  E           K        DISK
      *
     E                    ERR     1  20 60
     E                    AUTH    1  20 30
      *
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1   80AGHTDT
     I                                        1   40AGHTYY
     I                                        5   60AGHTMM
     I                                        7   80AGHTDD
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YYYY
     I                                        5   60K@MMMM
     I                                        7   80K@DDDD
     I            DS
     I                                        1  14 W@SHIN
     I                                        1   5 W@SHN1
     I                                        6   6 W@SHNA
     I                                        7  11 W@SHN2
     I                                       12  12 W@SHNB
     I                                       13  14 W@SHN3
      *=====================================================
     C                     EXSR #SCRN1
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *=====================================================
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
     C*
     C                     MOVEL*OFF      W@NEW   1
     C                     MOVEL*BLANK    F1MODE
     C                     MOVEL*BLANK    F1AUTH
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
     C*
     C                     DO   *HIVAL
     C*
     C                     EXFMTFMT010
     C                     MOVEL*OFF      *IN89
     C                     MOVEL*BLANK    MSG
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     LEAVE
     C                     OTHER
     C                     MOVEL*OFF      W@ERR1  1
     C                     EXSR #CHK1
     C           W@ERR1    IFEQ *ON
     C                     MOVEL*ON       *IN89
     C                     ITER
     C                     END
     C                     EXSR #SCRN2
     C   KA                LEAVE
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK1     BEGSR
     C*
     C                     SETOF                     3132
     C*
     C           F1MODE    IFEQ '1'
     C           F1MODE    OREQ '2'
     C                     ELSE
     C                     MOVEL*ON       *IN31
     C                     MOVEL*ON       W@ERR1
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     END
     C                     END
     C*
     C           F1MODE    IFEQ '2'
     C           F1AUTH    IFEQ *BLANK
     C                     MOVEL*ON       *IN32
     C                     MOVEL*ON       W@ERR1
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     ELSE
     C                     Z-ADD1         X       20
     C           F1AUTH    LOKUPAUTH,X                   90
     C           *IN90     IFEQ *OFF
     C                     MOVEL*ON       *IN32
     C                     MOVEL*ON       W@ERR1
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN2    BEGSR
     C*
     C                     EXSR #SET2
     C*
     C                     DO   *HIVAL
     C*
     C           F1MODE    IFEQ '2'
     C                     SETON                     85
     C                     ELSE
     C                     SETOF                     85
     C                     END
     C                     SETON                     8488
     C                     SETOF                     8687
     C*
     C                     WRITEFMT099
     C                     Z-ADDW@REC2    #RCN02
     C                     EXFMTCTL020
     C                     MOVEL*OFF      *IN89
     C                     MOVEL*BLANK    MSG
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W@REC2
     C                     ELSE
     C                     Z-ADD1         W@REC2
     C                     END
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL*BLANK    F1MODE
     C                     MOVEL*BLANK    F1AUTH
     C                     LEAVE
     C           *INKG     WHEQ *ON
     C                     MOVEL*ON       W@NEW
     C                     EXSR #SCRN3
     C   KA                LEAVE
     C                     MOVEL*OFF      W@NEW
     C                     EXSR #SET2
     C                     ITER
     C                     OTHER
     C                     MOVEL*OFF      W@ERR2  1
     C                     EXSR #CHK2
     C   KA                LEAVE
     C           W@ERR2    IFEQ *ON
     C                     MOVEL*ON       *IN89
     C                     ITER
     C                     END
      *
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SET2     BEGSR
     C                     MOVE *ON       *IN41
     C                     WRITECTL020
     C                     MOVE *OFF      *IN41
     C                     MOVE *OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
     C                     MOVEL*BLANK    C2MODE
     C           F1MODE    IFEQ '1'
     C                     MOVEL'INQUIRY' C2MODE
     C                     ELSE
     C                     MOVEL'UPDATE'  C2MODE
     C                     END
     C*
     C           *LOVAL    SETLLALDPL97
      *
     C                     DO   *HIVAL
      *
     C                     READ ALDPL97                  98
     C   98                LEAVE
     C           AGSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C                     CLEARSFL020
     C*
     C                     MOVEL*BLANK    W@SHIN
     C                     MOVELAGSHN1    W@SHN1
     C           AGSHN2    IFNE *BLANK
     C                     MOVEL'-'       W@SHNA
     C                     END
     C                     MOVELAGSHN2    W@SHN2
     C           AGSHN3    IFNE *BLANK
     C                     MOVEL'-'       W@SHNB
     C                     END
     C                     MOVELAGSHN3    W@SHN3
     C                     MOVELW@SHIN    S2SHIN
     C                     MOVELAGSHN1    H2SHN1
     C                     MOVELAGSHN2    H2SHN2
     C                     MOVELAGSHN3    H2SHN3
     C                     MOVELAGZETI    H2ZETI
     C                     MOVELAGODR#    S2ODR#
     C                     MOVELAGLOT#    S2LOT#
     C                     Z-ADDAGHTDT    S2ISDT
     C                     MOVELAGDEPT    S2DEPT
     C                     MOVELAGNC##    S2NC##
     C                     MOVELAGREAS    S2REAS
     C*
     C                     ADD  1         RRN2
     C                     WRITESFL020
     C*
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     CLEARSFL020
     C                     MOVEL*ON       *IN51
     C                     Z-ADD1         RRN2
     C                     WRITESFL020
     C                     MOVEL*OFF      *IN51
     C                     END
      *
     C                     Z-ADD1         W@REC2  40
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK2     BEGSR
     C*
     C                     Z-ADD*ZERO     RRN2
     C*
     C                     DO   *HIVAL
     C*
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               97
     C   97                LEAVE
     C*
     C           S2SEL     IFEQ *BLANK
     C                     SETOF                     5253
     C                     UPDATSFL020
     C                     ITER
     C                     END
     C*
     C                     SELEC
     C           S2SEL     WHEQ 'C'
     C           F1MODE    IFEQ '1'
     C                     Z-ADDRRN2      W@REC2
     C                     MOVEL*ON       W@ERR2
     C                     MOVELERR,3     MSG
     C                     SETON                     5253
     C                     UPDATSFL020
     C                     SETOF                     5253
     C                     LEAVE
     C                     END
     C                     EXSR #SCRN3
     C   KA
     COR KE                LEAVE
     C           S2SEL     WHEQ 'D'
     C           F1MODE    IFEQ '1'
     C                     Z-ADDRRN2      W@REC2
     C                     MOVEL*ON       W@ERR2
     C                     MOVELERR,3     MSG
     C                     SETON                     5253
     C                     UPDATSFL020
     C                     SETOF                     5253
     C                     LEAVE
     C                     END
     C                     EXSR #SCRN3
     C   KA
     COR KE                LEAVE
     C           S2SEL     WHEQ 'I'
     C                     EXSR #SCRN3
     C                     OTHER
     C                     Z-ADDRRN2      W@REC2
     C                     MOVEL*ON       W@ERR2
     C                     MOVELERR,12    MSG
     C                     SETON                     5253
     C                     UPDATSFL020
     C                     SETOF                     5253
     C                     LEAVE
     C                     ENDSL
     C*
     C                     SETON                     52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     SETOF                     52
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN3    BEGSR
     C*
     C                     EXSR #SET3
     C*
     C                     DO   *HIVAL
     C*
     C                     SELEC
     C           W@NEW     WHEQ *ON
     C                     SETON                     7086
     C                     SETOF                     7879
     C                     MOVEL'NEW'     F3MODE    P
     C           S2SEL     WHEQ 'C'
     C                     SETON                     707886
     C                     SETOF                     79
     C                     MOVEL'CHANGE'  F3MODE    P
     C           S2SEL     WHEQ 'D'
     C                     SETON                     707879
     C                     SETON                     86
     C                     MOVEL'DELETE'  F3MODE    P
     C           S2SEL     WHEQ 'I'
     C                     SETON                     707879
     C                     SETOF                     86
     C                     MOVEL'INQUIRY' F3MODE    P
     C                     ENDSL
     C*
     C                     EXFMTFMT030
     C                     MOVEL*OFF      *IN89
     C                     MOVEL*BLANK    MSG
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     LEAVE
     C                     OTHER
     C                     MOVEL*OFF      W@ERR3  1
     C                     EXSR #CHK3
     C           W@ERR3    IFEQ *ON
     C                     MOVEL*ON       *IN89
     C                     ITER
     C                     END
     C           *INKE     IFEQ *ON
     C                     EXSR #UPD3
     C                     EXSR #SET2
     C                     LEAVE
     C                     END
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #SET3     BEGSR
     C*
     C                     MOVEL*BLANK    F3SHN1
     C                     MOVEL*BLANK    F3SHN2
     C                     MOVEL*BLANK    F3SHN3
     C                     MOVEL*BLANK    F3ODR#
     C                     MOVEL*BLANK    F3LOT#
     C                     Z-ADD*ZERO     F3HTDT
     C                     MOVEL*BLANK    F3DEPT
     C                     MOVEL*BLANK    F3NC##
     C                     MOVEL*BLANK    F3REAS
     C*
     C                     DO
     C*
     C           W@NEW     IFEQ *ON
     C                     LEAVE
     C                     END
     C*
     C                     MOVELH2SHN1    F3SHN1
     C                     MOVELH2SHN2    F3SHN2
     C                     MOVELH2SHN3    F3SHN3
     C                     MOVELS2ODR#    F3ODR#
     C                     MOVELS2LOT#    F3LOT#
     C                     MOVELS2ISDT    F3HTDT
     C                     MOVELS2DEPT    F3DEPT
     C                     MOVELS2NC##    F3NC##
     C                     MOVELS2REAS    F3REAS
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #CHK3     BEGSR
     C*
     C                     SETOF                     717273
     C                     SETOF                     747576
     C                     SETOF                     77
     C*
     C                     DO
     C*
     C           W@NEW     IFEQ *OFF
     C           S2SEL     IFEQ 'D'
     C           S2SEL     OREQ 'I'
     C                     LEAVE
     C                     END
     C                     END
     C*
     C           F3SHN1    IFEQ *BLANK
     C           F3SHN2    OREQ *BLANK
     C                     SETON                     71
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
     C                     END
     C                     END
     C           K#FCEP    KLIST
     C                     KFLD           F3SHN1
     C                     KFLD           F3SHN2
     C                     KFLD           F3SHN3
     C           K#FCEP    CHAINFCEPL01              96
     C           *IN96     IFEQ *ON
     C           A2GSKD    ORNE *BLANK
     C                     SETON                     71
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,5     MSG
     C                     END
     C                     END
     C*
     C           F3ODR#    IFEQ *BLANK
     C           F3LOT#    ANDNE*BLANK
     C                     SETON                     72
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,6     MSG
     C                     END
     C                     END
     C*
     C           F3HTDT    IFEQ *ZERO
     C                     SETON                     74
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,7     MSG
     C                     END
     C                     END
     C*
     C           F3DEPT    IFEQ *BLANK
     C                     SETON                     75
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,8     MSG
     C                     END
     C                     END
     C*
     C           F3NC##    IFEQ *BLANK
     C                     SETON                     76
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,9     MSG
     C                     END
     C                     END
     C*
     C           F3REAS    IFEQ *BLANK
     C                     SETON                     77
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,10    MSG
     C                     END
     C                     END
     C*
     C           W@NEW     IFEQ *OFF
     C           W@ERR3    OREQ *ON
     C                     LEAVE
     C                     END
     C*
     C           K#PL97    KLIST
     C                     KFLD           F3SHN1
     C                     KFLD           F3SHN2
     C                     KFLD           F3SHN3
     C                     KFLD           F3ODR#
     C                     KFLD           F3LOT#
     C                     KFLD           K@YYYY
     C                     KFLD           K@MMMM
     C                     KFLD           K@DDDD
     C                     Z-ADDF3HTDT    K@YMD
     C           K#PL97    SETLLALDPL97
     C                     DO   *HIVAL
     C           K#PL97    READEALDPL97                  95
     C   95                LEAVE
     C           AGSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C           *IN95     IFEQ *OFF
     C                     SETON                     717273
     C                     SETON                     74
     C                     MOVEL*ON       W@ERR3
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,11    MSG
     C                     END
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
      *--------------------------------------------------
     C           #UPD3     BEGSR
     C*
     C                     TIME           WSDT
     C*
     C                     DO
     C*
     C           S2SEL     IFEQ 'C'
     C           S2SEL     OREQ 'D'
     C           K#PL97    SETLLALDPL97
     C                     DO   *HIVAL
     C           K#PL97    READEALDPL97                  95
     C   95                LEAVE
     C           AGSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C                     LEAVE
     C                     ENDDO
     C   95                LEAVE
     C           S2SEL     IFEQ 'D'
     C                     Z-ADDWSSYYY    AGSKYY
     C                     Z-ADDWSSMMM    AGSKMM
     C                     Z-ADDWSSDDD    AGSKDD
     C                     Z-ADDWSSHHH    AGSKTH
     C                     Z-ADDWSSNNN    AGSKTM
     C                     MOVEL'D'       AGSKJY
     C                     MOVELF1AUTH    AGSKUS
     C                     MOVEL#WSID     AGSKWS
     C                     END
     C           S2SEL     IFEQ 'C'
     C                     Z-ADDWSSYYY    AGKOYY
     C                     Z-ADDWSSMMM    AGKOMM
     C                     Z-ADDWSSDDD    AGKODD
     C                     Z-ADDWSSHHH    AGKOTH
     C                     Z-ADDWSSNNN    AGKOTM
     C                     MOVELF1AUTH    AGKOUS
     C                     MOVEL#WSID     AGKOWS
     C                     MOVELF3DEPT    AGDEPT
     C                     MOVELF3NC##    AGNC##
     C                     MOVELF3REAS    AGREAS
     C                     END
     C                     UPDATALDPP971
     C                     LEAVE
     C                     END
     C*
     C                     CLEARALDPP971
     C                     Z-ADDWSSYYY    AGKOYY
     C                     Z-ADDWSSMMM    AGKOMM
     C                     Z-ADDWSSDDD    AGKODD
     C                     Z-ADDWSSHHH    AGKOTH
     C                     Z-ADDWSSNNN    AGKOTM
     C                     MOVELF1AUTH    AGKOUS
     C                     MOVEL#WSID     AGKOWS
     C                     MOVELF3SHN1    AGSHN1
     C                     MOVELF3SHN2    AGSHN2
     C                     MOVELF3SHN3    AGSHN3
     C                     MOVELF3ODR#    AGODR#
     C                     MOVELF3LOT#    AGLOT#
     C                     Z-ADDF3HTDT    AGHTDT
     C                     MOVELF3DEPT    AGDEPT
     C                     MOVELF3NC##    AGNC##
     C                     MOVELF3REAS    AGREAS
     C                     MOVELA2ZETI    AGZETI
     C                     WRITEALDPP971
     C*
     C                     ENDDO
     C*
     C                     ENDSR
** ERR
ACCESS MODE INVALID.
AUTHORIZE CODE INVALID.
INQUIRY MODE CANNOT CHANGE/DELETE.
PART# IS BLANK.
PART# IS INVALID.
NEED ORDER# OR REMOVE LOT#.
KANBAN ISSUE DATE IS ZERO.
DEPARTMENT CODE IS BLANK.
NON CONFIRM# IS BLANK.
REASON IS BLANK.
SAME STOP ALERT DATA FOUND.
INPUT 'C','D','I' ONLY.








** AUTH
KATSU TANEBE
ATSUO MAMIYA
TAKASHI TANIGUCHI

















