     H            Y.
      ** ALDR27X  ******************************************
      *  SERVICE PARTS - ORDER SHORTAGES - PURGE WORKFILE  *
      *                                                    *
      * LEC   2021/05/26 CREATE                            *
      ******************************************************
     FALDWP27 UF  E           K        DISK
     FALDPP27 O   E           K        DISK                      A
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     C                     TIME           WSDT
     C                     MOVELWSSDAT    CURDAT
      *
     C                     EXSR GETPDT
      *
     C           RTN       IFEQ *BLANK
      *
     C                     MOVELPURDAT    PRGDAT  80
      *
     C                     Z-ADDWSSDAT    W1CRDT
     C                     Z-ADDWSSTM6    W1CRTM
     C                     DO   *HIVAL
      *
     C                     READ ALDWP27                  99
     C   99                LEAVE
      *
      * if scan date is less than purge date, delete the record...
      ****       W1SSHZ    IFLT PRGDAT
     C           W1FLDA    IFEQ 'PRINTED'
     C                     WRITEALDPP271
     C                     DELETALDWP271
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
      * Call Pgm to Get Purge Date.  1 days prior to today *
      *----------------------------------------------------*
     C           GETPDT    BEGSR
      *
     C                     CALL 'UTLR10'
     C                     PARM           CURDAT  8
     C                     PARM '-'       SIGN    1
     C                     PARM '0001'    DAYS    4
     C                     PARM 'N'       IAFNO   1
     C                     PARM           PURDAT  8
     C                     PARM           RTN     1
      *
     C                     ENDSR
      *----------------------------------------------------*
