     H            Y.
      ** ALDR75 *************************************************
      * ASJ PARTS 3-POINT SCAN INQUIRY                          *
      *   PROGRAM-ID.  :  ALDR75                                *
      *                                                         *
      *                                                         *
      *
      ************************************************* ALDR75 **
     FALDPW75 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     F                                              KINFDS @INFDS
     FGDGPL05 IF  E           K        DISK
      *------------------------------------------------------------
     E                    ER      1   1 78
     E                    CMD     1   2 78
      *------------------------------------------------------------
     I@INFDS      DS
     I                                    B 378 3790@@REC
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80IAYMD
     I                                        1   40IAKOYY
     I                                        5   60IAKOMM
     I                                        7   80IAKODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *--------------------------------------------------------
      *   MAIN ROUTINE
      *--------------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           K#GDG     KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
     C                     KFLD           K@YY    40
     C                     KFLD           K@MM    20
     C                     KFLD           K@DD    20
     C           K#GDGX    KLIST
     C                     KFLD           K@SHN1  5
     C                     KFLD           K@SHN2  5
     C                     KFLD           K@SHN3  2
      *
     C                     MOVE '01'      @@ID    2
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     @@RRN   40
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  1ST SCREEN
      *--------------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     MOVE CMD,1     D@CMD
     C                     WRITEDSP99
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C                     EXSR #SET1
     C           RRN1      IFEQ *ZERO
     C                     SETON                     616299
     C                     MOVE ER,1      D@MSG
     C                     ELSE
     C                     MOVE '02'      @@ID
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  CHECK
      *--------------------------------------------------------
     C           #CHK1     BEGSR
      *
     C                     EXSR #CLR
     C           D@FROM    IFEQ *ZERO
     C           D@TO      ANDEQ*ZERO
     C                     SETON                     616299
     C                     ENDIF
      *
     C           D@FROM    IFGT D@TO
     C                     SETON                     616299
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  CLEAR
      *--------------------------------------------------------
     C           #CLR      BEGSR
      *
     C                     MOVE *BLANK    D@MSG
     C                     MOVE *OFF      *IN99
     C                     MOVEA'00000000'*IN,61
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  SET DATA
      *--------------------------------------------------------
     C           #SET1     BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1
     C                     Z-ADD*ZERO     @@RRN
     C                     Z-ADDD@FROM    K@YMD
     C           *LOVAL    SETLLGDGPL05
     C           *IN80     DOUEQ*ON
     C                     READ GDGPL05                  80
     C           *IN80     IFEQ *OFF
     C           IASKJY    ANDEQ*BLANK
      *
     C                     MOVE IAHIN1    K@SHN1
     C                     MOVE IAHIN2    K@SHN2
     C                     MOVE IAHIN3    K@SHN3
      *
     C                     EXSR #SET11
      *
     C           K#GDGX    SETGTGDGPL05
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  SET DATA
      *--------------------------------------------------------
     C           #SET11    BEGSR
      *
     C                     CLEARSFL01
     C           K#GDG     SETLLGDGPL05
     C           *IN81     DOUEQ*ON
     C           K#GDGX    READEGDGPL05                  81
     C           *IN81     IFEQ *OFF
     C           IASKJY    ANDEQ*BLANK
     C           IAYMD     IFGT D@TO
     C                     LEAVE
     C                     ENDIF
      *
     C                     ADD  1         S@KAN#
     C                     ENDIF
     C                     ENDDO
      *
     C           S@KAN#    IFGT *ZERO
     C                     ADD  1         RRN1
     C                     MOVE K@SHN1    S@PRT1
     C                     MOVE K@SHN2    S@PRT2
     C                     MOVE K@SHN3    S@PRT3
     C                     WRITESFL01
     C                     ENDIF
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  2ND SCREEN
      *--------------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      @@ID
     C                     ENDSL
      *
     C                     ENDSR
**  ER
E-01 NO DATA.
**  CMD
F1:END
F1:END      F12:GO BACK      PAGE UP/DWN
