     H            Y
     F**ALDRT8 ********************************************************
     F* GET BZ UNLOADING  AJSPP20                                     *
     F*  2019.09.17      SAKAKI                                       *
     F******************************************************AJSR2W*****
     FAJSPL2B IF  E           K        DISK                           UC
      *===============================================================
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     **かんばん発行日
     I            DS
     I                                        1   80W$HTHZ
     I                                        1   40W$HTYY
     I                                        5   60W$HTMM
     I                                        7   80W$HTDD
     **計量日
     I            DS
     I                                        1   80J2KEHZ
     I                                        1   40J2KEIY
     I                                        5   60J2KEIM
     I                                        7   80J2KEID
     **計量時刻
     I            DS
     I                                        1   60J2KETM
     I                                        1   20J2KEIJ
     I                                        3   40J2KEIF
     I                                        5   60J2KEIB
     **
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
      *===============================================================
     C           *ENTRY    PLIST
     C*                                IN ------
     C                     PARM           P@HIN1  5        PART NUMBER 1
     C                     PARM           P@HIN2  5        PART NUMBER 2
     C                     PARM           P@HIN3  2        PART NUMBER 3
     C                     PARM           P@THAI  3        PRODUCTION ORDER
     C                     PARM           P@PAGE  2        PAGE
     C                     PARM           P@HTHZ  80       KANBAN PUBLICATION
     C*                               OUT ------
     C                     PARM           P@KEHZ  80       WORK ADMITTABLE DATE
     C                     PARM           P@KETM  60       WORK ADMITTABLE TIME
     C                     PARM           P#OPN   1
     C           P#OPN     IFEQ '9'
     C           OPNFL     IFEQ '1'
     C                     CLOSEAJSPL2B
     C                     ENDIF
     C                     SETON                     LR
     C                     RETRN
     C                     ENDIF
     C           OPNFL     IFEQ *BLANK
     C                     MOVEL'1'       OPNFL   1
     C                     OPEN AJSPL2B
     C                     ENDIF
     C*------------------------*
     C*   KLIST の作成       *
     C*------------------------*
     C           #KEY1     KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
     C                     KFLD           W$HTYY  40       KANBAN PUBLICATION Y
     C                     KFLD           W$HTMM  20       KANBAN PUBLICATION M
     C                     KFLD           W$HTDD  20       KANBAN PUBLICATION D
     C           #KEY11    KLIST
     C                     KFLD           P@HIN1  5        PART NUMBER 1
     C                     KFLD           P@HIN2  5        PART NUMBER 2
     C                     KFLD           P@HIN3  2        PART NUMBER 3
     C                     KFLD           P@THAI  3        PRODUCTION ORDER
      *===============================================================
     C                     Z-ADDP@HTHZ    W$HTHZ           KANBAN PUBLICATION
     C                     Z-ADD0         P@KEHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADD0         P@KETM  60       WORK ADMITTABLE TIME
     C           #KEY1     SETLLAJSPL2B
     C*
     C           #KEY11    READEAJSPL2B                  90
     C*
     C           *IN90     DOWEQ*OFF
     C***        J2KEHZ    IFGE W$HTHZ
     C           J2PAG1    IFEQ P@PAGE
     C           J2PAG2    OREQ P@PAGE
     C           J2PAG3    OREQ P@PAGE
     C           J2PAG4    OREQ P@PAGE
     C                     Z-ADDJ2KEHZ    P@KEHZ  80       WORK ADMITTABLE DATE
     C                     Z-ADD0         J2KEIB
     C                     Z-ADDJ2KETM    P@KETM  60       WORK ADMITTABLE TIME
     C                     LEAVE
     C                     ENDIF
     C***                  ENDIF
     C           #KEY11    READEAJSPL2B                  90
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
