     H            Y.                                                      EER030
     F** ALDRZ6 **************************************
     F*CREATE SIGN-ON INFORMATION FOR HANDY        *
     F*       T.SAKAKI         2015.10.15            *
     F************************************************
     FAM#PP35 IF  E           K        DISK
     FALDPPZ5 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTHMS
     I                                        7  140WDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      *   PARAMETER  TRANCFER                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PUPGM  10
     C                     PARM           PWKCD   6
     C                     PARM           PWKNM  20
      *----------------------------------------------------*
      * MAIN                                           *
      *----------------------------------------------------*
     C                     TIME           WTIME
      * GET PASSWORD GROUP
     C           PUPGM     CHAINAM#PP351             21
     C           *IN21     IFEQ '0'
     C                     Z-ADDR5PGRP    W#PGRP  20
     C                     MOVELR5PGNM    W#PGNM 20
      *
     C                     CLEARALDPPZ51
      *
     C                     MOVEL*BLANK    A@SKJY
     C                     MOVELPUPGM     A@UPGM
     C                     MOVELW#USER    A@UUNM
     C                     Z-ADDWDATE     A@ONDT
     C                     Z-ADDWTHMS     A@ONTM
     C                     Z-ADD0         A@OFDT
     C                     Z-ADD0         A@OFTM
     C                     MOVELW#WSID    A@WSNO
     C                     MOVELPWKCD     A@WKCD
     C                     MOVELPWKNM     A@WKNM
     C                     Z-ADDW#PGRP    A@PGRP
     C                     MOVELW#PGNM    A@PGNM
     C                     MOVEL*BLANK    A@UNCD
      *
     C                     WRITEALDPPZ51
     C                     ENDIF
      *----------------------------------------------------*
      * 終了処理                                         *
      *----------------------------------------------------*
     C                     SETON                     LR
     C                     RETRN
