     H            Y.
      ** ALFR55  *******************************************
      *  CONVEYANCE WIRE PULL SCAN ERROR LOG LIST          *
      *                                                    *
      * LEC   18/12/06 CREATE(COPY FROM ALFR45)            *
      ******************************************************
     FALFPL45 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
      *
     E                    TBL     1   1 50
      *
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     I            DS
     I                                        1  120W@FROM
     I                                        1   80W@SCDT
     I                                        1   40W@SCYY
     I                                        5   60W@SCMM
     I                                        7   80W@SCDD
     I                                        9  120W@SCTM
     I            DS
     I                                        1  120W@TO
     I                                        1   80W@ECDT
     I                                        1   40W@ECYY
     I                                        5   60W@ECMM
     I                                        7   80W@ECDD
     I                                        9  120W@ECTM
      * SCAN DATE/TIME
     I            DS
     I                                        1   80WECODT
     I                                        9  140WECOTM
     I                                        1  120WEDTTM
     I                                        9  120WETIME
      *
     C           K#01      KLIST
     C                     KFLD           W@SCDT
     C                     KFLD           W@STTM
     C           K#01      SETLLALFPL45
      *
     C                     DO   *HIVAL
      *
     C                     READ ALFPL45                  99
     C   99                LEAVE
      *
     C           WEDTTM    IFGT W@TO
     C                     LEAVE
     C                     ENDIF
      *
     C           W@1STP    IFEQ *ON
     C           *INOF     OREQ *ON
     C                     EXCPT@HED
     C                     MOVEL*OFF      W@1STP
     C                     ENDIF
      *
     C                     MOVELWEWKCD    K@TMCD  60
     C           K@TMCD    CHAINALBPL30              97
     C  N97                MOVELALWKNM    P@WKNM 20
     C   97                MOVEL*BLANK    P@WKNM
      *
     C                     MOVELWERBAR    WKRBAR 33
     C                     MOVELWEIBAR    WKIBAR 33
      *
     C                     EXCPT@DTL
     C                     MOVEL*ON       PMRFLG
      *
     C                     ENDDO
      *
     C                     MOVEL*ON       *INLR
     C                     RETRN
      *-----------------------------------------------------
      * INITIAL SET
      *-----------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           PMFRDT 12
     C                     PARM           PMTODT 12
     C                     PARM           PMRFLG  1
     C                     MOVEL*OFF      PMRFLG
      *
     C                     TIME           WSDT
      *
     C                     MOVELPMFRDT    W@FROM
     C                     MOVELPMTODT    W@TO
      *
     C           W@SCTM    MULT 100       W@STTM  60
     C           W@ECTM    MULT 100       W@EDTM  60
      *
     C                     MOVEL*ON       W@1STP  1
      *
     C                     ENDSR
      *
      *-----------------------------------------------------
     OQPRINT  E   01           @HED
     O                         #PGM      10
     O                         TBL,1     72
     O                                   87 'DATE'
     O                         WSSDATY   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O        E   02           @HED
     O                                   87 'TIME'
     O                         WSSTM6    98 '  :  :  '
     O        E   03           @HED
     O                                   16 'DATE RANGE FROM:'
     O                         W@SCDTY   28
     O                         W@SCTM    36 ' 0:  '
     O                                   43 'TO:'
     O                         W@ECDTY   55
     O                         W@ECTM    63 ' 0:  '
     O        E   05           @HED
     O                                    6 'DATE'
     O                                   16 'TIME'
     O                                   28 'TEAM MEMBER'
     O                                   43 'F/I'
     O                                   50 'SCREEN'
     O                                   66 'ERROR MESSAGE'
     O                                   83 'PART ID'
     O                                  106 'MATERIAL NAME'
     O                                  118 'DIAMETER'
     O                                  131 'I TO LOCN'
     O        E 1              @DTL
     O                         WECODTY   10
     O                         WETIME    16 ' 0:  '
     O                         P@WKNM    37
     O                         WEFORI    41
     O                         WEERSC    48
     O                         WEEMSG    73
     O                         WEZETI    81
     O                         WEMATN   108
     O                         WEDIAM1  117
     O                         WELOC2   126
     O                         WELOC3   129
     O        E 1              @DTL
     O                                   22 'Wire -'
     O                         WEWBAR    43
     O                                   54 'Rtvl -'
     O                         WKRBAR    88
     O                                   97 'Locn -'
     O                         WKIBAR   131
** TBL
<< CONVEYANCE WIRE PULL SCAN ERROR LOG LIST >>
