     H            Y.                                    1
     H***ALFR01*****************************************************************
     H*  CONVEYANCE WASHER PULL SCAN                                           *
     H*
     H* TCHK  10/20/10 CREATE
     H* TCHK1 08/05/11 ADD 4POINT M8(RK,RH,RJ,RL,RM,RN)
     H* TCHK2 09/24/12 ADD RK-METAL
JW1  H* JW    11/01/16 CHG 2323(FREEWAY), 2525(RK METAL)
     H* LEC   CHECK FOR CORRECT PART ID
JW2  H* JW    2022.03.03 ADD SEKIDO(3111)
     H* LEC   CHECK/REMOVE PT BARCODE IN CV OVERFLOW FILE
     H* LEC   CALL PROGRAM TO UPDATE WASHER INVENTORY FILE  7/15/2025
     H**************************************************************************
     FALFPW01 CF  E                    WORKSTN
     FALBPL30 IF  E           K        DISK
     FAKBPL01 IF  E           K        DISK
     F*
     FALFPP01 IF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  20 17
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I* LOCATION
     I            DS
     I                                        1  10 WALOC
     I                                        1   4 WAZETI
     I                                        5  10 WALOC#
     I                                        5   5 WALC#1
     I                                        6   7 WALC#2
     I                                        8   9 WALC#3
     I                                       10  10 WALC#4
     I* ASJ KANBAN:KANBAN TYPE,ABSOLUTE#,ORDER#,SEHIN KUBUN,LOT#
     I            DS
     I                                        1  17 WBKNBN
     I                                        1   1 WBKANS
     I                                        2   5 WBZETI
     I                                        6  11 WBORDR
     I                                       12  12 WBSEIH
     I                                       13  16 WBITEM
     I                                       17  17 WBCHKD
     I* FREEWAY KANBAN:KUBUN,ABSOLUTE#,SUPPLIER,ETC
     I            DS
     I                                        1  13 WCKNBN
     I                                        1   1 WCKANS
     I                                        2   5 WCZETI
     I                                        6   9 WCSUPP
     I                                       10  13 WCETC
     I* FREEWAY TAG:KUBUN,P#1,'-',P#2,'-',P#3
     I            DS
     I                                        1  15 WDKNBN
     I                                        1   1 WDKANS
     I                                        2   6 WDSHN1
     I                                        7   7 WDDASA
     I                                        8  12 WDSHN2
     I                                       13  13 WDDASB
     I                                       14  15 WDSHN3
     I* RETRIEVAL KANBAN:P#1,'-',P#2,'-',P#3
     I            DS
     I                                        1  15 WEKNBN
     I                                        1   5 WESHN1
     I                                        6   6 WEDASA
     I                                        7  11 WESHN2
     I                                       12  12 WEDASB
     I                                       13  14 WESHN3
     I            DS
     I                                        1  12 W1SHIN
     I                                        1   5 W1SHN1
     I                                        6  10 W1SHN2
     I                                       11  12 W1SHN3
     I            DS
     I                                        1  12 W2SHIN
     I                                        1   5 W2SHN1
     I                                        6  10 W2SHN2
     I                                       11  12 W2SHN3
     I            DS
     I                                        1  12 W3SHIN
     I                                        1   5 W3SHN1
     I                                        6  10 W3SHN2
     I                                       11  12 W3SHN3
     I            DS
     I                                        1  12 W4SHIN
     I                                        1   5 W4SHN1
     I                                        6  10 W4SHN2
     I                                       11  12 W4SHN3
     I            DS
     I                                        1  12 W5SHIN
     I                                        1   5 W5SHN1
     I                                        6  10 W5SHN2
     I                                       11  12 W5SHN3
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'00'      #FMT00
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C           @@ID      CASEQ'30'      #FMT30
     C           @@ID      CASEQ'40'      #FMT40
     C           @@ID      CASEQ'50'      #FMT50
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           PITANT 10
      *
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    W@DATE  80
     C                     Z-ADDWSSTM6    @@TIM   60
     C*
     C                     CLEARFMT000
     C                     EXSR #CLRS
     C                     MOVEL*BLANK    W@ERR   1
     C*
     C                     MOVEL'10'      @@ID    2
     C* DUMMY READ
     C                     READ ALFPP01                  98
     C*
     C                     ENDSR
     C*************************************************************************
     C*     TM-CODE ENTRY SCREEN
     C**************************************************************************
     C           #FMT00    BEGSR
      *
     C                     EXFMTFMT000
     C                     MOVEL*BLANK    F0ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK00
     C           *IN99     IFEQ *OFF
     C                     MOVE '10'      @@ID
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C*************************************************************************
     C*     TM-CODE ENTRY SCREEN CHECK
     C**************************************************************************
     C           #CHK00    BEGSR
     C*
     C                     SETOF                     6199
     C* TM-CODE CHECK
     C           F0USRC    CHAINALBPL301             90
     C           *IN90     IFEQ *OFF
     C           ALSKJY    ANDEQ*BLANK
     C                     ELSE
     C                     SETON                     6199
     C           F0ERR     IFEQ *BLANK
     C                     MOVELERR,1     F0ERR
     C                     END
     C                     END
      *
     C                     ENDSR
     C*************************************************************************
     C*     LOCATION SCREEN
     C**************************************************************************
     C           #FMT10    BEGSR
     C*
     C                     EXFMTFMT100
     C                     MOVEL*BLANK    F1ERR
     C*
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKG     WHEQ *ON
     C                     EXSR #CLRS
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     Z-ADD*ZERO     W1BMON  40
     C                     EXSR #CHK10
     C           *IN99     IFEQ *OFF
     C           W1BMON    IFEQ 8990
     C                     MOVEL'20'      @@ID
     C                     ELSE
 JW1 C                     MOVE '40'      @@ID
     C                     END
     C                     ELSE
     C           F1LOC     IFNE *BLANK
     C                     EXSR #WRTER
     C                     END
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*     LOCATION SCREEN CHECK
     C**************************************************************************
     C           #CHK10    BEGSR
     C*
     C                     MOVEL*BLANK    W1SHIN
     C                     MOVELF1LOC     WALOC
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           WALOC     IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,2     F2ERR
     C                     MOVELERR,2     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C*
     C           K#AKB     KLIST
     C                     KFLD           WALC#1
     C                     KFLD           WALC#2
     C                     KFLD           WALC#3
     C                     KFLD           WALC#4
     C           K#AKB     SETGTAKBPL01
     C*
     C                     DO   *HIVAL
     C*
     C           K#AKB     REDPEAKBPL01                  90
     C   90                LEAVE
     C           L1SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           L1STYY    IFNE 9999
     C                     ITER
     C                     END
      * LEC
      * CHECK PART ID, IF NOT SAME IGNORE
     C           L1ZETI    IFNE WAZETI
     C                     ITER
     C                     ENDIF
     C*
     C                     LEAVE
     C*
     C                     ENDDO
     C*
     C           *IN90     IFEQ *ON
     C                     SETON                     9961
     C                     MOVELERR,2     F2ERR
     C                     MOVELERR,2     F99ER1
     C                     MOVELERR,4     F99ER2
     C                     LEAVE
     C                     END
     C*
     C           L1ZETI    IFNE WAZETI
     C                     SETON                     9961
     C                     MOVELERR,2     F2ERR
     C                     MOVELERR,2     F99ER1
     C                     MOVELERR,5     F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     MOVELL1SHN1    W1SHN1
     C                     MOVELL1SHN2    W1SHN2
     C                     MOVELL1SHN3    W1SHN3
     C                     Z-ADDL1BMON    W1BMON
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C*----------------------------------------------------------------*********
     C*     FIELD CLEAR SUB
     C*----------------------------------------------------------------*********
     C           #CLRS     BEGSR
     C*
     C                     CLEARFMT100
     C                     CLEARFMT200
     C                     CLEARFMT300
     C                     CLEARFMT400
     C                     CLEARFMT500
     C                     MOVEL*BLANK    W1SHIN
     C                     MOVEL*BLANK    W2SHIN
     C                     MOVEL*BLANK    W3SHIN
     C                     MOVEL*BLANK    W4SHIN
     C                     MOVEL*BLANK    W5SHIN
     C                     MOVEL*BLANK    WALOC
     C                     MOVEL*BLANK    WBKNBN
     C                     MOVEL*BLANK    WCKNBN
     C                     MOVEL*BLANK    WDKNBN
     C                     MOVEL*BLANK    WEKNBN
     C*
     C                     ENDSR
     C*************************************************************************
     C*     ASJ KANBAN SCREEN
     C**************************************************************************
     C           #FMT20    BEGSR
      *
     C                     EXFMTFMT200
     C                     MOVEL*BLANK    F2ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKG     WHEQ *ON
     C                     EXSR #CLRS
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK20
     C           *IN99     IFEQ *OFF
     C                     MOVE '50'      @@ID
     C                     ELSE
     C                     EXSR #WRTER
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     ASJ KANBAN SCREEN CHECK
     C**************************************************************************
     C           #CHK20    BEGSR
     C*
     C                     MOVEL*BLANK    W2SHIN
     C                     MOVELF2BARC    WBKNBN
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           WBKNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,6     F3ERR
     C                     MOVELERR,6     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C*
     C**JW1      WBKANS    IFNE 'I'
     C**                   SETON                     9961
     C**                   MOVELERR,6     F3ERR
     C**                   MOVELERR,6     F99ER1
     C**                   MOVELERR,7     F99ER2
     C**                   LEAVE
     C**                   END
     C*
     C           WBZETI    IFNE WAZETI
     C                     SETON                     9961
     C                     MOVELERR,9     F3ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,10    F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     FREEWAY/RK-METAL KANBAN SCREEN
     C**************************************************************************
     C           #FMT30    BEGSR
      *
     C                     EXFMTFMT300
     C                     MOVEL*BLANK    F3ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKG     WHEQ *ON
     C                     EXSR #CLRS
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK30
     C           *IN99     IFEQ *OFF
     C                     MOVE '40'      @@ID
     C                     ELSE
     C                     EXSR #WRTER
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     FREEWAY/RK-METAL KANBAN SCREEN CHECK
     C**************************************************************************
     C           #CHK30    BEGSR
     C*
     C                     MOVEL*BLANK    W3SHIN
     C                     MOVELF3BARC    WCKNBN
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           WCKNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,6     F3ERR
     C                     MOVELERR,6     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C*
     C           WCSUPP    IFNE '2323'
TCHK2C           WCSUPP    ANDNE'2525'
JW2  C           WCSUPP    ANDNE'3111'
     C           WCSUPP    ANDNE'2626'
     C                     SETON                     9961
     C                     MOVELERR,6     F3ERR
     C                     MOVELERR,6     F99ER1
     C                     MOVELERR,11    F99ER2
     C                     LEAVE
     C                     END
     C*
     C           WCZETI    IFNE WAZETI
     C                     SETON                     9961
     C                     MOVELERR,9     F3ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,10    F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     FREEWAY/RK-METAL TAG SCREEN
     C**************************************************************************
     C           #FMT40    BEGSR
      *
     C                     EXFMTFMT400
     C                     MOVEL*BLANK    F4ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKG     WHEQ *ON
     C                     EXSR #CLRS
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK40
     C           *IN99     IFEQ *OFF
     C           WALC#2    IFEQ 'R1'
     C           WALC#2    OREQ 'R2'
TCHK1C           WALC#2    OREQ 'RK'
TCHK1C           WALC#2    OREQ 'RH'
TCHK1C           WALC#2    OREQ 'RJ'
TCHK1C           WALC#2    OREQ 'RL'
TCHK1C           WALC#2    OREQ 'RM'
TCHK1C           WALC#2    OREQ 'RN'
     C                     MOVE '50'      @@ID
     C                     ELSE
     C                     EXSR #WRTOK
     C                     EXSR #CLRS
     C                     MOVEL'10'      @@ID
     C                     EXFMTFMT900
     C                     END
     C                     ELSE
     C                     EXSR #WRTER
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     FREEWAY/RK-METAL TAG SCREEN CHECK
     C**************************************************************************
     C           #CHK40    BEGSR
     C*
     C                     MOVEL*BLANK    W4SHIN
     C                     MOVELF4BARC    WDKNBN
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           WDKNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,6     F4ERR
     C                     MOVELERR,6     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     MOVELWDSHN1    W4SHN1
     C                     MOVELWDSHN2    W4SHN2
     C                     MOVELWDSHN3    W4SHN3
     C           W1SHIN    IFNE W4SHIN
     C                     SETON                     9961
     C                     MOVELERR,9     F4ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,10    F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     RETRIEVAL KANBAN SCREEN
     C**************************************************************************
     C           #FMT50    BEGSR
      *
     C                     EXFMTFMT500
     C                     MOVEL*BLANK    F5ERR
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKG     WHEQ *ON
     C                     EXSR #CLRS
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK50
     C           *IN99     IFEQ *OFF
     C                     EXSR #WRTOK
     C                     EXSR #CLRS
     C                     MOVEL'10'      @@ID
     C                     EXFMTFMT900
     C                     ELSE
     C                     EXSR #WRTER
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C**************************************************************************
     C*     RETRIEVAL KANBAN SCREEN CHECK
     C**************************************************************************
     C           #CHK50    BEGSR
     C*
     C                     MOVEL*BLANK    W5SHIN
     C                     MOVELF5BARC    WEKNBN
     C                     SETOF                     9961
     C*
     C                     DO
     C*
     C           WEKNBN    IFEQ *BLANK
     C                     SETON                     9961
     C                     MOVELERR,6     F5ERR
     C                     MOVELERR,6     F99ER1
     C                     MOVELERR,3     F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     MOVELWESHN1    W5SHN1
     C                     MOVELWESHN2    W5SHN2
     C                     MOVELWESHN3    W5SHN3
     C           W1SHIN    IFNE W5SHIN
     C                     SETON                     9961
     C                     MOVELERR,9     F5ERR
     C                     MOVELERR,9     F99ER1
     C                     MOVELERR,10    F99ER2
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C           *IN99     IFEQ *ON
     C                     EXFMTFMT999
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*       WRITE A OK RECORD
     C**************************************************************************
     C           #WRTOK    BEGSR
     C*
     C                     CLEARALFPP011
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSDAT    A8DATE
     C                     Z-ADDWSSTM6    A8TIME
     C                     MOVEL#USER     A8USER
     C                     MOVEL#WSID     A8WSID
     C                     MOVEL#PGM      A8PGID
     C*
     C                     MOVELPOPR      A8TMCD
     C*
     C                     MOVELW@ERR     A8ERR
     C           W1BMON    IFEQ 8990
     C                     MOVEL'A'       A8DKND
     C                     END
     C           W1BMON    IFEQ 2323
     C                     MOVEL'F'       A8DKND
     C                     END
     C           W1BMON    IFEQ 2525
     C                     MOVEL'R'       A8DKND
     C                     END
JW2  C           W1BMON    IFEQ 3111
 "   C                     MOVEL'S'       A8DKND           SEKIDO
 "   C                     END
      * art metals
     C           W1BMON    IFEQ 2626
     C                     MOVEL'T'       A8DKND
     C                     END
     C*
     C                     MOVELW1SHN1    A8PRT1
     C                     MOVELW1SHN2    A8PRT2
     C                     MOVELW1SHN3    A8PRT3
     C*
     C                     MOVELWALOC     A8BRC1
     C                     MOVELWAZETI    A8B1LZ
     C                     MOVELWALC#1    A8B1L1
     C                     MOVELWALC#2    A8B1L2
     C                     MOVELWALC#3    A8B1L3
     C                     MOVELWALC#4    A8B1L4
     C*
     C           F2BARC    IFNE *BLANK
     C                     MOVELWBKNBN    A8BRC2
     C                     MOVELWBZETI    A8ZTI2
     C                     MOVELWBORDR    A8ODR2
     C                     MOVELWBITEM    A8ITM2
     C                     END
     C*
     C           F3BARC    IFNE *BLANK
     C                     MOVELWCKNBN    A8BRC3
     C                     MOVELWCZETI    A8ZTI3
     C                     END
     C*
     C           F4BARC    IFNE *BLANK
     C                     MOVELWDKNBN    A8BRC4
     C                     END
     C*
     C           F5BARC    IFNE *BLANK
     C                     MOVELWEKNBN    A8BRC5
     C                     END
     C*
     C           W@ERR     IFNE *BLANK
     C                     MOVELF99ER1    A8EM01
     C                     MOVELF99ER2    A8EM02
     C                     END
      *
     C                     WRITEALFPP011
     C*
      *
      * check/remove PT barcode in CV overflow file...
     C           A8BRC2    IFNE *BLANK
     C           W@ERR     ANDEQ*BLANK
      *
     C                     MOVEL#PGM      P#PGM  10 P
     C                     MOVELA8BRC2    P#BRC2 17 P
     C                     CALL 'ALCR9U'
     C                     PARM           POPR
     C                     PARM           P#PGM
     C                     PARM           P#BRC2
      *
      * UPDATE WASHER INVENTORY FILE - CANS (ORDER)...
     C           A8DKND    IFEQ 'A'
     C                     MOVELA8BRC2    ORDKAN 20
     C                     MOVELA8BRC5    RTVKAN 20
     C                     CALL 'IWAR70U3'
     C                     PARM           ORDKAN
     C                     PARM           RTVKAN
     C                     PARM           WALOC#
     C                     PARM           POPR
     C                     PARM           P#PGM
     C                     PARM '3'       #STEP   1
     C                     PARM           #RTNC   1
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
     C**************************************************************************
     C*       WRITE A ERROR RECORD
     C**************************************************************************
     C           #WRTER    BEGSR
     C*
     C                     MOVEL'E'       W@ERR
     C*
     C                     EXSR #WRTOK
     C*
     C                     MOVEL*BLANK    W@ERR
     C*
     C                     ENDSR
     C**************************************************************************
** ERR
USER CODE ERROR                  #01 O
LOCATION ERROR                   #02 O
BLANK                            #03 O
M/F NOT FOUND                    #04 O
CHECK TAG                        #05 O
KANBAN ERROR                     #06 O
ONLY ASJ KANBAN                  #07 O
KANBAN KIND ERROR                #08 O
UNMATCH                          #09 O
PART NUMBER                      #10 O
FREEWAY KANBAN                   #11 O
                                 #12
                                 #13
                                 #14
                                 #15
                                 #16
                                 #17
                                 #19
                                 #20
                                 #09
