     H            Y/
     FALFPW16 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL01
     FALFWL15 IF  E           K        DISK
      *
     E                    CMD     1   2 78
     E*                   MSG     1   1 78
      *
     I            DS
     I                                        1   80BANOHZ
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     C           *ENTRY    PLIST
     C                     PARM           PYYYY   40
     C                     PARM           PMM     20
     C                     PARM           PDD     20
     C                     PARM           @@IDX   2
     C* ALDWL15
     C           KEY1      KLIST
     C                     KFLD           PYYYY            YY
     C                     KFLD           PMM              MM          G)
     C                     KFLD           PDD              DD          G)
      *--------------------------------------------------
     C           @@ID      DOUEQ'99'
     C           @@ID      CASEQ'01'      #SCRN1
     C           @@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     MOVE '01'      @@ID    2
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN1    BEGSR
      *
     C                     EXSR #SET
     C                     MOVE '02'      @@ID
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SET      BEGSR
      *
     C                     MOVE *ON       *IN52
     C                     WRITECTL01
     C                     MOVE *OFF      *IN52
     C                     Z-ADD*ZERO     RRN1    40
     C                     Z-ADD*ZERO     S@BOXS
     C                     Z-ADDPYYYY     C@YYYY
     C                     Z-ADDPMM       C@MM
     C                     Z-ADDPDD       C@DD
      *
     C           KEY1      SETLLALFWL15
B0   C           *IN90     DOUEQ*ON
     C           KEY1      READEALFWL15                  90
B1   C           *IN90     IFEQ *OFF
     C           @FIRST    IFEQ ' '
     C                     MOVE D5NAME    SVNAME 20
     C                     MOVE 'X'       @FIRST  1
     C                     ENDIF
     C           D5NAME    IFEQ SVNAME
     C                     ADD  D5BOX     SVBOXS  60
     C                     MOVE D5OPER    SVCOUT  6
     C                     ELSE
     C                     MOVE SVNAME    S@NAME
     C                     MOVE SVCOUT    S@COUT
     C                     Z-ADDSVBOXS    S@BOXS
     C                     Z-ADDD5BOX     SVBOXS
     C                     MOVE D5NAME    SVNAME
     C                     MOVE D5OPER    SVCOUT
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
E1   C                     ENDIF
E0   C                     ENDDO
     C* PROCESS LAST
     C                     MOVE SVNAME    S@NAME
     C                     MOVE SVCOUT    S@COUT
     C                     Z-ADDSVBOXS    S@BOXS
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ENDSR
      *--------------------------------------------------
     C           #SCRN2    BEGSR
      *
     C                     MOVE CMD,2     D@CMD
     C                     WRITEDSP99
     C                     MOVE *ON       *IN51
     C                     EXFMTCTL01
     C                     MOVE *OFF      *IN51
      *
     C                     MOVE '99'      @@ID
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '01'      @@IDX
     C           *INKL     WHEQ *ON
     C                     MOVE '12'      @@IDX
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
** CMD
   F1:END
   F1:END     F12:GO BACK
