     H            Y.
     F** ALFR05 ********************************************************
     F*  CONVEYANCE WASHER # OF PROCESSED BOXES BY WORKER LIST         *
     F*                                                                *
     F* TCHK1 10/21/10 CREATE(COPY FROM ALCR05)                        *
     F********************************************  ALFR05 *************
     FALFPL01 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FALFWP05 O   E                    DISK
     I******************************************************************
     I            DS
     I                                        1   80A8DATE
     I                                        1   40A8KSYY
     I                                        5   60A8KSMM
     I                                        7   80A8KSDD
     I            DS
     I                                        1   60A8TIME
     I                                        1   40A8KSTM
     I                                        1   20A8KSJI
     I                                        3   40A8KSPN
     I            DS
     I                                        1   80D5DATE
     I                                        1   40D5YYYY
     I                                        5   60D5MMMM
     I                                        7   80D5DDDD
     I            DS
     I                                        1   80WWDATE
     I                                        1   40WWYY
     I                                        5   60WWMM
     I                                        7   80WWDD
     I            DS
     I                                        1   80XXDATE
     I                                        1   40XXYY
     I                                        5   60XXMM
     I                                        7   80XXDD
     I            DS
     I                                        1   80KKDATE
     I                                        1   40KKYY
     I                                        5   60KKMM
     I                                        7   80KKDD
     I* SYSTEM(TIME + DATE)
     I            DS
     I                                        1  140WSDT
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I                                        1   40WSSTM4
     I                                        1   60WSSTM6
     I                                        7  140WSSDAT
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           *ENTRY    PLIST
     C                     PARM           PYYYY   40
     C                     PARM           PMMMM   20
     C*
     C           K#AGD     KLIST
     C                     KFLD           K@YYYY  40
     C                     KFLD           K@MMMM  20
     C                     KFLD           K@DDDD  20
     C*
     C                     EXSR @INT
     C                     EXSR @MAIN
     C                     EXSR @END
     C**************************************************************************
     C*                    @INT
     C**************************************************************************
     C           @INT      BEGSR
     C*
     C                     Z-ADDPYYYY     WWYY
     C                     Z-ADDPMMMM     WWMM
     C                     Z-ADD1         WWDD
     C                     ADD  1         WWMM
     C           WWMM      IFGT 12
     C                     SUB  12        WWMM
     C                     ADD  1         WWYY
     C                     ENDIF
      *
     C                     Z-ADDPYYYY     K@YYYY
     C                     Z-ADDPMMMM     K@MMMM
     C                     Z-ADD1         K@DDDD
     C           K#AGD     SETLLAGDPL12
     C                     READPAGDPL12                  80
     C           *IN80     IFEQ *OFF
     C                     Z-ADDF8KAYY    KKYY
     C                     Z-ADDF8KAMM    KKMM
     C                     Z-ADDF8KADD    KKDD
     C                     ENDIF
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @MAIN
     C**************************************************************************
     C           @MAIN     BEGSR
     C*
     C                     SETON                     80
     C                     CLEARALFWP051
     C*
     C           KKDATE    SETLLALFPL01
     C*
     C                     DO   *HIVAL
     C*
     C                     READ ALFPL01                  90
     C   90                LEAVE
     C           A8DATE    IFGT WWDATE
     C                     LEAVE
     C                     END
      *
     C           A8ERR     IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C           A8DATE    IFEQ WWDATE
     C           A8KSTM    ANDGE2300
     C                     ITER
     C                     END
      *
     C           A8DATE    IFEQ KKDATE
     C           A8KSTM    ANDLT2300
     C                     ITER
     C                     END
      *
     C           A8KSTM    IFGE 2300
     C                     Z-ADDA8KSYY    K@YYYY  40
     C                     Z-ADDA8KSMM    K@MMMM  20
     C                     Z-ADDA8KSDD    K@DDDD  20
     C           K#AGD     SETGTAGDPL12
     C                     READ AGDPL12                  94
     C           *IN94     IFEQ *OFF
     C                     Z-ADDF8KAYY    XXYY
     C                     Z-ADDF8KAMM    XXMM
     C                     Z-ADDF8KADD    XXDD
     C                     END
     C                     ELSE
     C                     Z-ADDA8KSYY    XXYY
     C                     Z-ADDA8KSMM    XXMM
     C                     Z-ADDA8KSDD    XXDD
     C                     END
     C* FIRST RECORD
     C           *IN80     IFEQ '1'
     C                     SETOF                     80
     C                     MOVELA8TMCD    D5OPER
     C                     MOVELA8TMCD    W@@N06  60
     C           W@@N06    CHAINALBPL30              93
     C           *IN93     IFEQ '0'
     C                     MOVE ALWKNM    D5NAME
     C                     ELSE
     C                     MOVE *BLANK    D5NAME
     C                     END
     C                     Z-ADDXXDATE    D5DATE
     C                     ADD  1         D5BOX
     C                     ITER
     C                     END
     C* KEY BREAK
     C           A8TMCD    IFNE D5OPER
     C           XXDATE    ORNE D5DATE
     C                     WRITEALFWP051
     C                     CLEARALFWP051
     C                     MOVELA8TMCD    D5OPER
     C                     MOVELA8TMCD    W@@N06
     C           W@@N06    CHAINALBPL30              93
     C           *IN93     IFEQ '0'
     C                     MOVE ALWKNM    D5NAME
     C                     ELSE
     C                     MOVE *BLANK    D5NAME
     C                     END
     C                     Z-ADDXXDATE    D5DATE
     C                     ADD  1         D5BOX
     C                     ITER
     C                     END
     C* OTHER
     C                     ADD  1         D5BOX
     C*
     C                     ENDDO
     C*
     C  N80                WRITEALFWP051
     C*
     C                     ENDSR
     C**************************************************************************
     C*                    @END
     C**************************************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
