     H            Y.
     F** ALFR40 *********************************************
     F* WIRE PULL FROM LOC - 2PT SCAN                       *
     F*   LEC .................     2018.01.25              *
     F*******************************************************
     FALFPW40 CF  E                    WORKSTN
     FIZAWP01 IF  E                    DISK
     FALFPL40 IF  E           K        DISK
     F            ALFPP401                          KRENAMEALFPL40R
     FALFPP40 O   E                    DISK
     FALFPP45 O   E                    DISK
      *
     E                    WK1        20  1
     E                    WK2        20  1
     E                    ER      1   8 60
      *
      *  wire kanban barcode
     I            DS
     I                                        1  20 WKKANB
     I                                        1   1 TYPE
     I                                        2   5 ABSID
     I                                        6  12 M#
     I                                       13  15 C#
     I                                       16  16 SPC
     I                                       17  17 CHDG1
      *
      *  ASJ wire kanban barcode
     I            DS
     I                                        1  16 WKASJ
     I                                        1   6 ORDT
     I                                        7  11 SEQ
     I                                       12  12 ATYPE
     I                                       13  16 AABSID
      *
      *  retrieval barcode  (screen2)
     I            DS
     I                                        1  40 D2BAR1
     I                                        1  20 D2QRP1
     I                                       21  40 D2QRP2
      *
      *  retrieval kanban ds
     I            DS
     I                                        1  40 RTKANB
     I                                        1   3 RTTYPE
     I                                        4  18 RTMATN
     I                                       19  232RTDIAM
     I                                       19  23 RTCHDI
     I                                       24  24 RTLOC1
     I                                       25  26 RTLOC2
     I                                       27  28 RTLOC3
     I                                       29  29 RTLOC4
     I                                       24  29 RTLOCN
     I                                       30  32 RTPAGE
      *
      *  location from izawp01
     I            DS
     I                                        1   6 SVLOCN
     I                                        1   1 SVLOC1
     I                                        2   3 SVLOC2
     I                                        4   5 SVLOC3
     I                                        6   6 SVLOC4
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60HHMMSS
     I                                        7  140WDATE
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           PITANT 10
      *
     **==============================================================**
     **  KEY
     **==============================================================**
     C           K#KEY1    KLIST
     C                     KFLD           WIREBC 20
      *----------------------------------------------------*
      * MAINLINE                                           *
      *----------------------------------------------------*
     C                     MOVEL'01'      DSPSW   2
      *
     C           DSPSW     DOUEQ'99'
      *
     C                     SELEC
     C           DSPSW     WHEQ '01'
     C                     EXSR #SB100
     C           DSPSW     WHEQ '02'
     C                     EXSR #SB200
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *----------------------------------------------------*
      * FIRST SCREEN - Display Screen for Wire Kanban      *
      *----------------------------------------------------*
     C           #SB100    BEGSR
      *
     C                     EXFMTALFPW401
     C                     SETOF                     9931
     C                     MOVE *OFF      *IN21            ON = FOUND NORM VENDR
     C                     MOVE *OFF      *IN22            ON = FOUND ASJ
     C                     TIME           WTIME
      *
     C           *IN01     IFEQ *ON
     C                     MOVEL'99'      DSPSW
     C                     MOVE *BLANKS   D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
      * remove '-' from bar code, unless it's check digit
     C                     MOVEAD1BAR1    WK1       P
     C                     MOVE *BLANK    WK2
     C                     Z-ADD*ZERO     X       20
     C                     Z-ADD*ZERO     Y       20
      *
     C           1         DO   20        X
     C           WK1,X     IFNE '-'
     C           WK1,X     ANDNE*BLANK
     C           X         ORGT 15
     C                     ADD  1         Y
     C                     MOVE WK1,X     WK2,Y
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVEAWK2       D1BAR1    P
      *
      * get absolute part id from wire kanban barcode just scanned
     C                     MOVELD1BAR1    WKKANB
     C                     MOVELD1BAR1    WKASJ
      *
     C           D1BAR1    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
      * check if wire kanban has been scanned before.
     C                     MOVELD1BAR1    WIREBC
     C           K#KEY1    CHAINALFPL40              41
     C           *IN41     IFEQ *OFF
     C                     SETON                     99
     C                     MOVELER,7      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
      *
      * get wire information from wire kanban M/F
     C                     MOVE *BLANKS   D2MATN
     C                     Z-ADD*ZERO     D2DIAM
     C                     MOVEL*BLANKS   SVLOCN
     C                     Z-ADD*ZERO     SVTKJR  50
     C                     MOVE *BLANKS   SVSMEX 15
      *
     C                     EXSR #SB150
      *
      *  if not found, display error message
     C           *IN21     IFEQ *OFF
     C           *IN22     ANDEQ*OFF
     C                     SETON                     99
     C                     MOVELER,2      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
      *
     C                     MOVEL'02'      DSPSW
      *
     C           ESB100    TAG
      *
     C           *IN99     IFEQ *ON
     C                     MOVEL*BLANKS   RTKANB
     C                     Z-ADD*ZERO     RTDIAM
     C                     EXSR LOGERR
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------------*
      * GET WIRE INFO - Get material name, wire diameter, supplier *
      *------------------------------------------------------------*
     C           #SB150    BEGSR
      *
     C           1         SETLLIZAWP01
     C                     DO   *HIVAL
      *
     C                     READ IZAWP01                  50
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           ZCKNO2    IFEQ TYPE
     C           ZCKNO3    ANDEQABSID
     C                     MOVELZCADR1    SVLOC1
     C                     MOVELZCADR2    SVLOC2
     C                     MOVELZCADR3    SVLOC3
     C                     MOVELZCADR4    SVLOC4
     C                     MOVELZCZAIS    D2MATN
     C                     Z-ADDZCZAIK    D2DIAM
     C                     Z-ADDZCTKJR    SVTKJR
     C                     MOVELB2SMEX    SVSMEX
     C                     MOVE *ON       *IN21            FOUND IT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
      * if NOT found as normal vendor's wire kanban format, check ASJ.
     C           *IN21     IFEQ *OFF
      *
     C           1         SETLLIZAWP01
     C                     DO   *HIVAL
      *
     C                     READ IZAWP01                  50
     C           *IN50     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C           ZCKNO2    IFEQ ATYPE
     C           ZCKNO3    ANDEQAABSID
     C                     MOVELZCADR1    SVLOC1
     C                     MOVELZCADR2    SVLOC2
     C                     MOVELZCADR3    SVLOC3
     C                     MOVELZCADR4    SVLOC4
     C                     MOVELZCZAIS    D2MATN
     C                     Z-ADDZCZAIK    D2DIAM
     C                     Z-ADDZCTKJR    SVTKJR
     C                     MOVELB2SMEX    SVSMEX
     C                     MOVE *ON       *IN22            FOUND IT
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------------*
      * SCREEN TWO    - Display Screen to Input Retrieval KANBAN   *
      *------------------------------------------------------------*
     C           #SB200    BEGSR
      *
     C                     EXFMTALFPW402
     C                     SETOF                     9931
      *
     C           *IN01     IFEQ *ON
     C                     MOVEL'01'      DSPSW
     C                     MOVEL*BLANK    D2BAR1
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
     C                     MOVELD2BAR1    RTKANB
     C           RTCHDI    IFEQ *BLANKS
     C                     Z-ADD*ZERO     RTDIAM
     C                     ENDIF
      *
      * if Retrieval Kanban barcode is Blank, display error and start over.
     C           D2BAR1    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,3      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * if Retrieval Kanban type is not correct, display error and start over.
     C           RTTYPE    IFNE 'B01'
     C                     SETON                     99
     C                     MOVELER,8      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * check if material is a match.
     C           RTMATN    IFNE D2MATN
     C                     SETON                     99
     C                     MOVELER,4      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * check if wire diameter is a match.
     C           RTDIAM    IFNE D2DIAM
     C                     SETON                     99
     C                     MOVELER,5      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * check if forwarding location is a match.
     C           RTLOCN    IFNE SVLOCN
     C                     SETON                     99
     C                     MOVELER,6      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANKS   D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * passed all checks, and it's ok so write to results file.
     C                     EXSR #SB500
      *
      * display ok screen...
     C                     EXFMTALFPW095
      *
     C                     MOVE *BLANK    D1BAR1
     C                     MOVE *BLANK    D2QRP1
     C                     MOVE *BLANK    D2QRP2
     C                     MOVEL'01'      DSPSW
      *
     C           ESB200    TAG
      *
     C           *IN99     IFEQ *ON
     C                     EXSR LOGERR
     C                     ENDIF
      *
     C                     ENDSR
      *
      *-----------------------------------------------------------------------*
      * ALFPP40 - Write Record to Wire Pull from Location Scan Results        *
      *-----------------------------------------------------------------------*
     C           #SB500    BEGSR
      *
      * write to ALFPP40
     C                     TIME           WTIME
     C                     CLEARALFPP401
     C                     Z-ADDWDATE     WPKODT
     C                     Z-ADDHHMMSS    WPKOTM
     C                     MOVELW#WSID    WPWSID
     C                     MOVELPITANT    WPUSER
     C                     MOVELW#JBNO    WPJOBN
     C                     MOVELW#PGM     WPKOPG
     C                     MOVELPOPR      WPWKCD
     C                     Z-ADDWDATE     WPCODT
     C                     Z-ADDHHMMSS    WPCOTM
      *
      * wire kanban
     C                     MOVELD1BAR1    WPWBAR
     C           *IN21     IFEQ *ON                        normal vendor's wire
     C                     MOVELTYPE      WPTYPE
     C                     MOVELABSID     WPZETI
     C                     MOVELM#        WPM#
     C                     MOVELC#        WPC#
     C                     MOVELSPC       WPSPC
     C                     MOVELCHDG1     WPCHKD
     C                     ENDIF
      *
     C           *IN22     IFEQ *ON                        ASJ WIRE
     C                     MOVELATYPE     WPTYPE
     C                     MOVELAABSID    WPZETI
     C                     MOVELORDT      WPORDT
     C                     MOVELSEQ       WPSEQ
     C                     ENDIF
      *
      * retrieval kanban
     C                     MOVELD2BAR1    WPRBAR
     C                     MOVELRTMATN    WPMATN
     C                     Z-ADDRTDIAM    WPDIAM
     C                     MOVELRTLOC1    WPLOC1
     C                     MOVELRTLOC2    WPLOC2
     C                     MOVELRTLOC3    WPLOC3
     C                     MOVELRTLOC4    WPLOC4
      *
      * izawp01
     C                     MOVELSVSMEX    WPSMEX
     C                     Z-ADDSVTKJR    WPTKJR
      *
     C                     WRITEALFPP401
      *
      * write to wire inventory file...
     C                     EXSR #SB550
      *
     C                     MOVEL*BLANKS   WKKANB
     C                     MOVEL*BLANKS   RTKANB
     C                     Z-ADD*ZERO     RTDIAM
     C                     MOVEL*BLANKS   SVLOCN
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * Call Program to Update Wire Inventory file         *
      *----------------------------------------------------*
     C           #SB550    BEGSR
      *
     C                     MOVELW#PGM     IZPGM  10
     C                     CALL 'IZAR70U'
     C                     PARM           WIREBC
     C                     PARM           RTLOCN
     C                     PARM           POPR
     C                     PARM           IZPGM
     C                     PARM           ##LOTN  8
     C                     PARM           ##CHRG  7
     C                     PARM           ##WEIG  51
     C                     PARM 'N'       CHGQ    1
     C                     PARM 0         NEWQ    21
     C                     PARM           RTNCD   1
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * ERROR SCREEN - Display Error on Screen             *
      *----------------------------------------------------*
     C           #SB290    BEGSR
      *
     C                     WRITEALFPW098
     C                     EXFMTALFPW099
      *
     C                     ENDSR
      *----------------------------------------------------*
      * ALFPP45 - Write Record to Wire Pull Error Log      *
      *----------------------------------------------------*
     C           LOGERR    BEGSR
      *
      * write to ALFPP45
     C                     TIME           WTIME
     C                     CLEARALFPP451
     C                     MOVELW#WSID    WEWSID
     C                     MOVELPITANT    WEUSER
     C                     MOVELW#JBNO    WEJOBN
     C                     MOVELW#PGM     WEKOPG
     C                     MOVELPOPR      WEWKCD
     C                     Z-ADDWDATE     WECODT
     C                     Z-ADDHHMMSS    WECOTM
      *
      * wire kanban
     C                     MOVELWKKANB    WEWBAR
     C           *IN21     IFEQ *ON
     C                     MOVELTYPE      WETYPE
     C                     MOVELABSID     WEZETI
     C                     ENDIF
      *
     C           *IN22     IFEQ *ON
     C                     MOVELATYPE     WETYPE
     C                     MOVELAABSID    WEZETI
     C                     ENDIF
      *
      * retrieval kanban
     C                     MOVELRTKANB    WERBAR
     C                     MOVELRTMATN    WEMATN
     C                     Z-ADDRTDIAM    WEDIAM
     C                     MOVELRTLOC1    WELOC1
     C                     MOVELRTLOC2    WELOC2
     C                     MOVELRTLOC3    WELOC3
     C                     MOVELRTLOC4    WELOC4
      *
      * error
     C                     MOVE 'F'       WEFORI
     C                     MOVELDSPSW     WEERSC
     C                     MOVELD9ERR     WEEMSG
      *
     C                     WRITEALFPP451
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
** ER(60A).........2.........3.........4.........5.........6
 INPUT WIRE KANBAN                                             01
 ABSOLUTE ID N/FND                                             02
 RETRIEVAL QR CODE                                             03
 MATERIAL NO MATCH                                             04
 DIAMETER NO MATCH                                             05
 LOCATION NO MATCH                                             06
 ALREADY SCANNED                                               07
 WRONG KANBAN                                                  08
