     H            Y.                                    1
     H***ALHR05*****************************************************************
     H*  LOQ INPROCESS MANUAL ENTRY                                            *
     H*
     H* TCHK  03/27/12 CREATE(COPY FROM ALGR05)
     H**************************************************************************
     FALHPW05 CF  E                    WORKSTN
      *
     FALBPL30 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FADHTL05 IF  E           K        DISK
     FAAHTL06 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
      *
     FALHPL02 UF  E           K        DISK                      A
     FALHPP11 UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  20 60
     E                    LOT         4  8
      **************************************************************************
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  120WSSYM
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I*
     I            DS
     I                                        1   60W@YYMM
     I                                        1   40W@YYYY
     I                                        5   60W@MMMM
     I*
     I            DS
     I                                        1  25 W@LOT
     I                                        1   7 W@LOT1
     I                                        8   8 W@LOT2
     I                                        9  25 W@OTHR
     I            DS
     I                                        1  32 LOT
     I                                        1   8 F2LOT1
     I                                        9  16 F2LOT2
     I                                       17  24 F2LOT3
     I                                       25  32 F2LOT4
     I            DS
     I                                        1  20 W@A020
     I                                        1   1 W@D001
     I                                        2   4 W@ONDO
     I                                        5   5 W@D002
     I                                        6   7 W@HOJI
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
      *
      * FOR KANBAN CHECK DEGIT
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
      *
     C                     TIME           WSDT
     C*
     C                     CLEARFMT100
     C                     CLEARFMT200
     C*
     C                     MOVEL'10'      @@ID    2
     C                     SETOF                     474849
     C                     MOVEL*BLANK    MSG
     C*
     C                     ENDSR
     C*************************************************************************
     C*     1ST SCREEN
     C**************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT100
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #F2SET
     C                     MOVE '20'      @@ID
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C*************************************************************************
     C*     1ST SCREEN CHECK
     C**************************************************************************
     C           #CHK10    BEGSR
     C*
     C                     SETOF                     515756
     C                     SETOF                     545558
     C                     SETOF                     49
     C                     MOVEL*OFF      W@POS   1
     C                     MOVEL*BLANK    W@KKND  1
     C*
     C                     DO
     C* TM-CODE CHECK
     C           F1USRC    CHAINALBPL301             90
     C           *IN90     IFEQ *OFF
     C           ALSKJY    ANDEQ*BLANK
     C                     MOVELALWKNM    F2USNM
     C                     ELSE
     C                     SETON                     5149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     END
     C                     END
     C* FUNCTION CHECK
     C           F1FUNC    IFEQ '1'
     C           F1FUNC    OREQ '2'
     C           F1FUNC    OREQ '3'
     C                     ELSE
     C                     SETON                     5449
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
     C                     END
     C                     END
     C* OQ# CHECK
     C           F1OQNO    IFEQ '11'
     C           F1OQNO    OREQ '12'
     C           F1OQNO    OREQ '13'
     C           F1OQNO    OREQ '14'
     C           F1OQNO    OREQ '21'
     C           F1OQNO    OREQ '31'
     C                     ELSE
     C                     SETON                     5749
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     END
     C                     END
     C* CHARGE# CHECK
     C           F1FUNC    IFEQ '2'
     C           F1CHG#    IFEQ *ZERO
     C                     SETON                     5749
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,13    MSG
     C                     END
     C                     END
     C                     END
     C* TREATMENT SEQ#
     C           F1FUNC    IFEQ '1'
     C           F1FUNC    OREQ '3'
     C           K#L02A    KLIST
     C                     KFLD           F1OQNO
     C                     KFLD           F1TSQY
     C                     KFLD           F1TSQM
     C                     KFLD           F1TSQ#
     C           K#L02A    CHAINALHPL02              98
     C           *IN98     IFEQ *ON
     C                     SETON                     5549
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,5     MSG
     C                     END
     C                     ELSE
     C           A1SKJY    IFNE *BLANK
     C                     SETON                     5549
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,6     MSG
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     C           *IN49     IFEQ *ON
     C           F1FUNC    ORNE '2'
     C                     LEAVE
     C                     END
     C* PART#
     C           F1PAR1    IFEQ *BLANK
     C           F1PAR2    OREQ *BLANK
     C                     SETON                     5649
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,7     MSG
     C                     END
     C                     LEAVE
     C                     END
     C*
     C           K#AAHA    KLIST
     C                     KFLD           F1PAR1
     C                     KFLD           F1PAR2
     C                     KFLD           F1PAR3
     C           K#AAHA    SETGTAAHTL06
     C                     DO   *HIVAL
     C           K#AAHA    REDPEAAHTL06                  98
     C           *IN98     IFEQ *ON
     C                     LEAVE
     C                     END
     C           L6SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           L6STYY    IFNE 9999
     C                     ITER
     C                     END
     C           K#AAHA    CHAINFCEPL01              96
     C   96                ITER
     C                     MOVEL'A'       W@KKND
     C                     LEAVE
     C                     ENDDO
     C*
     C           W@KKND    IFEQ *BLANK
     C           K#ADHA    KLIST
     C                     KFLD           F1PAR1
     C                     KFLD           F1PAR2
     C                     KFLD           F1PAR3
     C           K#ADHA    SETGTADHTL05
     C                     DO   *HIVAL
     C           K#ADHA    REDPEADHTL05                  98
     C           *IN98     IFEQ *ON
     C                     MOVEL*ON       W@POS
     C                     LEAVE
     C                     END
     C           J6SKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C           J6STYY    IFNE 9999
     C                     ITER
     C                     END
     C           K#ADHA    CHAINFCEPL01              96
     C   96                ITER
     C                     MOVEL'P'       W@KKND
     C                     LEAVE
     C                     ENDDO
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN SET
     C**************************************************************************
     C           #F2SET    BEGSR
     C*
     C                     MOVEL*BLANK    F2LOT1
     C                     MOVEL*BLANK    F2LOT2
     C                     MOVEL*BLANK    F2LOT3
     C                     MOVEL*BLANK    F2LOT4
     C                     MOVEL*BLANK    F2SHFT
     C*
     C           F1FUNC    IFEQ '1'
     C           F1FUNC    OREQ '3'
     C                     MOVELA1SHN1    F1PAR1
     C                     MOVELA1SHN2    F1PAR2
     C                     MOVELA1SHN3    F1PAR3
     C                     MOVELA1SHFT    F2SHFT
     C                     MOVELA1ZANM    F2ZANM
     C                     Z-ADDA1HOJI    F2HOJI
     C                     Z-ADDA1ONDO    F2ONDO
     C                     Z-ADD*ZERO     W@CNT1  10
     C           K#L02A    SETLLALHPP11
     C                     DO   *HIVAL
     C           K#L02A    READEALHPP11                  97
     C   97                LEAVE
     C           ABSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C                     ADD  1         W@CNT1
     C                     SELEC
     C           W@CNT1    WHEQ 1
     C                     MOVELABLOT0    F2LOT1
     C           W@CNT1    WHEQ 2
     C                     MOVELABLOT0    F2LOT2
     C           W@CNT1    WHEQ 3
     C                     MOVELABLOT0    F2LOT3
     C           W@CNT1    WHEQ 4
     C                     MOVELABLOT0    F2LOT4
     C                     ENDSL
     C                     ENDDO
     C                     MOVELA1MSG     F2MSG
     C                     END
     C*
     C           F1FUNC    IFEQ '2'
     C           W@POS     IFEQ *OFF
     C                     MOVELA2ZANM    F2ZANM
     C           W@KKND    IFEQ 'P'
     C                     Z-ADDJ6HOJI    F2HOJI
     C                     Z-ADDJ6ONDO    F2ONDO
     C                     END
     C           W@KKND    IFEQ 'A'
     C                     EXSR @GET@
     C           W@A020    IFNE *BLANK
     C                     MOVELW@HOJI    F2HOJI
     C                     MOVELW@ONDO    F2ONDO
     C                     END
     C                     END
     C                     MOVEL*BLANK    F2MSG
     C                     ELSE
     C                     MOVEL*BLANK    F2ZANM
     C                     Z-ADD*ZERO     F2HOJI
     C                     Z-ADD*ZERO     F2ONDO
     C                     MOVEL*BLANK    F2MSG
     C                     END
     C                     END
     C*
     C                     ENDSR
     C* ****************************************************
     C           @GET@     BEGSR
      *
     C                     MOVEL*BLANK    W@A020
     C                     MOVEL*BLANK    W@A002  2
     C                     MOVELL6JOK1    W@A001  1
     C           W@A001    IFEQ '#'
     C                     MOVELL6JOK1    W@A002
     C                     END
     C           W@A002    IFEQ *BLANK
     C                     MOVELL6JOK2    W@A001
     C           W@A001    IFEQ '#'
     C                     MOVELL6JOK2    W@A002
     C                     END
     C                     END
     C           W@A002    IFEQ *BLANK
     C                     MOVELL6JOK3    W@A001
     C           W@A001    IFEQ '#'
     C                     MOVELL6JOK3    W@A002
     C                     END
     C                     END
     C*
     C           W@A002    IFNE *BLANK
     C           W@A002    CHAINAAAPL01              94
     C           *IN94     IFEQ *OFF
     C           A5SKJY    ANDEQ*BLANK
     C                     MOVELA5JOKM    W@A020
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN
     C**************************************************************************
     C           #FMT20    BEGSR
     C*
     C                     SETON                     4748
     C                     WRITEFMT099
     C           F1FUNC    IFEQ '1'
     C                     MOVEL*ON       *IN67
     C                     MOVEL*OFF      *IN66
     C                     MOVEL*OFF      *IN68
     C                     END
     C           F1FUNC    IFEQ '2'
     C                     MOVEL*OFF      *IN67
     C                     MOVEL*OFF      *IN68
     C                     MOVEL*ON       *IN66
     C                     END
     C           F1FUNC    IFEQ '3'
     C                     MOVEL*OFF      *IN66
     C                     MOVEL*ON       *IN67
     C                     MOVEL*ON       *IN68
     C                     END
     C           W@POS     IFEQ *ON
     C                     MOVEL*OFF      *IN72
     C                     ELSE
     C                     MOVEL*ON       *IN72
     C                     END
     C                     EXFMTFMT200
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
     C*
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C           *INKL     WHEQ *ON
     C                     MOVEL*BLANK    F1FUNC
     C                     MOVEL*BLANK    F1OQNO
     C                     Z-ADD*ZERO     F1CHG#
     C                     Z-ADD*ZERO     F1TSQY
     C                     Z-ADD*ZERO     F1TSQM
     C                     Z-ADD*ZERO     F1TSQ#
     C                     MOVEL*BLANK    F1PAR1
     C                     MOVEL*BLANK    F1PAR2
     C                     MOVEL*BLANK    F1PAR3
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK20
     C           *IN49     IFEQ *OFF
     C           *INKE     IFEQ *ON
     C                     EXSR #WRTOK
     C                     MOVEL'10'      @@ID
     C                     MOVEL*BLANK    F1FUNC
     C                     MOVEL*BLANK    F1OQNO
     C                     Z-ADD*ZERO     F1CHG#
     C                     Z-ADD*ZERO     F1TSQY
     C                     Z-ADD*ZERO     F1TSQM
     C                     Z-ADD*ZERO     F1TSQ#
     C                     MOVEL*BLANK    F1PAR1
     C                     MOVEL*BLANK    F1PAR2
     C                     MOVEL*BLANK    F1PAR3
     C                     END
     C                     END
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*     2ND SCREEN CHECK
     C**************************************************************************
     C           #CHK20    BEGSR
     C*
     C                     SETOF                     616263
     C                     SETOF                     646566
     C                     SETOF                     69
     C                     SETOF                     7049
     C*
     C                     DO
     C* SHIFT CODE CHECK
     C           F2SHFT    IFEQ '1'
     C           F2SHFT    OREQ '2'
     C           F2SHFT    OREQ '3'
     C                     ELSE
     C                     SETON                     6949
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C*
     C           F2LOT1    IFEQ *BLANK
     C           F2LOT2    ANDEQ*BLANK
     C           F2LOT3    ANDEQ*BLANK
     C           F2LOT4    ANDEQ*BLANK
     C                     SETON                     626364
     C                     SETON                     6549
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,9     MSG
     C                     END
     C                     END
     C* CHECK DIGIT
I0777C           #USER     IFNE 'I0777'
I0777C           #USER     ANDNE'TEST'
     C           F2LOT1    IFNE *BLANK
     C                     MOVELF2LOT1    W@LOT
     C           W@OTHR    IFEQ *BLANK
     C                     MOVEL*OFF      W@ERR1  1
     C                     EXSR #CHK21
     C           W@ERR1    IFEQ *ON
     C                     MOVEL*ON       *IN62
     C                     END
     C                     END
     C                     END
     C           F2LOT2    IFNE *BLANK
     C                     MOVELF2LOT2    W@LOT
     C           W@OTHR    IFEQ *BLANK
     C                     MOVEL*OFF      W@ERR1  1
     C                     EXSR #CHK21
     C           W@ERR1    IFEQ *ON
     C                     MOVEL*ON       *IN63
     C                     END
     C                     END
     C                     END
     C           F2LOT3    IFNE *BLANK
     C                     MOVELF2LOT3    W@LOT
     C           W@OTHR    IFEQ *BLANK
     C                     MOVEL*OFF      W@ERR1  1
     C                     EXSR #CHK21
     C           W@ERR1    IFEQ *ON
     C                     MOVEL*ON       *IN64
     C                     END
     C                     END
     C                     END
     C           F2LOT4    IFNE *BLANK
     C                     MOVELF2LOT4    W@LOT
     C           W@OTHR    IFEQ *BLANK
     C                     MOVEL*OFF      W@ERR1  1
     C                     EXSR #CHK21
     C           W@ERR1    IFEQ *ON
     C                     MOVEL*ON       *IN65
     C                     END
     C                     END
     C                     END
I0777C                     END
     C*
     C           F2LOT1    IFNE *BLANK
     C           F2LOT1    IFEQ F2LOT2
     C           F2LOT1    OREQ F2LOT3
     C           F2LOT1    OREQ F2LOT4
     C                     SETON                     6249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,12    MSG
     C                     END
     C                     END
     C                     END
     C           F2LOT2    IFNE *BLANK
     C           F2LOT2    IFEQ F2LOT1
     C           F2LOT2    OREQ F2LOT3
     C           F2LOT2    OREQ F2LOT4
     C                     SETON                     6349
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,12    MSG
     C                     END
     C                     END
     C                     END
     C           F2LOT3    IFNE *BLANK
     C           F2LOT3    IFEQ F2LOT1
     C           F2LOT3    OREQ F2LOT2
     C           F2LOT3    OREQ F2LOT4
     C                     SETON                     6449
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,12    MSG
     C                     END
     C                     END
     C                     END
     C           F2LOT4    IFNE *BLANK
     C           F2LOT4    IFEQ F2LOT1
     C           F2LOT4    OREQ F2LOT2
     C           F2LOT4    OREQ F2LOT3
     C                     SETON                     6549
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,12    MSG
     C                     END
     C                     END
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*     2ND SCREEN CHECK SUB1
     C**************************************************************************
     C           #CHK21    BEGSR
     C*
     C                     MOVELW@LOT1    PMAREA    P
     C                     MOVE '007'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C           PMRTCD    IFNE *BLANK
     C                     SETON                     49
     C                     MOVEL*ON       W@ERR1
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,10    MSG
     C                     END
     C                     END
     C           PMCHK     IFNE W@LOT2
     C                     SETON                     49
     C                     MOVEL*ON       W@ERR1
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,11    MSG
     C                     END
     C                     END
     C*
     C                     ENDSR
     C**************************************************************************
     C*       WRITE A OK RECORD
     C**************************************************************************
     C           #WRTOK    BEGSR
     C*
     C                     SELEC
     C           F1FUNC    WHEQ '1'
     C                     EXSR #WRT10
     C           F1FUNC    WHEQ '2'
     C                     EXSR #WRT20
     C           F1FUNC    WHEQ '3'
     C                     EXSR #WRT30
     C                     ENDSL
     C*
     C                     ENDSR
     C**************************************************************************
     C*       UPDATE OK RECORD
     C**************************************************************************
     C           #WRT10    BEGSR
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A1KOYY
     C                     Z-ADDWSSMMM    A1KOMM
     C                     Z-ADDWSSDDD    A1KODD
     C                     Z-ADDWSSTM6    A1KOTM
     C                     MOVELF1USRC    A1TMLT
     C                     MOVEL#USER     A1USER
     C                     MOVEL#WSID     A1WSID
     C                     MOVEL#PGM      A1PGID
     C           #PGM      IFEQ *BLANK
     C                     MOVEL'ALHR05'  A1PGID
     C                     END
     C*
     C                     MOVELF2MSG     A1MSG
     C*
     C                     UPDATALHPP011
     C*
     C                     ENDSR
     C**************************************************************************
     C*       WRITE OK RECORD
     C**************************************************************************
     C           #WRT20    BEGSR
     C*
     C                     CLEARALHPP011
     C                     CLEARALHPP111
     C*
     C                     TIME           WSDT
     C                     Z-ADDWSSYYY    A1KOYY
     C                     Z-ADDWSSMMM    A1KOMM
     C                     Z-ADDWSSDDD    A1KODD
     C                     Z-ADDWSSTM6    A1KOTM
     C                     Z-ADDWSSYYY    A1SCYY
     C                     Z-ADDWSSMMM    A1SCMM
     C                     Z-ADDWSSDDD    A1SCDD
     C                     Z-ADDWSSTM6    A1SCTM
     C                     MOVELF1USRC    A1TMLT
     C                     MOVEL#USER     A1USER
     C                     MOVEL#WSID     A1WSID
     C                     MOVEL#PGM      A1PGID
     C           #PGM      IFEQ *BLANK
     C                     MOVEL'ALHR05'  A1PGID
     C                     END
     C*
     C           K#PCT1    KLIST
     C                     KFLD           K@WD1   8
     C                     KFLD           K@WD2   8
     C                     MOVEL'ALHR011 'K@WD1     P
     C                     MOVEL*BLANK    K@WD2     P
     C           K#PCT1    CHAINAB#PPCT              97
     C           *IN97     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVEL'ALHR011 'CTKEY1
     C                     MOVEL*BLANK    CTKEY2
     C                     Z-ADDWSSYM     CTNBR1
     C                     END
     C           WSSYM     IFNE CTNBR1
     C                     Z-ADDWSSYM     CTNBR1
     C                     Z-ADD*ZERO     CTNBR2
     C                     END
     C                     Z-ADDCTNBR1    W@YYMM
     C                     Z-ADDW@YYYY    A1TSQY
     C                     Z-ADDW@MMMM    A1TSQM
     C                     ADD  1         CTNBR2
     C                     Z-ADDCTNBR2    A1TSQ#
     C   97                WRITEAB#PPCT1
     C  N97                UPDATAB#PPCT1
     C*
     C                     MOVELF1USRC    A1TMCD
     C                     MOVELF2SHFT    A1SHFT
     C*
     C           W@POS     IFEQ *OFF
     C                     MOVELA2ZAIC    A1ZACD
     C                     END
     C                     MOVELF1PAR1    A1SHN1
     C                     MOVELF1PAR2    A1SHN2
     C                     MOVELF1PAR3    A1SHN3
     C                     MOVELF2ZANM    A1ZANM
     C                     Z-ADDF2HOJI    A1HOJI
     C                     Z-ADDF2ONDO    A1ONDO
     C*
     C                     MOVELF1OQNO    A1OQNO
     C                     Z-ADDF1CHG#    A1CHG#
     C                     MOVELF2MSG     A1MSG
     C*
     C                     WRITEALHPP011
     C*
     C                     Z-ADD*ZERO     Y       20
     C                     DO   *HIVAL
     C*
     C                     ADD  1         Y
     C           Y         IFGT 4
     C                     LEAVE
     C                     END
     C           LOT,Y     IFEQ *BLANK
     C                     ITER
     C                     END
     C*
     C                     CLEARALHPP111
     C*
     C                     Z-ADDA1KOYY    ABKOYY
     C                     Z-ADDA1KOMM    ABKOMM
     C                     Z-ADDA1KODD    ABKODD
     C                     Z-ADDA1KOTM    ABKOTM
     C                     MOVELA1USER    ABUSER
     C                     MOVELA1WSID    ABWSID
     C                     MOVELA1PGID    ABPGID
     C*
     C                     MOVELA1OQNO    ABOQNO
     C                     Z-ADDA1TSQY    ABTSQY
     C                     Z-ADDA1TSQM    ABTSQM
     C                     Z-ADDA1TSQ#    ABTSQ#
     C                     Z-ADDA1SCYY    ABSCYY
     C                     Z-ADDA1SCMM    ABSCMM
     C                     Z-ADDA1SCDD    ABSCDD
     C                     Z-ADDA1SCTM    ABSCTM
     C*
     C                     MOVELLOT,Y     ABLOT0
     C                     MOVELLOT,Y     W@LOT
     C                     MOVELW@LOT1    ABLOT1
     C                     MOVELW@LOT2    ABLOT2
     C*
     C                     WRITEALHPP111
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
     C*       UPDATE DELETE RECORD
     C**************************************************************************
     C           #WRT30    BEGSR
     C*
     C                     TIME           WSDT
     C                     MOVEL'D'       A1SKJY
     C                     Z-ADDWSSYYY    A1SKYY
     C                     Z-ADDWSSMMM    A1SKMM
     C                     Z-ADDWSSDDD    A1SKDD
     C                     Z-ADDWSSTM6    A1SKTM
     C                     MOVELF1USRC    A1TMLT
     C                     MOVEL#USER     A1USER
     C                     MOVEL#WSID     A1WSID
     C                     MOVEL#PGM      A1PGID
     C           #PGM      IFEQ *BLANK
     C                     MOVEL'ALHR05'  A1PGID
     C                     END
     C*
     C                     MOVELF2MSG     A1MSG
     C                     UPDATALHPP011
     C*
     C           K#L02A    SETLLALHPP11
     C*
     C                     DO   *HIVAL
     C*
     C           K#L02A    READEALHPP11                  97
     C   97                LEAVE
     C           ABSKJY    IFNE *BLANK
     C                     ITER
     C                     END
     C*
     C                     MOVEL'D'       ABSKJY
     C                     Z-ADDWSSYYY    ABSKYY
     C                     Z-ADDWSSMMM    ABSKMM
     C                     Z-ADDWSSDDD    ABSKDD
     C                     MOVEL#USER     ABUSER
     C                     MOVEL#WSID     ABWSID
     C                     MOVEL#PGM      ABPGID
     C           #PGM      IFEQ *BLANK
     C                     MOVEL'ALHR05'  ABPGID
     C                     END
     C*
     C                     UPDATALHPP111
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C**************************************************************************
** ERR
USER CODE ERROR
SHIFT CODE ERROR
OQ# NO ERROR
FUUCTION ERROR
TREATMENT SEQ# ERROR
ALREADY DELETED
PART NO. ERROR
#OF CONTAINER ERROR
ONE OF LOTID REQUIRED
LOTID ERROR
LOTID CHECK DIGIT ERROR
LOTID DUPLICATE ERROR
CHARGE# ERROR







