     H            Y.
     F** ALOR28 **************************************
     F* GET APICS STATUS                             *
     F*        T.SAKAKI     2019.09.17               *
JW1  F*  JW    2020.19.18 ADD 2 PARAMETERS FOR PT    *
     F* ------------------------------               *
     F* PARAMETER
     F*  IN   P1SHN1  5    IAF PART1
     F*  "    P1SHN2  5    IAF PART2
     F*  "    P1SHN3  2    IAF PART3
     F*  OUT  P9ALD3  40   COMPLETE SHIP SCAN
     F*  "    P9ADA1  40   RE-ISSUED
     F*  "    P9NYKO  40   COMPLETE STORE IN
     F*  "    P9SRT   40   SRT(CONVEYANCE)
     F*  "    P9OUK   40   COMPLETE OUTSOURCE PROCESS
     F*  "    P9BZK   40   COMPLETE BZ WEIGH
     F*  "    P9DSK   40   COMPLETE DS WEIGH
     F*  "    P9JCK   40   COMPLETE JC WEIGH
     F*  "    P9SBK   40   COMPLETE SB WEIGH
     F*  "    P9LOQK  40   COMPLETE LOQ
     F*  "    P9OUI   40   IN PROCESS (OUTSOURCE)
     F*  "    P9BZI   40   IN PROCESS (BZ       )
     F*  "    P9DSI   40   IN PROCESS (DS       )
     F*  "    P9JCI   40   IN PROCESS (JC       )
     F*  "    P9SBI   40   IN PROCESS (SB       )
     F*  "    P9LOQI  40   IN PROCESS (LOQ      )
     F*  "    P9PLOU  40   BEFORE (OUTSOURCE)
     F*  "    P9PLBZ  40   BEFORE (BZ       )
     F*  "    P9PLDS  40   BEFORE (DS       )
     F*  "    P9PLJC  40   BEFORE (JC       )
     F*  "    P9PLSB  40   BEFORE (SB       )
     F*  "    P9PLLO  40   BEFORE (LOQ      )
     F*  "    P9PRE   40   AFTER  CV COLLECTION
     F*  "    P9CVS   40   BEFORE CV COLLECTION
     F*  "    P9LPLD  80   LAST PRELOAD DATE
     F*  "    P9LPLT  60   LAST PRELOAD TIME
     F*  "    P9ALL   40   ALL ISSUED
JW1  F*  "    P9PLPD  80   PT BF OUT DATE
"    F*  "    P9PLPS  40   PT SHIP PRELOAD
     F************************************************
     FFCEPL01 IF  E           K        DISK
     FAH#TL19 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAAIPL11 IF  E           K        DISK
     FAGAPL31 IF  E           K        DISK
     E                    DT         24  1
     E                    BI         24  2 0
     E                    OBM        15  4               部門
     E                    OKB        15  3               機番
     E                    OTK        15  6               所番地
     E                    OKO        15  3               工程
      *
     I              '0123456789'          C         WKCKSU
      *
     I            DS
     I                                        1  24 DT
     I                                       01  01 CDDT08
     I                                       02  02 CDDT09
     I                                       03  03 CDDT10
     I                                       04  04 CDDT11
     I                                       05  05 CDDT12
     I                                       06  06 CDDT13
     I                                       07  07 CDDT14
     I                                       08  08 CDDT15
     I                                       09  09 CDDT16
     I                                       10  10 CDDT17
     I                                       11  11 CDDT18
     I                                       12  12 CDDT19
     I                                       13  13 CDDT20
     I                                       14  14 CDDT21
     I                                       15  15 CDDT22
     I                                       16  16 CDDT23
     I                                       17  17 CDDT24
     I                                       18  18 CDDT01
     I                                       19  19 CDDT02
     I                                       20  20 CDDT03
     I                                       21  21 CDDT04
     I                                       22  22 CDDT05
     I                                       23  23 CDDT06
     I                                       24  24 CDDT07
      *
     I            DS
     I                                        1  480BI
     I                                       01  020CDBI08
     I                                       03  040CDBI09
     I                                       05  060CDBI10
     I                                       07  080CDBI11
     I                                       09  100CDBI12
     I                                       11  120CDBI13
     I                                       13  140CDBI14
     I                                       15  160CDBI15
     I                                       17  180CDBI16
     I                                       19  200CDBI17
     I                                       21  220CDBI18
     I                                       23  240CDBI19
     I                                       25  260CDBI20
     I                                       27  280CDBI21
     I                                       29  300CDBI22
     I                                       31  320CDBI23
     I                                       33  340CDBI24
     I                                       35  360CDBI01
     I                                       37  380CDBI02
     I                                       39  400CDBI03
     I                                       41  420CDBI04
     I                                       43  440CDBI05
     I                                       45  460CDBI06
     I                                       47  480CDBI07
      *
     I            DS
     I                                        1   80WKHZ
     I                                        1   40WKYY
     I                                        5   60WKMM
     I                                        7   80WKDD
      *
     I            DS
     I                                        1   80K1HZ
     I                                        1   40K1YY
     I                                        5   60K1MM
     I                                        7   80K1DD
      *
     I            DS
     I                                        1   80F8KA
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      *
     I            DS
     I                                        1  100WWCM
     I                                        1   80WWCMHZ
     I                                        9  100WWCMBB
      *
     I            DS
     I                                        1  100CFHT
     I                                        1   80CFHTHZ
     I                                        9  100CFHTBB
      *
     I            DS
     I                                        1   80WW10DY
     I                                        1   40WW10YY
     I                                        5   60WW10MM
     I                                        7   80WW10DD
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2SY
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      *
     I            DS
     I                                        1   6 A2KTR
     I                                        1   1 A2KTRK
     I                                        2   3 A2KTRT
     I                                        4   5 A2KTRR
     I                                        6   6 A2KTRD
      *
     I            DS
     I                                        1   6 A2STR
     I                                        1   1 A2STRK
     I                                        2   3 A2STRT
     I                                        4   5 A2STRR
     I                                        6   6 A2STRD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   40WJFF
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I            DS
     I                                        1   80BANODT
     I                                        1   40BANOYY
     I                                        5   60BANOMM
     I                                        7   80BANODD
      *
     I            DS
     I                                        1   80EKNODT
     I                                        1   40EKNOYY
     I                                        5   60EKNOMM
     I                                        7   80EKNODD
      *
     I            DS
     I                                        1   80A3SYDT
     I                                        1   40A3SYYY
     I                                        5   60A3SYMM
     I                                        7   80A3SYDD
      *
     I            DS
     I                                        1   80ADKODT
     I                                        1   40ADKOYY
     I                                        5   60ADKOMM
     I                                        7   80ADKODD
      *
     I            DS
     I                                        1   6 K@BANA
     I                                        1   1 K@BAN1
     I                                        2   3 K@BAN2
     I                                        4   5 K@BAN3
     I                                        6   6 K@BAN4
      *
     I            DS
     I                                        1   6 K#BANA
     I                                        1   1 K#BAN1
     I                                        2   3 K#BAN2
     I                                        4   5 K#BAN3
     I                                        6   6 K#BAN4
      *
     I            DS
     I                                        1  140W1DTTM
     I                                        1   80W1DATE
     I                                        9  140W1TIME
     I            DS
     I                                        1  140W2DTTM
     I                                        1   80W2DATE
     I                                        9  140W2TIME
     I            DS
     I                                        1  140W3DTTM
     I                                        1   80W3DATE
     I                                        9  140W3TIME
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
     I              '0123456789'          C         NUM
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
     C                     PARM           P9ALD3  40       COMPLETE SHIP SCAN
     C                     PARM           P9ADA1  40       RE-ISSUED
     C                     PARM           P9NYKO  40       COMPLETE STORE IN
     C                     PARM           P9SRT   40       SRT(CONVEYANCE)
     C                     PARM           P9OUK   40       COMPLETE OUTSOURCE
     C                     PARM           P9BZK   40       COMPLETE BZ WEIGH
     C                     PARM           P9DSK   40       COMPLETE DS WEIGH
     C                     PARM           P9JCK   40       COMPLETE JC WEIGH
     C                     PARM           P9SBK   40       COMPLETE SB WEIGH
     C                     PARM           P9LOQK  40       COMPLETE LOQ
     C                     PARM           P9OUI   40       IN PROCESS (OUTSOU
     C                     PARM           P9BZI   40       IN PROCESS (BZ
     C                     PARM           P9DSI   40       IN PROCESS (DS
     C                     PARM           P9JCI   40       IN PROCESS (JC
     C                     PARM           P9SBI   40       IN PROCESS (SB
     C                     PARM           P9LOQI  40       IN PROCESS (LOQ
     C                     PARM           P9PLOU  40       BEFORE (OUTSOUR
     C                     PARM           P9PLBZ  40       BEFORE (BZ
     C                     PARM           P9PLDS  40       BEFORE (DS
     C                     PARM           P9PLJC  40       BEFORE (JC
     C                     PARM           P9PLSB  40       BEFORE (SB
     C                     PARM           P9PLLO  40       BEFORE (LOQ
     C                     PARM           P9PRE   40       AFTER  CV COLLE
     C                     PARM           P9CVS   40       BEFORE CV COLLE
     C                     PARM           P9LPLD  80       LAST PRELOAD DA
     C                     PARM           P9LPLT  60       LAST PRELOAD TI
     C                     PARM           P9ALL   40       ALL ISSUED
JW1   * P/T STATUS                                         PT BF OUT DATE
"    C                     PARM           P9PLPD  80       PT SHIP PRELOAD
"    C                     PARM           P9PLPS  40       PT SHIP PRELOAD
      *
     C                     Z-ADD0         P9ALD3
     C                     Z-ADD0         P9ADA1
     C                     Z-ADD0         P9NYKO
     C                     Z-ADD0         P9SRT
     C                     Z-ADD0         P9OUK
     C                     Z-ADD0         P9BZK
     C                     Z-ADD0         P9DSK
     C                     Z-ADD0         P9JCK
     C                     Z-ADD0         P9SBK
     C                     Z-ADD0         P9LOQK
     C                     Z-ADD0         P9OUI
     C                     Z-ADD0         P9BZI
     C                     Z-ADD0         P9DSI
     C                     Z-ADD0         P9JCI
     C                     Z-ADD0         P9SBI
     C                     Z-ADD0         P9LOQI
     C                     Z-ADD0         P9PLOU
     C                     Z-ADD0         P9PLBZ
     C                     Z-ADD0         P9PLDS
     C                     Z-ADD0         P9PLJC
     C                     Z-ADD0         P9PLSB
     C                     Z-ADD0         P9PLLO
     C                     Z-ADD0         P9PRE
     C                     Z-ADD0         P9CVS
     C                     Z-ADD0         P9LPLD
     C                     Z-ADD0         P9LPLT
     C                     Z-ADD0         P9ALL
      *
     C                     MOVEL'1'       OPNCLS
     C                     Z-ADD0         WWTOHZ  80
     C                     Z-ADD0         WWZNHZ  80
     C                     Z-ADD0         WWYOHZ  80
     C                     Z-ADD0         WWCIBI  20
     C                     READ AAIPL111                 20
     C           *IN20     IFEQ '0'
     C                     Z-ADDCDTOHZ    WWTOHZ
     C                     Z-ADDCDZNHZ    WWZNHZ
     C                     Z-ADDCDYOHZ    WWYOHZ
     C                     Z-ADDCDCIBI    WWCIBI
     C                     ENDIF
      * GET PAST 10 DAYS
     C           KEYF8     KLIST
     C                     KFLD           K1YY    40
     C                     KFLD           K1MM    20
     C                     KFLD           K1DD    20
     C                     Z-ADDWWTOHZ    K1HZ
     C                     Z-ADD0         WW10DY  80
     C                     Z-ADD1         X       20
     C           KEYF8     SETGTAGDPL121
     C                     READPAGDPL121                 20
     C           *IN20     DOWEQ'0'
     C           X         ANDLE10
     C           F8HIRU    IFEQ *BLANK
     C                     Z-ADDF8KA      WW10DY
     C                     ADD  1         X
     C                     ENDIF
     C                     READPAGDPL121                 20
     C                     ENDDO
      * PICK UP COMPLETE
     C                     Z-ADD1         X
     C                     Z-ADD0         WWBIN   20
     C           X         DOWLE24
     C           DT,X      IFNE *BLANK
     C                     Z-ADDBI,X      WWBIN
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C                     Z-ADDWWTOHZ    WWCMHZ
     C           WWBIN     SUB  3         WWCMBB
     C           WWCMBB    IFLE 0
     C                     Z-ADDWWZNHZ    WWCMHZ
     C                     ADD  WWCIBI    WWCMBB
     C                     ENDIF
      *
     C           KEYFCE    KLIST
     C                     KFLD           K1SHN1  5
     C                     KFLD           K1SHN2  5
     C                     KFLD           K1SHN3  2
     C                     MOVELP1SHN1    K1SHN1
     C                     MOVELP1SHN2    K1SHN2
     C                     MOVELP1SHN3    K1SHN3
     C           KEYFCE    CHAINFCEPL011             20
     C           *IN20     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLEK1HZ
     C                     SETON                     20
     C                     ENDIF
     C           *IN20     IFEQ '0'
      **********
     C                     EXSR #SB390
      **********
     C                     ENDIF
      *
     C           OPNCLS    IFEQ '0'
     C                     MOVE '9'       OPNCLS
     C                     CALL 'AAMRSB'
      *入力パラメータ
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *--------------------------------------------------*
      * FCEPL01                                          *
      *--------------------------------------------------*
     CSR         #SB390    BEGSR
      *
     C           K#L1EB    CHAINAGAPL311             49
     C           *IN49     IFEQ '0'
      ***********
     C                     EXSR #SB400
      ***********
     C           P9ALL     SUB  P9ALD3    P9CVS
     C                     SUB  P9ADA1    P9CVS
     C                     SUB  P9NYKO    P9CVS
     C                     SUB  P9SRT     P9CVS
     C                     SUB  P9OUK     P9CVS
     C                     SUB  P9BZK     P9CVS
     C                     SUB  P9DSK     P9CVS
     C                     SUB  P9JCK     P9CVS
     C                     SUB  P9SBK     P9CVS
     C                     SUB  P9LOQK    P9CVS
     C                     SUB  P9OUI     P9CVS
     C                     SUB  P9BZI     P9CVS
     C                     SUB  P9DSI     P9CVS
     C                     SUB  P9JCI     P9CVS
     C                     SUB  P9SBI     P9CVS
     C                     SUB  P9LOQI    P9CVS
     C                     SUB  P9PLOU    P9CVS
     C                     SUB  P9PLBZ    P9CVS
     C                     SUB  P9PLDS    P9CVS
     C                     SUB  P9PLJC    P9CVS
     C                     SUB  P9PLSB    P9CVS
     C                     SUB  P9PLLO    P9CVS
     C                     SUB  P9PRE     P9CVS
      *
     C                     Z-ADDW3DATE    P9LPLD
     C                     Z-ADDW3TIME    P9LPLT
      * PT
JW1  C                     Z-ADD@@PLPD    P9PLPD
"    C                     Z-ADD@@PLPS    P9PLPS
      *
     C                     ENDIF
      *
     CSR         ESB390    ENDSR
      *--------------------------------------------------*
      * AH#PP11                                          *
      *--------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           K#L1EA    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           K1YY    40
     C                     KFLD           K1MM    20
     C                     KFLD           K1DD    20
     C                     Z-ADDWWTOHZ    K1HZ
     C           K#L1EB    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
      *
     C                     MOVEA*BLANK    OBM
     C                     MOVEA*BLANK    OKB
     C                     MOVEA*BLANK    OTK
     C                     MOVEA*BLANK    OKO
     C                     CALL 'AAMRSB'
      *入力パラメータ
     C                     PARM           A2BHB1  5
     C                     PARM           A2BHB2  5
     C                     PARM           A2BHB3  2
     C                     PARM           OPNCLS  1
      *出力パラメータ
     C                     PARM           PBMN   60
     C                     PARM           PKBN   45
     C                     PARM           PTKR   90
     C                     PARM           PSHR   15
     C                     PARM           PKOT   45
     C                     PARM           PHBN  180
     C                     PARM           STATUS  1
     C                     MOVEL'0'       OPNCLS
     C                     MOVEAPBMN      OBM
     C                     MOVEAPKBN      OKB
     C                     MOVEAPTKR      OTK
     C                     MOVEAPKOT      OKO
      *
     C           KEYCF1    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C                     KFLD           WW10YY
     C                     KFLD           WW10MM
     C                     KFLD           WW10DD
     C           KEYCF2    KLIST
     C                     KFLD           A2BHB1
     C                     KFLD           A2BHB2
     C                     KFLD           A2BHB3
     C**
     C                     Z-ADD0         P9ALL
     C                     Z-ADD0         W3DTTM
JW1  C                     Z-ADD0         @@PLPD  80
"    C                     Z-ADD0         @@PLPS  40
     C**
     C           KEYCF1    SETLLAH#TL191
     C           KEYCF2    READEAH#TL191                 21
     C           *IN21     DOWEQ'0'
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLEK1HZ
     C                     ELSE
      * CHECK SCANNED RESULT
     C                     EXSR #SB410
     C                     ADD  CFMAIS    P9ALL
JW1   * CHECK PT SCANNED RESULT
"    C                     EXSR #SB420
"    C                     Z-ADDPHPLPD    @@PLPD
"    C                     ADD  PHPLPS    @@PLPS
      *
     C                     ENDIF
     C           KEYCF2    READEAH#TL191                 21
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *--------------------------------------------------*
      * GET CONDITION OF EACH LOT NO                     *
      *--------------------------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     MOVE CFCHYU    PHCHYU
     C                     MOVE CFZENO    PHZENO
     C                     MOVE CFHIN1    PHSHN1
     C                     MOVE CFHIN2    PHSHN2
     C                     MOVE CFHIN3    PHSHN3
     C                     MOVE CFTHNO    PHTHNO
     C                     MOVE CFHTHZ    PHHTHZ
     C                     Z-ADD0         @@MAIS  40
     C                     Z-ADD0         @@ALD3  40
     C                     Z-ADD0         @@ADA1  40
     C                     Z-ADD0         @@NYKO  40
     C                     Z-ADD0         @@SRT   40
     C                     Z-ADD0         @@OUK   40
     C                     Z-ADD0         @@BZK   40
     C                     Z-ADD0         @@DSK   40
     C                     Z-ADD0         @@JCK   40
     C                     Z-ADD0         @@SBK   40
     C                     Z-ADD0         @@LOQK  40
     C                     Z-ADD0         @@OUI   40
     C                     Z-ADD0         @@BZI   40
     C                     Z-ADD0         @@DSI   40
     C                     Z-ADD0         @@JCI   40
     C                     Z-ADD0         @@SBI   40
     C                     Z-ADD0         @@LOQI  40
     C                     Z-ADD0         @@PLOU  40
     C                     Z-ADD0         @@PLBZ  40
     C                     Z-ADD0         @@PLDS  40
     C                     Z-ADD0         @@PLJC  40
     C                     Z-ADD0         @@PLSB  40
     C                     Z-ADD0         @@PLLO  40
     C                     Z-ADD0         @@PRE   40
     C** BZ/DS
     C                     MOVEL'0'       PHBFLG  1
     C                     MOVEL*BLANK    KB1     1
     C**  CHECK DS PROCESS
     C                     Z-ADD1         A       20
     C           'DS '     LOKUPOKO,A                    29
     C           *IN29     IFEQ '1'
     C                     MOVELOKB,A     KB1
     C           KB1       IFEQ 'G'                        DS1
     C           KB1       OREQ 'H'                        DS2
     C           KB1       OREQ 'J'                        DS3
     C           KB1       OREQ 'K'                        DS4
     C                     MOVEL'1'       PHBFLG  1
     C                     ENDIF
     C                     ENDIF
     C** JC
     C                     MOVEL'0'       PHAFLG  1
     C                     Z-ADD1         A       20
     C           'JC3'     LOKUPOKB,A                    29
     C           *IN29     IFEQ '1'
     C                     MOVEL'1'       PHAFLG  1
     C                     ENDIF
     C                     Z-ADD1         A       20
     C           'JC4'     LOKUPOKB,A                    29
     C           *IN29     IFEQ '1'
     C                     MOVEL'1'       PHAFLG  1
     C                     ENDIF
      ** SB
     C                     MOVEL'0'       PHSBFL  1
     C                     Z-ADD1         A       20
     C           'SB '     LOKUPOKO,A                    29
     C           *IN29     IFEQ '1'
     C                     MOVEL'1'       PHSBFL  1
     C                     ENDIF
      *
     C                     Z-ADD0         W1DTTM
     C                     Z-ADD0         W2DTTM
      *
     C                     Z-ADD1         LL      40
      *---START---
     C           LL        DOWLECFMAIS
     C                     MOVE LL        PHPAGE
     C                     Z-ADD0         PHALD3
     C                     Z-ADD0         PHADA1
     C                     CALL 'ALDRS4'
     C                     PARM           PHCHYU  1
     C                     PARM           PHZENO  4
     C                     PARM           PHSHN1  5
     C                     PARM           PHSHN2  5
     C                     PARM           PHSHN3  2
     C                     PARM           PHTHNO  3
     C                     PARM           PHPAGE  2
     C                     PARM           PHHTHZ  8
     C                     PARM           PHBFLG  1         BZ MACHINE
     C                     PARM           PHAFLG  1         JC MACHINE
     C                     PARM           PHSBFL  1         SB工程有無
     C                     PARM           PHMAIS  4
     C                     PARM           PHALD3  40       出荷照合済み
     C                     PARM           PHADA1  40       再手配
     C                     PARM           PHNYKO  40       入庫済み
     C                     PARM           PHSRT   40        SORTING
     C                     PARM           PHOUK   40        OUTSOURCE処理後
     C                     PARM           PHBZK   40        BZ計量済み
     C                     PARM           PHDSK   40        DS計量済み
     C                     PARM           PHJCK   40        JC計量済み
     C                     PARM           PHSBK   40        SB計量済み
     C                     PARM           PHLOQK  40        LOQ排出済み
     C                     PARM           PHOUI   40        OUTSOURCE処理中
     C                     PARM           PHBZI   40        BZ投入中
     C                     PARM           PHDSI   40        DS投入中
     C                     PARM           PHJCI   40        JC投入中
     C                     PARM           PHSBI   40        SB投入中
     C                     PARM           PHLOQI  40        LOQ投入中
     C                     PARM           PHPLOU  40        OUTSOURCE出荷前
     C                     PARM           PHPLBZ  40        BZ設備前
     C                     PARM           PHPLDS  40        DS設備前
     C                     PARM           PHPLJC  40        JC設備前
     C                     PARM           PHPLSB  40        SB設備前
     C                     PARM           PHPLLO  40        LOQ設備前
     C                     PARM           PHPRE   40        PRE
     C                     PARM           PHLPLD  80        LAST PRE DATE
     C                     PARM           PHLPLT  60                 TIME
     C**
     C                     MOVE PHMAIS    @#MAIS  40
     C                     ADD  @#MAIS    @@MAIS
     C**
     C                     ADD  PHALD3    @@ALD3
     C                     ADD  PHADA1    @@ADA1
     C                     ADD  PHNYKO    @@NYKO
     C                     ADD  PHSRT     @@SRT
     C           @@OUK     IFLT CFMAIS
     C                     ADD  PHOUK     @@OUK
     C                     ENDIF
     C           @@BZK     IFLT CFMAIS
     C                     ADD  PHBZK     @@BZK
     C                     ENDIF
     C           @@DSK     IFLT CFMAIS
     C                     ADD  PHDSK     @@DSK
     C                     ENDIF
     C           @@JCK     IFLT CFMAIS
     C                     ADD  PHJCK     @@JCK
     C                     ENDIF
     C           @@SBK     IFLT CFMAIS
     C                     ADD  PHSBK     @@SBK
     C                     ENDIF
     C           @@LOQK    IFLT CFMAIS
     C                     ADD  PHLOQK    @@LOQK
     C                     ENDIF
     C                     ADD  PHOUI     @@OUI
     C                     ADD  PHBZI     @@BZI
     C                     ADD  PHDSI     @@DSI
     C                     ADD  PHJCI     @@JCI
     C                     ADD  PHSBI     @@SBI
     C                     ADD  PHLOQI    @@LOQI
     C           @@PLOU    IFLT CFMAIS
     C                     ADD  PHPLOU    @@PLOU
     C                     ENDIF
     C           @@PLBZ    IFLT CFMAIS
     C                     ADD  PHPLBZ    @@PLBZ
     C                     ENDIF
     C           @@PLDS    IFLT CFMAIS
     C                     ADD  PHPLDS    @@PLDS
     C                     ENDIF
     C           @@PLJC    IFLT CFMAIS
     C                     ADD  PHPLJC    @@PLJC
     C                     ENDIF
     C           @@PLSB    IFLT CFMAIS
     C                     ADD  PHPLSB    @@PLSB
     C                     ENDIF
     C           @@PLLO    IFLT CFMAIS
     C                     ADD  PHPLLO    @@PLLO
     C                     ENDIF
     C           @@PRE     IFLT CFMAIS
     C                     ADD  PHPRE     @@PRE
     C                     ENDIF
      *
     C           PHLPLD    IFNE 0
     C                     Z-ADDPHLPLD    W1DATE
     C                     Z-ADDPHLPLT    W1TIME
     C           W1DTTM    IFGE W2DTTM
     C                     Z-ADDW1DATE    W2DATE
     C                     Z-ADDW1TIME    W2TIME
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         LL
     C                     ENDDO
      *---END---
      *
     C                     ADD  @@ALD3    P9ALD3
     C                     ADD  @@ADA1    P9ADA1
     C                     ADD  @@NYKO    P9NYKO
     C                     ADD  @@SRT     P9SRT
     C                     ADD  @@OUK     P9OUK
     C                     ADD  @@BZK     P9BZK
     C                     ADD  @@DSK     P9DSK
     C                     ADD  @@JCK     P9JCK
     C                     ADD  @@SBK     P9SBK
     C                     ADD  @@LOQK    P9LOQK
     C           @@OUK     IFGE CFMAIS
     C                     Z-ADD0         @@OUI
     C                     ENDIF
     C                     ADD  @@OUI     P9OUI
     C           @@BZK     IFGE CFMAIS
     C                     Z-ADD0         @@BZI
     C                     ENDIF
     C                     ADD  @@BZI     P9BZI
     C           @@DSK     IFGE CFMAIS
     C                     Z-ADD0         @@DSI
     C                     ENDIF
     C                     ADD  @@DSI     P9DSI
     C           @@JCK     IFGE CFMAIS
     C                     Z-ADD0         @@JCI
     C                     ENDIF
     C                     ADD  @@JCI     P9JCI
     C           @@SBK     IFGE CFMAIS
     C                     Z-ADD0         @@SBI
     C                     ENDIF
     C                     ADD  @@SBI     P9SBI
     C                     ADD  @@LOQI    P9LOQI
     C                     ADD  @@PLOU    P9PLOU
     C                     ADD  @@PLBZ    P9PLBZ
     C                     ADD  @@PLDS    P9PLDS
     C                     ADD  @@PLJC    P9PLJC
     C                     ADD  @@PLSB    P9PLSB
     C                     ADD  @@PLLO    P9PLLO
     C                     ADD  @@PRE     P9PRE
      *
     C           W2DATE    IFNE 0
     C           W2DTTM    ANDGEW3DTTM
     C                     Z-ADDW2DATE    W3DATE
     C                     Z-ADDW2TIME    W3TIME
     C                     ENDIF
      *
     CSR         ESB410    ENDSR
      *--------------------------------------------------*
JW1   * GET CONDITION OF EACH LOT NO  FOR PT             *
 |    *--------------------------------------------------*
 |   CSR         #SB420    BEGSR
 |    *
 |   C                     CALL 'ALDRS6'
 |   C                     PARM           PHCHYU  1
 |   C                     PARM           PHZENO  4
 |   C                     PARM           PHTHNO  3
 |   C                     PARM           PHPLPD  80        PT BF OUT DATE
 |   C                     PARM           PHPLPT  40        PT BF OUT TIME
 |   C                     PARM           PHPLPS  40        PT SHIP PRELOAD
 |    *
JW1  CSR         ESB420    ENDSR
