     H            Y.
     F** ALOR27 ****************************************************************
     F*  PROGRAM    : PRINT ALOR28 (PRIORITY LIST PARAMETERS)                  *
     F*  WRITTEN    : 2019.09.20                                               *
     F*  WRITTEN BY : JW (SRA)                                                 *
JW1  F*  JW     2020.09.18 ADD PARAMETERS FOR ALOR28                           *
     F**************************************************************************
     FQPRINT  O   F     198     OF     PRINTER
     E                    SEQ     1  25 12
     E                    TXT     1  25 15
     E                    VAL        25  4 0
     I            DS
     I                                        1  140SDATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************************
     C                     EXSR #INIT
      *
     C                     CALL 'ALOR28'
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
 1   C                     PARM 0         P9ALD3  40       出荷照合済み
 2   C                     PARM 0         P9ADA1  40       再手配
 3   C                     PARM 0         P9NYKO  40       入庫済み
 4   C                     PARM 0         P9SRT   40        SRT(CONVEYANCE)
 5   C                     PARM 0         P9OUK   40        OUTSOURCE処理後
 6   C                     PARM 0         P9BZK   40        BZ計量済み
 7   C                     PARM 0         P9DSK   40        DS計量済み
 8   C                     PARM 0         P9JCK   40        JC計量済み
 9   C                     PARM 0         P9SBK   40        SB計量済み
10   C                     PARM 0         P9LOQK  40        LOQ排出済み
11   C                     PARM 0         P9OUI   40        OUTSOURCE処理中
12   C                     PARM 0         P9BZI   40        BZ投入中
13   C                     PARM 0         P9DSI   40        DS投入中
14   C                     PARM 0         P9JCI   40        JC投入中
15   C                     PARM 0         P9SBI   40        SB投入中
16   C                     PARM 0         P9LOQI  40        LOQ投入中
17   C                     PARM 0         P9PLOU  40        OUTSOURCE出荷前
18   C                     PARM 0         P9PLBZ  40        BZ設備前
19   C                     PARM 0         P9PLDS  40        DS設備前
20   C                     PARM 0         P9PLJC  40        JC設備前
21   C                     PARM 0         P9PLSB  40        SB設備前
22   C                     PARM 0         P9PLLO  40        LOQ設備前
23   C                     PARM 0         P9PRE   40       ＣＶ集荷後
24   C                     PARM 0         P9CVS   40       ＣＶ集荷前
25   C                     PARM 0         P9ALL   40       発行枚数
JW1   * P/T STATUS
"    C                     PARM 0         P8PLPD  80       PT BF OUT DATE
"    C                     PARM 0         P8PLPS  40       PT SHIP PRELOAD
      *
     C                     Z-ADDP9ALD3    VAL,01
     C                     Z-ADDP9ADA1    VAL,02
     C                     Z-ADDP9NYKO    VAL,03
     C                     Z-ADDP9SRT     VAL,04
     C                     Z-ADDP9OUK     VAL,05
     C                     Z-ADDP9BZK     VAL,06
     C                     Z-ADDP9DSK     VAL,07
     C                     Z-ADDP9JCK     VAL,08
     C                     Z-ADDP9SBK     VAL,09
     C                     Z-ADDP9LOQK    VAL,10
     C                     Z-ADDP9OUI     VAL,11
     C                     Z-ADDP9BZI     VAL,12
     C                     Z-ADDP9DSI     VAL,13
     C                     Z-ADDP9JCI     VAL,14
     C                     Z-ADDP9SBI     VAL,15
     C                     Z-ADDP9LOQI    VAL,16
     C                     Z-ADDP9PLOU    VAL,17
     C                     Z-ADDP9PLBZ    VAL,18
     C                     Z-ADDP9PLDS    VAL,19
     C                     Z-ADDP9PLJC    VAL,20
     C                     Z-ADDP9PLSB    VAL,21
     C                     Z-ADDP9PLLO    VAL,22
     C                     Z-ADDP9PRE     VAL,23
     C                     Z-ADDP9CVS     VAL,24
     C                     Z-ADDP9ALL     VAL,25
      *
     C                     Z-ADDP9SRT     @@SRT   30
      *
     C                     Z-ADDP9BZK     @@AFT   30
     C                     ADD  P9JCK     @@AFT
     C                     ADD  P9DSK     @@AFT
     C                     ADD  P9SBK     @@AFT
     C                     ADD  P9OUK     @@AFT
     C                     ADD  P9LOQK    @@AFT
      *
     C                     Z-ADDP9BZI     @@IN    30
     C                     ADD  P9JCI     @@IN
     C                     ADD  P9DSI     @@IN
     C                     ADD  P9SBI     @@IN
     C                     ADD  P9OUI     @@IN
     C                     ADD  P9LOQI    @@IN
      *
     C                     Z-ADDP9PLBZ    @@BFR   30
     C                     ADD  P9PLDS    @@BFR
     C                     ADD  P9PLJC    @@BFR
     C                     ADD  P9PLSB    @@BFR
     C                     ADD  P9PLOU    @@BFR
     C                     ADD  P9PLLO    @@BFR
      *
     C                     Z-ADDP9PRE     @@CVP   30
     C**                   ADD  P9CVS     @@CVP
      *
     C           @@SRT     ADD  @@AFT     @@SUM   30
     C                     ADD  @@IN      @@SUM
     C                     ADD  @@BFR     @@SUM
     C                     ADD  @@CVP     @@SUM
      *
     C                     EXSR #PRINT
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  PRINT                                             *
      *----------------------------------------------------*
     C           #PRINT    BEGSR
      *
     C                     EXCPT@DTL
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  INITIAL SETTING                                   *
      *----------------------------------------------------*
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P1SHN1  5
     C                     PARM           P1SHN2  5
     C                     PARM           P1SHN3  2
      *
     C                     TIME           SDATE
      *
     C                     EXCPT@HDR
      *
     C                     ENDSR
      *****************************************************************
     OQPRINT  E   01           @HDR
     O                         #PGM      10
     O                                   40 '** PRINT ALOR28 PARA'
     O                                   60 'METERS **           '
     O                                   99 'DATE'
     O                         TODAY    102 '    .  .  '
     O                         NOW      112 '  :  :  '
     O                                  115 'P.'
     O                         PAGE  Z  119
     O        E 1              @DTL
     O                         P1SHN1  +000
     O                         P1SHN2  +002
     O                         P1SHN3  +002
     O                                 +017 'TOTAL:'
     O                         @@SUM 3 +001
     O                                 +003 'SORT:'
     O                         @@SRT 3 +001
     O                                 +003 'TTL_AFTER:'
     O                         @@AFT 3 +001
     O                                 +003 'TTL_IN PROC:'
     O                         @@IN  3 +001
     O                                 +003 'TTL_BEFORE:'
     O                         @@BFR 3 +001
     O                                 +003 'TTL_CV_PULL:'
     O                         @@CVP 3 +001
      *
     O        E 1              @DTL
     O                         SEQ,01  +000
     O                         TXT,01  +000
     O                         VAL,013 +002
      *
     O        E 1              @DTL
     O                         SEQ,02  +000
     O                         TXT,02  +000
     O                         VAL,023 +002
      *
     O        E 1              @DTL
     O                         SEQ,03  +000
     O                         TXT,03  +000
     O                         VAL,033 +002
      *
     O        E 1              @DTL
     O                         SEQ,04  +000
     O                         TXT,04  +000
     O                         VAL,043 +002
      *
     O        E 1              @DTL
     O                                 +001 '.'
      *
     O        E 1              @DTL
     O                         SEQ,05  +000
     O                         TXT,05  +000
     O                         VAL,053 +002
      *
     O        E 1              @DTL
     O                         SEQ,06  +000
     O                         TXT,06  +000
     O                         VAL,063 +002
      *
     O        E 1              @DTL
     O                         SEQ,07  +000
     O                         TXT,07  +000
     O                         VAL,073 +002
      *
     O        E 1              @DTL
     O                         SEQ,08  +000
     O                         TXT,08  +000
     O                         VAL,083 +002
      *
     O        E 1              @DTL
     O                         SEQ,09  +000
     O                         TXT,09  +000
     O                         VAL,093 +002
      *
     O        E 1              @DTL
     O                         SEQ,10  +000
     O                         TXT,10  +000
     O                         VAL,103 +002
      *
     O        E 1              @DTL
     O                                 +001 '.'
      *
     O        E 1              @DTL
     O                         SEQ,11  +000
     O                         TXT,11  +000
     O                         VAL,113 +002
      *
     O        E 1              @DTL
     O                         SEQ,12  +000
     O                         TXT,12  +000
     O                         VAL,123 +002
      *
     O        E 1              @DTL
     O                         SEQ,13  +000
     O                         TXT,13  +000
     O                         VAL,133 +002
      *
     O        E 1              @DTL
     O                         SEQ,14  +000
     O                         TXT,14  +000
     O                         VAL,143 +002
      *
     O        E 1              @DTL
     O                         SEQ,15  +000
     O                         TXT,15  +000
     O                         VAL,153 +002
      *
     O        E 1              @DTL
     O                         SEQ,16  +000
     O                         TXT,16  +000
     O                         VAL,163 +002
      *
     O        E 1              @DTL
     O                                 +001 '.'
      *
     O        E 1              @DTL
     O                         SEQ,17  +000
     O                         TXT,17  +000
     O                         VAL,173 +002
      *
     O        E 1              @DTL
     O                         SEQ,18  +000
     O                         TXT,18  +000
     O                         VAL,183 +002
      *
     O        E 1              @DTL
     O                         SEQ,19  +000
     O                         TXT,19  +000
     O                         VAL,193 +002
      *
     O        E 1              @DTL
     O                         SEQ,20  +000
     O                         TXT,20  +000
     O                         VAL,203 +002
      *
     O        E 1              @DTL
     O                         SEQ,21  +000
     O                         TXT,21  +000
     O                         VAL,213 +002
      *
     O        E 1              @DTL
     O                                 +001 '.'
      *
     O        E 1              @DTL
     O                         SEQ,22  +000
     O                         TXT,22  +000
     O                         VAL,223 +002
      *
     O        E 1              @DTL
     O                         SEQ,23  +000
     O                         TXT,23  +000
     O                         VAL,233 +002
      *
     O        E 1              @DTL
     O                         SEQ,24  +000
     O                         TXT,24  +000
     O                         VAL,243 +002
      *
     O        E 1              @DTL
     O                                 +001 '.'
      *
     O        E 1              @DTL
     O                         SEQ,25  +000
     O                         TXT,25  +000
     O                         VAL,253 +002
** SEQ (12A)
01 P9ALD3
02 P9ADA1
03 P9NYKO
04 P9SRT
05 P9OUK
06 P9BZK
07 P9DSK
08 P9JCK
09 P9SBK
10 P9LOQK
11 P9OUI
12 P9BZI
13 P9DSI
14 P9JCI
15 P9SBI
16 P9LOQI
17 P9PLOU
18 P9PLBZ
19 P9PLDS
20 P9PLJC
21 P9PLSB
22 P9PLLO
23 P9PRE
24 P9CVS
25 P9ALL
** TXT (15A)*
SHIPPING SCAN..     1
RE-ISSUE.......     2
STOCK IN.......     3
SRT(CONVEYANCE)     4
OUTSRC AFTER...     5
BZ  AFTER......     6
JC  AFTER......     7
DS  AFTER......     8
SB  AFTER......     9
LOQ AFTER......    10
OUTSRC IN PROC.    11
BZ  IN PROCESS.    12
JC  IN PROCESS.    13
DS  IN PROCESS.    14
SB  IN PROCESS.    15
LOQ IN PROCESS.    16
OUTSRC BEFORE..    17
BZ  BEFORE.....    18
DS  BEFORE.....    19
JC  BEFORE.....    20
SB  BEFORE.....    21
LOQ BRFORE.....    22
CV AFTER.......    23
CV BEFORE......    24
# OF ISSUED....    25
