     H            Y.                                    1
     H***ALNR20*****************************************************************
     H*  PARTS MOVER INTO/OUT SCAN RESULT INQUIRY                              *
     H*
     H* TCHK  10/10/14 CREATE
     H**************************************************************************
     FALPPW10 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                              KINFDS @INFDS
     FALPPP01 IF  E           K        DISK
     FALPPL02 IF  E           K        DISK
     F            ALPPP011                          KRENAMEALPPL2
     FALPPL03 IF  E           K        DISK
     F            ALPPP011                          KRENAMEALPPL3
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     F*ALIWP30 IF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
     I* SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
     I* SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
     I*         FROM DATE -1 DAYS
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I* SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
     I* SCANNED RESULT DATE
     I            DS
     I                                        1   80A8DATE
     I                                        1   40A8DTYY
     I                                        5   80A8DTMD
     I* SCANNED RESULT TIME
     I            DS
     I                                        1   60A8TIME
     I                                        1   20A8TIHH
     I                                        3   40A8TIMM
     I                                        5   60A8TISS
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
     I* PART#
     I            DS
     I                                        1  15 W@PART
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
     I* APICS
     I            DS
     I                                        1  15 W@KBN#
     I                                        1   1 W@KIND
     I                                        2   5 W@ZETI
     I                                        6   8 W@LOT#
     I                                        9  10 W@PAG#
     I            DS
     I                                        1  12 F1SHIN
     I                                        1   5 F1SHN1
     I                                        6  10 F1SHN2
     I                                       11  12 F1SHN3
     C**************************************************************************
     C*                    MAIN ROUTINE
     C**************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
     C**************************************************************************
     C*         INITIALIZE
     C**************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
     C*
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     MOVEL*BLANK    MSG
     C*
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN89
     C*
     C                     ENDSR
     C*************************************************************************
     C*     1ST SCREEN
     C**************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     8788
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN89
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN89     IFEQ *OFF
     C                     MOVEL*BLANK    W2LOT#  3
     C                     MOVEL*BLANK    W2PAG#  2
     C                     EXSR #SET20
     C                     END
     C           *IN89     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     END
     C                     ENDSL
      *
     C                     ENDSR
     C*************************************************************************
     C*     1ST SCREEN CHECK
     C**************************************************************************
     C           #CHK10    BEGSR
     C*
     C                     SETOF                     313233
     C                     SETOF                     3489
     C                     TIME           WSDT
     C*
     C           F1SCFH    IFEQ *ZERO
     C                     SETON                     3289
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     END
     C                     END
     C*
     C           F1SCFH    IFGT WSSDAT
     C                     SETON                     3289
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     END
     C                     END
     C                     Z-ADDF1SCFH    W1SCFH
     C*
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     END
     C*
     C           W1SCFD    IFEQ *ZERO
     C                     Z-ADD01        W1SCFD
     C                     END
     C           W1SCTD    IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           W1SCTY
     C                     KFLD           W1SCTM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    W1SCTD
     C                     ELSE
     C                     Z-ADD31        W1SCTD
     C                     END
     C                     END
     C*
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     323389
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN SET
     C**************************************************************************
     C           #SET20    BEGSR
     C*
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
     C*
     C                     MOVEL*ON       *IN43
     C                     MOVEL*OFF      *IN71
     C                     MOVEL*OFF      *IN72
     C*
     C                     DO
     C*
     C           K#AGDP    KLIST
     C                     KFLD           W1SCFY
     C                     KFLD           W1SCFM
     C                     KFLD           W1SCFD
     C           K#AGDP    SETLLAGDPL12
     C                     READPAGDPL12                  98
     C   98                LEAVE
     C*
     C           K#L02A    KLIST
     C                     KFLD           F1SHN1
     C                     KFLD           F1SHN2
     C                     KFLD           F1SHN3
     C                     KFLD           F8KAHZ
     C                     KFLD           K@TIME  60
     C           K#L03A    KLIST
     C                     KFLD           W1LOC1
     C                     KFLD           W1LOC2
     C                     KFLD           F8KAHZ
     C                     KFLD           K@TIME  60
     C                     MOVELF1LOC     W1LOC1  2
     C                     MOVE F1LOC     W1LOC2  2
     C           K#P01A    KLIST
     C                     KFLD           F8KAHZ
     C                     KFLD           K@TIME
     C                     Z-ADD230000    K@TIME
     C*
     C           F1SHIN    IFNE *BLANK
     C           K#L02A    SETLLALNPL02
     C                     ELSE
     C           F1LOC     IFNE *BLANK
     C           K#L03A    SETLLALNPL03
     C                     ELSE
     C           K#P01A    SETLLALNPP01
     C                     END
     C                     END
     C*
     C                     DO   *HIVAL
     C*
     C           K#L02B    KLIST
     C                     KFLD           F1SHN1
     C                     KFLD           F1SHN2
     C                     KFLD           F1SHN3
     C           K#L03B    KLIST
     C                     KFLD           W1LOC1
     C                     KFLD           W1LOC2
     C           F1SHIN    IFNE *BLANK
     C           K#L02B    READEALNPL02                  97
     C                     ELSE
     C           F1LOC     IFNE *BLANK
     C           K#L03B    READEALNPL03                  97
     C                     ELSE
     C                     READ ALNPP01                  97
     C                     END
     C                     END
     C   97                LEAVE
     C           A8DATE    IFEQ W1SCTH
     C           A8TIME    ANDGE230000
     C                     LEAVE
     C                     END
     C           A8DATE    IFGT W1SCTH
     C                     LEAVE
     C                     END
     C*
     C                     CLEARSFL020
     C*
     C                     Z-ADDA8DTMD    S2DATE
     C                     MOVELA8TIHH    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVELA8TIMM    W8TIMM
     C                     MOVELW8TIME    S2TIME
     C*                    MOVELA8KIND    S2KIND
     C*
     C                     MOVEL*BLANK    W@PART
     C                     MOVELA8PR11    W@PRT1
     C           A8PR12    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     END
     C                     MOVELA8PR12    W@PRT2
     C           A8PR13    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     END
     C                     MOVELA8PR13    W@PRT3
     C                     MOVELW@PART    S2HIN1
     C*
     C                     MOVELA8BRC1    S2BAR1
     C                     MOVELA8BRC2    S2BAR2
     C*
     C                     MOVELA8TMCD    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    S2TMNM
     C                     END
     C*
     C                     ADD  1         RRN2
     C                     WRITESFL020
     C*
     C           RRN2      IFEQ 9999
     C                     LEAVE
     C                     END
     C*
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313233
     C                     SETON                     89
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,4     MSG
     C                     END
     C                     END
     C*
     C           RRN2      IFEQ 9999
     C                     SETON                     313233
     C                     SETON                     89
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,5     MSG
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN
     C**************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
     C*
     C                     MOVEL*ON       *IN87
     C                     MOVEL*ON       *IN88
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
     C*
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     END
     C*
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN89
     C*
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *IN89     IFEQ *ON
     C                     ITER
     C                     END
     C                     ENDSL
     C*
     C                     ENDDO
     C*
     C                     ENDSR
     C*************************************************************************
     C*     2ND SCREEN CHECK
     C**************************************************************************
     C           #CHK20    BEGSR
     C*
     C*
     C                     ENDSR
     C**************************************************************************
** ERR
DATE IS REQUIRED.
DATE ERROR
FROM DATE > TODAY'S DATE.
NO DATA FOUND!
DATA OVER LIMIT! CHANGE SELECT CONDITION THEN TRY AGAIN.
PAGE# VALID WITH LOT#.




