     H            Y.                                    1
      ***ALRR07*****************************************************************
      *  3PT PASSTHRU RETRIEVAL HIST INQUIRY BY TM, DATE                       *
      *
      **************************************************************************
     FALRPW07 CF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FALRPL07 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FALRWP05 UF  E           K        DISK                      A
     FALRWP5D UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   2 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
      *         FROM DATE
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
     I            DS
     I                                        1   60WDTIME
     I                                        1   2 W@TIHH
     I                                        3   4 W@TIMM
     I                                        5   6 W@TISS
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  120FRTIME
     I I            00                       13  140FRSECS
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  120TOTIME
     I I            59                       13  140TOSECS
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      * PART#
     I            DS
     I                                        1  14 W@PART
     I                                        1   5 W@PRT1
     I                                        6   6 W@PRTA
     I                                        7  11 W@PRT2
     I                                       12  12 W@PRTB
     I                                       13  14 W@PRT3
      * LOCN
     I            DS
     I                                        1   9 W@LOCN
     I                                        1   1 W@LOC1
     I                                        2   2 W@BLK1
     I                                        3   4 W@LOC2
     I                                        5   5 W@BLK2
     I                                        6   7 W@LOC3
     I                                        8   8 W@BLK3
     I                                        9   9 W@LOC4
      * SEARCH PART#
     I            DS
     I                                        1  12 F1PART
     I                                        1   5 F1PRT1
     I                                        6  10 F1PRT2
     I                                       11  12 F1PRT3
     I            DS
     I                                        1  12 PTPART
     I                                        1   5 PTAHN1
     I                                        6  10 PTAHN2
     I                                       11  12 PTAHN3
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C           K#FCE     KLIST
     C                     KFLD           F1PRT1
     C                     KFLD           F1PRT2
     C                     KFLD           F1PRT3
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     333435
     C                     TIME           WSDT
      *
     C           F1SCFH    IFEQ *ZERO
     C           F1SCFH    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1SCFH    W1SCFH
      *
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDWSSDAT    W1SCTH
     C                     Z-ADDWSSDAT    F1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     ENDIF
      *
     C           W1SCFD    IFEQ *ZERO
     C                     Z-ADD01        W1SCFD
     C                     ENDIF
     C           W1SCTD    IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           W1SCTY
     C                     KFLD           W1SCTM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    W1SCTD
     C                     ELSE
     C                     Z-ADD31        W1SCTD
     C                     ENDIF
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2359      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1SCFH    IFEQ F1SCTH
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1PART    IFNE *BLANK
     C           K#FCE     CHAINFCEPL01              51
     C           *IN51     IFEQ *ON
     C                     MOVE *ON       *IN35
     C                     MOVELERR,5     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1SCFH    FRDATE
     C                     Z-ADDF1FRTM    FRTIME
     C                     Z-ADDF1SCTH    TODATE
     C                     Z-ADDF1TOTM    TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
      *
     C                     Z-ADD*ZERO     C2BCNT
      *
      * close and clear workfile before recreating.
      *
     C                     CLOSEALRWP05
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALRWP05
      *
      * close and clear detail workfile before recreating.
      *
     C                     CLOSEALRWP5D
      *
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,2     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN ALRWP5D
      *
      * start with reading and accumulating all kanbans scanned.
      *
     C           K#P07A    KLIST
     C                     KFLD           F1SCFH
      *
     C           K#P07A    SETLLALRPL07
      *
     C                     DO   *HIVAL
      *
     C                     READ ALRPL07                  97
     C   97                LEAVE
      *
     C           PTCODT    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDPTCODT    SCDATE
     C                     Z-ADDPTCOTM    SCTIME
      *
      * if scan date/time between from date/time and to date/time.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
      * if part# was in search criteria, then check for a match.
     C           F1PART    IFNE *BLANK
     C           PTPART    ANDNEF1PART
     C                     ITER
     C                     ENDIF
      *
      * if prod# was in search criteria, then check for a match.
     C           F1PROD    IFNE *BLANK
     C           PTTEHA    ANDNEF1PROD
     C                     ITER
     C                     ENDIF
      *
      * if page# was in search criteria, then check for a match.
     C           F1PAGE    IFNE *BLANK
     C           PTPAGE    ANDNEF1PAGE
     C                     ITER
     C                     ENDIF
      *
     C           PTWKCD    CHAINALRWP05              96
     C           *IN96     IFEQ *ON
     C                     CLEARALRWP051
     C                     MOVELPTWKCD    WYWKCD
     C                     MOVELPTWKCD    W@@06N  60
     C           W@@06N    CHAINALBPL30              95
     C           *IN95     IFEQ *OFF
     C                     MOVELALWKNM    WYWKNM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         WY#BOX
      *
     C  N96                UPDATALRWP051
     C   96                WRITEALRWP051
      *
      *
      *  write to detail workfile too.
      *
     C                     CLEARALRWP5D1
     C                     MOVELPTWKCD    WDWKCD
     C                     MOVELWYWKNM    WDWKNM
     C                     MOVELPTCODT    WDDATE
     C                     MOVELPTCOTM    WDTIME
      *
     C                     MOVEL*BLANK    W@PART
     C                     MOVELPTAHN1    W@PRT1
     C           PTAHN2    IFNE *BLANK
     C                     MOVEL'-'       W@PRTA
     C                     ENDIF
     C                     MOVELPTAHN2    W@PRT2
     C           PTAHN3    IFNE *BLANK
     C                     MOVEL'-'       W@PRTB
     C                     ENDIF
     C                     MOVELPTAHN3    W@PRT3
     C                     MOVELW@PART    WDPART
      *
     C                     MOVELPTAZET    WDZETI
     C                     MOVELPTTEHA    WDTEHA
     C                     MOVELPTPAGE    WDPAGE
      *
     C                     MOVELPTTBN1    WDTBN1
     C                     MOVELPTTBN2    WDTBN2
     C                     MOVELPTTBN3    WDTBN3
     C                     MOVELPTTBN4    WDTBN4
      *
     C                     MOVELPTODER    WDORDR
     C                     MOVELPTLOTN    WDLOTN
      *
     C                     WRITEALRWP5D1
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      *
      * now read workfile and write to subfile to be displayed.
      *
     C           *LOVAL    SETLLALRWP05
      *
     C                     DO   *HIVAL
      *
     C                     READ ALRWP05                  94
     C   94                LEAVE
      *
     C                     CLEARSFL020
     C                     MOVELWYWKNM    S2TMNM
     C                     Z-ADDWY#BOX    S2BCNT
     C                     MOVELWYWKCD    H2TMCD
      *
     C                     ADD  WY#BOX    C2BCNT
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
      *
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C                     EXSR #FMT30
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELS2TMNM    C3TMNM
     C                     Z-ADDS2BCNT    C3BCNT
      *
     C                     MOVELH2TMCD    WKCD    6
     C           K#WD2A    KLIST
     C                     KFLD           WKCD
      *
     C           K#WD2A    SETLLALRWP5D
      *
     C                     DO   *HIVAL
      *
     C           K#WD2A    READEALRWP5D                  97
     C   97                LEAVE
      *
     C                     CLEARSFL030
     C                     Z-ADDWDDATE    S3DATE
      *
     C                     MOVELW@TIHH    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE W@TIMM    W8TIMM
     C                     MOVELW8TIME    S3TIME
      *
     C                     MOVELWDPART    S3HIN1
     C                     MOVELWDZETI    S3ZETI
      *
     C                     MOVELWDORDR    S3ORDR
     C                     MOVELWDLOTN    S3LOTN
      *
     C                     MOVELWDTBN1    W@LOC1
     C                     MOVELWDTBN2    W@LOC2
     C                     MOVELWDTBN3    W@LOC3
     C                     MOVELWDTBN4    W@LOC4
     C                     MOVELW@LOCN    S3LOCN
      *
     C                     MOVELWDTEHA    S3TEHA
     C                     MOVELWDPAGE    S3PAGE
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD3    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR
INVALID PART#





** CMD
CLRPFM QTEMP/ALRWP05
CLRPFM QTEMP/ALRWP5D
