     H            Y.
     F** ALRR01 *********************************************
     F* 3 POINT RETRIEVAL SCAN                              *
     F*   LEC .................     2016.02.09              *
     F*******************************************************
     FALRPW01 CF  E                    WORKSTN
     FFCETL11 IF  E           K        DISK
      *                  prefix(A2)    part information master file (logical)
     FALRPP01 O   E                    DISK
      *                  prefix(AR)    retrieval scan results file
      *
     E                    ER      1   7 60
      *
     I            DS
     I                                        1  14 D2SHN
     I                                        1   5 D2SHN1
     I                                        6   6 D2SF1
     I                                        7  11 D2SHN2
     I                                       12  12 D2SF2
     I                                       13  14 D2SHN3
      *
      *
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
      *
     I            DS
     I                                        1   80A2TRHZ
     I                                        1   40A2TRYY
     I                                        5   60A2TRMM
     I                                        7   80A2TRDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60HHMMSS
     I                                        7  140WDATE
     I                                        7  100WYY
     I                                       11  120WMM
     I                                       13  140WDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           PITANT 10
      *
      *----------------------------------------------------*
      * MAINLINE                                           *
      *----------------------------------------------------*
     C                     MOVEL'01'      DSPSW   2
      *
     C           DSPSW     DOUEQ'99'
      *
     C                     SELEC
     C           DSPSW     WHEQ '01'
     C                     EXSR #SB100
     C           DSPSW     WHEQ '02'
     C                     EXSR #SB200
     C           DSPSW     WHEQ '03'
     C                     EXSR #SB300
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *----------------------------------------------------*
      * FIRST SCREEN - Display Screen for Retrieval Kanban *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     EXFMTALRPW011
     C                     SETOF                     9931
      *
      *
     C           *IN01     IFEQ *ON
     C                     MOVEL'99'      DSPSW
     C                     MOVE *BLANKS   D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
     C           D1BAR1    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,6      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
      * CHECK DIGIT - if check digit is not correct, display
      * error screen.
     C                     MOVELD1BAR1    PMAREA
     C                     MOVEL'014'     PMBYTE
     C           1         SUBSTD1BAR1:15 WKCHK   1
     C                     EXSR GETCDG
     C           WKCHK     IFNE PMCHK
     C                     SETON                     99
     C                     MOVELER,2      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
     C                     MOVEL*BLANK    W1SHN1  5
     C                     MOVEL*BLANK    W1SHN2  5
     C                     MOVEL*BLANK    W1SHN3  2
     C                     MOVEL*BLANK    W1TBN1  1
     C                     MOVEL*BLANK    W1TBN2  2
     C                     MOVEL*BLANK    W1TBN3  2
     C                     MOVEL*BLANK    W1TBN4  1
     C                     MOVEL*BLANK    W1ZETI  4
     C                     MOVEL*BLANK    D1ZETI  4
      * get item absolute (zeti)
     C           4         SUBSTD1BAR1:2  D1ZETI
      *
      * get part information from PART INFORMATION M/F
     C           D1ZETI    CHAINFCETL111             21
     C           *IN21     IFEQ *OFF
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     21
     C                     ENDIF
      *
     C           *IN21     IFEQ *OFF
     C                     MOVELA2BHB1    W1SHN1
     C                     MOVELA2BHB2    W1SHN2
     C                     MOVELA2BHB3    W1SHN3
      *
     C                     TIME           WTIME
      *
     C           A2TRHZ    IFGT WDATE
      * old location code
     C                     MOVELA2KTRK    W1TBN1  1
     C                     MOVELA2KTRT    W1TBN2  2
     C                     MOVELA2KTRR    W1TBN3  2
     C                     MOVELA2KTRD    W1TBN4  1
     C                     ELSE
      * else new location code
     C                     MOVELA2STRK    W1TBN1  1
     C                     MOVELA2STRT    W1TBN2  2
     C                     MOVELA2STRR    W1TBN3  2
     C                     MOVELA2STRD    W1TBN4  1
     C                     ENDIF
      *
     C                     ELSE
     C                     SETON                     99
     C                     MOVELER,3      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D1BAR1
     C                     GOTO ESB100
     C                     ENDIF
      *
     C                     MOVEL*BLANK    D2SHN
     C                     MOVELW1SHN1    D2SHN1
     C                     MOVEL'-'       D2SF1
     C                     MOVELW1SHN2    D2SHN2
     C           W1SHN3    IFNE *BLANK
     C                     MOVEL'-'       D2SF2
     C                     MOVELW1SHN3    D2SHN3
     C                     ENDIF
     C                     MOVEL'02'      DSPSW
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * SECOND SCREEN - Display Screen for Location Tag    *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C                     EXFMTALRPW012
     C                     SETOF                     9931
      *
      *
     C           *IN01     IFEQ *ON
     C                     MOVEL'01'      DSPSW
     C                     MOVEL*BLANKS   D2BAR1
     C                     MOVEL*BLANKS   D1BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
     C           D2BAR1    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
      * CHECK DIGIT - if check digit is not correct, display
      * error screen.
     C                     MOVELD2BAR1    PMAREA
     C                     MOVEL'007'     PMBYTE
     C           1         SUBSTD2BAR1:8  WKCHK   1
     C                     EXSR GETCDG
     C           WKCHK     IFNE PMCHK
     C                     SETON                     99
     C                     MOVELER,2      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D2BAR1
     C                     GOTO ESB200
     C                     ENDIF
      *
     C                     MOVEL*BLANK    W2SHN1  5
     C                     MOVEL*BLANK    W2SHN2  5
     C                     MOVEL*BLANK    W2SHN3  2
     C                     MOVEL*BLANK    W2TBN1  1
     C                     MOVEL*BLANK    W2TBN2  2
     C                     MOVEL*BLANK    W2TBN3  2
     C                     MOVEL*BLANK    W2TBN4  1
      *
     C                     MOVEL*BLANK    D2ZETI  4
     C           4         SUBSTD2BAR1:1  D2ZETI
      *
      * check to make sure it's a match.
     C           D2ZETI    IFNE D1ZETI
     C                     SETON                     99
     C                     MOVELER,5      D9ERR
     C                     EXSR #SB290
     C                     EXSR #SB291
     C                     MOVEL'NG'      WKOKNG  2
     C                     MOVE '05'      ERRCOD  2
     C                     MOVEL*BLANK    D2BAR1
     C                     EXSR #SB500
     C                     GOTO ESB200
     C                     ENDIF
      *
      * get part information from PART INFORMATION M/F
      *
     C           D2ZETI    CHAINFCETL111             21
     C           *IN21     IFEQ *OFF
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     21
     C                     ENDIF
      *
     C           *IN21     IFEQ *OFF
     C                     MOVELA2BHB1    W2SHN1
     C                     MOVELA2BHB2    W2SHN2
     C                     MOVELA2BHB3    W2SHN3
      *
     C           A2TRHZ    IFGT WDATE
      * old location code
     C                     MOVELA2KTRK    W2TBN1  1
     C                     MOVELA2KTRT    W2TBN2  2
     C                     MOVELA2KTRR    W2TBN3  2
     C                     MOVELA2KTRD    W2TBN4  1
     C                     ELSE
      * else new location code
     C                     MOVELA2STRK    W2TBN1  1
     C                     MOVELA2STRT    W2TBN2  2
     C                     MOVELA2STRR    W2TBN3  2
     C                     MOVELA2STRD    W2TBN4  1
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     MOVEL*BLANK    D2SHN
     C                     MOVELW2SHN1    D2SHN1
     C                     MOVEL'-'       D2SF1
     C                     MOVELW2SHN2    D2SHN2
     C           W2SHN3    IFNE *BLANK
     C                     MOVEL'-'       D2SF2
     C                     MOVELW2SHN3    D2SHN3
     C                     ENDIF
     C                     MOVEL'03'      DSPSW
      *
     CSR         ESB200    ENDSR
      *------------------------------------------------------*
      * SCREEN THREE  - Display Screen to Input APICS KANBAN *
      *------------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     EXFMTALRPW013
     C                     SETOF                     9931
      *
     C           *IN01     IFEQ *ON
     C                     MOVEL'02'      DSPSW
     C                     MOVEL*BLANK    D3BAR1
     C                     MOVEL*BLANK    D2BAR1
     C                     GOTO ESB300
     C                     ENDIF
      *
      * if APICS KANBAN is blank, display error and start over.
     C           D3BAR1    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELER,4      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D3BAR1
     C                     GOTO ESB300
     C                     ENDIF
      *
      * CHECK DIGIT - call program to get check digit and compare
      *  to make sure it's correct.
      *
      *  if kanban barcode starts with an "I" then it's a Pass Thru
      *   kanban, so it will be 16 chars instead of 14 like the apics kanban
      *
     C           1         SUBSTD3BAR1:1  BCID
     C           BCID      IFEQ 'I'
     C                     MOVELD3BAR1    PMAREA
     C                     MOVEL'016'     PMBYTE
     C           1         SUBSTD3BAR1:17 WKCHK   1
     C                     ELSE
     C                     MOVELD3BAR1    PMAREA
     C                     MOVEL'014'     PMBYTE
     C           1         SUBSTD3BAR1:15 WKCHK
     C                     ENDIF
      *
     C                     EXSR GETCDG
      *
      * if check digits don't match, display error, go back to screen3.
     C           WKCHK     IFNE PMCHK
     C                     SETON                     99
     C                     MOVELER,2      D9ERR
     C                     EXSR #SB290
     C                     MOVEL*BLANK    D3BAR1
     C                     GOTO ESB300
     C                     ENDIF
      *
     C                     MOVEL*BLANK    W3SHN1  5
     C                     MOVEL*BLANK    W3SHN2  5
     C                     MOVEL*BLANK    W3SHN3  2
     C                     MOVEL*BLANK    W3ABN1  1
     C                     MOVEL*BLANK    W3ABN2  2
     C                     MOVEL*BLANK    W3ABN3  2
     C                     MOVEL*BLANK    W3ABN4  1
     C                     MOVEL*BLANK    D3ZETI  4
      *
      * get part information from PART INFORMATION M/F
      *
     C           4         SUBSTD3BAR1:2  D3ZETI
     C           D3ZETI    CHAINFCETL111             21
      *
     C           *IN21     IFEQ *OFF
     C           A2GSKD    ANDEQ'D'
     C           A2GSHZ    ANDLE*DATE
     C                     SETON                     21
     C                     ENDIF
      *
      * part number found and not marked for delete.
     C           *IN21     IFEQ *OFF
     C                     MOVELA2BHB1    W3SHN1
     C                     MOVELA2BHB2    W3SHN2
     C                     MOVELA2BHB3    W3SHN3
      *
     C           A2TRHZ    IFGT WDATE
      * old location code
     C                     MOVELA2KTRK    W3ABN1  1
     C                     MOVELA2KTRT    W3ABN2  2
     C                     MOVELA2KTRR    W3ABN3  2
     C                     MOVELA2KTRD    W3ABN4  1
     C                     ELSE
      * else new location code
     C                     MOVELA2STRK    W3ABN1  1
     C                     MOVELA2STRT    W3ABN2  2
     C                     MOVELA2STRR    W3ABN3  2
     C                     MOVELA2STRD    W3ABN4  1
     C                     ENDIF
      *
     C                     ENDIF
      *
      *
      * check to make sure it's a match.
     C           D3ZETI    IFEQ D1ZETI
     C                     MOVEL'OK'      WKOKNG  2
     C                     MOVE *BLANKS   ERRCOD
     C                     EXSR #SB500
      * display ok screen...
     C                     EXFMTALRPW095
     C                     ELSE
     C                     MOVEL'NG'      WKOKNG  2
     C                     MOVE '07'      ERRCOD
     C                     EXSR #SB500
     C                     MOVEL*BLANK    D3BAR1
     C                     SETON                     99
     C                     MOVELER,7      D9ERR
     C                     EXSR #SB290
     C                     GOTO ESB300
     C                     ENDIF
      *
     C                     MOVEL*BLANK    D1BAR1
     C                     MOVEL*BLANK    D2BAR1
     C                     MOVEL*BLANK    D3BAR1
     C                     MOVEL'01'      DSPSW
      *
     CSR         ESB300    ENDSR
      *
      *-----------------------------------------------------------------------*
      * ALRPP01 - Write Record to Retrieval Scan File                         *
      *  If APICS KANBAN, Update Id/Lot/Page                                  *
      *  Else, PT KANBAN, Update Id/Order#/Lot#                               *
      *-----------------------------------------------------------------------*
     C           #SB500    BEGSR
      *
      * write to ALRPP01
     C                     TIME           WTIME
     C                     CLEARALRPP011
     C                     Z-ADDWDATE     ARKODT
     C                     Z-ADDHHMMSS    ARKOTM
     C                     MOVELW#WSID    ARWSID
     C                     MOVELPITANT    ARUSER
     C                     MOVELW#JBNO    ARJOBN
     C                     MOVELW#PGM     ARKOPG
     C                     MOVELPOPR      ARWKCD
     C                     Z-ADDWDATE     ARCODT
     C                     Z-ADDHHMMSS    ARCOTM
      *
     C                     MOVELD1BAR1    ARRBAR
     C                     MOVELW1SHN1    ARRHN1
     C                     MOVELW1SHN2    ARRHN2
     C                     MOVELW1SHN3    ARRHN3
     C                     MOVELD1ZETI    ARRZET
     C           3         SUBSTD1BAR1:6  ARRTEH
     C           2         SUBSTD1BAR1:9  ARRPAG
     C                     MOVELW1TBN1    ARRBN1
     C                     MOVELW1TBN2    ARRBN2
     C                     MOVELW1TBN3    ARRBN3
     C                     MOVELW1TBN4    ARRBN4
      *
     C                     MOVELD2BAR1    ARLBAR
     C                     MOVELW2SHN1    ARLHN1
     C                     MOVELW2SHN2    ARLHN2
     C                     MOVELW2SHN3    ARLHN3
     C                     MOVELW2TBN1    ARTBN1
     C                     MOVELW2TBN2    ARTBN2
     C                     MOVELW2TBN3    ARTBN3
     C                     MOVELW2TBN4    ARTBN4
      *
     C                     MOVELD3BAR1    ARABAR
     C                     MOVELD3ZETI    ARAZET
     C                     MOVELW3SHN1    ARAHN1
     C                     MOVELW3SHN2    ARAHN2
     C                     MOVELW3SHN3    ARAHN3
     C                     MOVELW3ABN1    ARABN1
     C                     MOVELW3ABN2    ARABN2
     C                     MOVELW3ABN3    ARABN3
     C                     MOVELW3ABN4    ARABN4
      *
      * PASS THRU kanban barcodes start with an I...
      * if barcode is a pass thru kanban, then blank out
      * apics product and page numbers.
     C           1         SUBSTD3BAR1:1  BCID    1
     C           BCID      IFEQ 'I'
     C                     MOVE *BLANKS   ARTEHA
     C                     MOVE *BLANKS   ARPAGE
     C           6         SUBSTD3BAR1:6  ARPTOR
     C           4         SUBSTD3BAR1:13 ARPTLT
     C                     ELSE
     C           3         SUBSTD3BAR1:6  ARTEHA
     C           2         SUBSTD3BAR1:9  ARPAGE
     C                     MOVE *BLANKS   ARPTOR
     C                     MOVE *BLANKS   ARPTLT
     C                     ENDIF
      *
     C                     MOVELWKOKNG    AROKNG
     C                     MOVELERRCOD    ARERCD
     C                     WRITEALRPP011
     C                     CLEARALRPP011
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * Call Program to Get Check Digit                    *
      *----------------------------------------------------*
     C           GETCDG    BEGSR
      *
     C                     CALL 'ALBRCC'
     C                     PARM           PMAREA100        INPUT DATA
     C                     PARM           PMBYTE  3        LENGTH
     C                     PARM           PMCHK   1        CHECKS DIGITS
     C                     PARM           PMRTCD  1        RETRN CODE
      *
     C                     ENDSR
      *
      *----------------------------------------------------*
      * ERROR SCREEN - Display Error on Screen             *
      *----------------------------------------------------*
     C           #SB290    BEGSR
      *
     C                     WRITEALRPW098
     C                     EXFMTALRPW099
      *
     C                     ENDSR
      *----------------------------------------------------*
      * BLANK OUT - Fields for Screen 3.                   *
      *----------------------------------------------------*
     C           #SB291    BEGSR
      *
     C                     MOVEL*BLANK    W3SHN1
     C                     MOVEL*BLANK    W3SHN2
     C                     MOVEL*BLANK    W3SHN3
     C                     MOVEL*BLANK    W3ABN1
     C                     MOVEL*BLANK    W3ABN2
     C                     MOVEL*BLANK    W3ABN3
     C                     MOVEL*BLANK    W3ABN4
     C                     MOVEL*BLANK    D3ZETI
     C                     MOVEL*BLANK    D3BAR1
      *
     C                     ENDSR
      *----------------------------------------------------*
**
INPUT LOCATION BARCODE.
CHECK DIGIT ERROR.
PARTS MASTER ERROR.
INPUT APICS/PT KANBAN.
INVALID LOCATION.
INPUT RETRIEVAL KANBAN.
WRONG KANBAN.
