     H            Y.
     F** ALTR00 *********************************************
     F* NON-CONFORMANCE SHEET MENU
     F*    LEC.             2022.09.19
     F*******************************************************
     FALTPW00 CF  E                    WORKSTN
     FALBPL30 IF  E           K        DISK
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 10
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD0         D1SEL
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*BLANK    WPGM    6
     C                     MOVEL*BLANK    P2PGM  10
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           P1        PLIST
     C                     PARM           WORKER
     C                     PARM           PUSR20
     C                     PARM           A#OR#B
     C                     PARM           HTPROC
     C                     PARM           SEL
      *
     C                     MOVE WORKER    WKCD60  60       SET WORKER ID
      *
     C                     SETOF                     98
     C           WKCD60    SETGTALBPL301
     C                     DO   *HIVAL
     C           WKCD60    REDPEALBPL301                 98
     C   98                LEAVE
     C           ALSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     MOVELALWKNM    PUSR20 20
     C                     ENDDO
      *
     C                     SELEC
      * OQ
     C           D1SEL     WHEQ 1
     C                     MOVEL'OQ '     HTPROC  8 P
      * LOQ
     C           D1SEL     WHEQ 2
     C           D1SEL     OREQ 3
     C                     MOVEL'LOQ'     HTPROC    P
      * LAN/AOQ
     C           D1SEL     WHEQ 4
     C                     MOVEL'LA '     HTPROC    P
      * SB/KRO
     C           D1SEL     WHEQ 5
     C                     MOVEL'SBK'     HTPROC    P
     C                     OTHER
     C                     SETON                     3199
     C                     MOVELER,1      MSG
     C                     EXSR #SB999
     C                     Z-ADD*ZERO     D1SEL
     C                     GOTO ESB210
     C                     ENDSL
      *
      * ask After or Before process...
     C                     MOVE *BLANK    A#OR#B  1
     C                     CALL 'ALTR01'
     C                     PARM           A#OR#B
      *
     C                     Z-ADDD1SEL     SEL     10
     C           A#OR#B    IFNE *BLANK
     C                     CALL 'ALTR10'  P1
     C                     ENDIF
      *
     C                     Z-ADD0         D1SEL
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * ERR                                                *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
      *
     C                     MOVELMSG       P1ERR
     C                     CALL 'AM#R08'
     C                     PARM           P1ERR  25
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
      *
     CSR         ESB999    ENDSR
**
INPUT NO. ERR




