     H            Y.                                    1
     H***ALTR10*****************************************************************
     H*  NON-CONFORMANCE SHEET PRINT
     H*
     H* LEC   09/21/2022   CREATE
     H**************************************************************************
     FALTPW10 CF  E                    WORKSTN
     FALGPL04 IF  E           K        DISK
     FALGPL13 IF  E           K        DISK
     FALGPP31 IF  E           K        DISK
     FALTPP10 O   E                    DISK                      A
     FALGPR30 O   E                    PRINTER                        UC
      *
      **************************************************************************
     E                    ERR     1  10 60
     E                    CMD     1   2 80
     E                    OVR        80  1
      **************************************************************************
     I           SDS
     I                                     *PROGRAM #WPGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     I            DS
     I                                        1  140WSDATE
     I                                        1   40HHMM
     I                                        1   60HHMMSS
     I                                        7  140YMD
      *
     I            DS
     I                                        1  14 SHIN
     I                                        1   5 SHN1
     I                                        6   6 DASH1
     I                                        7  11 SHN2
     I                                       12  12 DASH2
     I                                       13  14 SHN3
      *
     I            DS
     I                                        1 256 BARCDS
     I                                       34  38 F1SHN1
     I                                       39  43 F1SHN2
     I                                       44  45 F1SHN3
     I                                       34  45 F1SHIN
     I                                       46  48 F1PROC
     I                                       63  74 F1PSHN
     I                                       85  870F1CONT
     I                                      104 1071F1CWGT
     I                                      126 128 F1FURN
     I                                      175 177 F1PRC1
     I                                      178 180 F1MCH1
     I                                      181 183 F1PRC2
     I                                      184 186 F1MCH2
     I                                      187 189 F1PRC3
     I                                      190 192 F1MCH3
     I                                      193 195 F1PRC4
     I                                      196 198 F1MCH4
     I                                      199 201 F1PRC5
     I                                      202 204 F1MCH5
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C           @@ID      CASEQ'30'      #FMT30
     C           @@ID      CASEQ'40'      #FMT40
     C           @@ID      CASEQ'50'      #FMT50
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           USER20 20
     C                     PARM           AORB    1
     C                     PARM           HTPROC  8
     C                     PARM           ##SEL#  10
      *
     C           P#BRC     PLIST
     C                     PARM           PMAREA100
     C                     PARM           PMBYTE  3
     C                     PARM           PMCHK   1
     C                     PARM           PMRTCD  1
      *
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
      *
     C                     SELEC
     C           ##SEL#    WHEQ 1
     C                     MOVEL'   OQ   'SVPROC  8
     C           ##SEL#    WHEQ 2
     C           ##SEL#    OREQ 3
     C                     MOVEL'  LOQ   'SVPROC
     C           ##SEL#    WHEQ 4
     C                     MOVEL'LAN'     HTPRC1  3
     C                     MOVEL'AOQ'     HTPRC2  3
     C                     MOVEL' LAN/AOQ'SVPROC
     C           ##SEL#    WHEQ 5
     C                     MOVEL'SB '     HTPRC1
     C                     MOVEL'KRO'     HTPRC2
     C                     MOVEL' SB/KRO 'SVPROC
     C                     ENDSL
      *
     C                     CLEARFMT100
     C                     CLEARFMT200
     C                     CLEARFMT300
      *
     C                     MOVEL'10'      @@ID    2
     C                     SETOF                     99
     C                     MOVEL*BLANK    MSG
      *
     C                     ENDSR
      *************************************************************************
      *     FIRST SCREEN
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     MOVELSVPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
     C                     EXFMTFMT100
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN99     IFEQ *OFF
     C                     SELEC
     C           HTPROC    WHEQ 'OQ '
     C           AORB      ANDEQ'A'
     C                     MOVE '20'      @@ID
     C           HTPROC    WHEQ 'LOQ'
     C           AORB      ANDEQ'A'
     C                     MOVE '20'      @@ID
     C                     OTHER
     C                     MOVE '30'      @@ID
     C                     ENDSL
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     FIRST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     99
      *
     C                     DO
      *
     C                     MOVELF1BARC    BARCDS
      *
     C           F1BARC    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELERR,1     MSG
     C                     LEAVE
     C                     ENDIF
      *
      * check heat treat process matches...
     C                     SELEC
     C           HTPROC    WHEQ 'OQ '
     C           HTPROC    OREQ 'LOQ'
     C           HTPROC    IFEQ F1PROC
      *               do nothing
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     LEAVE
     C                     ENDIF
     C                     OTHER
     C           HTPRC1    IFEQ F1PRC1
     C           HTPRC1    OREQ F1PRC2
     C           HTPRC2    OREQ F1PRC1
     C           HTPRC2    OREQ F1PRC2
      *               do nothing
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     SECOND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     MOVELSVPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
     C                     EXFMTFMT200
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     CLEARFMT100
     C                     CLEARFMT200
     C                     CLEARFMT300
     C                     MOVE '10'      @@ID
     C                     OTHER
     C                     EXSR #CHK20
     C           *IN99     IFEQ *OFF
     C                     EXSR #MOVE2
     C                     MOVE '40'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     SECOND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     SETOF                     99
      *
     C                     DO
      *
     C           F2BARC    IFEQ *BLANK
     C                     SETON                     99
     C                     MOVELERR,5     MSG
     C                     LEAVE
     C                     ENDIF
      *
      * get sample sheet data from results file for nonconformance sheet
     C           F2BARC    CHAINALGPL04              51
     C           *IN51     IFEQ *OFF
     C           A1SKJY    ANDEQ*BLANK
      *               do nothing
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,6     MSG
     C                     LEAVE
     C                     ENDIF
      *
      * check that part# from sample sheet matches ht kanban...
     C           A1SHN1    IFEQ F1SHN1
     C           A1SHN2    ANDEQF1SHN2
     C           A1SHN3    ANDEQF1SHN3
      *               do nothing
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,7     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     THIRD SCREEN
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     MOVELSVPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
     C                     EXFMTFMT300
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     CLEARFMT100
     C                     CLEARFMT200
     C                     CLEARFMT300
     C                     MOVE '10'      @@ID
     C           *INKG     WHEQ *ON
     C                     CLEARFMT300
     C                     MOVE '50'      @@ID
     C           *INKE     WHEQ *ON
     C           *IN99     IFEQ *OFF
     C                     EXSR #MOVE3
     C                     MOVE *BLANKS   F3LOT#
     C                     MOVEL'40'      @@ID
     C                     ENDIF
     C                     OTHER
     C                     EXSR #CHK30
     C           *IN99     IFEQ *OFF
      *
     C                     SELEC
     C           F3LOT1    WHEQ *BLANKS
     C                     MOVELF3LOT#    F3LOT1
     C                     MOVE *BLANKS   F3LOT#
     C           F3LOT2    WHEQ *BLANKS
     C                     MOVELF3LOT#    F3LOT2
     C                     MOVE *BLANKS   F3LOT#
     C           F3LOT3    WHEQ *BLANKS
     C                     MOVELF3LOT#    F3LOT3
     C                     MOVE *BLANKS   F3LOT#
     C                     OTHER
     C                     EXSR #MOVE3
     C                     MOVE *BLANKS   F3LOT#
     C                     MOVE '40'      @@ID
     C                     ENDSL
      *
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     THIRD SCREEN CHECK
      **************************************************************************
     C           #CHK30    BEGSR
      *
     C                     SETOF                     99
     C                     MOVE F3LOT#    F3CHKD  1
      *
     C                     DO
      *
      * check lot id...
     C           F3LOT#    IFEQ *BLANKS
     C                     SETON                     99
     C                     MOVELERR,4     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELF3LOT#    PMAREA    P
     C                     MOVE '007'     PMBYTE
     C                     MOVE *BLANK    PMCHK
     C                     MOVE *BLANK    PMRTCD
     C                     CALL 'ALBRCC'  P#BRC
     C           PMRTCD    IFNE *BLANK
     C                     SETON                     99
     C                     MOVELERR,8     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           PMCHK     IFNE F3CHKD
     C                     SETON                     99
     C                     MOVELERR,8     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C           F3LOT#    IFEQ F3LOT1
     C           F3LOT#    OREQ F3LOT2
     C           F3LOT#    OREQ F3LOT3
     C                     SETON                     99
     C                     MOVELERR,9     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *       MOVE DATA FROM OQ SCAN RESULTS FILES -->  SCREEN 4
      **************************************************************************
     C           #MOVE2    BEGSR
      *
     C                     MOVELA1RONO    F4MACH    P
     C                     Z-ADDA1TSQ#    F4TSQ#
     C                     Z-ADDA1TTLW    F4TTLW
     C                     Z-ADDA1CONT    F4CONT
      *
     C                     MOVELA1SHN1    SHN1
     C                     MOVELA1SHN2    SHN2
     C                     MOVELA1SHN3    SHN3
     C                     MOVE '-'       DASH1
     C           SHN3      IFNE *BLANK
     C                     MOVE '-'       DASH2
     C                     ELSE
     C                     MOVE *BLANK    DASH2
     C                     ENDIF
     C                     MOVELSHIN      F4SHIN
      *
      * get lot ids from results file...
     C           F2BARC    CHAINALGPL13              52
      *
     C           *IN52     DOWEQ*OFF
      *
     C                     SELEC
     C           F4LOT1    WHEQ *BLANK
     C                     MOVELABLOT1    F4LOT1
     C           F4LOT2    WHEQ *BLANK
     C                     MOVELABLOT1    F4LOT2
     C           F4LOT3    WHEQ *BLANK
     C                     MOVELABLOT1    F4LOT3
     C           F4LOT4    WHEQ *BLANK
     C                     MOVELABLOT1    F4LOT4
     C                     ENDSL
      *
     C           F2BARC    READEALGPL13                  52
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *       MOVE DATA FROM SCREEN 3 SCANS  -->  SCREEN 4
      **************************************************************************
     C           #MOVE3    BEGSR
      *
     C                     SELEC
     C           HTPROC    WHEQ 'OQ'
     C                     MOVELF1FURN    F4MACH    P
     C           HTPROC    WHEQ 'LA'
     C                     MOVELF1MCH1    F4MACH    P
     C                     ENDSL
      *
     C                     Z-ADD*ZERO     F4TSQ#
     C           F1CWGT    MULT F1CONT    F4TTLW
     C                     Z-ADDF1CONT    F4CONT
      *
     C                     MOVELF1SHN1    SHN1
     C                     MOVELF1SHN2    SHN2
     C                     MOVELF1SHN3    SHN3
     C                     MOVE '-'       DASH1
     C           SHN3      IFNE *BLANK
     C                     MOVE '-'       DASH2
     C                     ELSE
     C                     MOVE *BLANK    DASH2
     C                     ENDIF
     C                     MOVELSHIN      F4SHIN
      *
     C                     MOVEL*BLANKS   F4LOT0
     C                     MOVELF3LOT1    F4LOT1
     C                     MOVELF3LOT2    F4LOT2
     C                     MOVELF3LOT3    F4LOT3
     C                     MOVELF3LOT#    F4LOT4
      *
     C                     ENDSR
      **************************************************************************
      *     FOURTH SCREEN
      **************************************************************************
     C           #FMT40    BEGSR
      *
     C                     MOVELSVPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
     C                     EXFMTFMT400
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     CLEARFMT100
     C                     CLEARFMT200
     C                     CLEARFMT300
     C                     CLEARFMT400
     C                     MOVE '10'      @@ID
     C           *INKH     WHEQ *ON
     C                     CALL 'ALTR11'
     C                     PARM           F4CODE
     C                     EXSR #CHK40
     C                     OTHER
     C                     EXSR #CHK40
     C           *INKE     IFEQ *ON
     C           *IN99     ANDEQ*OFF
     C                     MOVE *BLANK    ##RTN   1
     C                     EXSR #GETPR
     C           ##RTN     IFEQ *BLANK
     C                     EXSR #PRINT
     C                     EXSR #WRT10
     C                     MOVE '99'      @@ID
     C                     ELSE
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     FOURTH SCREEN CHECK
      **************************************************************************
     C           #CHK40    BEGSR
      *
     C                     SETOF                     99
      *
     C                     DO
      *
      * n/c code# check...
     C           F4CODE    CHAINALGPP31              51
     C           *IN51     IFEQ *OFF
     C                     MOVELM1AREA    F4AREA
     C                     MOVELM1MESG    F4MESG
     C                     ELSE
     C                     SETON                     99
     C                     MOVELERR,3     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     FIFTH SCREEN
      **************************************************************************
     C           #FMT50    BEGSR
      *
     C                     MOVELSVPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
     C                     EXFMTFMT500
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     CLEARFMT300
     C                     CLEARFMT500
     C                     MOVE '30'      @@ID
     C                     OTHER
     C                     EXSR #CHK50
     C           *IN99     IFEQ *OFF
     C                     EXSR #MOVE5
     C                     MOVE *BLANKS   F5LOT#
     C                     MOVE '40'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     FIFTH SCREEN CHECK
      **************************************************************************
     C           #CHK50    BEGSR
      *
     C                     SETOF                     99
      *
     C                     DO
      *
      * check lot id...
     C           F5LOT#    IFEQ *BLANKS
     C                     SETON                     99
     C                     MOVELERR,4     MSG
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *       MOVE DATA FROM SCREEN 5 SCAN   -->  SCREEN 4
      **************************************************************************
     C           #MOVE5    BEGSR
      *
     C                     MOVELF1FURN    F4MACH    P
     C                     Z-ADD*ZERO     F4TSQ#
     C           F1CWGT    MULT F1CONT    F4TTLW
     C                     Z-ADDF1CONT    F4CONT
      *
     C                     MOVELF1SHN1    SHN1
     C                     MOVELF1SHN2    SHN2
     C                     MOVELF1SHN3    SHN3
     C                     MOVE '-'       DASH1
     C           SHN3      IFNE *BLANK
     C                     MOVE '-'       DASH2
     C                     ELSE
     C                     MOVE *BLANK    DASH2
     C                     ENDIF
     C                     MOVELSHIN      F4SHIN
      *
     C                     MOVELF5LOT#    F4LOT0
     C                     MOVEL*BLANKS   F4LOT2
     C                     MOVEL*BLANKS   F4LOT3
     C                     MOVEL*BLANKS   F4LOT4
      *
     C                     ENDSR
      **************************************************************************
      *       GET PRINTER AND NUMBER OF COPIES TO PRINT
      **************************************************************************
     C           #GETPR    BEGSR
      *
     C                     CALL 'ALTR05'
     C                     PARM           SVPROC
     C                     PARM           ##SEL#
     C                     PARM           ##PRTR 10
     C                     PARM           ##CPYS  10
     C                     PARM           ##EMAL 35
     C                     PARM           ##RTN   1
      *
     C                     ENDSR
      **************************************************************************
      *       PRINT DETAIL
      **************************************************************************
     C           #PRINT    BEGSR
      *
     C                     MOVEL##CPYS    CPYS    1
      *
      *  override print file...
     C                     MOVEACMD,1     OVR
     C                     MOVEACPYS      OVR,45
     C                     MOVEAOVR       P@CMD     P
     C                     Z-ADD80        P@LEN
      *
     C                     CALL 'QCMDEXC' P#CMD
      *
     C                     OPEN ALGPR30
      *
      * get user name...
     C                     CALL 'UTLR31'
     C                     PARM           #USER
     C                     PARM           P@TLNM
      *
     C                     TIME           WSDATE
      *
     C           HHMM      IFGE 1200
     C                     MOVE 'PM'      P@AMPM
     C                     ELSE
     C                     MOVE 'AM'      P@AMPM
     C                     ENDIF
      *
     C           HHMM      IFGE 1300
     C                     SUB  1200      HHMM
     C                     ENDIF
      *
     C                     Z-ADDHHMM      P@TIME
     C                     Z-ADDYMD       P@DATE
      *
     C                     MOVELF1BARC    P@QRBC
     C                     MOVELF4MACH    P@LINE
     C                     Z-ADDF4TSQ#    P@TSQ#
     C                     MOVELF4SHIN    P@SHIN
     C                     Z-ADDF4CONT    P@CONT
     C                     MOVELF4LOT1    P@LOT1
     C                     MOVELF4LOT2    P@LOT2
     C                     MOVELF4LOT3    P@LOT3
     C                     MOVELF4LOT4    P@LOT4
     C                     MOVELF4LOT0    P@LOT0
     C                     Z-ADDF4TTLW    P@TTLW
     C                     MOVELF4CODE    P@CODE
     C                     MOVELF4AREA    P@AREA
     C                     MOVELF4MESG    P@MESG
     C                     MOVEL##EMAL    P@EMAL
      *
     C                     WRITEP@LIN1
     C                     WRITEP@LIN2
     C                     WRITEP@LIN3
     C                     WRITEP@LIN4
     C           P@EMAL    IFNE *BLANKS
     C                     WRITEP@LIN5
     C                     ENDIF
      *
     C                     CLOSEALGPR30
      *
      *  delete overrides...
     C                     MOVELCMD,2     P@CMD     P
     C                     Z-ADD80        P@LEN
      *
     C                     CALL 'QCMDEXC' P#CMD
      *
     C                     ENDSR
      **************************************************************************
      *       WRITE TO HISTORY FILE
      **************************************************************************
     C           #WRT10    BEGSR
      *
     C                     TIME           WSDATE
      *
     C                     MOVELWORKER    NCCRTM
     C                     MOVEL#WPGM     NCCPGM
     C                     Z-ADDYMD       NCCRDT
     C                     Z-ADDHHMMSS    NCCRTI
      *
     C                     MOVELHTPROC    NCPROC    P
     C                     MOVELF1SHIN    NCSHIN
     C                     MOVELF4MACH    NCMCH#
     C                     Z-ADDF4TSQ#    NCTSQ#
     C                     Z-ADDF4CONT    NCCONT
     C                     Z-ADDF4TTLW    NCTTLW
     C           F4LOT0    IFNE *BLANKS
     C                     MOVELF4LOT0    NCLOT1    P
     C                     ELSE
     C                     MOVELF4LOT1    NCLOT1
     C                     ENDIF
     C                     MOVELF4LOT2    NCLOT2
     C                     MOVELF4LOT3    NCLOT3
     C                     MOVELF4LOT4    NCLOT4
     C                     MOVELF4CODE    NCCODE
      *
     C                     Z-ADD*ZERO     NCNWCT
     C                     Z-ADD*ZERO     NCNWWG
     C                     MOVELF1BARC    NCQRBC
      *
     C                     WRITEALTPP101
      *
     C                     ENDSR
      **************************************************************************
** ERR
SCAN KANBAN QR BARCODE
HEAT TREAT PROCESS DOESN'T MATCH
N/C CODE NOT FOUND
LOT ID CANNOT BE BLANK
SCAN SAMPLE SHEET BARCODE
SAMPLE SHEET NOT FOUND
PART# MISMATCH-KANBAN VS SAMPLE
LOT ID IS INVALID - CHECK DIGIT
DUPLICATE LOT ID

** CMD      .......2.........3.........4.........5.........6.........7........
OVRPRTF FILE(ALGPR30) OUTQ(SAVEOUTQ) COPIES( )
DLTOVR FILE(*ALL)
