     H            Y.                                    1
     H***ALTR05*****************************************************************
     H*  SELECT PRINTER (COPIES) OR EMAIL
     H*
     H* LEC   10/17/2022   CREATE
     H**************************************************************************
     FALTPW05 CF  E                    WORKSTN
     FALTPP00 IF  E           K        DISK
      *
      **************************************************************************
     E                    ERR     1   3 60
      **************************************************************************
     I           SDS
     I                                     *PROGRAM #WPGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
     I            DS
     I                                        1  140WSDATE
     I                                        1   40HHMM
     I                                        1   60HHMMSS
     I                                        7  140YMD
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           INPROC  8
     C                     PARM           INSEL   10
     C                     PARM           ##PRTR 10
     C                     PARM           ##CPY   10
     C                     PARM           ##EMAL 35
     C                     PARM           ##RTN   1
      *
     C           KEY00     KLIST
     C                     KFLD           #PGM
     C                     KFLD           #SEL    20
      *
     C                     CLEARFMT100
      *
     C                     MOVEL#WPGM     #PGM
     C                     Z-ADDINSEL     #SEL
     C           KEY00     CHAINALTPP00              51
     C           *IN51     IFEQ *OFF
     C                     MOVELD0PRTR    F1PRTR
     C                     MOVELD0EMAL    F1EMAL
     C                     ENDIF
      *
     C                     MOVEL'10'      @@ID    2
     C                     SETOF                     99
     C                     Z-ADD1         F1#CPY
     C                     MOVEL*BLANK    MSG
     C                     Z-ADD2         F1SEL   10
      *
     C                     ENDSR
      *************************************************************************
      *     FIRST SCREEN
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     MOVELINPROC    @@PROC
     C                     MOVEL#WPGM     #PGM
      *
     C                     EXFMTFMT100
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN99
      *
     C                     SELEC
     C           *INKC     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     MOVE '*'       ##RTN
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN99     IFEQ *OFF
     C                     SELEC
     C           F1SEL     WHEQ 1
     C                     MOVELD0PRTR    ##PRTR
     C                     Z-ADDF1#CPY    ##CPY
     C                     MOVEL*BLANKS   ##EMAL
     C           F1SEL     WHEQ 2
     C                     MOVEL*BLANKS   ##PRTR
     C                     Z-ADD1         ##CPY
     C                     MOVELD0EMAL    ##EMAL
     C                     ENDSL
     C                     MOVE '99'      @@ID
     C                     MOVE ' '       ##RTN
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     FIRST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     99
      *
     C                     DO
      *
      * check selection, print or email...
     C           F1SEL     IFEQ *ZERO
     C           F1SEL     ORGT 2
     C                     SETON                     99
     C                     MOVELERR,1     MSG
     C                     LEAVE
     C                     ENDIF
      *
      * check number of copies...
      *
     C           F1SEL     IFEQ 1
     C           F1#CPY    IFEQ *ZERO
     C           F1#CPY    ORGT 4
     C                     SETON                     99
     C                     MOVELERR,2     MSG
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
      * check email address is not blank...
     C                     Z-ADDINSEL     #SEL
     C           KEY00     CHAINALTPP00              51
     C           *IN51     IFEQ *ON
     C           D0EMAL    OREQ *BLANKS
     C                     SETON                     99
     C                     MOVELERR,3     MSG
     C                     LEAVE
     C                     ELSE
     C                     MOVELD0PRTR    F1PRTR
     C                     MOVELD0EMAL    F1EMAL
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
** ERR
INVALID SELECTION, 1 OR 2
INVALID COPIES, ONLY 1 - 4
NO EMAIL ADDRESS FOUND
