     H            Y.
     F** AM#R46O **********************************************************
     F*  GENERATE LARGE NUMERIC CHARACTER                                 *
     F*  COPY FROM AB#R4O                                                 *
     F*                                                                   *
     F******************************************************* AM#R46O *****
     I*
     C           *ENTRY    PLIST
     C                     PARM           #CHR    1
     C                     PARM           #L1     8
     C                     PARM           #L2     8
     C                     PARM           #L3     8
     C                     PARM           #L4     8
     C                     PARM           #L5     8
     C                     PARM           #L6     8
     C                     PARM           #L7     8
     C                     PARM           #L8     8
      *
     C                     CLEAR#L1
     C                     CLEAR#L2
     C                     CLEAR#L3
     C                     CLEAR#L4
     C                     CLEAR#L5
     C                     CLEAR#L6
     C                     CLEAR#L7
     C                     CLEAR#L8
      *
     C                     DO
      *
     C           #CHR      IFEQ '1'
     C                     MOVE '    @@@ '#L1
     C                     MOVE '   @@@@ '#L2
     C                     MOVE '  @@ @@ '#L3
     C                     MOVE '     @@ '#L4
     C                     MOVE '     @@ '#L5
     C                     MOVE '     @@ '#L6
     C                     MOVE '     @@ '#L7
     C                     MOVE '     @@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '2'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@    @@'#L2
     C                     MOVE '      @@'#L3
     C                     MOVE '     @@ '#L4
     C                     MOVE '   @@   '#L5
     C                     MOVE ' @@     '#L6
     C                     MOVE '@@      '#L7
     C                     MOVE '@@@@@@@@'#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '3'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@    @@'#L2
     C                     MOVE '      @@'#L3
     C                     MOVE '   @@@  '#L4
     C                     MOVE '      @@'#L5
     C                     MOVE '      @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '4'
     C                     MOVE '    @@@ '#L1
     C                     MOVE '   @@@@ '#L2
     C                     MOVE '  @@ @@ '#L3
     C                     MOVE ' @@  @@ '#L4
     C                     MOVE '@@@@@@@@'#L5
     C                     MOVE '     @@ '#L6
     C                     MOVE '     @@ '#L7
     C                     MOVE '     @@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '5'
     C                     MOVE '@@@@@@@@'#L1
     C                     MOVE '@@      '#L2
     C                     MOVE '@@      '#L3
     C                     MOVE '@@@@@@@ '#L4
     C                     MOVE '      @@'#L5
     C                     MOVE '      @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '6'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@      '#L2
     C                     MOVE '@@      '#L3
     C                     MOVE '@@@@@@@ '#L4
     C                     MOVE '@@    @@'#L5
     C                     MOVE '@@    @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '7'
     C                     MOVE '@@@@@@@@'#L1
     C                     MOVE '     @@ '#L2
     C                     MOVE '    @@  '#L3
     C                     MOVE '   @@   '#L4
     C                     MOVE '  @@    '#L5
     C                     MOVE '  @@    '#L6
     C                     MOVE '  @@    '#L7
     C                     MOVE '  @@    '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '8'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@    @@'#L2
     C                     MOVE '@@    @@'#L3
     C                     MOVE '  @@@@  '#L4
     C                     MOVE '@@    @@'#L5
     C                     MOVE '@@    @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '9'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@    @@'#L2
     C                     MOVE '@@    @@'#L3
     C                     MOVE ' @@@@@@@'#L4
     C                     MOVE '      @@'#L5
     C                     MOVE '      @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C           #CHR      IFEQ '0'
     C                     MOVE ' @@@@@@ '#L1
     C                     MOVE '@@    @@'#L2
     C                     MOVE '@@    @@'#L3
     C                     MOVE '@@    @@'#L4
     C                     MOVE '@@    @@'#L5
     C                     MOVE '@@    @@'#L6
     C                     MOVE '@@    @@'#L7
     C                     MOVE ' @@@@@@ '#L8
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
