     H            Y.
     F** AM#R22T ********************************************
     F* RETURN #OF CASES SCANNED TO TRUCK TICKET
     F*    LEC.             2022.01.03                      *
     F*******************************************************
     FAM#PP21SIF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I            DS
     I                                        1  25 TT
     I                                       20  25 FILL
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WTT    25
     C                     PARM           P2TOTL  30
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     MOVELWTT       TT
     C                     MOVEL*BLANKS   FILL
      *
     C           KEY01     KLIST
     C                     KFLD           TT
      *
      * for truck Truck Ticket,
      * get number of cases scanned.
     C                     Z-ADD0         P2TOTL
      *
     C           KEY01     SETLLAM#PP21S
     C           KEY01     READEAM#PP21S                 50
     C           *IN50     DOWEQ'0'
      *
     C           S2SKJY    IFEQ ' '
     C                     ADD  1         P2TOTL
     C                     ENDIF
      *
     C           KEY01     READEAM#PP21S                 50
     C                     ENDDO
      *
      *
     C                     SETON                     LR
     C                     RETRN
