     H            Y.                                    1
     H** AM#R10 ****************************************************************
     H* TL/DOCK/PW RESET SIGN-ON PROGRAM                                       *
     F*    LEC              2020.06.18                                         *
     H**************************************************************************
     FALCPW0Y CF  E                    WORKSTN
     FAM#PP31 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
     F**************************************************************************
     E                    ERR     1  15 15
     I**************************************************************************
     I            DS
     I                                        1   80WSDATE
     I                                        1   4 WSYYYY
     I                                        5   6 WSMM
     I                                        7   8 WSDD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 USR
      *
     C           *ENTRY    PLIST
     C                     PARM           POPR    6
     C                     PARM           PUSR   10
     C                     PARM           VALID   1
      *
      **************************************************************************
      *   M  A  I  N  L  I  N  E
     C                     EXSR @INT
     C                     EXSR @MAIN
     C                     SETON                     LR
     C                     RETRN
      **************************************************************************
      * INITIALIZE
     C           @INT      BEGSR
      *
     C                     SETOF                     303132
     C                     MOVEL*BLANK    MSG
      *
     C                     Z-ADD*DATE     WSDATE
     C                     MOVE 'N'       VALID            VALID ID Y/N
      *
     C                     ENDSR
      **************************************************************************
      * MAIN ROUTINE
      *
     C           @MAIN     BEGSR
      *
     C           *IN03     DOWEQ*OFF
      *
     C           POPR      IFEQ *BLANKS
     C                     EXFMTDSP01
     C                     ELSE
     C                     MOVELPOPR      USRCD
     C                     ENDIF
      *
     C                     SETOF                     303132
     C                     MOVEL*BLANK    MSG
      * F3=End
     C           *IN03     IFEQ *OFF
      *
      * validate worker code entry
     C           USRCD     CHAINAM#PP31              90
     C           *IN90     IFEQ *OFF
     C           R3SKJY    ANDNE'D'
     C           R3PGM1    ANDEQ'1'
      *
     C           R3WKCD    CHAINALBPL30              80
     C           *IN80     IFEQ *OFF
     C                     MOVELALWKNM    PUSR
     C                     ENDIF
      *
     C                     MOVE R3WKCD    POPR             SET WORKER ID
     C                     MOVE 'Y'       VALID            VALID ID Y/N
     C                     LEAVE
      *
      * not found in worker code master file
     C                     ELSE
     C                     SETON                     3031
     C                     MOVEAERR,1     MSG
     C           POPR      IFNE *BLANKS
     C                     LEAVE
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
** ERR
USER CODE ERROR
