     H            Y.                                    1
      ** AM#R46X ***************************************************************
      * MANIFEST DOWNLOAD  -  CSV
      *  LEC   2019/07/08
      **************************************************************************
     FAM#PW46XCF  E                    WORKSTN
     FAGDPL12 IF  E           K        DISK
     FAL#PP21 IF  E           K        DISK
     FAM#PL27 IF  E           K        DISK
     FAM#WP46XO   E                    DISK
      *------------------------------------------------------------
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1   80F8KDAT
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *
      *--------------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------------
     C           *INZSR    BEGSR
      *
     C                     TIME           @@TIM   60
     C                     Z-ADD*DATE     K@YMD
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
     C           K#AGD     SETLLAGDPL12
     C           *IN90     DOUEQ*ON
     C                     READPAGDPL12                  90
     C           *IN90     IFEQ *OFF
     C           F8HIRU    ANDEQ*BLANK
     C           F8YORU    ANDEQ*BLANK
     C                     Z-ADDF8KDAT    D@FROM
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     MOVE '01'      W@ID    2
     C                     Z-ADDD@FROM    D@TO
      *
     C                     ENDSR
      **************************************************************************
     C           #SCRN1    BEGSR
      **************************************************************************
     C                     EXFMTDSP01
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     OTHER
      *
     C                     EXSR #CHK1
      * if no errors,
     C           *INKE     IFEQ *ON
     C           *IN99     ANDEQ*OFF
     C                     EXSR #OUT
     C                     MOVE '99'      W@ID
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      **************************************************************************
      *  CHECK SCREEN 1
      **************************************************************************
     C           #CHK1     BEGSR
      *
     C                     SETOF                     6162
     C                     SETOF                     646566
     C                     SETOF                     99
     C           D@TO      IFEQ *ZERO
     C                     Z-ADDD@FROM    D@TO
     C                     ENDIF
     C           D@TO      IFLT D@FROM
     C                     MOVEA'11'      *IN,61
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     Z-ADDD@FROM    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6199
     C                     ENDIF
      *
     C           D@TOTM    IFEQ *ZERO
     C                     Z-ADD2359      D@TOTM
     C                     ENDIF
      *
     C           D@FROM    IFEQ D@TO
     C           D@TOTM    IFLT D@FRTM
     C                     MOVEA'11'      *IN,64
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C           D@NAMC    CHAINAL#PP21              90
     C           *IN90     IFEQ *ON
     C                     SETON                     6699
     C                     ENDIF
      *
     C           D@FRTM    MULT 100       W@FRTM  60
     C           D@TOTM    MULT 100       W@TOTM  60
     C                     ADD  59        W@TOTM
      *
     C                     MOVELD@FROM    DTFROM  8
     C                     MOVELD@TO      DTTO    8
      *
     C                     ENDSR
      *--------------------------------------------------------
      *  OUTPUT
      *--------------------------------------------------------
     C           #OUT      BEGSR
      *
     C                     MOVE *OFF      *IN80
     C           DTFROM    SETLLAM#PL27
     C           *IN80     DOUEQ*ON
     C                     READ AM#PL27                  80
     C           *IN80     IFEQ *OFF
      *
     C           R2NAMC    IFNE D@NAMC
     C                     ITER
     C                     ENDIF
      *
     C           R2HNTE    IFEQ 'NG'
     C           R2SKJY    OREQ 'D'
     C                     ITER
     C                     ENDIF
      *
     C           R2SHID    IFGT DTTO
     C                     LEAVE
     C                     ENDIF
      *
     C                     EXSR WRTDTL
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *-------------------------------------------------------
      *  WRITE DETAIL TO CSV WORKFILE
      *--------------------------------------------------------
     C           WRTDTL    BEGSR
      *
     C                     MOVELR2NAMC    NAMC
     C                     MOVELR2SUPP    SUPP
     C                     MOVELR2ORDN    ORDER#
     C                     MOVELR2NUKE    DOCK
     C                     MOVELR2PLTC    PALLET
     C                     MOVELR2MRSO    CYCLE#
      *
     C                     WRITEAM#WP461
     C                     CLEARAM#WP461
      *
     C                     ENDSR
      *-------------------------------------------------------
