     H            Y.                                    1
      ** AM#PW25 ***************************************************************
      *  LOAD SCAN ERROR/OVERRIDE INQUIRY                                      *
      *
      **************************************************************************
     FAM#PW25 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FAM#PL23 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAM#PL05 IF  E           K        DISK
     FAL#PP21 IF  E           K        DISK
     FAB#PPDC IF  E           K        DISK
     FFGBPL01 IF  E           K        DISK
     FAM#WP25 UF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   1 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1FRDT
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
     I            DS
     I                                        1   80WRKDAT
     I                                        1   40WRKYY
     I                                        5   60WRKMM
     I                                        7   80WRKDD
     I                                        5   80WRKMD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1TODT
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  140FRTIME
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  140TOTIME
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      * 2D MANIFEST BARCODE
     I            DS
     I                                        1  50 MF
     I                                        1   5 MFNAMC
     I                                        3   5 MFTYPE
     I                                        6  10 MFSUPP
     I                                       11  12 MFDOCK
     I                                       13  24 MFORD#
     I                                       25  33 MFMRTE
     I                                       34  36 MFSDCK
     I                                       37  38 MFPALT
     I                                       39  40 MFMROS
     I                                       41  44 MFSKID
     I                                       45  50 MFFILR
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1FRDT
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TODT
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     3334
     C                     TIME           WSDT
      *
     C           F1FRDT    IFEQ *ZERO
     C           F1FRDT    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1FRDT    W1SCFH
      *
     C           F1TODT    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1TODT    W1SCTH
     C                     ENDIF
      *
     C                     Z-ADDF1FRDT    WRKDAT
      *
     C           K#AGDA    KLIST
     C                     KFLD           WRKYY
     C                     KFLD           WRKMM
     C                     KFLD           WRKDD
     C           K#AGDA    CHAINAGDPL12              98
     C           *IN98     IFEQ *ON
     C                     SETON                     3149
     C                     MOVELERR,1     MSG
     C                     ENDIF
      *
     C                     Z-ADDF1TODT    WRKDAT
      *
     C           K#AGDA    CHAINAGDPL12              98
     C           *IN98     IFEQ *ON
     C                     SETON                     3249
     C                     MOVELERR,1     MSG
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2400      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1FRDT    IFEQ F1TODT
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1FRDT    FRDATE
     C           F1FRTM    MULT 100       FRTIME
     C                     Z-ADDF1TODT    TODATE
     C           F1TOTM    MULT 100       TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN1    40
      *
      * close and clear workfile before recreating.
      *
     C                     CLOSEAM#WP25
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AM#WP25
      *
      * start with getting all records within date/time range.
      *
     C           K#L23     KLIST
     C                     KFLD           F1FRDT
      *
     C           K#L23     SETLLAM#PL23
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#PL23                  97
     C   97                LEAVE
      *
     C           R2SSHZ    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDR2SSHZ    SCDATE
     C                     Z-ADDR2SSTI    SCTIME
      *
      * if scan date/time between from date/time and to date/time.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
     C           R2SKJY    IFEQ ' '
      *
     C           R2HNTE    IFEQ 'NG'
     C           R2F5OV    OREQ 'Y'
      *
      *  write to detail workfile.
      *
     C                     CLEARAM#WP251
     C                     Z-ADDR2SSHZ    LVSSHZ
     C                     Z-ADDR2SSTI    LVSSTI
     C                     MOVELR2ERR     LVERR
     C                     MOVELR2USNM    LVUSNM
     C                     MOVELR2F5OV    LVF5OV
      *
     C                     MOVELR2PSHD    LVPSHD
     C                     MOVELR2PSUR    LVPSUR
     C                     MOVELR2SURT    LVSURT
     C                     MOVELR2SHID    LVSHID
     C                     MOVELR22D      LVMFBC
     C                     WRITEAM#WP251
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      * now read workfile and write to subfile to be displayed.
      *
     C           *LOVAL    SETLLAM#WP25
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#WP25                  94
     C   94                LEAVE
      *
     C                     CLEARSFL010
     C                     MOVE *BLANK    S1SEL
     C                     Z-ADDLVSSHZ    S1SCDT
     C           LVSSTI    DIV  100       S1SCTM
     C                     MOVELLVERR     S1ERR
     C                     MOVELLVF5OV    S1F5OV
     C                     MOVELLVUSNM    S1USNM
     C                     MOVELLVIAFP    H1IAFP
     C                     MOVELLVSMEI    H1SMEI
     C                     MOVELLVDOCK    H1DOCK
     C                     MOVELLVORD#    H1ORD#
     C                     MOVELLVMFBC    H1MFBC
     C                     Z-ADDLVPSHD    H1PSHD
     C                     MOVELLVPSUR    H1PSUR
      *
      *
     C                     ADD  1         RRN1
     C                     WRITESFL010
      *
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP1  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP1    #RCN01
     C                     EXFMTCTL010
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP1
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               93
     C   93                LEAVE
      *
     C           S1SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S1SEL
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN52
     C                     EXSR #DSP20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C           *INKL     IFEQ *ON
     C                     MOVEL'01'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S1SEL
     C                     UPDATSFL010
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      * FROM AM#PP01
      *     DETAIL SCREEN TWO
      **************************************************************************
     C           #DSP20    BEGSR
      *
     C                     Z-ADDS1SCDT    F2SCDT
     C                     Z-ADDS1SCTM    F2SCTM
     C                     MOVELS1ERR     F2ERR
     C                     MOVELS1F5OV    F2F5OV
     C                     MOVELS1USNM    F2USNM
      *
     C                     MOVELH1PSUR    F2PSUR
     C                     Z-ADDH1PSHD    F2PSHD
     C                     MOVELH1MFBC    F2MFBC
     C                     MOVELH1MFBC    MF
      * get delivery code for namc destination.
     C           MFNAMC    CHAINAL#PP21              67
     C           *IN67     IFEQ *OFF
     C                     MOVELC2NONY    F2NONY
     C                     ELSE
     C                     MOVE *BLANKS   F2NONY
     C                     Z-ADD*ZERO     C2NONY
     C                     ENDIF
      *
      * if export, get delv code based on dock code.
     C           MFTYPE    IFEQ 'EXP'
     C           C2NONY    ANDEQ*ZERO
     C                     MOVELMFDOCK    KEYDC   4 P
     C           KEYDC     CHAINAB#PPDC              67
     C           *IN67     IFEQ *OFF
     C                     MOVELADNONY    F2NONY
     C                     MOVELADNONY    C2NONY
     C                     ELSE
     C                     MOVE *BLANKS   F2NONY
     C                     Z-ADD*ZERO     C2NONY
     C                     ENDIF
     C                     ENDIF
      *
      * get destination name for delivery code.
     C           C2NONY    CHAINFGBPL01              67
     C           *IN67     IFEQ *OFF
     C                     MOVELB2SMEI    F2NAME
     C                     ELSE
     C                     MOVE *BLANKS   F2NAME
     C                     ENDIF
      *
     C                     MOVELMFDOCK    F2NUKE
     C                     MOVELMFORD#    F2LORD
     C                     MOVELMFMRTE    F2MNRT
     C                     MOVELMFPALT    F2PLCD
     C                     MOVELMFMROS    F2MROS
     C                     MOVELMFSKID    F2SKID
      *
     C           H1MFBC    CHAINAM#PL05              67
     C           *IN67     IFEQ *OFF
     C                     MOVELR1IAFP    F2IAFP
     C                     MOVELR1SMEI    F2SMEI
     C                     MOVELR1DOCK    F2DOCK
     C                     MOVELR1ORD#    F2ORD#
     C                     ELSE
     C                     MOVEL*BLANKS   F2IAFP
     C                     MOVEL*BLANKS   F2SMEI
     C                     MOVEL*BLANKS   F2DOCK
     C                     MOVEL*BLANKS   F2ORD#
     C                     ENDIF
      *
     C                     EXFMTFMT020
      *
     C                     ENDSR
      *************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR






** CMD
CLRPFM QTEMP/AM#WP25
