     H            Y.                                    1
      ** AM#PW25S **************************************************************
      *  SCS TRANSMISSION INQUIRY                                              *
      *
      **************************************************************************
     FAM#PW25SCF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                        RRN2  KSFILE SFL020
     F                                              KINFDS @INFDS
     FAM#PL401IF  E           K        DISK
     FAM#PL402IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
      **************************************************************************
     E                    ERR     1  10 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1FRDT
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
     I            DS
     I                                        1   80WRKDAT
     I                                        1   40WRKYY
     I                                        5   60WRKMM
     I                                        7   80WRKDD
     I                                        5   80WRKMD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1TODT
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  140FRTIME
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  140TOTIME
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      *
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1FRDT
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TODT
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     333435
     C                     TIME           WSDT
     C                     MOVEL*BLANKS   ##APID
      *
     C           F1FRDT    IFEQ *ZERO
     C           F1FRDT    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1FRDT    W1SCFH
      *
     C           F1TODT    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1TODT    W1SCTH
     C                     ENDIF
      *
     C                     Z-ADDF1FRDT    WRKDAT
      *
     C           K#AGDA    KLIST
     C                     KFLD           WRKYY
     C                     KFLD           WRKMM
     C                     KFLD           WRKDD
     C           K#AGDA    CHAINAGDPL12              98
     C           *IN98     IFEQ *ON
     C                     SETON                     3149
     C                     MOVELERR,1     MSG
     C                     ENDIF
      *
     C                     Z-ADDF1TODT    WRKDAT
      *
     C           K#AGDA    CHAINAGDPL12              98
     C           *IN98     IFEQ *ON
     C                     SETON                     3249
     C                     MOVELERR,1     MSG
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2400      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1FRDT    IFEQ F1TODT
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1SEL     IFGT 4
     C                     MOVEA'1'       *IN,35
     C                     MOVELERR,5     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1STAT    IFGT 2
     C                     MOVEA'1'       *IN,36
     C                     MOVELERR,7     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C                     SELEC
     C           F1SEL     WHEQ 0
     C                     MOVEL'ALL'     ##APID 10
     C           F1SEL     WHEQ 1
     C                     MOVEL'SKID'    ##APID
     C           F1SEL     WHEQ 2
     C                     MOVEL'TRAILER' ##APID
     C           F1SEL     WHEQ 3
     C                     MOVEL'CASES'   ##APID
     C           F1SEL     WHEQ 4
     C                     MOVEL'SPTRAILE'##APID
     C                     MOVE 'R '      ##APID
     C                     ENDSL
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C                     SELEC
     C           F1STAT    WHEQ 0
     C                     MOVEL'ALL '    ##STAT  4
     C           F1STAT    WHEQ 1
     C                     MOVEL'GOOD'    ##STAT
     C           F1STAT    WHEQ 2
     C                     MOVEL'FAIL'    ##STAT
     C                     ENDSL
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1FRDT    FRDATE
     C           F1FRTM    MULT 100       FRTIME
     C                     Z-ADDF1TODT    TODATE
     C           F1TOTM    MULT 100       TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN1    40
      *
      * start with getting all records within date/time range.
      *
     C           K#L401    KLIST
     C                     KFLD           F1FRDT
      *
     C           K#L401    SETLLAM#PL401
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#PL401                 97
     C   97                LEAVE
      *
     C           L1DATE    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     SELEC
     C           ##APID    WHEQ 'ALL'
      *                 ...do nothing...
     C           ##APID    WHNE L1APID
     C                     ITER
     C                     ENDSL
      *
     C           L1MSTS    IFEQ '0'
     C                     ITER
     C                     ENDIF
      *
     C                     Z-ADDL1DATE    SCDATE
     C                     Z-ADDL1TIME    SCTIME
      *
      * if log date/time between from date/time and to date/time.
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
     C                     CLEARSFL010
      *
     C                     MOVE *BLANK    S1SEL
     C                     Z-ADDL1DATE    S1SCDT
     C           L1TIME    DIV  100       S1SCTM
     C                     MOVELL1SUPP    S1SUPP
     C                     MOVELL1APID    S1APID
      *
     C           L1CFM#    IFNE '*NULL'
     C           L1CFM#    ANDNE*BLANKS
     C                     MOVEL'GOOD'    S1STAT
     C                     ELSE
     C                     MOVEL'FAIL'    S1STAT
     C                     ENDIF
      *
     C                     SELEC
     C           ##STAT    WHEQ 'ALL'
      *                 ...do nothing...
     C           ##STAT    WHNE S1STAT
     C                     ITER
     C                     ENDSL
      *
     C                     Z-ADDL1CTID    H1CTID
     C                     Z-ADDL1SHID    H1SHID
     C           L1SHIT    DIV  100       H1SHIT
     C                     MOVELL1ORD#    H1ORD#
     C                     MOVELL1NAMC    H1NAMC
     C                     MOVELL1SURT    H1SURT
     C                     MOVELL1DOCK    H1NUKE
     C                     MOVELL1PALT    H1PALT
     C                     MOVELL1SKID    H1SKID
     C                     MOVELL1CFM#    H1CFM#
     C                     MOVELL1TRLR    H1TRLR
      *
     C           L1WKCD    IFNE *BLANK
     C                     MOVELL1WKCD    ##WKCD  60
     C           ##WKCD    CHAINALBPL30              71
     C           *IN71     IFEQ *OFF
     C                     MOVELALWKNM    H1USNM
     C                     ENDIF
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     WRITESFL010
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP1  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP1    #RCN01
     C                     EXFMTCTL010
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP1
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN1
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL010               93
     C   93                LEAVE
      *
     C           S1SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S1SEL
     C                     UPDATSFL010
     C                     MOVEL*OFF      *IN52
      *
     C                     SELEC
     C           S1STAT    WHEQ 'GOOD'
     C                     EXSR #DSP20
     C           S1STAT    WHEQ 'FAIL'
     C                     EXSR #DSP30
     C                     ENDSL
      *
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C           *INKL     IFEQ *ON
     C                     MOVEL'01'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S1SEL
     C                     UPDATSFL010
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     DETAIL SCREEN TWO
      **************************************************************************
     C           #DSP20    BEGSR
      *
     C                     Z-ADDS1SCDT    F2SCDT
     C                     Z-ADDS1SCTM    F2SCTM
     C                     MOVELS1APID    F2APID
     C                     MOVELS1STAT    F2STAT
     C                     MOVELS1SUPP    F2SUPP
      *
     C                     Z-ADDH1SHID    F2SHID
     C                     Z-ADDH1SHIT    F2SHIT
     C                     MOVELH1ORD#    F2ORD#
     C                     MOVELH1NAMC    F2NAMC
     C                     MOVELH1SURT    F2SURT
     C                     MOVELH1NUKE    F2NUKE
     C                     MOVELH1PALT    F2PLCD
     C                     MOVELH1SKID    F2SKID
     C                     MOVELH1USNM    F2USNM
     C                     MOVELH1CFM#    F2CFM#
     C                     MOVELH1TRLR    F2TRLR
      *
     C                     EXFMTFMT020
      *
     C                     ENDSR
      *************************************************************************
      *     DISPLAY ERROR MESSAGE SUBFILE.
      **************************************************************************
     C           #DSP30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN2    40
      *
     C           K#L402    KLIST
     C                     KFLD           KYCTID
     C                     KFLD           KYAPID
      *
     C                     Z-ADDH1CTID    KYCTID 110
     C                     MOVELS1APID    KYAPID 20
      *
     C                     MOVELS1APID    S2APID
     C                     Z-ADDH1CTID    S2CTID
     C                     MOVELH1SURT    S2SURT
     C                     Z-ADDH1SHID    S2SHID
     C                     Z-ADDH1SHIT    S2SHIT
     C                     MOVELH1TRLR    S2TRLR
     C                     MOVELH1ORD#    S2ODRN
     C                     MOVELH1NUKE    S2NUKE
     C                     MOVELH1NAMC    S2NAMC
     C                     MOVELH1PALT    S2PALT
      *
     C           K#L402    SETLLAM#PL402
     C                     DO   *HIVAL
      *
     C           K#L402    READEAM#PL402                 65
      *
     C           *IN65     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
      *
     C                     MOVELM1KOBJ    S2KOBJ
     C                     MOVELM1MESG    S2MESG
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     49
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     S2MESG
     C                     ADD  1         RRN2
     C                     WRITESFL020
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADD1         #RCN02
     C                     EXFMTCTL020
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
      *
     C                     ENDSR
      *************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR
SELECT 0 - 4
TRANS SUCCESSFUL, NO ERRORS
SELECT 0 - 2



