     H            Y.
     F** AM#R16 *********************************************
     F* PACKING - SUPPLEMENTS AND EXPORTS                   *
     F*    LEC.  2018.11.26  COPY FROM AM#R14               *
     F*    LEC.  2018.12.21  FIX EXPORTS ORD# & MAN# RETRV  *
     F*    LEC.  2020.07.13  ADD CALL TO SEND MAN# TO SQL   *
     F*    LEC.  2021.03.12  CHG PGM TO SEND SKID DATA      *
     F*    LEC.  2021.08.20  ADD CHECK FOR MANIFEST SKID ID *
     F*******************************************************
     FAM#PW16 CF  E                    WORKSTN
     FAL#PP21 IF  E           K        DISK
     FAB#PPDC IF  E           K        DISK
     FAM#PL01 IF  E           K        DISK
     FAB#PP65 IF  E           K        DISK
     FAB#PL65BIF  E           K        DISK
     F            AB#PP651                          KRENAMEAB65R
     FAB#PL19BIF  E           K        DISK
     FAL#PL03 UF  E           K        DISK
     FAM#PP01 O   E                    DISK                      A
     E                    ER      1  20 65
      *
     ID2R         DS
     I                                        1  25 D2R01
     I                                       26  50 D2R02
     I                                       51  75 D2R03
     I                                       76 100 D2R04
     I                                      101 125 D2R05
     I                                      126 150 D2R06
     I                                      151 175 D2R07
     I                                      176 200 D2R08
     I                                      201 225 D2R09
     I                                      226 250 D2R10
      *
      * 2D KANBAN
     I            DS
     I                                        1 250 W2D
     I                                        1  18 BARCD0
     I                                        1   1 CTYPE
     I                                        2  16 TXT1
     I                                       17  31 TXT2
     I                                       32  36 SUPP
     I                                       37  38 DCCOD
     I                                       39  42 SBAN
     I                                       43  54 PART
     I                                       55  64 LNAD
     I                                       65  74 STAD
     I                                       75  79 LOTS
     I                                       80  99 SUPNM
     I                                      100 108 MAINR
     I                                      109 117 SUBR
     I                                      118 125 UNDAT
     I                                      126 133 SHDT
     I                                      134 139 SHTM
     I                                      140 151 ORNO
     I                                      152 155 BXNBR
     I                                      156 159 BXTOT
     I                                      160 164 DEST
     I                                      196 197 PALT
     I                                       19 250 FILR
      *
     IMAN         DS
     I                                        1  25 MAN01
     I                                       26  50 MAN02
     I                                       44  44 MFSIDE
      *
      * 2D MANIFEST BARCODE
     I            DS
     I                                        1  50 MF
     I                                        1   5 MFNAMC
     I                                        3   5 MFTYPE
     I                                        6  10 MFSUPP
     I                                       11  12 MFDOCK
     I                                       13  24 MFORD#
     I                                       23  23 MFOTYP
     I                                       25  33 MFMRTE
     I                                       34  36 MFSDCK
     I                                       37  38 MFPALT
     I                                       39  40 MFMROS
     I                                       41  44 MFSKID
     I                                       45  50 MFFILR
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I            DS
     I                                        1  20 BAMHN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
      *
     I            DS
     I                                        1   8 SHIPDT
     I                                        1   40NOYY
     I                                        5   60NOMM
     I                                        7   80NODD
      *
     I            DS
     I                                        1  20 PARTNO
     I                                        1   5 MHN1
     I                                        6  10 MHN2
     I                                       11  15 MHN3
     I                                       16  20 MHN4
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 10
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    PCMD    2
     C                     MOVELWORKER    USRCD   6
     C                     MOVEL*BLANK    EXCD    2
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB215
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *窞�黬�砑ⓓ�樴灎獐�橑柷　　　　　　　　　　　　�
      *----------------------------------------------------*
     CSR         #SB215    BEGSR
      *
     C                     CLEARMAN
      *
     C                     EXFMTDSP04
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     3199
      *
     C                     DO
      *
     C           *IN03     IFEQ *ON
     C                     MOVEL'99'      DSPSW
     C                     CLEARMAN
     C                     GOTO ESB215
     C                     ENDIF
      *
     C                     MOVELMAN       MF
      *
      *  check scanned manifest for errors...
     C           MAN       IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,9      MSG
     C                     SETOF                     3199
     C                     LEAVE
     C                     ENDIF
      *
     C           MFSKID    IFEQ *BLANKS
     C                     SETON                     3199
     C                     MOVELER,14     MSG
     C                     LEAVE
     C                     ENDIF
      *
      * determine manifest type scanned...
     C           MFTYPE    IFEQ 'EXP'
     C                     MOVE MFTYPE    TYPE    3          export
     C                     ELSE
     C                     MOVE 'SUP'     TYPE               supplemental
     C                     ENDIF
      *
      * verify manifest info...
     C                     SELEC
     C           TYPE      WHEQ 'EXP'
     C                     MOVEL*BLANKS   EXCODE
     C                     EXSR CHKEXP
     C           TYPE      WHEQ 'SUP'
     C                     MOVEL*BLANKS   EXCODE
     C                     EXSR CHKSUP
     C                     ENDSL
      *
     C                     ENDDO
      *
      * if error...
     C           *IN99     IFEQ *ON
     C                     EXSR #SB999
     C                     SETOF                     3199
     C                     MOVE *BLANKS   MSG
     C                     CLEARMAN
     C                     ELSE
     C                     EXSR #SB920
      *
     C                     MOVEL'02'      DSPSW
     C                     ENDIF
      *
     CSR         ESB215    ENDSR
      *----------------------------------------------------*
      *�絇灈���痤痧▏�ġ獐�黬�砑ⓓ　　　　　　　　�
      *----------------------------------------------------*
     C           CHKSUP    BEGSR
      *
      * use Destination code to get delivery code from M/F.
      *
     C                     Z-ADD*ZERO     C2TOKU
     C                     Z-ADD*ZERO     C2NONY
     C                     MOVE *BLANKS   C2NKOJ
     C           MFNAMC    CHAINAL#PP211             51
     C           *IN51     IFEQ *OFF
     C           C2SKJY    ANDEQ'D'
     C           C2SKHZ    ANDLESDATE
     C                     Z-ADD*ZERO     C2TOKU
     C                     Z-ADD*ZERO     C2NONY
     C                     MOVE *BLANKS   C2NKOJ
     C                     ENDIF
      *
     C                     MOVELC2TOKU    MFTOKU  4
     C                     MOVELC2NONY    MFNONY  4
     C                     MOVELC2NKOJ    MFNKOJ  1
      *
      * check order# to verify supplemental...  order# should have an S in it.
     C           MFNONY    IFNE '3503'                       not TMMC
     C           MFOTYP    ANDNE'S'                          order type
     C                     MOVELER,11     MSG
     C                     SETON                     3199
     C                     ENDIF
      *
      * check order# for TMMC supplemental...  ord# should have an X or D in it.
     C           MFNONY    IFEQ '3503'                       TMMC
     C           'D'       SCAN MFORD#    POS     60         position
     C           POS       IFEQ *ZERO
     C           'X'       SCAN MFORD#    POS     60         position
     C           POS       IFEQ *ZERO
     C                     MOVELER,11     MSG
     C                     SETON                     3199
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVEL'18'      EXCODE  2
     C                     ENDIF
      *
     C                     ENDSR
      *----------------------------------------------------*
      *�絇灈��ġ�ġ獐�黬�砑ⓓ　　　　　　　　　　　�
      *----------------------------------------------------*
     C           CHKEXP    BEGSR
      *
     C                     MOVELMFDOCK    DOCK4   4
     C           DOCK4     CHAINAB#PPDC              50
     C           *IN50     IFEQ *OFF
     C                     MOVELADTOKU    MFTOKU
     C                     MOVELADNONY    MFNONY
     C                     MOVELADNKOJ    MFNKOJ
     C                     MOVELMFDOCK    MFNUKE  4 P
     C                     ELSE
     C                     MOVELER,12     MSG
     C                     SETON                     3199
     C                     ENDIF
      *
      *
     C                     ENDSR
      *----------------------------------------------------*
      *�ĝ▏胕痱�槈痡　　　　　　　　　　　　　　　　　�
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTDSP02
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ *ON
     C                     MOVEL'01'      DSPSW   2
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           D2R       IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,2      MSG
     C                     EXSR #SB999
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
     C                     GOTO ESB220
     C                     ENDIF
      *
     C                     MOVEL*BLANK    WKHNTE  2
     C                     MOVELD2R       W2D
      *
     C                     EXSR #SB710
      *
     C           *IN99     IFEQ *ON
     C                     EXSR #SB229
     C                     ELSE
     C                     MOVEL'OK'      WKHNTE  2
     C                     TIME           WTIME
     C                     MOVEL*BLANK    MSG
     C                     EXSR #SB500
     C                     EXSR #SB750
     C                     CLEARD2R
     C                     EXSR #SB920
     C                     ENDIF
      * send manifest bc to SQL server via RDB...
     C           P2SUMI    IFEQ P2TOTL
     C                     CALL 'AM#R413'
     C                     PARM           R1MFBC
     C                     PARM           USRCD
      * display OK...
     C                     EXFMTDSP03
     C                     MOVEL'01'      DSPSW
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * LOG ERROR AND LOCK PROGRAM                         *
      *----------------------------------------------------*
     CSR         #SB229    BEGSR
      *
     C           WKHNTE    IFEQ 'NG'
     C                     TIME           WTIME
     C                     EXSR #SB500
     C                     Z-ADD3         P1PGM
     C                     MOVELMSG       P1ERR
     C                     MOVELW#PGM     P1PID
     C                     MOVELWORKER    P1KOME    P
     C                     Z-ADD*ZERO     P1DTTM
     C                     CALL 'AM#R09'                   LOCK
     C                     PARM           P1PGM   20
     C                     PARM           P1ERR  25
     C                     PARM           P1PID  10
     C                     PARM           P1KOME 10
     C                     PARM           P1DTTM 140
     C                     ELSE
     C                     EXSR #SB999
     C                     ENDIF
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
     C                     CLEARD2R
      *
     CSR         ESB229    ENDSR
      *----------------------------------------------------*
      * DISPLAY ERROR                                      *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
      *
     C                     MOVELMSG       P1ERR
     C                     CALL 'AM#R08'
     C                     PARM           P1ERR  25
      *
     CSR         ESB999    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * AM#PP01                                            *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     CLEARAM#PP011
     C                     Z-ADDSDATE     R1KOHZ
     C                     Z-ADDSTIME     R1KOTI
     C                     MOVELWORKER    R1KOME
     C                     MOVELW#PGM     R1KPGM
     C                     Z-ADDSDATE     R1SSHZ
     C                     Z-ADDSTIME     R1SSTI
     C                     MOVELWORKER    R1USCD
     C                     MOVEL*BLANK    R1USNM
     C                     MOVELWKHNTE    R1HNTE
     C                     MOVELMSG       R1ERR
     C                     MOVEL*BLANKS   R1TICK
     C                     MOVELSUBR      R1SURT
     C                     MOVELSHDT      R1SHID
     C                     MOVELSHTM      R1SHIT
     C                     MOVELDEST      R1SMEI
     C                     MOVELDCCOD     R1DOCK
     C                     MOVELORNO      R1ORD#
     C                     MOVELPALT      R1PALT
     C                     MOVELMFNONY    R1NONY
     C                     MOVELMFNKOJ    R1NKOJ
     C                     MOVELDCCOD     R1NUKE
     C                     MOVEL*ZERO     R1IAFB
     C                     MOVEL*ZERO     R1IAFP
     C                     MOVEL*BLANKS   R1PPUL
     C                     MOVEL*BLANKS   R1EXT
     C                     MOVEL*BLANKS   R1SAT
     C                     MOVELW2D       R12D
     C                     MOVELSUBR      R12URT
     C                     MOVELSHDT      R12HID
     C                     MOVELSHTM      R12HIT
     C                     MOVELDEST      R12AMC
     C                     MOVELDCCOD     R12OCK
     C                     MOVELORNO      R12RD#
     C                     MOVELPALT      R12ALT
     C                     MOVELPART      R12HN
     C                     MOVELBXNBR     R12OX#
     C                     MOVEL*BLANKS   R12AFB
     C                     MOVEL*BLANKS   R12AFP
     C                     MOVEL*BLANKS   R1SHME
     C                     MOVE 'A'       MFSIDE
     C                     MOVELMAN       R1MFBC
     C                     MOVELEXCODE    R1EXCD
     C                     EXSR #MANI
     C                     WRITEAM#PP011
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      *  VERIFY MANIFEST BARCODE INFO                      *
      *----------------------------------------------------*
     CSR         #SB710    BEGSR
      *
     C                     TIME           WTIME
      *
      *  compare container label info to manifest info...
      *
     C                     DO
      *
     C           DEST      IFNE MFNAMC
     C           DCCOD     ORNE MFDOCK
     C           ORNO      ORNE MFORD#
     C           MAINR     ORNE MFMRTE
     C           PALT      ORNE MFPALT
     C                     SETON                     3199
     C                     MOVELER,10     MSG
     C                     LEAVE
     C                     ENDIF
      *
      *   verify container has not already been scanned...
     C           W2D       CHAINAM#PL01              51
     C           *IN51     DOWEQ*OFF
     C           R1SKJY    IFEQ ' '
     C           R1HNTE    ANDEQ'OK'
     C                     SETON                     3199
     C                     MOVELER,5      MSG
     C                     LEAVE
     C                     ENDIF
     C           W2D       READEAM#PL01                  51
     C                     ENDDO
      *
     C                     ENDDO
      *
     C           *IN99     IFEQ *OFF
      * verify container has been picked shipping...
     C                     SELEC
     C           TYPE      WHEQ 'EXP'
     C                     EXSR SB720E
     C           TYPE      WHEQ 'SUP'
     C                     EXSR SB720S
     C                     ENDSL
     C                     ENDIF
      *
     CSR         ESB710    ENDSR
      *----------------------------------------------------*
      *  VERIFY ORDER HAS BEEN PICKED BY SHIPPING          *
      *    ----    SUPPLEMENTAL ORDER     ----             *
      *----------------------------------------------------*
     CSR         SB720S    BEGSR
      *
     C           K#65      KLIST
     C                     KFLD           K@DEST  5
     C                     KFLD           K@NUKE  4
     C                     KFLD           K@ORNO 12
     C                     KFLD           K@KANO  4
     C                     KFLD           K@BOXN  4
      *
     C                     MOVELDEST      K@DEST
     C                     MOVELDCCOD     K@NUKE
     C                     MOVELORNO      K@ORNO
     C                     MOVELSBAN      K@KANO
     C                     MOVELBXNBR     K@BOXN
     C                     MOVEL'0'       GET65   1
      *
     C           K#65      SETLLAB#PP65
     C           K#65      READEAB#PP65                  90
     C           *IN90     DOWEQ*OFF
     C           GET65     ANDEQ'0'
     C           A6SKJY    IFEQ *BLANK
     C                     MOVEL'1'       GET65
     C                     ENDIF
     C           K#65      READEAB#PP65                  90
     C                     ENDDO
     C           GET65     IFEQ '0'
     C                     MOVEL'NG'      WKHNTE  2
     C                     SETON                     3199
     C                     MOVELER,8      MSG
     C                     ENDIF
      *
     CSR         ESB720    ENDSR
      *----------------------------------------------------*
      *  VERIFY ORDER HAS BEEN PICKED BY SHIPPING          *
      *    ----        EXPORT ORDER       ----             *
      *----------------------------------------------------*
     CSR         SB720E    BEGSR
      *
     C           K#65B     KLIST
     C                     KFLD           NONY    4
     C                     KFLD           K@NOYY  40
     C                     KFLD           K@NOMM  20
     C                     KFLD           K@NODD  20
     C                     KFLD           K@NUKE  4
      *
     C                     MOVELSHDT      SHIPDT
     C                     MOVELPART      PARTNO
     C                     MOVELMFNONY    NONY
     C                     MOVELNOYY      K@NOYY
     C                     MOVELNOMM      K@NOMM
     C                     MOVELNODD      K@NODD
     C                     MOVELDCCOD     K@NUKE
     C                     MOVEL'0'       GET65
      *
     C           K#65B     SETLLAB#PL65B
     C           K#65B     READEAB#PL65B                 90
     C           *IN90     DOWEQ*OFF
     C           GET65     ANDEQ'0'
     C           A6SKJY    IFEQ *BLANK
     C           A6MHN1    ANDEQMHN1
     C           A6MHN2    ANDEQMHN2
     C           A6MHN3    ANDEQMHN3
     C           A6MHN4    ANDEQMHN4
     C           A6BOXN    ANDEQBXNBR
     C                     MOVELA6ORNO    EXPMAN 12
     C                     MOVEL'1'       GET65
     C                     ENDIF
     C           K#65B     READEAB#PL65B                 90
     C                     ENDDO
     C           GET65     IFEQ '0'
     C                     MOVEL'NG'      WKHNTE  2
     C                     SETON                     3199
     C                     MOVELER,8      MSG
     C                     ENDIF
      *
     CSR                   ENDSR
      *----------------------------------------------------*
      * GET ORDER TOTALS                                   *
      *----------------------------------------------------*
     CSR         #SB920    BEGSR
      *
      * get total # of containers for manifest
      * and total # of containers already scanned to manifest.
     C                     Z-ADD0         P2TOTL  30
     C                     Z-ADD0         P2SUMI  30
     C                     CALL 'AM#R02S'
     C                     PARM           MFNAMC
     C                     PARM           MFDOCK
     C                     PARM           MFORD#
     C                     PARM           MF
     C                     PARM           P2TOTL
     C                     PARM           P2SUMI
      *
     C           P2SUMI    IFGT *ZERO
     C           P2TOTL    ORGT *ZERO
     C                     MOVEL'CONTS:'  D1CONT
     C                     Z-ADDP2SUMI    D1SUMI
     C                     MOVE '/'       D1SRSH
     C                     Z-ADDP2TOTL    D1TOTL
     C                     MOVEL'CONTS:'  D2CONT
     C                     Z-ADDP2SUMI    D2SUMI
     C                     MOVE '/'       D2SRSH
     C                     Z-ADDP2TOTL    D2TOTL
     C                     ENDIF
      *
     CSR         ESB920    ENDSR
      *----------------------------------------------------*
      *  GET MANIFEST NUMBER FROM ORDER FILE.              *
      *----------------------------------------------------*
     CSR         #MANI     BEGSR
      *
      * default the order number from the 2D barcode as the manifest #
      * this is because for TMMC (and maybe others in the future) these
      * are one and the same.
      *
     C                     MOVELORNO      R1MAN#    P
      *
     C           K#19B     KLIST
     C                     KFLD           K@TOKU
     C                     KFLD           K@NONY
     C                     KFLD           K@NUKE
     C                     KFLD           K@INVN
     C                     KFLD           K@SKJY
      *
     C                     MOVELMFTOKU    K@TOKU  40
     C                     MOVELMFNONY    K@NONY  40
     C                     MOVELMFDOCK    K@NUKE  4
     C                     MOVELORNO      K@INVN 16 P
     C                     MOVE *BLANK    K@SKJY  1
      *
     C           K#19B     SETLLAB#PL19B
     C           K#19B     READEAB#PL19B                 50
     C           *IN50     DOWEQ*OFF
     C           BAMHN     IFEQ PART
     C                     MOVELBAODRN    R1MAN#    P
     C                     LEAVE
     C                     ENDIF
     C           K#19B     READEAB#PL19B                 50
     C                     ENDDO
      *
      * if export order, use manifest# retrieved from AB#PP65
     C           TYPE      IFEQ 'EXP'
     C                     MOVELEXPMAN    R1MAN#    P
     C                     ENDIF
      *
     CSR         ESMANI    ENDSR
      *----------------------------------------------------*
     CSR         #SB750    BEGSR
      *----------------------------------------------------*
     C           KEY01     KLIST
     C                     KFLD           KKSHID  8
     C                     KFLD           KKSHIT  6
     C                     KFLD           KKSURT  9
     C                     KFLD           KKNONY  40
     C                     KFLD           KKNKOJ  1
     C                     KFLD           KKNUKE  4
     C                     KFLD           KKORD# 12
     C                     KFLD           KKPALT  2
      *2D
     C                     MOVELSHDT      KKSHID
     C                     MOVELSHTM      KKSHIT
     C                     MOVELSUBR      KKSURT
     C                     MOVELMFNONY    KKNONY
     C                     MOVELMFNKOJ    KKNKOJ
     C                     MOVELDCCOD     KKNUKE
     C                     MOVELORNO      KKORD#
     C                     MOVELPALT      KKPALT
     C                     MOVEL'0'       GET     1
      *
     C           KEY01     SETLLAL#PL031
     C           KEY01     READEAL#PL031                 80
     C           *IN80     DOWEQ'0'
     C           GET       ANDEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C           CAMHN     IFEQ PART
     C           CABOX#    ANDEQBXNBR
      *
     C           CAPLDT    IFEQ 0
     C                     MOVEL'1'       GET
     C                     Z-ADDSDATE     CAPLDT
     C                     Z-ADDSTIME     CAPLTI
     C                     UPDATAL#PL031
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C           GET       IFEQ '0'
     C           KEY01     READEAL#PL031                 80
     C                     ENDIF
     C                     ENDDO
      *
     CSR         ESB750    ENDSR
      *----------------------------------------------------*
**
INPUT PALLET TICKET.
INPUT USER KANBAN.
SCANNED ALL.
NO DATA.
ALREADY SCANNED.
OTHER PALLET#.
NO PALLET DATA.
NO SHIPPING DATA.
INPUT MANIFEST BARCODE.
DOES NOT MATCH MANIFEST.
SUPPLEMNTL ORD# INVALID.
EXPORT DOCK NOT IN M/F.
ER 13
SKID ID CANNOT BE BLANK.                                                    14
ER 15
ER 16
ER 17
ER 18
ER 19
ER 20
