     H            Y.
     F** AM#RB6  *******************************************
     F* SHIPPING PROGRESS                                  *
     F*      ITS.        2015.06.23                        *
     F******************************************************
     FAM#WPB1 UF  E           K        DISK
     FAM#PPC1 IF  E           K        DISK
     E                    YD       1999  3
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
     C                     EXSR #SB100
      *
     C                     Z-ADD0         X       40
     C                     READ AM#WPB11                 81
     C           *IN81     DOWEQ'0'
     C           W1YARD    IFEQ *BLANK
     C                     EXSR #SB500
     C                     ENDIF
     C                     READ AM#WPB11                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB100    BEGSR
      *
     C                     Z-ADD0         X       40
     C                     CLEARYD
     C           *LOVAL    SETLLAM#PPC11
     C                     READ AM#PPC11                 80
     C           *IN80     DOWEQ'0'
     C           RCSKJY    IFEQ 'D'
     C           RCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         X
     C                     MOVELRCYARD    YD,X
     C                     ENDIF
     C                     READ AM#PPC11                 80
     C                     ENDDO
      *
     CSR         ESB100    ENDSR
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C                     ADD  1         X
     C           YD,X      IFEQ *BLANK
     C                     Z-ADD1         X
     C                     ENDIF
     C                     MOVELYD,X      W1YARD
     C                     UPDATAM#WPB11
      *
     CSR         ESB500    ENDSR
