     H            Y/                                    1
     H** AM#R32 *******************************************************
     H*  PASSWORD M/F INQUIRY                                         *
     H*  JW      2019.11.07                                           *
     H*****************************************************************
     FAM#PW32 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN1  KSFILE SFL01
     FAM#PP31 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
      *================================================================
     E                    ER      1   2 65
     E                    PG      1  10 10
     E                    PGM        10  1
     IINFDS       DS
     I                                    B 378 3790$$RRN
      *
     I            DS
     I                                        1  140@TIME
     I                                        1   60NOW
     I                                        7  140TODAY
      *
     I            DS
     I                                        1  10 PGM
     I                                        1   1 R3PGM1
     I                                        2   2 R3PGM2
     I                                        3   3 R3PGM3
     I                                        4   4 R3PGM4
     I                                        5   5 R3PGM5
     I                                        6   6 R3PGM6
     I                                        7   7 R3PGM7
     I                                        8   8 R3PGM8
     I                                        9   9 R3PGM9
     I                                       10  10 R3PGMA
      *
     I           SDS
     I                                     *PROGRAM W@PGM
     I                                      244 253 W@WSID
     I                                      254 263 W@USER
     I                                      264 269 W@JBNO
     C*===============================================================
     C*  MAIN ROUTINE
     C*===============================================================
     C                     EXSR #INIT
      *
     C           *IN98     DOUEQ*ON
      *
     C                     SETON                     70
     C           ENDRRN    IFNE 0
     C                     SETON                     71
     C                     ENDIF
     C                     WRITEDSP99
     C                     EXFMTCTL01
     C                     SETOF                     7071
     C                     Z-ADD$$RRN     RRN1
     C*----------
     C                     SELEC
     C* <F3> END
     C           *INKC     WHEQ *ON
     C                     MOVE *ON       *IN98
     C* <PAGE UP/DOWN>
     C           *IN73     WHEQ *ON
     C           *IN73     OREQ *ON
      * <ENTR>
     C                     OTHER
     C           $RRN      IFNE 0
     C           $RRN      CHAINSFL01                95
     C           *IN95     IFEQ *OFF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      * SET PARAMETR
     C                     Z-ADD0         RRN1
     C                     DO   *HIVAL
     C                     ADD  1         RRN1
     C           RRN1      CHAINSFL01                99
     C   99                LEAVE
      *
     C           S1SEL     IFNE *BLANK
     C                     Z-ADDS1WKCD    P1WKCD
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C*   << INIT >>
     C*===============================================================
     C           #INIT     BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P1PGM   20
     C                     PARM           P1WKCD  60
      *
     C                     MOVELP1PGM     IX      20
     C                     Z-ADD0         P1WKCD
     C                     TIME           @TIME
     C                     MOVEA*ALL'0'   *IN
      * SFLCLR
     C                     SETON                     72
     C                     WRITECTL01
     C                     SETOF                     72
     C                     Z-ADD0         RRN1    40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVELPG,IX     XMSG
      * SET INITIAL DATA
     C           *LOVAL    SETLLAM#PP31
      *-----------------------------------
     C                     DO   *HIVAL
     C                     READ AM#PP31                  90
     C   90                LEAVE
     C*
     C           R3SKJY    IFEQ 'D'                        DELETE CODE
     C           PGM,IX    ORNE '1'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELR3WKCD    S1WKCD
      * GET NAME
     C           R3WKCD    CHAINALBPL30              99
     C           *IN99     IFEQ *OFF
     C                     MOVELALWKNM    S1WKNM
     C                     ELSE
     C                     MOVE *BLANK    S1WKNM
     C                     ENDIF
      *
     C                     ADD  1         RRN1
     C                     WRITESFL01
      *
     C                     ENDDO
      *-----------------------------------------
      * NO DATA *
     C           RRN1      IFEQ 0
     C                     Z-ADD0         S1WKCD
     C                     MOVELER,1      S1WKNM
     C                     ADD  1         RRN1
     C                     WRITESFL01
     C                     ENDIF
      *-----------------------------------------
     C                     Z-ADDRRN1      ENDRRN
     C                     Z-ADD1         RRN1
      *
     C                     ENDSR
** ER,
 ** NO DATA **

** PG,
SHIPPING
CONVEYANCE
PACKING
HEAT TREAT
QD
TPS
WIRE
HEADING
ROLLING
10
