     H            Y.
     F** AM#R00 *********************************************
     F* SHIPPING SCAN MENU
     F*    ITS.             2015.06.01                      *
     F*    T.SAKAKI         2015.10.15   ADD ACTIVE CHECK   *
     F*                         ADD AM#PP35  ALBPL30        *
     F*  %0001       10/11/2019 ADD PARAMETER LIST          *
JW1  F*  JW          09/15/2020 ADD DUMMY CALL              *
     F*******************************************************
     FAM#PW00 CF  E                    WORKSTN
     FALBPL30 IF  E           K        DISK
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 10
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     MOVELWORKER    USRCD
     C                     Z-ADD0         D1SEL
JW1  C                     GOTO ESB100
 |    ************************************
 |    * DUMMY PROCESS (FOR INDIRECT CALL)
 |    ************************************
 |   C                     CALL 'AM#C21'                   D1SEL=1
\|   C                     CALL 'ALDR2Z'                   D1SEL=2
 |   C                     CALL 'AM#C04'                   D1SEL=3
 |   C                     CALL 'AM#C05'                   D1SEL=4
 |   C                     CALL 'AM#C06'                   D1SEL=5
 |   C                     CALL 'AM#C15'                   D1SEL=6
 |   C                     CALL 'AM#C14'                   D1SEL=7
JW1  C                     CALL 'ALDR98'                   D1SEL=8
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*BLANK    WPGM    7
     C                     MOVEL*BLANK    P2PGM  10
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           P1        PLIST
     C                     PARM           POPR    6
     C                     PARM           PUSR   10
      * FOR ALDR2Z
     C           P2        PLIST
     C                     PARM           POPR    6
     C                     PARM           W1USNM 20
      *
     C                     MOVE WORKER    POPR    6        SET WORKER ID
     C                     MOVE WORKER    POPR2   60       SET WORKER ID
     C*
     C                     MOVEL*BLANK    W1USNM 20
     C                     MOVELPUSR      W1USNM
     C                     SETOF                     98
     C           POPR2     SETGTALBPL301
     C                     DO   *HIVAL
     C           POPR2     REDPEALBPL301                 98
     C   98                LEAVE
     C           ALSKJY    IFEQ 'D'
     C                     ITER
     C                     ENDIF
     C                     MOVEL*BLANK    W1USNM
     C                     MOVELALWKNM    W1USNM 20
     C                     ENDDO
      *
     C                     MOVELW1USNM    PUSR   10        SET WORKER ID
      *
     C                     SELEC
      * LOADING SCAN
     C           D1SEL     WHEQ 1
     C                     MOVEL'AM#C21'  WPGM
      * SHIPPING SCAN
     C           D1SEL     WHEQ 2
     C                     MOVEL'ALDR2Z'  WPGM
      * PACKING
     C           D1SEL     WHEQ 3
     C                     MOVEL'AM#C04'  WPGM
      * DOCK LABEL
     C           D1SEL     WHEQ 4
     C                     MOVEL'AM#C05'  WPGM
      * SHORTAGE OF PALLET
     C           D1SEL     WHEQ 5
     C                     MOVEL'AM#C06'  WPGM
      * INQUERY OF PALLET#
     C           D1SEL     WHEQ 6
     C                     MOVEL'AM#C15'  WPGM
      * PACKING
     C           D1SEL     WHEQ 7
     C                     MOVEL'AM#C14'  WPGM
      * 2POINT SCAN
     C           D1SEL     WHEQ 8
     C                     MOVEL'ALDR98'  WPGM
      *
     C                     OTHER
      *
     C                     SETON                     3199
     C                     MOVELER,1      MSG
     C                     EXSR #SB999
     C                     GOTO ESB210
     C                     ENDSL
      *
      * CREATE SIGN-ON INFO
     C                     MOVELWPGM      P2PGM  10
     C                     MOVE WORKER    P2WKR   6
     C                     MOVELW1USNM    P2WKN  20
     C                     CALL 'ALDRZ6'
     C                     PARM           P2PGM
     C                     PARM           P2WKR
     C                     PARM           P2WKN
      * CALL PROCESS
     C           D1SEL     IFEQ 2
     C           D1SEL     OREQ 8
     C                     CALL WPGM      P2
     C                     ELSE
     C                     CALL WPGM      P1
     C                     ENDIF
     C                     Z-ADD0         D1SEL
      *
      * DELETE SIGN-ON INFO
     C                     CALL 'ALDRZ7'
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * ERR                                                *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
      *
     C                     MOVELMSG       P1ERR
     C                     CALL 'AM#R08'
     C                     PARM           P1ERR  25
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
      *
     CSR         ESB999    ENDSR
**
INPUT NO. ERR




