     H            Y.
     F** AM#R95  *******************************************
     F* PLAN START END                                     *
     F*      ITS.        2015.06.24                        *
     F******************************************************
     FAM#WP51 UF  E           K        DISK
     FAM#WP94 IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1FIXD  80
     C                     PARM           P1FIXT  60
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C           KEY51     KLIST
     C                     KFLD           K1FIXD  80
     C                     KFLD           K1FIXT  60
      *
     C           KEY84     KLIST
     C                     KFLD           W1FIXD
     C                     KFLD           W1FIXT
     C                     KFLD           W1TRKB
     C                     KFLD           W1IAFB
     C                     KFLD           W1EXTR
      *
     C                     Z-ADDP1FIXD    K1FIXD  80
     C                     Z-ADDP1FIXT    K1FIXT  60
     C           KEY51     SETLLAM#WP511
     C           KEY51     READEAM#WP511                 80
     C           *IN80     DOWEQ'0'
     C           W1IAFB    IFNE *BLANK
     C                     EXSR #SB400
     C                     UPDATAM#WP511
     C                     ENDIF
     C           KEY51     READEAM#WP511                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB400    BEGSR
      *開始
     C           KEY84     SETLLAM#WP941
     C           KEY84     READEAM#WP941                 30
     C           *IN30     IFEQ '0'
     C                     Z-ADDW4DATE    W1PSTD
     C                     MOVELW4TIME    W1PSTT
     C                     ENDIF
      *終了
     C           KEY84     SETGTAM#WP941
     C           KEY84     REDPEAM#WP941                 30
     C           *IN30     IFEQ '0'
     C                     Z-ADDW4DATE    W1PEDD
     C                     MOVELW4TIME    W1PEDT
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
