     H            Y.                                    1
      ***AM#R45P ***************************************************************
      *  PALLET RETURN SCAN INQUIRY BY TM, DATE                                *
      *
      **************************************************************************
     FAM#PW45PCF  E                    WORKSTN
     F                                        RRN2  KSFILE SFL020
     F                                        RRN3  KSFILE SFL030
     F                                              KINFDS @INFDS
     FAM#PL45 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAM#WP45PUF  E           K        DISK                      A
     FAM#WP45DUF  E           K        DISK                      A
      **************************************************************************
     E                    ERR     1  10 70
     E                    CMD     1   2 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SCANNED FROM DATE
     I            DS
     I                                        1   80F1SCFH
     I                                        1   40F1SCFY
     I                                        5   60F1SCFM
     I                                        7   80F1SCFD
     I            DS
     I                                        1   80W1SCFH
     I                                        1   40W1SCFY
     I                                        5   60W1SCFM
     I                                        7   80W1SCFD
      *         FROM DATE
     I            DS
     I                                        1   80F8KAHZ
     I                                        1   40F8KAYY
     I                                        5   60F8KAMM
     I                                        7   80F8KADD
      * SCANNED TO DATE
     I            DS
     I                                        1   80F1SCTH
     I                                        1   40F1SCTY
     I                                        5   60F1SCTM
     I                                        7   80F1SCTD
     I            DS
     I                                        1   80W1SCTH
     I                                        1   40W1SCTY
     I                                        5   60W1SCTM
     I                                        7   80W1SCTD
      * SCANNED RESULT DATE
     I            DS
     I                                        1   80D1SSHZ
     I                                        1   80D1DATE
     I                                        1   40D1KSYY
     I                                        5   60D1KSMM
     I                                        7   80D1KSDD
      * SCANNED RESULT TIME
     I            DS
     I                                        1   60D1SSTI
     I                                        1   40D1TIME
     I                                        1   20D1HH
     I                                        3   40D1MM
     I            DS
     I                                        1   5 W8TIME
     I                                        1   2 W8TIHH
     I                                        3   3 W8@DY1
     I                                        4   5 W8TIMM
      * SCREEN - FROM DATE AND TIME
     I            DS
     I                                        1  140FROMDT
     I                                        1   80FRDATE
     I                                        9  140FRTIME
      * SCREEN - TO DATE AND TIME
     I            DS
     I                                        1  140TODT
     I                                        1   80TODATE
     I                                        9  140TOTIME
      *   SCAN - TO DATE AND TIME
     I            DS
     I                                        1  140SCANDT
     I                                        1   80SCDATE
     I                                        9  140SCTIME
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'20'      #FMT20
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SCFY
     C                     Z-ADD*ZERO     F1SCFM
     C                     Z-ADD*ZERO     F1SCFD
     C                     Z-ADD*ZERO     F1SCTY
     C                     Z-ADD*ZERO     F1SCTM
     C                     Z-ADD*ZERO     F1SCTD
     C                     Z-ADD*ZERO     F1FRTM
     C                     Z-ADD*ZERO     F1TOTM
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SCAN DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET20
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ELSE
     C                     MOVEL'20'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     SETOF                     3334
     C                     TIME           WSDT
      *
     C           F1SCFH    IFEQ *ZERO
     C           F1SCFH    ORGT WSSDAT
     C                     SETON                     3149
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     ENDIF
     C                     Z-ADDF1SCFH    W1SCFH
      *
     C           F1SCTH    IFEQ *ZERO
     C                     Z-ADDW1SCFH    W1SCTH
     C                     ELSE
     C                     Z-ADDF1SCTH    W1SCTH
     C                     ENDIF
      *
     C           W1SCFD    IFEQ *ZERO
     C                     Z-ADD01        W1SCFD
     C                     ENDIF
     C           W1SCTD    IFEQ *ZERO
     C           K#AGDA    KLIST
     C                     KFLD           W1SCTY
     C                     KFLD           W1SCTM
     C           K#AGDA    SETGTAGDPL12
     C           K#AGDA    REDPEAGDPL12                  98
     C           *IN98     IFEQ *OFF
     C                     Z-ADDF8KADD    W1SCTD
     C                     ELSE
     C                     Z-ADD31        W1SCTD
     C                     ENDIF
     C                     ENDIF
      *
     C           W1SCFH    IFGT W1SCTH
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,2     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C           F1TOTM    IFEQ *ZERO
     C                     Z-ADD2359      F1TOTM
     C                     ENDIF
      *
     C           MSG       IFEQ *BLANK
     C           F1SCFH    IFEQ F1SCTH
     C           F1TOTM    IFLT F1FRTM
     C                     MOVEA'11'      *IN,33
     C                     MOVELERR,4     MSG
     C                     MOVE *ON       *IN49
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET20    BEGSR
      *
     C                     Z-ADDF1SCFH    FRDATE
     C           F1FRTM    MULT 100       FRTIME
     C                     Z-ADDF1SCTH    TODATE
     C           F1TOTM    MULT 100       TOTIME
      *
     C                     MOVEL*ON       *IN41
     C                     WRITECTL020
     C                     MOVEL*OFF      *IN41
     C                     MOVEL*OFF      *IN42
     C                     Z-ADD*ZERO     RRN2    40
      *
     C                     Z-ADD*ZERO     C2ACNT
      *
      * CLOSE AND CLEAR TOTAL WORKFILE...THEN REOPEN
      *
     C                     CLOSEAM#WP45P
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AM#WP45P
      *
      * CLOSE AND CLEAR DETAIL WORKFILE...THEN REOPEN
      *
     C                     CLOSEAM#WP45D
      *
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,2     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AM#WP45D
      *
      * SET FILE CURSOR AND READ PALLET RETURN SCAN FILE...
      *
     C           K#P45     KLIST
     C                     KFLD           F1SCFH
      *
     C           K#P45     SETLLAM#PL45
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#PL45                  97
     C   97                LEAVE
      *
     C           D1DATE    IFGT W1SCTH
     C                     LEAVE
     C                     ENDIF
      *
     C                     Z-ADDD1SSHZ    SCDATE
     C                     Z-ADDD1SSTI    SCTIME
      *
      * IF SCAN DATE/TIME IS BETWEEN FROM AND TO DATE RANGE, WRITE TO W/FS
     C           SCANDT    IFGE FROMDT
     C           SCANDT    ANDLETODT
      *
     C                     MOVELD1USCD    WCODE   6
     C           WCODE     CHAINAM#WP45P             96
     C           *IN96     IFEQ *ON
     C                     CLEARAM#WP451
     C                     MOVELD1USCD    PRWKCD
     C                     MOVELD1USNM    PRWKNM
     C                     ENDIF
      *
     C                     ADD  1         PRA#PL
      *
     C  N96                UPDATAM#WP451
     C   96                WRITEAM#WP451
      *
      *
      *  WRITE TO DETAIL WORKFILE...
      *
     C                     CLEARAM#WP452
     C                     MOVELD1USCD    PRWKCD
     C                     MOVELD1USNM    PRWKNM
     C                     MOVELD1SSHZ    PRDATE
     C                     MOVELD1SSTI    PRTIME
      *
     C                     MOVELD1NAME    PRNAME
     C           D1DAMG    IFEQ 'Y'
     C                     MOVEL'Damaged' PRCOND
     C                     ELSE
     C                     MOVEL'Good'    PRCOND
     C                     ENDIF
      *
     C                     WRITEAM#WP452
      *
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      * NOW PROCESS TOTALS WORKFILE AND FILL SUBFILE...
      *
     C           *LOVAL    SETLLAM#WP45P
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#WP45P                 94
     C   94                LEAVE
      *
     C                     CLEARSFL020
     C                     MOVELPRWKNM    S2TMNM
     C                     Z-ADDPRA#PL    S2ACNT
     C                     MOVELPRWKCD    H2TMCD
      *
     C                     ADD  PRA#PL    C2ACNT
      *
     C                     ADD  1         RRN2
     C                     WRITESFL020
      *
     C                     ENDDO
      *
     C           RRN2      IFEQ *ZERO
     C                     SETON                     313249
     C           MSG       IFEQ *BLANK
     C                     MOVELERR,3     MSG
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN
      **************************************************************************
     C           #FMT20    BEGSR
      *
     C                     Z-ADD1         W#RNP2  40
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP2    #RCN02
     C                     EXFMTCTL020
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP2
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     OTHER
     C                     EXSR #CHK20
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      **************************************************************************
      *     2ND SCREEN CHECK
      **************************************************************************
     C           #CHK20    BEGSR
      *
     C                     Z-ADD*ZERO     RRN2
      *
     C                     DO   *HIVAL
      *
     C                     ADD  1         RRN2
     C           RRN2      CHAINSFL020               93
     C   93                LEAVE
      *
     C           S2SEL     IFNE *BLANK
     C                     MOVEL*ON       *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     MOVEL*OFF      *IN52
     C                     EXSR #SET30
     C                     EXSR #FMT30
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C                     ENDIF
     C                     ELSE
     C                     MOVEL*OFF      *IN52
     C                     MOVEL*BLANK    S2SEL
     C                     UPDATSFL020
     C                     ENDIF
      *
     C                     ENDDO
      *
     C                     ENDSR
      *************************************************************************
      *     3RD SCREEN SET
      **************************************************************************
     C           #SET30    BEGSR
      *
     C                     MOVEL*ON       *IN61
     C                     WRITECTL030
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN3    40
      *
     C                     MOVEL*ON       *IN63
     C                     MOVEL*OFF      *IN71
      *
     C                     MOVELS2TMNM    C3TMNM
     C                     Z-ADDS2ACNT    C3ACNT
      *
     C                     MOVELH2TMCD    WKCD    6
     C           K#WD2A    KLIST
     C                     KFLD           WKCD
      *
     C           K#WD2A    SETLLAM#WP45D
      *
     C                     DO   *HIVAL
      *
     C           K#WD2A    READEAM#WP45D                 97
     C   97                LEAVE
      *
     C                     CLEARSFL030
     C                     Z-ADDPRDATE    S3DATE
      *
     C                     MOVELPRTIME    W8TIHH
     C                     MOVEL':'       W8@DY1
     C                     MOVE PRTIME    W8TIMM
     C                     MOVELW8TIME    S3TIME
      *
     C                     MOVELPRNAME    S3NAME
     C                     MOVELPRCOND    S3COND
      *
     C                     ADD  1         RRN3
     C                     WRITESFL030
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      *************************************************************************
      *     3RD SCREEN(TM,DATE DETAIL)
      **************************************************************************
     C           #FMT30    BEGSR
      *
     C                     Z-ADD1         W#RNP3  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     SETON                     4748
     C                     WRITEFMT099
     C                     Z-ADDW#RNP3    #RCN03
     C                     EXFMTCTL030
     C   KA
     COR KL                LEAVE
      *
     C  NKJ                MOVELN#MOD3    *IN63
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP3
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
DATE ERROR
FROM DATE  >  TO DATE
NO DATA FOUND!
TIME RANGE ERROR






** CMD
CLRPFM QTEMP/AM#WP45P
CLRPFM QTEMP/AM#WP45D
