     H            Y.                                    1
      ***AM#R24*****************************************************************
      *  LOADING VERIFICATION                                                  *
      *
      **************************************************************************
     FAM#PW24 CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFL010
     F                                              KINFDS @INFDS
     FAM#PL06 IF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAM#PL21 IF  E           K        DISK
     FAM#WP24 UF  E           K        DISK                      A
      **************************************************************************
     E                    MAN      9999 50
     E                    ERR     1  10 70
     E                    CMD     1   1 70
      **************************************************************************
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      * SYSTEM TIME
     I            DS
     I                                        1  140WSDT
     I                                        1   60WSSTM6
     I                                        1   40WSSTM4
     I                                        1   20WSSHHH
     I                                        3   40WSSNNN
     I                                        5   60WSSSSS
     I                                        7  140WSSDAT
     I                                        7  100WSSYYY
     I                                       11  120WSSMMM
     I                                       13  140WSSDDD
      * SHIP DATE
     I            DS
     I                                        1   80F1SHDT
     I                                        1   40F1SHYY
     I                                        5   60F1SHMM
     I                                        7   80F1SHDD
     I            DS
     I                                        1   80W1SHDT
     I                                        1   40W1SHYY
     I                                        5   60W1SHMM
     I                                        7   80W1SHDD
     I            DS
     I                                        1  50 MFBC
     I                                        1  43 MFFIL1
     I                                       44  44 MFSIDE
     I                                       45  50 MFFIL2
      **************************************************************************
      *                    MAIN ROUTINE
      **************************************************************************
     C           @@ID      DOWNE'99'
     C           @@ID      CASEQ'10'      #FMT10
     C           @@ID      CASEQ'15'      #FMT15
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      **************************************************************************
      *         INITIALIZE
      **************************************************************************
     C           *INZSR    BEGSR
      *
     C                     TIME           WSDT
      *
     C                     Z-ADD*ZERO     F1SHDT
     C                     MOVEL*BLANK    F1SURT
     C                     MOVEL*BLANK    MSG
      *
     C                     MOVEL'10'      @@ID    2
     C                     MOVEL*OFF      *IN49
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN(SHIP DATE)
      **************************************************************************
     C           #FMT10    BEGSR
      *
     C                     SETOF                     4748
     C                     WRITEFMT099
     C                     EXFMTFMT010
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      @@ID
     C                     OTHER
     C                     EXSR #CHK10
     C           *IN49     IFEQ *OFF
     C                     EXSR #SET15
     C                     MOVEL'15'      @@ID
     C                     ENDIF
     C           *IN49     IFEQ *ON
     C                     MOVEL'10'      @@ID
     C                     ENDIF
     C                     ENDSL
      *
     C                     ENDSR
      *************************************************************************
      *     1ST SCREEN CHECK
      **************************************************************************
     C           #CHK10    BEGSR
      *
     C                     SETOF                     313249
     C                     TIME           WSDT
      *
     C           F1SHDT    IFEQ *ZERO
     C                     SETON                     3149
     C                     MOVELERR,1     MSG
     C                     ENDIF
     C                     Z-ADDF1SHDT    W1SHDT
      *
     C           K#AGDA    KLIST
     C                     KFLD           W1SHYY
     C                     KFLD           W1SHMM
     C                     KFLD           W1SHDD
      *
     C           K#AGDA    CHAINAGDPL12              98
     C           *IN98     IFEQ *ON
     C                     SETON                     3149
     C                     MOVELERR,1     MSG
     C                     GOTO #EF10
     C                     ENDIF
      *
      *
     C           #EF10     ENDSR
      *************************************************************************
      *     2ND SCREEN SET
      **************************************************************************
     C           #SET15    BEGSR
      *
     C                     MOVE 'N'       LOADED  1
     C                     MOVEL*ON       *IN61
     C                     WRITECTL010
     C                     MOVEL*OFF      *IN61
     C                     MOVEL*OFF      *IN62
     C                     Z-ADD*ZERO     RRN1    40
      *
      * close and clear workfile before recreating.
      *
     C                     CLOSEAM#WP24
     C           P#CMD     PLIST
     C                     PARM           P@CMD 256
     C                     PARM           P@LEN  155
     C                     Z-ADD70        P@LEN
     C                     MOVELCMD,1     P@CMD
     C                     CALL 'QCMDEXC' P#CMD
     C                     OPEN AM#WP24
      *
      * start with getting all rcds for selected routes and ship date.
      *
     C                     MOVELF1SHDT    F1DATE  8
     C                     MOVEA*BLANKS   MAN
     C                     Z-ADD*ZERO     IX
      *
     C           KEY1      KLIST
     C                     KFLD           F1DATE
      *
     C           KEY2      KLIST
     C                     KFLD           F1DATE
     C                     KFLD           F1SURT
      *
      * if truck/route is blank, then select all trucks/routes.
     C           F1SURT    IFEQ *BLANKS
     C           KEY1      SETLLAM#PL06
     C                     ELSE
     C           KEY2      SETLLAM#PL06
     C                     ENDIF
      *
     C                     DO   *HIVAL
      *
     C           F1SURT    IFEQ *BLANKS
     C           KEY1      READEAM#PL06                  97
     C                     ELSE
     C           KEY2      READEAM#PL06                  97
     C                     ENDIF
      *
     C   97                LEAVE
      *
     C           R1HNTE    IFEQ 'NG'
     C           R1SKJY    OREQ 'D'
     C           R1EXCD    OREQ '12'
     C                     ITER
     C                     ENDIF
      *
     C                     MOVELR1MFBC    MFBC
     C                     MOVE 'A'       MFSIDE
      *
     C           MFBC      LOKUPMAN                      88
     C           *IN88     IFEQ *OFF
     C                     ADD  1         IX      40
     C                     MOVELMFBC      MAN,IX
     C                     ELSE
     C                     ITER
     C                     ENDIF
      *
      *
      *  check load file to see if manifest has been scanned to a truck.
      *        only write to wf if not scanned to a truck or it was overridden
      *        to a different truck.
      *
     C                     MOVE *BLANKS   R2F5OV
     C                     MOVE *BLANKS   R2SURT
     C                     MOVE *BLANKS   R2SHID
     C                     MOVE *BLANKS   R2SKJY
      *
     C           R1MFBC    CHAINAM#PL21              96
     C           *IN96     IFEQ *OFF
     C           R2SKJY    ANDEQ' '
     C                     MOVE 'Y'       LOADED
     C           R2F5OV    IFEQ 'Y'
     C                     SETON                     96
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN96     IFEQ *ON
     C                     CLEARAM#WP241
     C                     MOVELR1SHID    LVSHID
     C                     MOVELR1SURT    LVSURT
     C                     MOVELR1IAFP    LVIAFP
     C                     MOVELR1SMEI    LVSMEI
     C                     MOVELR1DOCK    LVDOCK
     C                     MOVELR1ORD#    LVORD#
     C                     MOVELR1PALT    LVPALT
     C                     MOVELR1MFBC    LVMFBC
     C           R2F5OV    IFEQ 'Y'
     C                     MOVE R2F5OV    LVF5OV
     C                     MOVE R2SURT    LVPSUR
     C                     MOVE R2SHID    LVPSHD
     C                     ENDIF
      *
     C                     WRITEAM#WP241
     C                     ENDIF
      *
     C                     ENDDO
      *
      *
      * now read workfile and write to subfile to be displayed.
      *
     C           *LOVAL    SETLLAM#WP24
      *
     C                     DO   *HIVAL
      *
     C                     READ AM#WP24                  94
     C   94                LEAVE
      *
     C                     CLEARSFL010
     C                     Z-ADDLVSHID    S1SHDT
     C                     MOVELLVSURT    S1SURT
     C                     MOVELLVIAFP    S1IAFP
     C                     MOVELLVSMEI    S1SMEI
     C                     MOVELLVDOCK    S1DOCK
     C                     MOVELLVORD#    S1ORD#
     C                     MOVELLVPALT    S1PALT
     C                     MOVELLVPSUR    S1OVRT
     C                     Z-ADDLVPSHD    S1OVSH
      *
     C                     ADD  1         RRN1
     C                     WRITESFL010
      *
     C                     ENDDO
      *
     C           RRN1      IFEQ *ZERO
     C           MSG       IFEQ *BLANK
     C                     SELEC
     C           LOADED    WHEQ 'N'
     C                     SETON                     313249
     C                     MOVELERR,3     MSG
     C           LOADED    WHEQ 'Y'
     C                     SETON                         49
     C                     MOVELERR,4     MSG
     C                     ENDSL
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDSR
      *************************************************************************
      *     2ND SCREEN DISPLAY
      **************************************************************************
     C           #FMT15    BEGSR
      *
     C                     Z-ADD1         W#RNP1  40
     C                     MOVEL*OFF      *IN49
      *
     C                     DO   *HIVAL
      *
     C                     MOVEL*OFF      *IN47
     C                     MOVEL*ON       *IN48
     C                     WRITEFMT099
     C                     Z-ADDW#RNP1    #RCN01
     C                     EXFMTCTL010
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP1
     C                     ENDIF
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      *IN49
      *
     C                     SELEC
     C           *INKA     WHEQ *ON
     C                     MOVEL'99'      @@ID
     C                     LEAVE
     C           *INKL     WHEQ *ON
     C                     MOVEL'10'      @@ID
     C                     LEAVE
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *
      **************************************************************************
** ERR
DATE ERROR
ERROR 2
NO DATA FOUND!
ALL LOADED






** CMD
CLRPFM QTEMP/AM#WP24
