     H            Y.
     F** AM#R64  *******************************************
     F* PACKING PROGRESS                                   *
     F*      ITS.        2015.06.23                        *
     F******************************************************
     FAM#WP63 IF  E           K        DISK
     FAM#WP64 UF  E           K        DISK                      A
     FAM#PL02 IF  E           K        DISK
     E                    WCD        99 10
      *
     I            DS
     I                                        1  140W3AST
     I                                        1   80W3ASTD
     I                                        9  140W3ASTT
      *
     I            DS
     I                                        1  140W3AED
     I                                        1   80W3AEDD
     I                                        9  140W3AEDT
      *
     I            DS
     I                                        1  140W4AST
     I                                        1   80W4ASTD
     I                                        9  140W4ASTT
      *
     I            DS
     I                                        1  140W4AED
     I                                        1   80W4AEDD
     I                                        9  140W4AEDT
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1DATE  8
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     READ AM#WP631                 81
     C           *IN81     DOWEQ'0'
     C                     EXSR #SB500
     C                     READ AM#WP631                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-----------------------------------------------------
      *  AM#WP64
      *-----------------------------------------------------
     CSR         #SB500    BEGSR
      *
     C           KEY33     KLIST
     C                     KFLD           W3FIXD
     C                     KFLD           W3FIXT
     C                     KFLD           W3TRKB
     C                     KFLD           W3IAFB
     C                     KFLD           W3EXTR
      *
     C           KEY33     CHAINAM#WP641             24
     C           *IN24     IFEQ '0'
     C                     ADD  1         W4KPLT
     C           W3BOX     IFEQ W3SUMI
     C                     ADD  1         W4COMP
     C                     ELSE
     C                     ENDIF
     C           W4AST     IFEQ 0
     C                     Z-ADDW3AST     W4AST
     C                     ELSE
     C           W3AST     IFNE 0
     C           W3AST     ANDLTW4AST
     C                     Z-ADDW3AST     W4AST
     C                     ENDIF
     C                     ENDIF
     C           W3AED     IFGT W4AED
     C                     Z-ADDW3AED     W4AED
     C                     ENDIF
     C                     ADD  W3NOPC    W4NOPC
     C                     UPDATAM#WP641
     C                     ELSE
     C                     CLEARAM#WP641
     C                     Z-ADDW3FIXD    W4FIXD
     C                     Z-ADDW3FIXT    W4FIXT
     C                     MOVELW3SHD1    W4SHD1
     C                     MOVELW3SHT1    W4SHT1
     C                     MOVELW3SHD2    W4SHD2
     C                     MOVELW3SHT2    W4SHT2
     C                     MOVELW3SHD3    W4SHD3
     C                     MOVELW3SHT3    W4SHT3
     C                     MOVELW3TRKB    W4TRKB
     C                     MOVELW3IAFB    W4IAFB
     C                     Z-ADDW3EXTR    W4EXTR
     C                     MOVELW3SURT    W4SURT
     C                     Z-ADD1         W4KPLT
     C           W3BOX     IFEQ W3SUMI
     C                     Z-ADD1         W4COMP
     C                     ELSE
     C                     ENDIF
     C                     Z-ADDW3PSTD    W4PSTD
     C                     Z-ADDW3PSTT    W4PSTT
     C                     Z-ADDW3PEDD    W4PEDD
     C                     Z-ADDW3PEDT    W4PEDT
     C                     Z-ADDW3ASTD    W4ASTD
     C                     Z-ADDW3ASTT    W4ASTT
     C                     Z-ADDW3AEDD    W4AEDD
     C                     Z-ADDW3AEDT    W4AEDT
     C                     EXSR #SB510
     C                     Z-ADDX         W4WKCN
     C                     Z-ADDW3NOPC    W4NOPC
     C                     MOVELW3SHME    W4SHME
     C                     Z-ADDW3HKHZ    W4HKHZ
     C                     Z-ADDW3HKTI    W4HKTI
     C                     WRITEAM#WP641
     C                     ENDIF
      *
     CSR         ESB500    ENDSR
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB510    BEGSR
      *
     C           KEYMM     KLIST
     C                     KFLD           P1DATE
     C                     KFLD           W3IAFB
      *
     C                     Z-ADD0         X       40
     C                     CLEARWCD
     C           KEYMM     SETLLAM#PL021
     C           KEYMM     READEAM#PL021                 86
     C           *IN86     DOWEQ'0'
     C           R1SKJY    IFEQ 'D'
     C           R1SKHZ    ANDLE*DATE
     C                     ELSE
     C           R1HNTE    IFEQ 'OK'
     C                     EXSR #SB511
     C                     ENDIF
     C                     ENDIF
     C           KEYMM     READEAM#PL021                 86
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
      *-----------------------------------------------------
      *
      *-----------------------------------------------------
     CSR         #SB511    BEGSR
      *
     C           R1USCD    LOKUPWCD                      29
     C           *IN29     IFEQ '0'
     C                     ADD  1         X
     C                     MOVELR1USCD    WCD,X
     C                     ENDIF
      *
     CSR         ESB511    ENDSR
