     H            Y.
     F** AM#RC2 *********************************************
     F* YARD M/F                                            *
     F*             ITS.           2015.06.04               *
     F*******************************************************
     FAM#PWC2 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                              KINFDS INFDS
     FAM#PPC1 UF  E                    DISK                      A
     E                    YD         96  3
     E                    ER      1  20 60
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I            DS
     I                                        1   80ALSKHZ
     I                                        1   40ALSKYY
     I                                        5   60ALSKMM
     I                                        7   80ALSKDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
     I                                     *STATUS  @STTS
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     EXSR #SB110
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     Z-ADD0         X       30
     C                     CLEARYD
     C           1         SETLLAM#PPC11
     C                     READ AM#PPC11                 80
     C           *IN80     DOWEQ'0'
     C           RCSKJY    IFEQ 'D'
     C           RCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         X
     C                     MOVELRCYARD    YD,X
     C                     ENDIF
     C                     READ AM#PPC11                 80
     C                     ENDDO
      * CLEAR
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD1         @SFRC1
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE96
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     MOVELYD,X      S1YARD
     C                     WRITESFL
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     SETON                     7273
     C                     WRITEAM#PWC29
     C                     EXFMTSFLCTL
     C                     MOVEL*BLANK    D9ERR
      *
     C           *IN03     IFEQ '1'
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADD0         CNT     30
     C                     Z-ADD1         X       30
     C           X         DOWLE96
     C           X         CHAINSFL                  41
     C           *IN41     IFEQ '0'
     C           S1YARD    IFNE *BLANK
     C                     ADD  1         CNT
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
     C           CNT       IFEQ 0
     C                     MOVELER,1      D9ERR
     C                     SETON                     99
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB500
     C                     MOVEL'99'      DSPSW
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     EXSR #DLT
     C                     EXSR #WRT
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      * DELETE                                             *
      *----------------------------------------------------*
     CSR         #DLT      BEGSR
      *
     C           1         SETLLAM#PPC11
     C                     READ AM#PPC11                 80
     C           *IN80     DOWEQ'0'
     C           RCSKJY    IFEQ 'D'
     C           RCSKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'D'       RCSKJY
     C                     Z-ADD*DATE     RCSKHZ
     C                     UPDATAM#PPC11
     C                     ENDIF
     C                     READ AM#PPC11                 80
     C                     ENDDO
      *
     CSR         EDLT      ENDSR
      *----------------------------------------------------*
      * ADD                                                *
      *----------------------------------------------------*
     CSR         #WRT      BEGSR
      *
     C                     Z-ADD1         X       30
     C                     CLEARYD
     C           X         DOWLE96
     C           X         CHAINSFL                  41
     C           *IN41     IFEQ '0'
     C           S1YARD    IFNE *BLANK
     C                     CLEARAM#PPC11
     C                     Z-ADD*DATE     RCKOHZ
     C                     TIME           RCKOTI
     C                     MOVELW#USER    RCKOME
     C                     MOVELS1YARD    RCYARD
     C                     WRITEAM#PPC11
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         EWRT      ENDSR
** ER
E-01 INPUT YARD#.
E-02
E-03
E-04
E-05
E-06
E-07
