     H            Y.
     F** AM#R71 *********************************************
     F* WORKING SHIFT M/F                                   *
     F*             ITS.           2015.06.04               *
     F*******************************************************
     FAM#PW71 CF  E                    WORKSTN
     FAM#PP71 UF  E           K        DISK                      A
     FAM#PP72 UF  E                    DISK                      A
     FAM#PP00 UF  E           K        DISK                      A
     E                    ER      1  20 60
     E                    SFT         5  1
     E                    ST          5  4 0
     E                    EN          5  4 0
     E                    SUN         5  1
     E                    MON         5  1
     E                    TUE         5  1
     E                    WED         5  1
     E                    THU         5  1
     E                    FRI         5  1
     E                    SAT         5  1
     E                    BST        12  4 0
     E                    BEN        12  4 0
      *
     I            DS
     I                                        1   5 SFT
     I                                        1   1 D1SFT1
     I                                        2   2 D1SFT2
     I                                        3   3 D1SFT3
     I                                        4   4 D1SFT4
     I                                        5   5 D1SFT5
      *
     I            DS
     I                                        1  200ST
     I                                        1   40D1STR1
     I                                        5   80D1STR2
     I                                        9  120D1STR3
     I                                       13  160D1STR4
     I                                       17  200D1STR5
      *
     I            DS
     I                                        1  200EN
     I                                        1   40D1END1
     I                                        5   80D1END2
     I                                        9  120D1END3
     I                                       13  160D1END4
     I                                       17  200D1END5
      *
     I            DS
     I                                        1   5 SUN
     I                                        1   1 D1SUN1
     I                                        2   2 D1SUN2
     I                                        3   3 D1SUN3
     I                                        4   4 D1SUN4
     I                                        5   5 D1SUN5
      *
     I            DS
     I                                        1   5 MON
     I                                        1   1 D1MON1
     I                                        2   2 D1MON2
     I                                        3   3 D1MON3
     I                                        4   4 D1MON4
     I                                        5   5 D1MON5
      *
     I            DS
     I                                        1   5 TUE
     I                                        1   1 D1TUE1
     I                                        2   2 D1TUE2
     I                                        3   3 D1TUE3
     I                                        4   4 D1TUE4
     I                                        5   5 D1TUE5
      *
     I            DS
     I                                        1   5 WED
     I                                        1   1 D1WED1
     I                                        2   2 D1WED2
     I                                        3   3 D1WED3
     I                                        4   4 D1WED4
     I                                        5   5 D1WED5
      *
     I            DS
     I                                        1   5 THU
     I                                        1   1 D1THU1
     I                                        2   2 D1THU2
     I                                        3   3 D1THU3
     I                                        4   4 D1THU4
     I                                        5   5 D1THU5
      *
     I            DS
     I                                        1   5 FRI
     I                                        1   1 D1FRI1
     I                                        2   2 D1FRI2
     I                                        3   3 D1FRI3
     I                                        4   4 D1FRI4
     I                                        5   5 D1FRI5
      *
     I            DS
     I                                        1   5 SAT
     I                                        1   1 D1SAT1
     I                                        2   2 D1SAT2
     I                                        3   3 D1SAT3
     I                                        4   4 D1SAT4
     I                                        5   5 D1SAT5
      *
     I            DS
     I                                        1  480BST
     I                                        1   40D1BST1
     I                                        5   80D1BST2
     I                                        9  120D1BST3
     I                                       13  160D1BST4
     I                                       17  200D1BST5
     I                                       21  240D1BST6
     I                                       25  280D1BST7
     I                                       29  320D1BST8
     I                                       33  360D1BST9
     I                                       37  400D1BSTA
     I                                       41  440D1BSTB
     I                                       45  480D1BSTC
      *
     I            DS
     I                                        1  480BEN
     I                                        1   40D1BEN1
     I                                        5   80D1BEN2
     I                                        9  120D1BEN3
     I                                       13  160D1BEN4
     I                                       17  200D1BEN5
     I                                       21  240D1BEN6
     I                                       25  280D1BEN7
     I                                       29  320D1BEN8
     I                                       33  360D1BEN9
     I                                       37  400D1BENA
     I                                       41  440D1BENB
     I                                       45  480D1BENC
      *
     I            DS
     I                                        1  140SDATE
     I                                        1   60WTIME
     I                                        7  140WDATE
      *
     I            DS
     I                                        1   80ALSKHZ
     I                                        1   40ALSKYY
     I                                        5   60ALSKMM
     I                                        7   80ALSKDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     TIME           SDATE
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL'1'       D1SFT1
     C                     MOVEL'2'       D1SFT2
     C                     MOVEL'3'       D1SFT3
     C                     MOVEL'4'       D1SFT4
     C                     MOVEL'5'       D1SFT5
     C                     EXSR #SB110
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB110    BEGSR
      *
     C                     CLEARST
     C                     CLEAREN
     C                     CLEARSUN
     C                     CLEARMON
     C                     CLEARTUE
     C                     CLEARWED
     C                     CLEARTHU
     C                     CLEARFRI
     C                     CLEARSAT
     C                     Z-ADD1         X       30
     C           X         DOWLE5
     C           SFT,X     CHAINAM#PP711             25
     C           *IN25     IFEQ '0'
     C                     MOVELR7STRT    ST,X
     C                     MOVELR7END     EN,X
     C                     MOVELR7SUN     SUN,X
     C                     MOVELR7MON     MON,X
     C                     MOVELR7TUE     TUE,X
     C                     MOVELR7WED     WED,X
     C                     MOVELR7THU     THU,X
     C                     MOVELR7FRI     FRI,X
     C                     MOVELR7SAT     SAT,X
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      * BREAK TIME
     C                     CLEARBST
     C                     CLEARBEN
     C                     Z-ADD0         X       30
     C           1         SETLLAM#PP721
     C                     READ AM#PP721                 25
     C           *IN25     DOWEQ'0'
     C           T7SKJY    IFEQ 'D'
     C           T7SKHZ    ANDLE*DATE
     C                     ELSE
     C                     ADD  1         X
     C                     MOVELT7STRT    BST,X
     C                     MOVELT7END     BEN,X
     C                     ENDIF
     C                     READ AM#PP721                 25
     C                     ENDDO
      * PULLING CYCLE
     C                     Z-ADD0         D1PULC
     C                     MOVEL'PULCYC'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD0VALU    D1PULC
     C                     ENDIF
      * PACKING CYCLE
     C                     Z-ADD0         D1PACC
     C                     MOVEL'PACCYC'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD0VALU    D1PACC
     C                     ENDIF
      * PACKING-PULLING BIN
     C                     Z-ADD0         D1PAPU
     C                     MOVEL'PACPUL'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD0VALU    D1PAPU
     C                     ENDIF
      * START TIME OF 1ST BIN
     C                     Z-ADD0         D11BIN
     C                     MOVEL'1BINST'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD0VALU    D11BIN
     C                     ENDIF
      * START SHIFT
     C                     Z-ADD0         D1STSF  50
     C                     MOVEL'STRSFT'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C           *IN20     IFEQ '0'
     C                     Z-ADDD0VALU    D1STSF
     C                     ENDIF
      *
     CSR         ESB110    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTAM#PW711
     C                     SETOF                     313233
     C                     SETOF                     343536
     C                     SETOF                     373839
     C                     SETOF                     414243
     C                     SETOF                     444599
     C                     SETOF                     515253
     C                     SETOF                     545556
     C                     SETOF                     575859
     C                     SETOF                     606162
     C                     MOVEL*BLANK    D1ERR
      *
     C           *IN01     IFEQ '1'
     C                     MOVEL'99'      DSPSW
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE5
     C           *IN99     ANDEQ'0'
     C                     EXSR #SB211
     C                     ADD  1         X
     C                     ENDDO
     C           *IN99     IFEQ '1'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE12
     C           *IN99     ANDEQ'0'
     C                     EXSR #SB221
     C                     ADD  1         X
     C                     ENDDO
     C           *IN99     IFEQ '1'
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           *IN05     IFEQ '1'
     C                     EXSR #SB500
     C                     EXSR #SB510
     C                     EXSR #SB520
     C                     MOVEL'99'      DSPSW
     C                     ENDIF
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB211    BEGSR
      *
     C           ST,X      IFEQ 0
     C           EN,X      ANDEQ0
     C                     EXSR #SB212
     C                     ELSE
     C                     EXSR #SB213
     C                     ENDIF
      *
     CSR         ESB211    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB212    BEGSR
      *
     C           SUN,X     IFEQ ' '
     C           MON,X     ANDEQ' '
     C           TUE,X     ANDEQ' '
     C           WED,X     ANDEQ' '
     C           THU,X     ANDEQ' '
     C           FRI,X     ANDEQ' '
     C           SAT,X     ANDEQ' '
     C                     ELSE
     C                     SETON                     333435
     C                     SETON                     363738
     C                     SETON                     3999
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,1      D1ERR
     C                     ENDIF
      *
     CSR         ESB212    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB213    BEGSR
      *
     C                     MOVE ST,X      MM      20
     C           ST,X      IFGE 2400
     C                     SETON                     3199
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
     C           MM        IFGE 60
     C                     SETON                     3199
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C                     MOVE EN,X      MM      20
     C           EN,X      IFGE 2400
     C                     SETON                     3299
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
     C           MM        IFGE 60
     C                     SETON                     3299
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           SUN,X     IFEQ ' '
     C           SUN,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3399
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           MON,X     IFEQ ' '
     C           MON,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3499
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           TUE,X     IFEQ ' '
     C           TUE,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3599
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           WED,X     IFEQ ' '
     C           WED,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3699
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           THU,X     IFEQ ' '
     C           THU,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3799
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           FRI,X     IFEQ ' '
     C           FRI,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3899
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     C           SAT,X     IFEQ ' '
     C           SAT,X     OREQ '*'
     C                     ELSE
     C                     SETON                     3999
     C           X         ADD  40        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,3      D1ERR
     C                     GOTO ESB213
     C                     ENDIF
      *
     CSR         ESB213    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB221    BEGSR
      *
     C           BST,X     IFEQ 0
     C           BEN,X     ANDEQ0
     C                     ELSE
     C                     EXSR #SB223
     C                     ENDIF
      *
     CSR         ESB221    ENDSR
      *----------------------------------------------------*
      * CHECK                                              *
      *----------------------------------------------------*
     CSR         #SB223    BEGSR
      *
     C                     MOVE BST,X     MM      20
     C           BST,X     IFGE 2400
     C                     SETON                     3199
     C           X         ADD  50        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB223
     C                     ENDIF
     C           MM        IFGE 60
     C                     SETON                     3199
     C           X         ADD  50        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB223
     C                     ENDIF
      *
     C                     MOVE BST,X     MM      20
     C           BEN,X     IFGE 2400
     C                     SETON                     3299
     C           X         ADD  50        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB223
     C                     ENDIF
     C           MM        IFGE 60
     C                     SETON                     3299
     C           X         ADD  50        Y       20
     C                     MOVEL'1'       *IN,Y
     C                     MOVELER,2      D1ERR
     C                     GOTO ESB223
     C                     ENDIF
      *
     CSR         ESB223    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * UPDATE                                             *
      *----------------------------------------------------*
     CSR         #SB500    BEGSR
      *
     C                     EXSR #DLT
     C                     EXSR #WRT
      *
     CSR         ESB500    ENDSR
      *----------------------------------------------------*
      * DELETE                                             *
      *----------------------------------------------------*
     CSR         #DLT      BEGSR
      *
     C           *LOVAL    SETLLAM#PP711
     C                     READ AM#PP711                 80
     C           *IN80     DOWEQ'0'
     C                     MOVEL'D'       R7SKJY
     C                     Z-ADD*DATE     R7SKHZ
     C                     UPDATAM#PP711
     C                     READ AM#PP711                 80
     C                     ENDDO
      *
     CSR         EDLT      ENDSR
      *----------------------------------------------------*
      * ADD                                                *
      *----------------------------------------------------*
     CSR         #WRT      BEGSR
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE5
     C           ST,X      IFEQ 0
     C           EN,X      ANDEQ0
     C                     ELSE
     C           SFT,X     CHAINAM#PP711             25
     C                     CLEARAM#PP711
     C                     Z-ADD*DATE     R7KOHZ
     C                     TIME           R7KOTI
     C                     MOVELW#USER    R7KOME
     C                     MOVELSFT,X     R7SFCD
     C                     MOVELST,X      R7STRT
     C                     MOVELEN,X      R7END
     C                     MOVELSUN,X     R7SUN
     C                     MOVELMON,X     R7MON
     C                     MOVELTUE,X     R7TUE
     C                     MOVELWED,X     R7WED
     C                     MOVELTHU,X     R7THU
     C                     MOVELFRI,X     R7FRI
     C                     MOVELSAT,X     R7SAT
     C           *IN25     IFEQ '0'
     C                     UPDATAM#PP711
     C                     ELSE
     C                     WRITEAM#PP711
     C                     ENDIF
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         EWRT      ENDSR
      *----------------------------------------------------*
      * UPDATE BREAK TIME                                  *
      *----------------------------------------------------*
     CSR         #SB510    BEGSR
      *
     C           1         SETLLAM#PP721
     C                     READ AM#PP721                 25
     C           *IN25     DOWEQ'0'
     C           T7SKJY    IFEQ 'D'
     C           T7SKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVEL'D'       T7SKJY
     C                     Z-ADD*DATE     T7SKHZ
     C                     UPDATAM#PP721
     C                     ENDIF
     C                     READ AM#PP721                 25
     C                     ENDDO
      *
     C                     Z-ADD1         X       30
     C           X         DOWLE12
     C           BST,X     IFEQ 0
     C           BEN,X     ANDEQ0
     C                     ELSE
     C                     CLEARAM#PP721
     C                     Z-ADD*DATE     T7KOHZ
     C                     TIME           T7KOTI
     C                     MOVELW#USER    T7KOME
     C                     Z-ADDBST,X     T7STRT
     C                     Z-ADDBEN,X     T7END
     C                     WRITEAM#PP721
     C                     ENDIF
     C                     ADD  1         X
     C                     ENDDO
      *
     CSR         ESB510    ENDSR
      *----------------------------------------------------*
      * CONSTANT VALUE                                     *
      *----------------------------------------------------*
     CSR         #SB520    BEGSR
      * PULLING CYCLE
     C                     MOVEL'PULCYC'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C                     Z-ADDD1PULC    D0VALU
     C           *IN20     IFEQ '0'
     C                     UPDATAM#PP001
     C                     ELSE
     C                     MOVELKEY       D0KEY
     C                     WRITEAM#PP001
     C                     ENDIF
      * PACKING CYCLE
     C                     MOVEL'PACCYC'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C                     Z-ADDD1PACC    D0VALU
     C           *IN20     IFEQ '0'
     C                     UPDATAM#PP001
     C                     ELSE
     C                     MOVELKEY       D0KEY
     C                     WRITEAM#PP001
     C                     ENDIF
      * PACKING-PULLING BIN
     C                     MOVEL'PACPUL'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C                     Z-ADDD1PAPU    D0VALU
     C           *IN20     IFEQ '0'
     C                     UPDATAM#PP001
     C                     ELSE
     C                     MOVELKEY       D0KEY
     C                     WRITEAM#PP001
     C                     ENDIF
      * START IAF TRUCK BIN#
     C                     MOVEL'1STBIN'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C                     Z-ADDD11BIN    D0VALU
     C           *IN20     IFEQ '0'
     C                     UPDATAM#PP001
     C                     ELSE
     C                     MOVELKEY       D0KEY
     C                     WRITEAM#PP001
     C                     ENDIF
      * START SHIFT
     C                     MOVEL'STRSFT'  KEY    10
     C           KEY       CHAINAM#PP001             20
     C                     Z-ADDD1STSF    D0VALU
     C           *IN20     IFEQ '0'
     C                     UPDATAM#PP001
     C                     ELSE
     C                     MOVELKEY       D0KEY
     C                     WRITEAM#PP001
     C                     ENDIF
      *
     CSR         ESB520    ENDSR
** ER
E-01 CAN NOT INPUT THIS SHIFT.
E-02 INPUT 00:00 - 23:59.
E-03 INPUT '*'.
E-04
E-05
E-06
E-07
