     H            Y.
     F** AM#R65  *******************************************
     F* PLAN START END                                     *
     F*      ITS.        2015.06.24                        *
     F******************************************************
     FAM#WP64 IF  E           K        DISK
      *
     I            DS
     I                                        1  140W4FI
     I                                        1   80W4FIXD
     I                                        9  140W4FIXT
      *
     I            DS
     I                                        1  140SVFI
     I                                        1   80SVFIXD
     I                                        9  140SVFIXT
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     Z-ADD0         WKBINS  30
     C                     Z-ADD0         SVFI   140
     C                     MOVEL*BLANK    SVSHID  8
     C                     READ AM#WP641                 80
     C           *IN80     IFEQ '0'
     C                     Z-ADDW4FI      SVFI   140
     C                     MOVELW4SHD1    SVSHID  8
     C                     ENDIF
     C           *IN80     DOWEQ'0'
     C           W4IAFB    IFNE *BLANK
     C                     ADD  1         WKBINS
     C                     ENDIF
     C           W4FI      IFNE SVFI
     C                     Z-ADDSVFIXD    P1FIXD
     C                     Z-ADDSVFIXT    P1FIXT
     C                     MOVELSVSHID    P1SHID
     C                     Z-ADDWKBINS    P1BINS
     C                     CALL 'AM#C91'
     C                     PARM           P1FIXD  80
     C                     PARM           P1FIXT  60
     C                     PARM           P1SHID  8
     C                     PARM           P1BINS  30
     C                     Z-ADDW4FI      SVFI   140
     C                     MOVELW4SHD1    SVSHID  8
     C                     Z-ADD0         WKBINS  30
     C                     ENDIF
     C                     READ AM#WP641                 80
     C                     ENDDO
      *
     C                     Z-ADDSVFIXD    P1FIXD
     C                     Z-ADDSVFIXT    P1FIXT
     C                     MOVELSVSHID    P1SHID
     C                     Z-ADDWKBINS    P1BINS
     C                     CALL 'AM#C91'
     C                     PARM           P1FIXD  80
     C                     PARM           P1FIXT  60
     C                     PARM           P1SHID  8
     C                     PARM           P1BINS  30
      *
     C                     SETON                     LR
     C                     RETRN
