     H            Y.
     F** AM#R28Z   ******************************************
     F* GET TRUCK INFO FOR ROUTE FROM SCS LOG FILE          *
     F*    LEC              2023.12.19                      *
     F*******************************************************
     FAM#PL403IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           ISUPP   5
     C                     PARM           ISURT   9
     C                     PARM           ISHID   8
     C                     PARM           ISHIT   6
     C                     PARM           OTRLR# 20
     C                     PARM           ODRNMF  9
     C                     PARM           ODRNML 12
     C                     PARM           OSCAC   6
     C                     PARM           OSEND   1
      *
     C           KEY403    KLIST
     C                     KFLD           ISURT
     C                     KFLD           SHID    80
     C                     KFLD           SHIT    60
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      *
     C                     MOVELISHID     SHID
     C                     MOVELISHIT     SHIT
      *
     C           KEY403    CHAINAM#PL403             55
     C           *IN55     IFEQ *OFF
     C                     MOVELL1TRLR    OTRLR#
     C                     MOVELL1DRFN    ODRNMF
     C                     MOVELL1DRLN    ODRNML
     C                     MOVELL1SCAC    OSCAC
     C                     MOVE 'Y'       OSEND
     C                     ELSE
     C                     MOVEL*BLANKS   OTRLR#
     C                     MOVEL*BLANKS   ODRNMF
     C                     MOVEL*BLANKS   ODRNML
     C                     MOVEL*BLANKS   OSCAC
     C                     MOVE 'N'       OSEND
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
