     H            Y.
     F** AM#REE *********************************************
     F* SHIPPING SCAN MENU FOR E/E LOG IN                   *
     F*    LEC.             2020.06.19                      *
JW1  F*    JW   2020.09.15  ADD DUMMY (TO DETECT INDIRECT CALL) *
     F***********************************************************
     FAM#PWEE CF  E                    WORKSTN
     E                    ER      1  11 65
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  14 SDATE
     I                                        1   6 STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 10
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD0         D1SEL
JW1  C                     GOTO ESB100
 |    ****************************************
 |    * UN-PROCESS LINE (FOR INDIRECT CALL)  *
 |    ****************************************
JW1  C                     CALL 'AM#C18'                   D1SEL=1
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*BLANK    WPGM    6
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           P1        PLIST
     C                     PARM           POPR    6
     C                     PARM           PUSR   10
      *
     C                     MOVELWORKER    POPR    6        SET WORKER ID
     C                     MOVELWUSRID    PUSR   10        SET WORKER NAME
      *
     C                     SELEC
      * ORIGINAL PAPERWORK SUPPLEMENTALS
     C           D1SEL     WHEQ 1
     C                     MOVEL'AM#C18'  WPGM
     C                     OTHER
     C                     SETON                     3199
     C                     MOVELER,1      MSG
     C                     EXSR #SB999
     C                     GOTO ESB210
     C                     ENDSL
      *
      * CALL PROCESS
     C                     CALL WPGM      P1
     C                     Z-ADD0         D1SEL
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
      *
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * ERR                                                *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
      *
     C                     MOVELMSG       P1ERR
     C                     CALL 'AM#R08'
     C                     PARM           P1ERR  25
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
      *
     CSR         ESB999    ENDSR
**
INPUT NO. ERR




