     H            Y.
     F** AM#R02O ********************************************
     F* RETURN #OF BOXES
     F*******************************************************
     FAL#PL0C IF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           P1NAMC  5
     C                     PARM           P1ORD# 12
     C                     PARM           P1NUKE  4
     C                     PARM           P1PALT  2
     C                     PARM           P1MROS  2
     C                     PARM           P2TOTL  30
     C                     PARM           P2SUMI  30
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C           KEY01     KLIST
     C                     KFLD           KKNAMC  5
     C                     KFLD           KKORD# 12
     C                     KFLD           KKNUKE  4
     C                     KFLD           KKPALT  2
      ****                 KFLD           KKMROS  2
      *
     C                     TIME           WTIME
      *
     C                     MOVELP1NAMC    KKNAMC
     C                     MOVELP1ORD#    KKORD#
     C                     MOVELP1NUKE    KKNUKE
     C                     MOVELP1PALT    KKPALT
      ****                 MOVELP1MROS    KKMROS
     C                     Z-ADD0         P2TOTL
     C                     Z-ADD0         P2SUMI
      *
     C           KEY01     SETLLAL#PL0C1
     C           KEY01     READEAL#PL0C1                 80
     C           *IN80     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLESDATE
     C                     ELSE
     C                     ADD  1         P2TOTL
     C           CAPLDT    IFNE 0
     C                     ADD  1         P2SUMI
     C                     ENDIF
     C                     ENDIF
     C           KEY01     READEAL#PL0C1                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
