     H            Y.
     F** AM#R30 **************************************
     F* INQ PASSWORD M/F
     F*     ITS.          2015.06.12                 *
     F************************************************
     FAM#PW30 CF  E                    WORKSTN
     F                                        RRN   KSFILE SFL
     F                                              KINFDS INFDS
     FAM#PP31 IF  E           K        DISK
     FALBPL30 IF  E           K        DISK
      *
     E                    ER      1  11 65
     E                    PG      1  10 30
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 ##USER
     I                                      264 269 W#JBNO
      *
     I              'SATURDAY'            C         CSAT
      *
     IINFDS       DS
     I                                    B 370 3710#CUR
     I                                    B 378 3790#POS
      *
      *----------------------------------------------------*
      * PLIST                                              *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      *   K  E  Y   L  I  S  T                             *
      *----------------------------------------------------*
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INIT                                               *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C           *ENTRY    PLIST
     C                     PARM           P1PGM   20
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * CONTROL                                            *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      * INQ                                                *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     Z-ADD1         WKPAGE  30
     C                     EXSR #CLR
      *
     C                     SETOF                     8166
     C           *LOVAL    SETLLAM#PP311
     C                     READ AM#PP311                 81
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AM#PP311                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     MOVE '02'      DSPSW
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      * SFL                                                *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C           CTRX      IFEQ 0
     C                     SETON                     72
     C                     SETON                     99
     C                     MOVELER,1      D9ERR
     C                     ELSE
     C                     SETON                     7273
     C                     ENDIF
      *
     C                     WRITEAM#PW309
     C                     EXFMTSFLCTL
     C                     SETOF                     7273
     C                     SETOF                     3199
     C                     MOVEL*BLANK    D9ERR
      * F3
     C           *IN03     IFEQ '1'
     C                     MOVE '99'      DSPSW
     C                     GOTO ESB220
     C                     ENDIF
      *
     C           CTRX      IFEQ 0
     C                     GOTO ESB220
     C                     ENDIF
      ******
      *
      ******
      *-----------------*
      * ROLLDOWN/PAGEUP *
      *-----------------*
     C           *IN52     IFEQ '1'
     C*                    ADD  1         CTRX
      * 1ST. PAGE
     C           WKPAGE    IFEQ 1
     C                     GOTO ESB220
     C                     ENDIF
      *-----------------*
     C           *IN81     IFEQ '1'
     C                     SETOF                     81
     C           *HIVAL    SETGTAM#PP311
     C                     READPAM#PP311                 81
     C                     SUB  1         CTRX
     C                     ENDIF
      *
     C                     ADD  15        CTRX
      *                         L--表示行数
     C                     SETOF                     6627
      *
     C           *IN81     DOWEQ'0'
     C           *IN27     ANDEQ'0'
     C                     EXSR #READP
     C                     READPAM#PP311                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXTP
     C                     ENDDO
      *
     C                     Z-ADD0         CTRX    40
      *
     C           *IN81     IFEQ '1'
     C           *LOVAL    SETLLAM#PP311
     C                     READ AM#PP311                 81
     C                     ENDIF
      *
     C                     EXSR #CLR
     C                     SETOF                     8166
      *
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AM#PP311                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     SUB  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *--------------------*
      * ROLL-UP            *
      *--------------------*
     C           *IN51     IFEQ '1'
     C           *IN81     ANDEQ'0'
      *
     C                     EXSR #CLR
      *
     C                     SETOF                     6681
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #READ
     C                     READ AM#PP311                 81
     C                     ENDDO
      * NEXT
     C                     SETOF                     66
     C           *IN81     DOWEQ'0'
     C           *IN66     ANDEQ'0'
     C                     EXSR #NEXT
     C                     ENDDO
      *
     C                     ADD  1         WKPAGE
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      * READ                                               *
      *----------------------------------------------------*
     CSR         #READ     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREAD
     C                     ENDIF
      *
     C                     EXSR #EDIT
     C                     ADD  1         RRN
     C                     ADD  1         @RRN
     C                     ADD  1         CTRX
     C                     WRITESFL
      *
     C           CTRX      IFEQ 15
     C                     SETON                       66
     C                     ENDIF
      *
     CSR         EREAD     ENDSR
      *----------------------------------------------------*
      * READP                                              *
      *----------------------------------------------------*
     CSR         #READP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ *BLANK
     C                     GOTO EREADP
     C                     ENDIF
      *
     C                     SUB  1         CTRX           27
      *
     CSR         EREADP    ENDSR
      *----------------------------------------------------*
      * SELECT                                             *
      *----------------------------------------------------*
     CSR         #SELEC    BEGSR
      *
     C           R3SKJY    IFEQ 'D'
     C                     GOTO ESELEC
     C                     ENDIF
      *
     C                     MOVEL'1'       WKGET
      *
     CSR         ESELEC    ENDSR
      *----------------------------------------------------*
      * CLEAR                                              *
      *----------------------------------------------------*
     CSR         #CLR      BEGSR
      *
     C                     SETON                     71
     C                     WRITESFLCTL
     C                     SETOF                     7166
     C                     Z-ADD0         RRN     30
     C                     Z-ADD0         @RRN    40
     C                     Z-ADD0         CTRX    40
     C                     Z-ADD1         @SFRC1
      *
     CSR         ECLR      ENDSR
      *----------------------------------------------------*
      * EDIT                                               *
      *----------------------------------------------------*
     CSR         #EDIT     BEGSR
      *
     C                     MOVELR3WKCD    S1WKCD
     C                     MOVEL*BLANK    S1WKNM 20
     C           R3WKCD    CHAINALBPL301             21
     C           *IN21     IFEQ '0'
     C                     MOVELALWKNM    S1WKNM
     C                     ENDIF
     C                     MOVEL*BLANK    S1PGM
     C           R3PGM1    IFEQ '1'
     C           S1PGM     CAT  PG,1:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM2    IFEQ '1'
     C           S1PGM     CAT  PG,2:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM3    IFEQ '1'
     C           S1PGM     CAT  PG,3:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM4    IFEQ '1'
     C           S1PGM     CAT  PG,4:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM5    IFEQ '1'
     C           S1PGM     CAT  PG,5:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM6    IFEQ '1'
     C           S1PGM     CAT  PG,6:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM7    IFEQ '1'
     C           S1PGM     CAT  PG,7:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM8    IFEQ '1'
     C           S1PGM     CAT  PG,8:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGM9    IFEQ '1'
     C           S1PGM     CAT  PG,9:1    S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
     C           R3PGMA    IFEQ '1'
     C           S1PGM     CAT  PG,10:1   S1PGM
     C           S1PGM     CAT  ',':0     S1PGM
     C                     ENDIF
      *
     CSR         EEDIT     ENDSR
      *----------------------------------------------------*
      * NEXT                                               *
      *----------------------------------------------------*
     CSR         #NEXT     BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXT
     C                     ENDIF
      *
     C                     READ AM#PP311                 81
      *
     CSR         ENEXT     ENDSR
      *----------------------------------------------------*
      * PRV                                                *
      *----------------------------------------------------*
     CSR         #NEXTP    BEGSR
      *
     C                     MOVEL*BLANK    WKGET   1
     C                     EXSR #SELEC
     C           WKGET     IFEQ '1'
     C                     SETON                     66
     C                     GOTO ENEXTP
     C                     ENDIF
      *
     C                     READPAM#PP311                 81
      *
     CSR         ENEXTP    ENDSR
**
ER-1 NO DATA.
ER-2 INPUT 1.
** PGM
SHIPPING
CONVEYANCE
PACKING
HEAT TREAT
5
6
7
8
9
10
