     H            Y.
     F** AM#R21M ********************************************
     F* UPDATE PACKING FILE WITH MANIFEST# IN ORDER FILE
     F*    LEC.             2024.10.08                                         *
     F**************************************************************************
     FAM#PL08 UF  E           K        DISK
     FAB#PL19BIF  E           K        DISK
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I            DS
     I                                        1  20 BAMHN
     I                                        1   5 BAMHN1
     I                                        6  10 BAMHN2
     I                                       11  15 BAMHN3
     I                                       16  20 BAMHN4
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           ITOKU   40
     C                     PARM           INONY   40
     C                     PARM           INUKE   2
     C                     PARM           IORDN  12
     C                     PARM           IPALT   2
      *
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
      *
     C           KEY08     KLIST
     C                     KFLD           INONY
     C                     KFLD           INUKE
     C                     KFLD           IORDN
     C                     KFLD           IPALT
      *
     C           KEY19B    KLIST
     C                     KFLD           ITOKU
     C                     KFLD           INONY
     C                     KFLD           NUKE4   4
     C                     KFLD           INVN   16
     C                     KFLD           K@SKJY  1
      *
     C                     TIME           WTIME
      *
     C           INONY     IFNE 3503
      *
      *
      * update all packing file records for this order...
     C           KEY08     SETLLAM#PL08
     C           KEY08     READEAM#PL08                  50
      *
     C           *IN50     DOWEQ*OFF
      *
     C           R1SKJY    IFEQ ' '
     C           R1HNTE    ANDEQ'OK'
     C                     MOVEL*BLANKS   ##MAN#
     C                     EXSR #MANI
     C           ##MAN#    IFNE *BLANKS
     C                     Z-ADDSDATE     R1KOHZ
     C                     Z-ADDSTIME     R1KOTI
     C                     MOVELW#USER    R1KOME
     C                     MOVELW#PGM     R1KPGM
     C                     MOVEL##MAN#    R1MAN#    P
     C                     UPDATAM#PL071
     C                     ENDIF
     C                     ENDIF
      *
     C           KEY08     READEAM#PL08                  50
     C                     ENDDO
      *
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
      ***********************************************************
      *  GET MANIFEST NUMBER FROM ORDER FILE.
      ***********************************************************
     C           #MANI     BEGSR
      *
      * get the manifest number from the order file...
     C                     MOVELINUKE     NUKE4     P
     C                     MOVELIORDN     INVN      P
      *
     C           KEY19B    SETLLAB#PL19B
     C           KEY19B    READEAB#PL19B                 50
      *
     C           *IN50     DOWEQ*OFF
     C           BAMHN     IFEQ R12HN
     C                     MOVELBAODRN    ##MAN# 10
     C                     LEAVE
     C                     ENDIF
     C           KEY19B    READEAB#PL19B                 50
     C                     ENDDO
      *
     C                     ENDSR
      *
      ***********************************************************
