     H            Y.
     F** AM#R15 *********************************************
     F* DOCK LABEL                                          *
     F*    ITS.             2015.06.01                      *
     F*******************************************************
     FAM#PW15 CF  E                    WORKSTN
     FAL#PL08 IF  E           K        DISK
     E                    ER      1  11 65
      *
     IB2D         DS
     I                                        1  25 BAR01
     I                                       26  50 BAR02
     I                                       51  72 BAR03
     I                                       76 100 BAR04
     I                                      101 125 BAR05
     I                                      126 150 BAR06
     I                                      151 175 BAR07
     I                                      176 200 BAR08
     I                                      201 225 BAR09
     I                                      226 250 BAR10
      * DOCK LABEL
     I            DS
     I                                        1  40 DOCKLB
     I                                        1   5 DONAMC
     I                                        6  10 DOSUPC
     I                                       11  12 DODOCK
     I                                       13  24 DOORD#
     I                                       25  36 DOMART
     I                                       37  38 DOPALT
     I                                       39  40 DOMROS
      *
     I            DS
     I                                        1  140WTIME
     I                                        7  140SDATE
     I                                        1   60STIME
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
     C           *ENTRY    PLIST
     C                     PARM           WORKER  6
     C                     PARM           WUSRID 10
     C                     PARM           PCMD    2
      *----------------------------------------------------*
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     C                     EXSR #SB100
     C           DSPSW     DOUEQ'99'
     C                     EXSR #SB200
     C                     ENDDO
     C                     EXSR #SB300
      *----------------------------------------------------*
      * INZ                                                *
      *----------------------------------------------------*
     CSR         #SB100    BEGSR
      *
     C                     TIME           WTIME
     C                     MOVEL'01'      DSPSW   2
     C                     MOVEL*BLANK    PCMD    2
     C                     MOVELWORKER    USRCD   6
     C                     CLEARB2D
      *
     CSR         ESB100    ENDSR
      *----------------------------------------------------*
      * MAIN                                               *
      *----------------------------------------------------*
     CSR         #SB200    BEGSR
      *
     C           DSPSW     DOWEQ'01'
     C                     EXSR #SB210
     C                     ENDDO
      *
     C           DSPSW     DOWEQ'02'
     C                     EXSR #SB220
     C                     ENDDO
      *
     CSR         ESB200    ENDSR
      *----------------------------------------------------*
      *ＤＯＣＫ　ＬＡＢＥＬ                              *
      *----------------------------------------------------*
     CSR         #SB210    BEGSR
      *
     C                     EXFMTDSP01
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     MOVEL'03'      PCMD    2
     C                     MOVEL'99'      DSPSW   2
     C                     GOTO ESB210
     C                     ENDIF
      *
     C           B2D       IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,2      MSG
     C                     EXSR #SB999
     C                     CLEARB2D
     C                     GOTO ESB210
     C                     ENDIF
      *
     C                     MOVELB2D       DOCKLB
     C                     MOVEL*BLANK    D2IAFB
     C                     MOVEL*BLANK    D2IAFP
     C                     MOVEL*BLANK    D3IAFP
     C                     MOVEL*BLANK    D4IAFP
     C                     MOVEL*BLANK    D5IAFP
     C                     EXSR #SB400
      *
     C                     MOVEL'02'      DSPSW   2
      *
     CSR         ESB210    ENDSR
      *----------------------------------------------------*
      *ＤＯＣＫ　ＬＡＢＥＬ                              *
      *----------------------------------------------------*
     CSR         #SB220    BEGSR
      *
     C                     EXFMTDSP02
     C                     MOVEL*BLANK    MSG
     C                     SETOF                     3199
      *
     C                     TIME           WTIME
     C           *IN03     IFEQ '1'
     C                     CLEARB2D
     C                     MOVEL'01'      DSPSW   2
     C                     GOTO ESB220
     C                     ENDIF
      *
     CSR         ESB220    ENDSR
      *----------------------------------------------------*
      * END                                                *
      *----------------------------------------------------*
     CSR         #SB300    BEGSR
     C                     SETON                     LR
     C                     RETRN
     CSR         ESB300    ENDSR
      *----------------------------------------------------*
      *                                                    *
      *----------------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYCA     KLIST
     C                     KFLD           DOORD#
     C                     KFLD           DODOCK
     C                     KFLD           DOPALT
     C           KEYCA     SETLLAL#PL081
     C           KEYCA     READEAL#PL081                 83
     C           *IN83     DOWEQ'0'
     C           CASKJY    IFEQ 'D'
     C           CASKHZ    ANDLE*DATE
     C                     ELSE
     C                     MOVELCAIAFB    D2IAFB
     C                     MOVELCAIAFP    D2IAFP
     C                     ENDIF
     C           KEYCA     READEAL#PL081                 83
     C                     ENDDO
      *
     CSR         ESB400    ENDSR
      *----------------------------------------------------*
      * ERR                                                *
      *----------------------------------------------------*
     CSR         #SB999    BEGSR
      *
     C                     MOVELMSG       P1ERR
     C                     CALL 'AM#R08'
     C                     PARM           P1ERR  25
     C                     SETOF                     3199
     C                     MOVEL*BLANK    MSG
      *
     CSR         ESB999    ENDSR
**
INPUT PALLET TICKET.
INPUT DOCK LABEL.
OTHER DOCK LABEL.
NO PALLET DATA.


