     H            Y.
     F** AN#R3H ********************************************
     F*  ANDROID CREATE PACKING SLIP W/F                   *
     F*                                                    *
     F* TCHK1 07/18/06 CREATE(COPY FROM AB#R3H)            *
     F******************************************************
     FAB#PL14 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAN#WPF0 O   F     100            DISK
     I* SHIPPING DATE(PARAMETER)
     I            DS
     I                                        1   80WNOHZ
     I                                        1   40WNOYY
     I                                        5   60WNOMM
     I                                        7   80WNODD
     I* RELEASED DATE(PARAMETER)
     I            DS
     I                                        1   80WREDT
     I                                        1   40WREYY
     I                                        5   60WREMM
     I                                        7   80WREDD
     I            DS
     I                                        1  12 BASHIN
     I                                        1   5 BASHN1
     I                                        6  10 BASHN2
     I                                       11  12 BASHN3
     I            DS
     I                                        1   80A2GSHZ
     I                                        1   40A2GSYY
     I                                        5   60A2GSMM
     I                                        7   80A2GSDD
     I            DS
     I                                        1   80A2SYHZ
     I                                        1   40A2SYYY
     I                                        5   60A2SYMM
     I                                        7   80A2SYDD
      * AB#PL14
     C           KEY1      KLIST
     C                     KFLD           WNOYY
     C                     KFLD           WNOMM
     C                     KFLD           WNODD
     C                     KFLD           WNOBN
     C                     KFLD           WREYY
     C                     KFLD           WREMM
     C                     KFLD           WREDD
     C                     KFLD           WNONY   40
     C                     KFLD           PSIRK
     C                     KFLD           PDOCK
      * FCEPL11
     C           KEY2      KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
      *
     C           *ENTRY    PLIST
     C                     PARM           PSIRE   4        DELIVERY CODE
     C                     PARM           PSIRK   1        FACTORY
     C                     PARM           PNOHZ   80       SHIP DATE
     C                     PARM           PREDT   80       RELEASED DATE
     C                     PARM           PNOBI   20       BIN
     C                     PARM           PDOCK   4        DOCK
     C                     PARM           PINV#  11        INVOICE #
      *
     C                     MOVE PNOHZ     WNOHZ            DELIVERY DATE
     C                     Z-ADDPNOBI     WNOBN   20       BIN
     C                     MOVE PREDT     WREDT            RELEASED DATE
     C                     MOVE PSIRE     WNONY            DELIVERY CD
      *
     C           KEY1      SETLLAB#PL141
      *
     C                     DO   *HIVAL
      *
     C           KEY1      READEAB#PL141                 10
     C   10                LEAVE
      *
     C           BASKJY    IFEQ 'D'
     C**JW       BASKHZ    ANDLE*DATE
     C                     ITER
     C                     END
     C           PNOBI     IFNE BANOBN
     C                     ITER
     C                     END
      *
     C* GET QTY./CONT. FROM PART MASTER
     C                     MOVELBATOKU    PTOKU   4
     C                     MOVELBANONY    PNONY   4
     C                     MOVELBANKOJ    PNKOJ   1
     C                     MOVELBANUKE    PNUKE   4
     C                     MOVELBAMHIN    @MHIN  20
     C                     MOVEL*BLANK    @SHIN  12
     C                     MOVEL*BLANK    @FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           PTOKU   4
     C                     PARM           PNONY   4
     C                     PARM           PNKOJ   1
     C                     PARM           PNUKE   4
     C                     PARM           @MHIN  20
     C                     PARM           @SHIN  12
     C                     PARM           @FLG    1
      *
     C                     MOVE @SHIN     BASHIN
      *
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    WSYOS   60
     C                     ELSE
     C           BASYOS    IFNE *ZERO
     C                     Z-ADDBASYOS    WSYOS
     C                     ELSE
     C           KEY2      CHAINFCEPL011             70
     C           *IN70     IFEQ '0'
     C           *DATE     IFGE A2SYHZ
     C                     Z-ADDA2SSYS    WSYOS
     C                     ELSE
     C                     Z-ADDA2KSYS    WSYOS
     C                     END
     C                     END
     C           WSYOS     IFEQ *ZERO
     C                     Z-ADD1         WSYOS
     C                     END
     C                     END
     C                     END
     C*
     C           BASRYO    DIV  WSYOS     IHAKO   30
     C                     MVR            WRST    30
     C           WRST      IFNE *ZERO
     C                     ADD  1         IHAKO
     C                     END
      *
     C                     MOVELBAINVN    PINV#
      *
     C* SELECETED ALL DOCK
     C                     SETON                     U1
     C                     EXCPTDT
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *
     OAN#WPF0 E                DT
     O                         BANOHZ     8
     O                         BANOBN    12
     O                         BASIRE    16
     O                         BASIRK    17
     O                         BANUKE    21
     O                         BAODRN    31
     O                         BASBAN    35
     O                         BAMHIN    55
     O                         BASRYO    65
     O                         WSYOS     71
     O                         BASHIN    83
     O                         BATOKU    87
     O                         BANONY    91
     O                         BANKOJ    92
     O                         IHAKO     95
