     H            Y.
     F** AN#R0E ********************************************
     F*  ANDROID ORDER MAKING EDI WORK FILE(1 PROCESS)     *
     F*                                                    *
     F* TCHK1 07/10/06 CREATE(CPOY FROM AB#R0E)            *
     F******************************************************
     FAB#EP51 IP  E                    DISK
     FABRAP01 UF  E           K        DISK                      A
     FABRAL01 IF  E           K        DISK
     FABR1L01 UF  E           K        DISK                      A
     FAB#PPCT UF  E           K        DISK                      A
      ****************************************************
     E                    IPAR       30  1
     E                    OPAR       20  1
      ****************************************************
     I            DS
     I                                        1  120WTMDT
     I                                        1   60WTIME
     I                                        7  120WDATE
      ****************************************************
     C                     MOVE A5REF#    K@REF#
      *
     C           KEY2      CHAINABR1P011             94
     C   94                CLEARABR1P011
      *
     C                     Z-ADDWTIME     AFTIME
     C                     Z-ADDWDATE     AFDATE
     C                     MOVELA5PART    AFPART           BUYER PART #
     C* ANDROID PART  --> NO BLANK PART
     C                     MOVEAA5PART    IPAR
     C                     MOVE *BLANK    OPAR
     C                     Z-ADD0         M       20
     C*
     C           1         DO   30        N       20
     C           IPAR,N    IFNE *BLANK
     C           IPAR,N    ANDNE'-'
     C                     ADD  1         M
     C                     MOVE IPAR,N    OPAR,M
     C                     ENDIF
     C                     ENDDO
     C*
     C                     MOVEAOPAR      AFIPAR
     C                     MOVE A5REF#    AFREF#
     C                     MOVE A5SPCD    AFSPCD
     C                     Z-ADDA5SIDT    AFSIDT
     C                     Z-ADDA5HSDT    AFHSDT
     C                     Z-ADDA5HEDT    AFHEDT
     C                     MOVELA5POR#    AFPOR#
     C                     MOVE A5STIQ    AFSTIQ
     C                     MOVE A5STID    AFSTID
     C                     MOVE A5IDCD    AFIDCD
     C                     MOVE A5TSID    AFTSID
     C                     MOVE A5TPCD    AFTPCD
     C                     MOVE A5PKCD    AFPKCD
     C*** UNT
     C                     MOVE A5UBM1    AFUBM1           UNIT OF BASIS CODE
     C*** REF
     C           A5DOCK    IFNE *BLANK
     C           A5DOCK    ANDNE'__'
     C                     MOVELA5DOCK    AFDOCK           DOCK CODE
     C                     ELSE
     C                     MOVEL'00  '    AFDOCK
     C                     ENDIF
      *
     C                     MOVELA5ALFL    AFALFL           ASB. LINE FEED LOC
     C                     MOVELA5RALF    AFRALF           RESERVE ASB. LIN FED
     C                     MOVELA5EXCD    AFEXCD           CONTACT CODE(EX)
     C                     MOVELA5RDCD    AFRDCD           CONTACT CODE(RD)
     C                     Z-ADDA5LSDT    AFLSDT           LAST SHIP DATE
     C                     Z-ADDA5LSQY    AFLSQY           LAST SHIP QTY
     C                     Z-ADDA5YSDT    AFYSDT           YTD CUM SHIP DATE
     C                     Z-ADDA5YSQY    AFYSQY           YTD CUM SHIP QTY
     C                     Z-ADDA5YRDT    AFYRDT           YTD CUM RECE DATE
     C                     Z-ADDA5YRQY    AFYRQY           YTD CUM RECE QTY
     C                     Z-ADDA5DLDT    AFDLDT
     C                     Z-ADDA5QTY2    AFQTY2
     C                     MOVELA5PONO    AFODRN
     C   94                WRITEABR1P011
     C  N94                UPDATABR1P011
     C           *IN01     IFEQ *OFF
     C           KEY3      CHAINAB#PPCT              90
     C           *IN90     IFEQ *OFF
     C                     Z-ADD*DATE     CTNBR1
     C                     Z-ADDWTIME     CTNBR2
     C                     UPDATAB#PPCT1
     C                     ELSE
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     MOVELK@KWD2    CTKEY2
     C                     Z-ADD*DATE     CTNBR1
     C                     Z-ADDWTIME     CTNBR2
     C                     WRITEAB#PPCT1
     C                     ENDIF
     C                     MOVE *ON       *IN01
     C                     ENDIF
     C** WRITE KEY FILE
     C                     MOVE AFSTID    KDOCK
     C                     MOVELAFDOCK    KDOC2
     C                     MOVELAFIPAR    KPART
     C           KEY1      CHAINABRAP01R             91
B01  C           *IN91     IFEQ '0'
     C*
     C                     SELEC
B02  C           AFSIDT    WHGT CFSIDT
     C                     MOVELAFREF#    CFREF#           REFERENCE #
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     UPDATABRAP01R
     C*
     C           AFSIDT    WHEQ CFSIDT
     C           AFREF#    ANDGTCFREF#
     C                     MOVELAFREF#    CFREF#           REFERENCE #
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     UPDATABRAP01R
     C                     ENDSL
     C*
     C                     ELSE
     C                     Z-ADD*ZERO     @@CAMT  90
     C                     Z-ADD*ZERO     @@CAMN  90
     C           KEY4      SETLLABRAL01
     C           *IN90     DOUEQ*ON
     C           KEY4      READEABRAL01                  90
     C           *IN90     IFEQ *OFF
     C           CFDLCD    ANDEQ*BLANK
     C                     Z-ADDCFCAMT    @@CAMT
     C                     Z-ADDCFCAMN    @@CAMN
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C                     CLEARABRAP01R
     C                     MOVELAFREF#    CFREF#           REFERENCE #
      * 5 ---> 4
     C                     MOVE AFSTID    CFDOCK           DOCK CODE
     C                     MOVELAFDOCK    CFDOC2           DOCK CODE
     C                     MOVELAFIPAR    CFPART           PART
     C                     MOVELAFPOR#    CFPOR#           RELEASE #
     C                     Z-ADDAFSIDT    CFSIDT           SCHEDULE DATE
     C                     Z-ADDAFHSDT    CFHSDT           START DATE
     C                     Z-ADDWDATE     CFCDAT           CREATE DATE
     C                     Z-ADD@@CAMT    CFCAMT
     C                     Z-ADD@@CAMN    CFCAMN
     C                     WRITEABRAP01R
E01  C                     ENDIF
     C*
      *--------------------------------------------------
      * INITIALIZE
      *--------------------------------------------------
     C           *INZSR    BEGSR
      *
     C           KEY1      KLIST
     C                     KFLD           KDOCK   4
     C                     KFLD           KDOC2   4
     C                     KFLD           KPART  12
     C*
     C           KEY2      KLIST
     C                     KFLD           A5STID
     C                     KFLD           A5DOCK
     C                     KFLD           A5PART
     C                     KFLD           A5SIDT
     C                     KFLD           A5POR#
     C                     KFLD           K@REF# 10
     C                     KFLD           A5DLDT
     C           KEY3      KLIST
     C                     KFLD           K@KWD1  8
     C                     KFLD           K@KWD2  8
     C           KEY4      KLIST
     C                     KFLD           KDOCK   4
     C                     KFLD           KPART  12
      *
     C                     MOVEL'ANDROID 'K@KWD1    P
     C                     MOVEL'862GNTRN'K@KWD2    P
      *
     C                     TIME           WTMDT
      *
     C                     ENDSR
