     H            Y.
     F** AN#RFB ********************************************
     F*  DELETE ABR6P01 BASED ON ORDER DATA(AB#PP10)       *
     F*                                                    *
     F*  *IN90=1 NOT EXIST ABR6L02                         *
     F*                                                    *
     F* TCHK1 10/06/06 CREATE(COPY FROM AB#RFB)            *
     F************************************ AB#RFB **********
     FABR6L02 UF  E           K        DISK
     FABR6L05 IF  E           K        DISK
     F            ABR6P011                          KRENAMEABR6L5R
     FABR4P01 UF  E           K        DISK
     FABR6PW1 UF  E           K        DISK                      A
     F****************************************************
     E                    PLT        50  2 0
     E                    PLX        50  1
     E****************************************************
     I* TIME
     I            DS
     I                                        1  120WTMDT
     I                                        1   60WTIME
     I                                        7   80WWYY
     I                                        9  100WWMM
     I                                       11  120WWDD
     C***********************************************************
     C           *ENTRY    PLIST
     C                     PARM           PRDATE  80
     C                     PARM           PBIN    20
     C                     PARM           PSYYYY  40
     C                     PARM           PSMMMM  20
     C                     PARM           PSDDDD  20
     C                     PARM           PDELY   40
     C                     PARM           PDOCK   4
     C                     PARM           PPART  12
      * ABR6L02
     C           KEY1      KLIST
     C                     KFLD           PRDATE           SHIP DATE
     C                     KFLD           PBIN             BIN
     C                     KFLD           PSYYYY           RELEASED YY
     C                     KFLD           PSMMMM                    MM
     C                     KFLD           PSDDDD                    DD
     C                     KFLD           PDELY            DELIVERY(PLANT)
     C                     KFLD           PDOCK            DOCK
     C                     KFLD           PPART            PART
     C*
     C           KEY2      KLIST
     C                     KFLD           PRDATE           SHIP DATE
     C                     KFLD           PBIN             BIN
     C                     KFLD           PSYYYY           RELEASED YY
     C                     KFLD           PSMMMM                    MM
     C                     KFLD           PSDDDD                    DD
     C                     KFLD           PDELY            DELIVERY(PLANT)
     C                     KFLD           PDOCK            DOCK
     C                     KFLD           K@PLT   20       DOCK
      *
     C           KEY22     KLIST
     C                     KFLD           PRDATE           SHIP DATE
     C                     KFLD           PBIN             BIN
     C                     KFLD           PSYYYY           RELEASED YY
     C                     KFLD           PSMMMM                    MM
     C                     KFLD           PSDDDD                    DD
     C                     KFLD           PDELY            DELIVERY(PLANT)
     C                     KFLD           PDOCK            DOCK
      * ABR4P01
     C           KEY3      KLIST
     C                     KFLD           PDELY            DELIVERY
     C                     KFLD           PDOCK            DOCK
     C                     KFLD           PRDATE           SHIP DATE
     C                     KFLD           PBIN             BIN
     C                     KFLD           PSYYYY           RELEASED YY
     C                     KFLD           PSMMMM
     C                     KFLD           PSDDDD
      *
     C           K#FW      KLIST
     C                     KFLD           FCDELY
     C                     KFLD           FCDOCK
     C                     KFLD           FCSHDT
     C                     KFLD           FCSHTM
     C                     KFLD           FCRYYY
     C                     KFLD           FCRMMM
     C                     KFLD           FCRDDD
     C                     KFLD           FC#PLT
     C***********************************************************
     C*
     C                     EXSR @INZ
     C                     EXSR @MAIN
     C                     EXSR @END
     C***********************************************************
     C* INITIALIZE WORK AREA
     C***********************************************************
     C           @INZ      BEGSR
     C*
     C                     TIME           WTMDT
     C*
     C                     ENDSR
     C***********************************************************
     C* MAIN
     C***********************************************************
     C           @MAIN     BEGSR
     C*
     C                     Z-ADD*ZERO     WKRQTY  90
     C                     Z-ADD*ZERO     PLT
     C                     MOVE *BLANK    PLX
     C                     Z-ADD*ZERO     X       20
     C           KEY1      SETLLABR6P011
     C           KEY1      READEABR6P011                 90
     C*
     C           *IN90     DOWEQ'0'
     C*
     C           FCSKJY    IFNE 'D'
     C                     MOVE 'D'       FCSKJY           DELETE CODE
     C                     Z-ADD2000      FCSKYY
     C                     ADD  WWYY      FCSKYY           UPDATE YEAR
     C                     Z-ADDWWMM      FCSKMM                  MONTH
     C                     Z-ADDWWDD      FCSKDD                  DAY
     C           FCPBCD    IFEQ 'M'
     C                     ADD  FCRQTY    WKRQTY
     C                     Z-ADDFCUQTY    @@BOXQ  90
     C                     ENDIF
      *
     C                     UPDATABR6P011
     C           FC#PLT    LOKUPPLT                      10
     C           *IN10     IFEQ *OFF
     C                     ADD  1         X
     C                     Z-ADDFC#PLT    PLT,X
     C                     ENDIF
      *
     C           FC#PLT    IFNE *ZERO
     C           K#FW      CHAINABR6PW1              96
     C           *IN96     IFEQ *ON
     C                     Z-ADDFCSHDT    WCSHDT
     C                     Z-ADDFCSHTM    WCSHTM
     C                     MOVE FCDOCK    WCDOCK
     C                     Z-ADDFCCUST    WCCUST
     C                     Z-ADDFCDELY    WCDELY
     C                     Z-ADDFC#PLT    WC#PLT
     C                     MOVE *BLANK    WCPRNT
     C                     Z-ADDFCRYYY    WCRYYY
     C                     Z-ADDFCRMMM    WCRMMM
     C                     Z-ADDFCRDDD    WCRDDD
     C                     WRITEABR6PW11
     C                     ELSE
     C                     MOVE *BLANK    WCPRNT
     C                     UPDATABR6PW11
     C                     ENDIF
     C                     ENDIF
      *
     C                     END
     C*
     C           KEY1      READEABR6P011                 90
     C*
     C                     END
      ** PALET #
     C           1         DO   50        X
     C           PLT,X     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C                     Z-ADDPLT,X     K@PLT
     C           KEY2      CHAINABR6L05              90
     C           *IN90     IFEQ *OFF
     C                     MOVE '1'       PLX,X          90
     C                     ENDIF
     C                     ENDDO
      *
     C           1         DO   50        X
     C           PLT,X     IFEQ *ZERO
     C                     LEAVE
     C                     ENDIF
     C           PLX,X     IFEQ *BLANK
     C           KEY22     SETLLABR6P011
     C           *IN90     DOUEQ*ON
     C           KEY22     READEABR6P011                 90
     C           *IN90     IFEQ *OFF
     C           FCSKJY    ANDEQ*BLANK
     C           FC#PLT    IFGT PLT,X
     C                     SUB  1         FC#PLT
     C                     UPDATABR6P011
      *
     C           K#FW      CHAINABR6PW1              96
     C           *IN96     IFEQ *ON
     C                     Z-ADDFCSHDT    WCSHDT
     C                     Z-ADDFCSHTM    WCSHTM
     C                     MOVE FCDOCK    WCDOCK
     C                     Z-ADDFCCUST    WCCUST
     C                     Z-ADDFCDELY    WCDELY
     C                     Z-ADDFC#PLT    WC#PLT
     C                     MOVE *BLANK    WCPRNT
     C                     Z-ADDFCRYYY    WCRYYY
     C                     Z-ADDFCRMMM    WCRMMM
     C                     Z-ADDFCRDDD    WCRDDD
     C                     WRITEABR6PW11
     C                     ELSE
     C                     MOVE *BLANK    WCPRNT
     C                     UPDATABR6PW11
     C                     ENDIF
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDIF
     C                     ENDDO
      *
     C           @@BOXQ    IFNE *ZERO
     C           WKRQTY    DIV  @@BOXQ    WKMISU  30
     C                     MVR            @@MVR   30
     C           @@MVR     IFGT 0
     C                     ADD  1         WKMISU
     C                     ENDIF
      *
     C           KEY3      CHAINABR4P01              94
     C           *IN94     IFEQ *OFF
     C                     SUB  WKMISU    YBCONT
     C           YBCONT    IFEQ *ZERO
     C                     Z-ADD*ZERO     YB#PAL
     C                     Z-ADD*ZERO     YBWEIT
     C                     Z-ADD*ZERO     YBTARE
     C                     ENDIF
      *
     C                     UPDATABR4P011
     C                     ENDIF
     C                     ENDIF
     C*
     C                     ENDSR
     C***********************************************************
     C* END
     C***********************************************************
     C           @END      BEGSR
     C*
     C                     SETON                     LR
     C                     RETRN
     C*
     C                     ENDSR
     C***********************************************************
