     H            Y.
      ** AN#R0K ********************************************************
      *  ANDROID EDI(856) ASN CREATE                                   *
      *
      * TCHK1 08/02/06 CREATE(COPY FROM AB#R0K)
     F* TCHK2 02/19/07 ADD  AB#PP78 UPDATE
     F* TCHK3 05/03/07 BUG FIX
     F* TCHK4 09/10/08 CHG PRICE DECIMAL
      ******************************************************************
     FAN#PW0K CF  E                    WORKSTN
     F                                        RRNP1 KSFILE SFLP01
     F                                              KNUM        1
     F                                              KINFDS @INFDS
     FABR2L02 IF  E           K        DISK
     FABRAL02 UF  E           K        DISK                      A
     FABR6L02 UF  E           K        DISK
     FABR4P01 UF  E           K        DISK
     FAGDPL12 IF  E           K        DISK
     FAB#PL14 IF  E           K        DISK
     FFCEPL01 IF  E           K        DISK
     FAB#PL70 IF  E           K        DISK
     FAB#PL71 IF  E           K        DISK
     F            AB#PP701                          KRENAMEAB#L71R
     FAB#PL76 UF  E           K        DISK
TCHK2FAB#PL79 UF  E           K        DISK
     FAB#PPCT UF  E           K        DISK                      A
     FAB#EP63 IF  E           K        DISK                      A
     FAB#EP64 UF  E           K        DISK                      A
     FAB#EL65 IF  E           K        DISK
     F            AB#EP651                          KRENAMEAB#EP6R
     FAB#EP65 O   E           K        DISK                      A
     FAB#EP66 UF  E           K        DISK                      A
     FQPRINT  O   F     132     OF     PRINTER
     FMITANKF O   F     300            DISK                      A
     FAB#WP34 O   E                    DISK                      A
     FGADPL15 IF  E           K        DISK
     FABR#PAS UF  E           K        DISK                      A
      *---------------------------------------------------
     E                    ERR     1  14 60
     E                    IPAR       20  1
     E                    OPAR       20  1
     E                    BR         28  9
     E                    B7         28  1
     E                    NY         12  4
     E                    FC         12  1
     E                    NU         12  4
      *---------------------------------------------------
     I@INFDS      DS
     I                                     *STATUS  @STTS
     I                                    B 370 3710@@LIN
     I                                    B 378 3790@@REC
      * SYSTEM TIME(6) + DATE(6)
     I            DS
     I                                        1  140WWTIME
     I                                        1   60WTIME
     I                                        1   40WTIM4
     I                                        7  120WSDATE
     I                                        9  120@@YM4
     I                                        7  120@@YM6
     I                                        7  140@@YMD
     I                                        7  100@@YY
     I                                       11  120@@MM
     I                                       13  140@@DD
      * DELIVERY CODE(FROM DISPLAY)
     I            DS
     I                                        1   4 WNONY
     I                                        1   40KNONY
      * SHIPPING DATE(FROM DISPLAY)
     I            DS
     I                                        1   8 WNOHZ
     I                                        1   80KNOHZ
     I                                        1   40KNOYY
     I                                        5   60KNOMM
     I                                        7   80KNODD
     I            DS
     I                                        1   80WREHZ
     I                                        1   40KREYY
     I                                        5   60KREMM
     I                                        7   80KREDD
     I            DS
     I                                        1   80BAREHZ
     I                                        1   40BADEYY
     I                                        5   60BADEMM
     I                                        7   80BADEDD
      * CUSTOMER CODE
     I            DS
     I                                        1   40FCCUST
     I                                        1   4 WCCUST
     I            DS
     I                                        1   80YBSKHZ
     I                                        1   40YBSKYY
     I                                        5   60YBSKMM
     I                                        7   80YBSKDD
     I            DS
     I                                        1   80EKYMD
     I                                        1   40EKDEYY
     I                                        5   60EKDEMM
     I                                        7   80EKDEDD
     I            DS
     I                                        1   80W@DATE
     I                                        1   40W@YY
     I                                        5   60W@MM
     I                                        7   80W@DD
     I            DS
     I                                        1  20 #MHIN
     I                                        1   5 FC1
     I                                        6  10 FC2
     I                                       11  15 FC3
     I                                       16  20 FC4
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40PUNOYY
     I                                        5   60PUNOMM
     I                                        7   80PUNODD
     I            DS
     I                                        1   80@REHZ
     I                                        1   40PURLYY
     I                                        5   60PURLMM
     I                                        7   80PURLDD
     I            DS
     I                                        1  10 WSHP#
     I                                        1   40W4
     I                                        5  100W6
     I            DS
     I                                        1  12 K@PART
     I                                        1   5 K@PRT1
     I                                        6  10 K@PRT2
     I                                       11  12 K@PRT3
     I            DS
     I                                        1 252 BR
     I                                        1   9 D@BR01
     I                                       10  18 D@BR02
     I                                       19  27 D@BR03
     I                                       28  36 D@BR04
     I                                       37  45 D@BR05
     I                                       46  54 D@BR06
     I                                       55  63 D@BR07
     I                                       64  72 D@BR08
     I                                       73  81 D@BR09
     I                                       82  90 D@BR10
     I                                       91  99 D@BR11
     I                                      100 108 D@BR12
     I                                      109 117 D@BR13
     I                                      118 126 D@BR14
     I                                      127 135 D@BR15
     I                                      136 144 D@BR16
     I                                      145 153 D@BR17
     I                                      154 162 D@BR18
     I                                      163 171 D@BR19
     I                                      172 180 D@BR20
     I                                      181 189 D@BR21
     I                                      190 198 D@BR22
     I                                      199 207 D@BR23
     I                                      208 216 D@BR24
     I                                      217 225 D@BR25
     I                                      226 234 D@BR26
     I                                      235 243 D@BR27
     I                                      244 252 D@BR28
     I            DS
     I                                        1  48 NY
     I                                        1   4 D@NY01
     I                                        5   8 D@NY02
     I                                        9  12 D@NY03
     I                                       13  16 D@NY04
     I                                       17  20 D@NY05
     I                                       21  24 D@NY06
     I                                       25  28 D@NY07
     I                                       29  32 D@NY08
     I                                       33  36 D@NY09
     I                                       37  40 D@NY10
     I                                       41  44 D@NY11
     I                                       45  48 D@NY12
     I            DS
     I                                        1  12 FC
     I                                        1   1 D@FC01
     I                                        2   2 D@FC02
     I                                        3   3 D@FC03
     I                                        4   4 D@FC04
     I                                        5   5 D@FC05
     I                                        6   6 D@FC06
     I                                        7   7 D@FC07
     I                                        8   8 D@FC08
     I                                        9   9 D@FC09
     I                                       10  10 D@FC10
     I                                       11  11 D@FC11
     I                                       12  12 D@FC12
     I            DS
     I                                        1  48 NU
     I                                        1   4 D@NU01
     I                                        5   8 D@NU02
     I                                        9  12 D@NU03
     I                                       13  16 D@NU04
     I                                       17  20 D@NU05
     I                                       21  24 D@NU06
     I                                       25  28 D@NU07
     I                                       29  32 D@NU08
     I                                       33  36 D@NU09
     I                                       37  40 D@NU10
     I                                       41  44 D@NU11
     I                                       45  48 D@NU12
     I            DS
     I                                        1   80K@YMD
     I                                        1   40K@YY
     I                                        5   60K@MM
     I                                        7   80K@DD
     I            DS
     I                                        1  20 $MHIN
     I                                        1   5 $MHN1
     I                                        6  10 $MHN2
     I                                       11  15 $MHN3
     I                                       16  20 $MHN4
     I           SDS
     I                                        1   8 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      *************************************************************
      *  MAIN
      *************************************************************
     C*
     C                     EXSR #SCRNP
     C           *INKA     IFEQ *ON
     C                     MOVEL'99'      W@ID
     C                     END
     C                     EXSR @D1SET
     C*
     C           W@ID      DOWNE'99'
     C           W@ID      CASEQ'01'      #SCRN1
     C           W@ID      CASEQ'02'      #SCRN2
     C                     ENDCS
     C                     ENDDO
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
      *-----------------------------------------------------------
     C           *INZSR    BEGSR
      *-----------------------------------------------------------
      *
     C           P#RA6     PLIST
     C                     PARM           PSIRE
     C                     PARM           PSIRK
     C                     PARM           PDOCK
     C                     PARM           PNOHZ   80
     C                     PARM           PNOBN   20
     C                     PARM           PREHZ   80
     C                     PARM           PFLG    1
      *
     C           KEY1      KLIST
     C                     KFLD           KNOHZ
     C                     KFLD           KNOBN
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C                     KFLD           KNONY
     C                     KFLD           KNUKE
      *
     C           KEY2      KLIST
     C                     KFLD           KNONY
     C                     KFLD           KNUKE
     C                     KFLD           KNOHZ
     C                     KFLD           PNOBN
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
      *
     C           KEY3      KLIST
     C******               KFLD           FCDOCK
     C                     KFLD           KPART
     C                     KFLD           KDELY
      *
     C           KEY5      KLIST
     C                     KFLD           KNOYY
     C                     KFLD           KNOMM
     C                     KFLD           KNODD
     C                     KFLD           PNOBN
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C                     KFLD           KNONY
     C                     KFLD           PSIRK
     C                     KFLD           KNUKE
     C           K#APP     KLIST
     C                     KFLD           KNONY
     C                     KFLD           KNOYY
     C                     KFLD           KNOMM
     C                     KFLD           KNODD
     C                     KFLD           KNUKE
     C                     KFLD           FC1
     C                     KFLD           FC2
     C                     KFLD           FC3
     C                     KFLD           FC4
     C           K#AB70    KLIST
     C                     KFLD           FCCUST
     C                     KFLD           PSIRE
     C                     KFLD           PSIRK
     C                     KFLD           PDOCK
     C                     KFLD           FC1
     C                     KFLD           FC2
     C                     KFLD           FC3
     C                     KFLD           FC4
     C                     KFLD           FCORD#
     C                     KFLD           KNOYY
     C                     KFLD           KNOMM
     C                     KFLD           KNODD
     C                     KFLD           K@BIN   2
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C           K#PCT     KLIST
     C                     KFLD           K@KWD1  8
     C           K#P66     KLIST
     C                     KFLD           KNONY
     C                     KFLD           PSIRK
     C                     KFLD           KNUKE
     C                     KFLD           KNOHZ
     C                     KFLD           WREHZ
     C                     KFLD           PNOBN
     C           K#P64     KLIST
     C                     KFLD           E6SHID
     C                     KFLD           FCCPAR
     C           K#P65     KLIST
     C                     KFLD           E6SHID
     C                     KFLD           FCCPAR
     C                     KFLD           K@RF02 20
     C           K#P14     KLIST
     C                     KFLD           KNOYY
     C                     KFLD           KNOMM
     C                     KFLD           KNODD
     C                     KFLD           PNOBN
     C                     KFLD           KREYY
     C                     KFLD           KREMM
     C                     KFLD           KREDD
     C                     KFLD           KNONY
     C                     KFLD           PSIRK
     C                     KFLD           KNUKE
     C                     KFLD           K@PRT1
     C                     KFLD           K@PRT2
     C                     KFLD           K@PRT3
     C           K#AGD     KLIST
     C                     KFLD           K@YY
     C                     KFLD           K@MM
     C                     KFLD           K@DD
      *
     C           K#AF2     KLIST
     C                     KFLD           K@DOCK  5
     C                     KFLD           KNUKE
     C                     KFLD           FCCPAR
     C           K#FCE     KLIST
     C                     KFLD           BASHN1
     C                     KFLD           BASHN2
     C                     KFLD           BASHN3
      *
     C                     MOVEL'EDI856AD'K@KWD1
      *
     C                     MOVE '01'      W@ID    2
     C                     TIME           WWTIME
     C                     Z-ADDWTIM4     D@SHTM
     C                     Z-ADD@@YMD     D@SHDT
     C                     MOVE 'ST8'     D@RCTY
      *
     C                     EXSR #SCL1
     C                     EXSR #SCL2
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCL1     BEGSR
      *---------------------------------------------------
     C                     MOVE *BLANK    BR
     C                     MOVE *BLANK    B7
     C                     Z-ADD*ZERO     A       20
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCL2     BEGSR
      *---------------------------------------------------
     C                     MOVE *BLANK    NY
     C                     MOVE *BLANK    NU
     C                     MOVE *BLANK    FC
     C                     Z-ADD*ZERO     B       20
      *
     C                     ENDSR
      *---------------------------------------------------
     C           @D1SET    BEGSR
      *---------------------------------------------------
     C           S1H302    IFEQ *BLANK
     C                     MOVEL*OFF      *IN51
     C                     MOVELS1T302    PPSCAC
     C                     ELSE
     C                     MOVEL*ON       *IN51
     C                     END
     C           S1H303    IFEQ *BLANK
     C                     MOVEL*OFF      *IN52
     C                     MOVELS1T303    PTRIL
     C                     ELSE
     C                     MOVEL*ON       *IN52
     C                     END
     C           S1H503    IFEQ *BLANK
     C                     MOVEL*OFF      *IN53
     C                     MOVELS1T503    PCSCAC
     C                     ELSE
     C                     MOVEL*ON       *IN53
     C                     END
     C           S1H504    IFEQ *BLANK
     C                     MOVEL*OFF      *IN54
     C                     MOVELS1T504    PCMOD
     C                     ELSE
     C                     MOVEL*ON       *IN54
     C                     END
     C           S1H508    IFEQ *BLANK
     C                     MOVEL*OFF      *IN55
     C                     MOVELS1T508    PPPCD
     C                     ELSE
     C                     MOVEL*ON       *IN55
     C                     END
     C                     ENDSR
      *---------------------------------------------------
     C           #SCRN1    BEGSR
      *---------------------------------------------------
     C                     WRITEDSP01
     C                     READ AN#PW0K                7172
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
      *
     C           *INKE     WHEQ *ON
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *IN97     ANDEQ*OFF
     C                     EXSR #WRT0
     C                     MOVE '99'      W@ID
     C                     ENDIF
     C           *INKG     WHEQ *ON
     C           *IN97     ANDEQ*ON
     C           *IN99     ANDEQ*OFF
     C                     ADD  1         A
     C                     MOVE D@BARC    BR,A
     C                     MOVE '1'       B7,A
     C                     MOVE *BLANK    D@BARC
     C                     EXSR #CLR1
     C                     MOVE *ON       *IN43
     C           *INKI     WHEQ *ON
     C                     MOVE '02'      W@ID
     C           *INKA     WHEQ *ON
     C           D@BR01    IFNE *BLANK
      *
     C                     DO   *HIVAL
     C                     WRITEWIN02
     C                     READ AN#PW0K                7172
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C                     LEAVE
      *
     C           *INKL     WHEQ *ON
     C                     LEAVE
     C           *INKX     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     LEAVE
      *
     C                     ENDSL
      *
     C                     ENDDO
     C                     ELSE
     C                     MOVE '99'      W@ID
     C                     ENDIF
      *
     C                     OTHER
      *
     C                     EXSR #CHK1
     C           *IN99     IFEQ *OFF
     C           *IN97     ANDEQ*OFF
     C                     ADD  1         A
     C                     MOVE D@BARC    BR,A
     C                     MOVE *BLANK    D@BARC
     C*******              EXSR #CLR1
     C                     MOVE *ON       *IN43
     C                     MOVE *BLANK    D@RC
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CLR1     BEGSR
      *---------------------------------------------------
     C                     MOVEA'00000000'*IN,01
     C                     MOVEA'00000000'*IN,09
     C                     MOVE *OFF      *IN99
     C                     MOVE *OFF      *IN97
     C                     MOVE *OFF      *IN43
     C                     MOVE *BLANK    MSG
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CHK1     BEGSR
      *---------------------------------------------------
     C                     EXSR #CLR1
      *
     C           D@BARC    IFNE *BLANK
      *
     C           PPSCAC    IFEQ *BLANK
     C  N99                MOVE ERR,2     MSG
     C                     SETON                     0799
     C                     ENDIF
      *
     C           PTRIL     IFEQ *BLANK
     C  N99                MOVE ERR,3     MSG
     C                     SETON                     0899
     C                     ENDIF
      *
     C           PCSCAC    IFEQ *BLANK
     C  N99                MOVE ERR,4     MSG
     C                     SETON                     0999
     C                     ENDIF
      *
     C           PCMOD     IFEQ *BLANK
     C  N99                MOVE ERR,5     MSG
     C                     SETON                     1099
     C                     ENDIF
      *
     C           D@BARC    CHAINAB#PL76             N90
     C           *IN90     IFEQ *ON
     C  N99                MOVE ERR,1     MSG
     C                     MOVE *ON       *IN13
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN99
     C                     ELSE
      *
     C           D@BARC    LOKUPBR                       50
     C           *IN50     IFEQ *ON
     C  N99                MOVE ERR,11    MSG
     C                     MOVE *ON       *IN13
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN99
     C                     ELSE
      *
     C                     MOVE PUNONY    PSIRE
     C           PSIRE     IFEQ '2855'
     C           PSIRE     OREQ '2856'
     C                     ELSE
     C  N99                MOVE ERR,7     MSG
     C                     MOVE *ON       *IN13
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN99
     C                     END
     C*
     C           PUASDT    IFNE *ZERO
     C  N99                MOVE ERR,9     MSG
     C                     MOVE *ON       *IN13
     C                     MOVE *ON       *IN43
     C                     MOVE *ON       *IN97
     C                     END
      *
     C                     ENDIF
     C                     ENDIF
      *
     C           D@SHTM    IFLE 0
     C           D@SHTM    ORGT 2359
     C  N99N97             MOVE ERR,10    MSG
     C                     MOVE *ON       *IN14
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           D@SHDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     D@SHDT
     C                     ELSE
     C                     Z-ADDD@SHDT    K@YMD
     C           K#AGD     CHAINAGDPL12              90
     C           *IN90     IFEQ *ON
     C  N99N97             MOVE ERR,13    MSG
     C                     MOVE *ON       *IN15
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN99     IFEQ *OFF
     C                     MOVE PUNONY    WNONY
     C                     MOVE PUNONY    PSIRE   4
     C                     MOVE PUNKOJ    PSIRK   1
     C                     MOVE PUNUKE    PDOCK   4
     C                     MOVE PUCUST    @@CUST  40
     C                     Z-ADD@NOHZ     PNOHZ   80
     C                     Z-ADDPUBINN    PNOBN   20
     C                     Z-ADD@REHZ     PREHZ   80
      * SCAN CHECK
     C                     MOVE *BLANK    PFLG
     C                     CALL 'AN#RA6'  P#RA6
     C           PFLG      IFNE *BLANK
     C  N99                MOVE ERR,12    MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #SCRN2    BEGSR
      *---------------------------------------------------
     C                     WRITEDSP02
     C                     READ AN#PW0K                7172
      *
B0   C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      *
     C           *INKA     WHEQ *ON
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C           *INKL     WHEQ *ON
     C                     MOVE '01'      W@ID
     C                     OTHER
     C                     EXSR #CHK2
B1   C           *IN99     IFEQ *OFF
     C           *IN97     ANDEQ*OFF
     C           *INKE     ANDEQ*ON
     C           *IN99     OREQ *OFF
     C           *IN97     ANDEQ*ON
     C           *INKG     ANDEQ*ON
     C********** WNONY     IFEQ '5161'
     C**********           EXSR #RC     << RETURNABLE CONTAINER >>
     C**********           ENDIF
     C                     EXSR #WRT
     C                     ADD  1         B
     C                     MOVE PSIRE     NY,B
     C                     MOVE PSIRK     FC,B
     C                     MOVE PDOCK     NU,B
     C                     MOVE *BLANK    PSIRE
     C                     MOVE *BLANK    PSIRK
     C                     MOVE *BLANK    PDOCK
     C                     MOVE *BLANK    D@RC
     C                     EXSR #CLR1
E1   C                     ENDIF
      *
E0   C                     ENDSL
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #CHK2     BEGSR
      *---------------------------------------------------
     C                     EXSR #CLR1
      *
     C                     Z-ADDPNOHZ     KNOHZ
     C                     MOVE PSIRE     KNONY
     C                     Z-ADDPREHZ     WREHZ
     C                     MOVE PNOBN     KNOBN
     C                     MOVE PDOCK     KNUKE
      *
     C           KEY5      SETLLAB#PL141
     C           *IN90     DOUEQ*ON
     C           KEY5      READEAB#PL141                 90
     C           *IN90     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C                     MOVE BATOKU    @@CUST
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           *IN90     IFEQ *ON
     C                     MOVEA'111111'  *IN,1
     C                     MOVE ERR,8     MSG
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           PSIRE     IFEQ '2855'
     C           PSIRE     OREQ '2856'
     C                     ELSE
     C  N99                MOVE ERR,7     MSG
     C                     SETON                     0199
     C                     ENDIF
      *
     C           PPSCAC    IFEQ *BLANK
     C  N99                MOVE ERR,2     MSG
     C                     SETON                     0799
     C                     ENDIF
      *
     C           PTRIL     IFEQ *BLANK
     C  N99                MOVE ERR,3     MSG
     C                     SETON                     0899
     C                     ENDIF
      *
     C           PCSCAC    IFEQ *BLANK
     C  N99                MOVE ERR,4     MSG
     C                     SETON                     0999
     C                     ENDIF
      *
     C           PCMOD     IFEQ *BLANK
     C  N99                MOVE ERR,5     MSG
     C                     SETON                     1099
     C                     ENDIF
      *
     C           KEY1      SETLLABR6P011
     C           *IN90     DOUEQ*ON
     C           KEY1      READEABR6P011                 90
     C           *IN90     IFEQ *OFF
     C           FCSKJY    ANDEQ*BLANK
     C           FCPRNT    ANDEQ'A'
     C  N99                MOVE ERR,9     MSG
     C                     SETON                     97
     C                     MOVEL'111111'  *IN,1
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           D@SHTM    IFLE 0
     C           D@SHTM    ORGT 2359
     C  N99N97             MOVE ERR,10    MSG
     C                     MOVE *ON       *IN14
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C           D@SHDT    IFEQ *ZERO
     C                     Z-ADD@@YMD     D@SHDT
     C                     ENDIF
      *
      * SCAN CHECK
     C           *IN99     IFEQ *OFF
     C                     MOVE *BLANK    PFLG
     C                     CALL 'AN#RA6'  P#RA6
     C           PFLG      IFNE *BLANK
     C                     MOVE '99'      W@ID
     C                     MOVE *ON       *IN99
     C                     ENDIF
      *
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #RC       BEGSR
      *---------------------------------------------------
     C                     MOVE '1'       D@RC
     C                     DO   *HIVAL
     C           KNONY     CHAINGADPP111             57
     C                     MOVELB5KMEI    D@PNAM
     C                     WRITEWIN01
     C                     READ AN#PW0K                7172
      *
     C                     SELEC
     C           *IN71     WHEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
      *
     C                     OTHER
     C                     EXSR #WCHK
     C           *IN99     IFEQ *OFF
     C           *INKE     ANDEQ'1'
     C                     LEAVE
     C                     ENDIF
      *
     C                     ENDSL
      *
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #WCHK     BEGSR
      *---------------------------------------------------
     C                     SETOF                     996162
     C           D@RC      IFNE '1'
     C           D@RC      ANDNE'2'
     C                     SETON                     9961
     C                     ENDIF
      *
     C           D@RC      IFEQ '1'
     C           D@RCTY    ANDEQ*BLANK
     C                     SETON                     9962
     C                     ENDIF
      *
     C                     ENDSR
      *---------------------------------------------------------
      *   WRITE RECORDS TO WORK FILES FOR GENTRAN
      *---------------------------------------------------------
     C           #WRT0     BEGSR
      *
     C           1         DO   28        A
     C           BR,A      IFNE *BLANK
     C           BR,A      CHAINAB#PL76              91
     C           *IN91     IFEQ *OFF
     C           B7,A      IFEQ *BLANK
     C                     MOVE *OFF      *IN97
     C                     ELSE
     C                     MOVE *ON       *IN97
     C                     ENDIF
      *
     C                     MOVE PUNONY    WNONY
     C                     MOVE PUNONY    PSIRE   4
     C                     MOVE PUNKOJ    PSIRK   1
     C                     MOVE PUNUKE    PDOCK   4
     C                     MOVE PUCUST    @@CUST  40
     C                     Z-ADD@NOHZ     PNOHZ   80
     C                     Z-ADDPUBINN    PNOBN   20
     C                     Z-ADD@REHZ     PREHZ   80
TCHK2C                     TIME           WWTIME
     C                     Z-ADD@@YMD     PUASDT
     C                     Z-ADD@@YMD     PUKODT
     C                     Z-ADD@@YMD     PUSPDT
TCHK2C*                    TIME           PUKOTN
TCHK2C                     Z-ADDWTIME     PUKOTN
     C                     MOVEL#USER     PUKOME
     C                     UPDATAB#PP751
TCHK2 *
TCHK2C           PUSERL    CHAINAB#PL79              89
TCHK2C           *IN89     IFEQ *OFF
TCHK2C           P8SKJY    ANDEQ*BLANK
TCHK2C                     Z-ADD@@YMD     P8KODT
TCHK2C                     Z-ADDWTIME     P8KOTM
TCHK2C                     MOVEL#USER     P8KONM
TCHK2C           P8ASDT    IFEQ *ZERO
TCHK2C                     Z-ADD@@YMD     P8ASDT
TCHK2C                     Z-ADDWTIME     P8ASTM
TCHK2C                     MOVEL#USER     P8ASNM
TCHK2C                     END
TCHK2C           P8SPDT    IFEQ *ZERO
TCHK2C                     Z-ADD@@YMD     P8SPDT
TCHK2C                     Z-ADDWTIME     P8SPTM
TCHK2C                     MOVEL#USER     P8SPNM
TCHK2C                     END
TCHK2C                     UPDATAB#PP781
TCHK2C                     END
TCHK2 *
     C                     MOVE *BLANK    D@RC
     C********** WNONY     IFEQ '5161'
     C**********           EXSR #RC
     C**********           ENDIF
     C                     EXSR #WRT
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
      *
     C                     ENDSR
      *---------------------------------------------------------
      *   WRITE RECORDS TO WORK FILES FOR GENTRAN
      *---------------------------------------------------------
     C           #WRT      BEGSR
      *
     C                     SETON                         U3
     C                     Z-ADD*ZERO     @BOX    50
     C                     TIME           WWTIME
     C                     Z-ADDPNOBN     KNOBN   20
     C                     Z-ADDPNOBN     WNOBN   10
     C                     MOVE PSIRE     WNONY
     C                     MOVE PNOHZ     WNOHZ
     C                     MOVE PREHZ     WREHZ
     C                     MOVELPDOCK     KNUKE   4
      *
     C           KEY2      SETLLABR4P011
B0   C           *IN91     DOUEQ*ON
     C           KEY2      READEABR4P011                 91
     C           *IN91     IFEQ '0'
     C           YBSKJY    ANDEQ*BLANK
     C                     LEAVE
     C                     ENDIF
E0   C                     ENDDO
      *
B0   C           *IN91     IFEQ '0'
     C                     MOVE '1'       YBASN
     C                     MOVE PTRIL     YBTRIL
     C                     Z-ADD@@YMD     YBNOHZ
     C                     UPDATABR4P011
      *
     C                     ELSE
     C  N98
     COR OF                EXCPTHD
     C                     EXCPTERR1
     C  N98                SETON                     98
     C                     GOTO @WRT
 E0  C                     ENDIF
      *
      *  HEADER
     C                     EXSR #HED
      *  N1 INFORMATION
     C                     EXSR #N1
      *
     C                     SETON                     88
TCHK C***                  MOVE *BLANK    WWPART 12
     C                     MOVE *BLANK    @FCPAR 20
      *
     C           KEY1      SETLLABR6P011
B0   C           *IN80     DOUEQ*ON
     C           KEY1      READEABR6P011                 80
B1   C           *IN80     IFEQ *OFF
     C           FCSKJY    ANDEQ*BLANK
      *
B2   C           FCCPAR    IFNE @FCPAR
      * SET UNIT PRICE(OMIT BLANK FROM CUSTOMER PART)
     C                     MOVEAFCCPAR    IPAR
     C                     MOVE *BLANK    OPAR
     C                     Z-ADD1         M       20
      *
B3   C           1         DO   20        N       20
B4   C           IPAR,N    IFNE *BLANK
B4   C           IPAR,N    ANDNE'-'
     C                     MOVE IPAR,N    OPAR,M
     C                     ADD  1         M
E4   C                     ENDIF
E3   C                     ENDDO
     C                     MOVEAOPAR      #MHIN  20
      * PART INFORMATION
     C                     EXSR #PRT
E2   C                     ENDIF
      *
     C                     MOVE FCCPAR    @FCPAR
      *
B2   C           FCSERL    IFNE *BLANK
     C           FCPRNT    ANDEQ*BLANK
     C           FCSERL    CHAINAB#PL71              91
B3   C           *IN91     IFEQ *OFF
B4   C           EKSRYO    IFNE *ZERO
     C           EKYMD     ORNE *ZERO
     C                     MOVE 'P'       FCPRNT
E4   C                     ENDIF
E3   C                     ENDIF
E2   C                     ENDIF
      *
B2   C           FCPRNT    IFEQ *BLANK
     C                     EXSR #PCHK
E2   C                     ENDIF
      *
B2   C           FCPRNT    IFEQ 'P'
     C           *IN97     ANDEQ*OFF
     C           FCPRNT    OREQ 'A'
     C           *IN97     ANDEQ*ON
      *
     C                     MOVE 'A'       FCPRNT
     C                     UPDATABR6P011
      *
B3   C           FCPBCD    IFEQ 'S'
      *
     C                     MOVELFCSEQ#    K@RF02
     C           K#P65     CHAINAB#EL65              95
B4   C           *IN95     IFEQ *ON
      *
     C                     MOVELE6SHID    E5SHID
     C                     MOVELFCCPAR    E5MHIN
     C                     MOVEL'LS'      E5RF01
     C                     MOVELFCSEQ#    E5RF02
     C                     WRITEAB#EP651
E4   C                     ENDIF
E3   C                     ENDIF
      *
     C                     MOVE WCCUST    #TOKU   4
     C                     MOVE WNONY     #NONY   4
     C                     MOVE '0'       #NKOJ   1
     C                     MOVE FCDOCK    #NUKE   4
     C                     MOVE WNOHZ     #HIZK   8
     C                     Z-ADD0         #TANK  105
     C                     MOVE *BLANK    #CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           #TOKU
     C                     PARM           #NONY
     C                     PARM           #NKOJ
     C                     PARM           #NUKE
     C                     PARM           #MHIN
     C                     PARM           #HIZK
     C                     PARM           #TANK
     C                     PARM           #CHEK
      * EDIT DECIMAL POSTION
B3   C           #TANK     IFEQ *ZERO
     C                     MOVE '*'       PFLG
     C  N98
     COR OF                EXCPTHD
     C  N98                SETON                     98
     C                     EXCPTERR2
E3   C                     END
      *
E2   C                     END
      *
E1   C                     ENDIF
E0   C                     ENDDO
      *
      ********** << RETURNABLE CONTAINER >>
     C********** @BOX      IFNE *ZERO
     C********** D@RC      ANDEQ'1'
     C********** PSIRE     IFEQ '5161'
     C**********           CLEARAB#EP641
     C**********           Z-ADD@BOX      E4BOX#
     C**********           Z-ADD@BOX      E4SRYO
     C**********           MOVE E6SHID    E4SHID
      **********
     C**********           MOVELWNONY     E4PRTN
     C********** ' '       CAT  D@RCTY:1  E4MHIN    P
     C********** E4MHIN    CAT  'AVRTA':1 E4MHIN    P
      **********
     C**********           MOVEL'RC'      E4MHID
     C**********           MOVEL'EA'      E4FILR
     C**********           WRITEAB#EP641
      **********
     C********** @BOX      DIV  48        @LID    30
     C**********           MVR            @MVR    30
     C********** @MVR      IFGT *ZERO
     C**********           ADD  1         @LID
     C**********           ENDIF
      **********
     C**********           CLEARAB#EP641
     C**********           Z-ADD@LID      E4BOX#
     C**********           Z-ADD@LID      E4SRYO
     C**********           MOVE E6SHID    E4SHID
      **********
     C**********           MOVELWNONY     E4PRTN
     C********** 'PALLET'  CAT  'LID':0   E4MHIN    P
      **********
     C**********           MOVEL'RC'      E4MHID
     C**********           MOVEL'PC'      E4FILR
      **********
     C**********           ENDIF
     C**********           ENDIF
      *
     C           @WRT      ENDSR
      *-----------------------------------------------------
      * NEW SHIP ID
      *-----------------------------------------------------
     C           #NBR      BEGSR
      *
     C           K#PCT     CHAINAB#PPCT              95
     C           *IN95     IFEQ *ON
     C                     CLEARAB#PPCT1
     C                     MOVELK@KWD1    CTKEY1
     C                     Z-ADD@@YM6     CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     WRITEAB#PPCT1
     C                     Z-ADDCTNBR2    @@NBR   60
     C                     ELSE
     C           CTNBR1    IFEQ @@YM6
     C                     ADD  1         CTNBR2
     C                     ELSE
     C                     Z-ADD@@YM6     CTNBR1
     C                     Z-ADD1         CTNBR2
     C                     ENDIF
     C                     UPDATAB#PPCT1
     C                     Z-ADDCTNBR2    @@NBR
     C                     ENDIF
      *
     C                     Z-ADD@@YM4     W4
     C                     Z-ADD@@NBR     W6
      *
     C                     ENDSR
      *----------------------------------------------------
      * HEADER
      *----------------------------------------------------
     C           #HED      BEGSR
      *
     C           K#P66     CHAINAB#EP66              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#EP661
     C                     EXSR #NBR
     C                     MOVELWSHP#     E6SHID
     C                     ENDIF
      *
     C                     MOVELPSIRE     E6PRTN
     C                     Z-ADD@@YMD     E6DATE
TCHK2C*                    TIME           E6TIME
TCHK2C                     Z-ADDWTIME     E6TIME
     C                     MOVE @@CUST    E6TOKU
     C                     MOVELPSIRE     E6NONY
     C                     MOVELPSIRK     E6NKOJ
     C                     MOVELPDOCK     E6NUKE
     C                     MOVE D@SHDT    E6NOHZ
     C                     Z-ADDD@SHTM    E6NOTM
     C*
     C                     Z-ADDD@SHTM    W@TMMN  20
     C                     SELEC
     C           W@TMMN    WHLT 15
     C                     MOVE '13'      E6NOTM
     C           W@TMMN    WHLT 30
     C                     MOVE '28'      E6NOTM
     C           W@TMMN    WHLT 45
     C                     MOVE '43'      E6NOTM
     C                     OTHER
     C                     MOVE '58'      E6NOTM
     C                     ENDSL
     C*
     C                     Z-ADDPNOBN     E6NBIN
     C                     MOVE WREHZ     E6REHZ
     C                     Z-ADDYB#PAL    E6PLT
     C                     MOVELPTRIL     E6TRCK
     C                     MOVELPCSCAC    ESCAC
     C                     MOVELPPSCAC    EPSCAC
     C                     MOVELPCMOD     ECMOD
     C                     MOVELPPPCD     EPPCD
     C           YBWEIT    ADD  YBTARE    E6WHT
     C                     Z-ADDYBCONT    E6BOX
     C                     Z-ADDYB#PAL    E6PLT
     C                     MOVELYBPS#     EPICK
     C                     MOVELYBMANI    E6BLN#
     C   90                WRITEAB#EP661
     C  N90                UPDATAB#EP661
      *
     C                     ENDSR
      *------------------------------------------------------
      *  N1 INFORMATION
      *------------------------------------------------------
     C           #N1       BEGSR
      *
     C           E6SHID    CHAINAB#EP63              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#EP631
     C                     MOVELE6SHID    E3SHID
      *
     C                     MOVELPSIRE     E3PRTN
     C                     MOVELPSIRE     E3NONY
     C                     MOVELPDOCK     E3NUKE
     C                     MOVEL'ST'      E3N101
     C                     MOVEL'92'      E3N103
     C           WNONY     IFEQ '2855'
     C                     MOVEL'AIW01'   E3N104    P
     C                     END
     C           WNONY     IFEQ '2856'
     C                     MOVEL'AIL01'   E3N104    P
     C                     END
     C                     WRITEAB#EP631
     C                     MOVEL'SF'      E3N101
     C                     MOVEL'AVRTA'   E3N104    P
      *
     C                     WRITEAB#EP631
      *
     C                     ENDIF
      *
     C                     ENDSR
      *------------------------------------------------------
      *  PRT INFORMATION
      *------------------------------------------------------
     C           #PRT      BEGSR
      *
     C           K#P64     CHAINAB#EP64              90
     C           *IN90     IFEQ *ON
     C                     CLEARAB#EP641
     C                     MOVE E6SHID    E4SHID
     C                     ENDIF
      *
     C                     MOVELFCIPAR    K@PART
     C           K#P14     SETLLAB#PL14
     C           *IN94     DOUEQ*ON
     C           K#P14     READEAB#PL14                  94
     C           *IN94     IFEQ *OFF
     C           BASKJY    ANDEQ*BLANK
     C           BAUSYS    IFNE *ZERO
     C                     Z-ADDBAUSYS    E4SYOS
     C                     ELSE
     C                     Z-ADDBASYOS    E4SYOS
     C                     ENDIF
     C                     Z-ADDBASRYO    E4SRYO
      *
     C           BAURHZ    IFEQ *ZERO
     C                     EXSR #POST
     C                     ENDIF
      *
     C                     LEAVE
     C                     ENDIF
     C                     ENDDO
      *
     C           E4SYOS    IFNE *ZERO
     C           E4SRYO    DIV  E4SYOS    E4BOX#
     C                     ENDIF
      *
     C                     ADD  E4BOX#    @BOX
      *
     C                     MOVELWNONY     E4PRTN
     C                     MOVELFCCPAR    E4MHIN
      *
     C                     MOVEL'BP'      E4MHID
TCHK C****                 MOVEL'PC'      E4FILR
TCHK C                     MOVELBAODRN    E4FILR
TCHK C***                  MOVEL#MHIN     WWPART
     C                     MOVE *BLANK    E4RCID
     C                     MOVE *BLANK    E4RTCN
      *
     C           WNONY     IFEQ '2855'
     C                     MOVEL'AIW01'   K@DOCK
     C                     END
     C           WNONY     IFEQ '2856'
     C                     MOVEL'AIL01'   K@DOCK
     C                     END
     C           K#AF2     SETGTABR2L02
     C           K#AF2     REDPEABR2L02                  92
      *
     C           WNONY     IFEQ '2855'
     C                     MOVEL'IW01'    KDELY   4
     C                     END
     C           WNONY     IFEQ '2856'
     C                     MOVEL'IL01'    KDELY   4
     C                     END
     C                     MOVEL#MHIN     KPART  12
     C                     MOVE *OFF      *IN93
     C           KEY3      SETLLABRAL02
     C           *IN92     DOUEQ*ON
     C           KEY3      READEABRAL02                  92
     C           *IN92     IFEQ '0'
     C           CFDLCD    ANDEQ*BLANK
      *
     C           *IN97     IFEQ *OFF
     C           E4SRYO    ADD  CFCAMT    E4CUMQ
     C           E4SRYO    ADD  CFCAMT    CFCAMT
     C                     ADD  E4SRYO    CFCAMN
     C                     ELSE
     C                     Z-ADDCFCAMT    E4CUMQ
     C                     ENDIF
      *
      * UPDATE CUM MASTER
TCHK3C*                    Z-ADDWSDATE    CFLDAT
TCHK3C                     Z-ADD@@YMD     CFLDAT
     C  N93                MOVE *ON       *IN93
     C  N97                UPDATABRAP01R
     C                     ENDIF
     C                     ENDDO
      * NEW PART ?
     C           *IN93     IFEQ *OFF
     C           WNONY     IFEQ '2855'
     C                     MOVEL'IW01'    CFDOCK
     C                     END
     C           WNONY     IFEQ '2856'
     C                     MOVEL'IL01'    CFDOCK
     C                     END
     C                     MOVELFCDOCK    CFDOC2
     C                     MOVEL#MHIN     CFPART
     C                     Z-ADD*ZERO     CFSIDT
     C                     MOVE *BLANK    CFPOR#
     C                     Z-ADDE4SRYO    E4CUMQ
     C                     Z-ADDE4SRYO    CFCAMT
     C                     Z-ADDE4SRYO    CFCAMN
TCHK3C*                    Z-ADDWSDATE    CFLDAT
TCHK3C                     Z-ADD@@YMD     CFLDAT
     C  N97                WRITEABRAP01R
     C                     ENDIF
      *
     C   90                WRITEAB#EP641
     C  N90                UPDATAB#EP641
      *
     C                     ENDSR
      *---------------------------------------------------
     C           #POST     BEGSR
      *---------------------------------------------------
     C                     CLEARAB#WP341
     C           BATOKU    IFEQ BANONY
     C                     MOVE BANKOJ    W1TKOJ
     C                     MOVE BANUKE    W1TUKE
     C                     ELSE
     C                     MOVE *BLANK    W1TKOJ
     C                     MOVE *BLANK    W1TUKE
     C                     END
      *
     C                     MOVE BASIRE    W1SIRE
     C                     MOVE BASIRK    W1SIRK
     C                     MOVE BAMHN1    W1THN1
     C                     MOVE BAMHN2    W1THN2
     C                     MOVE BAMHN3    W1THN3
     C                     MOVE BAMHN4    W1THN4
     C                     MOVE 'U'       W1USRI
     C                     MOVE 'K'       W1ODKE
     C                     MOVE *BLANK    W1TEIS
     C                     Z-ADDBATOKU    W1TOKU
     C                     Z-ADDBANONY    W1NONY
     C                     MOVE BANKOJ    W1NKOJ
     C                     MOVE BANUKE    W1NUKE
     C                     MOVE BAMHN1    W1UHN1
     C                     MOVE BAMHN2    W1UHN2
     C                     MOVE BAMHN3    W1UHN3
     C                     MOVE BAMHN4    W1UHN4
     C                     MOVE BASHN1    W1SHN1
     C                     MOVE BASHN2    W1SHN2
     C                     MOVE BASHN3    W1SHN3
     C                     MOVE *BLANK    W1KANR
     C                     MOVELBAODRN    W1ODNO
     C                     MOVELBAINVN    W1NOBN
     C                     MOVE 'C'       W1NOKB
     C                     Z-ADDBANOYY    W1NOYY
     C                     Z-ADDBANOMM    W1NOMM
     C                     Z-ADDBANODD    W1NODD
%0001C                     Z-ADDBANOBN    W1NOBI
     C                     Z-ADDBANOTM    W1NOTM
TCHK4C*                    Z-ADDBATANK    WTANK  134
TCHK4C*                    Z-ADDBATANK    @@TANK 114
TCHK4C                     Z-ADDBATANK    WTANK  135
TCHK4C                     Z-ADDBATANK    @@TANK 115
     C                     Z-ADDBATANK    $$TANK 135
      *
     C           WTANK     IFEQ 0
      *
     C                     MOVELBATOKU    $TOKU   4
     C                     MOVELBANONY    $NONY   4
     C                     MOVELBANKOJ    $NKOJ   1
     C                     MOVELBANUKE    $NUKE   4
     C                     MOVELBAMHIN    $MHIN  20
     C                     MOVEL*BLANK    $SHIN  12
     C                     MOVEL*BLANK    $FLG    1
      *
     C                     CALL 'BBHR50'
     C                     PARM           $TOKU
     C                     PARM           $NONY
     C                     PARM           $NKOJ
     C                     PARM           $NUKE
     C                     PARM           $MHIN
     C                     PARM           $SHIN
     C                     PARM           $FLG
      *
     C           $FLG      IFEQ '*'
     C                     MOVE *BLANK    $MHN3
     C                     MOVE *BLANK    $MHN4
     C                     END
      *
     C                     MOVE BATOKU    @TOKU   4
     C                     MOVE BANONY    @NONY   4
     C                     MOVE BANKOJ    @NKOJ   1
     C                     MOVE BANUKE    @NUKE   4
     C                     MOVELBAMHIN    @MHIN  20
     C                     MOVE BANOHZ    @HIZK   8
     C                     Z-ADD0         @TANK  105
     C                     MOVE *BLANK    @CHEK   1
      *
     C                     CALL 'FBCR10'
     C                     PARM           @TOKU
     C                     PARM           @NONY
     C                     PARM           @NKOJ
     C                     PARM           @NUKE
     C                     PARM           @MHIN
     C                     PARM           @HIZK
     C                     PARM           @TANK
     C                     PARM           @CHEK
      *
     C                     Z-ADD@TANK     WTANK
     C                     Z-ADD@TANK     @@TANK
     C                     Z-ADD@TANK     $$TANK
      *
     C           @CHEK     IFEQ '*'
     C                     EXCPTMITAN
     C                     SETON                     U2
     C                     ENDIF
     C                     ENDIF
      *
     C           K#FCE     CHAINFCEPL01              95
     C           *IN95     IFEQ *ON
     C           A2GSKD    OREQ 'D'
     C                     MOVE 'N'       @FCE    1
     C                     ELSE
     C                     MOVE *BLANK    @FCE
     C                     ENDIF
      *
     C                     Z-ADDWTANK     W1TANK
     C                     MOVE 'C'       W1SUTN
     C                     Z-ADDBANOYY    W1JYRY
     C                     Z-ADDBANOMM    W1JYRM
     C                     Z-ADDBANODD    W1JYRD
     C                     MOVE '9'       W1JKKB
     C                     MOVE BASBAN    W1SEBN
     C                     MOVELBAMHIN    W1UHIN
     C                     Z-ADD@@YY      W1URIY
     C                     Z-ADD@@MM      W1URIM
     C                     Z-ADD@@DD      W1URID
     C                     MOVE 'S'       W1SYBT
     C                     MOVE '4'       W1SOBT
     C                     MOVE '04'      W1GYOM
     C                     MOVE BACARD    W1CARD
     C                     Z-ADDBASRYO    W1NOSU
     C                     Z-ADDBASYOS    W1SYUY
     C                     Z-ADDBADEYY    W1REYY
     C                     Z-ADDBADEMM    W1REMM
     C                     Z-ADDBADEDD    W1REDD
     C           BASYOS    IFEQ *ZERO
     C                     Z-ADDBAUSYS    W1SYUY
     C                     ENDIF
      *
     C           BASYOS    IFNE 0
     C           BASRYO    DIV  BASYOS    W1HAKO
     C                     MVR            WHAK1   30
     C           WHAK1     IFNE 0
     C                     ADD  1         W1HAKO
     C                     END
     C                     END
     C           @FCE      IFEQ 'N'
     C                     MOVE 'S'       W1STKB
     C                     ELSE
     C                     MOVE A2TEHI    W1STKB
     C                     ENDIF
      *
     C                     SETON                     U1
      *
     C                     WRITEAB#WP341
      *
     C                     ENDSR
     C**********************************************************
      *  SHIPMENT CHECK
     C**********************************************************
     C           #PCHK     BEGSR
      *
     C                     MOVE PNOBN     K@BIN
     C                     Z-ADD*ZERO     @@QTY   90
     C           K#AB70    SETLLAB#PL70
     C           *IN90     DOUEQ*ON
     C           K#AB70    READEAB#PL70                  90
     C           *IN90     IFEQ *OFF
     C                     ADD  EKSRYO    @@QTY
     C                     ENDIF
     C                     ENDDO
      *
     C           @@QTY     IFGE FCRQTY
     C           FCPRNT    ANDEQ*BLANK
     C                     MOVE 'P'       FCPRNT
     C                     ENDIF
      *
     C                     ENDSR
     C******************************************************
      *  ASN DATA PATTERN SELECTION
     C******************************************************
     C           #SCRNP    BEGSR
      *
     C                     EXSR @P1INT
     C                     EXSR @P1SET
      *
     C                     DO   *HIVAL
      *
     C                     WRITECTLP99
     C                     Z-ADDW#RNP1    #RCN01
     C                     WRITECTLP01
     C                     READ AN#PW0K                7172
     C           *IN71     IFEQ '1'
     C           @STTS     ANDEQ1331
     C                     MOVE '99'      W@ID
     C                     MOVE '9'       PFLG
     C                     LEAVE
     C                     END
     C   KA                LEAVE
      *
     C           @@REC     IFNE *ZERO
     C                     Z-ADD@@REC     W#RNP1
     C                     END
      *
     C                     MOVEL*BLANK    MSG
     C                     MOVEL*OFF      W#P1ER  1
     C                     MOVEL*OFF      *IN97
      * add new pattern
     C           *INKH     IFEQ *ON
     C           C1PTNM    IFEQ *BLANK
     C                     ITER
     C                     END
     C                     EXSR @P1CH1
     C           W#P1ER    IFEQ *OFF
     C                     EXSR @P1OUF
     C                     EXSR @P1INT
     C                     EXSR @P1SET
     C                     ELSE
     C                     MOVEL*ON       *IN97
     C                     END
     C                     ITER
     C                     END
      * select
     C                     EXSR @P1CH2
     C           W#P1ER    IFEQ *OFF
     C                     LEAVE
     C                     ELSE
     C                     ITER
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  INITTIAL ASN DATA PATTERN SCREEN
     C*----------------------------------------------------*
     C           @P1INT    BEGSR
      *
     C                     MOVEL*ON       *IN51
     C                     CLEARCTLP01
     C                     MOVEL*OFF      *IN51
      *
     C                     Z-ADD1         W#RNP1  40
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  SET ASN DATA PATTERN SCREEN
     C*----------------------------------------------------*
     C           @P1SET    BEGSR
      *
     C                     Z-ADD*ZERO     RRNP1   40
     C           *LOVAL    SETLLABR#PAS
     C                     Z-ADD*ZERO     RRNP1
      *
     C                     DO   *HIVAL
      *
     C                     READ ABR#PAS             N    91
     C   91                LEAVE
     C           AFSKJY    IFNE *BLANK
     C                     ITER
     C                     END
      *
     C                     ADD  1         RRNP1
     C           RRNP1     CHAINSFLP01               9292
      *
     C                     CLEARSFLP01
     C                     MOVELAFPTNM    S1PTNM
     C                     MOVELAFT302    S1T302
     C           AFH302    IFNE *BLANK
     C                     MOVEL'Yes'     S1H302
     C                     END
     C                     MOVELAFT303    S1T303
     C           AFH303    IFNE *BLANK
     C                     MOVEL'Yes'     S1H303
     C                     END
     C                     MOVELAFT503    S1T503
     C           AFH503    IFNE *BLANK
     C                     MOVEL'Yes'     S1H503
     C                     END
     C                     MOVELAFT504    S1T504
     C           AFH504    IFNE *BLANK
     C                     MOVEL'Yes'     S1H504
     C                     END
     C                     MOVELAFT508    S1T508
     C           AFH508    IFNE *BLANK
     C                     MOVEL'Yes'     S1H508
     C                     END
      *
     C           *IN92     IFEQ *ON
     C                     WRITESFLP01
     C                     ELSE
     C                     UPDATSFLP01
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHECK ASN DATA PATTERN SCREEN FOR NEW PATTERN
     C*----------------------------------------------------*
     C           @P1CH1    BEGSR
      *
     C                     DO
      *
     C           C1PTNM    CHAINABR#PAS             N91
     C           *IN91     IFEQ *OFF
     C                     MOVEL*ON       W#P1ER
     C                     MOVELERR,14    MSG
     C                     END
      *
     C                     ENDDO
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  WRITE ASN DATA PATTERN SCREEN FOR NEW PATTERN
     C*----------------------------------------------------*
     C           @P1OUF    BEGSR
      *
     C                     CLEARABR#PASR
      *
     C                     Z-ADD@@YY      AFKOYY
     C                     Z-ADD@@MM      AFKOMM
     C                     Z-ADD@@DD      AFKODD
     C                     MOVELWTIM4     AFKOHH
     C                     MOVE WTIM4     AFKOSS
     C                     MOVEL#PGM      AFKOPG
     C                     MOVEL#WSID     AFKOWS
     C                     MOVEL#USER     AFKOME
      *
     C                     MOVELC1PTNM    AFPTNM
     C                     MOVELC1T302    AFT302
     C           C1H302    IFNE *BLANK
     C                     MOVEL'Y'       AFH302
     C                     END
     C                     MOVELC1T303    AFT303
     C           C1H303    IFNE *BLANK
     C                     MOVEL'Y'       AFH303
     C                     END
     C                     MOVELC1T503    AFT503
     C           C1H503    IFNE *BLANK
     C                     MOVEL'Y'       AFH503
     C                     END
     C                     MOVELC1T504    AFT504
     C           C1H504    IFNE *BLANK
     C                     MOVEL'Y'       AFH504
     C                     END
     C                     MOVELC1T508    AFT508
     C           C1H508    IFNE *BLANK
     C                     MOVEL'Y'       AFH508
     C                     END
      *
     C                     WRITEABR#PASR
      *
     C                     ENDSR
     C*----------------------------------------------------*
      *  CHECK ASN DATA PATTERN SCREEN FOR SELECTION
     C*----------------------------------------------------*
     C           @P1CH2    BEGSR
      *
     C                     Z-ADD*ZERO     RRNP1
      *
     C                     DO   *HIVAL
     C                     ADD  1         RRNP1
     C           RRNP1     CHAINSFLP01               91
     C   91                LEAVE
     C           S1SEL     IFNE *BLANK
     C                     LEAVE
     C                     END
     C                     ENDDO
      *
     C           *IN91     IFEQ *ON
     C                     MOVEL*ON       W#P1ER
     C                     END
      *
     C                     ENDSR
      *************************************************************
     OQPRINT  E  102           HD
     O                                  131 '.....................'
     O        E  1             HD
     O                                  131 '.         .         .'
     O        E  1             HD
     O                         #PGM       8
     O                                   89 'TIME'
     O                         WTIME     98 '  :  :  '
     O                                  131 '.         .         .'
     O        E  2             HD
     O                                   55 '******* EDI ANDROID ASN'
     O                                   77 'ERROR LIST **********'
     O                                   89 'DATE'
     O                         UDATE Y   98
     O                                  104 'PAGE'
     O                         PAGE  Z  108
     O                                  131 '.....................'
     O        E  2             ERR1
     O                                   50 'MANIFEST FILE NOT EXIST'
     O        E  2             ERR2
     O                                   50 'UNIT PRICE INCORRECT'
     O                         FCCPAR    80
      *----------------------------------------------------------
     OMITANKF EADD             MITAN
     O                                    1 'U'
     O                                    2 'K'
     O                                    3 ' '
     O                         BATOKU     7
     O                         BANKOJ     8
     O                         BANUKE    12
     O                         BANONY    16
     O                         BANKOJ    17
     O                         BANUKE    21
     O                         BAMHN1    26
     O                         BAMHN2    31
     O                         BAMHN3    36
     O                         BAMHN4    41
     O                         BASHN1    46
     O                         BASHN2    51
     O                         BASHN3    53
     O                         BAODRN    73
     O                                   76 '000'
     O                                   84 'C'
     O                         BANOYY    88
     O                         BANOMM    90
     O                         BANODD    92
     O                         BANOBN    94
** ERR
BARCODE ERROR.
INPUT PICK-UP SCAC CODE.
INPUT TRAILER#.
INPUT CARRIER SCAC CODE.
INPUT CONVEYANCE CODE.
INPUT POOL POINT.
THIS IS NOT ANDROID SHIPMENT.
NO DATA
ASN DATA HAS BEEN ALREADY MADE. HIT F7 FOR RE-CREATING DATA.
SHIP TIME ERROR.
DUPLICATE BARCODE.
AFTER SCANNING LABELS, TRY AGAIN.
DATE ERROR
DUPLICATE PATTERN
