     H            Y.
     F** AN#RF0 ********************************************
     F*  ANDROID DELIVERY CODE CHECK                       *
     F*                                                    *
     F* TCHK1 07/12/06 CREATE(COPY FROM AB#RF0)            *
     F******************************************************
     C           *ENTRY    PLIST
     C                     PARM           P@DELV  4
     C                     PARM           P@FDID  1
      *
     C           P@DELV    IFEQ '2855'
     C           P@DELV    OREQ '2856'
     C                     MOVE '1'       P@FDID
     C                     ELSE
     C                     MOVE *BLANK    P@FDID
     C                     ENDIF
      *
     C                     MOVE *ON       *INLR
     C                     RETRN
