     H            Y.
     F** ANPR03 *******************************************************
     F*  NAPCK SHIPPING DATA CREATE VER.2
     F*
     F* T.SAKAKI 12/02/2015
     F*****************************************************************
     FANPPW03 CF  E                    WORKSTN
     F                                              KINFDS INFDS
      *  ..EDI FIXED ORDER DATA..  *
     FAB#PL1C IF  E           K        DISK
      * SERIAL NUMBER FILE FOR PICK UP LIST           *
     FAB#PL76 IF  E           K        DISK
      * EKANBAN SERIAL NUMBER FILE                    *
     FAB#PL70 UF  E           K        DISK
      * TMS MASTSER LABEL                           *
     FAB#PL67 IF  E           K        DISK
      *================================================================
     E                    ER      1  10 60               d[ｰxｮﾈｰﾆﾞ
      *================================================================
      *================================================================
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1  140@TIME
     I                                        1   60@SYSTM
     I                                        7  140@SYSHZ
     I                                        1   20@SYSHH
     I                                        3   40@SYSMN
     I                                        7  100@SYSYY
     I                                       11  120@SYSMM
     I                                       13  140@SYSDD
      *---------------------------------------------
     I            DS
     I                                        1   80BASKHZ
     I                                        1   40BASKYY
     I                                        5   60BASKMM
     I                                        7   80BASKDD
     I            DS
     I                                        1   80K$NOHZ
     I                                        1   40K$NOYY
     I                                        5   60K$NOMM
     I                                        7   80K$NODD
     I            DS
     I                                        1   80EKSKHZ
     I                                        1   40EKSKYY
     I                                        5   60EKSKMM
     I                                        7   80EKSKDD
      *---------------------------------------------
     I              'VOLKSWAGEN          'C         $$VW
      *================================================================
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C           @STEP     CASEQ'#CHK1   '#CHK1
     C           @STEP     CASEQ'#CHK1 F5'#CHK1
     C           @STEP     CASEQ'#UPDT   '#UPDT
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================
      * INITIALIZE
      *===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
      *
     C                     CLEARDSP01
     C                     TIME           @TIME
     C                     MOVEL*BLANK    D1ODRN           ORDER NO
     C                     MOVEL*BLANK    D1SERL           SERIAL#
     C                     MOVEL*BLANK    D$ODRN           ORDER NO
     C                     MOVEL*BLANK    D$SERL           SERIAL#
     C                     MOVEL*BLANK    D1ERR
     C*
     C                     MOVE '#DSP1   '@STEP
     C                     ENDSR
      *===============================================================
      * KEY LIST
      *===============================================================
      * AB#PL1C
     C           KEY01     KLIST
     C                     KFLD           D1ODRN           ORDER NO
     C                     KFLD           K$NONY  40       DELIVERY CODE
     C                     KFLD           K$NUKE  4        DELIVERY RECEIVING
     C                     KFLD           K$NKOJ  1        DELIVERY FACTORY
     C                     KFLD           K$NOYY  40       DELIVERY YEAR
     C                     KFLD           K$NOMM  20       DELIVERY MONTH
     C                     KFLD           K$NODD  20       DELIVERY DAY
     C                     KFLD           K$NOBN  20       DELIVERY BIN
      * AB#PL76
     C           KEY02     KLIST
     C                     KFLD           D1SERL           SERIAL #
      * AB#PL70
     C           KEY03     KLIST
     C                     KFLD           K$CUST           CUSTOMER
     C                     KFLD           WKNONY           DELIVERY CODE
     C                     KFLD           K$NKOJ           DELIVERY FACTORY
     C                     KFLD           K$NUKE           DELIVERY RECEIVING
     C                     KFLD           BAMHN1           CUST PART#1
     C                     KFLD           BAMHN2           CUST PART#2
     C                     KFLD           BAMHN3           CUST PART#3
     C                     KFLD           BAMHN4           CUST PART#4
     C                     KFLD           D1ODRN           ORDER NO
     C                     KFLD           K$NOYY           DELIVERY YEAR
     C                     KFLD           K$NOMM           DELIVERY MONTH
     C                     KFLD           K$NODD           DELIVERY DAY
     C                     KFLD           WKNOBN           DELIVERY BIN
      * AB#PL67
     C           KEY04     KLIST
     C                     KFLD           K$CUST           CUSTOMER
     C                     KFLD           K$NONY           DELIVERY CODE
     C                     KFLD           K$NKOJ           DELIVERY FACTORY
     C                     KFLD           K$NUKE           DELIVERY RECEIVING
     C                     KFLD           K$NOHZ           DELIVERY DATE
     C                     KFLD           K$NOBN           DELIVERY BIN
     C                     KFLD           D1ODRN           ORDER NO
     C*===============================================================
      * SCREEN 1
     C*===============================================================
     C           #DSP1     BEGSR
     C                     EXFMTDSP01
     C                     MOVEA'000'     *IN,31
     C                     MOVEA'0'       *IN,99
      *----*
     C                     SELEC
     C* F1 *
     C           *INKA     WHEQ *ON
     C                     MOVE '#END    '@STEP
     C* F5 *
     C           *INKE     WHEQ *ON
     C                     MOVE '#CHK1 F5'@STEP
     C******
     C                     OTHER
     C                     MOVE '#CHK1   '@STEP
     C                     ENDSL
      *----*
     C                     ENDSR
     C*===============================================================
      * CHECK SCREEN1
     C*===============================================================
     C           #CHK1     BEGSR
     C                     MOVEL*BLANK    D1ODRN           ORDER #
      **
      ** SERIAL #
      **
     C           D1SERL    IFEQ *BLANK
     C                     SETON                     3199
     C                     MOVELER,1      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
      *
      * SERIAL NUMBER FILE FOR PICK UP LIST           *
      *
     C           KEY02     SETLLAB#PL76
     C*-------------------------
     C                     DO   *HIVAL
     C           KEY02     READEAB#PL76                  92
     C   92                LEAVE
     C           PUSKJY    IFEQ 'D'                        DELETE FLAG
     C           PUSKDT    ANDLE@SYSHZ                     DELETE DATE
     C                     ITER
     C                     ENDIF
     C                     MOVELPUODRN    D1ODRN           ORDER #
     C                     Z-ADDPUCUST    K$CUST  40       CUSTOMER
     C                     Z-ADDPUNONY    K$NONY           DELIVERY CODE
     C                     MOVE PUNONY    WKNONY  4        DELIVERY CODE
     C                     MOVELPUNKOJ    K$NKOJ           DELIVERY FACTORY
     C                     MOVELPUNUKE    K$NUKE           DELIVERY RECEIVING
     C                     Z-ADDPUBINN    K$NOBN           DELIVERY BIN
     C                     MOVEL'00'      WKNOBN  2        INVOICE BIN
     C                     MOVE K$NOBN    WKNOBN           INVOICE BIN
     C                     Z-ADDPUNOYY    K$NOYY           DELIVERY YEAR
     C                     Z-ADDPUNOMM    K$NOMM           DELIVERY MONTH
     C                     Z-ADDPUNODD    K$NODD           DELIVERY DAY
     C                     LEAVE
     C                     ENDDO
     C*-------------------------
     C           *IN92     IFEQ *ON
     C                     SETON                     3199
     C                     MOVELER,4      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
     C*-------------------------
     C*
     C                     MOVELD1ODRN    D1OD2   2
     C**         D1OD2     IFNE 'TC'
     C**                   SETON                     3199
     C**                   MOVELER,2      D1ERR
     C**                   GOTO @CHK1
     C**                   ENDIF
      *
      *  ..EDI FIXED ORDER DATA..  *
     C*
     C                     MOVE ' '       @@UMU1  1        有無
     C                     MOVE ' '       @@UMU7  1        有無
     C                     MOVE ' '       @@SUMI  1        処理済
     C           KEY01     SETLLAB#PL1C
     C*-------------------------
     C                     DO   *HIVAL
     C           KEY01     READEAB#PL1C                  91
     C   91                LEAVE
     C           BASKJY    IFEQ 'D'                        DELETE CODE
     C**JW       BASKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C*
     C                     MOVE '*'       @@UMU1  1        有無
     C*
     C* EKANBAN SERIAL NUMBER FILE
     C*
     C                     EXSR #AB70A
     C                     ENDDO
     C*-------------------------
     C           @@UMU1    IFEQ ' '                        有無
     C                     SETON                     3199
     C                     MOVELER,3      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
     C*
     C           @@UMU7    IFEQ ' '                        有無
     C                     SETON                     3199
     C                     MOVELER,6      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
      *
      *  ..CASE LABEL DATA CHECK.  *
     C*
     C                     MOVE ' '       @@UMU6  1        CHECK
     C           KEY04     SETLLAB#PL67
     C*-------------------------
     C                     DO   *HIVAL
     C           KEY04     READEAB#PL67                  91
     C   91                LEAVE
     C           BASKJY    IFEQ 'D'                        DELETE CODE
     C**JW       BASKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C                     MOVE '*'       @@UMU6
     C                     ENDDO
     C*
     C           @@UMU6    IFEQ ' '                         NO DATA
     C                     SETON                     3199
     C                     MOVELER,7      D1ERR
     C                     GOTO @CHK1
     C                     ENDIF
      *-------------------------
     C           @CHK1     TAG
      *-------------------------
     C           *IN99     IFEQ *OFF
     C           @STEP     ANDEQ'#CHK1 F5'
     C                     MOVE '#UPDT   '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     ENDIF
      *
     C                     ENDSR
      *===============================================================
      * EKANBAN SERIAL NUMBER FILE CHECK
      *===============================================================
     C           #AB70A    BEGSR
     C*
      *
     C           KEY03     SETLLAB#PL70
     C*--------------------
     C                     DO   *HIVAL
     C           KEY03     READEAB#PL70                  93
     C   93                LEAVE
     C           EKSKJY    IFEQ 'D'                        DELETE FLAG
     C           EKSKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C                     MOVE '*'       @@UMU7           有無
     C                     LEAVE
     C                     ENDDO
     C*--------------------
     C                     ENDSR
      *===============================================================
      * EKANBAN SERIAL NUMBER FILE(AB#PP70) UPDAT
      *===============================================================
     C           #UPDT     BEGSR
     C*
      * ORDER FILE
     C           KEY01     SETLLAB#PL1C
     C*-------------------------
S1   C                     DO   *HIVAL
     C           KEY01     READEAB#PL1C                  91
     C   91                LEAVE
     C           BASKJY    IFEQ 'D'                        DELETE CODE
     C**JW       BASKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C*
     C* EKANBAN SERIAL NUMBER FILE(AB#PP70) UPDAT
     C           KEY03     SETLLAB#PL70
     C*--------------------
 S2  C                     DO   *HIVAL
     C           KEY03     READEAB#PL70                  93
     C   93                LEAVE
     C           EKSKJY    IFEQ 'D'                        DELETE FLAG
     C           EKSKHZ    ANDLE@SYSHZ
     C                     ITER
     C                     ENDIF
     C           EKLTNO    IFNE *BLANK                     LOT#
     C                     ITER
     C                     ENDIF
      * DO NOT CAHNGE DATE AND TIME TO KEEP CREATE DATE AND TIME
JW   C**                   Z-ADD@SYSYY    EKKOYY           UPDATE YEAR
 .   C**                   Z-ADD@SYSMM    EKKOMM           UPDATE MONTH
 .   C**                   Z-ADD@SYSDD    EKKODD           UPDATE DATE
 .   C**                   Z-ADD@SYSHH    EKKOHH           UPDATE HOUR
JW   C**                   Z-ADD@SYSMN    EKKOMN           UPDATE MINUTE
      * SCAN DATE AND TIME
     C                     Z-ADD@SYSYY    EKDEYY           SHIP YY
     C                     Z-ADD@SYSMM    EKDEMM           MM
     C                     Z-ADD@SYSDD    EKDEDD           DD
     C                     Z-ADD@SYSTM    EKDETM           DELIVERY TIME
      *
     C                     MOVELEKSYOS    $$SRYO  50       QTY/BOX
     C                     Z-ADD$$SRYO    EKSRYO           DELIVERY QUANTITY
     C                     MOVE '999'     EKLTNO           LOT#
     C                     MOVEL'99 '     EKISNO           ISSUE#
     C                     UPDATAB#PP701
 E2  C                     ENDDO
     C*--------------------
 E1  C                     ENDDO
     C*-------------------------
      ** AB#PL66
      *  TMS MASTSER LABEL                           *
      *
     C**         KEY04     SETLLAB#PL67
     C* ------------------------
     C*                    DO   *HIVAL
     C**         KEY04     READEAB#PL67                  95
     C*  95                LEAVE
     C*          A6SHN1    IFEQ *BLANK                     IAF PART#1
     C**         A6SHN2    ANDEQ*BLANK                     IAF PART#2
     C*          A6SHN3    ANDEQ*BLANK                     IAF PART#3
     C*          A6MHN1    ANDEQ*BLANK                     CUST PART#1
     C**         A6MHN2    ANDEQ*BLANK                     CUST PART#2
     C*          A6MHN3    ANDEQ*BLANK                     CUST PART#3
     C*          A6MHN4    ANDEQ*BLANK                     CUST PART#4
     C**                   Z-ADD@SYSHZ    A6KYMD           SCAN DATE
     C*                    Z-ADD@SYSTM    A6KTIM           SCAN TIME
     C**                   MOVELBASHN1    A6SHN1           IAF PART#1
     C*                    MOVELBASHN2    A6SHN2           IAF PART#2
     C**                   MOVELBASHN3    A6SHN3           IAF PART#3
     C*                    MOVELBAMHN1    A6MHN1           CUST PART#1
     C**                   MOVELBAMHN2    A6MHN2           CUST PART#2
     C*                    MOVELBAMHN3    A6MHN3           CUST PART#3
     C**                   MOVELBAMHN4    A6MHN4           CUST PART#4
     C*                    Z-ADDBASRYO    A6SRYO           QUANTITY
     C**                   MOVE $$SRYO    A6QTYB           QTY/BOX
     C*                    UPDATAB#PP661
     C**                   ENDIF
     C*                    ENDDO
     C* ------------------------
     C*-------------------------
     C***                  CALL 'ANPR02'
     C***                  PARM           D1SERL
     C***                  PARM           P@ERR   1
     C*-------------------------
     C                     MOVELD1ODRN    D$ODRN           ORDER NO
     C                     MOVELD1SERL    D$SERL           SERIAL#
     C                     MOVEL*BLANK    D1ODRN           ORDER NO
     C                     MOVEL*BLANK    D1SERL           SERIAL#
     C                     MOVE '#DSP1   '@STEP
     C*
     C                     ENDSR
      *===============================================================
      *===============================================================
      *===============================================================
      *===============================================================
**  ER,
INPUT ORDER #.
ORDER # IS NOT 'TC********'
NO ORDER DATA.
BARCODE ERROR.
ALREADY SCANNED.
LABEL DATA HAS NOT BEEN CREATED.
TMS CASE LABEL HAS NOT BEEN CREATED.
E-08
E-09
E-10
