     H            Y.
     F** ANYR05 ********************************************
     F* L/T MASTER FOR ABNORMAL DETECTION INQ.             *
     F*  T.SAKAKI                  2018.08.10              *
     F******************************************** ANYR05 **
     FANYPW05 CF  E                    WORKSTN
     F                                              KINFDS INFDS
     F                                        RRN   KSFILE SFREC1
     FANYPP01 IF  E           K        DISK
     FAAAPL01 IF  E           K        DISK
      *
     IINFDS       DS
     I                                    B 378 3790$$RRN
     I****************************
     I*プログラム状況データ構造*
     I****************************
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 W$USER
     I                                      264 269 W$JBNO
     I            DS
     I                                        1   80SBSKHZ
     I                                        1   40SBSKYY
     I                                        5   60SBSKMM
     I                                        7   80SBSKDD
      ** KEY **
     C           KEY1      KLIST
     C                     KFLD           KJOKC   2
     C                     KFLD           KKANB   1
      *********
     C*
     C                     MOVE '#INIT   '@STEP   8
     C*
     C           @STEP     DOUEQ'#END    '
     C           @STEP     CASEQ'#INIT   '#INIT            初期処理
     C           @STEP     CASEQ'#DSP1   '#DSP1
     C                     ENDCS
     C                     ENDDO
     C*
     C                     SETON                     LR
     C                     RETRN
     C*===============================================================
     C* 初期ﾈｮmb
     C*===============================================================
     C           #INIT     BEGSR
     C                     MOVEA*ALL'0'   *IN
     C*  SFLCLR
     C                     SETON                     82
     C                     WRITESFCTL1
     C                     SETOF                     82
     C                     Z-ADD0         RRN     40
     C                     Z-ADD0         ENDRRN  40
     C                     MOVE *BLANK    @@UMU   1        データ有無
     C*-------------------------
S1   C                     DO   *HIVAL
     C                     READ ANYPP01                  90
     C   90                LEAVE
 S2  C           A1SKJY    IFEQ 'D'
     C           A1SKHZ    ANDLE*DATE
     C                     ITER
 E2  C                     ENDIF
     C*
     C                     MOVELA1JOK1    @COND1
     C                     MOVELA1JOK2    @COND2
     C                     Z-ADDA1LTIM    @LTIME
     C                     MOVEL'E'       KKANB
      *
     C                     MOVEL*BLANK    @NAME1
     C                     MOVELA1JOK1    KJOKC
     C           KEY1      CHAINAAAPL01              91
     C  N91                MOVELA5JOKM    @NAME1
     C                     MOVEL*BLANK    @NAME2
     C                     MOVELA1JOK2    KJOKC
     C           KEY1      CHAINAAAPL01              92
     C  N92                MOVELA5JOKM    @NAME2
      *
     C                     ADD  1         RRN
     C                     WRITESFREC1
E1   C                     ENDDO
     C*-------------------------
     C           RRN       IFEQ 0
     C                     MOVE '#END    '@STEP
     C                     ELSE
     C                     MOVE '#DSP1   '@STEP
     C                     Z-ADD1         DSPRRN
     C                     ENDIF
     C                     ENDSR
     C*===============================================================
      *画面１*
     C*===============================================================
     C           #DSP1     BEGSR
     C                     SETON                     71
     C                     WRITEDSP01
     C                     EXFMTSFCTL1
     C                     SETOF                     71
     C                     MOVEA'0'       *IN,99
     C                     Z-ADD$$RRN     DSPRRN
      *----*
      * F3 *
      *----*
     C   KC                MOVE '#END    '@STEP
     C                     ENDSR
