     H            Y.                                    1
     F* ANYR24 ************************************************
     F* APICS KANBAN ABNORMAL DETECTION INQUIRY CSV           *
     F*     KATOGI.            2016.03.01                     *
JW1  F*     J.WATANABE         2016.03.07                     *
     F*********************************************************
     FANYWP21 IF  E           K        DISK
     F**ANYWP24 O   F    0256            DISK                      A
JW1  FANYWP24 O   E                    DISK
     F*********************************************************
      *
     I            DS
     I                                        1  140WDATE
     I                                        1   60STIME
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      *   PLIST                                            *
      *----------------------------------------------------*
      *-------------------*
     C                     TIME           WDATE
     C**JW1                EXCPTHD
     C                     READ ANYWP211                 81
     C           *IN81     DOWEQ'0'
     C                     EXSR #SB400
     C                     READ ANYWP211                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *-------------------*
      * OUTPUT            *
      *-------------------*
     CSR         #SB400    BEGSR
      *
     C                     Z-ADD0         S2PCT1  52
     C           YWDBOX    IFNE *ZERO
     C           YWCHK1    DIV  YWDBOX    S2PCT1
JW1  C*                    MVR            MVR     53
JW1  C*          S2PCT1    IFEQ 0
JW1  C*          MVR       ANDNE0
JW1  C*          YWCHK1    IFLT 0
JW1  C*                    Z-ADD-0.01     S2PCT1
JW1  C*                    ELSE
JW1  C*                    Z-ADD0.01      S2PCT1
JW1  C*                    ENDIF
JW1  C*                    ENDIF
     C                     ELSE
     C                     Z-ADD999.99    S2PCT1
     C                     ENDIF
     C**JW1                EXCPTDT
JW1  C                     WRITEANYWP241
      *
     CSR         ESB400    ENDSR
      *
     O*JW1 ANYWP24 EADD             HD
     O*JW1                                  'PARTS#,'
     O*JW1                                  'UNSCAN(A),'
     O*JW1                                  'NOTRANSM(B),'
     O*JW1                                  'NOTRANS(C),'
     O*JW1                                  'BARREL FRACTION(D),'
     O*JW1                                  'KANBAN MAX(E),'
     O********                              'TRANS FIN(F),'
     O*JW1                                  '(A)+(B)+(C)+(D)-'
     O*JW1                                  '(E)=(Y),'
     O*JW1                                  'MONTH VOLUME,'
     O*JW1                                  'QPC,'
     O*JW1                                  'BOX/DAY,'
     O*JW1                                  'LAST SHIP,'
     O*JW1    EADD             DT
     O*JW1                     YWSHIN
     O*JW1                                  ','
     O*JW1                     YWCN01P
     O*JW1                                  ','
     O*JW1                     YWCN02P
     O*JW1                                  ','
     O*JW1                     YWCN03P
     O*JW1                                  ','
     O*JW1                     YWCN04P
     O*JW1                                  ','
     O*JW1                     YWCN05P
     O*JW1                                  ','
     O*********                YWCN06P
     O*********                             ','
     O*JW1                     YWCHK1P
     O*JW1                                  ','
     O*JW1                     YWMVOLP
     O*JW1                                  ','
     O*JW1                     YWSYOSP
     O*JW1                                  ','
     O*JW1                     YWDBOXP
     O*JW1                                  ','
     O*JW1                     YWLAST       '    /  /  '
     O*JW1                                  ','
     O*JW1                     S2PCT1P
