     H            Y.
     F** ANZR@@ *********************************************
     F*安全在庫理由ファイルのコンバージョン               *
     F*       HOTTA.           2018.08.29                   *
     F********************************************* ANZR09 **
     FAAFPP01 UF  E                    DISK
     FAAHPP01 UF  E                    DISK
     FANZPP01 IF  E           K        DISK
     I           SDS
     I                                        1  10 PGMNM
     I                                       91 170 MSGTXT
     I                                      244 253 WSID
     I                                      254 263 USID
     I                                      264 269 JBNO
     I            DS
     I                                        1   80A3STYD
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     I            DS
     I                                        1   80L6STYD
     I                                        1   40L6STYY
     I                                        5   60L6STMM
     I                                        7   80L6STDD
      *めっき
     C                     READ AAFPP011                 80
     C           *IN80     DOWEQ'0'
     C           A3SKJY    IFEQ *BLANK
     C           A3STYD    ANDGE*DATE
     C                     MOVELA31HB5    HIN1
     C                     MOVELA32HB5    HIN2
     C                     MOVELA33HB2    HIN3
     C                     MOVELA3ATK1    W@ATK1  1
     C                     MOVELA3ATK2    W@ATK2  2
     C                     MOVELA3ATK3    W@ATK3  2
     C                     MOVELA3ATK4    W@ATK4  1
     C                     MOVELA3KCD1    W@KCD1  1
     C                     MOVELA3KCD2    W@KCD2  1
     C                     EXSR #SB400
     C                     Z-ADDA3MAXH    A3AMXH
     C                     UPDATAAFPP011
     C                     ENDIF
     C                     READ AAFPP011                 80
     C                     ENDDO
      *引取
     C                     READ AAHPP011                 80
     C           *IN80     DOWEQ'0'
     C           L6SKJY    IFEQ *BLANK
     C           L6STYD    ANDGE*DATE
     C                     MOVELL6SHN1    HIN1
     C                     MOVELL6SHN2    HIN2
     C                     MOVELL6SHN3    HIN3
     C                     MOVELL6ATK1    W@ATK1  1
     C                     MOVELL6ATK2    W@ATK2  2
     C                     MOVELL6ATK3    W@ATK3  2
     C                     MOVELL6ATK4    W@ATK4  1
     C                     MOVELL6KCD1    W@KCD1  1
     C                     MOVELL6KCD2    W@KCD2  1
     C                     EXSR #SB410
     C                     Z-ADDL6MAXH    L6AMXH
     C                     UPDATAAHPP011
     C                     ENDIF
     C                     READ AAHPP011                 80
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *---------------------------------------------*
      *
      *---------------------------------------------*
     CSR         #SB400    BEGSR
      *
     C           KEYANZ    KLIST
     C                     KFLD           HIN1    5
     C                     KFLD           HIN2    5
     C                     KFLD           HIN3    2
     C                     MOVEL'0'       GET     1
     C           KEYANZ    SETLLANZPP011
     C           KEYANZ    READEANZPP011                 84
     C           *IN84     DOWEQ'0'
     C           Z1SKJY    IFEQ *BLANK
     C           Z1BAN1    ANDEQW@ATK1
     C           Z1BAN2    ANDEQW@ATK2
     C           Z1BAN3    ANDEQW@ATK3
     C           Z1BAN4    ANDEQW@ATK4
     C           Z1KCD1    ANDEQW@KCD1
     C           Z1KCD2    ANDEQW@KCD2
     C                     MOVEL'1'       GET     1
     C********             Z-ADDZ1MAXH    A3MAXH
     C                     Z-ADDZ1KAIH    A3KAIH
     C                     Z-ADDZ1SINH    A3SINH
     C                     Z-ADDZ1DUPH    A3DUPH
     C                     Z-ADDZ1HRH1    A3HRH1
     C                     Z-ADDZ1NON1    A3NON1
     C                     MOVELZ1NKO1    A3NKO1
     C                     MOVELZ1NUK1    A3NUK1
     C                     Z-ADDZ1HRH2    A3HRH2
     C                     Z-ADDZ1NON2    A3NON2
     C                     MOVELZ1NKO2    A3NKO2
     C                     MOVELZ1NUK2    A3NUK2
     C                     Z-ADDZ1HRH3    A3HRH3
     C                     Z-ADDZ1NON3    A3NON3
     C                     MOVELZ1NKO3    A3NKO3
     C                     MOVELZ1NUK3    A3NUK3
     C                     Z-ADDZ1HRH4    A3HRH4
     C                     Z-ADDZ1NON4    A3NON4
     C                     MOVELZ1NKO4    A3NKO4
     C                     MOVELZ1NUK4    A3NUK4
     C                     Z-ADDZ1MNDS    A3MNDS
     C                     Z-ADDZ1HRYO    A3HRYO
     C                     Z-ADDZ1HLTS    A3HLTS
     C                     Z-ADDZ1JTEI    A3JTEI
     C                     Z-ADDZ1SKJI    A3SKJI
     C                     Z-ADDZ1PADJ    A3PADJ
     C                     Z-ADDZ1OTHH    A3OTHH
     C                     MOVELZ1CMT1    A3CMT1
     C                     MOVELZ1CMT2    A3CMT2
     C                     ENDIF
     C           KEYANZ    READEANZPP011                 84
     C                     ENDDO
      *
     C           GET       IFEQ '0'
     C           A3ATK2    IFGE '01'
     C           A3ATK2    ANDLE'99'
     C                     Z-ADDA3MAXH    A3DUPH
     C                     ELSE
     C                     Z-ADDA3MAXH    A3PADJ
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB400    ENDSR
      *---------------------------------------------*
      *
      *---------------------------------------------*
     CSR         #SB410    BEGSR
      *
     C                     MOVEL'0'       GET     1
     C           KEYANZ    SETLLANZPP011
     C           KEYANZ    READEANZPP011                 84
     C           *IN84     DOWEQ'0'
     C           Z1SKJY    IFEQ *BLANK
     C           Z1BAN1    ANDEQW@ATK1
     C           Z1BAN2    ANDEQW@ATK2
     C           Z1BAN3    ANDEQW@ATK3
     C           Z1BAN4    ANDEQW@ATK4
     C           Z1KCD1    ANDEQW@KCD1
     C           Z1KCD2    ANDEQW@KCD2
     C                     MOVEL'1'       GET     1
     C**********           Z-ADDZ1MAXH    L6MAXH
     C                     Z-ADDZ1KAIH    L6KAIH
     C                     Z-ADDZ1SINH    L6SINH
     C                     Z-ADDZ1DUPH    L6DUPH
     C                     Z-ADDZ1HRH1    L6HRH1
     C                     Z-ADDZ1NON1    L6NON1
     C                     MOVELZ1NKO1    L6NKO1
     C                     MOVELZ1NUK1    L6NUK1
     C                     Z-ADDZ1HRH2    L6HRH2
     C                     Z-ADDZ1NON2    L6NON2
     C                     MOVELZ1NKO2    L6NKO2
     C                     MOVELZ1NUK2    L6NUK2
     C                     Z-ADDZ1HRH3    L6HRH3
     C                     Z-ADDZ1NON3    L6NON3
     C                     MOVELZ1NKO3    L6NKO3
     C                     MOVELZ1NUK3    L6NUK3
     C                     Z-ADDZ1HRH4    L6HRH4
     C                     Z-ADDZ1NON4    L6NON4
     C                     MOVELZ1NKO4    L6NKO4
     C                     MOVELZ1NUK4    L6NUK4
     C                     Z-ADDZ1MNDS    L6MNDS
     C                     Z-ADDZ1HRYO    L6HRYO
     C                     Z-ADDZ1HLTS    L6HLTS
     C                     Z-ADDZ1JTEI    L6JTEI
     C                     Z-ADDZ1SKJI    L6SKJI
     C                     Z-ADDZ1PADJ    L6PADJ
     C                     Z-ADDZ1OTHH    L6OTHH
     C                     MOVELZ1CMT1    L6CMT1
     C                     MOVELZ1CMT2    L6CMT2
     C                     ENDIF
     C           KEYANZ    READEANZPP011                 84
     C                     ENDDO
      *
     C           GET       IFEQ '0'
     C           L6ATK2    IFGE '01'
     C           L6ATK2    ANDLE'99'
     C                     Z-ADDL6MAXH    L6DUPH
     C                     ELSE
     C                     Z-ADDL6MAXH    L6PADJ
     C                     ENDIF
     C                     ENDIF
      *
     CSR         ESB410    ENDSR
