     H            Y.
     F***ANZR07A ***************************************************************
     F*  PROGRAM    : ORDER VS SAFETY INVENTORY DATA (CREATE WF)               *
     F*  JW         : 2024.01.05                                               *
     F**************************************************************************
     FANZWP07 IF  E           K        DISK
     FANZWP07VO   E           K        DISK
      *---------------------------------------------------
     I            DS
     I                                        1  140@DATE
     I                                        1   60NOW
     I                                        7  140TODAY
     I            DS
     I                                        1  14 Z7SHIN
     I                                        1   5 Z7SHN1
     I                                        6   6 H1
     I                                        7  11 Z7SHN2
     I                                       12  12 H2
     I                                       13  14 Z7SHN3
     I            DS
     I                                        1   5 Z7LOC
     I                                        1   2 Z7LOC2
     I                                        3   3 H3
     I                                        4   5 Z7LOC3
     I           SDS
     I                                        1  10 #PGM
     I                                      244 253 #WSID
     I                                      254 263 #USER
      ***********************************************************
      * MAIN ROUTINE
      ***********************************************************
     C                     MOVE 'Y'       FIRST   1
     C                     MOVE '-'       H1
     C                     MOVE '-'       H2
     C                     MOVE '-'       H3
      *
     C                     DO   *HIVAL
     C                     READ ANZWP071                 98
     C   98                LEAVE
      * WRITE
     C           FIRST     IFEQ 'Y'
     C                     EXSR #HDR
     C                     MOVE 'N'       FIRST
     C                     ENDIF
      *
     C                     EXSR #DTL
      *
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------------------*
      *  WRITE HEADER                                      *
      *----------------------------------------------------*
     C           #HDR      BEGSR
      *
     C                     CLEARANZWP7V1
     C                     MOVEL'SHP_DATE'ZVNOHZ
     C                     MOVEL'IAF_PART'ZVSHIN
     C                     MOVEL'LOCATION'ZVLOC
     C                     MOVEL'QPC     'ZVSYOS
     C                     MOVEL'BOX/DAY 'ZVDBOX
     C                     MOVEL'SAFE_STK'ZVSINV
     C                     MOVEL'TTL_STK 'ZVTINV
     C                     MOVEL'ORD_BOX 'ZVTBOX
     C                     MOVEL'A - B   'ZVDIFF
     C                     MOVEL'DELIV#  'ZVNONY
     C                     MOVEL'#_OF_ORD'ZVOBOX
     C                     MOVEL'NAME    'ZVNAME
     C                     MOVEL'PERSON  'ZVPRSN
     C                     WRITEANZWP7V1
      *
     C                     ENDSR
      *----------------------------------------------------*
      *  WRITE DETAIL                                      *
      *----------------------------------------------------*
     C           #DTL      BEGSR
      *
     C                     CLEARANZWP7V1
     C                     MOVELZ7NOHZ    ZVNOHZ
     C                     MOVELZ7SHIN    ZVSHIN
     C                     MOVELZ7LOC     ZVLOC
     C                     MOVELZ7SYOS    ZVSYOS
      *
     C                     Z-ADDZ7DBOX    $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     MOVEL$TRUE     ZVDBOX
      *
     C                     MOVELZ7SINV    ZVSINV
     C                     MOVELZ7TINV    ZVTINV
     C                     MOVELZ7TBOX    ZVTBOX
      *
     C           Z7TINV    SUB  Z7TBOX    NUM6    60
     C                     Z-ADDNUM6      $IN
     C                     CALL 'EDTR05B'
     C                     PARM           $IN    156
     C                     PARM           $TRUE  17
     C                     MOVEL$TRUE     ZVDIFF
      *
     C                     MOVELZ7NONY    ZVNONY
     C                     MOVELZ7OBOX    ZVOBOX
      *
     C                     MOVELZ7NONY    PMNONY
     C                     MOVEL'D'       PMOPT
     C                     CALL 'UTLR16'
     C                     PARM           PMNONY  4
     C                     PARM           PMOPT   1
     C                     PARM           PMNAME 20
     C                     PARM           PTOKU   4
     C                     PARM           PMRTN   1
     C                     MOVELPMNAME    ZVNAME
      *
     C                     MOVELZ7PRSN    ZVPRSN
     C                     WRITEANZWP7V1
      *
     C                     ENDSR
