     H            Y.
     F** AO#R07  *******************************************
     F*  AO#WP13 --> AL#WP13                       *
     F*     SAKAKI.       2020.02.03                       *
     F******************************************************
     FAO#WP13 IF  E           K        DISK
     FAL#WP13 O   E                    DISK                      A
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60STIME
     I                                        7  140SDATE
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 W#USER
     I                                      264 269 W#JBNO
      *
      *-----------------------------------------------------
      *  MAIN ROUTINE
      *-----------------------------------------------------
     C                     TIME           WTIME
      *
     C                     READ AO#WP131                 81
     C           *IN81     DOWEQ'0'
     C                     EXSR #SB001
     C                     READ AO#WP131                 81
     C                     ENDDO
      *
     C                     SETON                     LR
     C                     RETRN
      *----------------------------------------*
      * AL#WP13
      *----------------------------------------*
     CSR         #SB001    BEGSR
      *
     C                     CLEARAL#WP131
     C                     MOVELX3SHID    W3SHID
     C                     MOVELX3SHIT    W3SHIT
     C                     Z-ADDX3NONY    W3NONY
     C                     MOVELX3NKOJ    W3NKOJ
     C                     MOVELX3NUKE    W3NUKE
     C                     MOVELX3ORD#    W3ORD#
     C                     MOVELX3SURT    W3SURT
     C                     Z-ADDX3EXTR    W3EXTR
     C                     Z-ADDX3FIXD    W3FIXD
     C                     Z-ADDX3FIXT    W3FIXT
     C                     MOVELX3PALT    W3PALT
     C                     Z-ADDX3BOX     W3BOX
     C                     MOVELX3TRKB    W3TRKB
     C                     MOVELX3IAFB    W3IAFB
     C                     MOVELX3IAFP    W3IAFP
     C                     Z-ADDX3PRT     W3PRT
     C                     MOVELX3PPUL    W3PPUL
     C                     MOVELX3SAT     W3SAT
     C                     MOVELX3SHN1    W3SHN1
     C                     MOVELX3SHN2    W3SHN2
     C                     MOVELX3SHN3    W3SHN3
     C                     Z-ADDX3PSEQ    W3PSEQ
     C                     MOVELX3PPU2    W3PPU2
     C                     MOVELX3ZONE    W3ZONE
     C                     WRITEAL#WP131
      *
     CSR         ESB001    ENDSR
