     H            Y.
     F**APLR95********************************************
     F*データ転送先ファイル名取得                      *
     F*      MSK.                  2011.02.10            *
     F****************************************************
     FAPLPP95 IF  E           K        DISK
      *
     I            DS
     I                                        1   80A1SKHZ
     I                                        1   40A1SKYY
     I                                        5   60A1SKMM
     I                                        7   80A1SKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WTITM
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        9  140WTIH6
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W$PGM
     I                                      244 253 W$WSID
     I                                      254 263 @@USER
     I                                      264 269 W$JBNO
      *----------------------------------------------------*
      *パラメータ                                        *
      *   IN                                               *
      *      PPGMN  :ＣＬ名称                            *
      *      PWSID  :機番                                *
      *      PODIR  :転送先ファイル名                    *
      *      POSTS  : 0 =転送先指定なし                  *
      *             : 1 =転送先指定あり                  *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PPGMN  10
     C                     PARM           PWSID  10
     C                     PARM           PODIR 200
     C                     PARM           POSTS   1
      *
      *---------------------*
      * KLIST               *
      *---------------------*
     C           KEY1      KLIST
     C                     KFLD           #KPGMN 10
     C                     KFLD           #KWSID 10
      *
     C                     TIME           WTIME
     C                     MOVELPPGMN     #KPGMN
     C                     MOVELPWSID     #KWSID
     C                     MOVEL*BLANK    PODIR
     C                     MOVEL'0'       POSTS
      *ＣＬ＋機番
     C           KEY1      CHAINAPLPP951             21
     C           *IN21     IFEQ '0'
     C           A1SKJY    ANDEQ'D'
     C           A1SKHZ    ANDLEWTIHZ
     C                     SETON                     21
     C                     ENDIF
      *ＣＬ
     C           *IN21     IFEQ '1'
     C                     MOVEL*BLANK    #KWSID
     C           KEY1      CHAINAPLPP951             21
     C           *IN21     IFEQ '0'
     C           A1SKJY    ANDEQ'D'
     C           A1SKHZ    ANDLEWTIHZ
     C                     SETON                     21
     C                     ENDIF
     C                     ENDIF
      *
     C           *IN21     IFEQ '0'
     C                     MOVELA1DIR     PODIR
     C                     MOVEL'1'       POSTS
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
