     H            Y.
     F*** APLR30 *********************************
     F*社内品番ハイフン編集プログラム          *
     F*   C:T.SAKASHITA             2011.11.01   *
     F********************************************
     I            DS
     I                                        1  14 W@SHNA
     I                                        1   5 W@SHN1
     I                                        6   6 W@HF1
     I                                        7  11 W@SHN2
     I                                       12  12 W@HF2
     I                                       13  14 W@SHN3
     C           *ENTRY    PLIST
     C                     PARM           P@SHN1  5
     C                     PARM           P@SHN2  5
     C                     PARM           P@SHN3  2
     C                     PARM           P@SHNA 14
      *
     C                     MOVE *BLANK    W@SHNA
      *
     C                     MOVE P@SHN1    W@SHN1
     C                     MOVE P@SHN2    W@SHN2
     C                     MOVE P@SHN3    W@SHN3
      *
     C           W@SHN2    IFNE *BLANK
     C                     MOVE '-'       W@HF1
     C                     END
      *
     C           W@SHN3    IFNE *BLANK
     C                     MOVE '-'       W@HF2
     C                     END
      *
     C                     MOVE W@SHNA    P@SHNA
      *
     C                     SETON                     LR
     C                     RETRN
      *
