     H            Y.
     F*** APLR00 *********************************
     F* APPLICATION PROGRAM                    *
     F*         = MINUS USER NAME              *
     F* C:N.HAYAKAWA                1993.02.04   *
     F********************************************
     FRGAPL11 IF  E           K        DISK
     E                    TB1     1   4 10   TB2    15
      *
     C*-------------------------------------*
     C*パラメーターの説明                 *
     C*  P1=ユーザープロフィール   LEN=10 *
     C*  P2=ユーザー名             LEN=15 *
     C*-------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PUS    10
     C                     PARM           PUSNM  15
     C                     MOVE *BLANK    PUSNM
      *
     C                     SETOF                     10
     C                     Z-ADD1         A       10
     C           PUS       LOKUPTB1,A                    10
     C           *IN10     IFEQ '1'
     C                     MOVELTB2,A     PUSNM
     C                     ELSE
      *
     C                     SETOF                     10
     C           PUS       CHAINRGAPL111             10
     C           *IN10     IFEQ '0'
     C           J8SKJY    ANDEQ*BLANK
     C                     MOVELJ8NAME    PUSNM
     C                     END
      *
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
**  TB1.TB2
QPGMR     QPGMR
QSECOFR   QSECOFR
ZIDOU     ZIDOU
CHECK     CHK DAILY RPORT
