     H            Y.
     F*** APLR35 *********************************
     F*品番クリーニングプログラム              *
     F*   C:T.SAKASHITA             2012.10.30   *
     F*------------------------------------------*
     F* PARM( '12345-67890-12' '-' ' ')          *
     F********************************************
     E                    IHN        30  1
     E                    OHN        30  1
     I            DS
     I                                        1  30 IHN
     I                                        1  30 I@HIN
     I*
     I            DS
     I                                        1  30 OHN
     I                                        1  30 O@HIN
     C           *ENTRY    PLIST
     C                     PARM           P@IN   30
     C                     PARM           P@OUT  30
      *
     C                     MOVE P@IN      W@IN   30
     C                     MOVE *BLANK    P@OUT  30
      *ハイフン除去
     C                     MOVE '-'       P@JOKY  1
      *
     C                     CALL 'APLR35'
     C                     PARM           W@IN
     C                     PARM           P@JOKY
     C                     PARM           P@OUT
      *ブランク除去
     C                     MOVE ' '       P@JOKY  1
     C                     MOVELP@OUT     W@IN
      *
     C                     CALL 'APLR35'
     C                     PARM           W@IN
     C                     PARM           P@JOKY
     C                     PARM           P@OUT
      *
     C                     SETON                     LR
     C                     RETRN
      *
