     H            Y.                                                      ECM070
     F** APLR9C ********************************
     F*MESSAGE ONLY                            *
     F*COPY FROM APLR90                        *
     F* T.SAKASHITA ........  2013.04.30       *
     F******************************** APLR9A **
     FAPLPW9C CF  E                    WORKSTN
      *
     C*--------*
     C*DSPLAY  *
     C*--------*
     C           *ENTRY    PLIST
     C                     PARM           W@PGID 10
     C                     PARM           W@MSG 256
     C                     MOVELW@PGID    @PGID
     C                     MOVELW@MSG     @PMSG
     C*
     C* * *                MOVELER,1      @PMSG
     C*
     C           STP1      TAG
     C                     EXFMTAPLPW9C1
     C                     SETOF                     0199
      *
     C                     SETON                     LR
     C                     RETRN
      *
