     H            Y.
     F** APLR81 **************************************
     F* MULTIPLE PROCESS CONTROL  UNLOCK             *
     F*       T.SAKAKI      2016.10.13               *
     F************************************************
     FAPLPP80 UF  E           K        DISK
      *
     I            DS
     I                                        1   80A1SKHZ
     I                                        1   40A1SKYY
     I                                        5   60A1SKMM
     I                                        7   80A1SKDD
      *
     I            DS
     I                                        1  140WTIME
     I                                        1   60WJFB
     I                                        1   20TIMHH
     I                                        3   40TIMMM
     I                                        5   60TIMSS
     I                                        7  140WTIHZ
     I                                        7  100WTIYY
     I                                       11  120WTIMM
     I                                       13  140WTIDD
      *
     I           SDS
     I                                     *PROGRAM W#PGM
     I                                      244 253 W#WSID
     I                                      254 263 @@USER
     I                                      264 269 W#JBNO
      *----------------------------------------------------*
      * PARAMETER                                        *
      *   IN                                               *
      *      PIPGMN : PROGRAM NAME (CL)                    *
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PIPGMN 10
      *
     C                     TIME           WTIME
      * UNLOCK
     C           PIPGMN    CHAINAPLPP801             21
      *
     C           *IN21     IFEQ '0'
     C                     EXSR #DLT
     C                     ENDIF
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *----------------------------------------------------*
      * UPDATE RECORD                                    *
      *----------------------------------------------------*
     CSR         #DLT      BEGSR
      *
     C                     MOVEL'D'       A1SKJY
     C                     Z-ADDWTIYY     A1SKYY
     C                     Z-ADDWTIMM     A1SKMM
     C                     Z-ADDWTIDD     A1SKDD
     C                     Z-ADDWTIYY     A1EDYY
     C                     Z-ADDWTIMM     A1EDMM
     C                     Z-ADDWTIDD     A1EDDD
     C                     Z-ADDTIMHH     A1EDTH
     C                     Z-ADDTIMMM     A1EDTM
     C                     Z-ADDTIMSS     A1EDTS
     C                     UPDATAPLPP801
      *
     CSR         EDLT      ENDSR
      *
