     H            Y.
     F*** APLR47 *********************************
     F* SYYMMDDJJFFSS -> YYYYMMDD JJFFSS         *
     F*   C:T.SAKASHITA             2015.12.16   *
     F********************************************
     I            DS
     I                                        1  13 W@DTTM
     I                                        1   1 W@CEN
     I                                        2   7 W@YMD6
     I                                        8  13 W@TIME
     C           *ENTRY    PLIST
     C                     PARM           P@DTTM 13
     C                     PARM           P@YMD8  8
     C                     PARM           P@TIME  6
      *
     C                     MOVE *BLANK    P@YMD8
     C                     MOVE *BLANK    P@TIME
      *
     C                     MOVE P@DTTM    W@DTTM
      *
     C           W@CEN     IFEQ '0'
     C                     MOVEL'19'      P@YMD8
     C                     END
     C           W@CEN     IFEQ '1'
     C                     MOVEL'20'      P@YMD8
     C                     END
      *
     C                     MOVE W@YMD6    P@YMD8
      *
     C                     MOVE W@TIME    P@TIME
      *
     C                     SETON                     LR
     C                     RETRN
      *
