     H            Y.
     F** APLR91 **************************************
     F*汎用データ転送                              *
     F*        MSK.         2011.02.10               *
     F************************************************
     FAPLPP00 UF  F     256            DISK
      *
     IAPLPP00 AA  01
     I                                        1 256 INR1
      *
     I            DS
     I                                        1 256 FLD1
     I                                       13  33 FRM
      *----------------------------------------------------*
      *パラメータ                                        *
      *   IN                                               *
      *      PFRMLB :転送元ライブラリー                  *
      *      PFRMFL :転送元ファイル                      *
      *      PTYPE  :転送元タイプ                      *
      *               '1':PCﾃｰnﾞmgﾇn                       *
      *               '3':BASIC順次                      *
      *               '9':BIFF4                            *
      *      PTODIR :転送先ディレクトリ（ファイル名まで）*
      *----------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           PFRMLB 10
     C                     PARM           PFRMFL 10
     C                     PARM           PTYPE   1
     C                     PARM           PTODIR200
      *
     C                     MOVEL*BLANK    WKFRM  31
     C           PFRMLB    CAT  '/':0     WKFRM
     C           WKFRM     CAT  PFRMFL:0  WKFRM
     C           3         CHAINAPLPP00              21
     C                     MOVELINR1      FLD1
     C                     MOVELWKFRM     FRM
     C                     EXCPTDT
      *
     C           8         CHAINAPLPP00              21
     C                     MOVEL*BLANK    FLD1
     C                     MOVELPTODIR    FLD1
     C                     EXCPTDT
      *
     C           9         CHAINAPLPP00              21
     C                     MOVELINR1      FLD1
     C                     MOVELPTYPE     FLD1
     C                     EXCPTDT
      *
     C                     SETON                     LR
     C                     RETRN
      *
      *
     OAPLPP00 E                DT
     O                         FLD1     256
