     H            Y.
     F*** ARAR21 *******************************************
     F*     オフラインかんばん用マスターデータ作成       *
     F*         H.ITO                  1994.11.18          *
     F* UPDATE:K.OKACHI 99.06.02 %0002                     *
     F* 2021.02.10 DCS. T.MITSUI
     F*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     F* 2021.03.10 DCS. T.MITSUI
     F*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     F* 2021.03.24 DCS. T.MITSUI
     F*   CHANGE WITH THE NUMBER OF FIGURES EXPANSION OF THE "KANBAN"
     F****************************************************** ARAR21 ***
     FARAPP01 IP  E                    DISK
     FAAFTL01 IF  E           K        DISK
     FAAGTL01 IF  E           K        DISK
     FAAHTL01 IF  E           K        DISK
     FAAPTL01 IF  E           K        DISK
     FGCMPP31 IF  E                    DISK
     FAATPP01 IF  E                    DISK
     FAAAPP01 IF  E                    DISK
%0002FAAMPL11 IF  E           K        DISK
%0001FARAWP21 O   F     300            DISK                      A
      * %0002 STRAT -----------------------------------------*
     E                    @UKO       15 10 0             かんばん切替日
     E                    @KS        15  1               かんばん種類
     E                    @TK        15  6               旧所番地Ｍ
     E                    OKAB       15  1               旧かんばん種類Ｍ
     E                    OTKR       15  6               旧所番地Ｍ
     E                    NKAB       15  1               新かんばん種類Ｍ
     E                    NTKR       15  6               新所番地Ｍ
      * %0002 END ------------------------------------------*
     I            DS
     I                                        1   80A3SKHZ
     I                                        1   40A3SKYY
     I                                        5   60A3SKMM
     I                                        7   80A3SKDD
     I            DS
     I                                        1   80A3UKHZ
     I                                        1   40A3UKYY
     I                                        5   60A3UKMM
     I                                        7   80A3UKDD
     I            DS
     I                                        1   80A3STHZ
     I                                        1   40A3STYY
     I                                        5   60A3STMM
     I                                        7   80A3STDD
     I            DS
     I                                        1   80O4SKHZ
     I                                        1   40O4SKYY
     I                                        5   60O4SKMM
     I                                        7   80O4SKDD
     I            DS
     I                                        1   80O4UKHZ
     I                                        1   40O4UKYY
     I                                        5   60O4UKMM
     I                                        7   80O4UKDD
     I            DS
     I                                        1   80O4STHZ
     I                                        1   40O4STYY
     I                                        5   60O4STMM
     I                                        7   80O4STDD
     I            DS
     I                                        1   80L6SKHZ
     I                                        1   40L6SKYY
     I                                        5   60L6SKMM
     I                                        7   80L6SKDD
     I            DS
     I                                        1   80L6UKHZ
     I                                        1   40L6UKYY
     I                                        5   60L6UKMM
     I                                        7   80L6UKDD
     I            DS
     I                                        1   80L6STHZ
     I                                        1   40L6STYY
     I                                        5   60L6STMM
     I                                        7   80L6STDD
     I            DS
     I                                        1   80L5SKHZ
     I                                        1   40L5SKYY
     I                                        5   60L5SKMM
     I                                        7   80L5SKDD
     I            DS
     I                                        1   80L5UKHZ
     I                                        1   40L5UKYY
     I                                        5   60L5UKMM
     I                                        7   80L5UKDD
     I            DS
     I                                        1   80L5STHZ
     I                                        1   40L5STYY
     I                                        5   60L5STMM
     I                                        7   80L5STDD
     I            DS
     I                                        1   80T3SKHZ
     I                                        1   40T3SKYY
     I                                        5   60T3SKMM
     I                                        7   80T3SKDD
     I            DS
     I                                        1   80A5SKHZ
     I                                        1   40A5SKYY
     I                                        5   60A5SKMM
     I                                        7   80A5SKDD
     I            DS
     I                                        1   80DCSKHZ
     I                                        1   40DCSKYY
     I                                        5   60DCSKMM
     I                                        7   80DCSKDD
     I            DS
     I                                        1   80@NOHZ
     I                                        1   40@NOYY
     I                                        5   60@NOMM
     I                                        7   80@NODD
      * %0002 STRAT ----------------------------------------*
     I            DS
     I                                        1 1500@UKO
     I                                        1  100CKHZ01
     I                                       11  200CKHZ02
     I                                       21  300CKHZ03
     I                                       31  400CKHZ04
     I                                       41  500CKHZ05
     I                                       51  600CKHZ06
     I                                       61  700CKHZ07
     I                                       71  800CKHZ08
     I                                       81  900CKHZ09
     I                                       91 1000CKHZ10
     I                                      101 1100CKHZ11
     I                                      111 1200CKHZ12
     I                                      121 1300CKHZ13
     I                                      131 1400CKHZ14
     I                                      141 1500CKHZ15
     I            DS
     I                                        1  15 OKAB
     I                                        1   1 CKQS01
     I                                        2   2 CKQS02
     I                                        3   3 CKQS03
     I                                        4   4 CKQS04
     I                                        5   5 CKQS05
     I                                        6   6 CKQS06
     I                                        7   7 CKQS07
     I                                        8   8 CKQS08
     I                                        9   9 CKQS09
     I                                       10  10 CKQS10
     I                                       11  11 CKQS11
     I                                       12  12 CKQS12
     I                                       13  13 CKQS13
     I                                       14  14 CKQS14
     I                                       15  15 CKQS15
     I            DS
     I                                        1  90 OTKR
     I                                        1   6 CKQT01
     I                                        7  12 CKQT02
     I                                       13  18 CKQT03
     I                                       19  24 CKQT04
     I                                       25  30 CKQT05
     I                                       31  36 CKQT06
     I                                       37  42 CKQT07
     I                                       43  48 CKQT08
     I                                       49  54 CKQT09
     I                                       55  60 CKQT10
     I                                       61  66 CKQT11
     I                                       67  72 CKQT12
     I                                       73  78 CKQT13
     I                                       79  84 CKQT14
     I                                       85  90 CKQT15
     I            DS
     I                                        1  15 NKAB
     I                                        1   1 CKTY01
     I                                        2   2 CKTY02
     I                                        3   3 CKTY03
     I                                        4   4 CKTY04
     I                                        5   5 CKTY05
     I                                        6   6 CKTY06
     I                                        7   7 CKTY07
     I                                        8   8 CKTY08
     I                                        9   9 CKTY09
     I                                       10  10 CKTY10
     I                                       11  11 CKTY11
     I                                       12  12 CKTY12
     I                                       13  13 CKTY13
     I                                       14  14 CKTY14
     I                                       15  15 CKTY15
     I            DS
     I                                        1  90 NTKR
     I                                        1   6 CKNB01
     I                                        7  12 CKNB02
     I                                       13  18 CKNB03
     I                                       19  24 CKNB04
     I                                       25  30 CKNB05
     I                                       31  36 CKNB06
     I                                       37  42 CKNB07
     I                                       43  48 CKNB08
     I                                       49  54 CKNB09
     I                                       55  60 CKNB10
     I                                       61  66 CKNB11
     I                                       67  72 CKNB12
     I                                       73  78 CKNB13
     I                                       79  84 CKNB14
     I                                       85  90 CKNB15
     I            DS
     I                                        1  100A3UKHB
     I                                        1   80A3UK
     I                                        9  100A3UBIN
     I            DS
     I                                        1  100A3STHB
     I                                        1   80A3ST
     I                                        9  100A3SBIN
     I            DS
     I                                        1  100O4UKHB
     I                                        1   80O4UK
     I                                        9  100O4UBIN
     I            DS
     I                                        1  100O4STHB
     I                                        1   80O4ST
     I                                        9  100O4SBIN
     I            DS
     I                                        1  100L6UKHB
     I                                        1   80L6UK
     I                                        9  100L6UBIN
     I            DS
     I                                        1  100L6STHB
     I                                        1   80L6ST
     I                                        9  100L6SBIN
     I            DS
     I                                        1  100L5UKHB
     I                                        1   80L5UK
     I                                        9  100L5UBIN
     I            DS
     I                                        1  100L5STHB
     I                                        1   80L5ST
     I                                        9  100L5SBIN
      * %0002 END ------------------------------------------*
     C           #KEY1     KLIST
     C                     KFLD           ARSHN1
     C                     KFLD           ARSHN2
     C                     KFLD           ARSHN3
     C                     MOVE ARNOYY    @NOYY
     C                     MOVE ARNOMM    @NOMM
     C                     MOVE ARNODD    @NODD
     C*
     C           ARKDAI    CASEQ'C'       $MEKI
     C           ARKDAI    CASEQ'D'       $TONL
     C           ARKDAI    CASEQ'E'       $HIKI
     C           ARKDAI    CASEQ'0'       $KANS
     C                     END
     C*
     C                     EXSR #GCM
     C                     EXSR #AAT
     C                     EXSR #AAA
     C*****************************************************************
     C           $MEKI     BEGSR
     C*****************************************************************
     C           #KEY1     SETLLAAFTL011
     C                     DO   *HIVAL
     C                     SETOF                         01
     C           #KEY1     READEAAFTL011                 01
     C           *IN01     CABEQ'1'       @002
     C           A3SKJY    IFEQ 'D'
     C           A3SKHZ    CABLE*DATE     @RTRY2
     C                     END
      *
     C           A3UKHZ    IFGE @NOHZ
     C*
     C           A3STHZ    CABLT@NOHZ     @RTRY2
     C                     END
     C           A3DTKO    CABEQ'2'       @RTRY2
     C           A3DTKO    CABEQ'6'       @RTRY2
      *
%0002C                     EXSR MKSUB
%0002C           CHK       IFEQ *BLANK
     C                     Z-ADDA3KALL    @3KALL  30
     C                     Z-ADDA3KAIS    @3KAIS  30
     C                     Z-ADDA3KMIN    @3KMIN  30
     C                     Z-ADDA3KMAX    @3KMAX  30
     C                     Z-ADDA3SRMS    @3SRMS  30
     C                     Z-ADDA3ALHK    @3ALHK  30
     C                     Z-ADDA3MXHK    @3MXHK  30
     C                     Z-ADDA3JDMS    @3JDMS  30
     C                     EXCPTAAFWTR
%0002C                     END
     C           @RTRY2    TAG
     C                     END
     C           @002      TAG
     C                     ENDSR
     C*****************************************************************
     C           $TONL     BEGSR
     C*****************************************************************
     C           #KEY1     SETLLAAGTL011
     C                     DO   *HIVAL
     C                     SETOF                         01
     C           #KEY1     READEAAGTL011                 01
     C           *IN01     CABEQ'1'       @003
     C           O4SKJY    IFEQ 'D'
     C           O4SKHZ    CABLE*DATE     @RTRY3
     C                     END
     C           O4UKHZ    IFGE @NOHZ
      *
     C           O4STHZ    CABLT@NOHZ     @RTRY3
     C                     END
     C           O4DTKO    CABEQ'2'       @RTRY3
     C           O4DTKO    CABEQ'6'       @RTRY3
%0002C                     EXSR TNSUB
%0002C           CHK       IFEQ *BLANK
     C                     EXCPTAAGWTR
%0002C                     END
     C           @RTRY3    TAG
     C                     END
     C           @003      TAG
     C                     ENDSR
     C*****************************************************************
     C           $HIKI     BEGSR
     C*****************************************************************
     C           #KEY1     SETLLAAHTL011
     C                     DO   *HIVAL
     C                     SETOF                         01
     C           #KEY1     READEAAHTL011                 01
     C           *IN01     CABEQ'1'       @004
     C           L6SKJY    IFEQ 'D'
     C           L6SKHZ    CABLE*DATE     @RTRY4
     C                     END
     C           L6UKHZ    IFGE @NOHZ
     C           L6STHZ    CABLT@NOHZ     @RTRY4
     C                     END
     C           L6DTKO    CABEQ'2'       @RTRY4
     C           L6DTKO    CABEQ'6'       @RTRY4
%0002C                     EXSR HTSUB
%0002C           CHK       IFEQ *BLANK
     C                     Z-ADDL6KALL    @6KALL  30
     C                     Z-ADDL6KAIS    @6KAIS  30
     C                     Z-ADDL6KMIN    @6KMIN  30
     C                     Z-ADDL6KMAX    @6KMAX  30
     C                     Z-ADDL6SRMS    @6SRMS  30
     C                     Z-ADDL6ALHK    @6ALHK  30
     C                     Z-ADDL6MXHK    @6MXHK  30
     C                     Z-ADDL6JDMS    @6JDMS  30
     C                     EXCPTAAHWTR
%0002C                     END
     C           @RTRY4    TAG
     C                     END
     C           @004      TAG
     C                     ENDSR
     C*****************************************************************
     C           $KANS     BEGSR
     C*****************************************************************
     C           #KEY1     SETLLAAPTL011
     C                     DO   *HIVAL
     C                     SETOF                         01
     C           #KEY1     READEAAPTL011                 01
     C           *IN01     CABEQ'1'       @005
     C           L5SKJY    IFEQ 'D'
     C           L5SKHZ    CABLE*DATE     @RTRY5
     C                     END
     C           L5UKHZ    IFGE @NOHZ
     C           L5STHZ    CABLT@NOHZ     @RTRY5
     C                     END
     C           L5DTKO    CABEQ'2'       @RTRY5
     C           L5DTKO    CABEQ'6'       @RTRY5
%0002C                     EXSR KNSUB
%0002C           CHK       IFEQ *BLANK
     C                     Z-ADDL5KALL    @5KALL  30
     C                     Z-ADDL5MAIS    @5MAIS  30
     C                     Z-ADDL5KMIN    @5KMIN  30
     C                     Z-ADDL5KMAX    @5KMAX  30
     C                     Z-ADDL5SRMS    @5SRMS  30
     C                     Z-ADDL5ALHK    @5ALHK  30
     C                     Z-ADDL5MXHK    @5MXHK  30
     C                     Z-ADDL5JDMS    @5JDMS  30
     C                     EXCPTAAPWTR
%0002C                     END
     C           @RTRY5    TAG
     C                     END
     C           @005      TAG
     C                     ENDSR
     C*****************************************************************
     C           #GCM      BEGSR
     C*****************************************************************
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ GCMPP311                 01
     C           *IN01     CABEQ'1'       @006
     C           T3SKJY    IFEQ 'D'
     C           T3SKHZ    CABLE@NOHZ     @RTRY6
     C                     END
     C                     EXCPTGCMWTR
     C           @RTRY6    TAG
     C                     END
     C           @006      TAG
     C                     ENDSR
     C*****************************************************************
     C           #AAT      BEGSR
     C*****************************************************************
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ AATPP011                 01
     C           *IN01     CABEQ'1'       @007
     C           DCSKJY    IFEQ 'D'
     C           DCSKHZ    CABLE@NOHZ     @RTRY7
     C                     END
     C                     EXCPTAATWTR
     C           @RTRY7    TAG
     C                     END
     C           @007      TAG
     C                     ENDSR
     C*****************************************************************
     C           #AAA      BEGSR
     C*****************************************************************
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ AAAPP011                 01
     C           *IN01     CABEQ'1'       @008
     C           A5SKJY    IFEQ 'D'
     C           A5SKHZ    CABLE@NOHZ     @RTRY8
     C                     END
     C           A5KANB    IFEQ 'C'
     C           A5KANB    OREQ 'D'
     C           A5KANB    OREQ 'E'
     C           A5KANB    OREQ '0'
     C                     ELSE
     C                     GOTO @RTRY8
     C                     END
     C                     EXCPTAAAWTR
     C           @RTRY8    TAG
     C                     END
     C           @008      TAG
     C                     ENDSR
     C*
      * %0002 STRAT ----------------------------------------*
      *--------------------------------------------------------------*
      *社内かんばん切替マスターより自工程後にA-PICSかんばん有りか*
      *--------------------------------------------------------------*
      *  xｮgかんばん--------------------------------------*
     CSR         MKSUB     BEGSR
     C           WKEY      KLIST
     C                     KFLD           KHIN1
     C                     KFLD           KHIN2
     C                     KFLD           KHIN3
      *
     C                     MOVE *BLANK    KHIN1   5
     C                     MOVE *BLANK    KHIN2   5
     C                     MOVE *BLANK    KHIN3   2
      *
     C                     MOVELA31HB5    KHIN1
     C                     MOVELA32HB5    KHIN2
     C                     MOVELA33HB2    KHIN3
     C                     MOVE *BLANK    CHK     1
     C                     Z-ADDA3UKHZ    A3UK
     C                     Z-ADDA3STHZ    A3ST
      *
     C                     SETOF                     77
     C           WKEY      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         #X      20
     C                     Z-ADD0         @X      20
      *
     C           1         DO   15        #X
     C           @UKO,#X   IFGE A3UKHB
     C           @UKO,#X   ANDLTA3STHB
     C                     ADD  1         @X
     C                     MOVE NKAB,#X   @KS,@X
     C                     MOVE NTKR,#X   @TK,@X
     C                     ELSE
     C                     ADD  1         @X
     C                     MOVE OKAB,#X   @KS,@X
     C                     MOVE OTKR,#X   @TK,@X
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD1         $X      20
     C                     SETOF                     70
     C           A3ATKR    LOKUP@TK,$X                   70
      *
     C                     ADD  1         $X
     C                     Z-ADD$X        #X      20
     C           @X        IFNE 0
     C           $X        DO   @X        #X
     C           @KS,#X    IFNE *BLANK
      *
     C           @KS,#X    IFEQ 'C'
     C           @KS,#X    OREQ 'D'
     C           @KS,#X    OREQ 'E'
     C           @KS,#X    OREQ '0'
     C           @KS,#X    OREQ 'F'
     C                     MOVE '*'       CHK
     C                     END
      *
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     END
     C                     END
     CSR         MKSUBE    ENDSR
      *  n]rﾓかんばん ------------------------------------*
     CSR         TNSUB     BEGSR
      *
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
      *
     C                     MOVELO4SHN1    KHIN1
     C                     MOVELO4SHN2    KHIN2
     C                     MOVELO4SHN3    KHIN3
     C                     MOVE *BLANK    CHK
     C                     Z-ADDO4UKHZ    O4UK
     C                     Z-ADDO4STHZ    O4ST
      *
     C                     SETOF                     77
     C           WKEY      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         #X
     C                     Z-ADD0         @X
      *
     C           1         DO   15        #X
     C           @UKO,#X   IFGE O4UKHB
     C           @UKO,#X   ANDLTO4STHB
     C                     ADD  1         @X
     C                     MOVE NKAB,#X   @KS,@X
     C                     MOVE NTKR,#X   @TK,@X
     C                     ELSE
     C                     ADD  1         @X
     C                     MOVE OKAB,#X   @KS,@X
     C                     MOVE OTKR,#X   @TK,@X
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD1         $X
     C                     SETOF                     70
     C           O4AKRO    LOKUP@TK,$X                   70
      *
     C                     ADD  1         $X
     C                     Z-ADD$X        #X
     C           @X        IFNE 0
     C           $X        DO   @X        #X
     C           @KS,#X    IFNE *BLANK
      *
     C           @KS,#X    IFEQ 'C'
     C           @KS,#X    OREQ 'D'
     C           @KS,#X    OREQ 'E'
     C           @KS,#X    OREQ '0'
     C           @KS,#X    OREQ 'F'
     C                     MOVE '*'       CHK
     C                     END
      *
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     END
     C                     END
     CSR         TNSUBE    ENDSR
      *  引取りかんばん ----------------------------------*
     CSR         HTSUB     BEGSR
      *
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
      *
     C                     MOVELL6SHN1    KHIN1
     C                     MOVELL6SHN2    KHIN2
     C                     MOVELL6SHN3    KHIN3
     C                     MOVE *BLANK    CHK
     C                     Z-ADDL6UKHZ    L6UK
     C                     Z-ADDL6STHZ    L6ST
      *
     C                     SETOF                     77
     C           WKEY      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         #X
     C                     Z-ADD0         @X
      *
     C           1         DO   15        #X
     C           @UKO,#X   IFGE L6UKHB
     C           @UKO,#X   ANDLTL6STHB
     C                     ADD  1         @X
     C                     MOVE NKAB,#X   @KS,@X
     C                     MOVE NTKR,#X   @TK,@X
     C                     ELSE
     C                     ADD  1         @X
     C                     MOVE OKAB,#X   @KS,@X
     C                     MOVE OTKR,#X   @TK,@X
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD1         $X
     C                     SETOF                     70
     C           L6ATKR    LOKUP@TK,$X                   70
      *
     C                     ADD  1         $X
     C                     Z-ADD$X        #X
     C           @X        IFNE 0
     C           $X        DO   @X        #X
     C           @KS,#X    IFNE *BLANK
      *
     C           @KS,#X    IFEQ 'C'
     C           @KS,#X    OREQ 'D'
     C           @KS,#X    OREQ 'E'
     C           @KS,#X    OREQ '0'
     C           @KS,#X    OREQ 'F'
     C                     MOVE '*'       CHK
     C                     END
      *
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     END
     C                     END
     CSR         HTSUBE    ENDSR
      *  完成品かんばん ----------------------------------*
     CSR         KNSUB     BEGSR
      *
     C                     MOVE *BLANK    KHIN1
     C                     MOVE *BLANK    KHIN2
     C                     MOVE *BLANK    KHIN3
      *
     C                     MOVELL5SHN1    KHIN1
     C                     MOVELL5SHN2    KHIN2
     C                     MOVELL5SHN3    KHIN3
     C                     MOVE *BLANK    CHK
     C                     Z-ADDL5UKHZ    L5UK
     C                     Z-ADDL5STHZ    L5ST
      *
     C                     SETOF                     77
     C           WKEY      CHAINAAMPL111             77
     C           *IN77     IFEQ '0'
     C           CKSKJY    IFEQ 'D'
     C           CKSKHZ    ANDLE*DATE
     C                     ELSE
     C                     Z-ADD1         #X
     C                     Z-ADD0         @X
      *
     C           1         DO   15        #X
     C           @UKO,#X   IFGE L5UKHB
     C           @UKO,#X   ANDLTL5STHB
     C                     ADD  1         @X
     C                     MOVE NKAB,#X   @KS,@X
     C                     MOVE NTKR,#X   @TK,@X
     C                     ELSE
     C                     ADD  1         @X
     C                     MOVE OKAB,#X   @KS,@X
     C                     MOVE OTKR,#X   @TK,@X
     C                     END
     C                     ENDDO
      *
     C                     Z-ADD1         $X
     C                     SETOF                     70
     C           L5TKRO    LOKUP@TK,$X                   70
      *
     C                     ADD  1         $X
     C                     Z-ADD$X        #X
     C           @X        IFNE 0
     C           $X        DO   @X        #X
     C           @KS,#X    IFNE *BLANK
      *
     C           @KS,#X    IFEQ 'C'
     C           @KS,#X    OREQ 'D'
     C           @KS,#X    OREQ 'E'
     C           @KS,#X    OREQ '0'
     C           @KS,#X    OREQ 'F'
     C                     MOVE '*'       CHK
     C                     END
      *
     C                     END
     C                     ENDDO
     C                     END
      *
     C                     END
     C                     END
     CSR         KNSUBE    ENDSR
      * %0002 END ------------------------------------------*
     OARAWP21 EADD             AAFWTR
     O                                    2 'MK'
     O                         A3SKJY     3
     O                         A3SKYY     7
     O                         A3SKMM     9
     O                         A3SKDD    11
     O                         A3KOYY    15
     O                         A3KOMM    17
     O                         A3KODD    19
     O                         A3KOHH    21
     O                         A3KOSS    23
     O                         A3KOME    33
     O                         A31HB5    38
     O                         A32HB5    43
     O                         A33HB2    45
     O                         A3TKYY    49
     O                         A3TKMM    51
     O                         A3TKDD    53
     O                         A3TBIN    55
     O                         A3UKYY    59
     O                         A3UKMM    61
     O                         A3UKDD    63
     O                         A3UBIN    65
     O                         A3STYY    69
     O                         A3STMM    71
     O                         A3STDD    73
     O                         A3SBIN    75
     O                         A3ATOK    78
     O                         A3ATOB    82
     O                         A3ATYP    83
     O                         A3ATOH    84
     O                         A3ATK1    85
     O                         A3ATK2    87
     O                         A3ATK3    89
     O                         A3ATK4    90
     O                         A3MAEK    93
     O                         A3MAKB    97
     O                         A3MTYP    98
     O                         A3MAEH   100
     O                         A3MTK1   101
     O                         A3MTK2   103
     O                         A3MTK3   105
     O                         A3MTK4   106
     O                         A3KCD1   107
     O                         A3KCD2   108
     O                         A3STI1   110
     O                         A3JOK1   112
     O                         A3JOK2   114
     O                         A3JOK3   116
     O                         A3JOK4   118
     O                         A3JOK5   120
     O                         A3JOK6   122
     O                         A3JOK7   124
     O                         A3JOK8   126
     O                         A3YOSI   128
     O                         A3MEKI   135
     O                         A3CBKO   137
     O                         A3MAXH   140
     O                         A3SSYS   145
     O                         A3SSYT   146
     O                         A3BARA   148
     O                         A3BARB   150
     O                         A3RAIN   151
     O                         A3LOTO   153
     O                         A3READ   156
     O                         A3KEIS   159
     O                         A3KASI   166
     O                         A3ZMEN   167
     O                         A3ZETI   171
     O                         A3KSNK   172
     O*****                    A3KALL   175
     O                         @3KALL   175
     O*****                    A3KAIS   178
     O                         @3KAIS   178
     O*****                    A3KMIN   181
     O                         @3KMIN   181
     O*****                    A3KMAX   184
     O                         @3KMAX   184
     O*****                    A3SRMS   187
     O                         @3SRMS   187
     O*****                    A3ALHK   190
     O                         @3ALHK   190
     O*****                    A3MXHK   193
     O                         @3MXHK   193
     O                                  194 ' '
     O                         A3KTSU   203
     O                         A3KSSU   212
     O                         A3KOUT   213
     O                         A3DOUT   214
     O                         A3DTKO   215
     O                         A3DTHE   216
     O*****                    A3JDMS   219
     O                         @3JDMS   219
     O                         A3SHIY   221
     O                         A3HINM   226
     O        EADD             AAGWTR
     O                                    2 'TN'
     O                         O4SKJY     3
     O                         O4SKYY     7
     O                         O4SKMM     9
     O                         O4SKDD    11
     O                         O4KOYY    15
     O                         O4KOMM    17
     O                         O4KODD    19
     O                         O4KOHH    21
     O                         O4KOSS    23
     O                         O4KOME    33
     O                         O4SHN1    38
     O                         O4SHN2    43
     O                         O4SHN3    45
     O                         O4TKYY    49
     O                         O4TKMM    51
     O                         O4TKDD    53
     O                         O4TBIN    55
     O                         O4UKYY    59
     O                         O4UKMM    61
     O                         O4UKDD    63
     O                         O4UBIN    78
     O                         O4STYY    82
     O                         O4STMM    83
     O                         O4STDD    84
     O                         O4SBIN    86
     O                         O4KTEI    78
     O                         O4KOCD    82
     O                         O4KTYP    83
     O                         O4BAN1    84
     O                         O4BAN2    86
     O                         O4BAN3    88
     O                         O4BAN4    89
     O                         O4KAEH    90
     O                         O4MAEK    93
     O                         O4MAKB    97
     O                         O4MTYP    98
     O                         O4MTK1    99
     O                         O4MTK2   101
     O                         O4MTK3   103
     O                         O4MTK4   104
     O                         O4MAEH   106
     O                         O4KOA1   109
     O                         O4KOA2   112
     O                         O4KOA3   115
     O                         O4KOB1   118
     O                         O4KOB2   121
     O                         O4KOB3   124
     O                         O4BMON   128
     O                         O4ATYP   129
     O                         O4ATOH   131
     O                         O4RAIN   132
     O                         O4CBKO   134
     O                         O4BARA   136
     O                         O4BARB   138
     O                         O4JOK1   140
     O                         O4JOK2   142
     O                         O4JOK3   144
     O                         O4JOK4   146
     O                         O4JOK5   148
     O                         O4JOK6   150
     O                         O4KAK1   152
     O                         O4KAK2   154
     O                         O4KAK3   156
     O                         O4SYOS   161
     O                         O4SYOT   162
     O                         O4LTIM   166
     O                         O4KEIS   170
     O                         O4STI1   172
     O                         O4RIBH   186
     O                         O4LOTO   189
     O                         O4MAXH   192
     O                         O4YOUS   196
     O                         O4KCD1   197
     O                         O4KCD2   198
     O                         O4MEKI   205
     O                         O4ZETI   209
     O                         O4KSKB   210
     O                         O4KALL   213
     O                         O4MAIS   216
     O                         O4KMIN   219
     O                         O4KMAX   222
     O                         O4SRMS   225
     O                         O4ALHK   228
     O                         O4MXHK   231
     O                         O4KSHK   232
     O                         O4KTSU   241
     O                         O4KSSU   250
     O                         O4KOUT   251
     O                         O4DOUT   252
     O                         O4TISU   255
     O                         O4DTKO   256
     O                         O4DTHE   257
     O                         O4JDMS   260
     O                         O4NHH1   262
     O                         O4NMM1   264
     O                         O4NHH2   266
     O                         O4NMM2   268
     O                         O4SK11   270
     O                         O4SK21   272
     O                         O4SK31   274
     O                         O4SK12   276
     O                         O4SK22   278
     O                         O4SK32   280
     O                         O4SHIY   282
     O                         O4HINM   287
     O                         O4KASI   294
     O                         O4ZMEN   295
     O        EADD             AAHWTR
     O                                    2 'HT'
     O                         L6SKJY     3
     O                         L6SKYY     7
     O                         L6SKMM     9
     O                         L6SKDD    11
     O                         L6KOYY    15
     O                         L6KOMM    17
     O                         L6KODD    19
     O                         L6KOHH    21
     O                         L6KOSS    23
     O                         L6KOME    33
     O                         L6SHN1    38
     O                         L6SHN2    43
     O                         L6SHN3    45
     O                         L6TKYY    49
     O                         L6TKMM    51
     O                         L6TKDD    53
     O                         L6TBIN    55
     O                         L6UKYY    59
     O                         L6UKMM    61
     O                         L6UKDD    63
     O                         L6UBIN    65
     O                         L6STYY    69
     O                         L6STMM    71
     O                         L6STDD    73
     O                         L6SBIN    75
     O                         L6ATOK    78
     O                         L6ATOB    82
     O                         L6ATYP    83
     O                         L6ATOH    84
     O                         L6ATK1    85
     O                         L6ATK2    87
     O                         L6ATK3    89
     O                         L6ATK4    90
     O                         L6MAEK    93
     O                         L6MAKB    97
     O                         L6MTYP    98
     O                         L6MAEH   100
     O                         L6MTK1   101
     O                         L6MTK2   103
     O                         L6MTK3   105
     O                         L6MTK4   106
     O                         L6KCD1   107
     O                         L6KCD2   108
     O                         L6STI1   110
     O                         L6JOK1   112
     O                         L6JOK2   114
     O                         L6JOK3   116
     O                         L6JOK4   118
     O                         L6JOK5   120
     O                         L6JOK6   122
     O                         L6JOK7   124
     O                         L6JOK8   126
     O                         L6YOSI   130
     O                         L6BIKO   150
     O                         L6SYOS   155
     O                         L6SYOT   156
     O                         L6LTIM   159
     O                         L6KEIS   162
     O                         L6LOTO   164
     O                         L6MAXH   167
     O                         L6ZMEN   168
     O                         L6ZETI   172
     O                         L6KSNK   173
     O****                     L6KALL   176
     O                         @6KALL   176
     O****                     L6KAIS   179
     O                         @6KAIS   179
     O****                     L6KMIN   182
     O                         @6KMIN   182
     O****                     L6KMAX   185
     O                         @6KMAX   185
     O****                     L6SRMS   188
     O                         @6SRMS   188
     O****                     L6ALHK   191
     O                         @6ALHK   191
     O****                     L6MXHK   194
     O                         @6MXHK   194
     O                         L6KSHK   195
     O                         L6KTSU   204
     O                         L6KSSU   213
     O                         L6KOUT   214
     O                         L6DOUT   215
     O                         L6DTKO   216
     O                         L6DTHE   217
     O****                     L6JDMS   220
     O                         @6JDMS   220
     O                         L6SHIY   222
     O                         L6HINM   227
     O        EADD             AAPWTR
     O                                    2 'KN'
     O                         L5SKJY     3
     O                         L5SKYY     7
     O                         L5SKMM     9
     O                         L5SKDD    11
     O                         L5KOYY    15
     O                         L5KOMM    17
     O                         L5KODD    19
     O                         L5KOHH    21
     O                         L5KOSS    23
     O                         L5KOME    33
     O                         L5SHN1    38
     O                         L5SHN2    43
     O                         L5SHN3    45
     O                         L5TKYY    49
     O                         L5TKMM    51
     O                         L5TKDD    53
     O                         L5TBIN    55
     O                         L5UKYY    59
     O                         L5UKMM    61
     O                         L5UKDD    63
     O                         L5UBIN    65
     O                         L5STYY    69
     O                         L5STMM    71
     O                         L5STDD    73
     O                         L5SBIN    75
     O                         L5AKI1    78
     O                         L5AKI2    82
     O                         L5AKI3    83
     O                         L5AKI4    84
     O                         L5TKR1    85
     O                         L5TKR2    87
     O                         L5TKR3    89
     O                         L5TKR4    90
     O                         L5KTEI    93
     O                         L5BMON    97
     O                         L5TAIP    98
     O                         L5MBCD   100
     O                         L5KTR1   101
     O                         L5KTR2   103
     O                         L5KTR3   105
     O                         L5KTR4   106
     O                         L5KCD1   107
     O                         L5KCD2   108
     O                         L5STI1   110
     O                         L5JOK1   112
     O                         L5JOK2   114
     O                         L5JOK3   116
     O                         L5JOK4   118
     O                         L5JOK5   120
     O                         L5JOK6   122
     O                         L5AKI5   127
     O                         L5BIK1   141
     O                         L5YOUS   145
     O                         L5HKSU   147
     O                         L5HITO   150
     O                         L5UZAR   153
     O                         L5HAK1   154
     O                         L5HAK2   155
     O                         L5SYOS   160
     O                         L5SYOT   161
     O                         L5ZMEN   162
     O                         L5SHIY   164
     O*****                    L5KALL   167
     O                         @5KALL   167
     O*****                    L5MAIS   170
     O                         @5MAIS   170
     O*****                    L5KMIN   173
     O                         @5KMIN   173
     O*****                    L5KMAX   176
     O                         @5KMAX   176
     O*****                    L5SRMS   179
     O                         @5SRMS   179
     O*****                    L5ALHK   182
     O                         @5ALHK   182
     O*****                    L5MXHK   185
     O                         @5MXHK   185
     O                                  186 ' '
     O                         L5KTSU   195
     O                         L5KSSU   204
     O                         L5KOUT   205
     O                         L5DOUT   206
     O                         L5DTKO   207
     O                         L5DTHE   208
     O*****                    L5JDMS   211
     O                         @5JDMS   211
     O                         L5KAIS   213
     O                         L5ZETI   217
     O                         L5SKCD   221
     O                         L5LTIM   224
     O                         L5KSKB   225
     O        EADD             GCMWTR
     O                                    2 'KS'
     O                         T3SKJY     3
     O                         T3SKYY     7
     O                         T3SKMM     9
     O                         T3SKDD    11
     O                         T3KOYY    15
     O                         T3KOMM    17
     O                         T3KODD    19
     O                         T3KOHH    21
     O                         T3KOSS    23
     O                         T3KOME    33
     O                         T3KCD1    34
     O                         T3KCD2    35
     O                         T3NAMN    55
     O                         T3NAMK    75
     O        EADD             AATWTR
     O                                    2 'BM'
     O                         DCSKJY     3
     O                         DCSKYY     7
     O                         DCSKMM     9
     O                         DCSKDD    11
     O                         DCKOYY    15
     O                         DCKOMM    17
     O                         DCKODD    19
     O                         DCKOHH    21
     O                         DCKOSS    23
     O                         DCKOME    33
     O                         DCBMON    37
     O                         DCTAIP    38
     O                         DCNAMN    58
     O                         DCNAMK    78
     O        EADD             AAAWTR
     O                                    2 'JK'
     O                         A5SKJY     3
     O                         A5SKYY     7
     O                         A5SKMM     9
     O                         A5SKDD    11
     O                         A5KOYY    15
     O                         A5KOMM    17
     O                         A5KODD    19
     O                         A5KOHH    21
     O                         A5KOSS    23
     O                         A5KOME    33
     O                         A5JOKN    35
     O                         A5KANB    36
     O                         A5JOK1    56
     O                         A5JOK2    72
     O                         A5JOKM    92
