     H            Y.
     F*** ARAR24 *******************************************
     F*     オフラインかんばん用マスターデータ作成       *
     F*         H.ITO                  1994.11.18          *
     F******************************************* ARAR24 ***
     FARAWP22 IF  F     256            DISK
     FARAWP24 O   F     256            DISK                      A
     IARAWP22 AA  01
     I                                        1 256 KDATA
     I            DS
     I                                        1  30 HDATA
     I                                        1   2 HRECD
     I                                        3   60HNKOJ
     I                                        7   8 HGRUP
     I                                        9   9 HKUBN
     I                                       10  11 HMESG
     I                                       18  250HNOHZ
     I                                       18  210HNOYY
     I                                       22  230HNOMM
     I                                       24  250HNODD
     I            DS
     I                                        1  30 @DATA
     I                                        1   2 @RECD
     I                                        3   60@KENS
     I            DS
     I                                        1 256 KDATA
     I                                        3   6 KKENS
     C                     SETOF                     16
     C                     Z-ADD0         @KENS
     C                     DO   *HIVAL
     C                     SETOF                     15
     C                     READ ARAWP22                  15
     C           *IN15     IFEQ '1'
     C           *IN16     IFEQ '1'
     C                     MOVE *BLANK    WDATA
     C                     MOVE 'EE'      @RECD
     C                     MOVEL@DATA     WDATA  30
     C                     EXSR #CALL
     C                     EXCPTEE1
     C                     END
     C                     GOTO STP1
     C                     ELSE
     C           *IN16     IFEQ '0'
     C                     SETON                     16
     C                     MOVE 'HD'      HRECD
     C                     Z-ADD0111      HNKOJ
     C                     MOVE '0A'      HGRUP
     C                     MOVE 'A'       HKUBN
     C                     MOVE '00'      HMESG
     C                     Z-ADD*DATE     HNOHZ
     C                     MOVELHDATA     WDATA
     C                     EXSR #CALL
     C                     EXCPTHD1
     C                     END
     C                     END
     C*
     C                     ADD  1         @KENS
     C                     MOVE @KENS     KKENS
     C                     MOVELKKENS     WDATA
     C                     EXSR #CALL
     C                     MOVELWDATA     KKENS
     C                     EXCPTDT1
     C                     END
     C           STP1      TAG
     C                     SETON                     LR
     C                     RETRN
     C*****************************************************************
     C           #CALL     BEGSR
     C*****************************************************************
     C                     CALL 'AZZR11'
     C                     PARM           WDATA
     C                     ENDSR
      *
     OARAWP24 EADD             HD1
     O                         WDATA     30
     O        EADD             DT1
     O                         KDATA    256
     O        EADD             EE1
     O                         WDATA     30
