     H            Y.
     FABHPP01 IP  E                    DISK
      *
     FFCEPL01 IF  E           K        DISK
      *
     FASBPP01 O   E                    DISK
      *
     C           M6SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
     C           M6STMM    IFNE 99
     C                     GOTO @END
     C                     END
     C           M6AKT1    IFNE 'SB '
     C                     GOTO @END
     C                     END
      *
     C           HINKEY    KLIST
     C                     KFLD           M6HIN1
     C                     KFLD           M6HIN2
     C                     KFLD           M6HIN3
      *
     C                     Z-ADD0         J1TANJ
     C           HINKEY    CHAINFCEPL01              77
     C           *IN77     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C                     SETON                     77
     C                     END
     C           *IN77     IFEQ '0'
     C                     Z-ADDA2KASI    J1TANJ
     C                     END
      *
     C                     EXSR #OUT
      *
     C           @END      TAG
      *
     C           #OUT      BEGSR
     C                     MOVE M6ZETI    J1ZETI
     C                     MOVE M6HIN1    J1SHN1
     C                     MOVE M6HIN2    J1SHN2
     C                     MOVE M6HIN3    J1SHN3
     C                     Z-ADDM6SYUY    J1NSYU
     C                     MOVE M6HSYU    J1NHKS
     C                     MOVE 'A'       J1KDAI
     C                     MOVE *BLANK    J1KSYO
     C                     MOVE M6JBN1    J1NBN1
     C                     MOVE M6JBN2    J1NBN2
     C                     MOVE M6JBN3    J1NBN3
     C                     MOVE M6JBN4    J1NBN4
     C                     WRITEASBPP011
     C                     ENDSR
      *
