     H            Y.
     F******************************************************
     F* SB-KRO MASTER FROM CADPP01
     F*    T.SAKAKI   2020.09.21
     F******************************************************
     FCADTL03 IP  E                    DISK
      *
     FFCEPL01 IF  E           K        DISK
      *
     FASBPP01 O   E                    DISK
      *
     E                    C2KO       10  3
      *
     I            DS
     I                                        1  30 C2KO
     I                                        1   3 C2KOT1
     I                                        4   6 C2KOT2
     I                                        7   9 C2KOT3
     I                                       10  12 C2KOT4
     I                                       13  15 C2KOT5
     I                                       16  18 C2KOT6
     I                                       19  21 C2KOT7
     I                                       22  24 C2KOT8
     I                                       25  27 C2KOT9
     I                                       28  30 C2KOTA
      *
      *
     C           C2SKJY    IFEQ 'D'
     C                     GOTO @END
     C                     END
     C           C2STMM    IFNE 99
     C                     GOTO @END
     C                     END
     C*
     C                     MOVEL*BLANK    WPROC   3
     C           'SB '     LOKUPC2KO                     83
     C           *IN83     IFEQ *OFF
     C                     GOTO @END
     C                     END
     C*
     C           HINKEY    KLIST
     C                     KFLD           C2SHN1
     C                     KFLD           C2SHN2
     C                     KFLD           C2SHN3
      *
     C                     Z-ADD0         J1TANJ
     C           HINKEY    CHAINFCEPL01              77
     C           *IN77     IFEQ '0'
     C           A2GSKD    ANDEQ'D'
     C                     SETON                     77
     C                     END
     C           *IN77     IFEQ '0'
     C                     Z-ADDA2KASI    J1TANJ
     C                     END
      *
     C                     EXSR #OUT
      *
     C           @END      TAG
      *
     C           #OUT      BEGSR
     C                     MOVELC2ZETI    J1ZETI
     C                     MOVELC2SHN1    J1SHN1
     C                     MOVELC2SHN2    J1SHN2
     C                     MOVELC2SHN3    J1SHN3
     C                     Z-ADDC2SYOS    J1NSYU
     C                     MOVELC2SYOT    J1NHKS
     C                     MOVELC2KCD1    J1KDAI
     C                     MOVELC2KCD2    J1KSYO
     C                     MOVELC2TKR1    J1NBN1
     C                     MOVELC2TKR2    J1NBN2
     C                     MOVELC2TKR3    J1NBN3
     C                     MOVELC2TKR4    J1NBN4
     C                     WRITEASBPP011
     C                     ENDSR
      *
