     H            Y.
     F*** ASSR01 ****************************
     F*  内示データ累積ファイル再編成     *
     F*  納入数設定ファイル再編成         *
     F*  設定数予想３か月ファイル再編成   *
     F*       H.ITO          87.05.18       *
     F**************************** ASSR01 ***
     FABBPP01 IF  E                    DISK
     FABBPP11 IF  E                    DISK
     FABBPP21 IF  E                    DISK
     FABBPP31 IF  E                    DISK
     FASSWP0A O   E                    DISK
     FASSWP0B O   E                    DISK
     FASSWP0C O   E                    DISK
     FASSWP0D O   E                    DISK
     C           *ENTRY    PLIST
     C                     PARM           PHIZ    8
     C                     PARM           PFILE   7
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
     C                     MOVELPHIZ      WHIZ    60
      *
     C*-------------------*
     C*   ...ABBPP01...   *
     C*-------------------*
     C           PFILE     IFEQ 'ABBPP01'
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ ABBPP011                 01
     C           *IN01     IFEQ '1'
     C                     MOVE WKENS     PKENS
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ADD  1         WKENS
     C                     WRITEASSWP0A1
     C                     END
     C                     END
      *
     C*-------------------*
     C*   ...ABBPP11...   *
     C*-------------------*
     C           PFILE     IFEQ 'ABBPP11'
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ ABBPP111                 01
     C           *IN01     IFEQ '1'
     C                     MOVE WRECD     PRECD
     C                     MOVE WKENS     PKENS
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ADD  1         WRECD   70
     C           Q6NTYM    IFGT WHIZ
     C                     ADD  1         WKENS   70
     C                     WRITEASSWP0B1
     C                     END
     C                     END
     C                     END
      *
     C*-------------------*
     C*   ...ABBPP21...   *
     C*-------------------*
     C           PFILE     IFEQ 'ABBPP21'
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ ABBPP211                 01
     C           *IN01     IFEQ '1'
     C                     MOVE WRECD     PRECD
     C                     MOVE WKENS     PKENS
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ADD  1         WRECD
     C           U1NTYM    IFGT WHIZ
     C                     ADD  1         WKENS
     C                     WRITEASSWP0C1
     C                     END
     C                     END
     C                     END
      *
     C*-------------------*
     C*   ...ABBPP31...   *
     C*-------------------*
     C           PFILE     IFEQ 'ABBPP31'
     C                     DO   *HIVAL
     C                     SETOF                     01
     C                     READ ABBPP311                 01
     C           *IN01     IFEQ '1'
     C                     MOVE WRECD     PRECD
     C                     MOVE WKENS     PKENS
     C                     SETON                     LR
     C                     RETRN
     C                     END
     C                     ADD  1         WRECD
     C           U2NTYM    IFGT WHIZ
     C                     ADD  1         WKENS
     C                     WRITEASSWP0D1
     C                     END
     C                     END
     C                     END
