     H            Y.
     F** ATAR92 ********************************************
     F*  確定発注累積INZ (BY MONTH(DELETE AH#PP31)       *
     F*                                                    *
     F*  TCHK1 04/05/07 CREATE(COPY FROM ATAR90)           *
     F******************************************** ATAR92 **
     FAH#PP31 IP  E                    DISK
     FAH#WP31 O   E                    DISK
     I            DS
     I                                        1   80CFSKHZ
     I                                        1   40CFSKYY
     I                                        5   60CFSKMM
     I                                        7   80CFSKDD
     I            DS
     I                                        1   40CFSYYY
     I                                        5   60CFSYMM
     I                                        7   80CFSYDD
     I                                        9  100CFSYBB
     I                                        1  100MKOTEI
     I            DS
     I                                        1   80CFHTHZ
     I                                        1   40CFHTYY
     I                                        5   60CFHTMM
     I                                        7   80CFHTDD
     I            DS
     I                                        1  100WYMD
     I                                        1   80@YMD
     I                                        9  100@BB
     C           *ENTRY    PLIST
     C                     PARM           PARM1  10
     C                     PARM           PRECD   7
     C                     PARM           PKENS   7
     C                     MOVE PARM1     WYMD
      *
     C                     ADD  1         WRECD   70
      *
     C           CFSKJY    IFEQ 'D'
     C           CFSKHZ    ANDLE*DATE
     C                     GOTO END
     C                     END
      *
     C*          CFHTHZ    IFLE @YMD
     C*                    GOTO END
     C*                    END
      *
     C           MKOTEI    IFEQ *ZERO
     C                     ADD  1         WKENS   70
     C                     WRITEAH#WP311
     C                     GOTO END
     C                     ELSE
      *
     C           MKOTEI    IFGT WYMD
     C                     ADD  1         WKENS   70
     C                     WRITEAH#WP311
     C                     GOTO END
     C                     END
     C                     END
      *
     C*=== ﾃcﾌﾞb mﾞｰj ﾈﾛhn
     C*    vﾉc hﾎﾞ] BLANK
     C           CFTBMN    IFEQ 8907
     C           CFMNKB    ANDNE'@'
     C                     ADD  1         WKENS   70
     C                     WRITEAH#WP311
     C                     END
     C           END       TAG
      *
     CLR                   MOVE WRECD     PRECD
     CLR                   MOVE WKENS     PKENS
