     H             Y
     F*** ATAR55 ***********************************************
     F*PLATING FACTORY ACCNT RCVABLE DETAILED STATEMENT UNIT PRICE NOT IPUT LIST
     F* PROGRAM-ID. : ATAR55 <RPG>                             *
     F* CREATE DATE. : MAY.16.'1994.                           *
     F* AUTHOR.           : SHINICHIRO.OHTAKE                  *
     F* USER SECTION. : PLAYTING FACTORY                       *
     F*********************************************** ATAR69 ***
     FATAWP56 IP  F     100            DISK
     FATAPR55 O   E             95     PRINTER
     IATAWP56 AA  01
     I                                        1   4 WZENO
     I                                        5  11 WSYR
     I                                       12  16 WHIN1
     I                                       17  21 WHIN2
     I                                       22  23 WHIN3
     I                                       24  312WKEIGR
     I            DS
     I                                        1  12 WHIN
     I                                        1   5 WHIN1
     I                                        6  10 WHIN2
     I                                       11  12 WHIN3
     **
     C*
     C**********************
     C*見出し処理        *
     C**********************
     C           *IN50     IFEQ '0'
     C                     WRITEATAPR551
     C                     SETON                     50
     C                     GOTO STEP
     C                     END
     C*
     C           *IN95     IFEQ '1'
     C                     WRITEATAPR551
     C                     SETOF                     95
     C                     END
     C*
     C**********************
     C*明細処理          *
     C**********************
     C           STEP      TAG
     C                     MOVE WZENO     PZENO
     C                     MOVE WSYR      PSYR
     C                     MOVE WHIN1     PHIN1
     C                     MOVE WHIN2     PHIN2
     C                     MOVE WHIN3     PHIN3
     C                     MOVE WKEIGR    PKEIGR
     C           WHIN3     IFEQ *BLANK
     C                     SETON                     10
     C                     END
     C*
     C                     WRITEATAPR552
     C                     ADD  WKEIGR    TKEIGR
     C                     SETOF                     10
     C*
     C**********************
     C*終了              *
     C**********************
     CLR                   WRITEATAPR553
     CLR                   RETRN
